{
 "name": "Jedgar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "35 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 5 ABY and 11 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.3 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Dark Force",
      "Galactic Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kadann"
     ]
    }
   ]
  }
 ],
 "content": "Jedgar was a Jedi youngling who joined Dark Jedi Kadann and became a Prophet of the Dark Side.\nJedgar started his life as a Jedi youngling in the Jedi Temple on Coruscant. While there, he was troubled by his dark dreams which had a frightening habit of coming to pass. He had many nightmares of the Clone Wars and Great Jedi Purge long before they even happened. Though he was filled with a talent for foreseeing the future, Jedgar frightened all the other students and couldn't find a single Jedi Knight or Master who would even accept him as a Padawan and start training him. When his thirteenth birthday came in 23 BBY he was assigned to the Agricultural Corps, but he refused to accept such a menial occupation and fled the Jedi Order forever to follow his dreams to the dark side of the Force.\nSome years later, Jedgar was still following his vision when they led him to Dark Jedi Kadann, a former Jedi Knight who had also left the Order for his own reasons. The conversation the two had was brief: \"I foresaw this meeting,\" Kadann stated, \"So did I,\" replied Jedgar. Ever since then, Kadann was the master and Jedgar the apprentice. While his primary use was helping Kadann understand the motion of the future with his dark musings, he also served as the dwarf's bodyguard. The later post was more for show than anything else, as Kadann was more than capable of protecting himself from any and all danger.\nWhen Darth Sidious appointed Kadann the title of Supreme Prophet of the Dark Side, Jedgar followed him and was given the title of High Prophet and effectively became the second in command of the prophets. When the Galactic Empire reached its height of power, Kadann and Jedgar led the Prophets of the Dark Side in advising the Emperor with their omens and predictions. Everything was fine until Kadann saw a future which agreed with Sidious's own vision: that Luke Skywalker would defeat him and the Empire would come to an end. Even so, Kadann was their leader and the most powerful among them and so they trusted his visions. Many of the Prophets, Jedgar included, agreed to follow him into hiding on the planet Bosthirda and from their secret temple they watched as the Emperor was defeated and the Empire destroyed, bringing back balance to the Force just as Kadann had predicted.\nFollowing the Battle of Endor, Imperial Intelligence created a group of false Prophets, including a false Jedgar also laying claim to the title of High Prophet. The true Jedgar saw these lies and falsehoods in his dark visions, but Kadann refused to allow him to leave Bosthirda to do anything about it. \"Let them pretend, their false prophecies will not come to pass, and the time is not yet right for the true Prophets to appear,\" was all he said in regards to them. This did not stop Jedgar entirely, however, as he would often pose as a roaming evil Jedi, training any Force-users he met and tempting them with the quick, easy path of the dark side. Anyone who refused this training would become his obstacles who had to be eliminated. This did not mean that he dealt with them immediately, however, often appearing at just the wrong moment to deal his vengeance.\nAt about the same time as the false Kadann laid claim to being the Emperor, Jedgar was in the middle of one of his schemes. He planned to infiltrate a New Republic base by having a group of Imperial agents who worked for him chase him into the arms of a Republic group. After this, he would gain their trust so that they would lead them into the Republic base. Once he learned the location of the base, and gathered a substantial amount of information, he would leave and return with enough forces to capture or destroy the base and all its occupants. This entire plan was designed purely so that he could gain Force-sensitive individuals to train. It is unknown whether or not this plan succeeded. Jedgar met his death either by the vengeance of Azrakel when he returned to destroy the prophets or by Carnor Jax and Lumiya when they returned moments later after Azrakel's death to finish what he started.\nJedgar was the most ambitious of all Prophets, and simply wanted power. Unlike the Supreme Prophet Kadann, however, he was not content to wait to receive this power, he wanted it immediately. He was a stereotypical Dark Jedi, and would use any method or plan that got him closer to his goal no matter what the consequences were. He hated the fact that Kadann was more powerful than him, but resigned to the fact that there was nothing he could do about it as he was not willing to openly oppose the Supreme Prophet.\nJedgar was arrogant, cruel, and impatient, often moving to quickly against his enemies when it would be best to hold back and study them. This has led to many mistakes which have cost him much over the years. Once his victory was in sight, he would leap to grab it before all of his plans had played out which would often cause him to suffer further defeat.\nHe relished his dark side abilities, and was not afraid to use them often. His favorite tactic was to create whole armies of Force Wraiths and send them against his enemies, though he was not opposed to also drawing his lightsaber and joining the fight personally when the chance arose.\nJedgar was an extremely tall and thin man, with a bald head, bearded chin, and hooded eyes. As with all other Prophets of the Dark Side, he wore the traditional star-covered robes which looked like they'd been spun from a piece of deep space. The only physical weapon he had was his lightsaber which he always carried with him and never hesitated to use. It was characterized by its sickly glowing green blade and an electronic hum which sounded like a swarm of angry rage-stingers. He was also known to keep hssiss nearby to mute his presence in the Force.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Prophets_of_the_Dark_Side",
  "/wiki/Heingort_Giddis",
  "/wiki/35_BBY/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dark_Force",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kadann",
  "/wiki/Jedi/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Birthday/Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Agricultural_Corps/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/High_Prophet",
  "/wiki/Merili",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Prophet",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Bosthirda/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Azrakel",
  "/wiki/Carnor_Jax",
  "/wiki/Lumiya",
  "/wiki/Force_Wraith",
  "/wiki/Lightsaber/Legends",
  "/wiki/Hssiss",
  "/wiki/Polyhedron",
  "/wiki/Prophets_of_the_Dark_Side:_Villains_for_the_Star_Wars:_New_Republic_Campaign,_Part_One",
  "/wiki/Polyhedron_103",
  "/wiki/Dangers_from_the_Dark_Side:_Villains_for_the_Star_Wars:_New_Republic_Campaign,_Part_Two",
  "/wiki/Polyhedron_104",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/StarWars.com",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Academy_Training_Manual"
 ]
}