{
 "name": "Jedi_Master_(individual)",
 "display_name": "Jedi Master  (individual)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "This Jedi Master was one of the first members of Luke Skywalker's New Jedi Order.\nIn 14 ABY, the Jedi Master was among the first of the New Jedi Order to reach that prestigious rank; furthermore, he was one of the six Jedi who were assigned students by Master Skywalker to train to Knighthood, in a practice mirroring the Master/Padawan system of old. Later that same year he was a member of the strike force of Jedi Knights that traveled to Korriban to prevent the Disciples of Ragnos from resurrecting their namesake.\nWhen Jaden Korr reached the stairway that led to the Tomb of Marka Ragnos, the individual known as \"Jedi Master\" was opposing some stormtroopers, a New Reborn, and a couple of Sith Cultists. It is unknown whether the individual survived the battle.\nThe Jedi Master wielded a saberstaff, a rarity among members of the New Jedi Order. It had a vindicator-style hilt and green blades.\nThe Jedi Master was a character in the video game Star Wars: Jedi Knight: Jedi Academy. He was voiced by Dominic Armato and Dee Bradley Baker.\nIn addition to being used for the original character described above, the Jedi Master's skin was also used as a stand-in for pre-established Jedi for whom a unique skin was unavailable. Corran Horn, possibly Tionne and Streen are all represented by the Jedi Master skin during cutscenes.\nIt is possible for the Jedi Master to survive the battle if the player helps him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/14_ABY/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Korriban",
  "/wiki/Battle_of_Korriban_(Disciples_of_Ragnos_crisis)",
  "/wiki/Disciples_of_Ragnos",
  "/wiki/Marka_Ragnos",
  "/wiki/Jaden_Korr",
  "/wiki/Tomb_of_Marka_Ragnos",
  "/wiki/Stormtrooper/Legends",
  "/wiki/New_Reborn",
  "/wiki/Sith_Cultist",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy",
  "/wiki/Dominic_Armato",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Corran_Horn",
  "/wiki/Tionne_Solusar",
  "/wiki/Streen"
 ]
}