{
 "name": "Jedi Trainer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "The Jedi Trainer was among the first members of Luke Skywalker's New Jedi Order.\nThe Jedi Trainer was an instructor at the Academy on Yavin 4 by at least 12 ABY. Later that same year he fought alongside Kyle Katarn to defend the Praxeum from an assault by the Dark Jedi Desann and his Reborn.\nThe Jedi Trainer was among the six knights and masters assigned initiates to train to Knighthood by Master Skywalker. Later that year he was among the Jedi sent to Korriban to prevent Tavion Axmis's Sith cult from resurrecting Marka Ragnos. He accompanied Jaden Korr and several other knights into the catacombs before the group split up; by the time Jaden emerged into the Valley of the Dark Lords, he had made his way to the top of a large stone monument where he single-handedly engaged a pair of Reborn. It is not known if he survived this battle.\nThe Jedi Trainer was a skilled duelist, preferring to wield a pair of purple-bladed lightsabers in the Jar'Kai fashion. Two years after attaining the rank of knight, he crafted a lightsaber similar to the lightsaber that he wielded during the battle of Yavin IV.\nIn Star Wars: Jedi Knight II: Jedi Outcast there are multiple Jedi Trainer NPCs, since there was only a pool of three unique Jedi skins to draw from. Three can be seen in the map yavin_temple, and also three in the map yavin_courtyard  . In Star Wars: Jedi Knight: Jedi Academy, however, the Jedi Trainer is treated as an individual character; only one NPC is present in any one level. Because of this, it can be assumed that only one of the Jedi Trainer NPCs seen in Jedi Outcast is the actual \"Jedi Trainer,\" with the others merely placeholders for unknown Jedi.\nIn Jedi Outcast, the Jedi Trainer was voiced by Milton James; in Jedi Academy, his voice was provided by Cam Clarke.\nThe first screenshots of the game  show the Jedi Trainer battling Kyle Katarn on Kejim and wielding a red lightsaber, at that time causing many fans to believe he was a Dark Jedi and Kyle's rival in the upcoming game.\nIf the player helps the Jedi Trainer out in his predicament, then it guarantees his survival.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Desann",
  "/wiki/Reborn",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Korriban",
  "/wiki/Battle_of_Korriban_(Disciples_of_Ragnos_crisis)",
  "/wiki/Tavion_Axmis",
  "/wiki/Disciples_of_Ragnos",
  "/wiki/Marka_Ragnos",
  "/wiki/Jaden_Korr",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Battle_of_Yavin_4_(Empire_Reborn)",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy",
  "/wiki/Cam_Clarke",
  "/wiki/Kejim"
 ]
}