{
 "name": "Jedselk",
 "display_name": "Jedselk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Jedselk was a Human male who served as an Imperial governor during the Galactic Civil War.\nIn the time after the Battle of Yavin, he held the title of planetary governor of Sellasas, during which time the Rebel Alliance besieged the planet for several weeks. His daughter, Commander Amara Jedselk, was second-in-command of the planetary army garrison at the time. Soon after the conflict on Sellasas, Jedselk was promoted to governorship of Dolla.\nDuring the siege on Sellasas, Jedselk's daughter Amara had saved the life of a Srrors'tok, to whom she gave the adoptive name of Tyionsis Cex. Governor Jedselk capitalized on Cex's life debt to and personal feelings toward Amara, as well as his hatred for the Rebel Alliance, persuading him to become an Imperial bounty hunter in exchange for his patronage. As governor of Dolla, Jedselk used his influence to smooth over any local unrest caused by Cex's actions while pursuing bounties.\nIn Galaxy Guide 10: Bounty Hunters, Jedselk is described as being \"recently promoted to the governorship of Dolla\". It was unclear as to whether this referred to a star system named Dolla, or merely a planet by the same name. As a result, it remains unclear as to whether Jedselk was promoted to the position of governor over an entire system, or merely to a planetary governorship of a more prominent planet. When The Essential Atlas was published, the existence of the Dolla system was verified, though whether a planet named Dolla exists in the system is still open to conjecture.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Planetary_Governor/Legends",
  "/wiki/Sellasas",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Siege_of_Sellasas",
  "/wiki/Commander/Legends",
  "/wiki/Amara_Jedselk",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Dolla_system",
  "/wiki/Srrors%27tok",
  "/wiki/Tyionsis_Cex",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/The_Essential_Atlas"
 ]
}