{
 "name": "Jeela_Brebtin",
 "display_name": "Jeela Brebtin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Dark Squadron",
      "Squadron Five",
      "Imperial Navy's officer corps",
      "Dark Squadron",
      "Squadron Five"
     ]
    }
   ]
  }
 ],
 "content": "Jeela Brebtin was a human female who served as a TIE fighter pilot in the Galactic Empire. A lieutenant, she served in Dark Squadron as Dark Two, under the command of Dark One Beilert Valance, between 3 ABY and 4 ABY. The squadron, flying TIE defenders, attacked the Imperial light cruiser Forerunner II near the Eriadu system to eliminate the alleged Crimson Dawn mole Tarl Sokoli.\nBrebtin later became part of Squadron Five of the Empire's 204th Imperial Fighter Wing, holding the rank of senior lieutenant by that point. Around 4 ABY, she assisted in a mission to the Kudo system, where the squadron lost its carrier and was captured by rogue Imperials. Their leader, Admiral Gratloe, offered them a place in his sect, but the squadron instead escaped captivity and fled the system on Gratloe's Star Destroyer.\nHaving lost two pilots in the Kudo system, Brebtin and her squadron received two Imperial cadets as replacements and set off on a new mission to destroy a mobile rebel recruitment base. The squadron assisted TIE bombers in an attack on the mobile base, fighting off T-65B X-wing starfighters until they were able to destroy the target. Afterwards, Brebtin and her comrades learned of the death of Emperor Palpatine in a major battle.\nDuring time of the Galactic Empire, Jeela Brebtin served in the Empire's starfighter corps as an Imperial Starfighter Pilot, serving in several squadrons and eventually holding the rank of lieutenant. Between 3 ABY and 4 ABY, she was a member of the Empire's Dark Squadron, which comprised of TIE defenders, and used the callsign \"Dark Two.\" Reporting to the Sith assassin Ochi of Bestoon, the squadron was stationed aboard the Executor-class Star Dreadnought Executor, the flagship of the Sith Lord Darth Vader. The cyborg Beilert Valance was placed in command of the squadron as \"Dark One,\" having been captured by Vader and forced into service by the Sith Lord.\nDark Squadron was tasked with the elimination of Admiral Tarl Sokoli, an Imperial war hero who had allegedly been recruited by the criminal syndicate Crimson Dawn to be a mole for them. The squadron, formed of five pilots, approached Sokoli's light cruiser, the Forerunner II, outside the Outer Rim Territories' Eriadu system. While Valance ordered his pilots to immediately attack, Brebtin was worried that it would break their element of surprise in case Soloki had not caught onto the attack yet. Valance insisted with his plan, suspecting that the rogue general already knew, and Dark Squadron moved in on incoming TIE fighters being deployed by the Forerunner II.\nDark Squadron engaged the TIE fighters, destroying multiple in the ensuing dogfight. Brebtin pointed out to Valance that their immediate attack was not standard Imperial procedure. Her superior took the comment as a complement, replying that Imperial personnel like her were meant to follow orders. When \"Dark Three\" was tailed by an enemy TIE fighters, Brebtin shot down the pursuer, telling her comrade to stop whining. Dark Three thanked their rescuer, using Brebtin's name. The lieutenant subsequently told the pilot to use her callsign or she would shoot them. Shortly after Dark Three was killed by the Forerunner II's cannonfire, \"Dark Four\" questioned where the Empire had found \"Dark Five,\" who was iterating the words \"kill.\"\nBrebtin told Dark Four to focus on the battle, the latter pilot apologizing and then correcting themself when they called the lieutenant by her name. Dark Four then argued with Valance before the pilot fell to enemy TIEs. With three of Dark Squadron left, Brebtin asked her commander what the plan was, to which Valance wished to board the Forerunner II himself to reach Sokoli. The lieutenant, thinking he was going in via the cruiser's hangar, told him he would die. Valance, though, had a difference idea, and crashed his TIE defender into the Forerunner II's bridge. Brebtin was doubtful her the squadron commander could have survived the crashed, but was surprised to find him contacting her not long after, confirming that he had killed Sokoli and asking for a lift.\nBrebtin was soon promoted to senior lieutenant and joined Squadron Five of the Empire's 204th Imperial Fighter Wing, stationed aboard the Imperial I-class Star Destroyer Pursuer. Squadron Five, flying TIE interceptors, was being rebuilt under Second Lieutenant Commander Teso Broosh after it had suffered severe casualties in the Lyjdaa system. Prior to one of newly built squadron's missions Brebtin used the shooting range aboard the Pursuer. Broosh entered the room and asked permission to join her, implying he wanted to talk about the upcoming mission.\nBrebtin believed Broosh was going to inform her that she was not joining the mission, adding that her former squadrons had not see her as a good fit. Broosh, though, informed the senior lieutenant that he had also had trouble fitting in, assuring her that the choice to serve the Empire was made every member of the squadron fit in. Understanding his point, Brebtin challenged her squadron commander to a friendly target practice competition. Brebtin and her squadron took part in a skirmish against a Rebel Alliance cell. Brebtin and her fellow pilots massacred the rebel starfighters, ensnaring the final one into Brebtin's firing line before it could escape into hyperspace, while the Pursuer destroyed at least one vessel, a EF76 Nebulon-B escort frigate.\nAfter the pilots returned to the Star Destroyer, Lieutenant Lyttan Dree complemented Brebtin's shooting, though she bluntly stated that it was the point of her maneuver. As other members of the squadron conversed, Broosh informed them that they were to report to Colonel Shakara Nuress, the 204th's commanding officer, to get briefed on their next mission. At the Pursuer's tactical centre, Nuress informed Brebtin and other members of Squadron Five about a pending operation which involved a largescale movement of military assets within the Empire. She then summarized the squadron's new mission, to escort the Quasar Fire-class cruiser-carrier Summit to the Inner Rim Territories' Kudo system to deliver a maintenance crew to the Imperial II-class Star Destroyer Celerity, which had reported hyperdrive issues.\nBrebtin and the rest of Squadron Five were stationed on the Summit while it traveled to the Kudo system. While onboard, she joined some of her squadronmates, Dree, Flight Officers Zin Graw and Ganem Kahi, and two others, in the mess hall to eat. Graw and Kahi discussed rumors that the war was almost over, the latter acknowledging that some rebels may have legitimate reasons to fight. Brebtin warned Kahi that others could be listening to his statements, the flight officer clarifying that his point was that the rebels had started the war. After her meal, the lieutenant went to the Summit's shooting range for some target practice.\nThe Summit arrived in the Kudo system, deploying Brebtin, Broosh, Dree, Graw and Kahi in their TIE interceptors to inspect the Celerity. The Star Destroyer, though, disabled the cruiser-carrier with an ion cannon and deployed its TIE fighters to destroy Squadron Five. Broosh ordered his squadron to execute a fell swoop formation and protect the Summit, and Brebtin and her comrades engaged the swarm of incoming TIEs, the senior lieutenant commenting to the squadron leader that the odds were not in their favor. The Celerity demanded for the squadron and the Summit to surrender, but the carrier's captain refused and attempted to have his cruiser retreat.\nThe Celerity then destroyed the Summit. Broosh thus announced Squadron Five's surrender to the enemy, much to the surprise of Brebtin and the others. The second lieutenant commander led his squadron down to the planet Kudo, where they landed at mining facility. Disembarking, the pilots were met with a force of stormtroopers, who demanded they surrendered their weapons and explained that they were not rebels, but no longer Imperials either. After one trooper informed them that Admiral Gratloe would give them an explanation, Dree found it funny that Gratloe was keeping his admiral rank after going rogue, Brebtin finding it strange.\nBrebtin and the other Squadron Five members were stun cuffed and gathered before Gratloe, who commended the pilots' flying skills. The admiral revealed that his intentioned were not about choosing a side between the Rebellion and the Empire, but surviving the war that both had brought. Gratloe believed that controlling Kudo's mining operations was a worthy repayment for giving his life to the Empire, Brebtin claiming that he could not have given his life if he was not dead. Ignoring the senior lieutenant's comment, the admiral offered the squadron a place under him. Kahi and Graw called him corrupt, but Broosh, intending to earn Gratloe's trust, asked that they could have time to discuss the opportunity.\nUnder Gratloe's orders, a stormtrooper took Squadron Five into another room and close the door. Kahi believed that Broosh was getting ready to join the rogue Imperials, but the squadron commander silenced him and gave Brebtin the go ahead to retrieve a knife hidden in her boot. The senior lieutenant pulled the knife out while Broosh cleared up his intentions with Kahi, apologizing that she did not bring weapons for the rest of the squadron. After the pilots freed themselves from their cuffs, Broosh told the stormtrooper guard that he had convinced his squadron to join Gratloe. Glad of their alleged coming-around, the trooper opened the door, only for Brebtin to stick her knife into their neck.\nThe squadron members made their way back to the landing field with their TIE interceptors, acquiring weapons along the way. They attacked the stormtroopers on guard, Brebtin slashing one with her knife despite being told to only stun. When stormtrooper reinforcements arrived, Broosh stopped Brebtin from opening fire on them and convinced most of the troopers to let betray Gratloe and allow the squadron to flee Kudo on their interceptors. Squadron Five then flew for the Celerity, being met by its complement of TIE fighters. The Celerity's TIEs informed the squadron that they had cut their allegiances with Gratloe, and that a mutiny was taking place on the Star Destroyer as a result.\nAs Squadron Five made for the Celerity with their newfound support, they were surprise attacked by forces of the Rebel Alliance, whom Gratloe had agreed to sell the Star Destroyer to. Dree was immediately shot down, to his comrades' shock, and the force of TIEs begun battling the new arrivals. The Imperial forces soon became overwhelmed by the shear numbers the Rebellion had brought, Broosh directing his squadron away to the Celerity while the other TIEs covered their retreat. As Graw assisted Kahi when his fighter was hit, the latter said it was why he loved her, Brebtin calling the comments inappropriate.\nThree X-wings engaged the squadron, which took evasive maneuvers to continue towards the Celerity. However, Graw was lost in the ensuing skirmish before the remaining two rebel fighters broke off. The remainder of Squadron Five then made it aboard the Star Destroyer, finding that it had been liberated from Gratloe's loyalists. After Broosh ordered the vessel's personnel to escape into hyperspace, Brebtin assured Kahi that Graw would be happy they completed their mission. The Celerity made its escape from the Kudo system thereafter.\nAfter returning to the Pursuer the remaining pilots of Brebtin, Broosh and Kahi met with Colonel Nuress, who brought news that the Imperial Security Bureau had discovered that Graw had been communicating with the Rebel Alliance. Kahi was in denial and outrage at the revelation and Brebtin chimed in that the late pilot had sacrificed herself to help the rest of the squadron escape. Regardless of the comments from the trio, Nuress further revealed that Graw's contact with the Alliance meant that the Empire had been able to locate a mobile rebel recruitment base, giving Brebtin and her comrades the job of helping destroy it.\nWith a new mission at hand, the three pilots traveled on another Quasar Fire-class cruiser-carrier, first to retrieve two new pilots to replace the loss of Dree and Graw. The cruiser-carrier stopped above the Ryleel Imperial Base at the Colonies planet Carida to retrieve the recruits. As the trio waited, Kahi questioned which Imperial unit the new additions were being pulled from, Brebtin guessing the 85th. The new pair then arrived, being Bansu Ro and Rac Syrmo, two Imperial cadets from the Carida Academy. Broosh was unimpressed and went to speak with the cadets himself. Afterwards, Brebtin joined Kahi at the carrier's shooting range. When Kahi said he did not want to talk, the senior lieutenant replied that he should not talk while shooting.\nBroosh gave a mission briefing to Brebtin and the rest of Squadron Five, detailing a plan to hit the rebel recruitment base fast and hard, targeting the vessel's hyperdrive first. Afterwards, the Quasar Fire-class cruiser-carrier arrived before the mobile recruitment base, a GR-75 medium transport, and Brebtin and her comrades were deployed with a complement of TIE bombers. As Squadron Five dealt with the transport's hyperdrive, a forces of rebel X-wings came into play, engaging the Imperial attackers. Syrmo pursued one rebel fighter that was pursuing a bomber, accidentally causing it to crash into the bomber. Brebtin told the cadet to not take shots if he did not see the whole picture.\nBrebtin herself locked onto three X-wings, destroying one and pursuing another straight afterwards. As the battle continued, Kahi intended to make a risky attack on the rebel recruitment base. Broosh, though, insisted that the squadron did their attack together and not risk Kahi's loss. Brebti agreed, adding that the squadron protected each other, calling it the best team she had been on. Squadron Five came into formation and destroyed the last of the X-wings, joining the bombers in a final attack run on the mobile recruitment base. The GR75 was destroyed thereafter, Brebtin and her comrades returning to their cruiser-carrier.\nShortly after Squadron Five disembarked onto the Quasar Fire-class cruiser-carrier, an announcement about a major engagement between the Alliance and the Empire, which had led to the destruction of the DS-2 Death Star II Mobile Battle Station with Emperor Palpatine himself having been on board. Brebtin asked Broosh what they should do, the squadron commander concluding that they should wait for new order, proclaiming that they were still pilots of the 204th with a command structure above them.\nSquadron Five eventually returned to the rest of the 204th, with the Emperor's death came chaos for the Empire as Imperial worlds began to fall to the Alliance, which reorganized into the New Republic. After two weeks on the run, the fighter wing took part in the genocidal campaign known as Operation: Cinder before eventually using the Outer Rim's Pandem Nai system as a base of operations. A New Republic battle group then drove the 204th from the system in a crippling attack which saw the loss of Nuress and the already crippled Pursuer. Afterwards, the fighter wing worked to rebuild again under the leadership of Major, later Colonel, Soran Keize before battling the same battle group at the Deep Core's Cerberon system.\nIn 5 ABY, the 204th began another genocidal campaign on behalf of the Empire's loyalist forces against rogue Imperial factions, with the bulk freighter Yadeez beings its newest flagship. Following the attack on the Inner Rim planet Fedovoi End, Brebtin joined the other 204th pilots in celebrating the late Nuress's birthday, which used the Feast of Lord-Protector Jarmanidath as a front. Shortly after, the fighter wing was again pursued by the New Republic forces from Pandem Nai and the Cerberon system, which chased them through a number of systems.\nAs the 204th made its way to its next target, the Inner Rim planet Chadawa, Brebtin was chosen to be part of a separate mission, joining a team led by Lieutenant Yrica Quell to another Inner Rim world named Netalych.\nJeela Brebtin was a human female with light skin, blue eyes and long, blonde hair that was notably tied in a pony-tail. The senior lieutenant was blunt and intense with others; when Dark Three thanked her for saving him, she corrected his used of her name and threatened to kill them, and when Dree commended her shooting during a mission, she called it the point of her maneuver. Brebtin was also very conscious of regulations, repeatedly calling Beilert Valance out when his methods did not follow them, telling Dark Four to focus on the mission when they began chattering, and criticizing Ganem Kahi when he made off regulation comments.\nBrebtin was dedicated to the Empire, believing that one could not give their life for it just metaphorically. While she had struggled to fit in with various squadrons, she came to believe in being serving her squadronmates in order to maintain a functioning unit. After Zin Graw's death, Brebtin tried to give her condolences to Kahi, who cared about the fallen pilot very much. The senior lieutenant was also ruthless in combat, slashing a stormtrooper with her knife despite being told to only stun and having to be told to stand down by Broosh when she readied a blaster to engage some stormtroopers.\nBrebtin was a talented pilot able to pull of skilful maneuvers. She was crack shot with a blaster and could best others like stormtroopers in hand to hand combat with a knife. The senior lieutenant approached targets with a perspective of the surroundings in order to not cause collateral damage.\nWhen flying a starfighter, Brebtin wore a black flight suit with a black-colored helmet, life support unit, and boots. Outside of flight duties, she was dressed in a grey Imperial officer's uniform. The senior lieutenant carried a knife in her boots during the mission to the Kudo system, and made use of an E-11 medium blaster rifle taken from a stormtrooper there. On Netalych, Brebtin was dressed in civilian clothing, and carried a blaster rifle and comlink.\nJeela Brebtin first appeared in first issue of the Star Wars: TIE Fighter comic series, written by Jody Houser, illustrated by Rogê Antônio and Michael Dowling, and published by Marvel Comics on April 17, 2019. Star Wars: TIE Fighter served as a crossover series with Del Rey's novel trilogy Star Wars: Alphabet Squadron, written by Alexander Freed, where Brebtin was included in the trilogy's final installment, the 2021 novel Victory's Price.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Victory%27s_Price",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Dark_Squadron",
  "/wiki/Squadron_Five_(Shadow_Wing)",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Lieutenant",
  "/wiki/Commanding_officer",
  "/wiki/Beilert_Valance",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Squadron",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Assassination_of_Tarl_Sokoli",
  "/wiki/Light_cruiser",
  "/wiki/Forerunner_II",
  "/wiki/Eriadu_system",
  "/wiki/Crimson_Dawn",
  "/wiki/Tarl_Sokoli",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Senior_Lieutenant",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Mission_to_the_Kudo_system",
  "/wiki/Kudo_system",
  "/wiki/Summit",
  "/wiki/Admiral",
  "/wiki/Gratloe",
  "/wiki/Celerity",
  "/wiki/Pilot",
  "/wiki/Imperial_cadet",
  "/wiki/Attack_on_a_rebel_recruitment_base",
  "/wiki/Rebel_recruitment_base",
  "/wiki/TIE/sa_bomber",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Battle_of_Endor",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Military_rank",
  "/wiki/Sith_assassin",
  "/wiki/Ochi",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Executor",
  "/wiki/Flagship",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cyborg",
  "/wiki/Squadron_commander",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Outer_Rim_Territories",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Dark_Three_(pilot)",
  "/wiki/Cannon",
  "/wiki/Dark_Four_(pilot)",
  "/wiki/Dark_Five_(pilot)",
  "/wiki/TIE_line",
  "/wiki/Cruiser",
  "/wiki/Bridge_(starship)",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Pursuer",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Second_Lieutenant_Commander",
  "/wiki/Teso_Broosh",
  "/wiki/Lyjdaa_system",
  "/wiki/Skirmish_with_a_Rebel_cell",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Starfighter",
  "/wiki/Hyperspace",
  "/wiki/EF76_Nebulon-B_escort_frigate",
  "/wiki/Star_Destroyer",
  "/wiki/Lyttan_Dree",
  "/wiki/Colonel",
  "/wiki/Shakara_Nuress",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Hyperdrive",
  "/wiki/Flight_Officer",
  "/wiki/Zin_Graw",
  "/wiki/Ganem_Kahi",
  "/wiki/Ion_cannon",
  "/wiki/Carrier",
  "/wiki/Unidentified_Imperial_captain_(Summit)",
  "/wiki/Planet",
  "/wiki/Kudo",
  "/wiki/Stormtrooper",
  "/wiki/Trooper",
  "/wiki/Stun_cuffs",
  "/wiki/Knife",
  "/wiki/Boot",
  "/wiki/Interceptor",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Ryleel_Imperial_Base",
  "/wiki/Colonies",
  "/wiki/Carida",
  "/wiki/85th",
  "/wiki/Bansu_Ro",
  "/wiki/Rac_Syrmo",
  "/wiki/Carida_Academy",
  "/wiki/Cadet",
  "/wiki/GR-75_medium_transport",
  "/wiki/Transport",
  "/wiki/Bomber",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Emperor",
  "/wiki/New_Republic",
  "/wiki/Standard_week",
  "/wiki/Operation:_Cinder",
  "/wiki/Pandem_Nai_system",
  "/wiki/Barma_Battle_Group",
  "/wiki/Star_system",
  "/wiki/Attack_on_Pandem_Nai",
  "/wiki/Major",
  "/wiki/Soran_Keize",
  "/wiki/Campaign_in_the_Cerberon_system",
  "/wiki/Battle_group",
  "/wiki/Deep_Core",
  "/wiki/Cerberon_system",
  "/wiki/5_ABY",
  "/wiki/Bulk_freighter",
  "/wiki/Yadeez",
  "/wiki/Destruction_of_Fedovoi_End",
  "/wiki/Fedovoi_End",
  "/wiki/Birthday",
  "/wiki/Feast_of_Lord-Protector_Jarmanidath",
  "/wiki/Chadawa",
  "/wiki/Mission_to_Netalych",
  "/wiki/Yrica_Quell",
  "/wiki/Netalych",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Flight_suit",
  "/wiki/Helmet",
  "/wiki/Life_support",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Clothing",
  "/wiki/Blaster_rifle",
  "/wiki/Comlink",
  "/wiki/TIE_Fighter_1",
  "/wiki/Star_Wars:_TIE_Fighter_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Jody_Houser",
  "/wiki/Rog%C3%AA_Ant%C3%B4nio",
  "/wiki/Michael_Dowling",
  "/wiki/Marvel_Comics",
  "/wiki/April_17",
  "/wiki/2019",
  "/wiki/Del_Rey",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/2021",
  "/wiki/Bounty_Hunters_19",
  "/wiki/TIE_Fighter_2",
  "/wiki/TIE_Fighter_3",
  "/wiki/TIE_Fighter_4",
  "/wiki/TIE_Fighter_5",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Skystrike_Academy_Squadron_Pack",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Bounty_Hunters_18",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Shadow_Fall",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Jakku",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4"
 ]
}