{
 "name": "Jeeree Kayl",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Jeeree Kayl was a Duros male who lived in the Odionate Sith state during the Republic Dark Age. As a child, Kayl was separated from his parents and sent to live in isolation inside a bubble dome in a facility on the moon Vanahame, where all children in the Odionate were sent to be raised, to turn them into loyal servants of the regime. In 1032 BBY, the Sith Lord Odion gained control of the Helm of Ieldis, a Sith artifact created by an ancient Sith, and he traveled to Vanahame, where he planned to use the negative emotions of the children held there to power his newly-gained relic. To cause the children to enter a state of despair, Odion had his operators turn off all of the lights inside the cloister in which the children were kept. Kayl and the other youngsters subsequently cried out in fear, because they had never experienced darkness before, and Odion used their terror to unleash attacks on his rival Sith Lords with the Helm.\nDuring the Battle of Vanahame, Odion's second-in-command General Beld Yulan turned against his master. He infiltrated the control room, forcing the surviving operator Murl to switch back on the lights, which ending the children's state of panic. Under Jedi Knight Kerra Holt's orders, Yulan freed the captives including Kayl from their bubble domes. As the children celebrated their freedom, Odion's Helm overloaded and he was killed in the ensuing firestorm. Following the battle and the collapse of the Odionate, Kerra and Yulan joined forces to evacuate the Cloister children at Vanahame into the Galactic Republic. Jeeree was among these evacuees.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Odionate",
  "/wiki/Sith/Legends",
  "/wiki/Republic_Dark_Age",
  "/wiki/Odionate_cloister",
  "/wiki/Moon/Legends",
  "/wiki/Vanahame",
  "/wiki/1032_BBY/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Odion",
  "/wiki/Helm_of_Ieldis",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Ieldis",
  "/wiki/Lord/Legends",
  "/wiki/Battle_of_Vanahame",
  "/wiki/General/Legends",
  "/wiki/Beld_Yulan",
  "/wiki/Murl_(Human)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kerra_Holt",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Knight_Errant:_Escape_5"
 ]
}