{
 "name": "Jeeta",
 "display_name": "Jeeta",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jas Emari's crew"
     ]
    }
   ]
  }
 ],
 "content": "Jeeta was a female Rodian bounty hunter who lived during the Age of the Empire and the rise of the New Republic. Shortly before the Battle of Jakku, Jeeta along with the hunters Dengar and Embo were hired by the bounty hunter Mercurial Swift, who traveled to the planet Jakku to collect a bounty on the Zabrak bounty hunter Jas Emari. Despite capturing their target, Jas managed to convince Dengar and Embo to turn against Swift in returning for securing money and a pardon from the New Republic. Jeeta along with Dengar and Embo joined Jas' crew following the Battle of Jakku.\nIn 5 ABY, Jeeta along with the bounty hunters Dengar and Embo were hired by the bounty hunter Mercurial Swift to crew his Corellian shuttle. They traveled to the Inner Rim world of Jakku to collect the Zabrak bounty hunter Jas Emari. The Black Sun crime boss Gyuti had imposed a bounty on her head for overdue debts and Swift wanted to collect the bounty as revenge for Emari's role in trapping him on Taris. However, Jas managed to escape from Niima the Hutt's temple and stole Swift's Corellian shuttle.\nWhen Jas later returned with her friend Norra Wexley and the B1-series battle droid Mister Bones, Jeeta and her fellow hunters cornered her and Niima. Niima, who had struck a deal with Jas and Norra in return for ferrying her back to her temple, refused to let Swift take Jas. However, Niima was forced to relent when Dengar threatened her with a blaster. After they had recaptured Jas, Jeeta piloted Swift's Corellian shuttle. In the cargo hold, Jas managed to convince Dengar and Embo to switch sides in return for helping her collect a New Republic bounty on Grand Admiral Rae Sloane so that they could secure pardons. When Swift objected, Dengar and Jas threw him out of the ship.\nWhen Jeeta asked what was going on, Jas asked if Jeeta was loyal. Embo confirmed that Jeeta was not loyal to Swift. Jas responded that she could recruit Jeeta to her crew as well. After joining Emari's crew, they flew their shuttle to the Jakku Observatory and picked up Norra, who had joined forces with Sloane and her estranged husband Brentin Lore Wexley to stop Gallius Rax from destroying Jakku. Following the Battle of Jakku and the signing of the Galactic Concordance between the New Republic and the defeated Galactic Empire, Jeeta, Dengar, and Embo received full pardons and money from the New Republic. Jeeta and her fellow hunters continued working for Jas.\nJeeta was a female Rodian with long antennae and bulbous blue-black eyes. Besides being a bounty hunter, she knew how to pilot a starship. Jeeta disliked Mercurial Swift. After Dengar and Embo turned against Swift, she and her fellow hunters became Jas Emari's new crew.\nJeeta first appeared as a tertiary character in Chuck Wendig's 2017 novel Aftermath: Empire's End, the finale in Star Wars: The Aftermath Trilogy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Jas_Emari%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/Imperial_Era",
  "/wiki/New_Republic",
  "/wiki/Battle_of_Jakku",
  "/wiki/Dengar",
  "/wiki/Embo",
  "/wiki/Mercurial_Swift",
  "/wiki/Planet",
  "/wiki/Jakku",
  "/wiki/Bounty",
  "/wiki/Zabrak",
  "/wiki/Jas_Emari",
  "/wiki/Currency",
  "/wiki/5_ABY",
  "/wiki/Corellian_shuttle",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Black_Sun",
  "/wiki/Boss",
  "/wiki/Gyuti",
  "/wiki/Capture_of_Mercurial_Swift",
  "/wiki/Taris",
  "/wiki/Niima",
  "/wiki/Hutt",
  "/wiki/Niima%27s_temple",
  "/wiki/Corellian",
  "/wiki/Shuttle",
  "/wiki/Norra_Wexley",
  "/wiki/B1-series_battle_droid",
  "/wiki/Mister_Bones",
  "/wiki/Blaster",
  "/wiki/Grand_Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Starship",
  "/wiki/Jakku_Observatory",
  "/wiki/Marriage",
  "/wiki/Brentin_Lore_Wexley",
  "/wiki/Gallius_Rax",
  "/wiki/Galactic_Concordance",
  "/wiki/Galactic_Empire",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/Pilot",
  "/wiki/Chuck_Wendig",
  "/wiki/2017",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Star_Wars:_The_Aftermath_Trilogy",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Databank_A-Z"
 ]
}