{
 "name": "Jeeval",
 "display_name": "Jeeval",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jeeval was a male Rodian who served aboard the Rebel Alliance transport Griffon's Wings during the Galactic Civil War. At some point after the Battle of Yavin, Jeeval was killed over the planet Yorgraxx during an attack on Griffon's Wings by the Galactic Empire.\nJeeval was a Rodian male who lived during the time of the Galactic Civil War. Eschewing a career as a bounty hunter, a common occupation for many of his species, Jeeval enlisted in the Rebel Alliance resistance movement as a soldier. Assigned to the modified transport Griffon's Wings, serving alongside fellow crew members Gorbacca, Talva Ko'lib, Vylanthar Merric and Kandar Vallan. Jeeval participated in several missions and demonstrated his capability, though on occasion he was also in the wrong place at the wrong time, resulting in difficulties for his Rebel colleagues.\nAt some stage after the Battle of Yavin, Jeeval accompanied Griffon's Wings on an assignment to survey the isolated planet Yorgraxx in the Prefsbelt sector of the Outer Rim Territories, to assess the world's suitability as a location for a Rebel base. However, upon its arrival in the Yorgraxx system, the Rebel transport came under heavy laser fire from three Guardian-class light cruisers of the Galactic Empire. The barrage shook the Rebel vessel and threw Jeeval into a computer panel. Sustaining serious injury to his head, the Rodian bled profusely and died from his wounds. The stricken Griffon's Wings crashed onto Yorgraxx shortly thereafter.\nJeeval had a careless nature and was more affable than was common for Rodians.\nJeeval was created by Robert Wiese and appeared in Shadows in the Force, a roleplaying adventure set within Star Wars Legends continuity that was published by RPGA in 2004 as a tie-in to Wizards of the Coast's Star Wars Roleplaying Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Griffon%27s_Wings",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Yorgraxx",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Time/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Species/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Gorbacca",
  "/wiki/Talva_Ko%27lib",
  "/wiki/Vylanthar_Merric",
  "/wiki/Kandar_Vallan",
  "/wiki/Prefsbelt_sector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Yorgraxx_system",
  "/wiki/Laser/Legends",
  "/wiki/Guardian-class_light_cruiser",
  "/wiki/Computer/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Robert_Wiese",
  "/wiki/Shadows_in_the_Force",
  "/wiki/Roleplaying_game",
  "/wiki/RPGA",
  "/wiki/2004",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/The_Essential_Atlas"
 ]
}