{
 "name": "Jek Kardan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic MilitaryRepublic Special Forces DivisionHavoc Squad",
      "Republic MilitaryRepublic Special Forces DivisionHavoc Squad",
      "Republic Special Forces DivisionHavoc Squad",
      "Havoc Squad",
      "Sith Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "Jek Kardan was a Human male who was one of the leaders of Havoc Squad that fought against the resurgent Sith Empire during the Great Galactic War and the Cold War.\nJek Kardan was known for being a founding member of Havoc Squad during the Great Galactic War. He served first as its second in command under Jace Malcom and was later named the squad's commander when Malcolm was promoted. Kardan would also mentor Harron Tavus in the ways of the military.\nSometime after the Treaty of Coruscant and the subsequent Cold War, Garza dispatched Havoc to cut off an Imperial offensive on Ando Prime, but enemy numbers were far greater than intel had lead them to believe. Garza was about to extract them when the Galactic Senate chose to abandon them, fearing that their unauthorized mission was bordering on breaching the treaty. Kardan managed to keep the squad together and they found their way home independently. When he learned the truth of the Senate's decision, he resigned and Tavus took over the squad, both were never the same. The Havoc founder subsequently disappeared into obscurity.\nBy 3643 BBY, all of Kardan's comrades chose to defect to the Sith Empire. Kardan was on Coruscant, working with the local vigilante group called the Justicars' Brigade. Kardan chose to aid his friends and worked with Imperial infiltrators and the Justicars to reactivate an old Republic transmitter in the Works, enabling all Republic SpecForce defectors to communicate across the galaxy.\nKardan's actions, however, did not go unnoticed. General Elin Garza dispatched a new Havoc Squad to bring Kardan in. Upon being confronted, Kardan assumed that the Lieutenant and Aric Jorgan were just grunts and ordered them to stand down. Upon recognizing the Havoc patch, he realized that the Lieutenant was the new recruit from the old Havoc who refused to defect. Instead of fighting the new Havoc, Kardan left for the Works, leaving frustrated Imperial agents to deal with them.\nHowever, Havoc Squad managed to fight their way out and pursued Kardan to the transmitter. The Lieutenant attempted to convince Kardan to surrender. Kardan realized that even if he killed them, Garza would only send someone else to destroy the transmitter and hunt down his comrades. The Imperials may offer protection but it won't be much. Thus, he agreed to help bring in his friends, but threatened to kill the Lieutenant if they fail to save one of the defectors. His Imperial escorts, however, refused to let him be taken into enemy custody and attacked, but were killed by the Havoc trio.\nKardan later turned up at the Senate building and surrendered in broad daylight. However, Garza would keep him under heavy guard so he wouldn't fulfill his promise of retribution in case one of the traitors couldn't be captured alive, which turned out to be the case.\nJek Kardan is a non-player character from the massively multi-player online role playing game Star Wars: The Old Republic released by BioWare in 2011. He is voiced by Fred Tatasciore. He is described in-game as Havoc squad's founder, but Jace Malcom is the real founder of the squad.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jek_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Havoc_Squad",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Jace_Malcom",
  "/wiki/Harron_Tavus",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Ando_Prime/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/Coruscant/Legends",
  "/wiki/Justicars%27_Brigade",
  "/wiki/Sector_943",
  "/wiki/Elin_Garza",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Aric_Jorgan",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Fred_Tatasciore",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3653_BBY",
  "/wiki/Hope_(cinematic_trailer)",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Voidhound"
 ]
}