{
 "name": "Jek Bannon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Five Brothers Resort and Casino"
     ]
    }
   ]
  }
 ],
 "content": "Jek Bannon was a male Human who worked for the Five Brothers Resort and Casino on the space station known as Centerpoint Station during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire. Whilst working for the casino, he was sent to take promotional pictures of the Conical Six mountain but passed out due to heat exhaustion during the climb. He was found and rescued by a group of spacers also hired to perform work for the casino on the mountain.\nDuring the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire, the Human boy Jek Bannon worked for the Five Brothers Resort and Casino, an establishment on the Centerpoint space station. At the age of fifteen he worked under the Twi'lek Sura as part of the Five Brothers' operations on Conical Six, one of the the space stations' Southern Conical Mountains. Shortly after Five Brothers' obtained the rights to exclusive use of the mountain, Sura sent Bannon up the mountain to capture a number of holographic images for commercial use by the casino. The boy brought a bag of equipment with him, but after encountering the extreme heat generated by Glowpoint, an artificial sun near the mountain, he passed out in a cave while trying to put on a rebreather.\nA group of spacers hired by the casino to clear out a vynock infestation on the mountain later found Bannon, and after the group were attacked by several vynocks, he awoke and thanked them before contacting Sura to arrange pick up. The group, one of whom collected Bannon's bag, then brought the boy with them to the mountains summit where an airspeeder collected them all. Thankful to see him safe Sura paid the spacers an extra 300 for his rescue and the return of the equipment.\nWhen found by spacers he was extremely thankful, as was Sura who had worried for the young boy when he didn't return.\nBannon was a fair-skinned, brown haired, Human male, who was confident enough to climb a mountain alone at the age of fifteen, although the task proved too much for him.\nWhile climbing the mountain Bannon wore a brown vest and pants. He also carried a bag of equipment, including a rebreather, large amounts of rope, a grappling hook and a comlink.\nBannon first appeared as a character in the adventure module \"Conical Six Summit\", one of several modules included in the Suns of Fortune sourcebook for the Fantasy Flight Games Star Wars: Edge of the Empire roleplaying system. The book, which was released in 2014, gave several reasons why the players might be climbing the mountain when they find Bannon, although hunting vynocks is the reason used throughout the adventure text and so this article assumes this to be the case.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jek_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Five_Brothers_Resort_and_Casino",
  "/wiki/Space_station/Legends",
  "/wiki/Centerpoint_Station",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Casino/Legends",
  "/wiki/Conical_Six",
  "/wiki/Mountain/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Sura",
  "/wiki/Hologram/Legends",
  "/wiki/Glowpoint",
  "/wiki/Star/Legends",
  "/wiki/Rebreather/Legends",
  "/wiki/Canon",
  "/wiki/Vynock/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Credit",
  "/wiki/Clothing/Legends",
  "/wiki/Rope/Legends",
  "/wiki/Grappling_hook/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Conical_Six_Summit",
  "/wiki/Suns_of_Fortune",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire",
  "/wiki/2014"
 ]
}