{
 "name": "Jek-15",
 "display_name": "Jek-15",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Geonosis"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Around 21 BBY",
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Order of the Sith Lords"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Count Dooku"
     ]
    }
   ]
  }
 ],
 "content": "Jek-15 was a Human male Force-sensitive clone of Jek-14, created in Geonosis' Petranaki arena by Count Dooku around 21 BBY. Originally intended to be the first in an army of Sith clone troopers, Jek-15 was instead born defective, emerging from the Clone-o-matic 1138 cloning device less than half the height of Jek-14, and with significantly weaker abilities. Jek-15 was still fiercely loyal to the Sith despite his imperfections, but was ultimately defeated by Obi-Wan Kenobi and Yoda nonetheless. In response to the Clone-o-matic 1138 and Jek-15's failure to live up to the Sith's expectations, the device was soon replaced with the New and Improved Clone-o-matic.\nBorn from the template of the Human male Force-sensitive clone Jek-14, Jek-15—himself a clone—emerged from the cloning device known as the Clone-o-matic 1138—created by Count Dooku—around 21 BBY, inside of the Petranaki arena on the planet Geonosis. He was unveiled to the allies of the Sith with the intent of being the second member in an army of Sith clone troopers, after Jek-14. Upon emerging, he announced his loyalty to the Sith, and immediately zapped Viceroy Nute Gunray with Force lightning. However, Jek-15 was defective, and failed to measure up to the same level of power that his predecessor had—the Force lightning merely tickled Gunray. Darth Sidious grew angry at Dooku, who nervously replied that he was still ironing out some kinks.\nFollowing the failed cloning attempt, the hitherto-disguised Jedi Master Obi-Wan Kenobi and Jedi Grand Master Yoda revealed themselves. Jek-15 joined in the fight against the two Jedi, and first attacked Yoda, attempting to zap him with his Force lighting. Yoda instead simply picked the miniscule clone up, tossing him away. Later in the fight, Jek-15 refocused his attacks on Kenobi, latching onto his legs and forcing the Jedi to hop around as he also fought Dooku and General Grievous. However, both Jedi still managed to escape.\nFollowing the creation of Jek-15 with the Clone-o-matic 1138, it was replaced by the New and Improved Clone-o-matic, which operated more efficiently and produced non-defective clones. However, using his Force abilities, Jek-14 was capable of turning all of his clones created by the new device into miniature clones, identical in likeness to Jek-15. Jek-14 then popped each of his tiny clones with Force lightning, destroying them.\nJek-15 was almost an exact copy of his predecessor, Jek-14, in every way, with a similar appearance, Force-sensitivity, and abilities. He had black hair, tan skin, and glowing blue eyes. Additionally, he possessed a glowing, blue left arm, which appeared to be charged with electricity at all times. The most noticeable difference between himself and his template was the fact that Jek-15 was extremely smaller. In fact, he was not even as tall as Yoda's waist. Despite his size, Jek-15 was extremely feisty, and acted with much aggression to his enemies. Due to his loyalty to the Sith, this aggression was primarily directed to the Jedi Obi-Wan Kenobi and Yoda. He did not acknowledge his small size, and reacted to those appalled by it with confusion.\nJek-15 was intended to have the same powers as Jek-14, with similar strength. However, he was instead significantly weaker. He was capable of generating Force lightning from his left arm, but its effects were immensely diminished, instead producing a laser-like beam which was more ticklish than harmful. Jek-15's small size did, however, lend itself to him, as he was capable of latching on to larger individuals such as Obi-Wan Kenobi.\nLike Jek-14, Jek-15 wore a precursor to Phase II clone trooper armor, which was an exact copy of Jek-14's, and was white with red markings. Like Jek-15 himself, however, the armor was significantly smaller than Jek-14's, fitting an individual of Jek-15's own size. Jek-15 exited the Clone-o-matic 1138 wearing his armor.\nJek-15 appeared in \"Menace of the Sith,\" the second episode of LEGO Star Wars: The Yoda Chronicles, which aired on Cartoon Network on September 4, 2013. Like Jek-14, he was voiced by Brian Dobson, though his voice was shifted to a higher pitch. Jek-15 is listed in the credits as \"Jek Clone;\" however, his name—while not explicitly stated in the episode—is visible on a screen of the Clone-o-matic 1138.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Jek-15",
  "/wiki/Jek_(disambiguation)",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Geonosis",
  "/wiki/21_BBY/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jek-14/Legends",
  "/wiki/Petranaki_arena",
  "/wiki/Army/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone-o-matic_1138",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/New_and_Improved_Clone-o-matic",
  "/wiki/Gene/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Viceroy/Legends",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Limb/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Phase_II_clone_trooper_armor/Legends",
  "/wiki/Menace_of_the_Sith",
  "/wiki/LEGO_Star_Wars:_The_Yoda_Chronicles",
  "/wiki/Cartoon_Network",
  "/wiki/September_4",
  "/wiki/2013",
  "/wiki/Brian_Dobson",
  "/wiki/Category:Images_of_Jek-15",
  "/wiki/LEGO_Star_Wars:_The_Yoda_Chronicles_(book)",
  "/wiki/The_Phantom_Clone",
  "/wiki/StarWars.com"
 ]
}