{
 "name": "Jek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Diplomatic service",
      "Ranger Corps",
      "Diplomatic service",
      "Ranger Corps"
     ]
    }
   ]
  }
 ],
 "content": "\"Jek\" was the nickname of a clone shock trooper who served in the Grand Army of the Republic during the Clone Wars. In 22 BBY, he served alongside Jedi Master Yoda on Rugosa as part of a small squad and, later, served at the Battle of Kashyyyk under Yoda once again in 19 BBY. At Kashyyyk, Jek was a Clone Captain within the Ranger Corps and was present when Order 66 was issued; despite his previous camaraderie with Yoda, Jek nevertheless attempted to execute the order alongside Commander Gree. Yoda sensed the attempt, however, and decapitated both clones before they could carry out the order.\nGrown on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the clone trooper army and trained in combat, the clone that assumed the nickname \"Jek\" participated in the pan-galactic Clone Wars between the Galactic Republic and the Separatist Alliance, serving as a clone shock trooper in the Republic's Coruscant Guard diplomatic service.\nIn the year 22 BBY, concurrent with the Battle of Ryloth Jek was one of three of the Guard's service that joined Jedi Grand Master and Jedi General Yoda on a diplomatic mission to the coral moon Rugosa to meet with King Katuunko of Toydaria where the Republic sought to construct a supply base following Toydaria's secret sponsorship of a Republic supply mission to Ryloth during the fierce campaign there. Jek's fellow clones in the small squad included \"Rys\" and their superior, Clone Lieutenant CC-4477 \"Thire.\"\nThe Republic envoy arrived above the moon aboard a Consular-class cruiser commanded by Clone Captain \"Zak\" and were scheduled to secretly meet atop a Rugosan King coral with the Toydarian king. When the Republic arrived, Jek was on the cruiser's bridge along with the others when they discovered that their communications were being jammed. They were soon attacked by two Separatsit Munificent-class star frigates that arrived from hyperspace. With the small Republic cruiser outmatched, Captain Zak stated that he needed to bring the envoy to safety, though Yoda soon belayed that and ordered that the ship should retreat while he and his escort would go down to the moon to continue their mission. The group, including Jek, boarded one of several Republic escape pods as Zak launched all of them per Yoda's orders. While Rys piloted the escape pod, Jek sat behind the Jedi Master as the frigates fired on the pods. After both Rys and Lieutenant Thire confirmed that they were out of range, Yoda agreed but commented that he believed they were entering another trap. Jek looked upon Thire in confusion, before turning to Yoda and asking if he was sure. Yoda replied that he sensed a disturbance in the Force, and the pod proceeded to crash land on Rugosa's surface.\nSith assassin and Separatist commander Asajj Ventress, who had surprised King Katuunko and attempted to convince him to join the Separatists. After the pod landed, Thire contacted the king so that Yoda may speak while Jek and Rys gathered their weapons. They discovered that Ventress had already reached the king with an offer of alliance with the Separatists, offered directly by Separatist Head of State Count Dooku. When Jek and Rys heard about this, they exchanged a glance. The three factions agreed that if Yoda and his escorts could evade capture by Ventress's forces and reach Katuunko on the coral, Toydaria would join the Republic—otherwise, Ventress asked that the Toydarians consider an alliance with the Separatists. Following the agreement, Rys viewed a C-9979 landing craft with Ventress's forces and believing that their may be a full droid battalion there, along with armored forces. Jek picked up his rotary blaster cannon and commented that they'd have something for them. Yoda ordered the trio of clones to only carry what they needed to avoid slowing down, and led them in an indirect route despite Thire's initial objection to avoid the Separatist forces.\nAfter some time, Yoda and his clones were spotted in what the battle droid forces designated Sector 11, and were attacked by Armored Assault Tank Mk Is. Although Thire, Jek, and Rys were unsettled and ready for combat, Yoda assured them that they were not in range and to be at ease. The tanks could not travel further, and one of them was wedged on a coral and unable to move. Thire confirmed the situation, and Yoda expressed that size was not everything, and although they were smaller in number, they were larger in mind. When Yoda left, Jek expressed confusion to his comrades on the general's remarks. Jek and the clones engaged droid infantry forces and became separated from the Jedi. They eventually regrouped and succeeded in eliminating the final Separatist forces before meeting Katuunko.\nFollowing the battle on Rugosa, Jek followed Master Yoda's advice and retrained as a clone scout trooper, eventually rising to the military rank of Clone Captain and serving in the Ranger Corps by the time of the Outer Rim Sieges. Concurrent to the sieges and after the Battle of Coruscant in 19 BBY, the Separatist Alliance launched an invasion of the Mid Rim Wookiee world of Kashyyyk due to its strategic position near the Foundry of the Confederacy, where the Republic's 12th Sector Army had launched multiple engagements.\nJedi Grand Master Yoda volunteered to aid in the defense of Kashyyyk, accompanying the 41st Elite Corps of Jedi General Luminara Unduli and Clone Commander CC-1004 \"Gree.\" Clone Captain Jek was among these forces dispatched to Kashyyyk, which landed on the planet via a Venator-class Star Destroyer after Yoda's task force smashed through the Separatist fleet, with Jek serving under Gree. Kachirho Wookiee Militia and Republic forces set up defenses on the beach, with General Yoda observing the Separatist attack from the command post above the beach in Kachirho City and assisted by Commander Gree, Captain Jek, Wookiee Chieftain General Tarfful and his lieutenant Chewbacca. Jedi Generals Unduli and Quinlan Vos participated in the battle directly as the Separatists engaged, during which Dark Lord of the Sith Darth Sidious, publicly the Republic Supreme Chancellor Sheev Palpatine, gave Order 66, a clone protocol meant for the immediate execution of all Jedi.\nSensing a disturbance during Anakin Skywalker's fall to the dark side of the Force shortly prior, and a larger one as the Great Jedi Purge began, Commander Gree received the order via a hologram of Darth Sidious away from the others, confirming that the order would be done. When Commander Gree moved towards Yoda, he looked at Captain Jek and both nodded and immediately readied their blasters to assassinate Yoda, whom Jek had protected years prior on Rugosa.\nYoda, however, had sensed the ripples in the Force caused by so many Jedi murders all at once and anticipated what the two clones would do. Before the two could shoot him, Yoda suddenly leapt up and decapitated both of them with a single sweep of his lightsaber. After both of their bodies collapsed, Tarfful and Chewbacca escaped with Yoda, through the jungle as the Separatists gained the upper hand in the battle due to the chaos following the execution of Order 66. Surviving clone forces rallied under Commander Faie, and the Republic won the battle. Clone units unsuccessfully hunted down Yoda and subjugated their Wookiee allies.\nAccording to Master Yoda, Jek had an obsession with weapons, always thinking the strength of his team depended on having superior firepower. This mentality was reflected on his weapon of choice, the rotary blaster cannon, though Yoda encouraged him to think of his mind as a tool more powerful than any weapon. In the aftermath of their mission on Rugosa, Jek painted battle-droid heads on his weapon.\nAs a clone trooper of the Grand Army of the Republic, Jek was skilled in armed and unarmed combat, heavy weaponry, and military tactics. Jek eventually retrained as a scout and was additionally skilled in reconnaissance and tracking. Jek also served as a clone trooper officer, and was able to assist his superiors in observing a battle.\nDuring his time in the Coruscant Guard, Jek made use of white Phase I clone trooper armor with red markings and symbols denoting his unit affiliation, although his and those of his comrades were different from the standard markings of other Coruscant Guard. Jek customized his armor further with two hip holsters for a DC-17 hand blaster and a black bandolier. He relied on his Z-6 rotary blaster cannon during this time, as well as an RPS-6 rocket launcher. After transferring to the Ranger Corps, Jek equipped himself with Phase II ARF armor in green forest camouflage. On Kashyyyk, he used this armor with a DC-15A blaster carbine.\nJek first appeared in \"Ambush,\" the first episode of the first season of the animated television series Star Wars: The Clone Wars, which premiered on Cartoon Network on October 3, 2008. He was retconned into being the clone trooper killed alongside Gree on Kashyyyk in the 2005 film Star Wars: Episode III Revenge of the Sith by author Jason Fry, who first hinted at the retcon in his 2020 short story \"Sharing the Same Face,\" an adaptation of \"Ambush\" published in the anthology The Clone Wars: Stories of Light and Dark, before confirming it in the 2021 reference book Star Wars: Battles that Changed the Galaxy, which Fry co-authored.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jek",
  "/wiki/Jek/Legends",
  "/wiki/Jek_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Kashyyyk",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Galactic_Republic",
  "/wiki/Diplomatic_service",
  "/wiki/Ranger_Corps",
  "/wiki/File:JekSuckLaser.ogg",
  "/wiki/Imperial_shock_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/22_BBY",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Rugosa",
  "/wiki/Yoda%27s_squad_(Rugosa)",
  "/wiki/Battle_of_Kashyyyk",
  "/wiki/Clone_Captain",
  "/wiki/Order_66",
  "/wiki/CC-1004",
  "/wiki/File:Rugosa_Republic_Squad.png",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Jango_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/Clone_trooper",
  "/wiki/Army",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Coruscant_Guard",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Jedi",
  "/wiki/Grand_Master",
  "/wiki/Jedi_General",
  "/wiki/Ambush_on_Rugosa",
  "/wiki/Coral",
  "/wiki/Moon",
  "/wiki/King",
  "/wiki/Katuunko",
  "/wiki/Toydaria",
  "/wiki/Ryloth",
  "/wiki/Rys",
  "/wiki/Clone_Lieutenant",
  "/wiki/CC-4477",
  "/wiki/Consular-class_cruiser_(Charger_c70_retrofit)",
  "/wiki/Commanding_officer",
  "/wiki/Zak",
  "/wiki/Rugosan_King_coral",
  "/wiki/Toydarian",
  "/wiki/Cruiser",
  "/wiki/Bridge_(starship)",
  "/wiki/Signal_jammer",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Hyperspace",
  "/wiki/Captain",
  "/wiki/Republic_escape_pod",
  "/wiki/Pilot",
  "/wiki/Escape_pod",
  "/wiki/Frigate",
  "/wiki/Lieutenant",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/Sith_assassin",
  "/wiki/Commander",
  "/wiki/Asajj_Ventress",
  "/wiki/Head_of_State",
  "/wiki/Count_of_Serenno",
  "/wiki/Dooku",
  "/wiki/C-9979_landing_craft",
  "/wiki/Droid",
  "/wiki/Battalion",
  "/wiki/Tank_(vehicle)",
  "/wiki/Jek%27s_rotary_blaster_cannon",
  "/wiki/Time",
  "/wiki/Battle_droid",
  "/wiki/Sector_11_(Rugosa)",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/General",
  "/wiki/Infantry",
  "/wiki/File:UnidentifiedSwampTrooper-ROTS.png",
  "/wiki/Clone_scout_trooper",
  "/wiki/Military_rank",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Wookiee",
  "/wiki/Foundry_of_the_Confederacy",
  "/wiki/12th_Sector_Army",
  "/wiki/41st_Elite_Corps",
  "/wiki/Luminara_Unduli",
  "/wiki/Clone_Commander",
  "/wiki/Yoda%27s_Republic_taskforce",
  "/wiki/Kachirho_Wookiee_Militia",
  "/wiki/Kachirho",
  "/wiki/City",
  "/wiki/Chief",
  "/wiki/Tarfful",
  "/wiki/Chewbacca",
  "/wiki/Quinlan_Vos",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Supreme_Chancellor",
  "/wiki/File:TheDeathofCommanderGree.png",
  "/wiki/Anakin_Skywalker",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Hologram",
  "/wiki/Blaster",
  "/wiki/Assassin",
  "/wiki/Yoda%27s_lightsaber",
  "/wiki/Jungle",
  "/wiki/Faie",
  "/wiki/File:YodaJek.ogg",
  "/wiki/File:Jek-CTRaF.png",
  "/wiki/Z-6_rotary_blaster_cannon",
  "/wiki/Scout",
  "/wiki/Clone_trooper_officer",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Color",
  "/wiki/Holster",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Bandolier",
  "/wiki/RPS-6_rocket_launcher",
  "/wiki/Phase_II_ARF_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Ambush",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Cartoon_Network",
  "/wiki/October_3",
  "/wiki/2008",
  "/wiki/Retcon",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Jason_Fry",
  "/wiki/2020",
  "/wiki/Sharing_the_Same_Face",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/2021",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Category:Audio_files_of_Jek",
  "/wiki/Category:Images_of_Jek",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Databank_A-Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Clone_Wars_-_The_Official_Collectors_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Death",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Bombad_Jedi",
  "/wiki/Supply_Lines",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Hostage_Crisis"
 ]
}