{
 "name": "Jeken",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Sallow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Academy",
      "Imperial Academy"
     ]
    }
   ]
  }
 ],
 "content": "Jeken was a male human who enlisted as a cadet in the Imperial Academy, the military training program run by the Galactic Empire. His ambition was to join the ranks of the white-armored stormtroopers, whom he thought were inherently superior to their clone predecessors.\nAt some point, Jeken, five other cadets, and a supervisor were dispatched to the planet Imvur. However, an explosion damaged most of their ship's vital systems, and they were forced to send a distress message. When someone finally came to the cadets' rescue, it turned out that their saviors were a band of rebels. Jeken saw that as an opportunity to capture the rebels and hand them over to the Empire, which would certainly impress the cadets' superiors.\nHowever, a girl cadet named Reann Tomvig refused to harm those who had come to the cadets' help. When Jeken ordered Tomvig to stun the rebels with a blaster rifle, she refused, prompting the boy to call her weak. What Jeken had not foreseen, however, is that Tomvig would not simply disobey, but actively turn on him and use the blaster to neutralize him. The rebels allowed the cadets to go, and the trainee Imperials eventually found their way to Admiral Kassius Konstantine's Star Destroyer, the Relentless. Jeken made his report to the admiral, telling him of his plan to capture the rebels and Tomvig's betrayal. Having earned Konstantine's commendation, Jeken was assured that Viggen, commanding officer of the Imvur base, would reward him for his bravery.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Academy",
  "/wiki/Imperial_cadet",
  "/wiki/Stormtrooper_armor",
  "/wiki/Stormtrooper",
  "/wiki/Cloning",
  "/wiki/Clone_trooper",
  "/wiki/Planet",
  "/wiki/Imvur",
  "/wiki/Spectres",
  "/wiki/Reann_Tomvig",
  "/wiki/Stun",
  "/wiki/Blaster_rifle",
  "/wiki/Admiral",
  "/wiki/Kassius_Konstantine",
  "/wiki/Star_Destroyer",
  "/wiki/Relentless",
  "/wiki/Viggen",
  "/wiki/Commanding_officer",
  "/wiki/Imperial_base_(Imvur)",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Academy_Cadets",
  "/wiki/Star_Wars_Rebels_Magazine_18"
 ]
}