{
 "name": "Jemba",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "44 BBY",
      "an uncharted Outer Rim planet"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow-red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Offworld Mining Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Jemba was a Hutt in charge of the Offworld Mining Corporation's Bandomeer operations. He crash-landed on an unknown planet, and enslaved Arconans on the ship, forcing them to work for the dactyl nutrition which he stole from them which was critical for Arconans to survive. His death was accidental when his right-hand Hutt, Grelb, shot him while aiming for Obi-Wan Kenobi, who helped find the hidden dactyl.\nIn 44 BBY, Jemba flew with miners of the Offworld Mining Corporation onboard the Monument to the planet Bandomeer. He encountered Qui-Gon Jinn and the young Obi-Wan Kenobi, who were leading the Arcona Mineral Harvest Corporation. When the ship was attacked by pirates, Jemba was able to steal the dactyl and force the Arcona Mineral Harvest Corporation workers to serve him until the Monument had to make an emergency landing on an island of an unknown planet with five moons.\nJust before the entire crew had to evacuate the ship due to flooding, Jemba and his thugs planned on hiding the stolen dactyl somewhere in the mountains until they encountered the native draigons. A short time later, Jemba learned from his right-hand employee Grelb that the Jedi had found the dactyl. Jemba was furious and planned to kill the Jedi. He immediately attacked Obi-Wan, who was defending the cave entrance from a couple of draigons that were attacking. His employee had the same idea and shot faster than Jemba. However, Obi-Wan dodged Grelb's blaster bolt, which squarely hit Jemba's chest.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/44_BBY/Legends",
  "/wiki/Unidentified_blue_marble_planet",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Offworld_Mining_Corporation",
  "/wiki/Clat%27Ha",
  "/wiki/Bandomeer/Legends",
  "/wiki/Arcona/Legends",
  "/wiki/Dactyl",
  "/wiki/Grelb",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Monument_(freighter)",
  "/wiki/Planet/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Arcona_Mineral_Harvest_Corporation",
  "/wiki/Draigon",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jemba",
  "/wiki/Jedi_Apprentice:_The_Rising_Force",
  "/wiki/Jedi_Apprentice:_The_Dark_Rival",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}