{
 "name": "Jenkes",
 "display_name": "Jenkes",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Jenkes was a lieutenant with the Imperial Security Bureau on Lothal. During the fifth year of Emperor Palpatine's reign, Jenkes managed a gladiator arena on the planet of Nyriaan. In his line of business, he was acquainted with Dug bookmaker Gronson \"Shifty\" Takkaro. Later, Jenkes joined the Galactic Empire and became an agent of the Imperial Security Bureau.\nSome nine years later, Jenkes was transferred to the Outer Rim planet of Lothal, where he served under the ISB Lieutenant Herdringer. Jenkes later murdered his superior and stole Herdringer's identity. Using his position as an ISB official, Jenkes teamed up with \"Shifty\" Takkaro to arrange an illegal event known as Gladiator Night, going under the title \"the Commissioner.\"\nFive years prior to the Battle of Yavin, the Trandoshan bounty hunter named Bossk arrived on Lothal, seeking to collect a bounty on Takkaro, who had antagonized the Imperial senator Hack Fenlon and skipped bail in the Ahakista system. Seeking to protect his friend and to hide their criminal enterprise, Jenkes hired the Duros assassin Angrigo and the Kratchell twins to kill Bossk. However, Jenkes was thwarted by Bossk and an unlikely ally, the young Lothal resident Ezra Bridger. Following his exposure, Jenkes was arrested and executed by the local Imperial authorities on Lothal. Later, Bossk received a long plastoid box from Commandant Cumberlayne Aresko which contained the remains of Jenkes.\nNine years before the Trandoshan bounty hunter Bossk's visit to Lothal, Jenkes managed a gladiator arena on the planet Nyriaan. In his line of business, he was acquainted with a Dug criminal name Gronson \"Shifty\" Takkaro, who served as his bookmaker. He later joined the Imperial Security Bureau  and was posted to the Outer Rim world of Lothal. At a later point, he killed his superior officer Lieutenant Herdringer by pushing him in front of a speeder bus and stole his identity.\nOn Lothal, Jenkes ran an illegal sporting event called Gladiator Night and made a profit from credit chips raised during ticket sales. In underworld circles, the lieutenant was known by the pseudonym: the \"Commissioner.\" The Commissioner outsourced the sale of tickets to the Xexto pawnshop owner and pickpocket Ferpil Wallaway and his human associate Ezra Bridger, a young orphan who made a living as a con artist and other odd jobs. None of Jenkes's acquaintances including his stormtroopers and his RA-7 protocol droid knew about his underworld dealings.\nFive years before the Battle of Yavin, Bossk visited the Outer Rim planet of Lothal to collect a bounty on \"Shifty\" Takkaro, who had jumped bail in the Ahakista system and antagonized the Imperial senator Hack Fenlon. Using Herdringer's identity, Jenkes corresponded with Bossk and reluctantly allowed the Trandoshan bounty hunter to pursue his bounty. Unknown to Bossk, Jenkes sent a squad of stormtroopers called Squad Five to keep a watch on Bossk. He also warned \"Shifty\" Takkaro and his three associates, the Duros assassin Angrigo and two Niktos known as the Kratchell twins, about Bossk's presence.\nWhen Bossk and his local guide, Bridger, entered Ake's Tavern, they were attacked by Angrigo and the Kratchell twins. During the subsequent fighting, Bossk killed the three assassins and captured the Dug criminal. However, they were then attacked by Jenkes' stormtroopers but escaped on a stolen speeder bike. During the escape, Bossk was forced to leave \"Shifty\" Takkaro behind, and the Dug was subsequently apprehended by Squad Five. Later at his office near Lothal Capital City's spaceport, Jenkes received news of the escape and the deaths of the three assassins from the stormtrooper TK-5331. Jenkes then ordered all Imperial forces on Lothal to hunt down and exterminate Bossk and his accomplice for \"crimes\" against the Empire.\nLater, Jenkes received a report from his RA-7 protocol droid at his office. The first item mentioned that Squad Seven had arrested two miners attempting to escape a labor camp. The second item mentioned that his appointment with the Imperial officer Commandant Cumberlayne Aresko had been rescheduled the following day. The third item mentioned that a surveillance droid had witnessed unusual activity in Monad Outpost. When Jenkes pressed the droid about the third item, RA-7 mentioned that a large crowd of civilians had begun congregating near the decommissioned docking bays. Jenkes knew that these civilians were awaiting the illegal Gladiator Night events but maintained his underworld cover by telling RA-7 that the surveillance droid had witnessed a secret Imperial project. He made arrangements for the surveillance droid to have its memory wiped.\nRA-7 then reported that the Lothal spaceport authority had received a freighter from Nyriaan requesting permission to land at Capital City's spaceport. While officially carrying livestock, the freighter was actually carrying two alien gladiator champions: the Houk Borbig Drob and the Feeorin Warjak, who were to be the main contestants of the illegal Gladiator Night at Monad Outpost. Jenkes had also placed a bet on the Feeorin Warjak to win the fight. Jenkes gave authorization for the freighter to land and made arrangements for the two gladiators to be transported to Monad Outpost in an unmarked Imperial transport. Since RA-7 had inadvertently stumbled on his criminal operations, the ISB lieutenant made a mental note to erase the droid's memories or to destroy it himself later.\nLater, Bossk and Ezra Bridger visited the local Imperial posting agency at Capital City's spaceport. While browsing through Herdringer's records, they discovered that he was deceased and that Jenkes had killed the real Herdringer and stolen his identity. Bossk also learnt that the Dug criminal \"Shifty\" Takkaro served as Jenkes' bookmaker during his gladiatorial arena days on Nyriaan. Unknown to Bossk and Ezra, Jenkes' RA-7 droid was monitoring the Imperial Enforcement DataCore and promptly notified the ISB lieutenant that his personal and military records had been accessed. Jenkes then sent Squad Three, a squad of stormtroopers, to eliminate the Trandoshan, with shoot-to-kill orders.\nHowever, Bossk and Ezra evaded the stormtroopers along with two Ranat and Nimbanel bounty hunters, who were attempting to collect the Imperial bounty on Bossk. After escaping the Imperials, Bossk and Ezra decided to travel to the former mining town Monad Outpost, where Jenkes was organizing Gladiator Night the following night. Bossk also worked out that Jenkes was the mysterious Commissioner. On the way to Monad, Bossk and Ezra visited Ferpil Wallaway, the Xexto pawnshop owner who worked for Jenkes and had employed Ezra to sell his tickets.\nMeanwhile, Jenkes decided to kill Ferpil after determining that Bossk's local guide Ezra was connected to the Xexto pawnshop owner. In order to hide his criminal dealings, Jenkes decided to kill Ferpil and ordered his RA-7 droid to summon an unmarked armored speeder. Before leaving, he also tried to cover up his trail by destroying the protocol droid. He then enlisted the services of the two stormtroopers that had had brought the armored speeder, telling them that they were going on a classified mission. Upon arriving at Ferpil's panwshop, he killed the Xexto merchant and took the proceeds from the Gladiator Night tickets in a luggage case. Bossk and Ezra arrived too late to save the Xexto pawnbroker, but the Trandoshan bounty hunter still managed to plant a magnetic tracer beacon on his speeder.\nUpon arriving at Monad Outpost, Jenkes and his stormtrooper escorts made their way to the arena's box office. Since the stormtroopers were unaware of his criminal dealings, Jenkes told them that he had received a report about an illegal gladiatorial fight and gambling at the mining outpost. He claimed that he was determined to find the culprit behind this \"outrage.\" When one of the stormtroopers suggested calling for Imperial reinforcements, Jenkes ruled that out claiming that such a discovery would embarrass the Imperial authorities on Lothal. Instead, he told his subordinates that they could handle it alone and that they would arrest the event's organizers.\nAfter entering the box office, Jenkes murdered the Ishi Tib counting the proceeds from the ticket sales. Jenkes justified his murderous action by claiming that the Ishi Tib was reaching for a weapon. He then ordered his stormtroopers to load the credit chips into carts that would be brought onto his unmarked speeder. After the stormtroopers had outlived their usefulness, Jenkes had planned to shoot them with his blaster pistol in order to cover his tracks. Before Jenkes could carry out this plan, they were ambushed by Bossk and Ezra, who quickly overpowered the stormtroopers with Bossk's mortar gun. Following a short verbal confrontation with Bossk, Jenkes fled into the arena. Bossk and Ezra gave chase, but Jenkes shot the Trandoshan bounty hunter through his right thigh.\nIn an attempt to slow down Bossk, Jenkes seized a comlink from the arena's Pa'lowick master of ceremonies and claimed that Bossk was a dangerous fugitive who was wanted by the Empire. Bossk foiled Jenkes' attempt to frame him by using Ezra's stolen comlink to issue a challenge to the arena's competitors: Borbig Drob and Warjak. After soundly defeating the two competitors in bare-handed combat, Bossk revealed that Jenkes was actually the \"Commissioner\" and that he had been planning to steal the spectators' credit chips. In addition, Bossk revealed Jenkes' involvement in the murders of Herdringer, the pawnbroker Wallaway, and the Ishi Tib manning the box office. Jenkes attempted to escape the arena but was thwarted by Ezra, who fired a slingshot at him. Shortly, Jenkes was arrested by the local Imperial authorities, who had raided the arena.\nFollowing the events at Monad Outpost, Jenkes was executed under the orders of Aresko and Taskmaster Myles Grint, who assured Bossk that he would never hear from the disgraced ISB lieutenant again. The Trandoshan bounty hunter was also allowed to take back Jenkes' remains in a plastoid box. An official HoloNet News report claimed that Bossk had exposed an illegal sporting event at Monad Outpost but omitted any mentioned of Jenkes, whose criminal dealings were deemed an embarrassment to the Imperial authorities on Lothal.\nJenkes was created for Ezra's Gamble, a novel written by Ryder Windham and released on August 5, 2014. He serves as the main antagonist of the story.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Lieutenant",
  "/wiki/Lothal",
  "/wiki/Standard_year",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Gladiator",
  "/wiki/Planet",
  "/wiki/Nyriaan",
  "/wiki/Dug",
  "/wiki/Gronson_Takkaro",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Herdringer",
  "/wiki/Gladiator_Night",
  "/wiki/Battle_of_Yavin",
  "/wiki/Trandoshan",
  "/wiki/Bounty_hunter",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Senator",
  "/wiki/Hack_Fenlon",
  "/wiki/Ahakista_system",
  "/wiki/Duros",
  "/wiki/Assassin",
  "/wiki/Angrigo",
  "/wiki/Unidentified_Kratchell_twin_(blaster_pistols)",
  "/wiki/Unidentified_Kratchell_twin_(disruptor_rifle)",
  "/wiki/Ezra_Bridger",
  "/wiki/Commandant",
  "/wiki/Cumberlayne_Aresko",
  "/wiki/Death",
  "/wiki/Officer",
  "/wiki/Speeder_bus",
  "/wiki/Credit_chip",
  "/wiki/Xexto",
  "/wiki/Wallaway%27s_Pawn_Shop",
  "/wiki/Thief",
  "/wiki/Ferpil_Wallaway",
  "/wiki/Artist",
  "/wiki/Stormtrooper",
  "/wiki/RA-7_protocol_droid",
  "/wiki/Bounty",
  "/wiki/Squad",
  "/wiki/Squad_Five_(Lothal)",
  "/wiki/Nikto",
  "/wiki/Ake%27s_Tavern",
  "/wiki/Twin",
  "/wiki/Speeder_bike",
  "/wiki/Capital_City",
  "/wiki/Capital_City_spaceport",
  "/wiki/TK-5331",
  "/wiki/Imperial_Military",
  "/wiki/Protocol_droid",
  "/wiki/Squad_Seven",
  "/wiki/Miner",
  "/wiki/Imperial_officer",
  "/wiki/Standard_day",
  "/wiki/Surveillance_droid",
  "/wiki/Monad_Outpost",
  "/wiki/Droid",
  "/wiki/Memory_wipe",
  "/wiki/Spaceport",
  "/wiki/Freighter",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Alien",
  "/wiki/Houk",
  "/wiki/Borbig_Drob",
  "/wiki/Feeorin",
  "/wiki/Warjak",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Posting_agency",
  "/wiki/Imperial_Enforcement_DataCore",
  "/wiki/Squad_Three_(Lothal)",
  "/wiki/Unidentified_Ranat_bounty_hunter",
  "/wiki/Unidentified_Nimbanel_bounty_hunter",
  "/wiki/Mining",
  "/wiki/Armor",
  "/wiki/Speeder",
  "/wiki/Merchant",
  "/wiki/Magnet",
  "/wiki/Homing_beacon",
  "/wiki/Gambling",
  "/wiki/Ishi_Tib",
  "/wiki/Credit",
  "/wiki/Blaster_pistol",
  "/wiki/Relby-v10_micro_grenade_launcher",
  "/wiki/Comlink",
  "/wiki/Pa%27lowick",
  "/wiki/Unidentified_Pa%27lowick_announcer",
  "/wiki/Slingshot",
  "/wiki/Taskmaster",
  "/wiki/Myles_Grint",
  "/wiki/Plastoid",
  "/wiki/HoloNet_News",
  "/wiki/Ezra%27s_Gamble",
  "/wiki/Ryder_Windham",
  "/wiki/August_5",
  "/wiki/2014",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Databank_(website)"
 ]
}