{
 "name": "Jenn",
 "display_name": "Jenn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 25 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Dreighton Triangle"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jenn was a Human female starfighter pilot who served as a commander in the Alliance to Restore the Republic during the Galactic Civil War. She was killed during a routine patrol of the Dreighton Triangle when one of the Galactic Empire's new TIE Phantom starfighters used its cloaking device to take her by surprise, damaging her X-wing and causing her to collide with Ensign Till's fighter.\nThe Human female Jenn was born around 25 BBY, during the final years of the Galactic Republic. At some point before 3 ABY, Jenn joined the Alliance to Restore the Republic as a starfighter pilot and rose to the rank of commander.\nFollowing the Battle of Hoth in 3 ABY, the Galactic Empire entered the final stages of development for the TIE Phantom, a new starfighter which was fitted with a cloaking device that rendered it invisible to other vessels. As the project neared completion, the Empire began a series of tests in the region of space known as the Dreighton Triangle, using reports of unexplained events in the region ever since the Battle of Dreighton during the Clone Wars as a cover for their operations. Around this time, Jenn was tasked to lead a flight group of three T-65 X-wing starfighters, including one flown by Ensign Till, on a patrol mission around the Dreighton Nebula. At first the group's sensors failed to detect any signs of activity but Jenn ordered one more pass before returning to base. Moments later, a TIE Phantom decloaked behind her X-wing and opened fire, tearing the starboard S-foils from the fuselage and disabling her stabilizer. Unable to control her fighter, Jenn drifted to port and collided with Till's X-wing, destroying both fighters and killing both pilots.\nJenn was a professional officer who was brave, intelligent, and who possessed a good sense of humor. She was good friends with Till and frequently teased the other pilot. On one such occasion, Jenn mocked Till's apparent fear of the ghost ship stories regarding the Dreighton Triangle.\nJenn was created for the 1995 LucasArts video game Star Wars: Rebel Assault II: The Hidden Empire, in which she appears during the opening cutscene. The character was portrayed in the game by actress Zachary Barton.\nRebel Assault II designer Vincent Lee's storyboards and scripts document, dated November 16, 1994, included a brief description of Jenn. Though not included in the game or its manual, the biography was adapted for use on the LucasArts website and the document was later printed in Rob Smith's Rogue Leaders: The Story of LucasArts. The version that appeared online places Jenn in her late twenties during the game whereas Lee's original version described her as \"late twenties to early thirties.\" Lee also made notes on the people he thought symbolized each character in the game, choosing actress Holly Hunter to represent Jenn. An early storyboard of the scene in which Jenn appears reveals that her flight group was originally called \"Gamma patrol,\" but the group was unnamed in the final game.\nProps and costumes created for the original trilogy of Star Wars movies were used during the filming of Rebel Assault II. The flight helmet worn by Jenn was one originally created for a Y-wing pilot in Star Wars: Episode VI Return of the Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/25_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Dreighton_Triangle",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/File:Jenn-RAII.ogg",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/TIE/ph_phantom",
  "/wiki/Cloaking_device/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/Till",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Battle_of_Dreighton",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Flight_group/Legends",
  "/wiki/Dreighton_Nebula/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/S-foils/Legends",
  "/wiki/Stabilizer/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Ghost_ship",
  "/wiki/1995",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Zachary_Barton",
  "/wiki/Vincent_Lee",
  "/wiki/November_16",
  "/wiki/1994",
  "/wiki/Rob_Smith",
  "/wiki/Rogue_Leaders:_The_Story_of_LucasArts",
  "/wiki/Gamma",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars",
  "/wiki/Flight_helmet/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy"
 ]
}