{
 "name": "Jenny  (Artorias)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "25 ABY",
      "Tsam P'ah"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Jenny was a female Human living on the planet Artorias when the Yuuzhan Vong invaded in 25 ABY. She had multiple sons and was a friend of Artorian Queen Nina Galfridian. Jenny was severely wounded during the initial Yuuzhan Vong attack and was captured along with Galfridian. She later succumbed to her wounds while in captivity aboard the slaveship Tsam P'ah.\nJenny was a female Human shopkeeper who lived on the planet Artorias. In addition to having at least two sons, she was a friend of the planet's queen, Nina Galfridian, and Galfridian's stepdaughter, Kaye. The Galfridians were visiting Jenny's shop when the extra-galactic Yuuzhan Vong invaded Artorias in 25 ABY. After Jenny greeted the Galfridians and inquired about the whereabouts of Nina's stepson, Finn, Nina asked how much a pot cost, but before she could finish the question, the pot exploded in Nina's hand. The shrapnel injured Jenny in the chest and mouth, and she collapsed into the Queen's arms.\nJenny was captured by the Yuuzhan Vong along with many other Artorians, including Nina and Kaye Galfridian, and was placed on board the slaveship Tsam P'ah with the other captives. When the invaders attempted to force Nina to serve as a slave to their commander, she instead requested that they treat Jenny's injuries, but they refused. Soon afterward, Jenny died from her wounds.\nJenny was a good friend of the Artorian Queen, sometimes addressing her by her first name rather than the formal title of \"Your Majesty.\"\nThe character of Jenny first appeared in the first issue of the Star Wars: Invasion comic book series, written by Tom Taylor. She later appeared in the next issue of the series. In both issues, she was penciled by Colin Wilson and colored by Wes Dzioba.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Artorias",
  "/wiki/Jenny/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Heart_of_Artorias",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Brown",
  "/wiki/Planet/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Artorias",
  "/wiki/Queen/Legends",
  "/wiki/Nina_Galfridian",
  "/wiki/Death/Legends",
  "/wiki/Slaveship",
  "/wiki/Kaye_Galfridian",
  "/wiki/Extra-galactic",
  "/wiki/Finn_Galfridian",
  "/wiki/Slavery/Legends",
  "/wiki/Sha%27kel",
  "/wiki/Invasion_1",
  "/wiki/Star_Wars:_Invasion",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tom_Taylor",
  "/wiki/Invasion_2",
  "/wiki/Colin_Wilson_(artist)",
  "/wiki/Wes_Dzioba",
  "/wiki/Invasion:_Rescues_4"
 ]
}