{
 "name": "Jenny",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Jenny was a human female from Mos Espa, on the desert planet of Tatooine. In 0 BBY, she worked as a B-girl at Chalmun's Cantina in Mos Eisley. She flirted with Han Solo, a Corellian smuggler who had a woman in every spaceport, on the occasions when he stopped on Tatooine. One day, Jenny came to sit on the smuggler's lap while he was awaiting news from Taggart about a cargo of glitterstim spice. From their booth, the two witnessed a bar brawl during which an old man whipped a lightsaber at an Aqualish pirate to defend his young protégé. When Solo's first mate, the Wookiee Chewbacca, joined them in their booth, Jenny realized that the Corellian did not even remember her name, conflating her with another of his female conquests. Offended, she threw the remainder of the man's drink in his face and stormed off. Whilst she was in the cantina, she sat and spoke with a Rodian.\nJenny first appeared in the 1977 film Star Wars: Episode IV A New Hope, in which she was portrayed by Jenny Cresswell. Although her scene with Han Solo did not make the final cut of the film, she can still be seen talking to a Rodian in the cantina in widescreen releases of the film. Although Cresswell's character had dark hair, Jenny is described as having pale hair in A New Hope: The Princess, the Scoundrel, and the Farm Boy. This article assumes that her brief film appearance shows her correct hair color.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jenny",
  "/wiki/Jenny/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mos_Espa",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/0_BBY",
  "/wiki/Chalmun",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Han_Solo",
  "/wiki/Corellian",
  "/wiki/Smuggler",
  "/wiki/Spaceport",
  "/wiki/Standard_day",
  "/wiki/Taggart_(smuggler)",
  "/wiki/Glitterstim",
  "/wiki/Spice",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Lightsaber",
  "/wiki/Aqualish",
  "/wiki/Ponda_Baba",
  "/wiki/Luke_Skywalker",
  "/wiki/First_Mate",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Rodian",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Jenny_Cresswell",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}