{
 "name": "Jerec  (Inquisitor)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Ruusan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Miraluka"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.86 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius",
      "Seven Dark Jedi",
      "Pentastar Alignment"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jocasta Nu",
      "Cronal"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Ameesa Darys",
      "Maw",
      "Bocas'eca",
      "Sariss"
     ]
    }
   ]
  }
 ],
 "content": "Jerec was a powerful Miraluka Jedi Master and Jedi archaeologist who turned to the dark side under the Empire, becoming a feared Inquisitor during the Galactic Civil War. Jerec was apprenticed to a Jedi archaeologist, Jocasta Nu, and became a Jedi archaeologist himself, versed in knowledge of the Jedi's past, especially the Sith. A Jedi Master during the Clone Wars, he was on a long-term deployment searching for ancient knowledge in the Unknown Regions when Order 66 was issued. Upon his return, Jerec was found by the Inquisitorius and allowed himself to fully succumb to the dark side.\nHe served the Empire as a High Inquisitor for many years and was allowed to delve more into Sith Lore in exchange for his allegiance. However, Jerec was in truth devoted only to himself. One of the most powerful Dark Jedi in the service of the New Order, Jerec continually sought ways to increase his power and supplant Emperor Palpatine and the Supreme Commander, his apprentice Darth Vader, at the top of the Empire. One of his chief obsessions was the Valley of the Jedi on the lost planet of Ruusan, which contained vast amounts of trapped Force power. After the Emperor's death at Endor, Jerec formed a band of seven Dark Jedi to seek out the Valley and entered a loose association with Grand Moff Ardus Kaine's Pentastar Alignment. He was able to find the legendary well of energy, and reached incredible heights of power by basking in its aura. However, for all his power, he was defeated in combat by Kyle Katarn, a novice Jedi who fulfilled an ancient prophecy, regarding freeing the Valley's trapped Jedi and Sith spirits. When Katarn offered him his fallen lightsaber in a final act of mercy, Jerec made one last attack and was struck down in the heart of the Valley.\nJerec was a Miraluka, a near-human species born physically blind but with the ability to \"see\" in the Force. He wore a thin blindfold over the place his eyes should have been throughout his life; this, along with the relative rarity of Miraluka, may have contributed to the widespread assumption that Jerec was simply a blind Human.\nAs a child, Jerec was discovered by Jedi Knight and archaeologist Jocasta Nu of the Jedi Order as having Force potential. Nu brought him to the Order for training. Years before 49 BBY, Jerec was selected by Nu, who maintained an interest in the young Miraluka and took him as her Padawan. A committed scholar herself, she encouraged Jerec to continually quest for greater knowledge and understanding. He developed a voracious thirst for answers to all possible questions, as well as picking up a deep sense of scholarly self-assurance and confidence in his own knowledge. Jerec's pursuit of learning extended to the physical disciplines, as he mastered the ancient Makashi form and Djem So form of lightsaber dueling.\nJerec's accumulation of knowledge was thrust fully into his own hands when he earned the rank of Jedi Knight while his master achieved the rank of Jedi Master. He also undertook to pass it on, taking Ameesa Darys as a Padawan and training her to knighthood by the time of the Clone Wars. This earned Jerec the rank of Jedi Master. Jerec served as an archaeologist for the Jedi, seeking out ancient lore and retrieving artifacts from across the galaxy. Among the ancient sites he pursued was the Valley of the Jedi, a battle site of incredible power which had been lost to the Jedi over the years. Jerec continued to seek it throughout his life, though his motivations became purely personal.\nDespite the rank of Master, his role as a Jedi archaeologist constantly gaining knowledge, and his prominence as one of the Jedi's foremost scholars and the protégé of a former Jedi Council member, Jerec was not content among the Jedi. He was beginning to feel that he had exhausted all the Jedi had to give him, and was growing restless, seeking to accumulate greater power—for to Jerec, knowledge was power. By this date, it would even seem that he was already considering the dark side as a possible source of knowledge; he thought that he had tapped the full potential of the light already.\nBefore the Clone Wars broke out, Jerec departed for the Unknown Regions at the head of a team of Jedi, tasked by the Jedi Council with finding lost artifacts. Jerec had ulterior motives in the search also, as he wished to find new, non-Jedi sources of learning on the expedition. This task was apparently fairly well-known among the higher-ranking Jedi, as Jedi Master and Council member Obi-Wan Kenobi immediately offered Jerec as a possible source of an outdated Jedi distress code near the close of the Clone Wars, though Jerec was not in fact the source.\nJerec did not return from that mission until after the close of the Clone Wars and the execution of Order 66. He made it as far as Coruscant before perceiving that the Jedi Order had been destroyed by the newly-arisen Galactic Empire; apparently the beacon which Masters Kenobi and Yoda had set to warn away the Jedi had by that time been deactivated. In the company of his fellow archaeologists, he fled back to the Unknown Regions. However, he had attracted the attention of the High Inquisitor Antinnis Tremayne, who pursued the group and managed to capture them. The Inquisitor offered the Jedi Master a decision: accept the dark side and serve the Emperor, Palpatine, and he could preserve his life. Refusal meant death. Jerec, already tempted by dark knowledge, took little convincing; in fact, he converted eagerly. A valued target of the Empire, he was marked for acquisition circa one month after the Declaration of a New Order, before he defected.\nJerec became a member of the Imperial Inquisition, a feared Imperial Intelligence division of Jedi hunters. Immediately upon his turn, he volunteered information he had regarding other Jedi on long-term missions who would be out of contact. Jerec sought them out and turned many of them, recruiting them into Imperial service. In a pattern that would continue throughout his career, Jerec cultivated their allegiance to him personally, building a cadre of Dark Jedi loyal to him and capable of helping him act on his vast ambitions. One of the many Jedi Jerec pursued was Maw. Said Boltrunian, part of a group of several Jedi Shadows, was hunted down with his companions sometime early in the Great Jedi Purge. Already ruthless and self-oriented, Maw was converted by Jerec and slaughtered his fellows with the help of his new master. Maw became one of Jerec's most prominent client darksiders, and so the Inquisitor tutored him in the dark side, especially tracking techniques.\nAs the number of Jedi fugitives decreased, Jerec was given the additional task of seeking out Jedi and Sith lore—quite similar to his original career as a Jedi. As one of the foremost Sith scholars in the new Empire—capable of speaking and writing in Sith—and an exceptionally powerful darksider, he assumed a prime position in the Imperial Palace's court. Though officially only a High Inquisitor, Jerec nonetheless outranked such personages as Procurator of Justice Hethrir and Supreme Prophet of the Dark Side Kadann. In fact, it was suggested that, had the Emperor not already had the Supreme Commander, Darth Vader, as his Sith apprentice, Jerec would have filled the position. Jerec felt the same way, and bitterly hated Darth Vader. He consistently attempted to undermine his rival and curry favor with Palpatine, seeking to replace Vader in his affections. The Emperor was unmoved and Lord Vader remained dominant. By the time of the Galactic Civil War, Jerec reported directly to Palpatine himself, in addition to taking order from him personally.\nNow in the service of Palpatine, Jerec lusted for Sith wisdom. He added Sith tattoos to his face, thin black lines flowing from the corners of his mouth. Jerec undertook to study the dark side in all its forms, reading from the Dark Side Compendium written by Palpatine himself. It was there that he gained the idea of forming a band of seven Dark Jedi melded to one will, a concept which would remain with him throughout his life. However, the Emperor noted the Inquisitor's aspirations, even in this early stage, to supplant him at the helm of the Empire, and cut off his servant's access to the Compendium.\nHowever, this was not enough to deter Jerec. He studied the Dark Force cult of the Prophets of the Dark Side on Dromund Kaas, cultivating a close relationship with the prophet Lord Cronal. It was from Cronal that Jerec learned more of the Valley of the Jedi, a legendary source of incredible power. The location of the Seventh Battle of Ruusan, it held the trapped spirits of hundreds of Jedi and Sith, which could be put to use by a skilled master. The place fascinated the Inquisitor, and dreams of harnessing its power fed his ambition. During these years, he encountered Qu Rahn, a Jedi Master who had survived the Great Jedi Purge and quested after the Valley himself, though Rahn was not captured.\nJerec was an extremely ambitious being, plotting from an early point to topple Vader as Palpatine's apprentice and even to supplant the latter as well. However, he was not so foolish as to think that he could overcome the two Sith Lords on his own. Instead, he built a network of patrons and allies, combining powerful backers with faithful subordinates.\nOne of Jerec's earliest acquisitions was the Jedi Shadow Maw, whom he turned to the dark side early in the Purge and took as a pupil and subordinate. Another early initiate was Bocas'eca. A Force-strong Twi'lek, Boc researched ancient Jedi heroes, including Newar Forrth, a hero of Ruusan. However, Boc was never recruited by the Jedi due to the death of Ryloth's Jedi Watchman in the year of his birth. Instead, Boc was taken as a slave and came into the possession of Terrinald Screed, then a Vice-Admiral. When Jerec encountered Boc in the service of the Admiral, he immediately perceived the Twi'lek's strength in the Force and demanded that Screed hand him over to be executed. Unable to resist an Inquisitor in such a matter, the Imperial officer gave up his slave, but Jerec did not kill Boc—instead, he took him as his own thrall, ripped Boc's knowledge of Ruusan from his brain, and immersed Boc in the dark side. In this way, the Inquisitor gained a twisted Dark Jedi servant, torn between loathing and devotion—an apprentice-slave.\nOne of Jerec's most fruitful relationships was with the Prophet of the Dark Side and Emperor's Hand Cronal. Besides tutoring him in the dark side and informing him about the Valley of the Jedi, Cronal also provided to Jerec the fruits of his dark side alchemy, the mutated Sithspawn Gorc and Pic. The transfer of these \"twins\" to the Inquisitor's control expanded his base of client Dark Jedi yet more. Still another benefit was his acquaintance with Sariss, an agent of the Prophets and Cronal's secret daughter. Sariss first encountered Jerec during his time training with Cronal on Dromund Kaas, and later was frequently sent to Jerec as an emissary of the prophets. It was in that period in which she developed a significant attraction to the former Jedi. She came to learn of his true plans, which fueled her desire to join him all the more. Via fierce lightsaber duels, Jerec humbled Sariss and bent her to his will. She became one of his favored subordinates, though her duties to the Prophets prevented her from openly joining him and spending her time at his side.\nJerec, though, was not content merely with semi-loyal agents. He also sought out patrons and backers. One of them was Lord Cronal, who provided him with dark side knowledge and subordinates. However, Jerec also needed financial support to fund his ambitions. To this end, he abused his position as a High Inquisitor, granting exemptions from audits made by the Inquisitorius in exchange for credits. Jerec swiftly became a billionaire due to these quiet patrons, both corporate and private. Government figures were not exempted: Grand Moff Ardus Kaine was at least one upper-level funder of Jerec's ambitions.\nWhile Jerec wielded great power and influence as a High Inquisitor, he kept his ability to use the Force hidden from the general public. While his status as a Dark Jedi was well-known in higher circles, most of the military and lower bureaucracy was unaware of his true nature. Jerec preferred to cultivate an aura of mystery, wowing subordinates with seeming omniscience and convincing numerous individuals that, despite his obvious lack of eyes, he could in fact see. Even the crew of his personal Star Destroyer, Vengeance, remained unaware, though he allowed occasional glimpses of his powers. Whether this enigmatic aura was part of his grand strategy or simply pleased him personally, it was a notable achievement for such a prominent Dark Jedi to keep his powers hidden.\nSidious was, however, wise to Jerec's desires. Having already cut off his access to higher Sith learning, such as the Dark Side Compendium, Sidious would continue to make use of the man, though he frequently assigned Captain Thrawn to the Vengeance as its commander in order to keep an eye on Jerec.\nShortly before the Battle of Yavin, Jerec led a mission to Sulon, the rural moon of Sullust. There, he sought to capture Morgan Katarn, leader of a Rebel cell operating from the satellite. When Katarn escaped the initial attack—disguised to look like a Rebel raid—Jerec staged an attack, also disguised as the work of Rebels, on the geothermal power station which the settlers were building and hoped to rely on. As intended, it drew the Rebels out in full force. That time, the attack was successful. Jerec faced down Katarn, who had been captured and brought before him, but the cell leader refused to disclose any information about his superiors. Content that Sulon had been pacified and realizing he would get no more from Katarn, Jerec decapitated him with the Jengardin double-bladed vibroblade which he was known to carry and ordered his head to be displayed on a pike at Sulon's spaceport. It was Maw, accompanying Jerec, who carried this order out.\nShortly thereafter, Jerec attended the graduation ceremonies at the Academy of Carida. The evening before the ceremony, he dined with General Rom Mohc, from whom he learned that Katarn's son, Kyle Katarn, had performed excellently in a training exercise earlier. Interested, Jerec took advantage of the ceremony to award Katarn his Medal of Valor, telling Katarn that he would be waiting for the stormtrooper at the top of his expected rise through the ranks. Jerec quite possibly sensed the Force in Katarn, and may have sought to groom him as yet another Dark Jedi.\nSome ten months after the Battle of Yavin, Jerec initiated his first recorded attempt to usurp power. Jerec had learned of the ancient Ithorian experiment Spore, an aggressively expanding hive mind capable of subsuming sentients to its will, and concluded that it would make an excellent tool by which to enslave armies to do his bidding. Confident that he could control Spore, he set out for the asteroid belt near Ithor where it had been entombed and locked away. There, he arrived just in time to find Tash Arranda stumbling back into the mining base set up on Spore's asteroid. She, her brother Zak, their adoptive uncle Mammon Hoole, the Ithorian Fandomar, and a trio of miners had become trapped in a strange tomb after attempting to break in, and only Tash had been able to squeeze out. Jerec swiftly dispatched a pair of stormtroopers to rescue the others. When they were returned to the base, Jerec proceeded to claim the crypt in the name of the Empire. When he returned to open it, he was enraged to find the door open and Spore escaped. Jerec, perhaps not trusting his men to comply with their own enslavement, had brought insufficient personnel to control the asteroid, and Hodge, the chief miner, had set Spore free, thinking whatever was in the crypt was valuable. However, Fandomar was aware of the true nature of Spore, and sabotaged the mining base, releasing the atmosphere so that Spore lacked the oxygen it required to propagate. Jerec returned to the Vengeance, angered and suspicious.\nHowever, Spore had infected Hodge, and upon crash-landing on Ithor's surface, it was set free in several individuals. Jerec followed it down alone in a shuttle. When he arrived, Spore gathered all its victims and approached him. Spore attacked, but Jerec used the Force to easily repel the vines which Spore used to spread its collective consciousness. Taking advantage of Spore's awe, Jerec explained to it that he wished to use Spore to take over the Imperial military, rendering every single stormtrooper, naval officer, and army trooper a part of a hive mind in service to Jerec as Galactic Emperor. Jerec's promises intrigued Spore, and it agreed to Jerec's plot, starting with the Vengeance. Spore quickly spread throughout the ship, taking over enough crew to operate the Star Destroyer. However, Tash Arranda and Fandomar infiltrated the ship, seized Hoole and Zak Arranda, and escaped aboard a pair of Starfly spacecraft, designed to flit through asteroid fields. They were able to lure Spore into the asteroid belt where the ship was attacked by a pair of space slugs, but it was insufficiently adept at operating the Vengeance to escape swiftly. The slugs managed to bring down the shields, whereupon the Vengeance was repeatedly hulled by multiple asteroids. The exposure to vacuum caused Spore to go dormant, but Jerec had already escaped in another Starfly.\nIn short order, Jerec had Imperial crews salvaging the wreck; they were able to recover the ship's computer core, which had remained entirely intact. Jerec had it installed in a new Star Destroyer, the Vengeance II, with which he replaced his old flagship. The failure of his plot subdued Jerec for the time being, however; indeed, it would have been almost impossible for such a costly failure not to attract questions from Palpatine. Jerec retired briefly to Sulon and ruled as its governor, building himself a massive tower on Barons Knoll in the capital of Barons Hed. While Jerec may have held the position itself longer, as he had subdued Sulon in 0 ABY, he had had multiple successors by 5 ABY; at any rate, he did not remain on Sulon and actively govern for a particularly long period of time.\nJerec was not wholly inactive in this period, however. He continued to build his wealth, and purchased, from his own pocket, a Super Star Destroyer variant which he also named the Vengeance, a name from which he seemed loath to depart. Pleased with this, he sent the Vengeance II to Vader's Death Squadron prior to the Battle of Hoth. It was in this period, as well, that he gained the allegiance of Sariss, and likely that of Gorc and Pic. However, Jerec kept a generally low profile, and it was not until the death of the Emperor that Jerec once again seized the initiative.\nThe Battle of Endor gave Jerec the push he needed to reclaim his dreams of conquest. In one stroke, the Sith Lords Palpatine and Darth Vader were killed, removing the two prime threats to Jerec's plans. Jerec began plotting to expand his reach, focusing on the Valley of the Jedi as a potential source of power. With it, he felt that he could build a new, glorious, and literally universal empire—not another iteration of Sidious's Empire, but a wholly new and unprecedented realm.\nSariss also took the opportunity afforded by the post-Endor chaos to leave her post on Tatooine and move permanently into Jerec's camp, becoming his chief lieutenant. She also managed to attach herself to a Panathan businessman as his lover; Sariss seduced his son, Yun, and had him kill his father. She then took Yun, a Force-sensitive, as her apprentice, bringing him—and the mineral-business fortune of her late lover—into Jerec's entourage as well. This gave Jerec six Dark Jedi—Maw, Boc, Gorc, Pic, Sariss, and Yun—at his command. Including himself, there were seven, just as in Sidious's Dark Side Compendium. Though he lacked knowledge of the techniques to subsume them all to his will, he was able to follow the basic principles of Sidious's teachings.\nWith control of the Super Star Destroyer Vengeance, Jerec set himself up as a warlord. However, despite being out only for himself, he was not above swearing false allegiance to other masters. He claimed loyalty to the Pentastar Alignment, the splinter state set up by his old financier, Grand Moff Ardus Kaine. There Jerec became a Great InQuestor of Judgment, Kaine's regime's version of an Inquisitor, and Jerec brought in many former Inquisitors to join the order's ranks. Whether his public allegiance to Kaine was well-known or not, his second was not; Jerec covertly swore allegiance to the Prophets of the Dark Side—not the pretenders vying with Ysanne Isard for power, but the genuine Prophets, now in hiding, who had tutored him in the past. Jerec tutored all his Dark Jedi on the basics of the Prophets' Dark Force religion; this was likely a sop to his backers, as Jerec was unlikely to have believed fervently in anything but himself. To this secret subordination was added another when Cronal contacted him around a year after Endor. The old Prophet, now on Byss with the reborn Darth Sidious, revealed the Emperor's survival to Jerec and ordered him to search out the Valley of the Jedi and claim it for the Emperor. Jerec was, of course, already eagerly looking for it, but he happily drew resources from Sidious's Deep Core forces, just as he did from the Prophets and the Alignment. As a token of loyalty, Jerec dispatched the Vengeance II to Byss; he had reclaimed it sometime after dispatching it to Vader. However, he ultimately retained a fleet of at least three Imperial-class Star Destroyers accompanying Vengeance. He also had command of the cargo ship Sulon Star, among others, and retained dominance of Sulon.\nEventually, Jerec learned that Qu Rahn, the Jedi survivor he had earlier encountered, had discovered the Valley of the Jedi's location. He was able to track Rahn to the planet Dorlo, where Rahn and several Rebel companions eluded Maw, Sariss, and Yun on the surface. However, the Rebels' CR90 corvette was unable to escape the Vengeance in orbit, and Jerec captured the Rebels and had them brought before him and his six Dark Jedi. Rahn's serenity in the face of capture filled Jerec with fear; this was a truly dangerous man indeed. However, Jerec quickly mastered his fear and questioned Rahn, but the Jedi would not reveal the coordinates of Ruusan. Jerec began slaughtering his companions one by one, but no answer was forthcoming. Rahn tried to provoke Jerec into killing him, making absolutely sure his knowledge would not get out. Jerec refused to take the bait, however. Instead, he probed Rahn's mind with the Force and tore the information from it: Rahn did not know the coordinates, but Morgan Katarn had, and Katarn had stored a map in his home. For Jerec, familiar with Katarn, that was all the information he needed. Rahn had other ideas, however, and summoned Yun's lightsaber to him. He was able to wound Boc and cleave Maw in two across the hips, but Jerec swiftly stepped in, blasting Rahn with a disabling burst of Force energy. As Rahn fell to his knees, Jerec stepped in and struck the killing blow.\nJerec dispatched his agents to Sulon, where Katarn—whom Jerec had killed only months after he learned the location of the Valley while ferrying Rebels to sanctuary on Ruusan—had stored the coordinates. Sariss, Boc, and Yun went through Katarn's house with the aid of Maw's Grave Tusken cronies. There, they found that Katarn had carved an astrographic map into the ceiling of his workshop. They removed the panels and took them to Barons Hed, where Jerec had an independent contractor waiting to decipher it. That contractor was the droid information broker 8t88, who had served as an agent of Jerec for some time. In the Government House in Barons Hed, 8t88 decoded the map and sent the location to Jerec. With that in hand, Jerec felt little need to retain 88's services. Sariss, Boc, and Yun returned to the Vengeance; Gorc and Pic were left to provide 88 his \"reward\"—deactivation. Jerec set out for Ruusan with his flotilla.\nJerec's battle group arrived in short order, but Jerec ordered mapping surveys and orbital scans before descending to the surface. When scans turned up a small fort as the center of civilization on the planet, Jerec ordered Sariss, Boc, and Yun to land and seek as much information as possible from the residents. When they confirmed that the settlers knew nothing of the Valley, Jerec ordered that the settlement be wiped out. Meanwhile, his forces went to work erecting a base, boring to the heart of the Valley and building barracks, watchtowers, cargo storage and processing, and even a docking tower for the Sulon Star—in short, all the necessary structures for a long-term, heavily fortified garrison, complete with heavy guard patrols. In addition to that, Jerec also moved to exploit the old technology and artifacts stored in and around the Valley, finding some ancient artifacts whose technology could be exploited for financial gain. At last, when the Valley was nearly prepared for Jerec's arrival, Jerec moved his quarters from the Vengeance to the surface, bringing Sariss, Maw, Boc, and Yun with him. While Jerec directed the operations, he sent the other Dark Jedi out as his deputies, handling various military, organizational, and supervisory matters.\nHowever, 8t88 had earlier been contacted by Kyle Katarn, Morgan's son and the stormtrooper whom Jerec had decorated some six years ago, now a notorious commando employed by the New Republic. The meeting was known to Jerec, who approved it as an attempt on the young Force-sensitive's life. Katarn wished to know the identity of his father's killer. 88 told him the truth: it had been the work of Jerec. However, Katarn was further informed, 88 was in the employ of Jerec, and Katarn could hardly be left to live. He ordered that Katarn decode a data disc belonging to his father; when Katarn refused, 88 ordered his thugs to execute the mercenary. Katarn escaped, however, taking the data disc from 8t88, who barely escaped in his Imperial-provided Lambda-class shuttle. Katarn then received a vision from Rahn's Force ghost, revealing Jerec's plans. Katarn set off for Sulon, where he arrived just as Jerec's Dark Jedi were leaving. He used the disc to access a message from his father and Rahn's lightsaber, stored for him. With that, Katarn tracked down the map, which Yun, who was protecting 8t88, destroyed. Katarn defeated Yun in combat but let him go free; he then tracked down 8t88 aboard the Sulon Star, which was docked at the Barons Hed starport's fueling area. Katarn killed Gorc and Pic, delivering the first fatalities to Jerec's seven Dark Jedi. He then retrieved the coordinates from 88's severed head, sending him off to Ruusan after a relatively brief delay. Katarn and his partner, Jan Ors, recruited a New Republic crew to insert them on Ruusan undercover. Their disguise as an Imperial freighter crew got them past Ruusan's security, where they eventually were able to leave the crew and seek out the Valley.\nJerec was not easily evaded, however. He was able to reach out and perceive Katarn in the Force as he attempted to reach the Valley. Rather than destroy him, though, Jerec preferred to attempt his corruption, adding the fledgling Jedi to his retinue. While Katarn infiltrated Jerec's complex surrounding the Valley, Ors stayed behind, where Jerec's stormtroopers captured her. Meanwhile, Katarn ascended to the top of the docking tower, where all five Dark Jedi and the captive Ors awaited him. Jerec allowed Maw, who had recovered from the amputation he suffered at Rahn's hands and now moved propelled by his own considerable rage focused through the Force, first crack at Katarn. Katarn struck the old Jedi Shadow down and, when Maw taunted him with gruesome and inaccurate tales of Morgan Katarn's death, to which Maw had been party, killed him in anger. Into this vulnerable moment stepped Jerec. Leading Boc and Sariss, who held Ors between them, Jerec urged Katarn to give in to his rage, strike down Ors, and feel the power of the dark side—his \"true destiny\" and \"true power.\" Katarn felt the temptation, but pulled away and rejected Jerec. Satisfied that Katarn would not be turned, Jerec moved to dispose of him. A blast of Force energy hurled Katarn back and into the Sulon Star, still docked at the tower. The Star's power failed and it began to plummet to the surface, where it exploded. Surely, Jerec thought, Katarn would not survive that.\nKatarn was not a man to be underestimated, however, and was able to make it to his ship, the Moldy Crow, which had been docked aboard the Star after Jerec's men captured it. The Crow screamed out of the crashing ship, piloted by Katarn, but Katarn was unable to keep control and nicked a rock formation, sending the ship spinning out of control. Sariss, Boc, and Yun were dispatched to the crash site. There, they found Katarn unconscious and prepared to execute him. Boc destroyed his lightsaber, but was sent by Sariss to report to Jerec that Katarn had been found and would be killed in short order. As Sariss prepared to strike down Katarn, who was just regaining consciousness, Yun intervened. Remembering Katarn's mercy on Sulon and goaded to doubt the dark side by the spirit of Rahn, Yun blocked her strike. Sariss reflexively attacked Yun, ending his life. However, Katarn awoke fully at that moment, seized Yun's lightsaber, and used it to out-duel Sariss. Jerec was now down to one Dark Jedi servant and Katarn was still on the loose.\nJerec was not particularly concerned. He and Boc, with Ors in tow as a hostage, proceeded to the core of the Valley, which was finally accessible and ready for Jerec. Jerec was in a state of ecstasy as he beheld the incredible power of the Valley. Walking to the central dome which covered the well of energy, Jerec basked in its glow. Using the Force, he opened the dome and leaped inside to the absolute heart of the Valley's power. There, he engaged in meditation, hovering cross-legged among the captive spirits of the Jedi and Sith of ages past as he bent them to his will and leeched their strength. Reveling in the Force energies of the Valley, he reached a state of near-apotheosis in which he gained total omniscience. At long last, total knowledge—something which he had coveted for countless years—was completely, fully in his grasp, and untold power came with it.\nWhile Jerec floated, Katarn infiltrated the Valley complex, fighting his way through Jerec's stormtroopers to the Valley floor. There, he freed Ors, but was attacked by Boc. After a hard-fought battle, Katarn overcame Boc, slaying him under the statue of Newar Forrth, Boc's old hero. Jerec was aware of all that transpired, however, and burst from the mound in an eruption of light and energy. Confident in his own incredible power, he prepared to do away with Katarn. Katarn surrendered to the light side and trusted his instincts—and raised a shield of light side energy around Jerec, cutting him off from the dark side and from his hold on the Valley's power.\nHis connection severed and his power diminished, Jerec fell heavily to his knees, his lightsaber tumbling from his hand. As Katarn stood over him, Jerec taunted and goaded the Jedi, reminding Katarn that he had killed Morgan Katarn. Katarn would not give in to the dark side this time any more than he had the last. Instead, he performed an act of Jedi mercy, throwing Jerec's lightsaber back to him. Jerec could have accepted Katarn's mercy and ran. That, however, was not his way. Instead, he rose and attacked, but Katarn cut him down in one swift motion. Katarn's saber passed through his body as each charged past the other; realizing what had happened, Jerec stood stock still, contemplating his defeat and death, knowing eternal torment awaited him. As his body crumpled to the ground, it lost substance, dissolving with a flash into Chaos and long torment within the Valley.\nEven as a Jedi, Jerec was covetous of knowledge and haughty in demeanor. Jocasta Nu built in him a deep love of learning, telling him that answers came only to those who sought them most devotedly. This developed into an association of knowledge with power, causing Jerec to pursue knowledge—and power—even more passionately. That passion burned so brightly that it pushed Jerec beyond the bounds of the Jedi Order; after he attained Jedi Mastery, he felt that he had achieved as much knowledge as he could with the Jedi. He even began to consider looking into the secrets of the dark side. The Jedi sense of morality, then, was not deeply ingrained in him; instead, he prized the Order only for what it could deliver to him. These traits contributed to his fall; when faced with the choice to turn or die, the outcome was hardly in question. He was not attached to the Jedi Order or its belief structure nearly enough to die for it, and Jerec was already eager for the dark side's forbidden knowledge. It was an easy transition for Jerec.\nJerec was ambitious as well, building a cadre of darksiders around himself and constantly seeking to supplant Vader and Sidious and advance his own power. He wished not to advance quietly through a power structure ruled by another being but to create and rule his own. Kyle Katarn, before he was aware of his own Force-sensitivity, felt Jerec as an all-consuming hunger upon first meeting him, a man who would let nothing stand in his way. Indeed, Jerec was devoted only to himself and sought fanatically to advance his personal interests. From the beginning, he cultivated a body of Dark Jedi, personally turned to the dark side and owing their careers to him, upon whom he could call as supporters. Even by the standards the Empire , Jerec was infamous for his sense of senseless sadism and cruelty, one that even surpasses the Emperor as he often enjoys torturing his victims with pure glee and if he wanted to do, kill them in the most savage and brutal way possible, much like he beheaded Morgan Katarn with a vibroblade and later had his brutal Acolyte Maw take his thrust it on a spike for everyone to witness . His savage nature is also shown when gleefully decapitated Qu Rahn with his lightsaber when Jerec paralyzed him with the force He was also a political maneuverer as well, scheming against Vader and the other Dark Side Adepts in the Imperial Palace, and gained a reputation as an opportunist and a traitor. Jerec built a network of financial backers to support his hunger for power and engaged in at least one attempted revolt, though the disastrous failure of the Spore plot kept him from acting on his ambitions again until Palpatine and Vader died at Endor. At that point he resumed his maneuvering, playing three sides against each other—even the reborn Palpatine, whose reach had been stunted and who no longer exerted the same power over Jerec—for his own benefit, confident that securing the power of the Valley would make him unassailable and allow him to create a grand new empire over which he would rule as a god.\nJerec also went to great lengths to cultivate an aura of mystery and power around himself, which built a fearful reputation for him, something he seemed to relish. Jerec kept his Jedi abilities hidden from his subordinates, presenting himself as a non-Force-sensitive to the public up through 0 BBY at least, though occasional flashes of Force power were permitted. By his time as a warlord, he used his lightsaber openly and was generally known as a Dark Jedi.\nAlthough never having served in the Imperial military, and finding the military mannerisms, culture and language pointless, he did attain a high military position. He tried to express his authority, even if by just rattling off some nonsense commands.\nHe never dropped the charade that he could see, however. Despite the lack of eyes, the Miraluka's Force abilities allowed him to approximate sight and he continually acted as if he were receiving visual input  fooling half the Super Star Destroyer's crew into thinking that he could somehow see through the band over his sockets. He also flaunted what seemed to be his uncanny knowledge and perceptiveness, frequently knowing what a subordinate was about to report or demonstrating the ability to predict an opponent's next move with great accuracy. This combined to give his soldiers the impression that he possessed supernatural powers and elicited their fear and respect, as well as feeding Jerec's considerable ego.\nAnother peculiar trait of Jerec's was his interest in mind games. He continually wished to keep his subordinates off-balance and conscious of their inferior position to him. He monitored all comm transmissions from his soldiers during combat and used probe droids and the Force to monitor even more; even when he did nothing his troops were conscious of his supervision. This distressed many of his subordinates; such close supervision was as effective as micromanagement in blunting their initiative and making them fully feel his superior position. Jerec also sought to keep his subordinates off-balance and dependent upon him. He never gave a greeting but instead cut immediately to the point of his message, throwing off the expected rhythm of conversation and sending the other individual scrambling for words. He also asked questions to which he knew the answer; the other individual knew that Jerec already knew the answer and that Jerec was aware of the fact that the subordinate could tell that Jerec knew. Nevertheless, the other person was obliged to provide the answer anyway; the execution of such a pointless task wore on the spirit of the other and demonstrated Jerec's power over the subordinate. He often kept his quarters dark so as to discomfort and disorient visitors; a dependence on light was not a disadvantage he shared.\nAnother favorite mind game involved a bowl of touchstones he kept in his cabin aboard the Vengeance. The stones came in two types; those to be eaten and those to be popped, at which they would release a pleasant scent. Though visually indistinguishable, the two types were quite different; those to be eaten would emit extremely foul odors upon being popped while those to be popped would be highly distasteful if consumed. Jerec, through his non-visual senses, was capable of telling the difference where most other beings were not. Jerec would offer a touchstone to those who entered his cabin—this game was especially frequently played with his lieutenant Sariss—and the other would have to ask Jerec what was to be done and affirm his superiority or gamble on a course of action and risk displeasure and embarrassment. Sariss in turn constantly attempted to manipulate Jerec through flattery and deception, a fact of which Jerec was aware. In fact, Jerec enjoyed the pair's power games, which entertained him and fed his ego.\nDenigration was not Jerec's only mode of manipulation, however. He possessed an ability to earn the respect of others and through his charisma cause them to look up to him. He was able to attract Sariss and earn her admiration; she continued to seek his approval throughout her career; it was of considerable importance to her to have it. Yun especially was desperate to please Jerec. Simple appeals to his \"need\" for Yun's help and assignments to supervise tasks built Yun's self-esteem and left him glowing with Jerec's goodwill. On the shuttle trip from Vengeance to Ruusan, Jerec entertained Yun throughout the entire flight with amusing anecdotes and stories; Jerec had charm and charisma which he could use at will when he found it appropriate.\nJerec's manipulations—the aura of mystery and power, the humiliation, the well-deployed charm—fed his ego, but they also served the purpose of reminding his subordinates of their inferiority to him.\nThat was not solely for Jerec's pleasure; feeling that his subordinates had more power than they were aware of, it was necessary to conceal his own weaknesses and desires, even if it meant controlling himself and abstaining from doing things as he wanted; for example, when Rahn's team was captured, instead of using the Force to learn their findings, as he wanted, he constrained himself, staging a procedure of interrogation and executions, before eventually leaving Rahn last, and prying the information from him anyway. Convincing others that his power was so much greater than theirs, helped keeping them separate and disorganized, and himself safe from being overthrown.\nJerec was, in something of a paradox, both indulgent and spartan. He kept his quarters minimalistic, though his cabin was the largest aboard the Vengeance; material objects meant nothing to him, and his quarters were accordingly free of ostentation and display. Though a billionaire, he had few enough personal possessions to pack into a travel case, and all were functional or of great significance to him. Jerec was attached to those objects he did have, however, and each was handpicked; he resented others touching them or interfering with his belongings. His cabin aboard the Vengeance was furnished only with a standard bunk, custom chair, and table. He had the touchstones, but no mementos or knickknacks. Jerec was not self-denying, however; objects simply held no significance for him beyond their function.\nHe greatly enjoyed music, being especially pleased with Borna's second symphony, despite the fact that the composer had been executed as a rebel and the music was in fact anti-Imperial. Jerec also used the touchstones to enhance the experience of the music by providing special scents or tastes in manners that he felt complemented the music. Because of his blindness, non-visual senses played a large role in Jerec's enjoyment; besides music, he also enjoyed food, being known to give special consideration to his dinner—after executing Rahn, one of his first orders was to have a meal prepared. He also focused on scent; the smell of his meals was as important as the taste, and the use of smells from touchstones to add to the musical experience indicated an attachment to scent. Overall, Jerec preferred to indulge his senses, though the nonfunctional trappings of luxury held no appeal to him.\nJerec was also fluent in multiple languages; he spoke, read, and wrote the Miralukese of his species as well as Galactic Basic Standard. His scholarly pursuits and position in the Imperial court also led him to familiarity with the archaic High Galactic language, and he could speak, read, and write the Sith, possibly from his days as an archaeologist who would need to be familiar with Sith artifacts. A true polyglot, he was also conversant in the major trade languages Huttese and Bocce as well as Zabraki.\nJerec was a powerful user of the Force; Tash Arranda, an untrained Force-sensitive, perceived him as being not quite as strong as Darth Vader, whom she had earlier encountered. He was not, however, deeply attuned to the Unifying Force. Jerec's natural power was greatly augmented by the Valley of the Jedi; tapping even a stray stream of its power allowed him to approach what he felt to be omnipotence. Qu Rahn, as a Force ghost, warned Kyle Katarn that with the Valley's power, Jerec could wipe out life with a simple thought; Jerec felt much the same way about his possible power. His time in the Valley granted him limitless knowledge, as well as Force Powers beyond what he thought was possible—though he was unable to leverage this information in time to prevent his being cut off from the power of the Valley and the Force itself and being slain by Kyle Katarn. Despite not being able to use the power of the Valley to defend himself, Jerec was well aware of how his soul was going to suffer for his defeat at that spot, showing that he retained the knowledge he gained.\nJerec possessed the native Miraluka ability to see using the Force; he could not see holograms, but was able to sense beings and physical objects. Tash Arranda felt persistent waves of dark side energy emanating from Jerec when she encountered him; she mentally described the effect as similar to an insect using its antennae to feel its way about.\nJerec was talented at reading minds; he was able to pry information even from actively resisting consciousnesses. He was able to probe Rahn's mind when the Jedi was captured and learn from him that Morgan Katarn had knowledge of the location of the Valley of the Jedi, even though Rahn was a Jedi Master attempting to keep the information secret. Nevertheless, Jerec penetrated Rahn's mental barriers and retrieved the information. Other areas of particular power were telekinesis, in which he had great control, and in the defensive aspects of lightsaber fighting; as a practitioner of Form II and Form V, Jerec's defense was a difficult one to penetrate.\nJerec was proficient in other Force powers as well; he was capable of launching concentrated blasts of Force energy of the sort which he used to knock back Kyle Katarn on the Ruusan docking tower. More than a simple Force push, it emanated from his hand as a ball of red-tinged energy and impacted upon Katarn in a flash of light, driving him back. Jerec also mastered what may have been simply a stronger application of the same power: large blasts of devastating explosive Force energy which would not merely release kinetic force against an opponent but would deal heavy damage, badly wounding or killing the enemy. Jerec used another power which manifested itself as a ball of energy, though it had different effects, in disabling Rahn. The burst of energy struck Rahn and drove him to his knees while enveloping him in white light; it appeared to have a disabling or paralyzing effect.\nWhen Jerec captured Rahn, the Jedi Master attempted to will himself to die; however, Jerec was able to counter this, overpowering Rahn and ending his use of the technique. This ability was fairly common among Inquisitors, and Jerec was not an exception. This may have been related to Jerec's ability to cloud another's connection to the Force, cutting off or weakening it with the power of the dark side. Jerec had also mastered Force lightning, as well as being able to emanate his hatred through the Force in waves of darkness and rage so intense as to disorient and disable his enemies; powerful dark side skills indeed.\nJerec was a tall man; early in the Galactic Civil War he was noted as being thin to the point of emaciation, but by his time as a warlord he had reached a relatively average weight; the cause of the change, or even which state of being was more natural to Jerec, was unclear. Jerec's hair was inconsistent, as well. He kept his head shaved at some points in his career; at the time of his death, he wore his hair at a moderate length. He was balding, however, and lacked much hair on top of his skull.\nThe rest of Jerec's appearance as an Inquisitor was fairly consistent. He possessed curving tattoos, of Sith significance, around his mouth as early as 0 BBY and likely acquired them even earlier than that. It is highly unlikely, however, that he would have had such tattoos as a Jedi. He also wore a thin black leather band across his nonexistent eyes. Jerec's clothing remained fairly consistent: he favored black trousers, a high-collared tunic, and boots. He also wore armor at almost all times; he was rarely seen without a black breastplate and red pauldrons. Given its limited coverage, whether the armor was expected to be functional or was merely a cosmetic affectation was unclear. Over that he wore a black robe with red sigils along its border; on at least one occasion he chose a hooded robe, though his robes were generally not hooded.\nJerec was played by Christopher Neame in the live action cutscenes of Star Wars: Jedi Knight: Dark Forces II. Neame provided the character's voice as well, but in Jerec's one appearance in gameplay, Jerec was rendered as a CGI model. In the game, Jerec was the leader of the group of villains opposed by player-character Kyle Katarn and appeared in the final level as the ultimate boss of the game. In the non-canonical dark side ending of the game, Katarn gives in to the dark side when tempted by Jerec, but Jerec's actions do not change; he casts Katarn into the Sulon Star regardless.\nJerec has also appeared in the graphic novella adaptations of the Dark Forces series, where his perspective is expanded. Audio dramas were produced based on the graphic novellas, including Soldier for the Empire, Rebel Agent and Jedi Knight. In all these instances, Jerec was voiced by Allen Hamilton. Jerec further appeared as the villain, alongside Spore, in the children's book Galaxy of Fear: Spore, the ninth entry in a series which featured heavy cameos from heroes and villains of both the films and expanded universe.\nGiven the fact that Jocasta Nu took notice of Jerec while she was still an archaeologist, this must have taken place before her acceptance of the Jedi librarian position by 49 BBY. This places an absolute minimum on Jerec's age at the time of his death, making him no less than 53 years of age. This is a few years older than the age of Christopher Neame, who portrayed him; Neame was no more than 50 at the time of his portrayal. However, Jerec's history hints at a somewhat older age; he was trained by Nu as an archaeologist, seeming to imply some degree of training in the field. As this would be unlikely to happen in her position as Jedi Librarian, this suggests that Jerec's training was mostly or entirely complete before that appointment. Assuming that Jerec completed his training around the age of 20, that would provide a rough minimum age of 74 for Jerec at the time of his death, significantly older than Neame. However, Jerec's status as a near-human and the extension of middle age with the advanced medical technology of the Star Wars galaxy does not render an age in the seventies and an appearance in the fifties necessarily incompatible.\nJerec's appearance has been described differently over the years; Jerec's in-game model is rather thin and is bald, and most textual depictions of Jerec mention him as being gaunt and bald or with a shaved head. However, Neame himself was not particularly thin and, while suffering from male-pattern baldness, was not completely bald. Most illustrations have followed Neame's appearance in depicting Jerec. One exception, however, is his illustration in The New Essential Guide to Characters, which shows what appears to be a slightly thinned version of Neame with a shaved head. The Dark Forces novellas describe Jerec as extremely thin and with a shaved head, yet illustrations in the books depict him in accordance with Neame's appearance. No explicit reconciliation of these facts has been made in the canon. Additionally, Jerec's skin is described as being brown at one point in Soldier for the Empire, contrary to every other physical or textual description of him.\nJerec's identification as a Miraluka in The Dark Forces Saga came after years of identification of Jerec as a blinded Human; all prior sources to identify his species listed him as Human. A phrase in Rebel Agent suggests that Jerec was some human who had lost his eyes some time before . Notably, however, Galaxy of Fear: Spore foreshadowed this retcon by having noted Senior Anthropologist Mammon Hoole mention that while Jerec appeared Human, he suspected that the Dark Jedi came from a naturally blind species.\nWhile The Dark Forces Saga cites Cronal as the source of Jerec's knowledge of the Valley of the Jedi, the Power of the Jedi Sourcebook has him searching for it in his days as a Jedi. While this has not been officially addressed, it is possible that Jerec's knowledge of the Valley was incomplete as a Jedi.\nJerec's likeness was reused in the expansion pack to Jedi Knight, Star Wars: Jedi Knight: Mysteries of the Sith, as a type of statue scattered throughout the last few levels.\nIn the spanish version of the game, the text crawl is different from the original and identifies Jerec as a fully-fledged Sith Lord instead of a Dark Jedi and gives him the name ''Darth Jerec'', although the rest of the game translation outside of the text scrawl is more faithfull to the original and properly establish him as a Dark Jedi from the start.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Jerec_(Deputy_Minister)",
  "/wiki/Deputy_Minister/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Ruusan/Legends",
  "/wiki/Miraluka/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Seven_Dark_Jedi",
  "/wiki/Pentastar_Alignment",
  "/wiki/Jocasta_Nu/Legends",
  "/wiki/Cronal",
  "/wiki/Ameesa_Darys",
  "/wiki/Maw_(Dark_Jedi)",
  "/wiki/Boc_Aseca",
  "/wiki/Sariss",
  "/wiki/Qu_Rahn/Legends",
  "/wiki/Force_ghost",
  "/wiki/Kyle_Katarn",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_archaeologist",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/High_Inquisitor",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/The_Force/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Ardus_Kaine",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Poem_of_Ages",
  "/wiki/Lightsaber/Legends",
  "/wiki/File:QuRahn-Jerec.ogg",
  "/wiki/Near-Human",
  "/wiki/Force_sight",
  "/wiki/Human/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/49_BBY/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Form_II/Legends",
  "/wiki/Form_V",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Antinnis_Tremayne",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Boltrunian",
  "/wiki/Jedi_Shadow",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Sith_(language)",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Procurator_of_Justice",
  "/wiki/Hethrir",
  "/wiki/Supreme_Prophet",
  "/wiki/Kadann",
  "/wiki/Darth/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Sith_tattoo",
  "/wiki/Dark_Side_Compendium",
  "/wiki/Dark_Force",
  "/wiki/Prophets_of_the_Dark_Side",
  "/wiki/Dromund_Kaas",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Thought_bomb",
  "/wiki/Yun",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Newar_Forrth",
  "/wiki/Ryloth/Legends",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Terrinald_Screed/Legends",
  "/wiki/Vice_Admiral/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Sithspawn/Legends",
  "/wiki/Gorc",
  "/wiki/Picaroon_C._Boodle",
  "/wiki/Emissary",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Vengeance_(Imperial-class,_Jerec)",
  "/wiki/Captain/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Spore",
  "/wiki/Morgan_Katarn",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Subjugation_of_Sulon",
  "/wiki/Sulon",
  "/wiki/Moon/Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jengardin_double-bladed_vibroblade",
  "/wiki/Academy_of_Carida",
  "/wiki/General/Legends",
  "/wiki/Rom_Mohc",
  "/wiki/Medal_of_Valor/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Hive_mind/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Asteroid_belt",
  "/wiki/Ithor/Legends",
  "/wiki/Tash_Arranda/Legends",
  "/wiki/Zak_Arranda/Legends",
  "/wiki/Mammon_Hoole",
  "/wiki/Fandomar_Nadon",
  "/wiki/Hodge",
  "/wiki/Oxygen/Legends",
  "/wiki/Vengeance_II",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Vengeance_(Vengeance-class)",
  "/wiki/Starfly",
  "/wiki/Exogorth/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Government_House_(Sulon)",
  "/wiki/Barons_Knoll",
  "/wiki/Barons_Hed",
  "/wiki/0_ABY/Legends",
  "/wiki/Death_Squadron/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/8t88/Legends",
  "/wiki/File:KnownAsJerec-JKDFII.ogg",
  "/wiki/Tatooine/Legends",
  "/wiki/Panatha",
  "/wiki/Great_InQuestor_of_Judgment",
  "/wiki/Church_of_the_Dark_Side",
  "/wiki/Ysanne_Isard",
  "/wiki/Byss/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Sulon_Star",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Dorlo",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Grave_Tuskens",
  "/wiki/Droid/Legends",
  "/wiki/Fort_Nowhere",
  "/wiki/New_Republic/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Fuel_City",
  "/wiki/Jan_Ors",
  "/wiki/Moldy_Crow/Legends",
  "/wiki/Falling_Leaf",
  "/wiki/Chaos/Legends",
  "/wiki/File:RecognitionIsSweet-DFSftE.ogg",
  "/wiki/Desann",
  "/wiki/Dark_Side_Adept",
  "/wiki/Touchstone",
  "/wiki/Borna%27s_second_symphony",
  "/wiki/Borna",
  "/wiki/Miralukese",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/High_Galactic/Legends",
  "/wiki/Trade_language/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Bocce/Legends",
  "/wiki/Zabraki/Legends",
  "/wiki/Unifying_Force",
  "/wiki/Sever_Force/Legends",
  "/wiki/Soul/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_Burst",
  "/wiki/Force_Destruction",
  "/wiki/Force_lightning/Legends",
  "/wiki/Hatred",
  "/wiki/Meck_Odom",
  "/wiki/Christopher_Neame",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/Dark_Forces:_Rebel_Agent_audio_drama",
  "/wiki/Dark_Forces:_Jedi_Knight_audio_drama",
  "/wiki/Allen_Hamilton",
  "/wiki/Galaxy_of_Fear:_Spore",
  "/wiki/Jedi_librarian/Legends",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Senior_Anthropologist",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/Sith_Jedi_Statue",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/Star_Wars:_Republic:_Dreadnaughts_of_Rendili",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/Dark_Forces:_Rebel_Agent",
  "/wiki/Dark_Forces:_Jedi_Knight",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast_demo",
  "/wiki/Category:Audio_files_of_Jerec",
  "/wiki/Category:Images_of_Jerec",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Game_Room",
  "/wiki/Star_Wars_Galaxy_Magazine_8",
  "/wiki/Star_Wars_Insider",
  "/wiki/Building_a_Better_Jedi:_Justin_Chin_on_Dark_Forces_II",
  "/wiki/Star_Wars_Insider_31",
  "/wiki/Star_Wars_Galaxy_Magazine_11",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II:_The_Official_Strategy_Guide",
  "/wiki/Star_Wars_Galaxy_Magazine_13",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_40",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Emperor%27s_Pawns",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/Jedi_Knight_II:_Jedi_Outcast_(article)",
  "/wiki/Star_Wars_Gamer_9",
  "/wiki/Wizards.com",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_85",
  "/wiki/Order_66:_Destroy_All_Jedi",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_59",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_Official_Star_Wars_Fact_File_124",
  "/wiki/The_Official_Star_Wars_Fact_File_129",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/Kyle_Katarn%27s_Tale",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Starships_of_the_Galaxy_(Saga_Edition)",
  "/wiki/Threats_of_the_Galaxy",
  "/wiki/Rogue_Leaders:_The_Story_of_LucasArts",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_27",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_30",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Template:SWGTCG",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2010_Topps_Star_Wars_Galaxy_Series_5",
  "/wiki/Databank_(original)",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Heroes_and_Legends",
  "/wiki/Knowledge_and_Defense",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_Shadows_of_the_Empire_(toy_line)"
 ]
}