{
 "name": "Jeremitt Towani",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Towani family"
     ]
    }
   ]
  }
 ],
 "content": "Jeremitt Towani was a Human male who was the husband of Catarine Towani, and the father of Cindel and Mace Towani.\nJeremitt Towani and his family were returning home in their star cruiser in 3 ABY, and their course took them through the Moddell sector. For some reason, their ship had to make a crash-landing on the Forest Moon of Endor. He and Catarine went out looking for help, leaving their children with the ship, telling them not to leave the ship while they were gone. However, upon return, they could find no trace of their children. Suddenly, the Gorax appeared near the ship and kidnapped both Jeremitt and Catarine. Little did they know that Cindel was hiding in the ship.\nNot long afterward, a tribe of nearby Ewoks, while on a search for their own children, discovered the crashed Towani star cruiser . After a look inside, they discovered Cindel, hiding in a cabinet. Soon Mace returned from a trek in the forest, assuming the Ewoks meant harm toward he and his sister. After he realized they meant no harm, he and he sister joined the Ewoks in an attempt to rescue the parents from the clutches of the Gorax.\nTogether, they depart the village, and cross the Endor moon, until they finally reach the Gorax, who they fight and eventually defeat. Jeremitt and Catarine had been put in a cage by the Gorax, and had to be freed. Mace freed them, and everyone returned to the village and celebrated.\nJeremitt had hoped that Deej and Logray could help him repair the star cruiser's transmitter. However, he soon learned that the Ewoks had no knowledge of the star cruiser's technology. So he began work on repairing the star cruiser by himself. After a few months, the star cruiser was repaired enough to allow the family to leave the moon. However, as Jeremitt was finishing up repairs, a group of Sanyassan Marauders attacked the village, killing many and capturing the rest. Jeremitt tried to escape with Cindel, but was shot in the back by one of the Marauders. Due to his wounds, Jeremitt told Cindel to get away while he held off the Maruaders with his pistol. He was mortally wounded during this action.\nJeremitt was portrayed by Guy Boyd in Caravan of Courage, and by Paul Gleason in The Battle for Endor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Towani_family",
  "/wiki/File:WillNeverBeGone-BFE.ogg",
  "/wiki/Ewoks:_The_Battle_for_Endor",
  "/wiki/Catarine_Towani",
  "/wiki/Cindel_Towani",
  "/wiki/Mace_Towani",
  "/wiki/Moddell_sector/Legends",
  "/wiki/Towani_family_star_cruiser",
  "/wiki/Gorax/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Sanyassan_Marauders",
  "/wiki/Raid_on_Bright_Tree_Village",
  "/wiki/Guy_Boyd",
  "/wiki/Paul_Gleason",
  "/wiki/Caravan_of_Courage:_An_Ewok_Adventure",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(junior_novelization)",
  "/wiki/Category:Images_of_Jeremitt_Towani",
  "/wiki/George_Lucas:_The_Creative_Impulse",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider",
  "/wiki/Caravan_of_Courage:_Star_Wars_on_Television",
  "/wiki/Star_Wars_Insider_32",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Warriors_of_Endor",
  "/wiki/Star_Wars_Insider_110",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Castaways_of_Endor",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded"
 ]
}