{
 "name": "Jeremoch_Colton",
 "display_name": "Jeremoch Colton",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Organa",
      "Galactic Republic",
      "Alliance to Restore the Republic",
      "Rebel Alliance Navy",
      "Rebel Alliance Navy"
     ]
    }
   ]
  }
 ],
 "content": "Captain Jeremoch Colton was a human male who served as pilot of the Alderaanian starships Tantive III and Tantive IV, corvettes used by Senator Bail Organa of the House of Organa. He was an extraordinary pilot and served as somewhat of a mentor to Captain Raymus Antilles, the commander of the two vessels.\nIn 19 BBY, Colton piloted the Tantive III on the planet Coruscant during the final days of the Clone Wars. Organa used the ship to aid his Jedi friends Grand Master Yoda and Master Obi-Wan Kenobi after the Galactic Republic turned on the Jedi during Order 66. While the trio were on board, Colton informed Organa that Vice Chair Mas Amedda had sent him a message. He later brought Yoda and Organa to the Polis Massa asteroid field, where Yoda departed for the Sluis sector.\nColton continued to serve Bail Organa and then his daughter, Leia Organa, as a pilot, and was piloting the Tantive IV when it was captured above the planet Tatooine in 0 BBY. Colton was arrested as a member of the Alliance to Restore the Republic and sent to Accresker Jail, a mobile Imperial prison, where he remained a prisoner of the Galactic Empire. In 3 ABY, Colton was visited by Sava Madelin Sun, who used a thought dowser to force him to reveal that Yoda had traveled to the Sluis sector.\nJeremoch Colton held the rank of captain during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems and had a long record of service to the royal family of the planet Alderaan, the House of Organa. He served as pilot of the Alderaanian CR70 corvette Tantive III and the CR90 corvette Tantive IV, vessels belonging to the family. Both corvettes were commanded by Captain Raymus Antilles and were used by Bail Organa, Viceroy of Alderaan and Senator for the world in the Galactic Senate of the Republic. In 19 BBY, the Tantive III was on the Republic's capital world of Coruscant during the events of Order 66, in which the forces of the Republic turned on their allies in the Jedi Order. Keen to help some of the surviving Jedi, Organa had the Tantive III leave Coruscant in order to rescue Grand Master Yoda and Master Obi-Wan Kenobi.\nUpon returning to Coruscant, Organa and the two Jedi were in the vessel's cockpit with Colton and his co-pilot when a message from the office of Supreme Chancellor Sheev Palpatine reached the ship. Colton informed Organa of the message and, on the viceroy's orders, patched through Vice Chair Mas Amedda, who informed Organa of a special session being held in the Senate.\nOnce the message ended, Organa and the Jedi discussed the possibility of the session being a trap but decided that it was likely authentic. As such, it presented a good opportunity for the Jedi to infiltrate the fallen Jedi Temple and alter a beacon being used to lure Jedi to their deaths. Colton then piloted the Tantive III to the Galactic Senate Building so that Organa could attend the session. After the session and the Jedi's successful mission, the Tantive III left Coruscant again and carried Organa and Yoda to the Polis Massa asteroid field. From there, Yoda departed in his own craft, although Colton learned that he was traveling to a location in the Sluis sector.\nAfter they departed Polis Massa, Colton continued to fly as Organa's pilot while the senator served in the Imperial Senate of the Galactic Empire. In time, Colton began to instead serve Organa's adopted daughter, Leia Organa, who not only served alongside her father in the senate, but also in secretly opposing the Empire as part of the Alliance to Restore the Republic. Organa used the Tantive IV, as her consular ship, with Colton still piloting it under the command of Antilles. In 0 BBY, after sustaining damage on a mission, the Tantive IV was undergoing repairs at the Alliance's headquarters on the moon Yavin 4 when it was assigned a routine mission to the planet Tatooine, where Bail wanted Leia to make contact with Kenobi.\nHowever, before the repairs were completed, the Alliance Fleet was scrambled for an attack on Imperial forces on the planet Scarif in order to try and obtain the plans for the Empire's Death Star superweapon. Unable to make the journey on its own, the Tantive IV was transported to Scarif on board the MC75 Star Cruiser Profundity as repairs continued. At Scarif, the Death Star plans were successfully transmitted to the Profundity; however, the cruiser was crippled by the Imperial I-class Star Destroyer Devastator and left unable to escape. In order to prevent the plans from falling back into Imperial hands, they were brought onto the Tantive IV, which launched from the hangar of the Profundity with Colton at the helm as Imperial forces captured the cruiser. Antilles gave the order to jump to hyperspace before handing the plans over to Organa.\nThe Tantive IV was then pursued by the Devastator as it left the Scarif system and, on Antilles's orders, Colton piloted the vessel on a direct route to Tatooine that followed no clear line and doubled back on itself in order to try and evade the Star Destroyer. The corvette traveled to Ukio, Roon, Kowak, and then Hypori, but found the Devastator waiting for it there. After being struck by a volly of the Destroyer's turbolasers, Colton jumped the Tantive IV to the worlds of Iskalon and then Vuzsa before reaching the Tatoo system.\nBefore it could reach Tatooine, the Tantive IV's motivator gave out, causing the ship to drop out of hyperspace. Antilles rushed to the bridge to find out what had happened, and Colton updated him on the situation, explaining that they would need to travel by sublight engine for the remaining quarter parsec of the journey, which would take about eight minutes. Alarms then sounds and Colton informed Antilles that the Devastator had arrived in the star system.\nAfter the Star Destroyer's turbolasers breached the shields of the Tantive IV and damaged the main reactor, Antilles gave the order for the reactor to be turned off in order to save the ship from destruction, but leaving it dead in space. The Star Destroyer then captured the Tantive IV with a tractor beam, and it was boarded by Imperials led by the Sith Lord Darth Vader, who killed Antilles and captured Leia and the other surviving members of the crew including Colton. The plans however were no longer on board, as Leia had given them to the droids C-3PO and R2-D2, who would ultimately deliver them to the Alliance, allowing it to destroy the Death Star.\nDespite Leia's claims that they were on a diplomatic mission rather than one for the Alliance, Colton was accused of working for the rebels and sent to Accresker Jail. He received no visitors in the prison for over three years, until 3 ABY, when Sava Madelin Sun tracked him down while trying to locate Yoda for the Crimson Dawn criminal syndicate.\nSun questioned Colton on where the Jedi had gone after flying on the Tantive III, but the pilot feigned ignorance. Sun then used a thought dowser on Colton, which caused him increasing pain as he resisted telling her what he knew. Eventually he admitted that Yoda had left in his own vessel from Polis Massa and traveled to the Sluis sector, but said he had never learned the Jedi's final coordinates. Satisfied, Sun stopped using the device on him and left the prison while Colton remained in his cell. Accresker Jail was decommissioned and then destroyed not long after the visit.\nColton was a light-skinned human male with blond hair and blue eyes. He acted as somewhat of a mentor figure to Captain Antilles. When reporting to Antilles that they were eight minutes away from Tatooine, Colton had hope in his voice and a sense of relief, although it was quickly dashed by the arrival of the Devastator. When Sun visited Colton he was sarcastic and pretended to know nothing about Yoda's location until tortured. He initially resisted the effects of the thought dowser but ultimately succumbed and revealed what he knew.\nColton was an extraordinary pilot with above-average intelligence. He had average strength, speed, diplomatic skill, and fighting ability. He was not Force-sensitive.\nWhile in service aboard the Tantive III, Colton wore a gray uniform and a silver headset. On the Tantive IV, he wore a brown jacket with a black vest and a white helmet.While imprisoned in Accreseeker Jail, Colton wore an orange jumpsuit with a black collar and shoulders along with a pair of black boots and silver handcuffs.\nJeremoch Colton was portrayed by actor Jeremy Bulloch in a cameo appearance in the 2005 film Star Wars: Episode III Revenge of the Sith, the third installment of the Star Wars prequel trilogy. The character's name is not spoken in the film, but his surname is given in the credits along with his rank. \"Jeremoch,\" a portmanteau of Bulloch's name, was first mentioned as Colton's first name in the new Star Wars canon in \"Job Done\", an article in the \"Building the Galaxy\" department of the 2018 magazine Star Wars: Build Your Own R2-D2 99. Bulloch had previously portrayed bounty hunter Boba Fett in the 1980 film Star Wars: Episode V The Empire Strikes Back and the 1983 film Star Wars: Episode VI Return of the Jedi.\nColton's scene in the film was added during pickups filmed on F Stage at Shepperton Studios on Tuesday, August 31, 2004, although director George Lucas had decided to have Bulloch cameo in the film long before that. Wishing for Bulloch to be more than just a \"mysterious conundrum,\" Lucas claimed that he and others had been looking for somewhere to put the actor and decided Colton's role was the best place for him. Bulloch received the offer for the role from producer Rick McCallum while on holiday in Italy, at first thinking the phone call was a joke as few people had his telephone number. He was astonished when offered the small role, and found it odd returning to Star Wars as a different character, and has joked that it would fun if Boba Fett was revealed to actually be Colton underneath his mask.\nIn the Star Wars Legends continuity, a Captain Colton was first mentioned in the 1976 novelization of Star Wars: Episode IV A New Hope, which was written by Alan Dean Foster. In the novel, C-3PO claims that he and R2-D2's last master was a Captain Colton. The 1984 reference book A Guide to the Star Wars Universe by Raymond L. Velasco clarified that the Colton mentioned in the novelization was simply a misnaming of Raymus Antilles, although the 1995 reference book The Essential Guide to Characters by Andy Mangels then mentioned Colton and Antilles as separate characters. StarWars.com Internet Content Developer Pablo Hidalgo then suggested that Bulloch's character in Revenge of the Sith be named Colton based on the A New Hope novelization. Hidalgo then established Jeremoch as the definitively separate character's first name in \"Refresher Reading,\" an article published in Star Wars Insider 90 on September 25, 2006.\nColton appeared in a flashback in Crimson Reign 3, a comic book written by Charles Soule, illustrated by Steven Cummings, and released on March 9, 2022. The comic revealed that Colton was the pilot of the Tantive IV at the time of its capture. This retconned the unnamed pilot of the Tantive IV that appeared in the 2016 Anthology Series film, Rogue One: A Star Wars Story, and in the short story \"Raymus,\" written by Gary Whitta and released in the 2017 anthology From a Certain Point of View, into being Colton. The comic also showed that a Tantive IV crew member other then Organa survived the vessel's capture, which contradicts statements saying that all other crew members were killed made in the eightheenth issue of De Agostini's Star Wars: Build the Millennium Falcon magazine, released around May 6, 2015, and the 2021 reference book Star Wars: Battles that Changed the Galaxy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Jeremoch_Colton",
  "/wiki/Jeremoch_Colton/Legends",
  "/wiki/Colton",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/Jeremoch_Colton",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_of_Organa",
  "/wiki/Galactic_Republic",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/File:Colton-Organa.ogg",
  "/wiki/Captain",
  "/wiki/Pilot",
  "/wiki/Alderaanian",
  "/wiki/Starship",
  "/wiki/Tantive_III",
  "/wiki/Tantive_IV",
  "/wiki/Corvette",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Raymus_Antilles",
  "/wiki/Commanding_officer",
  "/wiki/19_BBY",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Standard_day",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Order_66",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Polis_Massa",
  "/wiki/Asteroid",
  "/wiki/Sluis_sector",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tatooine",
  "/wiki/0_BBY",
  "/wiki/Accresker_Jail",
  "/wiki/Prison",
  "/wiki/Galactic_Empire",
  "/wiki/3_ABY",
  "/wiki/Sava",
  "/wiki/The_Archivist",
  "/wiki/Thought_dowser",
  "/wiki/Sector",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Alderaan",
  "/wiki/CR70_corvette",
  "/wiki/CR90_corvette",
  "/wiki/Viceroy",
  "/wiki/Galactic_Senate",
  "/wiki/Capital",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_Order",
  "/wiki/Cockpit",
  "/wiki/Emperor%27s_office",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi_beacon",
  "/wiki/Death",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Dagobah",
  "/wiki/Imperial_Senate",
  "/wiki/Time",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Battle_of_Scarif",
  "/wiki/Imperial_Military",
  "/wiki/Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/Profundity",
  "/wiki/Cruiser",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/Hyperspace",
  "/wiki/Scarif_system",
  "/wiki/Star_Destroyer",
  "/wiki/Ukio",
  "/wiki/Roon",
  "/wiki/Kowak",
  "/wiki/Hypori",
  "/wiki/Destroyer",
  "/wiki/Turbolaser",
  "/wiki/Iskalon",
  "/wiki/Vuzsa",
  "/wiki/Tatoo_system",
  "/wiki/Motivator",
  "/wiki/Sublight_engine",
  "/wiki/Parsec",
  "/wiki/Standard_minute",
  "/wiki/Star_system",
  "/wiki/Deflector_shield",
  "/wiki/Reactor",
  "/wiki/Realspace",
  "/wiki/Tractor_beam",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Droid",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Battle_of_Yavin",
  "/wiki/Death_Star",
  "/wiki/Standard_year",
  "/wiki/Crimson_Dawn",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Torture",
  "/wiki/Force-sensitive",
  "/wiki/Clothing",
  "/wiki/Helmet",
  "/wiki/Jumpsuit",
  "/wiki/Boot",
  "/wiki/Jeremy_Bulloch",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Tuckerization",
  "/wiki/Building_the_Galaxy",
  "/wiki/2018",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_99",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Shepperton_Studios",
  "/wiki/August_31",
  "/wiki/2004",
  "/wiki/George_Lucas",
  "/wiki/Rick_McCallum",
  "/wiki/Star_Wars_Legends",
  "/wiki/1976",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Alan_Dean_Foster",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/1984",
  "/wiki/A_Guide_to_the_Star_Wars_Universe",
  "/wiki/Raymond_L._Velasco",
  "/wiki/Raymus_Antilles/Legends",
  "/wiki/1995",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Andy_Mangels",
  "/wiki/StarWars.com",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Refresher_Reading",
  "/wiki/Star_Wars_Insider_90",
  "/wiki/September_25",
  "/wiki/2006",
  "/wiki/Crimson_Reign_3",
  "/wiki/Charles_Soule",
  "/wiki/Steven_Cummings",
  "/wiki/March_9",
  "/wiki/2022",
  "/wiki/Retcon",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Raymus",
  "/wiki/Gary_Whitta",
  "/wiki/2017",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_18",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/May_6",
  "/wiki/2015",
  "/wiki/2021",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Category:Images_of_Jeremoch_Colton",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_17",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2017_Topps_Star_Wars_Galactic_Files_Reborn",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_8",
  "/wiki/Behind_the_Cameras",
  "/wiki/Star_Wars_Insider",
  "/wiki/He%27s_Worth_a_Lot_to_Me:_Jeremy_Bulloch,_Inside_Boba_Fett",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Prisoner",
  "/wiki/Doctor_Aphra_(2016)_25",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Echo_Base",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/December_21",
  "/wiki/2020",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/December_22",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_2",
  "/wiki/January_14",
  "/wiki/January_8",
  "/wiki/November_6"
 ]
}