{
 "name": "Jerg",
 "display_name": "Jerg",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Jerg was a Human male smuggler who lived during the time of the Galactic Civil War. He was commanding the ship called the Cyclops. He chanced upon the forgotten planet Ruusan which he made his base of operation, unaware of its rich ancient history. He was responsible for relocating several Sulonese there.\nAround 11 BBY, he made a blind jump through hyperspace to escape an Imperial Star Destroyer, and as a result rediscovered Ruusan, a planet that was not in any contemporary Star-charts. His crew used a location on Ruusan as his base of operations, called Fort Nowhere, to store contraband.\nTen years later, Morgan Katarn hired him and his ship to replant three hundred fourty-seven Rebel-sympathiser colonists from Sulon onto Ruusan. After a long and uneasy trip, two hours before arrival, he summoned Katarn to notify that they would be ready for disembarking. Standing next to Katarn looking over Ruusan through the viewport, Jerg ensured him that it was a planet of human-normal gravity and atmosphere, and the fact that the Empire still hadn't discovered his operations there made it safe for them; but, displaying some honesty, he couldn't ensure him that an Imperial probe would not discover them sometime. He also mentioned the existence of ruins and an indigenous species not worth considering. Katarn thanked him, saying that his people owe him their lives, but Jerg dismissed his thanking, as he was doing a job.\nAfter the Sulonese landed on the planet on shuttles, Jerg showed Fort Nowhere to Katarn; Katarn asked whether the planet was indeed empty, and Jerg admitted that one of his pilots had noticed \"something\" in the badlands while bringing the people there. Jerg refused Katarn's request to send a recon team, as it wasn't in their agreement, considering also that the coordinates were in the badlands. However he did lent to Katarn his speeder, the Old Codger.\nWhen Katarn was a hundred kilometers west from the landing site, Jerg contacted him via comlink to ask if he knew what he was doing, and reminded him to give the speeder a cool-down; Katarn reported that he was following the remnants of a highway. Later Katarn called him to report that he camped by a huge rock, which seemed artificial to him; Jerg was momentarily worried when he heard Katarn stumpled into a hole; Katarn mentioned several even-sized and even-spaced holes like it around, then he reported movements and strange feelings. Jerg insisted on learning the facts. The moment he cautioned Katarn to play it safe, the comlink went dead, and Jerg thought it was either an interference by the rock formation, or cut on purpose by something.\nThe next day Katarn contacted him again, saying that he spent the night where they last talked, moving away from the point of interference, and would like to scout around a little more before returning; Morgan avoided mentioning that his last location was an ancient city where he had made contact with the native species, and was heading towards another. Jerg told him to report anything interesting he would find.\nNot long after, Morgan returned from his trip and rejoined with Jerg, but he avoided mentioning anything about his discoveries.\nJerg continued to operate after the fall of the Empire. In 5 ABY he visited Ruusan again, before going offworld; thirty days after his departure, the Battle of Fort Nowhere began.\nJerg was tall and gaunt. He wore old dirty clothes, a sweaty tank top, and pants that had lost their white color. To show his rank among his crew, he wore a Captain's cap from the time of the Galactic Republic. Other than that, he preferred to walk around barefoot.\nDespite his unkempt appearance, and his inventory being consisted of old hardware, he was careful to keep everything in good repair, like the Old Codger.\nHe was rumored to have been physically involved with his second-in-command, Marie Peeno.\nDespite their good cooperation, Morgan knew that Jerg was above all a mercenary, eager to make quick profit from anything he could put his hand on; knowing that the Bouncers preferred the Valley to be kept a secret, and had to lie to Jerg about not finding anything interesting.\nIn the audio adaptation of Dark Forces: Rebel Agent, he was voiced by Tom Keith. When Morgan Katarn refers to him, his name can be misheard for \"Jerec\", the antagonist of the story.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Morgan_Katarn",
  "/wiki/Ruusan/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Cyclops",
  "/wiki/Sulon",
  "/wiki/11_BBY/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Star-chart",
  "/wiki/Fort_Nowhere",
  "/wiki/Standard_year/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Viewport/Legends",
  "/wiki/Gravity/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Bouncers",
  "/wiki/Shuttle/Legends",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/Speeder/Legends",
  "/wiki/Old_Codger",
  "/wiki/Kilometer/Legends",
  "/wiki/Olmondo",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Battle_of_Fort_Nowhere",
  "/wiki/Captain/Legends",
  "/wiki/Hat/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Marie_Peeno",
  "/wiki/Dark_Forces:_Rebel_Agent_audio_drama",
  "/wiki/Tom_Keith",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Dark_Forces:_Rebel_Agent",
  "/wiki/Dark_Forces:_Jedi_Knight",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}