{
 "name": "Jeroen Webb",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ralltiir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jeroen Webb was a Human male native of the planet Ralltiir who became a spy for the local Ralltiir underground following the Imperial subjugation of his homeworld. Webb helped his close friend Pharl McQuarrie stage a diversionary raid on Ralltiir that allowed information concerning the Empire's first Death Star battlestation to reach Princess Leia Organa of the Rebel Alliance, culminating in the Death Star's eventual destruction at the Battle of Yavin. Three years later, Webb once more worked alongside McQuarrie at Echo Base, the Rebellion's High Command headquarters on the ice planet Hoth.\nJeroen Webb hailed from the Core World Ralltiir. Following the Galactic Empire's subjugation of his homeworld three weeks before the Battle of Yavin, Webb joined the local Ralltiir underground as a spy in resistance of the Imperial occupation. After Webb's close friend Pharl McQuarrie fled Ralltiir to seek help from the Rebel Alliance, Webb's Rebel cell coincidentally soon came into possession of information concerning the Empire's new secret weapon, the first Death Star battlestation.\nWebb worked to help McQuarrie sneak back onto Ralltiir, past the Imperial blockade of the planet, to take command of the local resistance and stage a diversionary raid that allowed the Death Star information to reach Princess Leia Organa and the Rebel Alliance. Thanks in part to Webb's efforts, the Rebellion went on to capture the battlestation's full technical schematics as part of Operation Skyhook, leading to the Death Star's eventual destruction at the Battle of Yavin.\nWebb later served at the Alliance High Command headquarters of Echo Base on the ice planet Hoth. His new post once more had him working alongside Pharl McQuarrie, who was second-in-command to base commander General Carlist Rieekan. At Echo Base, Webb became one of the Rebels' tauntaun handlers.\nIn 3 ABY, just prior to the Battle of Hoth, Webb was present in Echo Base's tauntaun stable, conversing with another officer, the night Commander Luke Skywalker went missing during a routine scouting mission of the external Hoth perimeter. Webb watched as Han Solo disregarded the warnings of Captain Tigran Jamiro to take his own tauntaun out into the dangerously cold Hoth night in search of Skywalker.\nJeroen Webb was a skilled starship pilot when he joined the Rebel Alliance. He was also a close friend of fellow Ralltiir native Pharl McQuarrie, one of their homeworld's respected military advisors prior to the Imperial occupation of the planet. A Human, Webb had blue eyes and light skin.\nDuring the night Han Solo departed Echo Base to search for the missing Luke Skywalker, Webb donned the field-soldier variant of the Rebels' standard cold-weather armor, including headgear, anti-glare goggles, scarf, padded vest, thermal flak jacket, gloves, belt, leggings, and boots. His equipment also included binoculars.\nJeroen Webb appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back. He stands in during the scene in which Han Solo departs Echo Base on a tauntaun to search for the missing Luke Skywalker. British actor Norwich Duff portrayed Webb in the film, credited only as one of several \"Other Officers\" in the Rebel Forces. The character was first named and given a brief backstory on the \"Jeroen Webb\" card as part of the November 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game.\nAn image of Jeroen Webb appears on the packaging for the \"Rebel Commander\" action figure, released in 1980 as part of Kenner's original The Empire Strikes Back toy line. However, the actual action figure, complete with a mustache, is based on Hoth Rebel officer Colonel Ledick Firest, according to author Stephen J. Sansweet in Star Wars: The Action Figure Archive.\nSome in the online Star Wars fan community have linked the Jeroen Webb character to American actor Treat Williams, who visited the Elstree Studios set in England during the 1979 filming of The Empire Strikes Back and reportedly appears in the film as a Rebel officer extra during the Echo Base scenes. However, the 2010 behind-the-scenes book The Making of The Empire Strikes Back confirms that actor Norwich Duff portrayed Webb.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ralltiir/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ralltiiri",
  "/wiki/Planet/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Ralltiir_underground",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Subjugation_of_Ralltiir",
  "/wiki/Homeworld/Legends",
  "/wiki/Pharl_McQuarrie/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Death_Star/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Water/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Battle_of_Toprawa",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/Operation_Skyhook",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Commander/Legends",
  "/wiki/General/Legends",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Tauntaun/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Alliance_Military/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Tigran_Jamiro/Legends",
  "/wiki/Temperature/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Advisor/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Alliance_Cold_Weather_armor",
  "/wiki/Alliance_Cold_Weather_Headgear",
  "/wiki/Anti-glare_goggles/Legends",
  "/wiki/Scarf/Legends",
  "/wiki/Alliance_Cold_Weather_Padded_Vest",
  "/wiki/Thermal_flak_jacket",
  "/wiki/Alliance_Cold_Weather_Gloves",
  "/wiki/Alliance_Cold_Weather_Belt",
  "/wiki/Alliance_Cold_Weather_Leggings",
  "/wiki/Alliance_Cold_Weather_Boots",
  "/wiki/Binoculars/Legends",
  "/wiki/Harrison_Ford",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Norwich_Duff",
  "/wiki/November",
  "/wiki/1996",
  "/wiki/Hoth_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(toy_line)",
  "/wiki/Officer/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Ledick_Firest/Legends",
  "/wiki/Stephen_J._Sansweet",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/Star_Wars",
  "/wiki/Treat_Williams",
  "/wiki/Elstree_Studios",
  "/wiki/1979",
  "/wiki/2010",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(PhotoComic)",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/The_Empire_Strikes_Back_(TCG)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Echo_Base",
  "/wiki/Star_Wars_Insider_74",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2013_Topps_Star_Wars_Galactic_Files_Series_2",
  "/wiki/Empire_5",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Character_Encyclopedia",
  "/wiki/File:Binoculars.jpg",
  "/wiki/September_22",
  "/wiki/2017",
  "/wiki/July_25",
  "/wiki/2012",
  "/wiki/November_7",
  "/wiki/2022",
  "/wiki/TheForce.net"
 ]
}