{
 "name": "Jerresk",
 "display_name": "Jerresk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Born",
     "values": [
      "24 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    }
   ]
  }
 ],
 "content": "Jerresk was a pirate who, with Nosstrick, attacked several New Republic supply shipments, earning very large bounties and moving them from the Hundred Club to the list of \"Most Wanted\".\nJerresk was born on the planet Mon Calamari in 26 BBY. A pirate for renown throughout the Outer Rim Territories, Jerresk operated a small fleet consisting of a Corellian light freighter, two scout vessels, and four Z-95 Headhunters. The Quarren used complex, but reliable tactics; all his ships had a hyperdrive and each was programmed with a pre-calculated hyperspace escape route in case their attacks went badly. Each ship had a different location to jump to, from which a second hyperspace jump was enacted to the true rendezvous point. Using this methods, Jerresk kept his base's location a secret.\nJerresk's last known sighting was in the Fordon system where he and his pirates assaulted a New Republic supply vessel en route to the Musson system. The attack was the fourth in a series of raids by Jerresk targeted at the New Republic. The New Republic offered a reward of 8,000 credits for Jerresk's capture on charges of piracy, theft of New Republic property, and assault and battery.\nJerresk was a Quarren male who was 1.8 meters tall. He was an able commander, shrewd bargainer and con artist.\nJerresk was trained to use blasters, blaster artillery, and vehicle-mounted blasters. He was also skilled in melee combat. Jerresk was knowledgeable about alien species and languages, and had working knowledge of bureaucratic procedure and the criminal underworld.\nJerresk was a pilot, able to fly small vessels and starfighters, as well as operate the weapons and deflector shields on small ships. He could also navigate through hyperspace, ride beasts, and operate repulsorlift craft. Jerresk was skilled in computer programming and repair, starfighter repair, demolitions, and bypassing security systems.\nJerresk was armed with a heavy blaster pistol.\nJerresk was featured in Wanted by Cracken, a 1993 sourcebook published by West End Games. Mike Jackson provided the illustration for Jerresk.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/24_BBY/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Nosstrick",
  "/wiki/New_Republic/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Hundred_Club",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/26_BBY/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Light_freighter/Legends",
  "/wiki/Scout_vessel",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Fordon_system",
  "/wiki/Musson_system",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Thief/Legends",
  "/wiki/Con_artist/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_artillery",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Mike_Jackson",
  "/wiki/Boba_Fett:_Twin_Engines_of_Destruction",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}