{
 "name": "Jeru",
 "display_name": "Jeru",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taloraan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wind Raiders"
     ]
    }
   ]
  }
 ],
 "content": "Jeru was a Human male who was a member of the Wind Raiders tribe on the planet of Taloraan during the Clone Wars.\nIn 21 BBY, while performing a flight on his fleft-wauf named Stormwing, Jeru caught a Togruta female falling from the sky and intended to take her as a prize. Another Wind Raider, Nardek, disputed his claim and Bafor, the tribe's Chief, decided that the two would have to fight over the female. The female, Jedi Padawan Ahsoka Tano, refused to be anyone's prize, and insisted on joining the combat as well. Physically stronger, Nardek quickly defeated Jeru and was going to take the Togruta for himself. Ahsoka, however, surprised him by demonstrating her extreme agility and easily defeated him, using the Force. After the fight was over, she tried to convince Bafor to let his Wind Raiders join combat against the CIS forces that were trying to establish control over the planet. Bafor initially refused to help, saying that it was the matter of the Denfrandi, not the Wind Raiders. Jeru supported Jedi's plea for help, mentioning the Separatist ship he saw in the clouds. After the Jedi offered the Wind Raiders some supplies and goods from Taloraan City, several Wind Riders, including Jeru, agreed to join combat against the CIS forces. Jeru delivered Ahsoka to a site of a small skirmish between her Master, Anakin Skywalker, and B1-Series battle droids, and later helped his fleft-wauf Stormwing to destroy a Vulture Droid. After the battle was over, Jeru announced that Bafor made Ahsoka an honorary Wind Rider and took her to ride a fleft-wauf.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taloraan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Wind_Raiders/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Fleft-wauf/Legends",
  "/wiki/Stormwing",
  "/wiki/Togruta/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Nardek",
  "/wiki/Bafor",
  "/wiki/Chief/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Denfrandi",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Taloraan_City",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/The_Clone_Wars:_The_Wind_Raiders_of_Taloraan"
 ]
}