{
 "name": "Jes Gistang",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 137 ABY",
      "Borosk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darth Krayt's Galactic Empire",
      "Joker Squad",
      "Joker Squad"
     ]
    }
   ]
  }
 ],
 "content": "Jes Gistang was a Corellian Human female who served as a stormtrooper in Darth Krayt's Galactic Empire circa 137 ABY, during the Second Imperial Civil War. After living on the streets as a child, Gistang was taken in by the local Imperial Mission and was eventually selected for service in the Stormtrooper Corps. She quickly found a home as a heavy-weapons expert with Joker Squad in the 407th Stormtrooper Division and was put in charge of the unit's BB-23 heavy blaster cannon, known as the \"big gun.\"\nWhen Lieutenant Gil Cassel informed Joker Squad that the 407th would be conducting a mission on Borosk to destroy the 908th Stormtrooper Division, which had defected to the forces of displaced Emperor Roan Fel, Gistang angrily disagreed with killing fellow stormtroopers and even argued that the members of Joker Squad should join Fel themselves. Gistang reluctantly participated in the Battle of Borosk when Joker Squad was ordered into action, but she was killed during the second day of fighting when one of her spare power packs for the big gun was hit by a stray blaster bolt, causing it to explode and vaporize her.\nA Corellian by birth, Jes Gistang was a street kid with limited options for her future until the local Imperial Mission, an organization designed to peacefully spread Imperial influence and provide aid to worlds in need, took her in and helped her turn her life around. Through the Imperial Mission, Gistang entered Imperial service and was eventually selected for the Stormtrooper Corps. She joined Joker Squad of the 407th Stormtrooper Division, which was headquartered on Yinchorr under the command of Lieutenant Gil Cassel, and was put in charge of the squad's heavy artillery, including a BB-23 heavy blaster cannon nicknamed the \"big gun.\" However, Gistang became one of many stormtroopers who quietly questioned their loyalty to the Empire after the Sith Lord Darth Krayt deposed Emperor Roan Fel and seized control of the galaxy.\nAround 137 ABY, Sergeant Ran Harkas introduced Gistang and her team to Anson Trask, a recent addition to Joker Squad who had just arrived on Yinchorr fresh out of training. Gistang joined the other members of Joker Squad in forming a betting pool on how long Trask would survive; she wagered ten credits that he would only last six hours after touchdown, knowing that new troopers did not typically live long. After Trask received an icy welcome from the squad, Gistang casually suggested that he relax and not take it personally and explained to the newcomer that his standard-issue equipment would be traded for other, more valuable items that Joker Squad would need.\nMoments later, Cassel arrived with news that the 908th Stormtrooper Division was planning to defect to Fel's forces. He explained that Grand Admiral Morlish Veed and the Council of Moffs, wanting to keep the 908th's base on Borosk intact, had ordered the 407th to eliminate the traitors. Gistang was the first to openly question the order, expressing shock that she and her unit were being sent to kill fellow stormtroopers, but Cassel quickly silenced her objection, noting that the 908th was no longer their ally after deciding to go rogue. Cassel also added that Joker Squad would be going into action under the overall command of Sith Lord Darth Maleval due to Krayt's uncertainty that the 407th would not defect as well. Despite everything, the troopers of Joker Squad agreed that their job was to carry out their orders, and they set out to capture the 908th's headquarters building.\nThrust into action on Borosk, Gistang and Joker Squad were ordered to take the point of the attack. Their initial assignment was to capture the gun and shield placements along the perimeter wall of the 908th's base. Gistang played an important part in the battle, cutting swathes with the big gun and inflicting heavy damage on enemy targets. At one point, a 908th stormtrooper sneaked up behind her, intent on shooting her, but Trask saved her life by dispatching the enemy, his first kill as a stormtrooper. Gaining confidence in battle for the first time, Trask covered Gistang's back for the remainder of the day's fighting. The 407th finally succeeded in securing a gun platform and was then allowed to rest for the night.\nWhile they were resting, Gistang noticed that Trask was worn down from his first day in combat and asked him if the battle was what he had expected. Trask told her that he had joined the 407th to follow in the footsteps of his father, a proud former member of the unit, and wondered aloud what he would have thought about killing fellow troopers. Gistang then told Trask briefly about her own past before running through the different personalities of the other members of Joker Squad. Meanwhile, Maleval confronted Cassel, ordering Joker Squad to lead the upcoming attack the following day and kill every last member of the 908th as traitors, despite the squad's distaste for fighting other stormtroopers. Maleval warned the members of Joker Squad that he would be watching and would slaughter them all himself if they faltered in their mission.\nJoker Squad trooper Hondo Karr brandished his vibroknife behind Maleval's back, prompting the Sith Lord to Force push the trooper to the ground, which created an uproar among Joker Squad. Gistang started after Maleval herself, but Harkas forcibly ordered her to stand down, even though all the troopers of Joker Squad secretly wished to kill the Sith Lord. After Maleval departed, Gistang angrily argued to Cassel that the Borosk operation was wrong and that maybe they should join the 908th, walk away and abandon the entire war, or even allow the 908th to escape. However, Harkas reminded them all of their duty as troopers, and Gistang reluctantly agreed with the others to complete the mission.\nWhen the battle resumed, Joker Squad breached the main fortress of the 908th around midday. Inside the building's corridors, the fighting descended into hand-to-hand combat, but Joker Squad continued to push on and eventually rushed into what had been the main mess hall. The 908th had set up gun emplacements on the upper-level walkways, and a stray blaster bolt from above struck one of the extra power packs that Gistang carried on her utility belt for use with the big gun. The resulting explosion vaporized Gistang and also caused major injury to Harkas. Nevertheless, the 407th proceeded to capture the enemy fortress, while the 908th fought to the bitter end.\nJes Gistang considered Imperial service a better option than any of the alternatives available to her after living on the streets as a child. She quickly found a home among the 407th Stormtrooper Division and became a talented and responsible soldier whose expertise with heavy weaponry made her effective in combat. Gistang displayed a grim sense of humor about Anson Trask's chances of survival when he first joined Joker Squad and bet in a pool to wager how long the rookie would live. After Trask survived his first combat experience, which included saving Gistang's life, she approached him and shared some scant details of her background.\nAlready quietly questioning her loyalty to Darth Krayt's Empire, Gistang felt deeply uncomfortable with Joker Squad's orders to wipe out a fellow stormtrooper unit that had defected to the enemy, an assignment that challenged both her ideals and her courage. She unhesitatingly voiced her angry opinion to her superior officer, Lieutenant Gil Cassel, that their mission was wrong and that she and her fellow troopers were better off defecting themselves or deserting the Imperial Army altogether. After Darth Maleval, also her superior, threatened Joker Squad's lives if they did not complete their mission and then attacked trooper Hondo Karr, an enraged Gistang even had to be held back from going after the Sith Lord. However, Gistang's sense of duty ultimately convinced her to fight in the battle, in which she was killed.\nGistang was a Human female with red hair, blue eyes, and light skin. She wore her hair tightly braided behind her head around the time of Joker Squad's mission to Borosk and alternatively wore it down.\nJes Gistang wore form-fitting, custom stormtrooper armor while in the service of the Imperial Army. As a heavy-weapons and artillery expert with Joker Squad, she was responsible for operating the unit's BB-23 heavy blaster cannon. The weapon provided Joker Squad with heavy firepower but required a new power pack after every four shots. Gistang carried spare power packs on her armor's utility belt—a vulnerability that proved lethal when one of the packs exploded after being hit by a stray blaster bolt. Her equipment also included a missile launcher, a DLT-19 heavy blaster rifle, an ARC-9965 blaster rifle, an E-11 blaster rifle, two fragmentation grenades, and a medpac.\nJes Gistang features in the fourth issue of the Star Wars: Legacy comic series, which was written by John Ostrander, illustrated by Travel Foreman, and published by Dark Horse Comics on October 11, 2006.\nThe Complete Star Wars Encyclopedia, published in 2008, states in the Jes Gistang character entry that Gistang was killed after the power pack on her heavy blaster rifle was struck by enemy fire, causing it to explode. However, Legacy 4 shows that one of Gistang's spare power packs on her utility belt was hit; additionally, the Legacy Era Campaign Guide, published in 2009, has identified the heavy weapon that Gistang wields as the BB-23 heavy blaster cannon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Jes",
  "/wiki/137_ABY",
  "/wiki/Borosk/Legends",
  "/wiki/Human/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Joker_Squad",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Imperial_Mission",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Heavy_weapon_specialist",
  "/wiki/407th_Stormtrooper_Division",
  "/wiki/Squad/Legends",
  "/wiki/BB-23_heavy_blaster_cannon",
  "/wiki/Lieutenant/Legends",
  "/wiki/Gil_Cassel",
  "/wiki/908th_Stormtrooper_Division",
  "/wiki/Empire-in-exile",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Borosk_(137_ABY)",
  "/wiki/Standard_day/Legends",
  "/wiki/Power_pack",
  "/wiki/Blaster/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Planet/Legends",
  "/wiki/Imperial_base_(Yinchorr)",
  "/wiki/Yinchorr/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Artillery/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Ran_Harkas",
  "/wiki/Anson_Trask",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Standard_hour/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Morlish_Veed",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/908th%27s_Headquarters",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Maleval",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Time/Legends",
  "/wiki/Anson_Trask%27s_father",
  "/wiki/Hondo_Karr",
  "/wiki/Vibroknife",
  "/wiki/Telekinesis/Legends",
  "/wiki/Fortress/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Utility_belt/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Missile_launcher",
  "/wiki/DLT-19_heavy_blaster_rifle/Legends",
  "/wiki/ARC-9965_blaster_rifle",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Fragmentation_grenade/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Legacy_(2006)_4",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/John_Ostrander",
  "/wiki/Travel_Foreman",
  "/wiki/Dark_Horse_Comics",
  "/wiki/October_11",
  "/wiki/2006",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/Heavy_blaster_rifle/Legends",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/2009",
  "/wiki/Category:Images_of_Jes_Gistang",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/Star_Wars_Insider",
  "/wiki/Imperial_Icons",
  "/wiki/Star_Wars_Insider_148",
  "/wiki/Looking_for_Leia",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/Marvel_Comics",
  "/wiki/April_11",
  "/wiki/2011"
 ]
}