{
 "name": "Jes  (courier)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rebel Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Jes was a young Human female pilot who served the Rebel Alliance during the Galactic Civil War.\nBorn around 20 BBY, she joined the Alliance at a young age, and she had just passed her teens when she was stationed on the flagship New Hope as a pilot.\nFlying starships as a courier, delivering beings to locations throughout the galaxy, she was often annoyed by people who underestimated her because of her age, as well as annoying passengers.\nIn 0 BBY, she took Jan Ors to the Mid Rim planet Danuta on her ship. She offered to take her satchel of weapons, explosives and infiltration devices, and shoved them into a small locker, thinking that she was just one more woman carrying along her makeup, grumbling about it.\nThanks to her speed, they arrived to Danuta about four days later, one day before Moldy Crow.\nJes was a sassy young pilot who wore her hair in pigtails. Not conforming to the trends followed by other females, she didn't think much of make-up, especially when passengers brought trivial luggage aboard her narrow ship.\nBecause of her age, people tended to call her \"dear\" or \"honey\" and  presumed her full name to be \"Jessica,\" things that annoyed her enough that she made a point about them to new acquaintances. She was also annoyed when \"freebooters\" and talkative passengers thought they knew her job better than her and offered advice.\nIn the Soldier for the Empire audio drama, Jes is unnamed, and is voiced by Virginia Burke.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jes",
  "/wiki/20_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/New_Hope",
  "/wiki/Starship/Legends",
  "/wiki/Courier/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Jan_Ors",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Danuta",
  "/wiki/Jes%27_courier_ship",
  "/wiki/Standard_day/Legends",
  "/wiki/Moldy_Crow/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/1_BBY/Legends"
 ]
}