{
 "name": "Jesmin_Tainer",
 "display_name": "Jesmin Tainer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Antarian Rangers",
      "Galactic AllianceGalactic Alliance Security",
      "Daala's special-missions force",
      "Wraith Squadron",
      "Galactic Alliance Security",
      "Daala's special-missions force",
      "Wraith Squadron",
      "Daala's special-missions force",
      "Wraith Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Jesmin Tainer was a Force-sensitive female Human who served the Galactic Alliance as an undercover agent and later as a pilot in Wraith Squadron. She was the daughter of the pilots Kell Tainer and Tyria Sarkin Tainer and sister to Doran Sarkin-Tainer.\nIn 43 ABY, using the false identification of a former Jedi apprentice female Anzat turned bounty hunter named Zilaash Kuh, Tainer was tasked by the Galactic Federation of Free Alliances to assist in the arrest of Jedi Grand Master Luke Skywalker, and later to capture rogue Jedi Knight Valin Horn, who had gone on a destructive rampage after suffering a psychotic breakdown. After failing to capture Horn because of the intervention of Skywalker, Jesmin Tainer, still undercover, was paired up with Quarren mercenary Dhidal Nyz to capture Seff Hellin, a rogue Jedi suffering from the same disease as Horn. However, they lost their target to Darkmeld, a secret organization formed by Jedi Knight Jaina Solo to counter Chief of State Natasi Daala's attempts to undermine the Jedi Order. Kuh soon after disappeared from Coruscant, and by 44 ABY the Galactic Alliance still had not tracked her down as Tainer stopped using the alias.\nTainer was afterwards recruited by Garik Loran, and joined the reformed Wraith Squadron. During Wraith Squadron's investigation into Galactic Alliance General Stavin Thaal's involvement with the Lecersen Conspiracy, Tainer revealed that she had adopted the mantle of bounty hunter Zilaash Kuh during Natasi Daala's reign as Chief of State of the GA.\nDue to Kell choosing to remain with Wraith Squadron while Tyria left military service to study the ways of the Force, the Sarkin-Tainers often had a long-distance marriage, and Jesmin and her brother, Doran, were not raised much together. Both children were eventually trained as Jedi, although Jesmin was apparently much closer with other Starfighter Command families growing up than Doran: her parents' former commanding officer, Garik Loran, was a de facto uncle to her and Myri Antilles, youngest daughter of Wraith Squadron-founder and famed starfighter pilot Wedge Antilles, was close to Jesmin throughout her childhood.\nJesmin also considered herself a highly skilled pilot, although readily conceded that Myri was better.\nIn 43.5 ABY, Jesmin Tainer was tasked by Galactic Alliance Security to infiltrate Daala's special-missions force under a false identity. Tainer then created the persona of Zilaash Kuh, a female Anzat bounty hunter who joined the New Jedi Order as a human and was expelled from the Order when the deception was discovered, only keeping her lightsaber as a reminder of her time as a Jedi apprentice. \"Kuh\", alongside the Quarren bounty hunter Dhidal Nyz and Skakoan hunter Hrym Mawarr, was then hired by Galactic Alliance Security to assist in the arrest of Jedi Grand Master Luke Skywalker under the supervision of Security Captain Savar.\nTainer was later hired by Galactic Alliance Chief of State Natasi Daala to capture rogue Jedi Knight Valin Horn, who was suffering from a psychotic breakdown that made him believe that everyone he knew—except for others suffering from the same disease—had been replaced by impostors. During the hunt for Horn, Tainer was assisted by the Rodian bounty hunter Kaddit. They were unsuccessful, however, as Skywalker captured the fugitive Jedi.\nShortly after Skywalker's trial and exile from the galactic capital of Coruscant for dereliction of duty, Galactic Alliance Security was issued a warrant from Daala for the arrest of Horn. Under the command of Captain Savar, Galactic Alliance Security forces—accompanied by Tainer and the cyborg mercenary Vrannin Vaxx—went to the Jedi Temple and arrested Horn. He was then encased in carbonite and taken to the Armand Isard Correctional Facility, a prison on Coruscant.\nIn a later mission, Tainer again teamed up with Dhidal Nyz, this time to capture Seff Hellin, a rogue Jedi suffering from the same psychosis as Horn. Because the psychosis made Hellin believe that everyone but Horn had been replaced with an impostor, he attempted to free Horn from the Armand Isard Correctional Facility. Tainer piloted Nyz's cargo hauler to the prison, and Nyz captured Hellin in an electric-pulse net. However, members of Darkmeld—a secret group formed by Jedi Knight Jaina Solo to counter Daala's attempts to undermine the Jedi Order—intervened, and captured Hellin themselves. In the ensuing speeder chase, a security speeder—stolen and piloted by the bounty hunter and Darkmeld affiliate Tahiri Veila—maneuvered underneath Nyz's and Tainer's cargo hauler. Veila's partner, Imperial Remnant Head of State Jagged Fel, ravaged the bottom of the hauler with his beskar crushgaunts. The hauler began to malfunction, and Tainer and Nyz fell behind and were forced to give up the bounty. Soon afterward, Tainer stopped using her bounty hunter alias and the Galactic Alliance Security stated that Kuh identification documents were indeed forgeries, but that her true identity and whereabouts remained a mystery to the government.\nFollowing the Jedi Order's exile from Coruscant, Jesmin Tainer, the true identity of Kuh, revealed about her disguise to her fellow Wraith Squadron members during the investigation into GA General Stavin Thaal's involvement in the Lecersen Conspiracy.\nTainer worked well with her fellow Wraiths as they proceeded through the mission in apprehending Thaal, and in the end, they succeeded.\nTainer under the alias of Kuh was somewhat domineering, and frequently attempted to take control of situations. She considered herself to be superior in comparison to others, especially the Jedi Order, whose popularity had fallen in the public eye in light of recent events—including Jacen Solo's fall to the dark side of the Force and transformation into the Sith Lord Darth Caedus, along with Hellin's insanity, Horn's rampage, and Skywalker's trial and subsequent exile. Kuh was well-known for her use of a personal lightsaber, and was also adept at piloting, as she flew Nyz's cargo hauler during their attempt to capture Hellin.\nTainer was capable in the Force using a combination of Telepathy and Force persuasion to make an officer on the Concussor need to use the refresher by sending him mental images of waterfalls, wine bottles pouring, faucets gushing, and fountains flowing. She was then able to use a burst of Force-boosted speed to run down a chamber on the Concussor.\nForce-sensitive through her Jedi mother, Tyria Sarkin Tainer, Jesmin utilized a lightsaber as her personal weapon. After the New Jedi Order strenuously analyzed holos of Tainer during her times as Zilaash Kuh, they discovered that her lightsaber's hilt appeared to have been modeled on the hilt of Old Republic Jedi Master Obi-Wan Kenobi's last lightsaber. During the hunt for Horn, Tainer flew with Kaddit in a racer speeder, and in the later raid on the Armand Isard Correctional Facility, she piloted Nyz's flatbed cargo hauler while he attempted to capture Hellin.\nShe also carried identification documents that were excellent forgeries due to her status as Galactic Alliance Security undercover agent.\nZilaash Kuh was created by Aaron Allston for his first Fate of the Jedi novel, Fate of the Jedi: Outcast, released on March 24, 2009. She later received brief mention in Allston's Fate of the Jedi: Conviction, the seventh novel overall and Allston's third and final installment in the series. In X-Wing: Mercy Kill, the first post-Fate of the Jedi novel, which was also written by Allston, the author revealed that it was Wraith Squadron member Jesmin Tainer, the daughter of Kell and Tyria Sarkin Tainer, who adopted the persona of Zilaash Kuh.\nJesmin was named in honor of Jesmin Ackbar, the first Wraith to die in Allston's debut novel, X-Wing: Wraith Squadron.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Antarian_Rangers/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Daala%27s_special-missions_force",
  "/wiki/Wraith_Squadron",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Kell_Tainer",
  "/wiki/Tyria_Sarkin_Tainer",
  "/wiki/Doran_Sarkin-Tainer",
  "/wiki/43_ABY",
  "/wiki/Anzat_(species)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/Force_psychosis",
  "/wiki/Quarren/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Dhidal_Nyz",
  "/wiki/Raid_on_the_Armand_Isard_Correctional_Facility",
  "/wiki/Seff_Hellin",
  "/wiki/Darkmeld",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Jedi_Order/Legends",
  "/wiki/44_ABY",
  "/wiki/Garik_Loran",
  "/wiki/General/Legends",
  "/wiki/Stavin_Thaal",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/Myri_Antilles",
  "/wiki/Wedge_Antilles",
  "/wiki/New_Jedi_Order",
  "/wiki/Lightsaber/Legends",
  "/wiki/Skakoan/Legends",
  "/wiki/Hrym_Mawarr",
  "/wiki/Captain/Legends",
  "/wiki/Savar",
  "/wiki/Rodian/Legends",
  "/wiki/Kaddit",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Luke_Skywalker",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Vrannin_Vaxx",
  "/wiki/New_Jedi_Temple",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Armand_Isard_Correctional_Facility",
  "/wiki/Prison/Legends",
  "/wiki/Cargo_hauler/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Tahiri_Veila",
  "/wiki/Imperial_Remnant",
  "/wiki/Head_of_State/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/Mandalorian_iron",
  "/wiki/Crushgaunt/Legends",
  "/wiki/Anti-Jedi_sentiment/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telepathy/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Concussor",
  "/wiki/Refresher/Legends",
  "/wiki/Force_speed",
  "/wiki/Hologram/Legends",
  "/wiki/Lightsaber_hilt/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Aaron_Allston",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/March_24",
  "/wiki/2009",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/Jesmin_Ackbar",
  "/wiki/X-Wing:_Wraith_Squadron",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_134"
 ]
}