{
 "name": "Jess Allashane",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jess Allashane was a veteran Human male soldier of the Alliance Special Forces during the height of the Galactic Civil War. Trained to counter Imperial tactics in cold-weather environments, Allashane was assigned to protect the Rebel Alliance's secret Echo Base headquarters on the remote ice planet Hoth. In 3 ABY, Allashane fought to defend Echo Base against the Empire's planetary assault during the Battle of Hoth.\nJess Allashane was a veteran soldier of the revolutionary Alliance to Restore the Republic in its struggle to defeat the Galactic Empire during the Galactic Civil War. He was among a full complement of 1,000 Alliance Special Forces soldiers assigned to protect Echo Base, the Rebellion's secret High Command headquarters on the remote ice planet Hoth.\nIn 3 ABY, the Empire discovered Echo Base and launched a full-scale invasion of the Rebel forces on Hoth. The Rebel battle strategy called for the base's Special Forces soldiers to be broken down into five companies, under the leadership of field commander Colonel Ledick Firest, to stall the Imperial invasion force long enough for base personnel and equipment to evacuate the planet. Allashane fought in the Rebels' defensive ice trenches against Imperial walkers and snowtroopers during the ensuing Battle of Hoth, which culminated in a tremendous Rebel defeat.\nJess Allashane was a veteran warrior of the Rebel Alliance's cause. Serving at the Rebellion's Echo Base ice facility, Allashane was trained to counter Imperial tactics in cold-weather environments. A Human, he had dark eyes and light skin.\nAllashane wore the standard cold-weather armor of the Rebel Echo Base field troops while on Hoth, including headgear, anti-glare goggles, scarf, padded vest, thermal flak jacket, gloves, belt, leggings, boots, and backpack. His equipment included binoculars, and he armed himself with an A295 blaster rifle and a blaster pistol sidearm, which he wore holstered at his right hip.\nThe character of Jess Allashane was created for the \"Echo Base Trooper\" card as part of the November 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game. The Hoth Limited set linked Allashane with a production photo of a Hoth Rebel soldier extra from the 1980 film Star Wars: Episode V The Empire Strikes Back. However, it is unclear whether the extra—and, by extension, Allashane—appears on-screen in the film.\nMany in the online Star Wars fan community have credited American actor Treat Williams with Allashane's portrayal. Williams visited England's Elstree Studios during the 1979 filming of The Empire Strikes Back and was photographed in-costume on the Echo Base set with actress Carrie Fisher, who played Princess Leia Organa. However, the film's external Hoth scenes, which include the Allashane character production photo, were shot in Finse, Norway, concluding on March 11, 1979. Moreover, the extras hired to portray Rebel soldiers during the Battle of Hoth were local Norwegians, including several dozen mountain-rescue skiers. Filming at Elstree Studios did not begin until March 13, once the Norway shots were completed. Therefore, Williams' involvement in the film does not correspond to the Allashane character.\nNorwegian author and television personality Arve Juritzen, who appeared in The Empire Strikes Back as a Rebel soldier extra during the Battle of Hoth scenes, has previously autographed the Jess Allashane SWCCG card for fans, suggesting that he, in fact, portrays the character in the card's picture.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Jess_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Temperature/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Evac_Rearguard_Action_101",
  "/wiki/Special_forces/Legends",
  "/wiki/Company/Legends",
  "/wiki/Field_Commander/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Ledick_Firest/Legends",
  "/wiki/Blizzard_Force/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Cold_assault_stormtrooper",
  "/wiki/Eye/Legends",
  "/wiki/Alliance_Cold_Weather_armor",
  "/wiki/Troop/Legends",
  "/wiki/Alliance_Cold_Weather_Headgear",
  "/wiki/Anti-glare_goggles/Legends",
  "/wiki/Scarf/Legends",
  "/wiki/Alliance_Cold_Weather_Padded_Vest",
  "/wiki/Thermal_flak_jacket",
  "/wiki/Alliance_Cold_Weather_Gloves",
  "/wiki/Alliance_Cold_Weather_Belt",
  "/wiki/Alliance_Cold_Weather_Leggings",
  "/wiki/Alliance_Cold_Weather_Boots",
  "/wiki/Alliance_Cold_Weather_Backpack/Legends",
  "/wiki/Binoculars/Legends",
  "/wiki/A295_blaster_rifle/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Holster/Legends",
  "/wiki/November",
  "/wiki/1996",
  "/wiki/Hoth_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars",
  "/wiki/Treat_Williams",
  "/wiki/Elstree_Studios",
  "/wiki/1979",
  "/wiki/Carrie_Fisher",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Finse",
  "/wiki/March_11",
  "/wiki/March_13",
  "/wiki/Arve_Juritzen",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars_Saga",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_10",
  "/wiki/Galaxy_at_War",
  "/wiki/Star_Wars_Character_Encyclopedia",
  "/wiki/Star_Wars:_The_Ultimate_Action_Figure_Collection",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Special_Edition_Limited",
  "/wiki/May_21",
  "/wiki/2010",
  "/wiki/September_22",
  "/wiki/2017",
  "/wiki/July_20",
  "/wiki/2011",
  "/wiki/September_15",
  "/wiki/November_3",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/June_27"
 ]
}