{
 "name": "Jessika_Pava",
 "display_name": "Jessika Pava",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dandoran"
     ]
    },
    {
     "name": "Born",
     "values": [
      "After 2 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.69 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet",
      "Resistance",
      "Poe Dameron's fighter wing",
      "Blue Squadron",
      "Black Squadron",
      "Poe Dameron's fighter wing",
      "Blue Squadron",
      "Black Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Jessika Pava, also known as Jess or Testor, as well as the Great Destroyer by droids, was a human female pilot of the Resistance during the war against the First Order. A native of the planet Dandoran, Pava was born in a time when the New Republic governed the galaxy, restoring democracy after decades of totalitarian rule by the Galactic Empire. Raised on the legends of Jedi Master Luke Skywalker, Pava was a great admirer of the Jedi who defeated Emperor Palpatine and became known as the best star pilot in galactic history.\nFollowing in her idol's example, Pava became a pilot in the New Republic Defense Fleet. However, in lieu of the Galactic Senate's unwillingness to punish the First Order's violations of the peace treaty that ended the Galactic Civil War, Pava chose to support General Leia Organa's organization as a Resistance pilot during the Cold War. Serving as a member of Blue Squadron and Black Squadron, in turn, she piloted the T-70 X-wing starfighter under the command of Commander Poe Dameron.\nPava served with distinction during her time in the Resistance, although the group's astromech units took note of her record for losing droids while on missions for the Resistance. In the aftermath of the Hosnian Cataclysm in 34 ABY, Pava's squadron deployed to Starkiller Base in an attempt to destroy the superweapon before it could destroy the Resistance base along with the entire planet of D'Qar. Their mission was ultimately a success, resulting in the base's destruction and the survival of the Resistance.\nJessika Pava was a human female born to parents at some point after 2 ABY who came from the planet Dandoran. During her childhood on Dandoran, Pava and her family were captured by pirates and sold into slavery. This led her to want to be in control and a hatred of being chained up later in life.\nAs a girl, she idolized the Rebel hero Luke Skywalker and regarded him as the greatest pilot in the galaxy. This admiration led her to follow in Skywalker's footsteps and join the Resistance. Although Pava didn't initially score high enough on the live-fire tests, Temmin Wexley used his influence to ensure that Pava could get her the time and focus that would eventually let her become a pilot.\nPava became a member of the Resistance during its conflict with the First Order, approximately thirty years after the Battle of Endor. She flew as a T-70 X-wing starfighter pilot in Blue Squadron, operating under the callsign of Blue Three. She was an admirer of Luke Skywalker, the famed Jedi Knight who served in the Alliance to Restore the Republic during the Galactic Civil War, and had heard stories of his time in the Rebellion, such as when he destroyed the Death Star during the Battle of Yavin.\nWhile performing a maintenance assignment while serving at a Resistance base, Pava met C-3PO, a protocol droid who had been in the service of Skywalker and the Rebellion during the Galactic Civil War. Upon realizing that Threepio knew Skywalker, she asked him to tell her a story about Skywalker's adventures during the war. Threepio regaled her with a story of Skywalker's time on Devaron after the Battle of Yavin, where he trained in the Jedi Temple of Eedit. Her time talking to Threepio was cut short, once Pava was called to a meeting in the Resistance command center.\nAs a friend of Captain Poe Dameron and a member of Black Squadron, Pava was handpicked by Dameron for a secret quest to find the explorer Lor San Tekka. General Leia Organa had tasked Dameron with finding Lor San Tekka in the hope of finding her lost brother Luke. Pava was also accompanied by the Galactic Civil War veterans L'ulo L'ampar and Temmin Wexley , and the pilot Karé Kun. Prior to departing, Pava told Dameron that she had to delay her repairs to her T-70 X-wing starfighter and asked about the details of their mission. Dameron apologized that their mission was classified for now.\nFor their first mission, Pava and her team traveled to the mountainous world of Ovanis. Ovanis was home to a cult called the Crèche, who were believed to have encountered San Tekka. While Dameron and BB-8 flew their X-wing into the Cave of the Crèche to question the Crèche cultists, Pava and her fellow pilots circled the skies. After initiating contact with the Crèche, Dameron contacted L'ulo to warn them that he had found a tracker on his starfighter. Kun then reported the presence of a First Order landing platform and other forces hovering above the Cave of the Crèche.\nFollowing the arrival of First Order forces, Pava asked her fellow pilots what Dameron had meant by his order \"get me some leverage.\" At L'ulo and Kun's recommendation, the pilots decided to figure it out for themselves. Wexley advocated seizing the First Order platform so that they could land and refuel their starfighters. Pava then proposed getting rid of the TIE/fo space superiority fighters so that they could land. She believed that the ground forces on the platform would surrender right away. L'ulo then used his A-wing to strafe the TIE fighters but was unable to destroy them all. The surviving TIE fighters engaged Black Squadron in a dogfight.\nHowever, the First Order commander Agent Terex had kept back the Maxima-A class heavy cruiser Ravenous and its TIE fighter complement in reserve. Black Squadron soon found itself pursued by several TIE fighters. Outnumbered and outgunned, Pava remarked that they had to get out of the line of fire. When L'ulo recommended buying them time for Dameron, Wexley ordered his pilots to split up and head into the canyons in an attempt to disperse their pursuers. Pava found herself pursued by three TIE fighters but managed to lose them by collapsing a ridge on top of them. However, her astromech droid was hit by two other TIE fighters. At Wexley's recommendation, Pava and her fellow pilots launched a head-on attack on the TIE fighters.\nDuring the dogfight, Pava and her fellow pilots witnessed two large winged creatures fighting above the Cave of the Crèche. The dark-winged creature ultimately triumphed over the blue-winged creature. When Dameron turned the tables on Terex and his ground forces, he managed to force the First Order Security Bureau Agent to withdraw his TIE fighters. This enabled Black Squadron to land at the Cave of the Crèche and refuel their starfighters. After the Crèche cultists had departed on the black-winged creature, Black Squadron departed. Dameron then radioed for Terex's cruiser Ravenous to pick up the stranded First Order forces. Dameron had decided not to take Terex into custody to avoid provoking war between the First Order and the New Republic.\nFollowing the mission to Ovanis, Pava and her fellow pilots returned to the base on D'Qar where they celebrated with drinks. Pava took the opportunity to chat with the mechanic Oddy Muva. She thanked him for installing the new boosters on her X-wing fighter. When Muva wished that he could have seen action, Pava reassured him that he would get his turn once the Resistance obtained more starfighters from the New Republic. Muva thanked her. Pava then told Muva that Dameron was planning to take the squadron on another mission. When Muva asked about the mission, Pava admitted that she did not know but recalled that Dameron had mentioned a prison. The two then shared drinks.\nFor their next mission, Black Squadron traveled to Megalox prison on the planet Megalox Beta. Dameron wanted to question Grakkus the Hutt, who was an inmate at the prison. Megalox was considered to be one of the roughest prisons for the worst criminals. The prison was surrounded by a gravity field that was projected by an orbiting space station. Upon arriving, Black Squadron was greeted by Warden Luta, who had been bribed by Organa into letting her pilots visit the prison. Luta's prison guards transported Pava and her comrades on a shuttle into the prison.\nHowever, the guards then abandoned them at the landing port. Pava and her fellow pilots were forced to fight their way through the crowd to Grakkus' fortress. After arriving, they were accosted by Grakkus and his Hutt posse, who allowed Dameron to enter Grakkus' quarters. While Dameron met with Grakkus, Pava and the others waited in the courtyard. Since Terex had already arrived, Grakkus offered to reveal the information to whoever could free him from the prison. Pava and her fellow pilots were shocked to see Terex but allowed him to leave the fortress.\nShortly later, Dameron exited Grakkus' quarters and briefed the squadron about their change in plans. In order to extract leverage, Dameron ordered BB-8 and the other astromech droids to disable Megalox's gravity shield. Pava's astromech droid O-R10N took part in the operation but was destroyed by a security droid. While waiting, Pava expressed frustration that she did not have a ship or weapons. Dameron expressed empathy for her predicament but promised that they would get back in action soon. At that point, Terex returned with an army of gangsters that he had recruited to storm the fortress and kill Grakkus' guards and Black Squadron.\nWhen the mob breached the gates, Pava and her fellow pilots joined the Hutts in fighting off the gangsters. As the crowd surged, Dameron told his Squadron to fall back but Pava countered that Grakkus had sealed his gates. Black Squadron gathered outside the door to Grakkus' house. Shortly later, BB-8 contacted Dameron to inform them that the gravity shield had been deactivated. Under Dameron's orders, Pava and the others donned their gravity belts. With the gangsters incapacitated by Megalox Beta's gravity, Black Squadron rescued Grakkus.\nAfter Dameron contacted Luta and secured a deal to leave the prison with Grakkus, Pava and her fellow pilots returned to the space station's hangar. Pava soon learned that O-R10N had not survived the mission. After BB-8 transmitted back the control codes for the prison to Luta, Pava and her fellow pilots and Grakkus prepared to jump into hyperspace. However, Terex had escaped Megalox in his starship Carrion Spike and launched an attack on the station. At Temmin's urging, Black Squadron turned back and bombarded the Carrion Spike, stopping Terex from destroying the station's shuttles and allowing Luta to attend to the prisoners. The squadron returned to D'Qar where Organa instructed Dameron to delay their search for San Tekka in order to investigate whether the First Order had a spy within the Resistance.\nDue to the presence of a spy, Poe found himself unable to trust his fellow Black Squadron pilots including Jess Pava. He did not bring them along during his solo missions to Pheryon and Kaddak. During the Kaddak mission to recover a Resistance droid spy who had purportedly obtained valuable intelligence on the First Order, Poe brought BB-8, C-3PO, and the technician Oddy Muva along instead, choosing to leave Jess and the other pilots at the Resistance base on D'Qar. Unknown to them, Oddy Muva had been blackmailed by Terex into becoming a First Order spy. Terex had taken his wife Sowa Chuan hostage to ensure his compliance.\nLater, Jessika and her fellow Black Squadron pilots flew to a desert planet to rescue Poe and the droids, who had been pursued there by Terex and the Ranc Gang. Upon arriving, Jess remarked there were too many \"Uglies\" which would make it hard for them to rescue Poe. Temmin reassured her that they could do it since their opponents were leftovers made from discarded Rebel and Imperial technology. During the dogfight, Jess expressed surprise when Terex's flagship Carrion Spike suddenly opened fire on the Ranc Gang's \"Uglies.\" After learning that Oddy had evacuated the slaves and sabotaged the Carrion Spike's computers, Jess and the rest of Black Squadron escorted the escape pods.\nDespite their best efforts, one of the escape pods was destroyed and L'ulo was killed in combat. After the escape pods had entered the desert planet's atmosphere, Jess and her fellow pilots regrouped for an attack on the Carrion Spike and the remaining \"Uglies.\" Shortly later, a First Order Maxima-A class heavy cruiser exited hyperspace and began destroying Terex's fleet. Jess and her comrades expressed surprise, not knowing that Terex had embarked on an unsanctioned mission against the First Order's directives. Jess and her fellow pilots flew over Poe and a First Order landing party led by Commander Malarus to ensure that hostilities did not take place. Fortunately for the Resistance, Malarus was only interested in apprehending Terex.\nPava and the rest of Black Squadron then went on a mission to obtain critically needed fuel supplies by meeting with the freighter Romary.\nThe Squadron's next mission had them split up, with Kun flying escort for Pava and the journalist/agent Suralinda Javos to Spalex aboard a BTL-S3 Y-wing Starfighter. Once there, they witnessed First Order troops harassing the natives. Kun and Pava intervened, but were captured. Javos managed to free them, and they reunited with Dameron and Wexley, who had escaped the First Order with the help of Muva.\nBack at base, Pava had to deal with the fact that among the Resistance astromech droids, she was known as the \"Great Destroyer\" for losing so many droids. Zari Bangel tried to change that, but the droids ran away when distracted. Then, the Resistance got a lead on their search for San Tekka.\nShortly afterward, as Pava tried to install a stand-alone navicomputer aboard her X-wing, Ivee agreed to fly with her. They then departed to Cato Neimoidia to retrieve San Tekka, where as a distraction Black Squadron engaged in a lengthy dogfight with Baron Paw Maccon's droid starfighters. However, agents Terex and Malarus abducted San Tekka from them.\nLater, the squadron rendezvoused at the Raddus, where they were given orders to launch at a moment's notice to recover San Tekka. Pava ran a mathematical simulation to tell when Terex's vessel may run out of fuel in hyperspace, leading her to deduce that the tracker aboard had been discovered or destroyed.\nOnce Terex dropped a line to the Resistance informing them of San Tekka's location in the Great Forveen Nebula, Black Squadron is deployed. Dameron lead the team on a strike on the light cruiser, where it was destroyed. However, a shot hit and disabled Pava's X-wing, crippling it and leaving it vulnerable to an incoming concussion missile. Ivee sacrificed herself to save Pava, telling her it is was not her fault.\nAfter recovering San Tekka, they returned to D'Qar for Snap and Karé's wedding. Pava comforted BB-8, having found a processor left behind by Ivee.\nWhen the First Order targeted the Resistance base with the Starkiller, a planet-destroying superweapon, Pava, along with numerous Resistance pilots, engaged the First Order's forces in an attempt to destroy the weapon. After Dameron successfully crippled the weapon's thermal oscillator, destroying the Starkiller, Pava and the other surviving pilots returned to their base and celebrated. Her astromech droid copilot during the battle was R0-4L0.\nFollowing the battle, Organa sent Pava and several other pilots, including Wexley, to gather the New Republic's surviving commanders, after the Hosnian Cataclysm had wiped out most of the New Republic's fleet. They departed while the rest of the Resistance was evacuating the base. She flew with the astromech droid 6G-66. She recorded a message that was transmitted by a com sat and picked up by the surviving Resistance fighters aboard the Millennium Falcon. Their first mission was to Pastoria, where they failed to convince King Siroc to aid their cause.\nTheir next stop was at Ikkrukk, where the Squadron responded to the distress call. Pava crashed trying to get through the city's shields. They were then trapped by Ikkrukk First Order sympathizers, but Pava and Javos managed to rendezvous with Grist and restore the city defenses.\nJessika Pava was a human female with black hair and light skin. She was a dedicated member of the Resistance and an admirer of Luke Skywalker, having heard that he was the best star pilot in the galaxy. Jessika was a trusted and loyal friend of Poe Dameron, earning her a place in his Black Squadron. She was a skilled and competent starfighter pilot. Jess also knew how to wield a blaster. Pava was not used to fighting without any weapons or a starship. She also did not like being unable to control her fate and surroundings, given her history of being captured by pirates. Still, Pava held herself well against a mob of criminals hired by Terex on Megalox Beta.\nPava's loyalty to Poe led her and her fellow Black Squadron pilots to travel to a desert planet to rescue him. She was initially daunted by Terex's swarm of \"Uglies\" until Temmin reassured her they could beat the \"junk\" fighters. Jess was affected by L'ulo's death and vowed revenge against Terex's Ranc Gang.\nShe took L'ulo's death hard, and it was Dameron's inspired speech about how they were luminous beings that helped her deal with it. Pava also developed a reputation among the base's astromech droid pool where she was known as \"the great destroyer,\" causing them to avoid flying with her. When Pava set out to pick a new astromech droid for her X-wing, every member of the astromech droid pool fled at the sight of her, except for BB-8, who held up his lighter in a gesture that Pava had a feeling was meant to be less than friendly.\nJessika Pava wore a flight helmet that read \"NAO\" in Aurebesh.\nJessika Pava first appeared in the 2015 novel The Weapon of a Jedi: A Luke Skywalker Adventure, written by Jason Fry. In Star Wars: Episode VII The Force Awakens, she was portrayed by Jessica Henwick. Henwick was a finalist for the role of Rey in The Force Awakens, and auditioned for six months. Although she ultimately was not cast in the role, director J.J. Abrams wanted to use her in the movie and wrote the character of Jessika Pava specifically for her. The actress expressed interest in reprising the role for the 2019 film Star Wars: Episode IX The Rise of Skywalker, but the character did not make an appearance in the film.\nThe decals on the Resistance pilot flight helmets were designed by costume designer and concept artist Glyn Dillon. The name inscribed on Pava's helmet, Nao, is a reference to the main character of Dillon's 2012 graphic novel The Nao of Brown.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Poe_Dameron",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Resistance_Reborn",
  "/wiki/A_Eulogy_for_Snap",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Dandoran",
  "/wiki/2_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Resistance",
  "/wiki/Poe_Dameron%27s_fighter_wing",
  "/wiki/Blue_Squadron_(Resistance)",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Droid",
  "/wiki/Pilot",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Reproduction",
  "/wiki/Time",
  "/wiki/New_Republic_Era",
  "/wiki/The_galaxy",
  "/wiki/Democracy",
  "/wiki/Standard_decade",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi",
  "/wiki/Battle_of_Endor",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Star",
  "/wiki/Galaxy",
  "/wiki/Timeline_of_galactic_history",
  "/wiki/New_Republic_pilot",
  "/wiki/New_Republic_Senate",
  "/wiki/Galactic_Concordance",
  "/wiki/Galactic_Civil_War",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Resistance_pilot",
  "/wiki/Cold_War",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Astromech_droid",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/Squadron",
  "/wiki/Starkiller_Base",
  "/wiki/Superweapon",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Parent",
  "/wiki/Pirate",
  "/wiki/Slavery",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Temmin_Wexley",
  "/wiki/Standard_year",
  "/wiki/Callsign",
  "/wiki/Blue_Three",
  "/wiki/Jedi_Knight",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/C-3PO",
  "/wiki/Protocol_droid",
  "/wiki/Skirmish_in_the_Temple_of_Eedit",
  "/wiki/Devaron",
  "/wiki/Yavin_Prime",
  "/wiki/Jedi_training",
  "/wiki/Temple_of_Eedit",
  "/wiki/Captain",
  "/wiki/Hunt_for_Lor_San_Tekka",
  "/wiki/Lor_San_Tekka",
  "/wiki/L%27ulo_L%27ampar",
  "/wiki/Kar%C3%A9_Kun",
  "/wiki/X-wing_starfighter",
  "/wiki/Mission_to_Ovanis",
  "/wiki/Mountain",
  "/wiki/Ovanis",
  "/wiki/Cr%C3%A8che",
  "/wiki/BB-8",
  "/wiki/Black_One",
  "/wiki/Cave_of_the_Cr%C3%A8che",
  "/wiki/Homing_beacon",
  "/wiki/Starfighter",
  "/wiki/First_Order_landing_platform",
  "/wiki/First_Order_military",
  "/wiki/Cave",
  "/wiki/Fuel",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/TIE_line",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/Maxima-A_class_heavy_cruiser",
  "/wiki/Ravenous",
  "/wiki/Fire",
  "/wiki/Unidentified_Cr%C3%A8che_creature",
  "/wiki/First_Order_Security_Bureau",
  "/wiki/Cruiser",
  "/wiki/Technician",
  "/wiki/Oddy_Muva",
  "/wiki/Prison",
  "/wiki/Mission_to_Megalox_Beta",
  "/wiki/Megalox",
  "/wiki/Megalox_Beta",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Hutt",
  "/wiki/Gravity",
  "/wiki/Megalox_space_station",
  "/wiki/Orbit",
  "/wiki/Space_station",
  "/wiki/Warden",
  "/wiki/Luta",
  "/wiki/Shuttle",
  "/wiki/Fortress_of_Grakkus_the_Hutt",
  "/wiki/Grakks",
  "/wiki/Fortress",
  "/wiki/O-R10N",
  "/wiki/Unidentified_Megalox_droid",
  "/wiki/Starship",
  "/wiki/Army",
  "/wiki/Gangster",
  "/wiki/Death",
  "/wiki/Gravity_belt",
  "/wiki/Hangar",
  "/wiki/Hyperspace",
  "/wiki/Carrion_Spike",
  "/wiki/Prisoner",
  "/wiki/Spy",
  "/wiki/Skirmish_on_Pheryon",
  "/wiki/Pheryon",
  "/wiki/Kaddak",
  "/wiki/Mission_to_Kaddak",
  "/wiki/Resistance_spy_droid_network",
  "/wiki/Sowa_Chuan",
  "/wiki/Unidentified_desert_planet",
  "/wiki/Ranc_Gang",
  "/wiki/Ugly",
  "/wiki/Malarus",
  "/wiki/Romary",
  "/wiki/Suralinda_Javos",
  "/wiki/Spalex",
  "/wiki/BTL-S3_Y-wing_Starfighter",
  "/wiki/Unidentified_Spalex_species",
  "/wiki/Zari_Bangel",
  "/wiki/Ivee",
  "/wiki/Cato_Neimoidia",
  "/wiki/Baron",
  "/wiki/Paw_Maccon",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/Great_Forveen_Nebula",
  "/wiki/Concussion_missile",
  "/wiki/Snap_and_Kar%C3%A9%27s_wedding",
  "/wiki/Processor",
  "/wiki/Thermal_oscillator",
  "/wiki/R0-4L0",
  "/wiki/Fleet",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/6G-66",
  "/wiki/Millennium_Falcon",
  "/wiki/Pastoria",
  "/wiki/Siroc",
  "/wiki/Ikkrukk",
  "/wiki/Ikkrukk_First_Order_sympathizers",
  "/wiki/Grist",
  "/wiki/Hair",
  "/wiki/Blaster",
  "/wiki/Flight_helmet",
  "/wiki/Aurebesh",
  "/wiki/2015",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/Jason_Fry",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Jessica_Henwick",
  "/wiki/Rey_Skywalker",
  "/wiki/J.J._Abrams",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Glyn_Dillon",
  "/wiki/2012",
  "/wiki/Category:Images_of_Jessika_Pava",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Before_the_Awakening",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure_(audiobook)",
  "/wiki/Poe_Dameron_1",
  "/wiki/Poe_Dameron_2",
  "/wiki/Poe_Dameron_3",
  "/wiki/Poe_Dameron_4",
  "/wiki/Poe_Dameron_5",
  "/wiki/Poe_Dameron_6",
  "/wiki/Poe_Dameron_8",
  "/wiki/Poe_Dameron_11",
  "/wiki/Poe_Dameron_13",
  "/wiki/Poe_Dameron_14",
  "/wiki/Poe_Dameron_15",
  "/wiki/Poe_Dameron_16",
  "/wiki/Poe_Dameron_17",
  "/wiki/Poe_Dameron_18",
  "/wiki/Poe_Dameron_19",
  "/wiki/Poe_Dameron_20",
  "/wiki/Poe_Dameron_21",
  "/wiki/Poe_Dameron_22",
  "/wiki/Poe_Dameron_23",
  "/wiki/Poe_Dameron_24",
  "/wiki/Poe_Dameron_25",
  "/wiki/Poe_Dameron_Annual_2",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/The_Force_Awakens_Adaptation_6",
  "/wiki/Join_the_Resistance:_Attack_on_Starkiller_Base",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Poe_Dameron_26",
  "/wiki/Poe_Dameron_27",
  "/wiki/Poe_Dameron_29",
  "/wiki/Poe_Dameron_30",
  "/wiki/Poe_Dameron_31",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Force_Awakens:_New_Adventures",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Heroes_of_the_Resistance_Expansion_Pack",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_165",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_X-Wing_Deluxe_Book_and_Model_Set",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Resistance_Conversion_Kit",
  "/wiki/T-70_X-Wing_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_26",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_32",
  "/wiki/200_Reasons_Why_We_Love_Star_Wars",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Poe_Dameron_7",
  "/wiki/Poe_Dameron_12",
  "/wiki/Poe_Dameron_28",
  "/wiki/January_10",
  "/wiki/2020",
  "/wiki/February_29",
  "/wiki/September_19",
  "/wiki/2018",
  "/wiki/December_29",
  "/wiki/September_29",
  "/wiki/2017",
  "/wiki/September_17",
  "/wiki/2022",
  "/wiki/File:Instagram_Glyn_Dillon.png",
  "/wiki/November_22",
  "/wiki/May_24"
 ]
}