{
 "name": "Jessa_Dajus",
 "display_name": "Jessa Dajus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "New RepublicFarStar",
      "FarStar"
     ]
    }
   ]
  }
 ],
 "content": "Jessa Dajus was a Force-sensitive Human Female Imperial tactical officer, and later a member of the crew of the New Republic CR90 corvette FarStar.\nColonel Dajus was an Imperial tactical officer, and one of Moff Kentor Sarne's top officers. While serving him, she learned that an entity known as DarkStryder was responsible for the advanced technology Sarne had been experimenting with. She researched the information, possibly in preparation to sell it to underworld contacts, but was discovered by Sarne. He imprisoned her in his dungeons and interrogated her, trying to learn how much she knew. She never broke, but received several nasty scars on her left arm.\nWhen Page's Commandos stormed Sarne's palace, Dajus was rescued from the detention center. Unwittingly using the Force, Dajus sensed that one of the cell doors was rigged to explode and destroy the detention blocks. She warned Kaiya Adrimetrum in time.\nClaiming to be a lowly lieutenant and shuttle pilot who had been on the wrong side of one of Sarne's \"loyalty purges,\" Dajus led the New Republic forces to the Sorbiss Valley hangar where the Renegade—later renamed the FarStar—was berthed. She was accepted as a member of the crew, despite reservations about having a former Imperial officer as a tactical advisor. However, she also had more knowledge about Sarne and his operations than any other member of the crew, making her a valuable asset. During her time on the ship, she wore her Imperial uniform. Captain Keleman Ciro refused to allow her to carry a sidearm on board ship, but did permit her to carry one on missions.\nDajus' main reason for joining the FarStar mission was to gain revenge against Sarne for his treatment of her. However, her interest in the DarkStryder technology had not waned. As the FarStar traveled further into the Kathol sector, the motive became stronger and stronger until she was intently focused on finding Sarne and DarkStryder. As a result, anything else was to be ignored or eliminated. She bullied those she could to do her bidding, or used subtle persuasion to get her way.\nAlthough she never acknowledged it, or even believed in it, Dajus was sensitive to the Force. She knew she was lucky, and knew things before they happened or were revealed to her, but never ascribed it to the Force. Her sensitivity was both her greatest strength and her greatest weakness. She was regularly haunted by dreams of giant black spiders tempting her away from daylight, or driving her toward the night. Slowly, Dajus was falling to the dark side of the Force, and was caught in a battle between good and evil. On one hand, she supported the crew of the FarStar, but she also wanted Sarne and the source of the DarkStryder technology. Despite this, she knew that she had to use both facets of her personality to defeat Sarne.\nAs a result of her service with Sarne, and her Force-sensitivity, Dajus knew a lot of information that she kept to herself. Ever the manipulator, she would wait until revealing the information was beneficial to her and would help her achieve her goals. She was aware of Gorak Khzam's past as a slaver, and Doctor Akanseh's time as a torturer.\nDajus may have been Sarne's lover. During one small text piece in The DarkStryder Campaign, she awakes from a nightmare and Sarne is sitting on her bed. However, this may have been from her time as a prisoner, and Sarne was visiting her in detention.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jessa_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/FarStar",
  "/wiki/Force-sensitives",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/DarkStryder",
  "/wiki/Katarn_Commandos",
  "/wiki/The_Force/Legends",
  "/wiki/Kaiya_Adrimetrum",
  "/wiki/Lieutenant/Legends",
  "/wiki/Sorbiss_Valley",
  "/wiki/Keleman_Ciro",
  "/wiki/DarkStryder_technology",
  "/wiki/Kathol_sector",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Gorak_Khzam",
  "/wiki/Akanseh",
  "/wiki/Torture/Legends",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/Dream_Labyrinth",
  "/wiki/The_Saga_Begins",
  "/wiki/Artifact_of_Aaris",
  "/wiki/Death_Is_Remotely_Possible",
  "/wiki/Crisis_(RPG_adventure)",
  "/wiki/Traitor_in_our_Midst",
  "/wiki/Plant_Food",
  "/wiki/The_Kathol_Outback",
  "/wiki/Little_Empires",
  "/wiki/Wildfire_(adventure)",
  "/wiki/The_Masters_of_Exocron",
  "/wiki/Galaxy%27s_Edge",
  "/wiki/Harm%27s_Way",
  "/wiki/The_Kathol_Rift",
  "/wiki/Waystation",
  "/wiki/Home_(RPG_adventure)",
  "/wiki/Showdown_(RPG_adventure)",
  "/wiki/Endgame_(RPG_adventure)",
  "/wiki/Endgame",
  "/wiki/Star_Wars_Miniatures_Battles#Blister_Packs",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Iron_Man",
  "/wiki/Star_Wars_Galaxy_Magazine_6",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}