{
 "name": "Jet Nebula",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Bareesh Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Jet Nebula, born Jeke Kerron, was a male smuggler who was active during the Cold War.\nJet Nebula was a human smuggler and captain of the Auriga Fire. While working for the Hutt matriarch Tassaa Bareesh in Wild Space, Nebula captured the starship Cinzia, a ship from the planet Sebaddon. The discovery of this ship caused the Rodian Shinqo to attempt a mutiny of Nebula, which Nebula promptly foiled. After communications with the Cinzia, the Auriga Fire began boarding. Suddenly Nebula detected a power surge from the Cinzia and after moving the Auriga Fire away, as Nebula suspected, the Cinzia self-destructed. Among the wreckage Nebula found the starship's navicomp and a strange object which, unknown to Nebula at the time, produced insidious Hex droids.\nBack on Nal Hutta Tassaa Bareesh enticed the Galactic Republic and the Sith Empire by placing the two objects up for auction. The Republic sent diplomatic envoy Ula Vii, a double-agent working as an Imperial spy; the Jedi Order, which sent Padawan Shigar Konshi and ex-special forces trooper Larin Moxla; and the Sith Empire, which dispatched Sith Lord Darth Chratis, Chratis' apprentice, Eldon Ax, and the envoy Ia Nirvin. At Tassaa Bareesh's palace, Nebula met with Vii, realizing quickly that the man was not actually working for the Republic. However, they were both captured and interrogated briefly by Dao Stryver, before they were caught in the middle of a large skirmish in the palace, when the droid nest produced hexes that attacked the Jedi and Sith who had been attempting to get to the treasure, as well as all of the Republic and Imperial reinforcements.\nAfterward, Nebula took Vii, Konshi, Moxla, and Hetchkee—the sole surviving member of Vii's security detail—aboard the Auriga Fire to find the planet of the hexes' origin. Their search led them to Sebaddon, a world orbiting a black hole. When Republic forces arrived soon after, the fleet was attacked by hexes from the planet; and as Imperial ships arrived, they were attacked, too. The Republic and Imperial forces were then called by Dao Stryver—who had been watching the events unfold from Sebaddon's moon—to form an alliance in order to destroy the hexes before they could take over the galaxy, as the hexes were multiplying in number very quickly. Nebula then took Vii, who had been chosen to command the mission, aboard the Auriga Fire and watched the events unfold, assisting the envoy and spy in his job. During the ensuing battle, however, the Republic and Imperial ships refused to cooperate with Vii's exact orders, because they wanted to keep most of their firepower in reserve in case they were betrayed by their allies. Nebula then had his droid, Clunker, hack into the Republic and Imperial ships' codes and take control of the entire fleet, controlling the ships and forcing them to carry out their orders. The battle was eventually won, but Nebula ejected Vii from the Auriga Fire's airlock onto a shuttle passing by below. Nebula then left to attend to other business.\nJet Nebula was a somewhat mysterious character who purposely tried to appear less capable and important than he really was, causing nearly everyone to underestimate him. In reality he was highly capable and quite dangerous to his enemies. He made a point of being \"in the know\" but preferred to lay low and let others deal with situations—only taking action when all other attempts had failed.\nOverall he was very laid back, accepting things as they came without getting upset and without seeming to care. This was an affectation, however, because he would come through when needed for the big things and also showed foresight in how he disabled Dao Stryver in the cantina on Tatooine and in how he wiped the databanks of both factions' ships before leaving Sebaddon. Jet was very perceptive and smart.\nNebula appeared to have no conscience, but this was also an affectation. He stayed at Sebaddon and took control of both fleets in an attempt to save the galaxy. He also didn't kill Dao Stryver in the cantina on Tatooine, when common sense dictated that he should have. He came across as the self-centered smuggler who cares only for personal gain, but in reality would do the right thing when necessary.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Bareesh",
  "/wiki/Smuggler/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Auriga_Fire",
  "/wiki/Hutt/Legends",
  "/wiki/Tassaa_Bareesh",
  "/wiki/Wild_Space/Legends",
  "/wiki/Cinzia",
  "/wiki/Sebaddon",
  "/wiki/Rodian/Legends",
  "/wiki/Shinqo",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Fastbreeder",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Envoy/Legends",
  "/wiki/Ula_Vii",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Spy/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Shigar_Konshi",
  "/wiki/Special_forces/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Larin_Moxla",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Chratis",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Eldon_Ax",
  "/wiki/Ia_Nirvin",
  "/wiki/Tassaa_Bareesh%27s_palace",
  "/wiki/Dao_Stryver",
  "/wiki/Skirmish_in_Tassaa_Bareesh%27s_palace",
  "/wiki/Jedi/Legends",
  "/wiki/Hetchkee",
  "/wiki/Planet/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Black_hole/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Independent_Operation_Sebaddon",
  "/wiki/Clunker",
  "/wiki/Shuttle/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}