{
 "name": "Jevan_Monsul",
 "display_name": "Jevan Monsul",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Intelligence",
      "Imperial Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Jevan Monsul was a Human male Imperial officer who lived during the Galactic Civil War.\nJevan Monsul was an officer of the Imperial Intelligence during the Galactic Civil War between the Galactic Empire and the Rebel Alliance. After the Battle of Yavin, he held the rank of lieutenant and was based on the Outer Rim planet Tatooine. Monsul primary operated out of Bestine's Cheapside Cantina\nIn 1 ABY, the smuggler Cal Handro, was shot down above Naboo's moon of Rori. The pilot was transporting a new kind of spice for the Rebel Alliance when he was attacked and crash-landed on the moon. The Empire was very interested about Handro's cargo and Jevan Monsul was ordered to lead an investigation. Sergeant Vekker of the Imperial Intelligence contacted spacers and offered them to travel to Tatooine in order to work for Lieutenant Monsul.\nJevan Monsul assembled a group of spacers on Tatooine and sent them readily on Rori to search for Cal Handro. It appeared that the man had survived the crash but he had vanished in the wilderness. The spacers successfully localized the crash site of Cal Handro's ship, in the Madyn Plains of Rori, but did not find any trace of the smuggler, only Black Sun henchmen also looking for the missing pilot. The spacers managed to collect Handro's datapad and a sample of spice and brought it back to Jevan Monsul. The officer then requested the spacers to bring the spice to a loyal Imperial medic, Doctor Edvar Vang, for analyze. In fact, Vang already knew the existence of that spice but he was too afraid to provide any information. He suggested the spacers to meet his friend Moxxar Krieg on Tatooine but the latter was found murdered at his place. In the meantime, spacers working for Tyla Jinn, one of Handro's friend, and for Rebel officer Veega Madish also searched for the missing pilot on Rori.\nA short time later, a woman by the name Kaila Min, a regular at the Gambling Hall in Narmle, contacted Jevan Monsul and pretended she saw Cal Handro in the wilderness of Rori. The spacers rushed to the pilot's last known location, only to be attacked by Black Sun minions. From their attackers, they obtained the location of the Black Sun base on Rori. The spacers then raided the base but did not find Handro there.\nJevan Monsul later learnt that Cal Handro had met the Bothan information broker Wire on Talus. The Bothan informed the spacers that the smuggler was wanted dead by Trussk, a slavemaster of the Blackscale Clan who considered that Handro was interfering in their business by shipping slaves for a rival Trandoshan clan. The spacers then assaulted Trussk's fortress on Naboo but, again, they did not find Handro.\nFinally, Cal Handro was localized at the Martano estate, on Rori. Jevan Monsul thus tasked the spacers to encounter the wealthy gambler Tierce Martano in order to convince him to hand over the pilot to the Empire. Since Martano was a powerful man, the Imperial officer preferred to avoid any conflict with him. However, when they arrived at the estate, the place was besieged by Black Sun enforcers. While the spacers attacked the criminals, Martano sent a distress alert to both the Empire and the Rebel Alliance because he knew that both factions were looking for the smuggler. The adventurers finally managed to kill all Black Sun forces and met Tierce Martano. As the gambler wished to get rid of Handro as soon as possible, he eagerly accepted to give the location of Handro to the spacers.\nAlthough the hunt for Handro was coming to an end, Jevan Monsul was suddenly reassigned. Imperial Officer M'Kae was designated to investigate the case and Monsul advised the spacers to report to him as soon as possible. Cal Handro was eventually killed in his starship during a space battle between Imperial and Rebel forces in the Naboo system.\nJevan Monsult was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Jevan Monsult was added to the game with the first chapter of the \"Secrets of the Syren\" questline, released with the \"Publish 14\", on March 9, 2005. The \"Secrets of the Syren\" story arc was removed from the game with the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Vekker_(sergeant)",
  "/wiki/Cal_Handro",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Bestine_(city)",
  "/wiki/Cheapside_Cantina",
  "/wiki/1_ABY/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Syren_spice",
  "/wiki/Madyn_Plains",
  "/wiki/Black_Sun/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Edvar_Vang",
  "/wiki/Moxxar_Krieg",
  "/wiki/Moxxar_Krieg%27s_house",
  "/wiki/Tyla_Jinn",
  "/wiki/Veega_Madish",
  "/wiki/Black_Sun_bunker",
  "/wiki/Kaila_Min",
  "/wiki/Narmle_(city)",
  "/wiki/Bothan/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Wire",
  "/wiki/Talus/Legends",
  "/wiki/Trussk",
  "/wiki/Blackscale_Clan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Trussk%27s_house",
  "/wiki/Martano_estate",
  "/wiki/Tierce_Martano",
  "/wiki/M%27Kae/Legends",
  "/wiki/Cal_Handro%27s_Warlord_Heavy_Cruiser",
  "/wiki/Naboo_system/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_9",
  "/wiki/2005",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Battle_of_Restuss",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}