{
 "name": "Jewl%27a_Nightbringer",
 "display_name": "Jewl'a Nightbringer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3641 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Jewl'a Nightbringer was a female Zabrak bounty hunter born during the Great Galactic War and in operation during the subsequent Cold War. She was the most feared hunter in her day. Nightbringer was known to be ruthless, with a rigorous belief in doling out retribution to those who crossed her.\nBorn during the galaxy-wide conflict of the Great Galactic War, Jewl'a Nightbringer grew up in the lower levels of Coruscant. She was raised in a life of poverty and violence, and was surrounded by regular food riots and looting due to the effects of the Mandalorian blockade of the Hydian Way. Orphaned as a teenager, Nightbringer was forced to rely on her ruthless nature as a natural-born fighter—becoming a predator rather than becoming the victim of one.\nNightbringer spent years honing her bounty hunting skills, while also enacting harsh retribution on anyone who crossed her. Once she had earned enough credits, she expanded her hunts off of the Republic capital and her reputation spread across the galaxy. As she continued collecting bounties, she was cited thirty-two times by local authorities for excessive force, wanted by authorities in seven systems, and her license to operate had been revoked in Republic space.\nAt some point in her career, Nightbringer was sponsored for the Great Hunt by an Exchange crime lord who had seen her in action, and survived being on her list of targets for a brief time. Her victory was noteworthy for the cruelty in which she operated, boasting no live captures. At the victory celebration, she openly showed her contempt of the Mandalorians she had bested in the contest. She flaunted her victory over them in spite of challenges for honor duels numbering in the hundreds. This event catalyzed her infamous reputation throughout the known galaxy, earning her respect in the eyes of the Mandalorians and fear from the denizens of the galactic underworld.\nLater she was killed along with several other Great Hunt Champions by a Republic kill team assembled by the Jedi Master Jun Seros.\nJewl'a Nightbringer was a vengeful individual and a born fighter. Growing up in the violent ways of street life forced her to develop such traits. She was known to be cruel and hold grudges, much to the peril of those who wronged her. She held Mandalorians in great contempt, as they were partially responsible for the harsh conditions in which she was raised. However, her fearlessness in the face of hundreds of honor challenges after the Great Hunt earned her the respect of the Mandalorians she so despised. Her ruthlessness and fearsome success record caused her to be the most feared bounty hunter of her day.\nJewl'a Nightbringer was first mentioned in a The Holonet entry on the official Star Wars: The Old Republic website. Her entry has several phrases written in Aurebesh which read \"Blacklist Veteran,\" \"Ice Queen\" and \"Ultimate Sore Loser.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/3641_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/The_galaxy/Legends",
  "/wiki/Blockade_of_the_Hydian_Way",
  "/wiki/Bounty/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_system/Legends",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Exchange",
  "/wiki/Crime_lord/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Honor_duel",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jun_Seros_(Jedi)",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Aurebesh/Legends",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}