{
 "name": "Jez Planchet",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 1 BBY and 0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Military",
      "Alliance Military"
     ]
    }
   ]
  }
 ],
 "content": "Jez Planchet was a Human male member of the Rebel Alliance during the Galactic Civil War. He served as a lieutenant in the Alliance Military. In 1 BBY, Planchet went on a deep covert mission to the planet Malastare without being able to transmit to the Alliance. He was captured by Imperial forces and underwent a long period of torture before eventually breaking. Planchet revealed everything he knew about the Rebels before being killed by a blaster shot.\nJez Planchet was a Human male who served as a lieutenant in the military of the Rebel Alliance during the Galactic Civil War against the Galactic Empire. In 1 BBY, Planchet was given a secret, undercover mission to the planet Malastare. Due to the nature of his assignment, Planchet had no direct communication to his allies and was completely cut off from them.\nAt some point during his mission, Planchet was captured by the Imperials and placed in a prison cell, managing at first to stay silent when questioned by the Empire's expert interrogators. However, after a prolonged duration of torture, Planchet eventually broke and divulged everything he knew about the Alliance in a plea to end the torture. After obtaining all his secrets, the Imperials executed him with a blaster shot.\nIn 0 ABY, a few months after the Battle of Yavin, Planchet was already dead when the Imperial assassin X-7 went to the Rebel base on Yavin 4, one of three habitable moons orbiting the gas giant Yavin, while on a mission to kill the pilot who destroyed the first Death Star superweapon. Under the alias S'ree Bonard, he used a thumbprint and an Alliance landing code extracted from Planchet during his torture to get past a Rebel guard. X-7 convinced the guard that Planchet had recruited him while he was undercover on Malastare, and ordered him to deliver data plans straight to Alliance General Jan Dodonna about a new Imperial ship.\nJez Planchet was a skilled individual proficient in undercover missions. He was trusted enough by his superiors to go on a deep undercover mission to Malastare for a long period without reporting back.\nJez Planchet was mentioned in Alex Wheeler's 2008 novel Rebel Force: Target, the first installment in the Star Wars: Rebel Force series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/1_BBY/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Military/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Death/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Mission_to_Malastare_(Galactic_Civil_War)",
  "/wiki/Prison/Legends",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/X-7",
  "/wiki/Great_Temple/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Unidentified_Rebel_Guard_(Yavin_4)",
  "/wiki/General/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Alex_Wheeler",
  "/wiki/2008",
  "/wiki/Rebel_Force:_Target",
  "/wiki/Star_Wars:_Rebel_Force",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Galactic_Standard_Calendar"
 ]
}