{
 "name": "Jez_(Human)",
 "display_name": "Jez  (Human)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jez was a Human male from the planet Alderaan. The day before Alderaan's destruction in 0 BBY by the Galactic Empire's first Death Star, Jez went to Delaya, the sister planet of Alderaan, with his brothers, Mazi and Lan, to watch a smashball tournament. Following his homeworld's destruction, Jez and his siblings became thieves to survive on Delaya despite receiving odd jobs from Ferus Olin, a former Jedi. They attempted to rob Princess Leia Organa during her visit to Delaya but were thwarted by Olin, who then threatened to stop giving them work if they continued thieving. The three orphans later decided to join the Rebel Alliance as soldiers and yearned to tell the smuggler Han Solo of the news.\nJez was a Human male native to the planet Alderaan who lived during the time of the Galactic Civil War. In 0 BBY, the day before Alderaan's destruction by the Galactic Empire's first Death Star battlestation, Jez went to see a smashball tournament on Delaya, his homeworld's sister planet, with his brothers, Lan and Mazi. Despite their parents feeling they were too young to do so, Mazi was able to persuade them, especially their mother who worried a lot, to let the brothers stay overnight on Delaya by themselves.\nAfter Alderaan's destruction, Jez and his brothers became orphans and were left to look after themselves, thieving on Delaya to survive. Ferus Olin, a former Jedi and another survivor of Alderaan, tried to dissuade them from turning to a life of crime by giving them various small jobs to earn credits. When Princess Leia Organa of Alderaan made a visit to Delaya to assist the refugee effort and recruit new members to the Rebel Alliance, Jez, along with Mazi and Lan, attempted to rob her. Han Solo, one of Organa's companions, tried to placate the orphans, but the standoff was broken when Olin disarmed Mazi, who was holding Organa at knifepoint with a vibroblade, by shooting the weapon away with his blaster. After Olin threatened that he would stop giving them errands if they continued getting into trouble, Jez and his brothers ran away.\nA memorial was held the following day for those who had perished during Alderaan's destruction. Jez and his siblings attended the event but could not get inside the memorial's chamber due to the large crowd. They were spotted by Solo, who quickly grabbed Mazi into a hold, prompting Jez and Lan to come to their brother's aid. Despite their fear, they stood their ground and demanded that Solo let Mazi go. Impressed by their brave front, Solo released Mazi and befriended the group, offering food and a chance to go inside the chamber. With their guard lowered, Jez and his siblings told Solo how they came to be orphans on Delaya.\nJez and his brothers would later speak with a Rebel recruiter and decided to join the Alliance as soldiers. Having grown fond of Solo, they eagerly told him the news, hoping to impress him. Solo admitted he was surprised, although he felt Jez and his siblings were too young to serve in the Alliance. The smuggler wished them luck, as they were scheduled to be shipped out that night.\nJez proved to be brave and loyal despite his young age. As a result of Alderaan's destruction, Jez and his brothers became orphans overnight and had to look out for each other. Jez's brother Mazi implemented a rule about speaking in the past tense, to affirm that they were from nowhere and to move on from the tragedy. However, Jez disagreed with the arrangement and complained to his brother about it. When Solo did not turn them in to the authorities for trying to rob Organa, the orphans began yearning to impress the smuggler.\nWhen Solo confronted Jez and his brothers on Delaya, Jez refused to leave Mazi, who had been caught in the smuggler's grasp. Solo observed that the boys were terrified of him and putting on a brave front, which earned his grudging admiration. Jez had the quickest temper among the three orphans. When Lan, the youngest of them, teased Jez about not having any respect for him, the older boy was willing to punch him. By the time of his visit to Delaya, Solo surmised that the brothers appeared no more than fifteen years of age.\nJez was a character created by author Alex Wheeler for the 2008 novel Rebel Force: Hostage, the second volume in the Star Wars: Rebel Force series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Jez",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Alderaanian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_day",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/0_BBY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Delaya/Legends",
  "/wiki/Mazi",
  "/wiki/Lan_(Human)",
  "/wiki/Smashball/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Jedi/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Mission_to_Delaya",
  "/wiki/Soldier/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battlestation",
  "/wiki/Parent/Legends",
  "/wiki/Lan%27s_mother",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Knife/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Weapon/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Memorial_service_on_Delaya",
  "/wiki/Unidentified_chamber_(Delaya)",
  "/wiki/Foodstuff/Legends",
  "/wiki/Local_day/Legends",
  "/wiki/Standard_year",
  "/wiki/Alex_Wheeler",
  "/wiki/2008",
  "/wiki/Rebel_Force:_Hostage",
  "/wiki/Star_Wars:_Rebel_Force",
  "/wiki/The_New_Essential_Chronology"
 ]
}