{
 "name": "Jezra%27lin",
 "display_name": "Jezra'lin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Non-binary"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Path of the Open Hand"
     ]
    }
   ]
  }
 ],
 "content": "Jezra'lin was a non-binary Mon Calamari member of the missionary order Path of the Open Hand on the planet Dalna. They had an older sibling who was Force-sensitive and had an unfulfilled hope that they would also be sensitive to the Force. Jezra'lin was one of the Littles, the younglings of the Path, who was supervised by the Evereni Marda Ro. When the time came for the Kessarine Ferize and her partners, Er Dal and Fel Ix, to hatch their five eggs, the Mon Calamari child asked and received Ro's permission to check on the hatching of what would be considered siblings to family comprised of the Path. Ro tasked Jezra'lin with notifying the Elders that the hatching had begun. When the child returned, they were handed one of the babies by Ro's cousin, Yana Ro.\nJezra'lin was excitable and often bounced on their toes. They would hop several steps to keep up with each one of Marda Ro's and talk at length about no particular subject, which Ro found endearing; she thought the Mon Calamari was like a happy little bird.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Path_of_the_Open_Hand",
  "/wiki/Planet",
  "/wiki/Dalna",
  "/wiki/Jezra%27lin%27s_older_sibling",
  "/wiki/Force-sensitive",
  "/wiki/The_Force",
  "/wiki/Youngling",
  "/wiki/Evereni",
  "/wiki/Marda_Ro",
  "/wiki/Kessarine",
  "/wiki/Ferize",
  "/wiki/Reproduction",
  "/wiki/Er_Dal",
  "/wiki/Egg",
  "/wiki/Ro_family",
  "/wiki/Yana_Ro",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jezra%27lin",
  "/wiki/The_High_Republic:_Path_of_Deceit"
 ]
}