{
 "name": "Jezzable",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Celanon"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Between 22 BBY and 17 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": null
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Did not understand the meaning of loyalty"
     ]
    }
   ]
  }
 ],
 "content": "Jezzable was a strikingly beautiful Human female who was often seen touring the bars in Celanon City on Celanon. She spent a good deal of time flirting with spacers, much to the chagrin of her jealous boyfriend, Brooser, who was known to start physical altercations with others due to Jezzable's provocations.\nBorn in the final decades of the Old Republic on the planet Celanon, Jezzable was a twenty-seven-year-old Human female during the early years of the New Republic. With long flowing red hair and green eyes, and possessing a flawless complexion with a captivating silhouette, Jezzable was an alluring figure as she flirted with spacers visiting the various bars in Celanon City. Jezzable's physical attributes, coupled with her provocative demeanor toward the opposite sex, greatly distressed her jealous boyfriend, Brooser.\nOne afternoon, Jezzable was patronizing Gularg's Libation Emporium when a pair of smugglers entered the establishment. Not long after, she had a drink delivered to one of the smugglers. When he inquired as to whom had sent the beverage, Gularg, the bar's owner, pointed to Jezzable. Within a few minutes, she had joined the smuggler's table and pleasantly chatted with him until Brooser noticed and became physically violent. Additional bar occupants became involved in the fray until blaster weapons were drawn. At that point, Gularg—who did not condone the use of blasters in his bar—disarmed the opponents and ended the altercation.\nJezzable was a gorgeous woman who loved, and excelled at, flirting with members of the opposite sex, caring little as to how her actions affected her boyfriend—she did not understand the meaning of loyalty. Rather, she adored having males of all species fight over her. Jezzable was considered naive by most individuals; however, she possessed a good deal of common sense and was adept at talking or bargaining her way through most situations. Jezzable was also experienced with firearms, and the items she most often carried on her person included a makeup bag, clutch purse, and hold-out blaster.\nJezzable first appeared in The Right Place ..., one of the five adventure scenarios written for The Politics of Contraband, a 1992 West End Games supplement for Star Wars: The Roleplaying Game. Her scenario and character were also reprinted in Classic Adventures, published in 1995. Jezzable later received an entry in 2008's The Complete Star Wars Encyclopedia.\nAlthough Jezzable is a character that appears in The Right Place ... and can be interacted with to a limited degree, it is the Gamemaster's discretion as to whether the player will participate in the mini-scenario, Flirtatious advance, in which Jezzable has the drink delivered to the player. If it is decided that the scenario will be used, then the scenario Punched out!, involving Brooser, will automatically follow, as this is the conclusion to Flirtatious advance.\nJezzable's character template type is listed as \"Floozie\" in The Politics of Contraband, which is not one of the standard templates found in The Roleplaying Game. Neither was the template present in Heroes \u0026 Rogues, a West End Games character creation and template supplement. However, as it is possible for a player to create a new template for their own individual characters, \"Floozie\" may be used as an example template in generating a unique template or character.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Celanon/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/17_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Celanon_City",
  "/wiki/Time/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Brooser",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Gularg%27s_Libation_Emporium",
  "/wiki/Smuggler/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Gularg",
  "/wiki/Standard_minute/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Species/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/The_Right_Place_...",
  "/wiki/The_Politics_of_Contraband",
  "/wiki/1992",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Classic_Adventures",
  "/wiki/1995",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Heir_to_the_Empire",
  "/wiki/Star_Wars:_The_Roleplaying_Game_(first_edition)",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition,_Revised_and_Expanded"
 ]
}