{
 "name": "Jhara",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 13 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Jhara was a Force-sensitive female Human who lived on the planet Dalicron-4 the during the reign of the Galactic Empire. In 3 ABY, Jhara escorted a group of Rebel Alliance agents to the farm of her grandfather, the Jedi Gel, after he requested that the Alliance take custody of the prophesied \"Child of Light\" Caeleb. On arrival, Jhara and the Rebels found Gel to be critically injured following torture by the Dark Jedi Tol Skaros, who also sought Caeleb. Jhara was subsequently wounded by Skaros and she was flown off-world by the Rebels to the Mon Calamari cruiser Home One for medical treatment.\nJhara was a female Human born in around 13 BBY who lived on the planet Dalicron-4 in the Outer Rim Territories during the reign of the Galactic Empire. The granddaughter of the failed Jedi Gel, Jhara was sensitive to the Force though not a Force user. She lived at her grandfather's farm and on occasion Gel mentioned to her the location of a spot sited nearby that was devoid of the Force, though she never visited the place in person.\nIn 3 ABY, Gel became concerned for the safety of Caeleb, the prophesied \"Child of Light,\" a boy strong in the Force whom the Jedi watched over. Gel sent a message to the Rebel Alliance resistance movement to request that the Rebel Jedi Luke Skywalker take the child into the Alliance's custody. At Gel's behest, Jhara traveled to the village Dalia to await Skywalker's coming, with instructions to escort the Jedi to Gel's farm. Unavailable for travel to Dalicron-4, Skywalker sent a group of Rebel agents to Dalia in his stead and the Rebels soon endeared themselves to the local residents by rescuing the missing boy Zanner. Jhara heard word of the Rebels' and made contact with them at the house of the Ithorian doctor Aloor. She became nervous upon learning that Skywalker was not among the Rebel team but the group convinced her of their sincerity and she acquired some cracian thumper mounts from the Rodian Meebo for her and the agents to use for the journey to Gel's farm.\nJhara led the Rebels into some woods on the far side of Dalia's landing field on a six hour journey through the forest to Gel's home. During the journey, Jhara adjusted the speed at which she traveled to suit the riding ability of the Rebels. As the group progressed to the farm, the Dark Jedi Tol Skaros attacked and interrogated Gel, seeking information concerning Caeleb's location. The Whiphid threatened to feed Gel to the Dark Jedi's nek battle dogs if he not comply and left Gel's body shattered and fatally wounded. When Jhara and the Rebels came within sight of their destination, roughly one kilometer from the farm, Jhara sensed something to be amiss and hurried her pace. She burst into the farm and was at Gel's side as the wounded Jedi told her of Skaros' attack and with his last breaths urged the Rebels to go to the spot devoid of the Force and save Caeleb from the Whiphid. Jhara sobbed uncontrollably as her grandfather passed away from his injuries and once she regained her composure placed his body on a bed, under some covers.\nAfter a gathering a blaster carbine left over from Gel's service during the Clone Wars, Jhara mounted up and led the Rebels on a three hour journey to Caeleb's location. Arriving amid an assault by Skaros and the Whiphid's nek battle dogs and Viper probe droids on the homestead where Caeleb lived with his parents, Jhara attempted to take down the Dark Jedi. However, she was shot down by a blaster bolt between her shoulders and fell from her cracian thumper, suffering critical injuries. The Rebels defeated Skaros and returned to Dalia with Jhara and Caeleb so that she could receive treatment from Aloor. Jhara subsequently accompanied the Rebels and Caeleb away from Dalicron-4 on the agents' YT-1300 light freighter Lazy Katarn. She and Caeleb were flown to the Mon Calamari cruiser Home One and placed in the custody of Kylbar, an aide to the Rebel leader Admiral Gial Ackbar. Upon arrival, Jhara was escorted away to receive further medical attention and a spell in a bacta tank\nJhara had blue eyes and auburn hair. She was an experienced cracian thumper rider and was impatient with individuals who had poor riding skills. She deeply loved her grandfather Gel and his death greatly saddened her, leaving her determined to challenge Gel's killer, Tol Skaros.\nJhara was created by Lee Pickler and appeared in Child of Light, a 2000 roleplaying adventure set within Star Wars Legends continuity that was published by RPGA as the opening instalment of the Child of Light saga. She was also referenced in the second and third adventures of the saga, Soulsaber and Light and Dark, released in 2001 and 2002 respectively.\nIn Child of Light, the players roleplay as the Rebel agents that Jhara encounters on Dalicron-4. When Jhara and the Rebels arrive at Gel's farm, Jhara immediately bursts in to check on her grandfather and does not respond to any attempt by the player characters to deter her. After she is shot down during the battle against Skaros it is possible for the Rebels to provide medical aide to her to stabilize her condition. When the Rebel agents escort her back to Dalia it is possible for the player characters to leave her at the settlement or to take her with them when they depart Dalicron-4. It is also possible for Skaros' under-cover Dark Jedi master Thaum Rystra to offer her assistance if the player characters mention Jhara's condition to him. A recap of the events of Child of Light included in Soulsaber and Light and Dark states that the Rebels took Jhara with them and left her in the care of Kylbar, thus indicating that to be the official outcome.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/13_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dalicron-4",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Gel",
  "/wiki/Caeleb",
  "/wiki/Torture/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Tol_Skaros",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Home_One/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Dalia_(township)",
  "/wiki/Zanner",
  "/wiki/Doc_Aloor",
  "/wiki/Ithorian/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Aloor",
  "/wiki/Cracian_thumper",
  "/wiki/Rodian/Legends",
  "/wiki/Meebo",
  "/wiki/Forest/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Nek/Legends",
  "/wiki/Kilometer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Lazy_Katarn",
  "/wiki/Kylbar",
  "/wiki/Aide/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Lee_Pickler",
  "/wiki/Child_of_Light",
  "/wiki/2000",
  "/wiki/RPGA",
  "/wiki/Child_of_Light_saga",
  "/wiki/Soulsaber_(adventure)",
  "/wiki/Light_and_Dark_(adventure)",
  "/wiki/2001",
  "/wiki/2002",
  "/wiki/Thaum_Rystra",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Standard_Calendar"
 ]
}