{
 "name": "Jho",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ithor"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 1 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.99 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "90 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Translator collar"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Old Jho's Pit Stop",
      "Alliance to Restore the Republic",
      "Lothal resistance group",
      "Lothal resistance group"
     ]
    }
   ]
  }
 ],
 "content": "Jho, commonly known as \"Old Jho,\" was a male Ithorian who operated a cantina known as Old Jho's Pit Stop on the planet Lothal fifteen years after the founding of the Galactic Empire. The criminal Broken Horn Syndicate attempted to extort the barkeeper for protection money, sending an IG-RM bodyguard and enforcer droid to collect it.\nOn the fifteenth Empire Day, a trio of Imperial TIE fighter pilots entered Jho's cantina and forced him to play the Imperial broadcast, which was hijacked by the senator-in-exile Gall Trayvis in order to declare a boycott of Imperial rule. Jho opposed Imperial rule and occasionally provided the rebel crew of the starship Ghost with information. He also helped the rebel sympathizer Merei Spanjaf, her family, and the Leonis parents to escape offworld. In 1 BBY, Old Jho was executed for helping suspected rebels escape, and his bar was taken over by Baron Valen Rudor.\nThe Ithorian male known as \"Old\" Jho was born on the planet Ithor, but left his homeworld and settled on the planet Lothal at a time when the planet's Capital City was just a sleepy trading post. He remained on Lothal for many years, during which he witnessed Capital City transform into a busy center of administration for the Galactic Empire. On Lothal, Jho owned and operated a popular cantina known as Old Jho's Pit Stop and a docking bay, both located in a small, remote outpost/village which was known as Jhothal, which was named after him. The cantina was decorated with parts from a Low Altitude Assault Transport/infantry dating from the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, which Jho claimed was the authentic remains of the vessel known as the Crumb Bomber.\nOn one occasion, an IG-RM bodyguard and enforcer droid working for the criminal Broken Horn Syndicate entered the Pit Stop and demanded protection money from Jho; however, the Ithorian claimed that Cikatro Vizago, the droid's employer, owed him money, after which the droid slammed its arm down onto the bar. On Empire Day, in 4 BBY, the Pit Stop was visited by a trio of TIE fighter pilots who were searching for the Rodian Tseebo. The Imperials did not find their target amongst Jho's customers, which included a group of rebels whom they did not recognize. The pilots then demanded that Jho turn on the Imperial broadcast, which was required to be displayed by Imperial law, and the Ithorian complied; however, the broadcast was almost immediately hijacked by the senator-in-exile Gall Trayvis, who asked the citizens of Lothal to boycott Imperial rule and Empire Day celebrations. The Imperials demanded that the broadcast be switched off, but Jho refused, after which the pilots left. Jho then spoke with the rebels, explaining that there was a full Imperial blockade of Lothal.\nAt a later date, the rebels returned to Jho's, and Garazeb Orrelios, a Lasat member of the group, played a game of sabacc with two other clients, the \"galactic entrepreneur\" Lando Calrissian and the Rodian Tsoklo. While the three were playing, another member of the rebel group, Kanan Jarrus, asked Jho if he had any paying jobs, as the rebels desperately needed credits. The Ithorian had nothing to give them, but he told them Calrissian had been looking for a crew. Jarrus joined Orellios at the table, and Jho witnessed him betting the astromech droid Chopper and losing it to Calrissian. The rebels left the canteen with the entrepreneur.\nJho met Merei Spanjaf, the girlfriend of Zare Leonis, when she was working for the Gray Syndicate. He enjoyed watching pirated grav-ball holos that Spanjaf would deliver as part of her courier duties. Spanjaf later recalled Jho when she needed to get an elderly poet named Holshef, who was in hiding from the Galactic Empire, off the planet. Jho was at first reluctant to help, wondering why Spanjaf would want more trouble after she was finally free from the Gray Syndicate's influence following the death of its leader, Yahenna Laxo, in an Imperial assault. After reading some of Holshef's poetry, he understood why she would want to save him and agreed to lend his freight hauler to get him off the planet. When the Empire began closing in on both Spanjaf's family and the Leonises, the entire group was forced to flee off-planet to Garel. Jho transported the Spanjafs and Leonises to the edge of the Garel system, where they were picked up by several crew members of the Ghost, including Orellios.\nBy 2 BBY, Jho had joined a rebel cell led by the former Lothal Governor Ryder Azadi. Other cell members included Morad Sumar and his wife Marida, who had lost their farm to the Empire. Jho was spotted at Azadi's rebel encampment when Ezra Bridger, Jarrus, and Chopper arrived to discuss a mission to infiltrate Capital City's Imperial Armory Complex in order to steal top secret Imperial plans for a prototype starfighter. When Jarrus, Bridger and Chopper were escaping from the factory, Jho along with Marida and Azadi helped the trio escape in landspeeders. Later, Jho, along with other patrons including Azadi and Marida, witnessed a live hologram broadcast by the former Imperial Senator Mon Mothma at his bar urging the galaxy to rise up against the Empire.\nHowever, in 1 BBY, Jho was caught by the Imperials helping suspected rebels escape a raid carried out by the Imperial Security Bureau. For assisting the suspected rebels, he was executed. His bar was seized and given to the TIE pilot Baron Valen Rudor, who converted it into a place popular with Imperials.\nJho was an intelligent individual with brown skin, yellow eyes and no hair. By the time of his encounter with the IG-RM thug droid, the Ithorian's age had taken a toll on his reflexes and strength, which meant, despite his courage and willingness to fight, that Jho would have been unable to defeat the droid. During the encounter the bartender stood 1.99 meters tall and weighed 90 kilograms.\nJho was opposed to the rule of the Galactic Empire and ignored their mandate that the Imperial broadcast be played at all times, even arguing with the TIE pilots when they demanded he comply with the law. The Ithorian kept his ears open for information which could be useful to his customers or enemies of the Empire, and sometimes provided information to the rebel crew of the starship known as the Ghost, whom he was friendly with and allowed to dock at his cantina. In combat, Jho would prefer to draw his blaster under the table to attack an opponent.\nJho enjoyed watching pirated holos of grav-ball games. In his youth, he enjoyed visiting Pelamir Gorge and listening to the wind whipping through the spine trees and sipping root tea, before the Empire razed the forests. His sympathies for the rebellion and opposition to the Empire later led him to join Azadi's rebel cell.\nJho used a translator collar to speak Galactic Basic Standard instead of Ithorese so that customers would understand him. He used a hunting blaster in combat. He also owned a freighter with an \"iffy\" hyperdrive motivator, which was also modified with weaponry capable of blasting Imperial speeder bikes into wreckage.\nJho was created as a character for the Star Wars Rebels television series and was mentioned briefly for the first time in Star Wars Rebels: The Visual Guide, a reference book written by Adam Bray and released in 2014 as part of the build-up to show's release later that year. More details and an image of the character were then provided in Star Wars Rebels: Head to Head, another  Rebels tie-in book written by Pablo Hidalgo and also released in 2014.\nThe Ithorian then made his first appearance on the show in \"Empire Day,\" the sixth episode of Star Wars Rebels Season One, in which Jho was voiced by Dee Bradley Baker. The character also appeared in an early draft of the first season's eighth episode, \"Path of the Jedi,\" in which he was involved in Jedi-in-training Ezra Bridger's search for a kyber crystal. Ultimately he was cut from the story when the episode was streamlined to focus on the events within the Lothal Jedi Temple.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Joe_(disambiguation)",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal",
  "/wiki/Ithor",
  "/wiki/1_BBY",
  "/wiki/Ithorian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Translator_collar",
  "/wiki/Old_Jho%27s_Pit_Stop",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Lothal_resistance_group",
  "/wiki/Cantina",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Broken_Horn_Syndicate",
  "/wiki/Bartender",
  "/wiki/Currency",
  "/wiki/IG-RM_bodyguard_and_enforcer_droid",
  "/wiki/Empire_Day",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Senator",
  "/wiki/Gall_Trayvis",
  "/wiki/Spectres",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Merei_Spanjaf",
  "/wiki/Spanjaf_family",
  "/wiki/Leonis_family",
  "/wiki/Raid_on_a_suspected_rebel_cell",
  "/wiki/Baron_of_the_Empire",
  "/wiki/Valen_Rudor",
  "/wiki/Reproduction",
  "/wiki/Homeworld",
  "/wiki/Time",
  "/wiki/Capital_City",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Hangar",
  "/wiki/Jhothal",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Crumb_Bomber",
  "/wiki/Cikatro_Vizago",
  "/wiki/Unidentified_IG-RM_bodyguard_and_enforcer_droid",
  "/wiki/Droid",
  "/wiki/4_BBY",
  "/wiki/Rodian",
  "/wiki/Tseebo",
  "/wiki/Pilot",
  "/wiki/Blockade",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Lasat",
  "/wiki/Sabacc",
  "/wiki/The_galaxy",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Tsoklo",
  "/wiki/Kanan_Jarrus",
  "/wiki/Credit",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Zare_Leonis",
  "/wiki/Gray_Syndicate",
  "/wiki/Pirate",
  "/wiki/Grav-ball",
  "/wiki/Hologram",
  "/wiki/Poet",
  "/wiki/Holshef",
  "/wiki/Death",
  "/wiki/Yahenna_Laxo",
  "/wiki/Assault_on_the_Gray_Syndicate",
  "/wiki/Jho%27s_freight_hauler",
  "/wiki/Garel",
  "/wiki/Transport",
  "/wiki/Garel_system",
  "/wiki/2_BBY",
  "/wiki/Governor",
  "/wiki/Ryder_Azadi",
  "/wiki/Morad_Sumar",
  "/wiki/Marriage",
  "/wiki/Marida_Sumar",
  "/wiki/Morad_Sumar%27s_farm",
  "/wiki/Ryder%27s_camp",
  "/wiki/Ezra_Bridger",
  "/wiki/Infiltration_of_the_Imperial_Armory_Complex",
  "/wiki/Imperial_Armory_Complex",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Starfighter",
  "/wiki/Factory",
  "/wiki/Landspeeder",
  "/wiki/Mon_Mothma",
  "/wiki/Galaxy",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Imperial_Era",
  "/wiki/Ear",
  "/wiki/Blaster",
  "/wiki/Pelamir_Gorge",
  "/wiki/Spine_tree",
  "/wiki/Root_tea",
  "/wiki/Forest",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Ithorese",
  "/wiki/Hunting_blaster",
  "/wiki/Freighter",
  "/wiki/Hyperdrive_motivator",
  "/wiki/Speeder_bike",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Adam_Bray",
  "/wiki/2014",
  "/wiki/Star_Wars_Rebels:_Head_to_Head",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Empire_Day_(episode)",
  "/wiki/Star_Wars_Rebels_Season_One",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Path_of_the_Jedi",
  "/wiki/Jedi",
  "/wiki/Kyber_crystal",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Category:Images_of_Jho",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/Path_of_the_Jedi:_A_Star_Wars_Rebels_Cinestory_Comic",
  "/wiki/Ezra%27s_Duel_with_Danger",
  "/wiki/Idiot%27s_Array_(episode)",
  "/wiki/Servants_of_the_Empire:_Imperial_Justice",
  "/wiki/Servants_of_the_Empire:_The_Secret_Academy",
  "/wiki/Star_Wars_Rebels:_Recon_Missions",
  "/wiki/Star_Wars_Insider",
  "/wiki/Rebel_Bluff",
  "/wiki/Star_Wars_Insider_158",
  "/wiki/An_Inside_Man",
  "/wiki/Secret_Cargo",
  "/wiki/The_Occupation",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Rebels:_Visual_Guide:_Epic_Battles",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_37",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Databank_(website)"
 ]
}