{
 "name": "Jhoram Bey",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Alliance Remnant",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Jhoram Bey was a male Weequay who served the Galactic Alliance Remnant as Rogue Leader and later captain of the Alliance during the Second Imperial Civil War. Bey served under Admiral Gar Stazi on his flagship, the Indomitable, around 137 ABY, commanding the prestigious Rogue Squadron. He took part in the Alliance's continual raids and harassment against Darth Krayt's Sith Empire, becoming one of Stazi's most trusted officers.\nIn 137 ABY, Jhoram Bey led Rogue Squadron in an attack on the Mon Calamari Shipyards with the intention of stealing an Imperial Advanced Star Destroyer, the Imperious. Imperial forces were waiting for them, and in the Battle of Mon Calamari, Bey lost several of his pilots to Imperial Predator-class fighters. When the Indomitable received heavy damage, Bey left his squadron to rescue Admiral Stazi, though the Duros refused to accompany him. Feeling he had no other option, Bey knocked Stazi unconscious and forcibly took him away, moments before the Indomitable collided with the shipyards. To punish Bey for striking a superior officer, Stazi promoted him to the late Jaius Yorub's position as the admiral's right-hand-man and captain of the Imperious, which had been rechristened the Alliance. Bey was aboard the Star Destroyer during Stazi's attack on Ralltiir. Stazi had intended to capture many of the ships intact for his own use, but in the end had to settle with the near destruction of the Coruscant Third Fleet.\nA gruff Weequay male, Jhoram Bey joined the Galactic Alliance Remnant at some point in his life, becoming a pilot in the prestigious Rogue Squadron. By the time of the Second Imperial Civil War between 130 ABY and 137 ABY, Bey served under Admiral Gar Stazi, eventually being promoted to Commander and Rogue Leader. A strict taskmaster and shrewd pilot, Bey flew a CF9 Crossfire starfighter during Stazi's continued hit-and-run attacks on the fleets of Dark Lord of the Sith Darth Krayt, to great success. Bey was one the highest ranked of the Alliance personnel, and reported directly to Stazi. The Galactic Alliance Remnant was running out of supplies, though, and knowing they would be hard pressed to continue their harassment of Krayt's forces, they set their eyes on the secret Advanced Star Destroyer Imperious, which was under construction at the Mon Calamari Shipyards.\nThe Alliance fleet gathered near Mon Calamari, ready to attack the planet's shipyards. While they waited to pounce, Bey had to break up a fight between several members of his squadron—Andurgo, a troublesome Dug pilot, and the newest recruit, a former Imperial stormtrooper named Hondo Karr—though he was able to threaten them enough to stop. Eventually, the fleet prepared for hyperspace and launched their attack on the shipyards.\nThings did not go as planned, however. Admiral Dru Valan was prepared for the attack and a full Imperial fleet arrived to defend the Imperious. Stazi went forward with his plan regardless of the new development, and Bey and his squadron were deployed in their fighters to fend off the Imperial Predator-class fighters. They were tasked with ensuring that the fighters were unable to cause Stazi and his flagship, the Indomitable, any harm; although there were many more Predator-class fighters than Rogues, Bey and his pilots were flying sturdier ships that could take more hits. The Rogues were mostly successful against the Imperials, though Andurgo's constant showboating left Ronto alone against two fighters; the Dug had been too occupied attempting to score kills that he did not notice Ronto's difficulties in dealing with the Sith fighters. Though Bey was able to down Ronto's attackers, the Klatooinian's vessel was badly damaged and he was forced to bail out in his escape pod, which moved towards Mon Calamari's surface. However, while the Rogues incurred few losses, the rest of the Alliance fleet was not so lucky, and when he received no reply from the Indomitable after attempting to contact them with his comlink, Bey decided to investigate himself.\nBey ordered the rest of his squadron to continue their dogfight while he left for the Indomitable, eventually docking in an area that had been opened to space. The Indomitable was in bits, and most of the crew had abandoned ship, but Bey found Stazi and his right-hand-man, the Sullustan Jaius Yorub, on the bridge. He told Stazi to return to his fighter with him, but the admiral refused; the Indomitable was on a collision course with the shipyards, and Stazi wished to stay with his ship until the end. This caused Yorub and Bey considerable distress, and after the Sullustan himself failed to convince Stazi, Yorub implied that Bey \"do his duty\" and forcefully take Stazi with him.\nThe Weequay commander obliged, punching Stazi in the face, rendering him unconscious; Bey bade goodbye to Yorub, who was going to ensure the Indomitable did as much damage as possible to the shipyards, and, with Stazi slung over his shoulder, Bey returned to his fighter. En route, he ordered Rogue Squadron to flee and return to the rest of the fleet while he exited the ship. Bey got out just in time as the Indomitable exploded into the shipyards, killing Yorub. The Weequay was able to link up with the rest of the Alliance Fleet—who had managed to capture the Imperious and escape—at the Alliance rendezvous point. The Alliance Remnant had incurred few losses in what turned out to be a successful mission.\nWhen Stazi regained consciousness, Bey filled him in on what had happened while he was unconscious; overall, the Alliance had lost several pilots, and half the Indomitable's crew had been killed, though the Imperious was almost ready for use. Bey hoped that the Mon Calamari on the surface would shelter those who had bailed out in escape pods, particularly because one of his pilots, Ronto, was among the fifty. Stazi did mention Bey's disobeying of his order initially, though he eventually told Bey that, even if it was for the greater good, it could not go unpunished; he promoted him to Yorub's vacant position as his right-hand-man as punishment. Stazi wished to get the fleet, particularly the Imperious, ready to fight again, despite Bey's objections that they should attempt to find and help the injured first; Stazi knew the Sith would strike back, and wanted to be prepared.\nKrayt's retribution was swift; just days later, he had his minions execute the Calamarian Council live on the HoloNet for their perceived part in Stazi's raid. Bey and the other Alliance personnel watched in horror as the Mon Calamari were struck down by Darth Azard and his underlings. The Weequay commander wanted to act, and told Stazi that they should return to Mon Calamari to fight the Sith. Stazi, however, knew of the fleet's capabilities, and with the Imperious's weapons systems still offline, he preached caution.\nEventually, an Alliance member, Monia Gahan, arrived on the Imperious with an Imperial Knight named Sigel Dare and several other Alliance pilots, who had been stranded on Mon Calamari's surface; among them was Ronto. The Fel Empire was officially at war with the Alliance, though Emperor Roan Fel and Admiral Gar Stazi both knew their real enemy was Krayt and his Sith. Sigel Dare had come to warn Stazi that the Imperials had planted hidden bombs on the Imperious before they knew of the Alliance's planned raid; Dare showed Stazi the location of the explosives and they were able to disarm them. Impressed at Roan Fel's actions in warning him, Stazi announced a possible allegiance between his own fleet and that of the Empire-in-exile, something that Jhoram Bey supported greatly. As an homage to the newly formed alliance, Stazi rechristened his recently acquired Advanced Star Destroyer the Alliance, of which Bey became the captain. Anj Dahl replaced him as Rogue Leader.\nStazi and Fel—the Galactic Alliance and the Empire-in-exile—became allies, though neither party trusted the other entirely, and Fel did not see Stazi as his equal. In the time that Krayt's retribution on the Mon Calamari, Stazi attempted to recruit as many planets and systems as he could to his cause; some heeded Krayt's violent warning, and refused, but others offered their tacit support, surreptitiously supplying Stazi's fleet with ships from their own planetary fleets. With these extra forces, and with Fel's Imperial backing, Stazi decided to launch an unexpected attack on the Imperial world of Ralltiir, an extremely well-guarded financial center. Stazi had no intention of actually taking Ralltiir; rather, he wanted the Sith ships in orbit over the planet. Stazi reckoned that if the attack was successful, half the Imperial crews would surrender and hand over their vessels, further bolstering the Galactic Alliance fleet. Although the combined forces of Stazi's fleet and the forces sent by Fel were still inferior to the Sith protection around Ralltiir, Stazi hoped that the element of surprise would help him emerge victorious.\nStazi's forces, including himself Bey aboard the Alliance, arrived at Ralltiir via hyperspace, with Fel's complement of vessels due to arrive shortly afterward. As expected, the arrival of the Galactic Alliance Fleet caught the Sith off guard; Stazi's capital ships targeted the engines of the unshielded Sith Star Destroyers, while starfighter squadrons from either side engaged each other in orbit, while members of Rogue Squadron destroyed shield generators on the planet's surface. However, the Sith quickly recuperated, activating their shields and returning fire. Bey informed Stazi of this development, but the Duro was unfazed, as he didn't want the ships to take too much damage anyway. Bey had some qualms about the plan, feeling it was too risky for the potential gain and that Stazi should be using his resources to help free the Mon Calamari.\nFel's forces, consisting of the Bastion Second Fleet led by Admiral Edouard Fenel, eventually arrived, later than agreed. Stazi was angered by this, but Fenel explained that the Imperials wanted to be sure Stazi had committed to the attack before committing themselves. Fenel was arrogant and rude towards Stazi, who was sure that his selection was a tactical decision made by Fel, to test the Duro admiral. Fenel contacted the commanding officer of the Sith fleet at Ralltiir, Admiral Peto Kelsan; Kelsan patched him through the rest of the Sith fleet, whom Fenel ordered to stand down and surrender, or die. He advocated that, if any crewmember's superior officers refused to comply, they should take matters into their own hands and mutiny.\nThe Sith crews obeyed, but one captain, Vaclen Tor of the Steadfast, refused, telling Kelsan and Fenel that he would instead scuttle his ship and allow his crew to escape in life-pods. Fenel's ships began firing at the Steadfast, but Tor was able to maneuver his ship so that one of Ralltiir moon's shielded him from Fenel's forces. Fenel admonished Kelsan for not ordering his own ships to fire, which prompted a change of heart in the Sith admiral; he told the ships under his command to disregard his previous order, and instead follow Tor's example and self-destruct their ships. Fenel responded that he would fire upon any life-pods he saw.\nBey and Stazi were livid with Fenel and horrified at the threat, and the Duro refused to obey when Fenel ordered him to fire upon any visible life-pods. Instead, Stazi positioned his fleet between the two Imperials' fleets, telling Bey that, at the first shot fired by the Galactic Alliance's new allies, he was to order the GA forces to obliterate Fenel's forces. Bey was also tasked with sending a message to Roan Fel on Bastion about Fenel's conduct, with a threat to dissolve the pact if he carried out on his threats. Meanwhile, Stazi had Rogue Squadron provide cover for the Steadfast and allow Tor to carry out his evacuation.\nThe Imperials left their ships via life-pods and initiated the self-destruct; Fenel did not fire a shot. However, Captain Tor contacted the Rogues to inform them that, due to the last salvo of fire taken by the Steadfast, his ship's life-pod and self-destruct functions were offline. Fenel decided to take things into his own hands and sent a complement of Predator-class fighters toward the Steadfast, intent on destroying it. Stazi stepped in, shielded the Steadfast with his fleet and targeting the Predators. Almost immediately, Fenel ordered a retreat and left Ralltiir. The mission was not entirely successful, as Stazi had gained no new ships, but he and the Imperials had dealt a real blow to the Sith. Stazi contacted Fel on Bastion; when he was finished, the Duro told Bey that, for the time being, he and the Emperor-in-exile were allies, if not exactly friends.\nJhoram Bey was a brusque commander, and he punished his pilots severely when they showed indiscipline. When he walked in on Andurgo and Hondo Karr's brawl—which was being egged on by many of the other Rogues—Bey fired his blaster between the two pilots, narrowly missing them. He threatened to ground, demote, or even shoot the culprits, though in truth he cared greatly about his pilots' well being; when he heard of Krayt's massacre of the Mon Calamari, his immediate thoughts went to the Rogues stranded on the surface.\nBey was extremely loyal and dedicated to the Galactic Alliance Remnant, and Gar Stazi personally. Bey knew that Stazi was an idol among the Alliance supporters, and disagreed with the admiral that he was just one man. The Weequay was willing to violate a direct order from Stazi and punch him, because he knew that it was ultimately for the best. Bey preferred to be fighting on the front lines, and although he accepted Stazi's offer of promotion to a naval position, he was initially less than enthusiastic. He trusted the Jedi, saying he'd had past dealings with them.\nJhoram Bey was created by John Ostrander for the Star Wars: Legacy comic series, appearing in the Indomitable and The Wrath of the Dragon story arcs, where he was illustrated by Omar Francia and Alan Robinson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Bey_(disambiguation)",
  "/wiki/Legacy_(2006)_41",
  "/wiki/Legacy_(2006)_42",
  "/wiki/Weequay/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Alliance_(Imperious-class)",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Flagship/Legends",
  "/wiki/Indomitable_(Scythe-class)",
  "/wiki/137_ABY",
  "/wiki/Darth_Krayt",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Mon_Calamari_Shipyards/Legends",
  "/wiki/Imperious-class_Star_Destroyer",
  "/wiki/Battle_of_Mon_Calamari_(Second_Imperial_Civil_War)",
  "/wiki/Pilot/Legends",
  "/wiki/Predator-class_fighter",
  "/wiki/Squadron/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Jaius_Yorub",
  "/wiki/Battle_of_Ralltiir_(Second_Imperial_Civil_War)",
  "/wiki/Ralltiir/Legends",
  "/wiki/Coruscant_Third_Fleet",
  "/wiki/130_ABY",
  "/wiki/Commander/Legends",
  "/wiki/CF9_Crossfire_starfighter",
  "/wiki/Fleet/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Dac",
  "/wiki/Planet/Legends",
  "/wiki/Andurgo",
  "/wiki/Dug/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Hondo_Karr",
  "/wiki/Hyperspace/Legends",
  "/wiki/Anj_Dahl",
  "/wiki/Dru_Valan",
  "/wiki/Starfighter/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Ronto_(Klatooinian)",
  "/wiki/Klatooinian/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Mon_Calamari_Council",
  "/wiki/HoloNet/Legends",
  "/wiki/Darth_Azard",
  "/wiki/Monia_Gahan",
  "/wiki/Imperial_Knight",
  "/wiki/Sigel_Dare",
  "/wiki/Fel_Empire",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Empire-in-exile",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Bastion_Second_Fleet",
  "/wiki/Edouard_Fenel",
  "/wiki/Peto_Kelsan",
  "/wiki/Vaclen_Tor",
  "/wiki/Steadfast_(Ardent-class)",
  "/wiki/Blaster/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars:_Legacy:_Indomitable",
  "/wiki/Legacy_(2006)_22",
  "/wiki/Omar_Francia",
  "/wiki/Alan_Robinson",
  "/wiki/Legacy_(2006)_20",
  "/wiki/Legacy_(2006)_21",
  "/wiki/Legacy_(2006)_36",
  "/wiki/Legacy_(2006)_47",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Legacy%E2%80%94War_5",
  "/wiki/Legacy%E2%80%94War_6",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/18_ABY/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Gavin_Darklighter",
  "/wiki/28_ABY/Legends",
  "/wiki/Corran_Horn",
  "/wiki/29_ABY/Legends",
  "/wiki/36_ABY",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/40_ABY",
  "/wiki/Lensi",
  "/wiki/Legacy_of_the_Force:_Fury"
 ]
}