{
 "name": "Jiak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Jiak was a male Human Moff of the Sith Empire living during the Galactic War. Stationed above the Harrower-class dreadnought Ziost Shadow, he recruited a strike team to travel to Zadd and put an end to the Directive 7.\nRenegade droids under the collective consciousness of the self-aware artificial intelligence Mentor were due to initiate Directive 7, a movement that entails the annihilation of all organics. Greatly alarmed by this, Moff Jiak of the reconstituted Sith Empire sought assistance in putting down this uprising. Through the Imperial battle droid K-4NV, Jiak contacted an Empire-aligned hero on Corellia to travel to the Imperial Fleet in Sith Space to receive further briefing in person.\nAboard the Harrower-class dreadnought Ziost Shadow, Jiak sent the Imperial strike force he contacted to Zadd, where the final preparations for the launch of Directive 7 were being made by the Mentor's droid forces.\nUltimately, a Sith Empire victory was secured with the destruction of Mentor, and Moff Jiak expressed gratitude and relief to the Imperial strike force.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Moff/Legends",
  "/wiki/Galactic_War",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Ziost_Shadow",
  "/wiki/Zadd",
  "/wiki/Directive_7",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jiak",
  "/wiki/Mentor",
  "/wiki/Battle_droid/Legends",
  "/wiki/K-4NV",
  "/wiki/Corellia/Legends",
  "/wiki/Vaiken_Spacedock",
  "/wiki/Sith_Worlds",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}