{
 "name": "Jian Paret",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "N'zoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireBlack Fleet",
      "Black Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Jian Paret was a Human male Imperial military officer who lived during the Galactic Civil War. In 4 ABY, eight months after the Battle of Endor, he was serving with Black Sword Command, in charge of the garrison at N'zoth.\nParet was the commander of the Imperial forces stationed at the Sixth Negative Regions located within the Deep Core.\nAfter the battle of Endor, Paret served as the commanding officer within the Sixth Negative Regions.\nAt this time, Paret was the ranking officer at N'zoth, and it was he, and not Governor Crollick, who was ordered to supervise the evacuation to the Deep Core. He was evidently the commander of the garrison's legion of stormtroopers, but inasmuch as the Imperial Navy guardship Harridan had been withdrawn three weeks earlier, it is not clear whether in normal circumstances he would have had authority over the Black Fifteen shipyard, or the Super Star Destroyer Intimidator, fitting out at the docks.\nCommander Paret's plans were foiled by a revolt among the native Yevetha, led by Nil Spaar. Seizing Intimidator and the shipyards, the Yevetha forced him to watch as they turned the big ship's guns on the shuttles carrying the twenty thousand Imperials of the garrison and the associated administrative cantonment. Nil Spaar then executed him in turn.\nThe size of the stormtrooper force in Paret's command is inferred from Davith Sconn's statement in Shield of Lies that half the Imperial presence on N'zoth itself consisted of the white-armored shock-troops.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/N%27zoth",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Black_Fleet",
  "/wiki/Nil_Spaar",
  "/wiki/Commander/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Sixth_Negative_Regions",
  "/wiki/Deep_Core/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Crollick",
  "/wiki/Legion/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Harridan_(starship)",
  "/wiki/Black_Fifteen",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Intimidator_(Executor-class)",
  "/wiki/Yevetha",
  "/wiki/Davith_Sconn",
  "/wiki/Shield_of_Lies",
  "/wiki/Before_the_Storm",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}