{
 "name": "Jib Dodger",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Unidentified X-wing squadron",
      "Unidentified X-wing squadron"
     ]
    }
   ]
  }
 ],
 "content": "Jib Dodger was a human male pilot in the service of the New Republic. He was one of three pilots sent to follow a tracker activated by Lant Davan, a crewmember aboard a New Republic prison transport, when a team of mercenaries boarded the ship to rescue the prisoner Qin.\nThe team betrayed one of their members, the bounty hunter known as the Mandalorian, but the Mandalorian escaped, managing to rescue Qin alone and return him to the space station where the mercenaries operated. The Mandalorian, however, had hidden the tracker on Qin, and the New Republic pilots followed it, opening fire on the station.\nJib Dodger was a pilot in the New Republic Starfighter Corps after the Battle of Endor. In 9 ABY, Dodger was assigned to a flight squadron alongside fellow starfighter pilots Sash Ketter and Trapper Wolf whose duties to the New Republic included responding to active Republic tracking beacons and tracking them down. One of these beacons was activated aboard a New Republic prison ship during an assault conducted by a crew of mercenaries attempting to rescue a Twi'lek prisoner named Qin. However, before the New Republic could dispatch a squadron to respond to the beacon a bounty hunter known as the \"The Mandalorian\" transported the beacon aboard his personal gunship, the Razor Crest and deposited it on a space station owned by a criminal named Ranzar Malk.\nPiloting T-65B X-wing starfighters, Dodger and his fighter squadron exited hyperspace at the sight of the criminal's station just as \"The Mandalorian\" left the system. As their X-wings passed the Razor Crest, Wolf confirmed that the tracking beacon was coming from the station, which Dodger reaffirmed. Closing in on the station, Wolf noted that the station's personnel were preparing to launch a gunship which Ranzar Malk had intended to destroy the Razor Crest. The trio of pilots took this launching as an act of aggression, and used it as a justification to attack the station. Launching into attack position, the X-wings opened fire with their laser cannons and destroyed the gunship within the station's hanger bay, proceeding to circle around and continue their attack on the exterior of the station.\nJib Dodger was a human male with black hair, brown eyes, and dark skin.\nDodger wore an orange and white flight suit and a white K-22995 light flight helmet with blue and yellow markings and two New Republic roundels.\nJib Dodger first appeared in Chapter 6 of the 2019 television series The Mandalorian, which aired on December 13, 2019, portrayed by Rick Famuyiwa, the episode's director.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/Unidentified_X-wing_squadron",
  "/wiki/New_Republic_pilot",
  "/wiki/Pilot",
  "/wiki/Homing_beacon",
  "/wiki/Lant_Davan",
  "/wiki/Prison",
  "/wiki/Transport",
  "/wiki/Mercenary",
  "/wiki/Starship",
  "/wiki/Prisoner",
  "/wiki/Qin",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Space_station",
  "/wiki/New_Republic_Starfighter_Corps",
  "/wiki/Battle_of_Endor",
  "/wiki/9_ABY",
  "/wiki/Squadron",
  "/wiki/Sash_Ketter",
  "/wiki/Trapper_Wolf",
  "/wiki/Prison_ship",
  "/wiki/Twi%27lek",
  "/wiki/Gunship",
  "/wiki/Razor_Crest",
  "/wiki/Ranzar_Malk",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Hyperspace",
  "/wiki/Laser_cannon",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Flight_suit",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Chapter_6:_The_Prisoner",
  "/wiki/2019",
  "/wiki/The_Mandalorian",
  "/wiki/December_13",
  "/wiki/Rick_Famuyiwa",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_Two",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}