{
 "name": "Jill Farseeker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Jill Farseeker was the granddaughter of Jackson Farseeker and daughter of Roark Garnet. During the Galactic Civil War, she crewed aboard her father's freighter, Dorion Discus, alongside Garnet, Farseeker, and Tantos Dree.\nJill Farseeker was the female child of Roark Garnet, a smuggler, and the daughter of Jackson Farseeker, a retired Imperial captain. Farseeker had little contact with her father, until she met him during the Galactic Civil War while with her grandfather. Garnet, captain of the freighter Dorion Discus, was transporting the pair off the planet Thorgeld I, along with the bounty hunter Tantos Dree when the Imperial Customs Frigate Assessor attempted to inspect the ship. Dree convinced Garnet that they had to avoid the Imperials since he could not be discovered by them. Jill proposed dropping Dree out of the airlock and tethering him to the ship with a rope so the inspection team would not find him, but the bounty hunter refused. Garnet began evasive maneuvers and Dree manned the ship's guns, while her grandfather calculated the data for a jump to hyperspace. The Dorion Discus and the Assessor traded fire, but the freighter managed to enter lightspeed and escape.\nFarseeker was a brave and clever young girl. When the freighter she was traveling aboard was called for inspection by Imperials, she did not become scared, but was instead thinking of possible ways to escape or at least trick them. She was also willing to support her father in attacking the Assessor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jackson_Farseeker",
  "/wiki/Roark_Garnet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Dorion_Discus",
  "/wiki/Tantos_Dree",
  "/wiki/Youngling/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Jackson_Farseeker%27s_daughter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Thorgeld_I",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Imperial_Customs_Frigate",
  "/wiki/Assessor_(Imperial_Customs_Frigate)",
  "/wiki/Starship/Legends",
  "/wiki/Airlock/Legends",
  "/wiki/Rope/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Lightspeed/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game_(first_edition)"
 ]
}