{
 "name": "Jiminaldo-mabbramsti",
 "display_name": "Jiminaldo-mabbramsti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Almas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Squib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Jiminaldo-mabbramsti  was a Squib scavenger who worked for another Squib, named Squeerie, on the planet Almas. One day while on site at the ruins of the Almas Academy, Jimi's team was accosted by three Ugors who claimed that a droid the Squibs had acquired actually belonged to them. During their scuffle, a band of outsiders approached. The offworlders managed to convince Jimi and his team to make peace with the Ugors and to sell the the droid to the uninvolved party. A pack of Dark Lizards attacked the whole group, and Jimi helped fight them off.\nAt some point, the Squib Jiminaldo-mabbramsti  was hired by another Squib named Squeerie as a scavenger and salvager on the planet Almas. By the time of Order 66, Jimi was the head of a salvage team in Squeerie's company.\nTwo years after the destruction of Almas Academy in the city of Forard, Jimi and four other blue-furred Squibs were sent by their boss to search through the debris. They found several potentially useful items there: a battered copy of the holobook Busteromuchmacho and the Vermillion Shadow , a non-functional lightsaber that had belonged to a Padawan named Dorv'Tilsta, and a box of eight glowrods. When they found a legless, silver protocol droid, they tried to reclaim it. However, Jimi and his team were beset by three Ugors, who claimed that they had found the droid first and that it was rightfully theres. Jimi and the head Ugor began a tugging match over the hapless automaton when a group of strangers appeared. The Ugor leader, SprlMuck, asked them to intervene.\nSprlMuck explained that he and his partners had found the droid in the ruins and brought it outside to its present position. He claimed that when the Ugors noticed the outsiders' ship touching down, they left momentarily to investigate. Jimi protested that there was no sign of the Ugors when his Squib team found the droid. According to High Squibbian Law, possession was nine-hundred-and-ninety-nine one-thousandths of the law, so the droid should be theirs. SprlMuck countered that Ugorian Divine Law decreed that the slime of an Ugor's pseudopod was enough to not only claim an item for the one who touched it but to sanctify it as well. The droid, for its part, simply gave its name  and its affiliation .\nThe outsiders tried to negotiate a settlement. They explained that both sides' laws should be understood and respected. They traded 2,000 credits to the Ugors and satisfied that constituency. They warned Jimi and his crew that the atmosphere of Almas was slightly poisonous, and thus convinced Jimi to give up the droid in exchange for some spare breath masks. Jimi was pleased enough with the deal that he included a free net with which to carry the droid. Jimi and his crew apologized to the Ugors, who returned the favor.\nNo sooner had the dispute been diffused, though, when Dark Lizards attacked all present from the academy's tower. The beasts attempted to surround their prey and ensnare them with long, black tongues. Jimi and his crew joined the outsiders and the Ugors in destroying the strange creatures. Afterward, Jimi respected and admired the offworlders, and he felt himself more receptive to them and gave them more favorable deals.\nJiminaldo-mabbramsti, like many Squibs, spoke Basic in a manner that hid the meaning beneath strange word choices and unidiomatic speech patterns. He had a rambunctious temperament; while he hated Ugors, he was indifferent to the outsiders who appeared, optimistic that they would side with him. His primary motivation was to make as much money as possible, so he cared for the money the droid would fetch on resale than for the droid itself.\nJimi was otherwise a typical member of his species: overconfident, overcurious, and overfond of bargaining. He enjoyed his job. Jimi spoke Basic, Squibbian, and Old High Squibbian, the Squib trade language. He carried a blaster pistol, as did each other member of his crew. They also had a Squib battering ram on hand.\nJiminaldo-mabbramsti appears as a gamemaster-controlled character in the Star Wars Roleplaying Game roleplaying adventure Echoes of the Jedi. The player characters are expected to retrieve the droid 7-A39 from the scavengers to gain access to the data it has on the academy and the items it houses. The player characters have many options for how to persuade the Squibs and Ugors to give up 7-A39; for example, Jedi heroes can use a mind trick. Nevertheless, the characters can finish their adventure without the droid; instead, they need a data cube that allows them access to the areas of the academy they seek. However, saving the droid is the best course of action, and is thus the canonical outcome. The adventure treats the scenario as the equivalent to a battle for purposes of rewarding the characters with experience points.\nAs an option, the player characters may bargain with Jimi and his crew for other possessions or for parts to fix their ship should it require such care. Some of these items come in handy later in the scenario; gaining the lightsaber, for instance, allows the player characters to convince the former Jedi Thorla, holed up in the academy, to trust them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Almas",
  "/wiki/Squib/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Squeerie",
  "/wiki/Almas_Academy",
  "/wiki/Ugor/Legends",
  "/wiki/Dark_Lizard",
  "/wiki/Order_66/Legends",
  "/wiki/Forard",
  "/wiki/Holobook/Legends",
  "/wiki/Busteromuchmacho_and_the_Vermillion_Shadow",
  "/wiki/Squib_Jedi",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dorv%27Tilsta",
  "/wiki/Glowrod/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/SprlMuck",
  "/wiki/High_Squibbian_Law",
  "/wiki/Ugorian_Divine_Law",
  "/wiki/7-A39",
  "/wiki/Breath_mask/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Squibbian",
  "/wiki/Old_High_Squibbian",
  "/wiki/Squib_battering_ram",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Mind_trick/Legends",
  "/wiki/Data_cube/Legends",
  "/wiki/Thorla",
  "/wiki/Wizards.com"
 ]
}