{
 "name": "Jin-Lo_Rayce",
 "display_name": "Jin-Lo Rayce",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Agents of Ossus"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jocasta Nu"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Various members of the Agents of Ossus"
     ]
    }
   ]
  }
 ],
 "content": "Jin-Lo Rayce was a Human male Jedi Padawan apprenticed to the Jedi librarian Jocasta Nu during the Clone Wars. At the conclusion of the war and the beginning of the Great Jedi Purge, Rayce escaped the attack on the Jedi Temple led by the Dark Lord Darth Vader. Rayce then evaded the new Galactic Empire's forces on Coruscant for a few months and eventually stowed away on a transport headed for the planet Chandrila, where he lived for a time. He then traveled to various planets in the Core, the Inner Rim, and the Mid Rim, in search of surviving Jedi. After concluding that the Jedi were gone, Rayce traveled back to worlds where various Force-sensitives he had met lived and began establishing cells of Force adepts. Rayce styled his group the Agents of Ossus, in memory of the Jedi library planet Ossus, which had been destroyed during the Great Sith War millennia before.\nAs a young boy, the Human male known as Jin-Lo Rayce was interested in the history of the Jedi Order and spent many nights in the Jedi Archives in the Jedi Temple on Coruscant. He eventually became apprenticed to Jedi Master Jocasta Nu, who was the Chief Librarian of the Archives. Nu showed Rayce the secret passageways in and out of the Jedi Temple. During this time, Rayce befriended the Kel Dor Jedi Knight Sha Koon and shared knowledge of these passageways with her.\nIn 19 BBY, the final year of the Galactic Republic's conflict with the Confederacy of Independent Systems, the Supreme Chancellor Palpatine issued Order 66, which commanded the clone troopers of the Republic Army to eliminate the Jedi. When Palpatine's Sith apprentice, Darth Vader—formerly the Jedi Knight Anakin Skywalker—and the 501st Legion of clone troopers assaulted the Jedi Temple, Rayce was given a datapad containing blueprints of Coruscant's underworld, as well as several datachips by Nu. He was instructed to flee the Temple through the secret passages. During Rayce's escape, Nu was killed by Vader when she tried to prevent the Dark Lord from activating the Temple's signal beacon, which would order any surviving Jedi to return to Coruscant.\nDuring the next few months, Rayce avoided the forces of the new Galactic Empire. He eventually managed to stow away on a transport bound for the planet Chandrila and resided there for a short while before beginning a quest to find any Jedi who had survived the purge. Rayce traveled to various worlds in the Core, the Inner Rim, and the Mid Rim, but to no avail. However, during his travels, Rayce met various individuals who were sensitive to the Force. After concluding that there were no Jedi to be found, Rayce came back to the worlds where he had encountered these beings and began to train them in the ways of the Force, even though he was only partially trained himself. Rayce organized many cells of Force-using agents on these worlds. He named his group of Force adepts the Agents of Ossus, after Ossus, a planet that hosted the Great Jedi Library until its destruction during the Great Sith War in 3996 BBY.\nAs a Jedi, Jin-Lo Rayce was amazed at the histories of the Jedi, and spent hours studying the records in the Jedi Archives. During this time, Rayce bonded with the Kel Dor Jedi Sha Koon and even gave her information about the Jedi Temple's secret passageways. After the outbreak of the Jedi Purge, Rayce managed to avoid detection by Imperial forces, scavenging for resources that he needed in order to live. Eventually, after giving up on locating other Jedi, Rayce refocused his determination on forming a new order, even though he himself was only partially trained. Preservation of the lore of the Jedi was important to Rayce, and he viewed his agents as repositories of that knowledge who were in hiding, rather than lost.\nRayce used a lightsaber, although he had only been partially trained in its use, and lost it when he escaped the Jedi Temple. He was also capable of using the Force to guide a blaster and vibroblade. Rayce taught his pupils how to use the Force to both hide from the Empire's Force-hunters and wield these same weapons. He showed the Agents of Ossus these various techniques he developed during his time on the streets of Coruscant and other planets.\nJin-Lo Rayce was first mentioned in the September 2008 The Force Unleashed Campaign Guide as part of the background for the Force-using organization called the Agents of Ossus. He was later mentioned in the November 2009 comic Star Wars: Purge: Seconds to Die, written by John Ostrander and published by Dark Horse Comics.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Agents_of_Ossus",
  "/wiki/Jocasta_Nu/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_archivist/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Operation:_Knightfall",
  "/wiki/Jedi_Temple",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Chandrila/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Mid_Rim",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_Adept",
  "/wiki/Great_Jedi_Library/Legends",
  "/wiki/Battle_of_Ossus_(Great_Sith_War)",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Chief_Librarian/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Sha_Koon",
  "/wiki/19_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Death/Legends",
  "/wiki/Jedi_beacon/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/3996_BBY",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/September",
  "/wiki/2008",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/November",
  "/wiki/2009",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Purge:_Seconds_to_Die",
  "/wiki/John_Ostrander",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_5"
 ]
}