{
 "name": "Jinart",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Qiilura"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gurlanin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jinart was a shapeshifting female Gurlanin native from the planet Qiilura who served the Galactic Republic during the Clone Wars. She was the mate of Valaqil.\nDuring Omega Squad's mission on Qiilura, Jinart helped a great deal. She helped Etain Tur-Mukan obtain shelter, and guided Darman towards the rest of Omega Squad. She also scouted areas needed to be explored by the Omegas. Jinart killed six children hiding in a barn for the sin of being the family of informants, whom she also killed. Jinart would later go to Coruscant in an attempt to force the Republic into moving the settlers and Clone troopers off of Qiilura. During her attempt, she took the form of Vinna Jiss who, unbeknownst to her, had been killed by Walon Vau causing confusion in ARC trooper Ordo who fired on her, severely wounding her as she followed Besany Wennen. She was brought back to Qibbu's Hut for healing from Etain and Bardan Jusik and was bitter about being shot. Jinart provided much needed information to Omega and Delta Squads during their black op on Coruscant on the one condition that the Republic would remove the Clone troopers and settlers from Qiilura, even after being threatened that Qiilura would be reduced to molten slag if she didn't cooperate by Kal Skirata. Kal would later call on Jinart for aid after learning of Etain's pregnancy, and had Jinart hide Etain on Qiilura long enough for her to have her and Darman's child.\nLike Etain, Jinart was generally afraid of Skirata and believed him when he said he would turn Qiilura to slag if she didn't cooperate. She believed Etain should have told the Jedi Order of her pregnancy and leave the order as she believed it would be better for her child, something Etain refused. She was also greatly against letting Skirata raise the child. During the removal of the colonists from Qiilura, Jinart was partly responsible for the deaths of over ten thousand clones after Etain gave them a few more hours to leave the planet, something Jinart told Etain she could have prevented.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Qiilura",
  "/wiki/Gurlanin",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Changeling/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Valaqil",
  "/wiki/Omega_Squad",
  "/wiki/Etain_Tur-Mukan",
  "/wiki/Darman_Skirata",
  "/wiki/Coruscant/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Vinna_Jiss",
  "/wiki/Walon_Vau",
  "/wiki/Ordo_Skirata",
  "/wiki/Besany_Wennen",
  "/wiki/Qibbu%27s_Hut/Legends",
  "/wiki/Bardan_Jusik",
  "/wiki/Delta_Squad/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Venku_Skirata",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jinart",
  "/wiki/Republic_Commando:_Hard_Contact",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}