{
 "name": "Jixtus",
 "display_name": "Jixtus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 18 BBY",
      "FateSpinner",
      "Sunrise system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Grysk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Much shorter than Generalirius Nakirre"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grysks",
      "Nikardun Destiny",
      "Kilji Illumine"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Yiv",
      "Nikardun"
     ]
    }
   ]
  }
 ],
 "content": "A Grysk male known as \"Jixtus\" who was at least twenty-one years old and was the coordinator of the Grysk warlike species, he led a Grysk fleet from his flagship, the Shatter-class WarMaster FateSpinner. At some point before 18 BBY, Jixtus and the Grysks trained General Yiv the Benevolent and his species, the Nikardun, in the arts of conquest in an attempt to encircle the Chiss Ascendancy, the government of the Chiss species. However, although Yiv conquered the Tower Dimension and the Garwian Unity, he failed when conquering the Vak Combine, where he was defeated by Chiss Senior Captain Mitth'raw'nuruodo \"Thrawn\", which became an enemy of Jixtus. Afterward, Jixtus employed the telepathic Agbui species to cause chaos in and civil wars, creating a civil war in the Unknown Regions planet Sunrise, which resulted in massive destruction, and failing in the attempt to precipitate a civil war in the Ascendancy.\nWith the death of Haplif, the coordinator of the Agbui, Jixtus allied himself with Generalirius Nakirre, the leader of the Kilji species' theocracy of the Kilji Illumine and its battle fleet of the Illumine Kilhorde. While the Kilhorde prevented fleeing Chiss refugees from escaping the Ascendancy, Nakirre and Jixtus traveled aboard the Kilji war cruiser Whetstone across the Chiss, meeting several high-ranking officials such as Clarr'ivl'exow \"Rivlex,\" who obtained Grysk warships in exchange of information. While the families entered a battle against each other thanks to Nakirre and Jixtus' meetings sharing images of the battle between the Dasklo, Xodlak, Erighal and Pommrio families, General Crofyp and Colonel Tildnis perished while fighting Thrawn, who had previously defeated Yiv and Haplif. Thrawn, obtaining data from Tildnis' Kilji picket cruiser Hammer, allied himself with the Paataatus Hiveborn to destroy the Kilhorde, destroying the Kilhorde.\nUltimately, receiving reports from Grysks and Rivlex, Jixtus traveled to Sunrise once more, as Thrawn was present at the planet with a fleet of Chiss warships. There, he was informed of the Kilhorde's destruction, and killed Nakirre, viewing him as useless, and also fought the Chiss fleet with his own fleet, causing slight damage in the Chiss, but being defeated by Thrawn's tactics and alliance with Yiv's previously conquered people. Then, the Paccosh, Garwians, and Vaks, fought Jixtus' fleet, exacting severe casualties before Nakirre's vassals, led by Jixtus' agent, Pathfinder navigator Qilori, fired at the FateSpinner from the Whetstone, desintegrating most of the warship and forcing Jixtus to use a self-destruct mechanism to destroy his fleet before telling Thrawn that his career was over, and that the Grysks would come back and kill the Chiss, killing himself.\nJixtus, as the Grysk male called himself, was the coordinator of his species, who sought the destruction of the Chiss government of the Chiss Ascendancy. At some point before 19 BBY, Jixtus trained the Nikardun sentient species and Nikardun General Yiv in the arts of conquest, orchestrating the Nikardun conquests across the Unknown Regions. Although the Grysk—and others—believed Yiv's conquests would fail, they still deemed them beneficial: while the Chiss were occupied thinking about the Nikardun, the Agbui telepathic species would enter the Ascendancy and brew a civil war, and when the Chiss were fighting each other, the Grysk forces would siege the Ascendancy capital of Csilla, destroying the Chiss.\nAs the Nikardun campaign unfolded, Jixtus and the Grysks watched from afar. Yiv was able to conquer the Tower Dimension, nation of the Urchiv-ki species, the Paataatus Hiveborn, government of the Paataatus, and the Lioaoin Regime. However, although Jixtus deemed it unnecessary, the Nikardun general conquered the Garwians' Garwian Unity and attempted the conquest of the Vak species' Vak Combine, which led to his doom at the hands of Chiss Senior Captain Mitth'raw'nuruodo. Following Yiv's defeat, the Grysk coordinator hired Pathfinder navigator Qilori of Uandualon as his ship's navigator. During a voyage, Jixtus inquired the navigator on the whereabouts of Yiv, although Qilori attempted to lie, Jixtus informed him of their location deep in space, and threatened Qilori with his death in it. The Grysk was then informed of Yiv's capture by Thrawn by Qilori, who was in turn informed of Jixtus' plan to destroy the Chiss. Gaining the promise of Qilori's assistance, Jixtus let the navigator continue their journey.\nAt the behest of Jixtus, the Agbui Haplif, who was skilled in reading cultures and minds, orchestrated a civil war on the Unknown Regions planet Sunrise in under six months. During the civil war, which took place around 19 BBY, The Agbui agent, who had traveled to Sunrise with other Agbui, such as Shimkif and Frosif, pushed both sides of the civil war to use flat-blast artillery shell in the war effort, which left most of the planet's population dead, and ravaged the sky and surface of Sunrise. The Agbui and the Grysks subsequently subjugated Sunrise, turning it into a mining world where they farmed nyix, a material used for warship construction.\nA group of two hundred refugees, led by The Magys, Sunrise's leader, escaped their planet, heading towards the Paccosh homeworld of Rapacc. Unlike many of the worlds of the Chaos populated by sentient species, Sunrise never had a long-range communications triad, which prevented Jixtus from hearing from Haplif. As the Grysk had previously told the Agbui to \"leave no witnesses,\" the Agbui agent contacted a remnant of the Nikardun military, telling them that the fleeing refugees planned to build an army to destroy the remnant. Following the successful escape to Rapacc, as the Nikardun were unable to thwart it, Jixtus sent Haplif to infiltrate the Chiss.\nFollowing Thrawn to Sunrise, Jixtus and Generalirius Nakirre arrived on the Whetstone along with Jixtus' section of the Grysk armada to prepare to attack the Chiss forces. They arrived at a scene of many apparently destroyed Chiss warships, with Jixtus, Qilori, and Nakirre concluding that the civil war had caught up to the Chiss and they had destroyed each other. After locating Thrawn as one of the last survivors, Jixtus questioned Thrawn about the Magys, to which Thrawn gave answers for providing Jixtus answered his questions. Gaining some necessary knowledge, he revealed the Kilji Illumine Kilhorde fleet has been completely destroyed. In a fit of rage, Generalirius Nakirre accosted Jixtus, but was quickly and summarily executed by Jixtus. Thrawn demanded for Jixtus's surrender, to which Jixtus refused, to which Thrawn responded by sending out a sensor ping, to alert all the supposedly destroyed Chiss ships to signal a surprise attack. The Grysk fleet was now completely out of formation and surrounded close-range by the enemy.\nWith Thrawn's demand for surrender, Jixtus, in regular Grysk fashion of not providing any remains for which the Chiss and especially Thrawn to study, instantly triggers explosions across the entire Grysk fleet. Only Jixtus, aboard the FateSpinner, remained. Conversely finally with Thrawn, throwing condemnation at Chiss and Thrawn alike, as well as threatening of a larger Grysk force poised to attack Thrawn after he is gone. Jixtus then triggered the same explosion device contained within the FateSpinner, killing himself.\nJixtus was the assumed name of a male Grysk enemy of the Chiss Ascendancy. He and his allies saw the Chiss as the primary obstacle to control over the Unknown Regions. He spoke in a cultured voice. While speaking with Qilori, he threatened the Pathfinder. He was seemingly darkly amused by Qilori asking if he had been General Yiv's master before claiming to have no relation to the defeated general. He was also pleased that Qilori promised to join his effort against the Chiss.\nJixtus was a proficient in social manipulation and intimidation, as he coerced many Pathfinders to work for him, and forced other warlords or bureaucrauts like Yiv the Benevolent and Generalirius Nakirre to be his tools without them knowing. He laid expertly laid plans, combing multiple campaigns to server his overall goal of Chiss destruction. One instance of him doing this is using the Agbuli to stage a Chiss encounter above Hoxim, creating tension in the Syndicure while also using Kilji vessels masquerading as Chiss family vessels to stoke a civil war. He was seen as a ruthless figure by some, such as Qilori of Undalon who worked for him mostly in fear. He was seen mostly as strong figure and hero to those that were opponents to the Chiss.\nA military mind, the being known as Jixtus suggested movements and meetings to \"his associates,\" which were in fact slaves of the Grysks, and was able to direct and create vast military campaigns, such as his plot to destroy the Chiss Ascendancy. He was able to form alliances with head of state and government officials, such as Nakirre and Patriarch Rivlex.\nJixtus was in command of his own fleet, composed of fourteen Grysk war vessels, and his flagship, the FateSpinner. He also owned several ships. He used shuttle to travel from the Whetstone to the FateSpinner, which could carry a hundred soldiers. While meeting Haplif, he used a ship piloted by Qilori. Wishing to keep his body a secret, Jixtus used a cloak to conceil his identity, as well as some gloves. Inside the cloak, he carried a blaster the Grysk used to kill Nakirre.\nJixtus, the main antagonist of the Star Wars: The Ascendancy Trilogy written by Timothy Zahn, first appeared in the trilogy's first installment, Thrawn Ascendancy: Chaos Rising. The Grysk received a dynamic, Generalirius Nakirre, in the trilogy's final installment, Thrawn Ascendancy: Lesser Evil, where the generalirius slowly realizes the truth about his relationship with Jixtus. In the same novel, Jixtus foreshadows the events of Thrawn: Alliances and Thrawn: Treason, two novels of the Thrawn novel series that feature the Grysks as the main antagonists.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Update",
  "/wiki/Template:Expand",
  "/wiki/Template:Cleanup",
  "/wiki/Talk:Jixtus",
  "/wiki/18_BBY",
  "/wiki/FateSpinner",
  "/wiki/Sunrise_system",
  "/wiki/Grysk",
  "/wiki/Gender",
  "/wiki/Generalirius",
  "/wiki/Nakirre",
  "/wiki/Nikardun_Destiny",
  "/wiki/Kilji_Illumine",
  "/wiki/Yiv",
  "/wiki/Nikardun",
  "/wiki/Species",
  "/wiki/Jixtus%27s_fleet",
  "/wiki/Flagship",
  "/wiki/Shatter-class_WarMaster",
  "/wiki/General",
  "/wiki/Nikardun_conquests",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Chiss",
  "/wiki/Tower_Dimension",
  "/wiki/Garwian_Unity",
  "/wiki/Vak_Combine",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Core_name",
  "/wiki/Agbui",
  "/wiki/Unknown_Regions",
  "/wiki/Planet",
  "/wiki/Sunrise",
  "/wiki/Agbui_attempt_to_precipitate_a_Chiss_Ascendancy_civil_war",
  "/wiki/Death",
  "/wiki/Haplif",
  "/wiki/Kilji",
  "/wiki/Fleet",
  "/wiki/Illumine_Kilhorde",
  "/wiki/Refugee",
  "/wiki/Kilji_war_cruiser",
  "/wiki/Whetstone",
  "/wiki/Clarr%27ivl%27exow",
  "/wiki/Hoxim_incident",
  "/wiki/Dasklo_family",
  "/wiki/Xodlak_family",
  "/wiki/Erighal_family",
  "/wiki/Pommrio_family",
  "/wiki/Great_Families",
  "/wiki/Crofyp",
  "/wiki/Colonel",
  "/wiki/Tildnis",
  "/wiki/Kilji_picket_cruiser",
  "/wiki/Hammer_(Kilji_picket_cruiser)",
  "/wiki/Paataatus_Hiveborn",
  "/wiki/Thrawn%27s_fleet",
  "/wiki/Senior_Captain_Thrawn%27s_last_stand",
  "/wiki/Paccosh",
  "/wiki/Pathfinders_(Navigators%27_Guild)",
  "/wiki/Navigator",
  "/wiki/Qilori",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Plot_to_destroy_the_Chiss_Ascendancy",
  "/wiki/19_BBY",
  "/wiki/Sentience",
  "/wiki/Telepathy",
  "/wiki/Capital",
  "/wiki/Csilla",
  "/wiki/Urchiv-ki",
  "/wiki/Lioaoin_Regime",
  "/wiki/Garwian",
  "/wiki/Vak",
  "/wiki/Battle_over_Primea",
  "/wiki/Jixtus%27_ship",
  "/wiki/Realspace",
  "/wiki/Sunrise%27s_civil_war",
  "/wiki/Standard_month",
  "/wiki/Shimkif",
  "/wiki/Frosif",
  "/wiki/Flat-blast_artillery_shell",
  "/wiki/The_Magys%27s_people",
  "/wiki/Mining",
  "/wiki/Nyix",
  "/wiki/Warship",
  "/wiki/The_Magys",
  "/wiki/Homeworld",
  "/wiki/Rapacc",
  "/wiki/Yiv%27s_battle_forces",
  "/wiki/File:Nakirredeath.ogg",
  "/wiki/File:Fatespinner.ogg",
  "/wiki/Jixtus%27_shuttle",
  "/wiki/Jixtus%27_cloak",
  "/wiki/Glove",
  "/wiki/Cloak",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Thrawn:_Treason",
  "/wiki/Star_Wars:_Thrawn_(novel_series)",
  "/wiki/Imperial%E2%80%93Grysk_conflict",
  "/wiki/Category:Audio_files_of_Jixtus",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Template:LesserEvilDate",
  "/wiki/Clone_Wars",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Mustafar",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Ahsoka_Tano",
  "/wiki/Standard_year",
  "/wiki/Attack_on_the_Paataatus"
 ]
}