{
 "name": "Jo",
 "display_name": "Jo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Freetown",
      "Freetown garrison",
      "Freetown garrison"
     ]
    }
   ]
  }
 ],
 "content": "Jo was a human female resident of the town of Freetown on Tatooine following the fall of the Galactic Empire. In response to a krayt dragon threatening the town, its marshal, Cobb Vanth, agreed to work with the Mandalorian bounty hunter Din Djarin and a nearby tribe of Tusken Raiders to defeat the dragon, with Djarin volunteering the residents of Mos Pelgo to assist in the fight. As the Mos Pelgo residents and Tusken Raiders prepared a trap for the krayt dragon, Jo armed the explosives that had been placed beneath the sand. She passed the detonator to Vanth, advising the marshal to be careful. Jo survived the battle against the krayt dragon and helped the Tuskens and the other villagers strip its carcass.\nDuring the era of the New Republic, Jo lived in the town of Mos Pelgo on the desert planet Tatooine. In her time living in the town, she grew a habit of desert hunting. Jo and the other town residents were protected from bandits and Tusken Raiders by Marshal Cobb Vanth, who bore Mandalorian armor that had once belonged to the famed bounty hunter Boba Fett, but faced recurring trouble from a large krayt dragon. In 9 ABY, the Mandalorian bounty hunter Din Djarin was searching for another Mandalorian and caught wind of an individual in Mandalorian armor at Mos Pelgo. Djarin thus traveled to the town and found Vanth. Although the pair were in disagreement over Vanth's ownership of Mandalorian armor despite not following the Mandalorian Creed, Djarin agreed to help kill the krayt dragon in exchange for the armor.\nIn their plan to kill the Krayt dragon, Vanth and Djarin convinced the people of Mos Pelgo to put aside their feud with a Tusken Raider tribe and join forces with them against the creature. Jo helped move supplies from a storage facility in the town's outskirts for the upcoming fight when the tribe of Tusken Raiders arrived to load stuff onto their banthas. The joint forces then made their way to the krayt dragon's den, an abandoned sarlacc pit, and began setting up a trap for the beast after confirming that it was asleep.\nThe people of Mos Pelgo and the Tuskens dug out pits to set up explosive charges, with Jo configuring the detonator for them. She handed the detonator to Vanth, advising him to be careful with it. The marshal thanked her and told her to stay safe, Jo giving a nod and briskly walking off. The joint forces begun their trap, initially failing to kill the krayt dragon with the explosives that they had dug in. However, Djarin was able to have the creature consume a bantha loaded with explosives and turn the beast into a carcass by setting them off. After, Jo helped pick at the remains of the krayt dragon.\nAfter, Mos Pelgo was renamed Freetown by the locals. Around the same time, Boba Fett, who had reacquired his armor from Djarin established himself daimyo of Tatooine, but was challenged by the Pyke Syndicate, which was increasing its spice operations on the planet. Vanth similarly came into conflict with some Pyke foot soldiers, and sent back a survivor with a message to the syndicate. Having returned to help Fett, Djarin went back to Freetown and negotiated with Vanth for help against the Pyke Syndicate. However, as Djarin departed, the Duros bounty hunter Cad Bane. who was working with the Pykes, approached Freetown. Spotting Bane, Vanth advised Jo, who had been cleaning a speeder bike, to herd the other residents inside.\nJo asked Vanth if something was wrong, the marshal telling her that he was being on the safe side. Thus she guided other residents into the saloon as Vanth went to face Bane. As the pair exchanged, Jo peaked her head through a window to observe. A standoff ensued, which ended in Bane gunning down both the marshal and his deputy, Scott, killing the latter. Bane gave out a message for Freetown to let the syndicate's spice operations pass through and left. Jo and the other residents then went over to an injured Vanth with a medical pack, followed by a number of other residents.\nIn response to the shooting of their marshal, the people of Freetown sent their own garrison of combat able citizens to help Fett at the city of Mos Espa, Jo among the fighters sent. The garrison traveled into the city aboard a modified V-35 Courier landspeeder armed with a turret manned by the Weequay proprietor Taanti. The speeder arrived at the ruins of the Sanctuary, a cantina that the Pyke Syndicate had bombed, where Fett and Djarin had engaged invading Pyke forces. Jo and the other Freetown fighters then disembarked under the cover of Taanti before his turret was destroyed by enemy fire. Using the speeder as cover, the group's firepower was able to force the syndicate's foot soldiers to run into cover.\nShortly after, the Mods, a gang of cybernetically enhanced people that worked for Fett, arrived on their speeders and ran behind the cover of the V-35 Courier. One of the Mods, Skad, asked where the Freetown fighters came from, calling them sand scurriers. Jo replied that she and her comrades were there to save their \"tails,\" calling them city rats in return. Fett advised the pair to save their spite for the Pyke Syndicate. Additionally, their forces were then joined by the injured Wookiee bounty hunter Krrsantan. That was when the Pyke foot soldiers began falling back, leading the fighters on Fett's side to cheer in victory.\nTheir celebration was short lived, though, as two Pyke Syndicate scorpenek droids arrived, encased in deflector shields. While Jo and her allies begun firing on the droids, their shots had no effect, and the scorpeneks then began returning fire. Fett and Djarin had Jo and the others flee while the pair distracted the two droids, which destroyed the landspeeder. One of the scorpeneks ultimately began following Jo's group as they fled through the streets of Mos Espa. Taanti eventually advised the group to take cover, and they all entrenched behind a low wall. Drash, another Mod, insisted that they must stop retreating, Jo relaying the advice to Taanti when he arrived. Although the Weequay though digging in was a bad idea, Drash claimed there would be no cover for them if they continued running.\nDrash then formulated a plan to use a rooftop as a firing position. Looking over at the mod's small blaster pistol, Jo doubted the small firearm would be good for sniping and had Taanti swap his cycler rifle for it. Jo and Drash then made their way out the back of their position and up to the rooftops. Once there, Drash asked Jo if the latter could pick off some of the Pykes, to which Jo cited her experience in desert hunting. Thus Drash decided she would distract the scorpenek droid and began open firing on it. Jo mobilized at the same time, gunning down several Pyke foot soldiers below while they were initially unaware of her presence.\nThe scorpenek fired at Drash and Jo, forcing them to take cover, but the pair were unharmed and rose back up to fire again when Fett arrived, riding a rancor. Fett and his rancor fought and destroyed the droid, with Djarin arriving and prompting the other fighters to chase down the remaining Pyke Syndicate forces. Jo and the others proceeded to pursue the Pykes, but were distracted when Fett's rancor went on a rampage, having been aggravated by Cad Bane. The fighters, Jo among them fired on the rancor.\nJo appeared in \"Chapter 9: The Marshal,\" the premiere of the second season of the television series The Mandalorian, released on Disney+ on October 30, 2020. She was portrayed by Karisma Gideon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Joe_(disambiguation)",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Freetown",
  "/wiki/Freetown_garrison",
  "/wiki/City",
  "/wiki/Tatooine",
  "/wiki/Galactic_Empire",
  "/wiki/Krayt_dragon",
  "/wiki/Marshal",
  "/wiki/Cobb_Vanth",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Tusken_Raider",
  "/wiki/Mission_to_Tatooine_(Din_Djarin)",
  "/wiki/Detonator",
  "/wiki/New_Republic",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Hunting",
  "/wiki/Mandalorian_armor",
  "/wiki/Boba_Fett",
  "/wiki/Unidentified_krayt_dragon_species",
  "/wiki/9_ABY",
  "/wiki/Bounty",
  "/wiki/Armor",
  "/wiki/Mandalorian_Creed",
  "/wiki/Death",
  "/wiki/Bantha",
  "/wiki/Abandoned_sarlacc_pit",
  "/wiki/Sarlacc",
  "/wiki/Explosive_charge",
  "/wiki/Daimyo",
  "/wiki/War_for_Tatooine",
  "/wiki/Pyke_Syndicate",
  "/wiki/Spice",
  "/wiki/Pyke",
  "/wiki/Pyke_guard",
  "/wiki/Duros",
  "/wiki/Cad_Bane",
  "/wiki/Speeder_bike",
  "/wiki/Mos_Pelgo_saloon",
  "/wiki/Deputy",
  "/wiki/Scott",
  "/wiki/Mos_Espa",
  "/wiki/Garrison",
  "/wiki/V-35_Courier",
  "/wiki/Landspeeder",
  "/wiki/Weequay",
  "/wiki/Taanti",
  "/wiki/Speeder",
  "/wiki/Sanctuary",
  "/wiki/Cantina",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/Mods",
  "/wiki/Cybernetics",
  "/wiki/Skad",
  "/wiki/Scurrier",
  "/wiki/Wookiee",
  "/wiki/Krrsantan",
  "/wiki/Scorpenek_droid",
  "/wiki/Deflector_shield",
  "/wiki/Droid",
  "/wiki/Drash",
  "/wiki/Blaster_pistol",
  "/wiki/Sniper",
  "/wiki/Cycler_rifle",
  "/wiki/Boba_Fett%27s_rancor",
  "/wiki/Rancor",
  "/wiki/Chapter_9:_The_Marshal",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/The_Mandalorian",
  "/wiki/Disney%2B",
  "/wiki/October_30",
  "/wiki/2020",
  "/wiki/Karisma_Gideon",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/Chapter_14:_The_Tragedy",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Standard_year",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian"
 ]
}