{
 "name": "Joad Kreel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aquilaris Minor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Joad Kreel was a male Human living on Aquilaris Minor during the New Sith Wars. He was a childhood friend of Jedi Knight Kerra Holt, but by the time she returned to the planet alongside Devil Squadron in 1032 BBY, Kreel had become completely addicted to the spice Deluge. Despite his initial disinterest and hostility towards Kerra, he had regained control of his will sufficiently to assist the Jedi Knight in evacuating civilians to safety following an artificial global deluge unleashed by the Hutt crimelord Zodoh's fleet of Stormdrivers. With the assistance of Padgett, they evacuated thousands of refugees to underwater harvester stations. He also began the process of ending his addiction to Deluge.\nJoad Kreel grew up on the watery planet of Aquilaris Minor during the Republic Dark Age. He was a resident of Capital Cay, an important maritime port city and the planetary capital. His father was a member of the Seacroppers' Guild, who were responsible for manning the Seacropper Submersibles that harvested seafood including eels to feed the planet's population. During his childhood, he was a close family friend of Kerra Holt, who idolized Joad and would subsequently become a Jedi Knight. Due to his upbringing as a Seacropper, Joad always maintained a fascination with submersibles and the sea. At the age of thirteen, he and Kerra went for a ride on his father's submersible without his permission. Kerra was curious about submersibles, and she wanted to see the harvesting stations. Due to her inexperience, Kerra rammed the submarine into the harbor wall just five minutes after entering the port. While this incident slightly damaged the submersible, it did not affect their friendship, and the two would remain close friends throughout their lives.\nIn 1042 BBY, Aquilaris was invaded by elements of the Chagras Hegemony led by Sith Lord Odion. The Sith invaders laid waste to much of Capital Cay. Kerra's parents, Aron and Mercia Holt, had been involved in a University of Sanbra research project to locate the Helm of Ieldis, an ancient Sith artifact. The Helm had been created by the Sith Lord Ieldis prior to the Great Hyperspace War and was capable of driving sentient beings into a homicidal frenzy. During a raid on Sanbra, the Sith Lord Odion, then working under the banner of the Sith Chagras Hegemony, came across information on the Ieldis research project. He also found out that the researchers had fled to Aquilaris, which had previously been a Republic haven in the Outer Rim that had hosted refugees fleeing the Chagras Hegemony's onslaught.\nUnder the pretext of capturing the Jedi Knight Vannar Treece, who was considered a perennial foe of the Sith, Odion obtained permission from the Calimondra family matriarch Vilia Calimondra, his grandmother, to launch an invasion of Aquilaris Minor. Odion captured the researchers, including Kerra's parents, who were then conscripted into Project Pandemonium, a top-secret project to obtain the Helm for himself. Prior to their capture by Odion's Sith forces, Kerra's parents told her to flee to the Kreels since they maintained a submersible. Joad promised to evacuate her and her family underwater to escape the Sith onslaught. Kerra traveled back to her family home only to find that her parents had disappeared. She was subsequently rescued by the Jedi Knight Vannar Treece, who escaped with Kerra in his starfighter to Republic Space. Joad was also separated from his father during the invasion but escaped in his submersible prior to a Sith aerial bombardment of the harbor. Kreel's father was presumed dead during the fighting.\nDuring the subsequent Sith occupation of Aquilaris, the Sith enslaved the surviving population including Joad Kreel, who was forced to return to port since he had nowhere else to go. Odion massacred most of the world's inhabitants, and Chagras eventually intervened and prevented his nephew from killing the planet's entire population, so that some of the people could be used as slaves to operate Aquilaris's fleek eel traps. The Sith occupiers also requisitioned the populace's homes and food, reducing the Aquilarians to a state of poverty and misery. Kreel spent much of his adolescence growing up in the Seacroppers' barracks, enduring squalid and unhealthy conditions.\nUnable to come to terms with the loss of his family and the surrounding squalor, Kreel and many other Aquilarians became addicted to the spice Deluge, a narcotic that had been deliberately distributed by the pro-Republic Grace Command on Alderaan under Operation Deluge to undermine the Sith war effort. Meanwhile, the hapless civilian populations of Sith-occupied space were merely dismissed as necessary collateral damage in the Republic's war effort\nHowever, Joad and Kerra crossed paths again nearly ten years later in 1032 BBY. By then, Odion's rival and estranged brother Daiman had seized control of Aquilaris, becoming the latest in a string of conquerors to exploit the planet. Daiman exploited the planet as a source of seafood while treating the planet's populace as slaves. That year, Joad sent out a HoloNet distress call which was in reality a coded transmission requesting more of the Deluge narcotics. This transmission was intercepted by three different parties with their own vested interests: Kerra Holt, the Hutt crimelord Zodoh, and Captain Jenn Devaad of Grace Command. Kerra saw this as a chance to return to her homeworld and rescue it from the Sith. In contrast, Zodoh saw a business opportunity to expand his operations into the Grumani sector, a traditional Sith domain. He wanted to carve up his own empire within that region by using his new superweapon known as the Stormdrivers to intimidate his Sith rivals. These warships were equipped with moisture vaporators capable of generating artificial storms. Finally, Grace Command merely regarded Aquilaris as yet another dumping ground for their Deluge under the guise of liberating occupied worlds and providing humanitarian relief.\nZodoh's fleet overwhelmed Daiman's garrison and assaulted Capital Cay. Within minutes, Zodoh's forces had wiped out the artillery defenses, forcing the Daimanate garrison into a retreat. In the midst of the chaos, Holt infiltrated Capital Cay in a food transport. Arriving at the Seacropper Guild's dormitories, she encountered her old friend \"Old\" Padgett, an acquaintance of Joad. Holt then attempted to evacuate the slaves onto her passenger transport while the Sith troops were distracted by Zodoh's forces. However, the Deluge spice made many of the slaves disinterested and apathetic toward their liberation. After some frustration, Kerra met up with her childhood friend, Joad. However, he merely rebuffed her and revealed the true purpose of his coded distress call. This revelation, coupled with the apathy of the prisoners, angered Holt, who expressed disgust at their ungratefulness and lack of purpose.\nWhile arguing with Kreel, they were interrupted by a lightning bolt unleashed by one of Zodoh's Stormdrivers, which had created an artificial storm that swept the remnants of Daiman's garrison into the surrounding sea. Old Padgett also revealed to Kerra the full extent of the damage caused by the Deluge narcotic. The intoxicated Seacroppers were unable to fulfill their work quota since many were unwilling to work in the rain. Since the fishing submersibles and eel traps were damaged, the seacroppers had been unable to fish, reducing them to pauperism. Embittered but still retaining her fighting spirit, Kerra resolved to confront Zodoh's \"toy.\" While hovering over the bay,the Stormdriver was attacked by Holt, who fired upon the machine with her blaster pistol in a last-ditch attempt to stop it. With the crew preoccupied with Kerra's resistance, the warship was ambushed by Captain Devaad's squadron of Fire Lotus-class starfighters from Grace Command, an Alderaan-based pro-Republic mercy organization. Despite the withdrawal of the Republic from much of the outlying regions, Devaad's Death Squadron had continued the fight against the Sith and other threats. Unwilling to waste more firepower and having achieved the goals of his Aquilaris mission, Zodoh ordered a tactical withdrawal back to his fighter carrier Voracious, which was waiting in the Aquilaris system.\nGrace Command portrayed themselves as humanitarian liberators and relief workers who had come to liberate Sith-occupied worlds. During a speech in Capital Cay's harbor, Captain Jenn Devaad promised the assembled crowd of civilians that Grace Command would distribute food and medical supplies for everyone. The shuttle Mother Grace would arrive the following day with further supplies and to evacuate the most serious drug addicts for rehabilitation on Alderaan. Devil Squadron also had plans to liberate the remaining slave crews on the other islands while destroying the remnants of Daiman's scattered forces. During the public meeting, Jenn also lauded Kerra Holt's efforts in fighting both the Sith and Zodoh, even loaning her one of her squadron's starfighters. Following the fanfare, however, Devil Squadron revealed their less savory side by forcibly evicting the Seacroppers' Guild from their barracks. Joad was among those evicted and was forced to squat in the spaceport area.\nThroughout their short stint on Aquilaris, Grace Command embarked on a public relations campaign to court local support by distributing food and medical supplies at the city's spaceport to civilians. Joad stumbled upon Kerra and Jenn in the midst of this \"humanitarian relief\" operation. When Jenn asked Kerra about Joad, Kerra explained that he was suffering from the effects of Deluge. She also explained that many addicts were hiding in the barracks. Captain Jenn commented that Aquilaris was one of several worlds which had become ravaged by the narcotic spice, adding that many of the Sith forces were also addicted. Jenn added that the drug problem made the Republic's war effort easier while changing the way Grace Command conducted its humanitarian operations. One of her crew, Vahss, brought a time-locked orange case which would unlock after Grace Command had departed Aquilaris. Jenn explained that it was locked so that civilians could have nutrition in times of famine. When Joad expressed his bewilderment at the time-locked food canisters, Kerra replied that Grace Command had probably intended for recipients not to trade food for drugs.\nGrace Command also kept Kerra off guard by giving her a place in their fighter squadron. The next morning, Grace Command would depart Aquilaris to escort Grace Mother and then to assault Sith Lord Malakite's forces on Heptooine. After Kerra left, Captain Jenn and several of her pilots including Vahss met up for a secret meeting. Vahss suggested that the presence of a Jedi pilot could complicate their work. Jenn dismissed his concerns by saying that Kerra as a product of Vannar Treece's Jedi regime would be too focused on the mission to notice anything suspicious. She and Vahss also agreed that their presence in the Aquilaris system could be exploited as an opportunity to kill two birds with one stone: getting revenge of Zodoh for their captivity in Daalang and their true purpose of inundating Aquilaris' population with the narcotic. Kerra Holt was ideal as a \"good-luck charm\" to keep the population off guard. However, Joad eavesdropped on the conversation, which confirmed his suspicions about Grace Command's ulterior motives.\nRendered homeless, Joad slept in the spaceport that night. The next day, he encountered Kerra, who was shocked at his homelessness. Joad revealed that Devil Squadron had evicted the Seacroppers from their barracks. When Kerra expressed her bewilderment, he confirmed that he could recall where he had slept the last night. Joad expressed his surprise that Kerra was going to depart so early, which she misinterpreted as him wanting a place aboard the hospital shuttle Grace Mother. When he declined the offer, she thought that his irrational behavior was a side effect of the drug. Joad attempted to warn Kerra about the true intentions of Grace Command, but she had by then departed in her Fire Lotus starfighter. A dejected Joad then went to hide and mope in his broken-down submersible which had once been his pride and joy.\nFollowing a disastrous dogfight, Kerra returned to Aquilaris, where she tried to convince the planet's population to evacuate to higher ground. The workers were discouraged and apathetic, which was compounded by a logistics problem. The airspeeders were vulnerable to stormy conditions while most of the boats had been destroyed by the Sith occupiers. Her friend \"Old\" Padgett added that the Seacroppers' Guild had ceased to operate due to the drug-afflicted state of its members. When Holt inquired about the underwater harvester stations, Padgett added that they were decrepit. In exasperation, Kerra lamented that everyone would sink together. Still, she convinced Padgett and the others to evacuate the barracks prior to the storm. Meanwhile, a frustrated Kerra visited the docks, where she encountered a dejected Joad, who was cowering in the command deck. The two briefly discussed their childhood and their separation during the Sith invasion.\nKerra tried to persuade Joad to help fix the submersible, but he remained despondent and uncooperative, commenting that he died when his family died. Finally, he told Kerra to take back the time-locked food crate passed by Grace Command since he did not wish to live anymore. In a final vent of exasperation, Kerra kicked the food crate only to discover that it contained the narcotic Deluge spice. Kerra quickly realized the true intentions of Grace Command. Heading back to the barracks, she encountered Captain Jenn coercing the other Aquilarians into gathering all the orange food crates containing Deluge. She was attempting to save her crew by bringing Grace Command's remaining storage of Deluge to Zodoh the Hutt. Kerra overpowered Jenn using her Force powers and attempted to reason with her but to no avail. Fixated with saving her comrades, Jenn refused to assist Kerra in evacuating the Aquilarian people, whom she derided for not fighting for themselves. Following Jenn's departure in a shuttle, Zodoh's Stormdrivers unleashed an artificial flood, which caused widespread damage and deaths throughout the planet.\nWhile contemplating in his submersible, Joad reconsidered his attitude towards Kerra. Realizing that Kerra was intending to help him and their people, Joad regretted his hostility. He also recalled that he knew how to operate the submersible. As a symbolic gesture, he threw his Deluge capsules into the sea in the presence of Kerra and pledged to assist her in the evacuation efforts. However, instead of accompanying her, Joad dived into the stormy sea to reactivate the submersible's engines. Kerra was taken by surprise and was forced to continue alone in her efforts to evacuate a party of refugees to higher ground. With her starfighter overloaded with survivors, Kerra and the refugees were forced to seek shelter on a derelict building at Tarrah Hill, the highest physical point on Aquilaris. By then, the Stormdriver fleet had been deactivated due to an attack on the Voracious by Captain Devaad.\nAt that point, Joad surfaced his submersible and helped evacuate the refugees into its spacious hulls. When Padgett pointed out that the submersible did not have enough room for all the evacuees, Joad offered to evacuate the refugees to an underwater harvesting station. The submersible would then make several trips to rescue as many civilians as possible from the deluge. Joan reiterated that he needed manpower to help open the sea tunnels. Padgett replied that several Seacroppers among the refugees could assist with this operation. By the next morning, Joad and Kerra had helped evacuate thousands of refugees to safety underwater. Since Aquilaris Minor was not a populous world, the death toll had not been catastrophic. Kerra also reunited with Captain Devaad, who had escaped from Zodoh in a stolen starfighter. She had abandoned Grace Command's agenda of inundating entire worlds with Deluge and realized the need to help civilian populations in Sith Space. After Jenn revealed that Zodoh was planning to unleash the Stormdrivers on Darkknell , Kerra and Joad departed on a mission to stop the Hutt crimelord.\nMeanwhile, Joad and Padgett continued their evacuation operations. With the retreat of the Stormdrivers, the storms and flooding subsided, and the landscape began the process of drying. Following the defeat of Zodoh at the Battle of Darkknell, Kerra and Jenn returned to help Joad in the evacuation efforts. Having misled the Sith into believing that the planet was still completely submerged, Joad, Kerra, and Jenn planned to use Aquilaris as a major base for shuttling refugees out of Sith Space. Having stopped consuming Deluge, Joad was gradually recovering and reverting to his normal self, much to Kerra's delight. Jenn also planned to sabotage Operation Deluge by misleading her superiors into shipping their supplies to Aquilaris. En route, the drugs would be dumped into space and she would fly back with a shipload of refugees. While Joad had been unable to persuade Kerra to stay on Aquilaris to continue her anti-Sith crusade, he bore no ill will and accepted that everyone had different roles in serving the greater good.\nIn his childhood, Joad Kreel was an avid and enthusiastic Seacropper who had a keen interest in operating submersibles. He developed a close childhood friendship with the future Jedi Knight Kerra Holt, which continued even into adulthood. As a young adult, the poverty and deprivations experienced during the Sith occupations made him depressed and pessimistic. Unable to cope with the loss of his father, home and food, Joad turned to the addictive spice Deluge to alleviate his hunger pangs and misery. This left him disoriented and apathetic, which affected his reasoning.\nDuring the Great Aquilaris Deluge, Joad began to fight his addiction after being encouraged by his friend Kerra. His determination to regain control of his life and to apologize to Kerra for spurning her help initially led him to play an active role in the evacuation of Aquilarian civilians. Throughout the Deluge, Joad's mechanical savvy allowed him to operate the submersibles that evacuated thousands of civilians to underwater harvester stations. As he detoxified, Joad regained his confidence, energy and sense of purpose.\nJoad Kreel was a well-built and fit young man. He was a skilled Seacropper and specialized in operating submersibles. While the Deluge spice reduced his physical prowess and mental reasoning, he still retained much of his knowledge and skills as a Seacropper. His tech savvy with operating submersibles and harvester stations became crucial in saving the lives of countless Aquilarians during the Great Aquilaris Deluge.\nJoad Kreel was introduced as a key supporting character in the Deluge story arc of the Star Wars: Knight Errant comic series which debuted in August 2011. Miller developed Joad's story background, while he was drawn by Ivan Rodriguez and colored by Michael Atiyeh. He appears in all five issues within the Deluge story arc. According to Miller, Joad was the surname of the main protagonist in John Steinbeck's critically acclaimed novel The Grapes of Wrath. The lives of the Seacroppers were also based on the experiences of the characters in Steinbeck's novel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Aquilaris_Minor",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kerra_Holt",
  "/wiki/Planet/Legends",
  "/wiki/Devil_Squadron",
  "/wiki/1032_BBY/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Deluge",
  "/wiki/Hutt/Legends",
  "/wiki/Zodoh",
  "/wiki/Stormdriver",
  "/wiki/Padgett",
  "/wiki/Harvester_station",
  "/wiki/Republic_Dark_Age",
  "/wiki/Capital_Cay",
  "/wiki/Seacroppers%27_Guild",
  "/wiki/Seacropper_Submersible",
  "/wiki/1042_BBY",
  "/wiki/Chagras_Hegemony",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Odion",
  "/wiki/Aron_Holt",
  "/wiki/Mercia_Holt",
  "/wiki/University_of_Sanbra",
  "/wiki/Helm_of_Ieldis",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Ieldis",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Sanbra",
  "/wiki/Sith/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Vannar_Treece",
  "/wiki/Calimondra_family",
  "/wiki/Vilia_Calimondra",
  "/wiki/Massacre_of_Aquilaris",
  "/wiki/Project_Pandemonium",
  "/wiki/Joad_Kreel%27s_father",
  "/wiki/Slavery/Legends",
  "/wiki/Fleek_eel/Legends",
  "/wiki/Grace_Command",
  "/wiki/Alderaan/Legends",
  "/wiki/Operation_Deluge",
  "/wiki/Daiman",
  "/wiki/HoloNet/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Jenn_Devaad",
  "/wiki/Grumani_sector",
  "/wiki/Superweapon/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Fire_Lotus-class_starfighter",
  "/wiki/Death_Squadron/Legends",
  "/wiki/Voracious",
  "/wiki/Aquilaris_system",
  "/wiki/Mother_Grace",
  "/wiki/Vahss",
  "/wiki/Malakite",
  "/wiki/Heptooine",
  "/wiki/Daalang/Legends",
  "/wiki/Capture_of_Devil_Squadron",
  "/wiki/Airspeeder/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Tarrah_Hill",
  "/wiki/Zodoh%27s_twin-seater_starfighter",
  "/wiki/Darkknell/Legends",
  "/wiki/Battle_of_Darkknell",
  "/wiki/Great_Aquilaris_Deluge",
  "/wiki/Star_Wars:_Knight_Errant:_Deluge",
  "/wiki/Star_Wars:_Knight_Errant",
  "/wiki/August",
  "/wiki/2011",
  "/wiki/Ivan_Rodriguez",
  "/wiki/Michael_Atiyeh",
  "/wiki/Knight_Errant:_Deluge_1",
  "/wiki/Knight_Errant:_Deluge_2",
  "/wiki/Knight_Errant:_Deluge_3",
  "/wiki/Knight_Errant:_Deluge_4",
  "/wiki/Knight_Errant:_Deluge_5",
  "/wiki/Knight_Errant:_Escape_2",
  "/wiki/Knight_Errant:_Escape_4"
 ]
}