{
 "name": "Joclad_Danva",
 "display_name": "Joclad Danva",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Joclad Danva was a male Human Jedi Knight serving the Jedi Order and the Galactic Republic during the final years of the Republic Classic era. A master of the fighting technique called Teräs Käsi, Danva fought and died in the opening battle of the Clone Wars.\nDiscovered to be Force-sensitive early in his childhood, Danva was taken to the Coruscant Jedi Temple for training in the ways of the Force. Eventually graduating from the academy there, Danva was selected by a Jedi Master to become a Padawan and travel the galaxy studying the ways of the Jedi through active duty. Eventually passing his Trials of Knighthood, Danva was knighted and began his independent studies down the path of the Jedi Guardian. This further research led him to become a master of the martial arts form known as Teräs Käsi, a highly physical form of fighting. Combining this with his prowess in Form VI of lightsaber combat, Danva was a formidable opponent in a fight.\nOften traveling to Bunduki to participate in the Teräs Käsi matches held there annually, Danva refrained from using the Force against his opponents as he believed that gave him an unfair advantage. This was accomplished by self-severing his connection to the Force, a rare Jedi technique. During the 22 BBY annual Palawa Band Teräs Käsi tournament on Bunduki, Danva and the non-Force-sensitive martial artist Phow Ji were the last two contestants standing, having won all other combat sessions. In a heated final match that spanned nearly an hour, Danva was defeated by Ji, who took the victory as proof that the Force did not exist. Returning to the Jedi Temple after the competition, Danva was summoned by Master of the Order Mace Windu to join a massive Jedi strike team that was headed for Geonosis. Joining his fellow Jedi, Danva flew out to Geonosis and set his starfighter down in the dusty plains of the world, before marching into the Petranaki arena where Jedi Obi-Wan Kenobi, Anakin Skywalker, and Senator Padmé Amidala were being prepared for execution by the Confederacy of Independent Systems.\nFollowing Windu's cue, Danva and the other Jedi spread throughout the arena ignited their lightsabers and began cutting down the hordes of battle droids filling the arena. After a great battle on the arena floor, Danva and the twenty-some Jedi left standing received an ultimatum from Confederacy leader Count Dooku: surrender and join him, or die. Choosing to take their chances with the battle droids, the Jedi prepared to fight to the death when Grand Master Yoda arrived with the Grand Army of the Republic. Danva had the chance to reach a ship and escape the arena, but died whilst attempting to escape.\nJoclad Danva was known for his fighting prowess, both armed with two lightsabers and with his bare hands. A lightsaber enthusiast, he was an extremely skilled practitioner of Niman and Jar'Kai, considered to be one of the most powerful duelists in the Jedi Order. Such was his skill, that many of his sparring matches were recorded in the archives of the Jedi Order, and he could hold his own against the majority of Jedi in combat. Danva was an authority in the Order on the hand-to-hand discipline known as Teräs Käsi, and was a highly proficient martial artist.\nJoclad Danva was portrayed by Kyle Rowling, the partial dueling and stunt double for Christopher Lee  and Samuel L. Jackson  in Attack of the Clones and Revenge of the Sith, respectively.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Ter%C3%A4s_K%C3%A4si/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Form_VI/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/File:Girljedi.jpg",
  "/wiki/Bunduki/Legends",
  "/wiki/Palawa_Band",
  "/wiki/Phow_Ji",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/Starfighter/Legends",
  "/wiki/Petranaki_arena",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/File:Joclad_Danva_TLC.jpg",
  "/wiki/Kyle_Rowling",
  "/wiki/Christopher_Lee",
  "/wiki/Samuel_L._Jackson",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_55",
  "/wiki/MedStar_I:_Battle_Surgeons",
  "/wiki/MedStar_II:_Jedi_Healer",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/Threats_of_the_Galaxy",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Mysteries_of_the_Jedi",
  "/wiki/Sports_in_the_Star_Wars_Galaxy",
  "/wiki/Encyclopedia_(StarWars.com)"
 ]
}