{
 "name": "Jogg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Al'doleem"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tholothian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jogg and Mareena's garage"
     ]
    }
   ]
  }
 ],
 "content": "Jogg was a male Tholothian mechanic who lived on the river moon of Al'doleem.\nYears prior to the Imperial Era, he married Mareena and started a garage on the river moon of Al'doleem. At some point, Kirak Infil'a visited the garage after taking the barash vow and paid them to store his ship there. Sometime afterward, Jogg had two children, Colli and his sister.\nIn 19 BBY, he heard voices while babysitting his child, and asked Mareena what was going on. Mareena told him that Infil'a was back, shocking Jogg as it had been years since he'd seen him. Jogg and Mareena began repairing Infil'a's ship while he told them the mysteries of the Force. Colli was in wonder that Infil'a could lift heavy items, as she said that Jogg couldn't lift them without help, but he replied that the Force made all things light. However, he felt Darth Vader's presence and dropped all of the materials, worrying everyone. He ran outside to check, while Vader challenged Infil'a to a lightsaber duel. The whole family got out and stared at the two, while Infil'a ordered them to get back inside and fix the ship, which they did.\nDue to Ki'rak's warning, the ship was ready for launch by the time the city began to flood shortly after, allowing him and Mareena to put their two children into the ship and save them from the waters despite Jogg and Mareena being forced to be left behind and perish from the flood themselves.\nJogg had light skin. Like all Tholothians, he wore a Tholoth headdress. He didn't believe that the Jedi were traitors, and respected Kirak Infil'a.\nJogg specialized in mechanics, opening his own garage on the river moon of Al'doleem and helped fix Infil'a's ship.\nJogg first appeared in Darth Vader  4, a 2017 canon comic written by Charles Soule and penciled by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/19_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Al%27doleem",
  "/wiki/Tholothian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jogg_and_Mareena%27s_garage",
  "/wiki/Technician",
  "/wiki/Standard_year",
  "/wiki/Imperial_Era",
  "/wiki/Mareena",
  "/wiki/Kirak_Infil%27a",
  "/wiki/Barash_vow",
  "/wiki/Kirak_Infil%27a%27s_Delta-7_Aethersprite-class_light_interceptor",
  "/wiki/Colli",
  "/wiki/Colli%27s_sister",
  "/wiki/Starship",
  "/wiki/The_Force",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Al%27doleem",
  "/wiki/Lightsaber_duel",
  "/wiki/Am%27balaar_City",
  "/wiki/Tholoth_headdress",
  "/wiki/Jedi",
  "/wiki/Moon",
  "/wiki/Darth_Vader_(2017)_4",
  "/wiki/2017",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Star_Wars_(2020)_19"
 ]
}