{
 "name": "John_D._Branon",
 "display_name": "John D. Branon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "John D. Branon was a human male rebel pilot who was a member of the Rebel Alliance during the Galactic Civil War. While stationed on Yavin 4, Branon was curious to learn what had occurred between fellow pilots Col Takbright and Luke Skywalker in General Jan Dodonna's briefing prior to the Battle of Yavin, which involved destroying the Death Star superweapon with a precise hit from a proton torpedo.\nHe was later selected to participate in the battle as part of Red Squadron, under the callsign Red Four, by the squadron's leader, Garven Dreis. During the battle, Branon came under fire by a TIE fighter, and was killed when it shot down his X-wing.\nDuring the Imperial Era, John D. Branon was a young pilot who was a member of the Rebel Alliance during the Galactic Civil War. By 0 BBY, he was considered a veteran by the pilots of Red Squadron, and was stationed at their base on the moon Yavin 4. He—along with fellow pilots Puck Naeco, General Antoc Merrick, and Red Squadron's leader, Garven Dreis—would lecture fellow Red Squadron member Col Takbright after his hotheaded outbursts.\nShortly after the Battle of Scarif, in which the technical readouts of the Death Star battle station were stolen by the Rebel Alliance, General Jan Dodonna assembled the Yavin pilots and briefed them on how they would destroy the superweapon; the pilots would exploit a two meter–wide thermal exhaust port to cause a cataclysmic main reactor failure. The Death Star was rapidly approaching Yavin 4 and threatened to destroy the base, thus necessitating its destruction. The pilots, including Branon, Naeco, Takbright, and Theron Nett, then gathered in the squadron's ready room, waiting to receive their assignments and man their starfighters. When Naeco teased Takbright regarding his nickname, \"Fake Wedge,\" Branon and Nett exchanged an amused glance. Afterwards, the pilots discussed the chances of successfully destroying the Death Star with a precise hit from a proton torpedo.\nBranon asked Takbright what the squadron's newest pilot, Luke Skywalker, had told him during the briefing; Takbright replied that he himself had loudly stated that it was impossible to score a hit on a two-meter target with, even with a computer. Takbright then asked Branon if he had the same doubts about the mission, to which Branon was ambivalent. As more pilots entered the room, Takbright told Branon to forget whatever had happened during the briefing. However, Branon was still insistent on learning what Skywalker had said, and Takbright finally relented; he revealed that Skywalker used to hunt womp rats in his T-16 skyhopper. After Dreis arrived, Branon was selected to fly in the attack on the battle station under the callsign Red Four alongside Harb Binli, flying as Red Seven. They were both chosen to serve as wingmen to Major Ralo Surrel, who was given the callsign Red Eleven.\nAfter preparations were complete, the pilots of both Red Squadron and Gold Squadron entered their respective X-wings and Y-wings and took off from the Yavin 4 base to begin the Battle of Yavin. As the pilots approached the Death Star in the Yavin system, Red Squadron broke away from the formation to draw the Death Star's turbolaser fire away from Gold Squadron while the latter began their attack run in the superweapon's meridian trench. During the battle, the Empire scrambled several TIE fighters to engage them.\nAs the TIEs neared the rebel craft, Branon and Nett were targeted early in the attack. Branon then came under fire from one of the Imperial craft. Attempting to evade the enemy fighter on his tail, he was shot down and killed as his X-wing burst into flames. he was the first Red Squadron pilot to be hit by TIE fire during the battle, and most of the squadron also lost their lives in the engagement, including Dreis, Nett, Naeco, and Branon's fellow squadron members Surrel and Binli. During the battle, Branon's death was reported by a control officer back at the Yavin 4 base. The officer's communication log was included in a partial transcript of recordings from the base's war room that was later added to a collection of documents known as The Rebel Files. Ultimately, the rebels emerged victorious when Skywalker, who flew as Red Five, managed to score a precise hit on the Death Star's thermal exhaust port and obliterate the superweapon completely.\nBranon's participation in the battle marked him as a rebel hero, with his callsign going along with the legend. In 1 ABY, Skywalker and fellow rebels Han Solo, Wedge Antilles, Zev Senesca, Derek Klivian, and Chewbacca raised a toast at Mess Hall IV in the Mako-Ta Space Docks to honor the deceased members of Red Squadron, including Branon.\nBranon was a human male with light skin. Shrewd and rigorous, he was cautious and was not overly optimistic towards the rebels' chances against the Death Star. Branon also showed an inquisitive side, curious to know what had happened in the briefing room between Takbright and Skywalker, much to the irritation of the former, who likened him to a \"nek with a bone.\" He would also lecture Takbright afterwards and had a silent way of sternly calming the hotheaded pilot down. Like other Rebel Alliance personnel, he realized that the the galaxy would be left in fear if the Death Star continued fully functioning, and hoped that General Dodonna's plan to destroy the superweapon would succeed.\nBranon was considered by the rebels at the Yavin 4 base to be a veteran pilot. He had above-average intelligence, diplomacy skills, strength, speed, and fighting ability. He was not Force-sensitive.\nAt the time of his death, Branon flew a T-65 X-wing. He wore an orange and white-colored flight suit and a K-22995 light flight helmet colored red and white.\nJohn D. Branon was portrayed by Jack Klaff in the 1977 original trilogy film, Star Wars: Episode IV A New Hope, credited as \"Red Four .\" His surname \"Branon\" was identified in the new Star Wars canon by the 2015 digital trading card application, Star Wars: Card Trader. In the Star Wars Legends continuity, the surname originated from Michael Knight's 2006 strategy guide Star Wars: Empire at War: Prima Official Game Guide, and Branon also appeared prior to A New Hope in the 1976 novelization of the film, written by Alan Dean Foster. The character was presumed to be named after special-effects supervisor John Dykstra.\nAccording to Klaff, he did not audition for the role of Branon and received it when a fan of his who also served as a casting director for A New Hope cast a group of people, including Klaff, to play the pilots in the film. When cast for the role of Branon, Star Wars creator George Lucas approached Klaff, and asked him if he would mind if they blew him up. When Klaff agreed to play the character, Branon's death scene was filmed in a matter of minutes at Stage 8 of Elstree Studios, London within the \"Interior cockpit with blue backing\" set at some point between June 28 and 29, 1976.\nOriginally, Klaff, whose character's designation was Blue Six in the script, was going to film his scenes with front projection, but Lucas decided to switch to a blue screen, and the character's callsign was changed to Red Four in post-production. During filming, the actor was placed in a cockpit set that rocked around in front of the blue screen, emulating the movement of the X-wing. After filming the scene, a wet cloth was placed over his face to clean the fumes that resulted from the X-wing's explosion. The character also had additional dialogue where he reported his callsign prior to the battle and exclaimed that he had downed a TIE fighter before being shot down, but they were subsequently cut from the film.\nThe annotations of special effects photographer Richard Edlund on artist Joe Johnston's storyboards for the film revealed that a pilot named \"Chewie\" in the third draft had its role divided into both Branon and Wedge Antilles due to the fact that the character of Chewbacca was also called by that name. In the storyboards, Branon is mentioned to have a scar across one eye and adjusted his targeting device during the battle, both of which are not shown in the film itself.\nSome fans believed that Klaff portrayed the character of Wedge Antilles in the briefing room scene, who was nicknamed \"Fake Wedge.\" While Antilles was played by Denis Lawson in the Battle of Yavin scenes, Lucasfilm Story Group member Pablo Hidalgo revealed that the character in the briefing room was not actually portrayed by Klaff, but by actor Colin Higgins. The 2017 short story \"Duty Roster,\" published in the anthology From a Certain Point of View, later retconned Higgins' role as Antilles into a separate character, Col Takbright.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/John_D._Branon",
  "/wiki/John_D._Branon/Legends",
  "/wiki/0_BBY",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Rebel_pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Yavin_4",
  "/wiki/Col_Takbright",
  "/wiki/Luke_Skywalker",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Proton_torpedo",
  "/wiki/Red_Squadron",
  "/wiki/Callsign",
  "/wiki/Red_Four",
  "/wiki/Squadron",
  "/wiki/Garven_Dreis",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Death",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Imperial_Era",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Pilot",
  "/wiki/Puck_Naeco",
  "/wiki/Antoc_Merrick",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Battle_station",
  "/wiki/Meter",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Reactor",
  "/wiki/Theron_Nett",
  "/wiki/Starfighter",
  "/wiki/Computer",
  "/wiki/Womp_rat",
  "/wiki/T-16_skyhopper",
  "/wiki/Harb_Binli",
  "/wiki/Red_Seven",
  "/wiki/Wingmate",
  "/wiki/Major",
  "/wiki/Ralo_Surrel",
  "/wiki/Red_Eleven",
  "/wiki/File:ImHit-ANH.ogg",
  "/wiki/Gold_Squadron",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Death_Star",
  "/wiki/Turbolaser",
  "/wiki/Meridian_trench",
  "/wiki/Galactic_Empire",
  "/wiki/TIE_line",
  "/wiki/X-wing_starfighter",
  "/wiki/Fire",
  "/wiki/Unidentified_control_officer",
  "/wiki/Officer",
  "/wiki/The_Rebel_Files",
  "/wiki/Red_Five",
  "/wiki/1_ABY",
  "/wiki/Han_Solo",
  "/wiki/Wedge_Antilles",
  "/wiki/Zev_Senesca",
  "/wiki/Derek_Klivian",
  "/wiki/Chewbacca",
  "/wiki/Mess_Hall_IV",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Nek",
  "/wiki/Bone",
  "/wiki/The_galaxy",
  "/wiki/Diplomat",
  "/wiki/Force-sensitive",
  "/wiki/Time",
  "/wiki/Flight_suit",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Jack_Klaff",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars",
  "/wiki/2015",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Legends",
  "/wiki/Michael_Knight",
  "/wiki/2006",
  "/wiki/Star_Wars:_Empire_at_War:_Prima_Official_Game_Guide",
  "/wiki/1976",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Alan_Dean_Foster",
  "/wiki/John_Dykstra",
  "/wiki/George_Lucas",
  "/wiki/Elstree_Studios",
  "/wiki/June_28",
  "/wiki/June_29",
  "/wiki/Richard_Edlund",
  "/wiki/Joe_Johnston",
  "/wiki/Denis_Lawson",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Colin_Higgins",
  "/wiki/2017",
  "/wiki/Duty_Roster",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Retcon",
  "/wiki/Category:Images_of_John_D._Branon",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars_Insider",
  "/wiki/My_Star_Wars",
  "/wiki/Star_Wars_Insider_163",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/2018_Topps_Star_Wars_Black_%26_White:_A_New_Hope",
  "/wiki/2018_Topps_Star_Wars_Galactic_Files",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/The_Rise_of_the_Rebellion_and_the_Battle_of_Yavin",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Red_Four_(Red_Flight)",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Bela_Elar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Standard_year",
  "/wiki/Star_Wars_(2015)_43",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Pirates_of_the_Boards",
  "/wiki/Star_Wars_Insider_95",
  "/wiki/January_16",
  "/wiki/2004",
  "/wiki/February_24",
  "/wiki/2020",
  "/wiki/May_The_Facts_Be_With_You:_Part_Two",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Mysteries",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Choose_Your_Destiny:_A_Luke_%26_Leia_Adventure"
 ]
}