{
 "name": "Jol Bengim",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chevin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Jol Bengim was a Chevin male who at one time encountered slavers and slave labor camps on Vinsoth. He later came to live in the settlement of Reestkii on the desert planet Jakku. Sometime after the Battle of Endor, Reestkii was overun by Zygerrian slavers who rounded up Bengim and the other residents and locked them in the town hall. As the settlement residents waited to learn their fate Bengim and some of the others began complaining that they were doomed. In order to keep the children present calm, the Nu-Cosian pet-seller Bobbajo began telling a story about how he and his animal companions had escaped the Death Star during the Battle of Yavin. Part way through the story Bengim interrupted and disputed its accuracy, but the disruption meant the children were no longer distracted from the slavers and the Ongree child Adlee became upset. Bobbajo quickly resumed his story, but Bengim soon interrupted again, this time in outrage when a stormtrooper in the tale dropped the slitherette character Mideyean into a garbage compactor. When Bobbajo then finished the tale, Bengim and the other adults approached him and complimented his storytelling, but demanded to know if the story was true. Bobbajo admitted it was just a story, and then opened to doors to the town hall and revealed that the slavers had been subdued by unknown forces, leaving the citizens of Reestkii to claim their hoarded wealth.\nJol Bengim first appeared in the short story \"All Creatures Great and Small,\" which was written by Landry Q. Walker and published as an eBook.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chevin",
  "/wiki/Gender",
  "/wiki/Slaver",
  "/wiki/Labor_camp",
  "/wiki/Vinsoth",
  "/wiki/Reestkii",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Jakku",
  "/wiki/Battle_of_Endor",
  "/wiki/Zygerrian",
  "/wiki/Slavery",
  "/wiki/Reestkii_town_hall",
  "/wiki/Nu-Cosian",
  "/wiki/Bobbajo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Ongree",
  "/wiki/Adlee",
  "/wiki/Stormtrooper",
  "/wiki/Slitherette",
  "/wiki/Mideyean",
  "/wiki/Garbage_compactor",
  "/wiki/All_Creatures_Great_and_Small",
  "/wiki/Landry_Q._Walker",
  "/wiki/EBook",
  "/wiki/Tales_from_a_Galaxy_Far,_Far_Away:_Aliens:_Volume_I"
 ]
}