{
 "name": "Jollo",
 "display_name": "Jollo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic eye replacements"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Shroud's syndicate",
      "Eternal Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Jollo was a male Twi'lek living during the Galactic War. At some point after 3636 BBY he applied for a job as a janitor for the Shroud's syndicate, attracted by the benefits it offered. Though the job description required to remove his eyes and he had to pass through twenty interviews, Jollo eventually got the job, and was assigned to the volcano level of The Coil, the Shroud's latest base on Obus VI.\nIn 3630 BBY, while cleaning the base with a vibromop, Jollo encountered the droid HK-55, who escaped the captivity and was in the process of tearing the place apart. Classified as non-combatant, Jollo was subdued and left tied up to a chair. The droid's rampage soon resulted in destruction of the underwater and the asteroid levels of the Coil, but Jollo survived on the volcano level, which was not affected. Eventually he was found by people Bey'wan Aygo sent to examine whether the rest of the base could be repurposed for the Anti-Zakuul Alliance. Jollo was offered to join the Alliance and expressed the desire to eventually purchase the Coil for himself.\nJollo appears in Star Wars: The Old Republic: Knights of the Fallen Empire during the Interlude: Shroud of Memory. Players may decide to kill him, in which case they will not receive him as a stronghold decoration.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/The_Shroud%27s_syndicate",
  "/wiki/Eternal_Alliance",
  "/wiki/Galactic_War",
  "/wiki/3636_BBY",
  "/wiki/Janitor/Legends",
  "/wiki/The_Coil_(Obus_VI)",
  "/wiki/The_Shroud",
  "/wiki/Obus_VI",
  "/wiki/3630_BBY",
  "/wiki/Vibromop",
  "/wiki/HK-55",
  "/wiki/Asteroid/Legends",
  "/wiki/Bey%27wan_Aygo",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Death/Legends"
 ]
}