{
 "name": "Jollin_Resbin",
 "display_name": "Jollin Resbin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sneevel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Jollin Resbin was a male Sneevel senator who represented the planet Sneeve in the Republic Senate during the Separatist Crisis, when several worlds began to secede from the Republic. In 22 BBY, Resbin supported the Military Creation Act, a piece of legislation considered by the Senate that would create an army for the Republic. Seven days prior to the scheduled final vote on the act, Resbin managed to secure the endorsement of the retired Sneevel podracer Boles Roor. However, the act never came to a vote—a few days before the scheduled final vote, a Separatist army was discovered on the planet Geonosis, resulting in the Clone Wars.\nSenator Jollin Resbin was a male Sneevel who represented his species' homeworld of Sneeve and the Kastolar sector in the Senate of the Galactic Republic during the Separatist Crisis, when a variety of planets and corporations began to secede from the Republic. During this time, Resbin supported the Military Creation Act, a piece of legislation in the Senate that would form an army for the Republic if passed.\nIn 22 BBY, seven days prior to the scheduled final vote on the Military Creation Act, Resbin managed to gain the support of retired podracing champion and fellow Sneevel Boles Roor as a part of his pro-act campaign. Roor appeared in several holographic endorsement commercials for Resbin supporting the Military Creation Act, which aired in the Kastolar sector. Roor even came out of retirement for Resbin, scheduling himself to compete in a series of charity podraces throughout the Mid Rim to spread support for the Military Creation Act. One of the races was the Basoor Challenge, which was scheduled to take place the same day as the final vote. Resbin's campaigning was later reported on by the HoloNet News.\nHowever, prior to the final vote, Jedi Knight Obi-Wan Kenobi discovered a clone army being built for the Republic on the world of Kamino. Kenobi also discovered that over two thousand star systems that had seceded from the Republic had formed the Confederacy of Independent Systems and were building their own droid army on the planet Geonosis, planning to attack the Republic. The Republic quickly adopted the clone army as its own in response, negating the need for the Military Creation Act and leading to the Clone Wars between the two factions.\nJollin Resbin was a Militarist—one who supported the Military Creation Act—and was willing to campaign in his home sector to gain support for the act. He was also influential and powerful enough to gain the support of the famous podracer Boles Roor.\nJollin Resbin was first mentioned in the in-universe HoloNet News Vol. 531 55 article Campaigning Reports from the Mid Rim. The HoloNet News volume was released on May 9, 2002. Resbin was later given an entry in The Complete Star Wars Encyclopedia, published December 9, 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sneevel/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sneeve/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Military_Creation_Act/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Boles_Roor/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Kastolar_sector",
  "/wiki/Time/Legends",
  "/wiki/Army/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Basoor_Challenge",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Militarists/Legends",
  "/wiki/In-universe",
  "/wiki/HoloNet_News_Vol._531_55",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/May_9",
  "/wiki/2002",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/December_9",
  "/wiki/2008",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}