{
 "name": "Jomar_Chul",
 "display_name": "Jomar Chul",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jomar Chul was a Zabrak male Jedi Knight who served the Jedi Order during the Cold War and the Galactic War between the Galactic Republic and the resurgent Sith Empire. He was very skilled in collecting information and infiltrating hostile territories.\nIn 3642 BBY, he met the Hero of Tython on Tatooine when Chul's ship was shot down while scouting the Dromund system. Recognizing the Knight as the Hero of Tython, Chul thanked the Hero for the help and contacted the Kel Dor Jedi Master Tol Braga. He reported his crash and injury to Braga, who ordered Chul to give the Hero the sensor logs which Chul was supposed to deliver and to wait for a medical shuttle.\nLater Jomar and Jedi Master Jaric Kaedan were deeply worried for the plan of the Hero and Master Tol Braga to redeem the Sith Emperor. Jomar explained that while performing a healing meditation, he had a vision of the Hero falling to the dark side and strongly insisted that the Hero not join Braga's team. Braga dismissed his concerns, stating that the future is always in motion and the Council does not pass judgment based on visions. As the Jedi Council chose to authorize the mission, Jomar stormed out, frustrated that they would not heed his warnings.\nWhen Braga's team did not return, Jomar began searching for evidence that his vision was true. Eventually, he infiltrated the space station, Korriban's Flame, where high ranking Sith Lords were gathering. However, he was captured by Leeha Narezz, one of those who had come with Master Braga and that the Emperor brainwashed her to serve him instead. When the Hero arrived to rescue Jomar, Narezz began to taunt Chul about their secret relationship when the Zabrak begged the Hero not to harm Narezz. After Narezz was beaten and cried out in fear, Chul pulled his lover gently to her feet and quietly asked the Knight not to reveal their relationship to the Council before warning his fellow Jedi that he had overheard Narezz giving orders to a Sith Lord named Fulminiss on the planet Voss.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/3642_BBY",
  "/wiki/Hero_of_Tython",
  "/wiki/Tatooine/Legends",
  "/wiki/Skirmish_in_the_Jundland_Wastes_canyon",
  "/wiki/Dromund_system",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jaric_Kaedan",
  "/wiki/Tol_Braga",
  "/wiki/Tenebrae",
  "/wiki/Space_station/Legends",
  "/wiki/Korriban%27s_Flame",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Leeha_Narezz",
  "/wiki/Fulminiss",
  "/wiki/Planet/Legends",
  "/wiki/Voss",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}