{
 "name": "Jommillia",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Jommillia was a fierce Wookiee warrior on Yavin. Jommillia wore a plumed decorative helmet and armed himself with a battleaxe and spear.\nWhen Annikin Starkiller was carried to the Wookiee settlement by Chewbacca, he awoke in a circle of curious aliens. Jommillia saw the interloper as a chance to fight, an activity the Wookiee greatly enjoyed. He put on a show, intending to intimidate or provoke the young Jedi.\nAnnikin threatened and insulted the Wookiee in a variety of tongues, though this was ineffective, as they had no languages in common. Finally, the Wookiee threw his axe at Annikin, who, using the force, easily caught it.\nA scuffle ensued, and Jommillia's spear was broken. Annikin was hit on the head. Before anyone can be seriously injured, Chewbacca's father, Auzituck, the chief of the Kaapauku  tribe intervened and ended the fight, impressed by Annikin's prowess.\nIt was inclear what happened to Jommillia later, though the Wookiees tribe joined in an attack on the Imperial Massassi Outpost and manned starfighters in the attack on the Death Star.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Helmet",
  "/wiki/Axe",
  "/wiki/Spear/Legends",
  "/wiki/Annikin_Starkiller",
  "/wiki/Chewbacca/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Attichitcuk/Legends",
  "/wiki/Kaapauku",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Great_Temple/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Ewok/Legends",
  "/wiki/Merumeru/Legends",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film"
 ]
}