{
 "name": "Jon Wittick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 231 BBY",
      "Restitution"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Correctional Alliance",
      "Republic Correctional Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Jon Wittick was a human male who held the title of Councilor on the Galactic Republic prison ship Restitution. After, Lourna Dee, Tempest Runner of the Nihil marauder organization, was captured at the Battle of Galov and imprisoned aboard the Restitution—albeit under a false name, with the Republic unaware who she truly was—Wittick took an interest in her case, believing he could help her change her ways. Dee eventually revealed her true identity to Wittick, asking for his help. Wittick, respecting her trust, kept her identity a secret, attempting to keep assisting her in her endeavor to change.\nHowever, Wittick's efforts were disrupted when Dee's rival, former Tempest Runner Pan Eyta, attacked the Restitution. During the attack, Wittick, Dee, and her associates were able to defeat Eyta and the attacking Nihil, but Dee refused to kill Eyta, leaving him to be taken into custody. Though the Nihil attack had been stopped, a number of those aboard the Restitution had been killed, with Wittick being the only surviving guard. After external communications were reactivated, the prison ship picked up an emergency signal from surviving Tempest Runner Zeetar. Dee, having heard the message, saw an opportunity to rejoin the Nihil; she broadcast her execution of Eyta to the rest of the ship, declaring that the surviving prisoners could join her. Both Wittick and Sestin Blin, a fellow prisoner who had become previously become close with Dee, protested. With only one shot left in her blaster, Dee shot Wittick over Sestin, saving the latter by ejecting her in an escape pod. Dee subsequently took command of the Restitution, naming it the Lourna Dee after herself and her former flagship, and returned to the Nihil.\nWittick expressed a strong need to have faith in Supreme Chancellor Lina Soh's reform agenda, including the ability to rehabilitate prisoners. When Lourna Dee came clean about her identity to Wittick, he continued to play along with her pseudonym \"Sal Krost\" in public and tried to help her reform.\nJon Wittick was voiced by Dan Bittner in the audio drama The High Republic: Tempest Runner, written by Cavan Scott and released on August 31, 2021. First revealed on a cast list for the audio drama on StarWars.com on July 28, 2021, Wittick was only listed by his surname, with Tempest Runner itself providing his forename, the spelling of which was confirmed in the 2022 script release of the audio drama.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/231_BBY",
  "/wiki/Lourna_Dee_(prison_ship)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Correctional_Alliance",
  "/wiki/Councillor",
  "/wiki/Prison_ship",
  "/wiki/Lourna_Dee",
  "/wiki/Tempest_Runner",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Battle_of_Galov",
  "/wiki/Prison",
  "/wiki/Pan_Eyta",
  "/wiki/Attack_on_the_Restitution",
  "/wiki/Death",
  "/wiki/Zeetar",
  "/wiki/Sestin_Blin",
  "/wiki/Blaster",
  "/wiki/Escape_pod",
  "/wiki/Lourna_Dee_(cruiser)",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Great_Works",
  "/wiki/Dan_Bittner",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Cavan_Scott",
  "/wiki/August_31",
  "/wiki/2021",
  "/wiki/StarWars.com",
  "/wiki/July_28",
  "/wiki/2022",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Attack_on_Valo",
  "/wiki/Battle_of_Grizal",
  "/wiki/Standard_month",
  "/wiki/Standard_year"
 ]
}