{
 "name": "Jonah_Carter",
 "display_name": "Jonah Carter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Jonah Carter was a male Human Commissioner of the Corellian Security Force during the Cold War and the renewed conflict between the reconstituted Sith Empire and the Galactic Republic.\nJonah Carter was a paladin of the brave Corellian people against the criminal scum and the corrupt officials within CorSec and the government. Having survived the political purge that preceded the Imperial takeover of the Corellian government, Commissioner Carter had become a leader of the civilian resistance attempting to push them off of the planet during the Battle of Corellia.\nIn the end, the Sith Lord Darth Tormen sent a famous bounty hunter after him. Upon being confronted in CorSec HQ, Carter assumed that the Hunter was sent to kill him and warned the mercenary that the Corellian people would be rioting in the streets as a result. However, the Hunter revealed that killing him was not the objective. Guessing that the hunter was working for the Empire, Carter grimly reminded the Hunter that their employers were not common criminals but despots. He warns that if he was taken down, Corellia would be forced to bow before the Sith and asked if the Hunter's conscience was wiped clean by their credits. The Hunter stated that it would be better than Corellians being massacred. Carter then took the opportunity to jump out of the way as his men in the upper levels dropped a flash grenade that briefly blinded the Hunter and their companion. Despite having the initial advantage, Carter and his men were defeated. Acknowledging that he was beaten, Carter told the Hunter that Corellia would outlast the Empire, but his opponent did not care for his idealism and froze him in carbonite. Upon being delivered to Darth Tormen, the Sith Lord unfroze the commissioner and forced him into signing a treaty dictating Corellia's secession from the Republic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Carter",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Commissioner_(Corellian_Security_Force)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Tormen",
  "/wiki/Hunter_(individual)",
  "/wiki/One_CorSec_Plaza",
  "/wiki/Mercenary/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}