{
 "name": "Jonas Davan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Jonas Davan was a male Human major who worked at the Chandrilan Embassy on Coruscant at the time of the destruction of Alderaan.\nJonas Davan was an honored veteran of the Clone Wars. Due to war injuries, fifty percent of his body had required cybernetic replacements. About twenty years after the war, Davan was in charge of the Second Bureau at the Chandrilan Embassy on Coruscant, thus directing the spies. He died in 0 BBY when Imperial forces attacked the embassy.\nDavan was not very talkative but fundamentally humanist. He was always calm and all of his reactions were controlled, invariably causing discomfort to his interlocutors. His extensive prosthetic replacements—his legs and right arm, as well as the right side of his face and some internal organs—probably added to those sensations.\nDavan was considered very dangerous by the Galactic Empire, which he was aware of, along with the fact that he would never leave the embassy alive when the Imperial troops arrived.\nMajor Davan has only appeared in the French RPG magazine Casus Belli HS24.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Davan_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Major/Legends",
  "/wiki/Chandrilan_Embassy",
  "/wiki/Coruscant/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Second_Bureau",
  "/wiki/Spy/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jonas_Davan",
  "/wiki/Casus_Belli_HS24",
  "/wiki/Jennie_Pickalho",
  "/wiki/Limb/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Casus_Belli",
  "/wiki/Il_faut_sauver_Miss_Pickalho"
 ]
}