{
 "name": "Jonner_Jin",
 "display_name": "Jonner Jin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mykapo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mykapo insurgents",
      "Phoenix Cell",
      "Iron Squadron",
      "Iron Squadron",
      "Alliance to Restore the Republic",
      "Massassi Group",
      "Massassi Group"
     ]
    }
   ]
  }
 ],
 "content": "Jonner Jin was a human male member of Iron Squadron, a local rebel cell based on the planet Mykapo. In 2 BBY, Jonner and his fellow rebels were involved in a skirmish with an Imperial advance patrol. The Iron Squadron was assisted by the Spectres and the Phoenix Cell, who had come to evacuate civilians from Mykapo. While the Iron Squadron initially declined the Spectres' advice to leave the system before Imperial reinforcements arrived, Jonner along with Gooti Terez and R3-A3 saw reason and departed with them. However, their captain, Mart Mattin, stayed behind to fight the Imperials. Jonner, Gooti, R3-A3 and the Spectres later joined forces in a successful mission to rescue Mart. As a result, the Iron Squadron joined the rebellion.\nJonner Jin joined the Iron Squadron during the Age of the Empire. The Iron Squadron was a local rebel cell based at Mykapo and consisted of the humans Mart Mattin, Mart's father, the Theelin Gooti Terez, and the astromech droid R3-A3. The Iron Squadron operated from a YT-2400 light freighter called the Sato's Hammer. After Mart's father died, Mart assumed leadership of the cell. Mart was not interested in the wider rebellion and did not keep in touch with his uncle Commander Jun Sato, the leader of the Phoenix Cell. The Iron Squadron harried Imperial forces in the system.\nIn 2 BBY, the Galactic Empire imposed martial law on Mykapo. The Iron Squadron clashed with an Imperial advance patrol. During the skirmish, the Iron Squadron's hyperdrive sustained damaged. Shortly later, the Spectres and Phoenix Squadron arrived to evacuate rebel sympathizers on Mykapo. The Spectres' ship Ghost managed to destroy the TIE fighters attacking Sato's Hammer. This enabled Iron Squadron to destroy the Imperial Gozanti-class cruiser with explosives. Following the skirmish, Mart invited the Spectres' leader Hera Syndulla and her crew to meet with the Iron Squadron.\nJonner and Gooti welcomed Hera and her crew, Ezra Bridger, Sabine Wren, and the astromech droid Chopper, aboard their ship. When Sabine noted the rundown state of the freighter, Jonner replied that they did not need a hyperdrive. He led the Spectres to their captain, Mart, who was waiting in the cockpit. Jonner sided with his captain when the latter objected to Hera's advice that they leave the system before Imperial reinforcements arrive. He even mockingly asked what \"evacuate\" meant with Mart saying that it meant running away like a coward. He also expressed his unwillingness to listen to Hera's arguments. With the two sides unable to agree, Hera and her crew left the Sato's Hammer and returned to the Ghost. Ezra managed to convince Hera to let him, Sabine, and Chopper stay behind so that they could repair the Iron Squadron's hyperdrive as a means of winning them over. Hera agreed but warned them that they had to leave on the shuttle Phantom II at the first sign of Imperial activity.\nJonner and Gooti watched while R3-A3, Sabine, and Chopper repaired the hyperdrive. Mart thought it was a waste of time and returned to the cockpit. When Ezra advised Jonner and Gooti that they had to be ready to leave if they could not fix the hyperdrive, the two Iron Squadron members expressed an unwillingness to leave their captain and their home. Ezra then responded that they had to choose their battles carefully. R3, Sabine, and Chopper managed to repair the hyperdrive but their efforts came to naught when Mart redirected the power to the ship's laser cannons and deflector shields. Jonner and the other rebels quickly discovered that Imperial reinforcements under Admiral Kassius Konstantine had exited hyperspace. Upon seeing Konstantine's forces, Jonner and Gooti realized they were outgunned and outnumbered.\nHe and Gooti tried to reason with Mart but their captain was determined to fight the Empire. After the ship's power broke down, Mart ordered an evacuation. Jonner, Gooti, R3-A3, and the Spectres fled aboard the Phantom II but Mart changed his mind and decided to fight Konstantine's forces. Konstantine easily neutralized Mart's bombs and disabled the Sato's Hammer's engines. Jonner and the other rebels were forced to leave Mart behind and fled into hyperspace. After rendezvousing with the rebel fleet, Jonner attended a briefing with Hera, the Spectres, Commander Sato, and Captain Rex. Sato sanctioned a mission led by Hera to rescue Mart. Jonner and Gooti were overjoyed they were going back to rescue their captain.\nDuring the rescue mission, Jonner and Gooti manned the cargo bay of the Ghost. They opened the cargo bay doors which allowed R3-A3 and Chopper to fly out on their rocket boosters and disable a magno-mine that had been planted on the Sato's Hammer. Under Hera's orders, they attached the Ghost to Sato's Hammer. After picking up Sato's Hammer, the rebels were reinforced by Commander Sato who had arrived with a CR90 corvette and several A-wings. Before escaping into hyperspace, the rebels dropped the magno-mine over Konstantine's light cruiser; badly damaging the Imperial ship. Jonner then watched as Grand Admiral Thrawn's Imperial Star Destroyer Chimaera exited hyperspace. Jonner and his comrades realized the sheer size and power of an Imperial Star Destroyer and that it was folly to take on one alone.\nJonner, the Iron Squadron, and their rebel allies then traveled to the Phoenix cell's Chopper Base on the planet Atollon. There, Jonner and Gooti hugged their captain after he had reunited with his uncle Commander Sato.\nJonner Jin was a bald and pudgy human male with blue eyes. He was the muscle of the Iron Squadron and was deeply loyal to his friends Mart Mattin and Gooti Terez. He proved to be not as hard-headed as his captain and saw reason in Ezra's argument when he tried to persuade them to leave the system. Jonner was a positive and friendly individual, having a near-constant smile on his face and offering the Spectres space waffles when they were onboard their ship.\nJonner was voiced by Eric Lopez in \"Iron Squadron,\" the eighth episode of the third season of Star Wars Rebels. He was named after John Harper, a cameraman, editor, and producer on The Star Wars Show.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/A_Youth_Unpromising",
  "/wiki/StarWars.com",
  "/wiki/Mykapo",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mykapo_insurgents",
  "/wiki/Phoenix_Cell",
  "/wiki/Iron_Squadron",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Massassi_Group",
  "/wiki/2_BBY",
  "/wiki/Skirmish_over_Mykapo",
  "/wiki/Galactic_Empire",
  "/wiki/Spectres",
  "/wiki/Gooti_Terez",
  "/wiki/R3-A3",
  "/wiki/Captain",
  "/wiki/Mart_Mattin",
  "/wiki/Imperial_Era",
  "/wiki/Mart_Mattin%27s_father",
  "/wiki/Theelin",
  "/wiki/Astromech_droid",
  "/wiki/YT-2400_light_freighter",
  "/wiki/Sato%27s_Hammer",
  "/wiki/Commander",
  "/wiki/Jun_Sato",
  "/wiki/Hyperdrive",
  "/wiki/Phoenix_Squadron",
  "/wiki/Ghost",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Hera_Syndulla",
  "/wiki/Ezra_Bridger",
  "/wiki/Sabine_Wren",
  "/wiki/C1-10P",
  "/wiki/Phantom_II",
  "/wiki/Laser_cannon",
  "/wiki/Deflector_shield",
  "/wiki/Admiral",
  "/wiki/Kassius_Konstantine",
  "/wiki/Hyperspace",
  "/wiki/Rex",
  "/wiki/Rocket_booster",
  "/wiki/Magno-mine",
  "/wiki/CR90_corvette",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Chimaera",
  "/wiki/Chopper_Base",
  "/wiki/Atollon",
  "/wiki/Space_waffle",
  "/wiki/Eric_Lopez",
  "/wiki/Iron_Squadron_(episode)",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Star_Wars_Show",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Dawn_of_Rebellion"
 ]
}