{
 "name": "Jonus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Officer Corps",
      "Scimitar Squad",
      "Imperial Officer Corps",
      "Scimitar Squad"
     ]
    }
   ]
  }
 ],
 "content": "Jonus was a human male who served as a TIE fighter pilot captain in Scimitar Squad, a squadron in the Imperial Navy's Starfighter Corps during the Galactic Civil War. In 4 ABY, Jonus was present aboard the Death Star II when it was attacked by the Alliance to Restore the Republic during the Battle of Endor.\nAs Imperial personnel began to evacuate, Jonus ran through the corridors of the Death Star with Major Rhymer, passing the Jedi Luke Skywalker and Skywalker's father Darth Vader shortly before the Death Star was destroyed.\nJonas was a human male who served as a TIE fighter pilot captain in the Imperial Officer Corps and Imperial Starfighter Corps of the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic. He flew as part of Scimitar Squad, a TIE/sa bomber squadron in the Imperial Navy. In 4 ABY, Jonus was on board the Death Star II superweapon in the Endor system during the Battle of Endor, in which the Alliance Fleet launched an attack to destroy the Death Star.\nAfter the rebels had managed to successfully disable the superweapon's shields and gained the upper hand in the battle, alarms began blaring on the Death Star as personnel raced to evacuate. Alongside fellow Scythe Squad pilot Major Rhymer, Jonus ran through the corridors of the Death Star and passed by the Jedi Knight Luke Skywalker as the Jedi dragged his wounded father, Darth Vader, toward one of the Lambda-class T-4a shuttles parked nearby. Skywalker then had time to escape from the Death Star before it was completely destroyed by the Alliance.\nJonus had brown hair, brown eyes, and light skin.\nJonus wore a black TIE pilot's uniform while onboard the Death Star. He flew an unmarked TIE/sa bomber.\nJonus was created for the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. In the new Star Wars canon, Jonus was first identified in the 2020 video game Star Wars: Starfighter Missions. The name originated in the Star Wars Legends continuity, where it was first used on a card in the Death Star II Limited set released in 2000 for the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jonus",
  "/wiki/Jonus/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Scimitar_Squad",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Captain",
  "/wiki/Squadron",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Galactic_Civil_War",
  "/wiki/4_ABY",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Endor",
  "/wiki/Death_Star",
  "/wiki/Major",
  "/wiki/Rhymer",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Parent",
  "/wiki/Anakin_Skywalker",
  "/wiki/TIE/sa_bomber",
  "/wiki/Superweapon",
  "/wiki/Endor_system",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Deflector_shield",
  "/wiki/Pilot",
  "/wiki/Jedi_Knight",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Time",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_military_uniforms",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/2020",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Star_Wars_Legends",
  "/wiki/Death_Star_II_Limited",
  "/wiki/2000",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Category:Images_of_Jonus",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}