{
 "name": "Joon Strephi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Joon Strephi was a human male who served as an officer in the Imperial Officer Corps in the early days of the Galactic Empire. Following a conspiracy against Darth Vader, Strephi, along with four other officers, were killed, with Vader stating that although he had suspicions on the conspirators, he would always survive.\nJoon Strephi was an human male who served as an Imperial officer in the Imperial Officer Corps. Following an attempted assassination on Darth Vader on Cabarria by bounty hunters, Vader ordered his droid to conduct an analysis of the origins of the kill contract as they were arriving on Coruscant. The droid stated that the contract came from the highest levels of the Imperial Executive Building, including the offices of Emperor Palpatine. The droid continued, and stated that there was a 97% probability that the signal originated from there, and that there was no evidence of slicing.\nVader then requested a list of individuals with access codes of Imperial systems that were above Level 1A1. On the list provided, Strephi's name was indexed there, along with the names of Corin Ferro, Wilhuff Tarkin, Cassio Tagge, Jer Croteau, Tomas Azoras, and Zorta Bingan. Following a second assassination attempt in orbit that resulted in Vader and the Ninth Sister crashing their starship, Vader met with the Emperor and meditated and discovered that Barokki was also involved, an officer he had force choked some time before. Following his meditation, he approached the Emperor with a likely solution.\nStrephi, along with many other officers, were summoned to an auditorium on Coruscant. Vader believed that the conspiracy against him was because the officers did not understand why Vader was Emperor Palpatine's second in command. Following a brief speech by Emperor Palpatine that elaborated that Vader was his voice and second in command, Vader \"randomly\" selected Strephi, along with Ferro, Azoras, Barokki, and Bingan and killed them through the Force, and stated that although he had suspicions on the conspirators, he would always survive. Of those killed, Barokki was one of two officers that were involved in the conspiracy, the other, who was an individual with two missing fingers was not selected and thus spared.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Officer",
  "/wiki/Standard_day",
  "/wiki/Anakin_Skywalker",
  "/wiki/Death",
  "/wiki/Imperial_officer",
  "/wiki/Assassination_attempts_on_Darth_Vader",
  "/wiki/Assassin",
  "/wiki/Cabarria",
  "/wiki/Bounty_hunter",
  "/wiki/Darth_Vader%27s_droid",
  "/wiki/Droid",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Slicer",
  "/wiki/Level_1A1",
  "/wiki/Corin_Ferro",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Cassio_Tagge",
  "/wiki/Jer_Croteau",
  "/wiki/Tomas_Azoras",
  "/wiki/Zorta_Bingan",
  "/wiki/Ninth_Sister",
  "/wiki/Vader%27s_starship",
  "/wiki/Meditation",
  "/wiki/Barokki",
  "/wiki/Force_choke",
  "/wiki/Time",
  "/wiki/Coruscant_auditorium",
  "/wiki/The_Force",
  "/wiki/Limb",
  "/wiki/Darth_Vader_(2017)_12",
  "/wiki/Darth_Vader_(2017)_21"
 ]
}