{
 "name": "Jor_Drakas",
 "display_name": "Jor Drakas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "21.95 BBY",
      "Sarapin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Jor Drakas was a Twi'lek male Jedi Knight and General during the Clone Wars who participated in two battles against the Chiss Dark Jedi Sev'rance Tann circa 22 BBY. Upon Drakas' and Tann's first encounter at the Kaer Orbital Platform, in which Drakas unsuccessfully tried to prevent Tann from rebuilding the Separatist Droid Army, Tann retreated after completing her mission. However, during the battle for natural energy reserves on the Republic world of Sarapin, Tann killed Drakas.\nJor Drakas, a Twi'lek male, was a Jedi Knight who served the Galactic Republic as a Jedi General during the Clone Wars. Shortly after the Battle of Geonosis in 22 BBY, the Confederate leader Count Dooku sent General Sev'rance Tann—a Chiss Dark Jedi serving the Confederacy—to the abandoned InterGalactic Banking Clan base at the Kaer Orbital Platform. There, Tann was assigned to rebuild the Separatist Droid Army in secret from the Republic.\nHowever, Tann's operation was discovered, and Drakas soon led a task force of clone troopers against Tann. After their Acclamator-class assault ship landed on the platform, Drakas' troops established a base of operations and began making raids on Tann's territory. After several small skirmishes, Tann chose to retreat, but not before finishing the construction of a considerable amount of droids.\nIn 21.95 BBY, one month after the Battle of Geonosis, Drakas was assigned to guard the Republic energy world of Sarapin after the Republic learned that the Separatists would attempt to secure the planet's natural energy reserves. On Sarapin, Drakas occupied the Citadel located on Mount Corvast, the planet's capital. It was not long before Tann's forces approached Sarapin, destroyed its orbital defenses, and landed on the planet.\nUsing the stolen Republic Decimator technology—a ground vehicle equipped with a powerful laser—Tann overwhelmed Mount Corvast and destroyed the Citadel. Drakas survived its destruction and attacked the Separatist forces with his lightsaber. Tann engaged the Jedi Knight in a lightsaber duel, where she killed Drakas and successfully captured Sarapin, immediately reporting her victory and Drakas' death to Count Dooku. However, Sarapin was soon recaptured, thanks to the efforts of the Jedi Knight Echuu Shen-Jon, who went on to kill Tann on the planet Krant.\nJor Drakas had pink eyes and white skin. In her report to Count Dooku, Sev'rance Tann held little respect for Drakas, calling him \"pathetic.\"\nJor Drakas possessed a yellow-bladed lightsaber and wore brown Jedi robes.\nJor Drakas first appeared in the 2002 LucasArts video game Star Wars: Galactic Battlegrounds: Clone Campaigns, the expansion pack for the real-time strategy game Star Wars: Galactic Battlegrounds. The character was voiced by Nick Jameson, and his character model and profile image are identical to that of the character Bib Fortuna, who also appears in the game.\nIn the second level of the Confederacy campaign, titled \"Building the Army,\" which involves the events on the Kaer Orbital Platform, Drakas' name only appears representing the leader of the Republic faction. The character makes a full appearance in the campaign's seventh and final level, \"Sarapin's Fury,\" where he emerges from Mount Corvast Citadel and attacks the player's army. While any unit can kill Drakas in the game, his entry in The Complete Star Wars Encyclopedia, published in 2008, stated that Tann personally killed the Jedi Knight.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/22_BBY/Legends",
  "/wiki/Sarapin/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/File:Strikequicklyjor.ogg",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Sev%27rance_Tann",
  "/wiki/Battle_of_Kaer_Orbital_Platform",
  "/wiki/Kaer_Orbital_Platform",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/First_Battle_of_Sarapin",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/General/Legends",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/Troop/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Mount_Corvast_Citadel",
  "/wiki/Mount_Corvast",
  "/wiki/Capital/Legends",
  "/wiki/Battle_of_Asteroid_426",
  "/wiki/Orbit/Legends",
  "/wiki/Decimator_(war_machine)",
  "/wiki/Laser/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Second_Battle_of_Sarapin",
  "/wiki/Echuu_Shen-Jon",
  "/wiki/Battle_of_Krant",
  "/wiki/Krant",
  "/wiki/Eye/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/2002",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Nick_Jameson",
  "/wiki/Bib_Fortuna/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Standard_month/Legends"
 ]
}