{
 "name": "Jor_Tribulus",
 "display_name": "Jor Tribulus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Sometime prior to the mission to Vashka",
      "Vashka"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Jor Tribulus, designated TK-1472, was a human male stormtrooper captain who fought for the Galactic Empire.\nFollowing the formation of the New Republic, Tribulus was retired to Vashka Valley Retirement Facility 48 on the planet Vashka, an asylum which also housed Aric Nightdrifter, another trooper who had served under Tribulus. While Tribulus was kept at the facility, it was overrun by Vashkan apidactyl, a hostile insectoid species who turned it into a wax-covered nest. The building's staff fled, but the patients were left behind and took up residence in the facility's basement. Apart from Nightdrifter, all of the surviving patients, including Tribulus, were slowly picked off by the apidactyl and their corpses sealed in wax cells. Nightdrifter did his best to place his comrades' possessions with their sealed-away corpses, and scratched their names into the wax covering each of their cells. Sometime after Tribulus's death, the mercenary Bazine Netal was hired to recover a steel case the captain had owned, and tracked him down to Vashka in order to retrieve it. After forcing Nightdrifter to show her were Tribulus's corpse was, Netal dug into the cell and recovered the case, only to be betrayed by her old mentor Delphi Kloda, who took the case and sealed Netal in with the dead stormtrooper. Netal ultimately managed to escape the cell and kill Kloda, recovering the case to take to her client.\nJor Tribulus first appeared, albeit as a corpse only, in the short story \"The Perfect Weapon,\" which was written by Delilah S. Dawson and released as an eBook in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mission_to_Vashka",
  "/wiki/Vashka",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Stormtrooper",
  "/wiki/Captain",
  "/wiki/New_Republic",
  "/wiki/Vashka_Valley_Retirement_Facility_48",
  "/wiki/Planet",
  "/wiki/Aric_Nightdrifter",
  "/wiki/Vashkan_apidactyl",
  "/wiki/Insectoid",
  "/wiki/Species",
  "/wiki/Mercenary",
  "/wiki/Bazine_Netal",
  "/wiki/Steel",
  "/wiki/Delphi_Kloda",
  "/wiki/The_Perfect_Weapon",
  "/wiki/Delilah_S._Dawson",
  "/wiki/EBook",
  "/wiki/2015"
 ]
}