{
 "name": "Jora Malli",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 232 BBY",
      "Kur Nebula"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Dez Rydan",
      "Reath Silas"
     ]
    }
   ]
  }
 ],
 "content": "Jora Malli was a Togruta female who served as a Jedi Master of the Jedi Order during the High Republic Era. During this time, Malli was a member of the Jedi High Council, and was the master to Padawan Reath Silas. Before Silas, Malli had trained two other apprentices, including most recently, the Jedi Knight Dez Rydan. She was placed in command of the Jedi quarter of the space station Starlight Beacon after its completion, with the Trandoshan Master Sskeer as her second-in-command. Avar Kriss sensed their approach responding to the call to save the Hetzal system from the Great Hyperspace Disaster in the Force. Malli was later killed during a battle with the Nihil at the Kur Nebula, something which Estala Maru speculated that Sskeer blamed himself for after Maru was unable to locate the Trandoshan before Starlight Beacon's dedication ceremony. Following her death, her spot on the Council was succeeded by Ry Ki Sakka.\nJora Malli's last mission on Coruscant with her Padawan, Reath Silas, around 232 BBY, found them chasing a pirate skiff laden with stolen ores and materials used in the latest building boom on the planet in a PI-R airspeeder. Sensing his master's thoughts Reath was able to anticipate the pirate's attempt to shake off their pursuit. Reath miscalculated the relative power of the two vehicles' engines and fired a tow cable this resulted in the skiff pulling the airspeeder down towards the surface of Coruscant. Jora Malli leapt from the speeder to the skiff and cut through the pirate's cockpit. She then asked that they turn themselves in at the nearest landing platform for arrest. When the Rodian pilot hesitated, Jora wondered if the anger she could sense from him would be enough to cause him to allow the ship to crash simply to kill her, and so she employed the Jedi mind trick and forced the pirates to turn themselves in.\nAfter the mission she informed Reath, that they would be leaving Coruscant for her new post on the Starlight Beacon, and that she would be stepping away from the Jedi Council. When Reath objected she told him that while the job played to her strengths she would not have accepted unless she felt it was important for him as well. She fended off each of his rebuttals by telling him that, he needed to learn that he had talent enough for any task he set himself to, and that effort mattered in all things, he may be surprised how necessary an archivist may be on the Frontier, and that she intended for him to be more than just an archivist. She gave him a riddle to solve, asking why he, nor any other Jedi, could cross the Kyber Arch alone. Jora had intended for Reath to remain on Coruscant until the opening of Starlight Beacon as a small kindness, but it was not to be.\nWhen the Nihil conflict began to unfold in the aftermath of the Great Hyperspace Disaster, Jora was never able to fulfill her position as Marshal of Starlight; she was killed during the Battle of Kur as she led the Republic Defense Coalition and Jedi against Kassav's Tempest. Her death had a major affect on her friend Jedi Master Sskeer and her apprentice, with Reath being unable to believe the news until learning it was Sskeer who reported it. When he was forced to duel her master's former apprentice Dez Rydan because he was under the control of the Drengir, Reath informed him of their mentor's death to snap him back to reality. Because her body was never recovered, Jora never received a proper Jedi funeral, but Reath hoped to hold a vigil with Rydan in her honor. However, Rydan left to take on the Barash Vow instead. With Malli having fallen in battle, Avar Kriss was selected to become Marshal instead.\nJora was a petite orange-skinned Togruta female. Although Jora was a member of the Jedi High Council, a duty she took seriously, she missed many votes over her tenure believing that she could do more good out in the galaxy than at her seat in the temple. According to Supreme Chancellor Lina Soh, she had a \"tinge of un-Jedi-like impatience. She liked to push problems until answers revealed themselves, trying many things until something worked rather than considering all angles and taking one decisive action. She preferred, in a word, to be busy.\" When she was frustrated she would fidget by tapping on her lekku.\nSince Jedi have a strong link to the light side, she believed it was useless to waste time debating what the will of the Force was. Any action taken by a Jedi was the Force's will, though Jedi could become better instruments of that will through education and training.\nJora Malli was impulsive, often acting without thinking out the full consequences of her actions. She purified a Sith crystal mostly as an intellectual exercise and found herself bonded to the crystal permanently, and her plan for engaging the Nihil was to do, \"whatever the Force will.\" She would also justify her more reckless actions with a pithy retort, when questioned about the decision to put her life, the life of Starlight Beacon's Jedi commander, on the line, when it was unnecessary she shrugged it off saying, \"You can die in bed just as easily as in battle.\"\nAs a Togruta, she liked when humans had markings on their faces like her padawan, Reath Silas', freckles. She found that as master it was often more painful to teach a hard lesson, than it was to learn it as a student. She tried to instill balance into the two Padawans she trained, her first Dez Rydan was too eager for adventure, her second Reath avoided it too much, her goal as their teacher was to broaden their horizons. Though she also felt that Reath was well suited to be her padawan because he would not resent the relatively few opportunities to travel that are afforded the padawan of a council member. She also encouraged Reith's passion for academics saying that the order needed both scholars and adventurers, and there was two few interested in the former; at the same time, she planned for him to be more than just an archivist.\nJora wore white-and-gold Jedi robes and wielded a white-bladed lightsaberas her primary weapon, however she did possess a blue-bladed lightsaber as well.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/232_BBY",
  "/wiki/Kur_Nebula",
  "/wiki/Togruta",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Dez_Rydan",
  "/wiki/Reath_Silas",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Time",
  "/wiki/Padawan",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi",
  "/wiki/Space_station",
  "/wiki/Starlight_Beacon",
  "/wiki/Trandoshan",
  "/wiki/Sskeer",
  "/wiki/Avar_Kriss",
  "/wiki/Hetzal_system",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/The_Force",
  "/wiki/Death",
  "/wiki/Battle_of_Kur",
  "/wiki/Nihil",
  "/wiki/Estala_Maru",
  "/wiki/Ry_Ki_Sakka",
  "/wiki/Coruscant",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Pirate",
  "/wiki/Skiff",
  "/wiki/PI-R_airspeeder",
  "/wiki/Ships_and_Vehicles",
  "/wiki/Engine",
  "/wiki/Magnetic_harpoon",
  "/wiki/Cockpit",
  "/wiki/Aerial_landing_platform",
  "/wiki/Rodian",
  "/wiki/Pilot",
  "/wiki/Archivist",
  "/wiki/Kyber_Arch",
  "/wiki/Nihil_conflict",
  "/wiki/Marshal",
  "/wiki/Republic_Defense_Coalition",
  "/wiki/Kassav%27s_Tempest",
  "/wiki/Lightsaber_duel",
  "/wiki/Drengir",
  "/wiki/Jedi_funeral",
  "/wiki/Barash_Vow",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Lekku",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Sith",
  "/wiki/Kyber_crystal",
  "/wiki/Clothing",
  "/wiki/Jedi_robes",
  "/wiki/Jora_Malli%27s_lightsaber",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic_(2021)_1",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_7",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_Midnight_Horizon_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Accessories_and_Structures",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yoda",
  "/wiki/Ephru_Shinn",
  "/wiki/Lahru",
  "/wiki/Pra-Tre_Veter",
  "/wiki/Keaton_Murag",
  "/wiki/Ada-Li_Carro",
  "/wiki/Teri_Rosason",
  "/wiki/Oppo_Rancisis",
  "/wiki/Adampo",
  "/wiki/Yarael_Poof",
  "/wiki/Rana_Kant",
  "/wiki/Stellan_Gios",
  "/wiki/Soleil_Agra"
 ]
}