{
 "name": "Jorad Sindarus Thul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of ThulSith Empire",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Jorad Sindarus Thul was a Human male who served as Lord of House Thul during the Cold War.\nSince Alderaan broke out into civil war, Jorad intended to wage \"civilized warfare\" as per Alderaanian custom. However, Moff Sarek disagreed with Jorad's hesitancy to do what must be done, and assigned an important Imperial individual to bring Chrimar Noven, a former ally of Thul, before Jorad with a shock collar around his neck. Jorad was appalled by the inhumane display and tried to defend his policies, claiming it was to avoid further rebellion. However, he was interrupted by Sarek, who declared that if Alderaan were to join the Sith Empire, the Imperial hero would be the one leading the charge and would act with his authority.\nAfter Sarek signed off, Jorad assumed that the Moff wanted Thul to attack House Organa, and sent the Imperial hero to infiltrate an Organa hideout north of House Thul and slice into their communications. Just after they had gotten into the Organa communications, their enemy began attacking outlying Thul outposts with soldiers and probe droids. Jorad sent the Imperial hero to repel the attack and retrieve the memory cores of the droids.\nLater, Jorad's protocol droid had the memory cores analyzed and determined that they came from Lord Cedarik Killesa, one of Jorad's supposed vassals who swore loyalty to him when he returned to Alderaan. Killesa used the Organa attack as a distraction to draw Thul's forces away so he could attack Jorad through the siege tunnels underneath the Thul palace. Jorad provided thermite charges to the Imperial hero to collapse the tunnel and thwart the assault.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_of_Thul",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Alderaan_Civil_War",
  "/wiki/Moff/Legends",
  "/wiki/Sarek",
  "/wiki/Chrimar_Noven",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Cedarik_Killesa",
  "/wiki/Thermite/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jorad_Sindarus_Thul",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}