{
 "name": "Jorad",
 "display_name": "Jorad",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    }
   ]
  }
 ],
 "content": "Jorad was a Force-sensitive Human male member of the Jedi Order during the waning years of the Galactic Republic. At the end of the Clone Wars, the Republic was reformed into the Galactic Empire. The new government was hostile to the Jedi and began hunting them down. Jorad became a wanted man, and he was captured by members of the Inquisitorius, a group of Dark Side Adepts who served the Empire as Jedi hunters. They turned Jorad to the dark side of the Force, and he himself became an Inquisitor. Jorad was sent to carry out his new duties on the planet Prakith, where the headquarters of the Inquisitorius was located. He carried out patrols in the planet's capital, Prak City, where he searched for Force-users. When a team of Alderaanian Resistance agents traveled to Prakith to free Jedi Master Denia, who had been captured by the Inquisitorius, Jorad located the agents in Prak City. He engaged them in combat and attempted to capture them.\nJorad was a Human male born during the waning years of the Galactic Republic who joined the Jedi Order. Within the Order, he became a Jedi Guardian, a combat-orientated Jedi specialization. However, in 19 BBY, Supreme Chancellor Palpatine, the leader of the Republic, issued Order 66 to the Republic's clone troopers, calling for the execution of the Jedi. The Republic was reformed into the Galactic Empire, but Jorad was able to survive the Jedi purge that the new government subsequently implemented. However, he was eventually captured by members of the Inquisitorius, an order of Dark Side Adepts who served the Empire as Jedi hunters. They turned Jorad to the dark side of the Force, and he joined their order, taking up the title of \"Inquisitor.\" Jorad was assigned to begin carrying out his new duties on Prakith, a planet located in the Deep Core region of the galaxy, where the Inquisitorius was based. His role there was to patrol the planetary capital, Prak City, to locate any Force-users there. He took any whom he found to the Citadel Inquisitorius, the headquarters of the Inquisitorius, for questioning.\nAfter Inquisitor Valin Draco imprisoned Jedi Master Denia in the Citadel around 17 BBY, the Alderaanian Resistance—a group of anti-Imperial rebels from the planet Alderaan—sent a group of agents to Prakith to rescue her. They passed through the Work Zone sector of Prak City, where Jorad was patrolling aboard a Theta-class shuttle along with a Prak City Guard Squad. After Jorad detected the presence of the agents, he planned to arrest them. The shuttle swooped down toward a clearing where the Resistance team was standing, and Jorad and the guards disembarked. The shuttle then took off again, and Jorad approached the Resistance agents while his guards flanked him on all four sides. Jorad introduced himself to the rebels and attempted to arrest them; however, they resisted, and he ignited his lightsaber and engaged them in combat.\nJorad was prideful, which made him vulnerable to the dark side and allowed him to easily adapt to the role of an Inquisitor. He was also ambitious, and when he was assigned to serve on Prakith, he hoped to make a significant arrest so that he could get off patrol duty and take up a more important position in the Citadel Inquisitorius. In an attempt to achieve this, he used all forms of trickery and deception that were available to him to capture Force-users alive.\nAs an Inquisitor, Jorad wore red- and black-colored robes, the standard uniform for members of his order. He also carried a comlink, a tracking device, and a code cylinder, which could be used to activate an elevator in the Citadel Inquisitorius.\nJorad was able to use telekinesis to move people and objects, and he also knew how to use mind tricks to influence the minds of his opponents. He was bilingual and had the ability to speak both Basic and Bocce.\nWhen attacking a Force-user, one of Jorad's favored tactics was to hide or feint. This allowed him to draw his opponent closer to him so that he could use the Force to knock them over and then engage them in melee combat. He would also capture weak, non-Force-sensitive opponents to use as hostages. When in melee combat, Jorad would attack targets with both his lightsaber and a blaster pistol.\nJorad was created by writer John Jackson Miller and made his first and only appearance in Sword of the Empire, the ninth scenario in the Dawn of Defiance campaign, a Wizards of the Coast online supplement to the Star Wars Roleplaying Game.\nIn the supplement, Jorad's encounter with the players, who role-play as the team of Resistance agents, can begin in a number of ways. When they arrive in Prak City, if any of them use the Force while they are there, the Inquisitorius detect this and Jorad is sent to investigate. If the players fail to trigger the encounter with Jorad this way, it occurs after they have met with the Stereb Herdr'tui, when Jorad finds them during a random search of the city. If the players defeat Jorad, they can take his code cylinder and use it later in the scenario to assist them in gaining entry to the Citadel Inquisitorius.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Outbound_Flight",
  "/wiki/Jorad_Pressor",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Jedi/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Dark_Side_Adept",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Prakith/Legends",
  "/wiki/Citadel_Inquisitorius",
  "/wiki/Capital/Legends",
  "/wiki/Prak_City",
  "/wiki/The_Force/Legends",
  "/wiki/Alderaanian_Resistance",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Denia",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Valin_Draco",
  "/wiki/17_BBY/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Work_Zone_sector",
  "/wiki/Theta-class_T-2c_shuttle/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Code_cylinder/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Bocce/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/John_Jackson_Miller",
  "/wiki/Sword_of_the_Empire",
  "/wiki/Dawn_of_Defiance",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Roleplaying_game",
  "/wiki/Stereb",
  "/wiki/Herdr%27tui",
  "/wiki/City/Legends",
  "/wiki/Wizards.com",
  "/wiki/Star_Wars_Roleplaying_Game_Revised_Core_Rulebook",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Vhiin_Thorla",
  "/wiki/Almas_Academy",
  "/wiki/Galactic_Standard_Calendar"
 ]
}