{
 "name": "Joreb_Goss",
 "display_name": "Joreb Goss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pale Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Joreb Goss was married to the traitorous Fallanassi Isela Talsava Norand, and the father of Akanah Norand Goss Pell.\nAs a young man, Joreb met the beautiful Talsava on Lucazec. Completely infatuated with her, and because the Fallanassi had no qualms about marriage, they were married. Very happy, the couple relocated to Gavens to start a family. On Gavens, the marriage produced a young daughter whom they named Akanah. The arrival of his daughter brought a new feeling of responsibility to Joreb. Eager to secure the funds necessary to provide for his budding family, and on the encouragement of his wife, Joreb left Gavens in search of wealth and promising to return shortly.\nFor unknown reasons, Joreb somehow found himself on Atzerri, a drug and gambling paradise. While there, Joreb got himself caught up in the drug-trafficking business. Sampling the very powerful drug Rokna blue, Joreb began to forget all semblances of his former life. In dazed confusion from the effects of the drug, Joreb set up camp on Atzerri taking small jobs to pay for his increasing addiction to the powerful drug.\nMany years later, Joreb had taken up residence in Atrium 41, a scumhole apartment on Atzerri. Joreb's brain had completely deteriorated and he remembered almost nothing of his previous life. It was in this state that his young daughter found him. Akanah had traced his journey to Atzerri from several notes made by underground Fallanassi. Hoping for a meaningful reunion, Akanah was devastated at the drug induced state her father was in. Nothing Akanah said was able to reestablish Joreb's memory. Full of tears, Akanah left Atzerri and Joreb to his meaningless existence.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fallanassi/Legends",
  "/wiki/Isela_Talsava_Norand",
  "/wiki/Akanah_Norand_Goss_Pell",
  "/wiki/Lucazec/Legends",
  "/wiki/Gavens",
  "/wiki/Atzerri/Legends",
  "/wiki/Rokna_blue",
  "/wiki/Atrium_41",
  "/wiki/Shield_of_Lies",
  "/wiki/Cracken%27s_Threat_Dossier",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}