{
 "name": "Jorgatha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Houk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "61st Mobile Infantry",
      "61st Mobile Infantry"
     ]
    }
   ]
  }
 ],
 "content": "Jorgatha was a Houk male soldier in the New Republic's 61st Mobile Infantry. Around 5 ABY, during a campaign in the Cerberon system, he and a number of other 61st personnel took refuge at a garage after the Galactic Empire's 204th Imperial Fighter Wing routed their squads from their positions on the surface of the planet Troithe. There, Jorgatha attended a meeting led by Sergeant Carver to determine a plan of action for their group of personnel.\nThe group subsequently decided to travel to the Scar of Troithe, a continent on the planet's far side, travelling through a network of underground tunnels to reach their destination. After the New Republic personnel reached the Scar, Jorgatha was part of another meeting held by Carver, where he and sergeant drew out plans on an attack on the 204th at the Core Nine mining megafacility, debating whether a frontal assault was valid. The subsequent attack on the 240th, however, was victorious, forcing the fighter wing to flee the Cerberon system.\nDuring the Galactic Civil War, Jorgatha and his sister Gorgeous Su served as soldiers in the 61st Mobile Infantry, a company in the New Republic's army. Around 5 ABY, the 61st participated in a campaign in the Cerberon system as a part of General Hera Syndulla's battle group. During the campaign, the battle group's fleet above the planet Troithe was devastated by the Galactic Empire's 204th Imperial Fighter Wing, which then forced the 61st squads from their positions on the planet. Jorgatha rendezvoused with almost fifty more 61st personnel and around twenty local insurgents in a speeder garage in the Highgarden District, a lightly urbanized district on Troithe.\nWith the 61st's captain, Hazram Namir, and half of the company stranded off-world, Sergeant Carver called a meeting with Jorgatha and other senior members of the 61st's personnel at the garage, as well as two New Republic pilots, to discuss their situation. There, the sergeant assumed leadership of the group at the garage, despite protests, and the attendees debated what their group's plan of action. After Carver suggested that Imperial reinforcements may arrive if the New Republic personnel wait to long, Jorgatha, who took up one of the rooms corners, shifted himself and attempted to speak before being interrupted by the elderly human Junior, who brought up the possibility of travelling to the Scar of Troithe, a lifeless, heavily mined continent on the other side of the planet.\nAfter the meeting, the New Republic group, Jorgatha among them, traveled from the Highgarden District to the Scar of Troithe. Although they were attacked by Imperial aligned forces at the edge of the Highgarden District, the New Republic forces instead travelled into a network of underground tunnels that could lead them all the way to their destination in a caravan of repulsorcraft. During the journey, the 204th's Squadron Three hunted the New Republic convoy, killing Gorgeous Su during their attack. After the caravan arrived in the Scar of Troithe, the New Republic forces took shelter in a ravine.\nCarver held another meeting with the senior members of the 61st and the two pilots to discuss the 204th's presence at the Core Nine mining megafacility, which was located nearby. During the meeting, Jorgatha and Carver sketched their own plans to assault Core Nine in the dust of the ravine they were sat at. The pair further debated whether a frontal attack on the facility was too late. After the 204th's forces began diverting towards Core Nine, the New Republic group launched an attack on the facility. The battle was successful, thanks to New Republic reinforcements, with the 204th fleeing Troithe in the battle.\nJorgatha was a male Houk who was large with a big jaw. He was crested with bones and gave a silent impression on the New Republic pilot Wyl Lark. When Carver predicted the possibility of Imperial reinforcements, Jorgatha scowled at him, attempting to speak. He also debated with the sergeant, while at the Scar of Troithe, on whether their group could make a frontal assault on the Core Nine facility.\nJorgatha appeared in the 2020 novel Shadow Fall, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Houk",
  "/wiki/Gender",
  "/wiki/New_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/New_Republic_soldier",
  "/wiki/5_ABY",
  "/wiki/Campaign_in_the_Cerberon_system",
  "/wiki/Cerberon_system",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Squad",
  "/wiki/Planet",
  "/wiki/Troithe",
  "/wiki/Sergeant",
  "/wiki/Carver",
  "/wiki/Scar_of_Troithe",
  "/wiki/Core_Nine_mining_megafacility",
  "/wiki/Attack_on_Troithe",
  "/wiki/Fighter_wing",
  "/wiki/Star_system",
  "/wiki/Galactic_Civil_War",
  "/wiki/Gorgeous_Su",
  "/wiki/Company",
  "/wiki/New_Republic_army",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Barma_Battle_Group",
  "/wiki/Fleet",
  "/wiki/Attack_on_Cerberon",
  "/wiki/Speeder",
  "/wiki/Highgarden_District",
  "/wiki/Captain",
  "/wiki/Hazram_Namir",
  "/wiki/New_Republic_pilot",
  "/wiki/Human",
  "/wiki/Junior_(New_Republic)",
  "/wiki/Repulsorcraft",
  "/wiki/Squadron_Three_(Shadow_Wing)",
  "/wiki/Death",
  "/wiki/Pilot",
  "/wiki/Bone",
  "/wiki/Wyl_Lark",
  "/wiki/2020",
  "/wiki/Shadow_Fall",
  "/wiki/Alexander_Freed",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battlefront:_Twilight_Company"
 ]
}