{
 "name": "Jori Lekauf",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Vulpter"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Sandy blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair/freckled"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "967 Commando",
      "967 Commando"
     ]
    }
   ]
  }
 ],
 "content": "Jori Lekauf was a Human male officer of the Galactic Alliance Guard, the secret police of the Galactic Federation of Free Alliances. The grandson of Erv Lekauf, an Imperial officer who served under Darth Vader's command, Jori followed his grandfather's example by serving with Colonel Jacen Solo—Vader's grandson, a Jedi Knight and the commander of the Guard. Following the formation of the Guard, Lekauf served with the 967 Commando, a company of elite GAG troopers who served under Solo's direct command.\nLekauf rose through the ranks of the Guard, having been promoted from Corporal to Lieutenant during his service in the Second Galactic Civil War. Noted for his optimistic outlook, he befriended the young Jedi Ben Skywalker, Vader's other grandson who also served as an officer in the Guard. In 40 ABY Lekauf sacrificed his life on the planet Vulpter in order to complete a GAG mission.\nJori was the grandson of Erv Lekauf, who served under Darth Vader's command. He looked up to his grandfather more so than he did his own parents. Jori opted to follow in his grandfather's footsteps and became a Corporal in the Galactic Alliance Guard, serving under Vader's own grandson, Jacen Solo. Jori was fiercely loyal to Solo, though at times, he often questioned the nature of his decisions.\nDuring one GAG raid on Coruscant, Lekauf befriended Ben Skywalker, Jacen's cousin and informal apprentice. Lekauf offered to help Ben get over his first combat kill. They grew very close as Ben considered him to be one of his best friends.\nShortly after being commissioned Lieutenant, Jori was tasked with leading a small group of GAG personnel to Vulpter, where they were to monitor the meeting between Prime Minister Dur Gejjen and Chief of State Cal Omas. To prepare Ben for his role in the mission, Jori insisted on having a hand in Ben's combat training. Within a day, he managed to turn Skywalker into an efficient sniper, though the boy had his doubts about killing Gejjen in cold blood. Although their mission was a success, it was not a clean getaway; as Jori and Ben tried to escape security locked down the entire spaceport. Realizing that they would be caught, Lekauf took the sniper rifle from Ben, used a hostage to bluff his way out of the terminal , and then managed to board their ship. Jori then self-destructed the ship so that security would believe the killer was already dead and Ben would go free.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/40_ABY",
  "/wiki/Vulpter/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/967_Commando",
  "/wiki/Officer/Legends",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Erv_Lekauf",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Company/Legends",
  "/wiki/Special_forces/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Jedi/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mission_to_Vulpter",
  "/wiki/File:Lekauf.jpg",
  "/wiki/Five_World_Prime_Minister",
  "/wiki/Dur_Gejjen",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Cal_Omas",
  "/wiki/Sniper/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Legacy_of_the_Force:_Bloodlines",
  "/wiki/Legacy_of_the_Force:_Tempest",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}