{
 "name": "Jory",
 "display_name": "Jory",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kadas'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Jory was a male Kadas'sa'Nikto who was hired by Braden to provide security for the Great Hunt's base of operations on Nal Hutta during the Cold War. While on Hutta, Braden discovered a bounty hunter whom he intended to enter the Great Hunt. Unfortunately while the bounty hunter was targeting Vexx, Tarro Blood had Jory and Braden killed, leaving Mako and the hunter to continue the Hunt alone.\nJory was a Kadas'sa'Nikto male who worked with the bounty hunter Braden and the slicer Mako during the Cold War between the Galactic Republic and the reconstituted Sith Empire. He handled the heavy lifting for the crew and provided security for their base of operations, a backroom in the Poison Pit cantina in the town of Jiguuna on the planet Nal Hutta. In 3643 BBY, Braden found a new protégé who he hoped could win the competition known as the Great Hunt. The protégé traveled to the base of operations on Nal Hutta and Braden introduced Mako and Jory as the bounty hunter's support crew.\nIn order to enter the Great Hunt, the protégé would need the sponsorship of local crime lord Suudaa Nem'ro and so Braden had Mako find a nearby bounty that the protégé could claim in order to cement their reputation. After the slicer suggested the criminal Vexx be the group's target, the protégé left to search for information on Vexx at the criminal's safehouse. While the protégé was gone, Jory and Mako worked on what Braden described as \"all the little details\" of their mission so that the protégé would not have to. While Braden was visiting Nem'ro's Palace, Mako discussed with Jory how she wished to participate in missions rather than staying at the base with him. The protégé then returned with a datapad from the safehouse and Jory complemented his new associate's skill while Mako searched the device. After she discovered a shuttle ticket that Vexx had booked, the protégé left in order to catch the criminal before he could leave Nal Hutta.\nWhile the protégé was gone, the bounty hunter Tarro Blood and his associate Sedyn Kyne arrived at the base of operations while Braden and Jory were inside. Braden told the hunter to leave, but Blood introduced himself and explained that he also hoped to win the Great Hunt and so was removing the competition. Assuming that Blood planned to kill Braden's protégé, Jory declared the rival hunter's mission a failure as the protégé was not in the base and now Jory and Braden knew Blood's plan. Blood revealed that, as directly attacking other competitors was against the rules of the Great Hunt, he planned to instead eliminate his rival's support. Blood then ordered Kyne to kill Braden and Jory and left the room. Braden ordered Jory to shoot Kyne, but neither of them was quick enough to out draw their foe and he killed each with a single shot.\nThe protégé returned to the base after successfully killing Vexx and discovered Braden and Jory's bodies where Kyne had left them. Mako then returned and mourned the loss of her two friends, before she and the protégé checked the surveillance systems that she and Jory had set up in their base of operations. The pair watched a hologram showing what had occurred, and swore to continue in their goal to win the Great Hunt so that they could defeat Blood for what he had done. The protégé then left to meet with Nem'ro while Mako used the pay out from Vexx's bounty to give Jory and Braden a proper burial. The protégé ultimately avenged Jory and killed Taro Blood before successfully winning the Great Hunt.\nAt the time of his death, Jory considered Mako to be young and she referred to him as an \"old-timer\". When she said she would rather be out in the field then stuck at the base with him, he took no offence due to her age. He was impressed by the natural talents of Braden's protégé and considered himself lucky to be working in the support crew, which he hoped would make him rich and famous. Jory was fond of credits and material stability, so although he did not know the exact nature of the Great Hunt, Jory hoped the prize would be an easily divisible pay out. He had green skin and yellow eyes.\nJory wore a red shirt under a brown vest with a pair of white pants. He also wore a pair of black boots and black gloves. He carried a blaster pistol in a holster on his right thigh.\nJory appeared in the 2011 video game Star Wars: The Old Republic, but was revealed prior to its launch in a development diary released by BioWare.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Kadas%27sa%27Nikto/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Braden",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Hunter_(individual)",
  "/wiki/Great_Hunt_(Jedi)",
  "/wiki/Vexx",
  "/wiki/Tarro_Blood",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Mako_(slicer)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Poison_Pit",
  "/wiki/Cantina/Legends",
  "/wiki/Jiguuna",
  "/wiki/Planet/Legends",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Bounty/Legends",
  "/wiki/Nem%27ro%27s_Palace",
  "/wiki/Datapad/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Sedyn_Kyne",
  "/wiki/Hologram/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Eye/Legends",
  "/wiki/Shirt",
  "/wiki/Clothing/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Holster/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}