{
 "name": "Jos Vondar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Vondars",
      "Galactic Republic",
      "Republic Mobile Surgical Unit 7",
      "Republic Mobile Surgical Unit 7"
     ]
    }
   ]
  }
 ],
 "content": "Jos Vondar was a Human male Corellian surgeon who served the Galactic Republic and chief medical officer of Republic Mobile Surgical Unit 7 during the Clone Wars.\nWhile stationed at RMSU-7 on Drongar, he forged a close friendship with his roommate, Zabrak surgeon Zan Yant, as well as Sullustan reporter Den Dhur, protocol droid I-5YQ, Padawan Barriss Offee and—after Zan Yant's unfortunate death—with his roommate Kornell 'Uli' Divini. Yet the most important relationship he formed while on Drongar was with Lorrdian nurse Tolk le Trene, with whom he fell in love. By falling in love and marrying an ekster , he was shamed in the eyes of his culture.\nWhen RMSU-7 was placed under enemy fire, Jos took part in its evacuation and relocation, during which Zan was killed by shrapnel blast.\nWithin a week of the Rimsoo being set up again, Jos had to operate on Separatist mercenary Sar Omant, who was responsible for Zan's death, and resisted the temptation to kill the Zabrak prisoner.\nAs the battles on Drongar were coming to a head, Vondar proved himself to be a hero by killing a spy named Klo Merit who had infiltrated their Rimsoo and was working for both the Separatists and the criminal organization Black Sun. He also found an unexpected support in his uncle because he wanted to return with him to Corellia and Tolk, to help them build a relationship against the family tradition.\nJos Vondar was created by authors Michael Reaves and Steve Perry as the primary protagonist of the 2004 Medstar Duology of novels, Battle Surgeons and Jedi Healer. The duology was envisioned as Star Wars's answer to the M*A*S*H film and television series, and it was pitched to Reaves and Perry as \"M*A*S*H in space.\" Both of them were large fans of both the movie and TV show and felt that doctors-during-war were interesting characters—Perry additionally had a medical background—and they made an effort to design characters who felt real, with personal problems that needed to be solved. Jos Vondar in particular has been compared by fellow Star Wars author Daniel Wallace to Hawkeye Pierce, the protagonist of the M*A*S*H franchise. In a review of Battle Surgeons posted on TheForce.net, reviewer Mike Cooper stated that he found it impossible to read any of Vondar's lines without hearing the voice of Alan Alda, the actor who played Hawkeye in the M*A*S*H TV series.\nThroughout the second half of Jedi Healer, Vondar's name is misspelled \"Vandar\" in almost every appearance, until the epilogue when it is once again correctly spelled.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Jos_Vondar",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Vondars",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Mobile_Surgical_Unit_7",
  "/wiki/Corellian/Legends",
  "/wiki/Chief_medical_officer",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Republic_Mobile_Surgical_Unit/Legends",
  "/wiki/Drongar/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Zan_Yant",
  "/wiki/Sullustan/Legends",
  "/wiki/Den_Dhur",
  "/wiki/Protocol_droid/Legends",
  "/wiki/I-5YQ",
  "/wiki/Padawan/Legends",
  "/wiki/Barriss_Offee/Legends",
  "/wiki/Kornell_Divini",
  "/wiki/Lorrdian/Legends",
  "/wiki/Tolk_le_Trene",
  "/wiki/Sar_Omant",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Battle_of_Drongar",
  "/wiki/Spy/Legends",
  "/wiki/Klo_Merit",
  "/wiki/Black_Sun/Legends",
  "/wiki/Michael_Reaves",
  "/wiki/Steve_Perry",
  "/wiki/2004",
  "/wiki/MedStar_Duology",
  "/wiki/MedStar_I:_Battle_Surgeons",
  "/wiki/MedStar_II:_Jedi_Healer",
  "/wiki/Star_Wars",
  "/wiki/Daniel_Wallace",
  "/wiki/TheForce.net",
  "/wiki/Star_Wars_Insider",
  "/wiki/MedStar:_Intermezzo",
  "/wiki/Star_Wars_Insider_83",
  "/wiki/Coruscant_Nights_I:_Jedi_Twilight",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com",
  "/wiki/April_1",
  "/wiki/2013",
  "/wiki/June_19",
  "/wiki/January_17"
 ]
}