{
 "name": "Joser",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Admiral Joser was a Human Imperial who wanted to defect to the Rebel Alliance during the Galactic Civil War. He arranged to meet with a group of Rebels in The Watering Hole on the planet Dandrian, but was captured and sent to the Alpha-Omega Prison before he could do so.\nAt this time, he was of very advanced years and appeared to be very thin and as wrinkled as Yoda. His appearance, however, covered his experience. He graduated from the academy at the top of his class and was already a captain by the end of the Clone Wars. A year before his attempted defection, he retired to an Imperial resort world which was where he learned of the evils of the Empire which he had not previously known of. It was because of this that he decided to join the Rebel Alliance. He generally appeared to be very absent-minded and babbling but was competent when he wanted to be.\nLuckily for him, the group of Rebels managed to discover that he was being held in the prison and managed to free him shortly before Darth Vader arrived in the Tyderium to take him to another facility.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/The_Watering_Hole",
  "/wiki/Planet/Legends",
  "/wiki/Dandrian",
  "/wiki/Alpha-Omega_Prison",
  "/wiki/Yoda/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Tyderium",
  "/wiki/Challenge_49"
 ]
}