{
 "name": "Josephine Donovan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mindabaal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark auburn"
     ]
    }
   ]
  }
 ],
 "content": "Josephine Donovan was an ambassador-cum-smuggler in the Outer Rim and the younger sister of Jericho Donovan, whom she loathed, and daughter of James Ortell Donovan. She was a skilled astrogator.\nJosephine dutifully followed in Lord Donovan's footsteps, surpassing his skills in diplomacy. She became the pride of the Mindabaal Diplomatic Corps and was engaged in most royal activities in the Mindabaalite court from sport hunting over dancing to language lessons. She served as the ambassador of Mindabaal and the planet's liaison with the Galactic Empire, hoping one day to take her father's seat in the Imperial Senate.\nWhile on a diplomatic mission that would formally integrate Mindabaal into the Empire, Josephine's ship was raided by pirates and she was kidnapped, only to realize that her kidnapper was none other than her sister, who had left Mindabaal several years ago and cut all bonds with the Donovan family. When they returned to Mindabaal, they found it devastated by an Imperial planetary bombardment. That day, Josephine and Jericho teamed up as smugglers to thwart the Empire's cause. Josephine would especially make use of her diplomatic skills and her persuasive abilities, which were augmented by her good looks.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mindabaal",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jericho_Donovan",
  "/wiki/James_Ortell_Donovan",
  "/wiki/Astrogation/Legends",
  "/wiki/Mindabaal_Diplomatic_Corps",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Smugglers_of_the_Outer_Rim",
  "/wiki/Star_Wars_Adventure_Journal_5"
 ]
}