{
 "name": "Jothan Tiaan Jerjerrod",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tinnel IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jerjerrod family",
      "First Order",
      "New Republic",
      "New Republic Academy",
      "New Republic Academy",
      "Ripper-Raptors",
      "Resistance",
      "J-Squadron",
      "J-Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Jothan Tiaan Jerjerrod, more commonly referred to as Jo Jerjerrod, was a human male who served in the Resistance Starfighter Corps, commanding his own squadron during their conflict with the First Order. Jo was the grandson of Imperial Moff Tiaan Jerjerrod, who died aboard the second Death Star.\nJothan Tiaan Jerjerrod was born on the planet Tinnel IV. During his childhood on Tinnel IV, he encountered the Boddee family, a Gungan family who came from Naboo. The youngest member named Najeema Boddee later became long term friends with Jothan.\nJothan later joined the Resistance as a cadet and quickly earned a name for himself as one of the Resistance's most dedicated members. Jerjerrod came from a long line of loyal warriors, since both of Jerjerrod's parents were officers of the First Order, the military organization that formed from the ashes of the Galactic Empire, which the Resistance had sworn to fight. Jerjerrod, hearing the things his parents spoke of, realized quickly that he didn't agree with those ideals and that, in his opinion, those things wouldn't make the galaxy better. He then swore to defeat the First Order and joined the Resistance by pretending to enlist in the New Republic Military Academy of Ganthel. The academy's commander, sympathetic to the Resistance's aims, agreed to cover for Jerjerrod, with General Leia Organa and Admiral Gial Ackbar aware of the arrangement and allowing him to talk with his parents to maintain the charade.\nAs a result of his continued efforts, Jerjerrod was eventually placed in charge of J-Squadron, a squadron of otherwise new recruits within the Resistance.\nJo Jerjerrod possessed a no-nonsense personality and an abiding dislike of the First Order, whose ideals he felt were wrong for the galaxy. In pursuit of this, he threw his all into his training with the Resistance and had little patience for cadets who did not seem to take their time training with the Resistance seriously. Jerjerrod was somewhat reclusive and did not open up easily to others, but valued those who had proven their worth to him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Resistance",
  "/wiki/Tiaan_Jerjerrod",
  "/wiki/Galactic_Empire",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Jothan_Tiaan_Jerjerrod",
  "/wiki/Tinnel_IV",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jerjerrod_family",
  "/wiki/First_Order",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Academy",
  "/wiki/Ripper-Raptors",
  "/wiki/J-Squadron",
  "/wiki/Resistance_Starfighter_Corps",
  "/wiki/Cold_War",
  "/wiki/Moff",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Boddee_family",
  "/wiki/Gungan",
  "/wiki/Naboo",
  "/wiki/Najeema_Boddee",
  "/wiki/Cadet",
  "/wiki/Parent",
  "/wiki/Officer",
  "/wiki/The_galaxy",
  "/wiki/New_Republic_Military_Academy_(Ganthel)",
  "/wiki/Ganthel",
  "/wiki/Commander",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Squadron",
  "/wiki/Join_the_Resistance",
  "/wiki/Join_the_Resistance:_Escape_from_Vodran",
  "/wiki/Join_the_Resistance:_Attack_on_Starkiller_Base"
 ]
}