{
 "name": "Jova_Tarkin",
 "display_name": "Jova Tarkin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Eriadu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tarkin family"
     ]
    }
   ]
  }
 ],
 "content": "Jova Tarkin was a human male native to the planet Eriadu. A member of the Tarkin family, he was the paternal great-uncle of Wilhuff Tarkin.\nDuring his youth, Jova Tarkin was taken to endure his family's test in the Carrion Plateau on his homeworld of Eriadu. The lesson was meant to teach select Tarkin males the importance of what their family had built and the necessity to force others to abide by the imposed law, by force if need be. The Carrion was maintained as a way to show the Tarkins what Eriadu had been like before their ancestors had arrived from the Core to colonize their world, and to show them that \"life remained a constant battle for survival.\"\nOnce his initiation was done, Jova took the unexpected decision to remain in the Carrion to make it his home and become a permanent guide and mentor for future Tarkin initiates. This decision made him the first of the long line of Tarkins to choose to remain in the Carrion, building his own cabin on the land. In this capacity, Jova came to train his own nephew and his great-nephew, Wilhuff, when the time for their initiations came.\nJova Tarkin first appeared in the 2014 novel Tarkin, written by James Luceno. The character was based on several people Luceno met during his trips to Africa and the Americas, particularly a Belizean from Guatemala whom Luceno accompanied on hunts and long walks in a forest and used his machete to kill all animals they came across whether they were dangerous or not, warning Luceno that if he left his potential enemies lying about, one morning he could wake up with fangs in his throat.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tarkin_(disambiguation)",
  "/wiki/Eriadu",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Tarkin_family",
  "/wiki/Planet",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Carrion_Plateau",
  "/wiki/Homeworld",
  "/wiki/Core_Worlds",
  "/wiki/Jova_Tarkin%27s_cabin",
  "/wiki/Wilhuff_Tarkin%27s_father",
  "/wiki/Time",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jova_Tarkin",
  "/wiki/2014",
  "/wiki/Tarkin_(novel)",
  "/wiki/James_Luceno",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Age_of_Rebellion_-_Grand_Moff_Tarkin_1",
  "/wiki/October_24",
  "/wiki/June_24",
  "/wiki/2016"
 ]
}