{
 "name": "Jovan_Vharing",
 "display_name": "Jovan Vharing",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Interrogator"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Jovan Vharing was captain of the Interrogator.\nBorn into a family of high class and prominence, Vharing found himself joining the Imperial Naval Academy by tradition rather than choice, though he did not regret the decision.\nInitially clumsy with self-doubt around orders and his superiors, his early fears of being overwhelmed were soon extinguished with pride and ambition and was rewarded when he graduated the Academy in the top two percent of his class.\nCommissioned as a lieutenant, Vharing was assigned to a Victory-class Star Destroyer in the Outer Rim Territories as a senior tracking officer gaining attention for his abilities, most notably from Captain Nolaan. Having also served in the Outer Rim, Nolaan took an instant liking to the man and positioned himself as mentor and friend. For this Vharing's stay there was brief.\nNolaan didn't hide his bias and, to spite his subordinates, began calling in favors that brought Vharing to the Interrogator where Nolaan was serving under the direct command of High Inquisitor Antinnis Tremayne.\nWithin a year Nolaan was dead and Vharing found himself becoming one the youngest captains ever but, like his predecessor, a buffer between the wrath of the Inquisitor and the rest of the officers.\nWhile he was sleeping, one of Vharing's ambitious subordinates, Leeds, intercepted an unusual signal matching an early Rebel frequency coming from the planet Qlothos. Leeds ordered an attack but mistakes in the operation resulted in the death of around sixty prominent Imperial citizens.\nVharing was brought into Tremayne's waiting room and after three hours on his feet the Dark Jedi appeared. The captain felt his throat tighten and in the grip of Tremayne's Force choke his neck was crushed and he collapsed to the floor. His corpse dragged away by two stormtroopers.\nAnd so Vharing was dead, an unblemished career ended due to a error that was not his own.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jovan_(disambiguation)",
  "/wiki/3_ABY/Legends",
  "/wiki/Interrogator/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Imperial_Naval_Academy",
  "/wiki/Lieutenant/Legends",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Nolaan",
  "/wiki/High_Inquisitor",
  "/wiki/Antinnis_Tremayne",
  "/wiki/Leeds",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Qlothos",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Telekinesis/Legends#Force_choke",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Longest_Fall",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}