{
 "name": "Jowres_Zaprin",
 "display_name": "Jowres Zaprin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Jowres Zaprin was a male Human who lived on Naboo with his family at the time of the Galactic Civil War. His sister Mia called him Jowy.\nAfter the Battle of Yavin, Jowres Zaprin lived at the remote Zaprin Estate in the Gallo Mountains on Naboo with his father Larence, his mother and his sister Mia.\nIn 1 ABY, a group of sick narglatches and motts surrounded the Zaprin's home. Jowres and his sister Mia went outside to check the situation but were attacked by the crazed animals. Both were wounded by the animals and developed a severe infection. His worried father sent an urgent call for help and soon a medic sent by the 2-1B droid Billingsly arrived at the Zaprin Estate. The medic first tried to help Mia, but the treatment didn't work. So the medic single-handedly killed several of the feral creatures that surrounded the house. From blood samples extracted from the creatures' bodies, the medic was able to create an anti-toxin. After an injection with the new medicine, Jowres and Mia recovered from the infection within a week.\nJowres Zaprin was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Jowres Zaprin was added to the game upon the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.\nJowres Zaprin could be found in a remote building in the Nabooian Gallo Mountains south-east of the Lake Retreat. He was part of the quest \"House Call\" for players of the Medic profession. During each server reset, Jowres Zaprin's appearance was randomized, but he consistently appeared as a male Human.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Larence_Zaprin",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Naboo/Legends",
  "/wiki/Zaprin_family",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mia_Zaprin",
  "/wiki/Billingsly",
  "/wiki/Zaprin_Estate",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Gallo_Mountains/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Narglatch/Legends",
  "/wiki/Mott/Legends",
  "/wiki/Medic/Legends",
  "/wiki/2-1B_surgical_droid",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Varykino/Legends",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}