{
 "name": "Jreely_Toomb",
 "display_name": "Jreely Toomb",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Jreely Toomb was a male Jawa scavenger living during the Galactic War. Born on Tatooine, he and a fellow Jawa Blizz were recruited by the traveling salvager Slam Streever to work as \"ferrets\"—individuals he could send into dangerous areas to scout for valuable salvage. Jreely frequently bullied Blizz, pushing him around and taking his things. Slam and his crew eventually came to work for the White Maw pirate gang lord Reneget Vause on Hoth in 3642 BBY. There, Jreely betrayed Blizz, claiming that he was stealing salvage under his coat, which resulted in Blizz being kicked out, and Jreely obtaining Blizz' things. Blizz later joined the crew of the Grand Champion of the Great Hunt and with the help of Mako was able to track down Jreely and get most of his things back from him.\nAfter the Eternal Empire conquest in 3636 BBY Blizz returned to Hoth and started leading his own salvage crew of Jawas from Tatooine. He eventually accepted Jreely into his crew and despite forgiving him for the past betrayal still did not hold a high opinion of him. Around 3631 BBY Blizz and his crew, along with Jreely, were recruited by The Commander into the Anti-Zakuul alliance.\nJreely regretted his past misdeeds towards Blizz and warned the Commander to be a right kind of friend to Blizz or else he would \"make holes\" in the Commander. Later on, Jreely sought to steal the power core from Lana Beniko's message box and attempted to enlist the Commander's help in his plan.\nThough Jreely Toomb is mentioned by Blizz several times during the Bounty Hunter class story in Star Wars: The Old Republic, he did not make an actual appearance until the Knights of the Fallen Empire expansion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eternal_Alliance",
  "/wiki/Galactic_War",
  "/wiki/Blizz",
  "/wiki/Slam_Streever",
  "/wiki/White_Maw",
  "/wiki/Reneget_Vause",
  "/wiki/Hoth/Legends",
  "/wiki/3642_BBY",
  "/wiki/Grand_Champion_of_the_Great_Hunt",
  "/wiki/Mako_(slicer)",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/3636_BBY",
  "/wiki/3631_BBY",
  "/wiki/Alliance_Commander",
  "/wiki/Power_core/Legends",
  "/wiki/Lana_Beniko",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire"
 ]
}