{
 "name": "Jubilee",
 "display_name": "Jubilee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Fleet",
      "Alliance Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Jubilee was a Human Rebel Alliance officer who served alongside Captain Chedaki and First Officer Roak aboard their blockade runner during the Galactic Civil War. When Rebel Princess Leia Organa led an investigation into the Shiva system in 3 ABY, she and Chedaki were preparing a shuttle craft that was attached to the blockade runner when the shuttle was hit by mines.\nSince the resulting fire threatened to give away the Rebels' position to Imperial warcraft, Jubilee was tasked by Roak to fetch Chedaki and the Princess from the damaged craft and then jettison it from the mothership. When Jubilee realized that the jettison mechanism was dysfunctional, the Rebel panicked; despite the officer's frantic cries, Princess Organa instinctively shut herself in the shuttle and used its back-up trigger to detach it from the mothership, saving the lives of her crew.\nAn officer of the Rebel Alliance during the Galactic Civil War against the Galactic Empire, Jubilee served aboard a blockade runner under the command of Captain Chedaki. In 3 ABY, shortly after the Battle of Hoth, Jubilee crewed the vessel when it traveled to the remote Shiva system to investigate an irregularly high level of Imperial activity in the region. Their ship carried Rebel leader Princess Leia Organa, who headed the investigation, and when she and Chedaki attempted to scan the inhabited world of Shiva IV using a shuttle that was attached to the blockade runner, the latter flew into a minefield of anti-matter bombs. Much of the damage struck the shuttle craft, igniting its fuel tanks, and both it and its mothership were quickly filled with smoke.\nAboard the blockade runner, Jubilee was promptly ordered by First Officer Roak to go to the shuttle bay and help Organa and Chedaki escape the shuttle as well as to speedily give the officer a status report. The rest of the crew was then ordered to don pressure suits and to handle the fire aboard the mothership as it risked revealing their position to potential Imperial warcraft in the vicinity. By the time Jubilee reached the shuttle, they had received Roak's order to jettison it safely from the blockade runner's main hold, where the subordinate relayed the order to Organa in person. Glancing at Jubilee in response, Organa informed the officer that Chedaki was dead and said that she was on her way out of the shuttle.\nHowever, Jubilee was then notified by Roak via comlink that the firing circuits responsible for disconnecting the craft had been rendered inoperative. Becoming distraught, the junior crew member speculated that the explosion earlier had short-circuited the device. Organa ignored Jubilee's frantic cries and instinctively shut herself in the shuttle, using the back-up trigger within her craft to jettison it from the blockade runner. The Princess' decision to save the lives of her companions sent her falling toward Shiva IV with her shuttle craft ablaze, but she eventually returned to the Rebel Alliance safely.\nJubilee was a Human with wavy, brown hair. The Rebel exclaimed in shock when Roak pointed out via comlink that the jettisoning mechanism for the shuttle craft was inoperable. The crew member further cried in distress when Princess Organa locked herself in the shuttle craft and jettisoned it from the blockade runner.\nThe Rebel officer wore red gloves, a shirt with a red collar, and a headset comlink, which was used to remotely communicate with Roak.\nJubilee was created for the fifty-third issue of Marvel's Star Wars series of comics, which was written by Chris Claremont, illustrated by Carmine Infantino and Walter Simonson, and published on August 18, 1981.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Officer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Chedaki",
  "/wiki/Executive_officer/Legends",
  "/wiki/Roak",
  "/wiki/Chedaki%27s_blockade_runner",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Mission_to_the_Shiva_system",
  "/wiki/Shiva_system",
  "/wiki/3_ABY/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Anti-matter_bomb",
  "/wiki/Fire/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Rebel_ship_of_the_line",
  "/wiki/Planet/Legends",
  "/wiki/Shiva_IV",
  "/wiki/Pilot/Legends",
  "/wiki/Mine/Legends",
  "/wiki/Fuel/Legends",
  "/wiki/Enviro-suit",
  "/wiki/Time/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Headset_comlink",
  "/wiki/Star_Wars_(1977)_53",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Chris_Claremont",
  "/wiki/Carmine_Infantino",
  "/wiki/Walter_Simonson",
  "/wiki/August_18",
  "/wiki/1981",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_(1977)_54"
 ]
}