{
 "name": "Judder_Page%27s_father",
 "display_name": "Judder Page's father",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Senate",
      "Imperial Senate"
     ]
    }
   ]
  }
 ],
 "content": "A Human male senator served in the Imperial Senate as a representative of his homeworld of Corulag. Influential and corrupt, he pampered his son, Judder Page, who in turn despised him and used his wealth to train in combat. The Senator eventually sent his son to the Imperial Academy, hoping that Page's combat skills could serve the Galactic Empire. Many doors were opened for Page due to the Senator's influence, but the young man ultimately defected to the Rebel Alliance.\nDuring the Imperial Period, a male Human represented his homeworld of Corulag in the Imperial Senate. He was a prominent yet corrupt senator who gave his son, Judder Page, a pampered upbringing. Page despised his father, whom he wished could be more like the legendary Jedi Knights of the Old Republic. Inspired by tales of the Jedi, Page used his father's wealth to train himself in a variety of combat and defense techniques. The Senator indulged his son's fancy, supposing that the boy's idealism was merely a phase.\nOver the subsequent years, Page grew into a young man with strong moral standards. The Senator sent him to the Imperial Academy, reasoning that if his son were to train to be a soldier, his skills would best be put to use in the service of the Galactic Empire. As the son of a prominent senator from the galaxy's Core Worlds, Page found that vast avenues of study were open to him. Shortly after graduating with honors, Page defected to the Rebel Alliance, a militant faction that opposed the Empire in the ongoing Galactic Civil War. Although the Imperial Senate was dissolved by Emperor Palpatine in 0 BBY, Page was still considered the scion of an influential family thirty years later.\nThe Senator was a corrupt individual and was hated by his son, Judder Page, who believed that his father had sold out and that he possessed moral deficiencies. The Senator gave Page a pampered childhood and allowed his son to use his wealth to train in combat techniques, but he later forced Page to attend the Imperial Academy against the young man's wishes. The Senator's influence opened many doors for Page at the academy.\nJudder Page's father was first mentioned in 1991's Heir to the Empire Sourcebook, a supplement to West End Games' Star Wars: The Roleplaying Game that was written by Bill Slavicsek. He has subsequently been mentioned in Page's entries in various encyclopedic reference works. Page's father has been stated to be the Imperial Senator from Corulag for years, but 2003's Coruscant and the Core Worlds assigns that position to the character of Zafiel Snopps \"in the Rise of the Empire era and most of the Rebellion era,\" a time period that encompasses the Imperial Senate's entire existence. This information was never reconciled in the Star Wars Legends continuity.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Corulag/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Judder_Page/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Parent/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Dissolution_of_the_Imperial_Senate/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/29_ABY/Legends",
  "/wiki/1991",
  "/wiki/Heir_to_the_Empire_Sourcebook",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Bill_Slavicsek",
  "/wiki/2003",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/Zafiel_Snopps",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Rebellion_era",
  "/wiki/Time/Legends",
  "/wiki/Star_Wars",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force"
 ]
}