{
 "name": "Judd",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Moorjhone"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Unidentified reptilian species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Judd was a male Jedi Master and a member of the Jedi Order during the last years of the Galactic Republic.\nJudd, a male Jedi Master, served the Jedi Order during the last years of the Galactic Republic. At some point during his service to the Order, he had some of his bones broken. Around 20 BBY, during the height of the Clone Wars, the Jedi High Council learned that the Sith Lord Darth Maul had survived his encounter with Obi-Wan Kenobi over a decade prior, and that he had allied himself with his younger brother and fellow Sith, Savage Opress.\nAfter the Jedi Council learned that Ja'Boag, the head of Rim Commercial Mining, had placed a bounty on the heads of Maul and Opress, they tasked Judd, fellow Jedi Master Salmara and her Padawan, Dray, with discovering the reasons behind Ja'boag's bounty. Judd asked what they were to do if they discovered the actual location of the dark side brothers, and Yoda told him that Kenobi was already tracking them, but they should assist him if they can. Mace Windu also tasked Judd and the others with uncovering why the native population of Moorjhone had fallen silent since Ja'Boag's mining company arrived there. Windu urged Judd and the others to follow the Force and act accordingly.\nMaul and Opress also traveled to Moorjhone, and arrived before the Jedi, slaughtering the security forces and flinging Ja'Boag off a balcony. The Jedi arrived just in time, and Salmara caught Ja'Boag with the Force, saving his life. As Judd ignited his lightsaber, the two Dathomirian Zabrak brothers looked down on them from above—Opress was concerned they had been discovered while Maul was happy to be found by Jedi.\nAfter Salmara saved Ja'Boag, the Gossam ordered his troops to attack, but Salmara told them to wait. She then attempted to negotiate with the Sith brothers, asking them to surrender. Opress responded by telling her that they would all die, and Judd mocked Salmara for her \"good diplomacy\". The Nightbrothers attacked, slaughtering Ja'Boag's troopers. Judd threw himself in their path, clashing his lightstaff against their blades. Maul reacted quickly, bashing his lightsaber hilt against Judd's snout, causing blood to spray out. Judd smiled in response, happy to be facing a formidable warrior. He surprised the two Zabraks by knocking Opress on his back and deflecting Maul's counterattack. He then mocked Maul for his lack of legs, but Opress unleashed his rage, knocking both combatants away.\nSalmara flung a large container at Opress, and though Maul warned him, he lashed out without a thought, opening the container—which was full of carbonite. Opress was instantly frozen solid, to Maul's horror. Judd again mocked Maul for his cybernetic half, but Maul lashed out, grabbing Judd's right arm in his foot and snapping it in two. Maul then told Judd that he would have liked to have taken longer in killing him, but was suddenly stabbed from behind by Dray. Maul slashed at Dray, severed both of Dray's hands and flung them away. Salmara and the corporate troopers gave chase, but Maul managed to escape by pulling down the tunnel upon her pursuers.\nLater, Judd and Dray were both in a medical room, where Doctor Tresfor had Judd's arm encased in bacta. Tresfor had managed to reattach Dray's hands and had submerged the boy in a bacta tank. Judd remarked that Dray had bravely faced Maul, one of the most feared beings in the galaxy, then asked the doctor to tell him about the missing population of the planet. Tresfor attempted to avoid the question, but Judd pressed on. He made the assumption that the native species was being mistreated, and Tresfor quietly confirmed this without detail. When Judd became angry, saying that he didn't like cryptic messages, the doctor pointed out that the Day of Three Suns was approaching.\nJudd confronted Maul at the entrance of the mining facility. He offered Judd an ultimatum: either stop the Sith Lord right there and then, which would perpetuate the massacre that was taking place outside before their final destruction in the Day of Three Suns, or save the clashing armies outside at the cost of letting him free his brother and escape. Judd chose the latter, vowing that the Jedi Order would inevitably track down and bring an end to Maul's bloody reign over the Outer Rim regardless of the events on Moorjhone.\nJudd threw himself into the fire and used the Force to keep the blast door open so that the Moorjhoni and clone troopers would escape the suns' blazes. It was at this time that the Moorjhoni saw Judd as the true \"Demon in the Light\"; as the beams of the three suns came down upon them, the Jedi Master, in the process of burning alive, used his remaining strength to telekinetically propel General Kenobi and the remaining clones through the closing blast door, sacrificing his own life to save the Moorjhoni from complete destruction.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Moorjhone",
  "/wiki/Judd%27s_species",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Savage_Opress/Legends",
  "/wiki/Ja%27Boag",
  "/wiki/Rim_Commercial_Mining",
  "/wiki/Salmara",
  "/wiki/Padawan/Legends",
  "/wiki/Dray_(Fallen_Jedi)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dathomirian/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Long-handle_lightsaber",
  "/wiki/Force_rage",
  "/wiki/Carbonite/Legends",
  "/wiki/Shiak",
  "/wiki/Cho_mai/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Tresfor",
  "/wiki/Bacta/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Day_of_Three_Suns",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Darth_Maul%E2%80%94Death_Sentence_1",
  "/wiki/Darth_Maul%E2%80%94Death_Sentence_2",
  "/wiki/Darth_Maul%E2%80%94Death_Sentence_3",
  "/wiki/Darth_Maul%E2%80%94Death_Sentence_4"
 ]
}