{
 "name": "Jumpy",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Jumpy\" was the nickname of a clone trooper who served as a Clone Lieutenant in the Grand Army of the Republic during the Clone Wars. He helped escorting a senator to the planet Rylorii Minor for a trade agreement.\nJumpy was a clone of the bounty hunter Jango Fett and was created, raised and trained on Kamino. He became a member of the Grand Army of the Republic. He earned his nickname because his fellow clone thought that he was sometimes too alert.\nAt some point during the Clone Wars, Jumpy alongside CT2 and another clone trooper accompanied a senator of the Galactic Republic to the planet Rylorii Minor to assist her in a trade agreement between the local governement, represented by the Mayor Lup, and the Republic: the Republic would have permitted an unimpeded access through Republic space in exchange for the planet's mine resources. During the meeting between the two parts, a man with a truncheon tried to attack Lup and his associate, but Jumpy prevented that any damaged was inflicted to them. He then chased the man and captured him. Jumpy then took the man's cloak, after he had been arrested and taken away, and noticed it was manufactured on Coruscant; Lup thought, based on this information, that the assassin had been sent by the Republic and started debating with the senator and ordered the clones to leave.\nThe three clones were waiting outside of the building were the mayor and the senator when the mayor's associate came to them with some water glasses. Suddenly three masked assassins attacked them and on of them kidnapped the mayor's associate , while the clone were fighting the other two. Jumpy then jumped on a speeder bike and chased the assassin: the moment when he reached him, Jumpy punched him in the face, making him fall. Jumpy then dismounted too, while the mayor's associated ran away with the speeder bike. After a brief fight, Jumpy knocked out the assassin and brang him to the place they were before, where the other two had been tied with a rope.\nThe agreement then happened after it was found proof that the assassins were locals and not sent by the Republic. The senator, Jumpy and the other clones then left the planet on a LAAT.\nAs a clone of the human male bounty hunter Jango Fett, Jumpy was 1.83 meters tall and had tan-colored skin. By the time of the mission on Rylorii Minor the clone had light brown hair.\nJumpy was equipped with Phase II clone trooper armor with green markings and a DC-17 blaster pistol.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Lieutenant",
  "/wiki/Clone_Wars",
  "/wiki/Zast_Tri%27vak",
  "/wiki/Planet",
  "/wiki/Rylorii_Minor",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/CT2",
  "/wiki/Mayor",
  "/wiki/Lup",
  "/wiki/Mine",
  "/wiki/Truncheon",
  "/wiki/Cloak",
  "/wiki/Coruscant",
  "/wiki/Assassin",
  "/wiki/Water",
  "/wiki/Speeder_bike",
  "/wiki/Low_Altitude_Assault_Transport",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/DC-17_blaster_pistol",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_Trade_Relations_(Star_Wars_Adventures_8)",
  "/wiki/Star_Wars_Adventures_(2020)_8",
  "/wiki/Databank_(website)"
 ]
}