{
 "name": "Jungen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 Imperial standard meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jungen was a male Trandoshan outlaw and a former member of the Galactic Republic and the Galactic Empire. He later joined the Alliance to Restore the Republic.\nJungen was a member of the Galactic Republic and served in the Republic Navy during the Clone Wars. He served alongside the war hero, Adar Tallon, who by the final days of the Republic had become an Admiral. The Gand, Vytor Shrike, also served alongside Jungen and Tallon. Jungen was much younger than Tallon, but he quickly came to respect the intelligence and abilities of the elder warrior.\nThe galaxy changed in 19 BBY, when the Galactic Empire was formed, and Supreme Chancellor Palpatine declared himself Emperor. Jungen's friend and commander, Tallon, immediately became concerned with the changes Palpatine had brought about, especially the elimination of the Jedi Order. Tallon began to speak out against the New Order, making him and his loyal crew targets. Knowing that Palpatine would soon eliminate him despite his popularity, Tallon decided to fake his death, and Jungen and the rest of the crew agreed to follow suit. Jungen in particular pledged his full support for anything that Tallon ordered.\nTallon hired a freighter to stand by in the Dalchon system and enlisted his pirate friend Quist to \"attack\" it while Tallon's ship, the Battalion, was in the vicinity. The Battalion arrived, supposedly to help defend the freighter; Quist turned his attention to the new arrival, and Jungen, Tallon, and the others safely transferred to the freighter as Quist destroyed the Battalion. In accordance with Tallon's instructions, the freighter then took the crew to the planet of Tatooine, far in the Outer Rim Territories.\nThankfully, among beings in the Empire, it was commonly accepted that Jungen had died with Tallon and his crew while defending helpless merchants from pirates - Even Palpatine bought the story. Once on Tatooine, Jungen and the Battalion crew bought new identities. While Tallon decided to stay on the planet and settled into a new life, Jungen became a bounty hunter.\nYears later, around 0 BBY, Jungen received word that Tallon had been discovered by the Empire and was near capture. Tallon asked Jungen and Shrike to help him escape, and the two hurried to Tatooine to help their former Admiral, where they were joined by Quist. Holing up in the ancient Fort Tusken, Tallon and his allies held off Imperial agents and bounty hunters, including Jodo Kast, Zardra, and Puggles Trodd. At the same time, agents of the Alliance to Restore the Republic made their way inside Fort Tusken, intent on rescuing Tallon and having him join their cause. Unknown to Jungen and the others, Quist had previously been captured by the Empire and had betrayed Tallon and the others in exchange for his life. As the agents from the Alliance tried to convince Tallon that they were truly who they said, Quist took Tallon's wife, Kay Tallon, hostage. He then allowed the Imperial bounty hunters to enter the fort. Jungen rushed to defend Tallon from the hunters, but he and Shrike were paralyzed by Kast. The Rebel agents were able to beat back the bounty hunters, however, and Quist freed Kay when the tables turned against him. Tallon was able to escape Tatooine with his wife and the Rebels, and subsequently joined the Alliance.\nJungen also joined the Alliance, becoming a special operative. He was once attacked by the bounty hunter Ssach'thirix, whom specialized in the killing of reptilian Rebels, but survived.\nJungen was considered to be a deliberate and quiet individual, with a deep rumbling voice. He was quite strong, and preferred hand-to-hand combat over using a blaster. He felt no guilt over stealing from those whom he saw as evil. Unusual for a Trandoshan, Jungen would go out of his way to help a being in need.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Adar_Tallon/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gand/Legends",
  "/wiki/Vytor_Shrike",
  "/wiki/The_galaxy/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Dalchon_system",
  "/wiki/Pirate/Legends",
  "/wiki/Quist_(pirate)",
  "/wiki/Battalion_(Praetor-class)",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Fort_Tusken/Legends",
  "/wiki/Jodo_Kast",
  "/wiki/Zardra",
  "/wiki/Puggles_Trodd/Legends",
  "/wiki/Kay_Tallon",
  "/wiki/Ssach%27thirix",
  "/wiki/Blaster/Legends",
  "/wiki/Tatooine_Manhunt",
  "/wiki/West_End_Games",
  "/wiki/Classic_Adventures:_Volume_Three",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}