{
 "name": "Junn_Gobint",
 "display_name": "Junn Gobint",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mythrol"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Junn Gobint was a post-fledgling Mythrol male who served the Resistance, managing consumables replenishment for starfighters at their base on the moon Ajan Kloss. He was also an amateur chemist, concocting new additives to extend fuel supplies and experimenting with alternative power sources.\nIn 35 ABY, he witnessed acting Generals Poe Dameron and Finn receive transmissions from their ally Rey that left a trail for them to follow through the Unknown Regions to the planet Exegol. The forces of the Resistance then scrambled to attack the Sith Eternal based there.\nJunn Gobint was a Mythrol male who served the Resistance during the post-fledgling stage of his life. During the war between the Resistance and the First Order, Gobint was part of the group of Resistance members who set up base on the jungle moon Ajan Kloss. He was responsible for managing the replenishment of consumables for the starships of the Resistance Starfighter Corps pilots stationed at the base. He concocted new additives to extend fuel supplies and experimented with alternative power sources.\nIn 35 ABY, he was present in the base shortly after the YT-1300 light freighter known as the Millennium Falcon returned to Ajan Kloss from the planet Kijimi. Gobint was carrying a hose through the base when acting Generals Poe Dameron and Finn and head mechanic Rose Tico began examining data from the droid D-O. When the droids C-3PO and R2-D2 interrupted, Gobint and several other Resistance members began gathering round the group to see what the commotion was.\nAfter R2 revealed that he was receiving a message from Jedi Master Luke Skywalker's old X-wing starfighter, the Mythrol watched as Finn analyzed the transmission and realized it was their ally Rey leaving them a trail to locate the planet Exegol in the Unknown Regions. With this information, the Resistance scrambled its forces to attack the forces of the Sith Eternal on Exegol.\nJunn Gobint was an amateur chemist and carefully catalogued each milliliter of liquid metal rippinnium and each vial of coaxium in the Resistance's stores. He chastised any pilots who used more resources on an assignment then they had been allotted. Gobint had blue skin with red markings.\nHe wore a yellow jumpsuit with brown boots and gloves and a white belt. On base he made use of a reinforced sleeve refueling hose with a filter port.\nJunn Gobint was portrayed by comedian Jeff Garlin in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. Garlin, a friend of director J.J. Abrams, filmed in London and spent four hours in makeup for the role.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Junn",
  "/wiki/Mythrol",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Starfighter",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Fuel",
  "/wiki/35_ABY",
  "/wiki/General",
  "/wiki/Poe_Dameron",
  "/wiki/Finn",
  "/wiki/Rey_Skywalker",
  "/wiki/Unknown_Regions",
  "/wiki/Planet",
  "/wiki/Exegol",
  "/wiki/Resistance_navy",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Jungle",
  "/wiki/Starship",
  "/wiki/Resistance_Starfighter_Corps",
  "/wiki/Pilot",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Kijimi",
  "/wiki/Technician",
  "/wiki/Rose_Tico",
  "/wiki/Droid",
  "/wiki/D-O",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/X-wing_starfighter",
  "/wiki/Liter/Legends",
  "/wiki/Rippinnium",
  "/wiki/Coaxium",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Belt",
  "/wiki/Jeff_Garlin",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/J.J._Abrams"
 ]
}