{
 "name": "Juno Eclipse's mother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    },
    {
     "name": "Died",
     "values": [
      "bet. 19 BBY and 3 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Juno Eclipse's mother was a female Human who lived during the early period of the Galactic Empire. Together with her husband and daughter, the Eclipse family resided on the Core world of Corulag. She was ultimately killed in a crossfire between Imperial loyalists and insurgents on their homeworld, thus leaving her daughter to be raised by a negligent father.\nThe female Human who gave birth to Juno Eclipse worked as a teacher on the planet Corulag. Her husband—a man of the same species—was a civilian engineer who strongly supported the Galactic Empire. The New Order flourished on their homeworld, although locals opposed Emperor Palpatine's rule. Their insurrection inadvertently caused the death of Eclipse's mother, who died in a firefight between Imperial soldiers and insurgents. She was survived by her husband and daughter.\nAlthough Juno Eclipse longed for her father's approval, the two were never close and eventually parted ways after Eclipse joined the Imperial Navy. By 3 BBY, she had very little memory of her mother due to the fact that she died while Eclipse was a young child. Eclipse ultimately defected from the Empire and became one of the first members of the Alliance to Restore the Republic in 2 BBY.\nJuno Eclipse's Human mother was a young, educated woman. She had long blond hair, which she pinned back with a brooch made from a round black stone. Unlike her husband who adhered to the Humanocentric policies of the New Order, she encouraged her daughter's fascination with alien cultures.\nJuno Eclipse's mother first appeared in the novelization of the 2008 video game Star Wars: The Force Unleashed, written by author Sean Williams. She was also mentioned in the game's databank profile for Eclipse.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corulag/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Juno_Eclipse%27s_father",
  "/wiki/Juno_Eclipse/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Loyalist/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Species/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Black",
  "/wiki/Stone/Legends",
  "/wiki/Human_High_Culture",
  "/wiki/Alien/Legends",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/2008",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/Sean_Williams",
  "/wiki/PlayStation_3",
  "/wiki/Xbox_360"
 ]
}