{
 "name": "Juno Eclipse's father",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "The father of Juno Eclipse was a male Human who lived during the final years of the Old Republic and into the era of the Galactic Empire. A staunch supporter of Emperor Palpatine and a firm believer in the tenets of the New Order, he instilled his values into his daughter, Juno Eclipse. However, as a result of their dysfunctional relationship, the younger Eclipse promptly left her home planet of Corulag after joining the Imperial Navy, effectively severing ties between daughter and father.\nThe father of Juno Eclipse, a male Human married to a woman of the same species, lived around the time of the Republic's transformation into the Galactic Empire in 19 BBY. Shortly after the start of the New Order, his wife gave birth to their daughter and only child, Juno Eclipse, on the Core planet of Corulag. According to Imperial records, Eclipse's mother was killed after being in a firefight between Imperial soldiers and insurgents on Corulag. Thus, her widower was left to raise their daughter, although he would have preferred to serve in the Imperial Military instead. His failure to pass the physical exam, however, barred him from gaining entry into the Imperial Academy. Forced to remain as a civilian engineer, Eclipse's father became a bitter and resentful man who, because of his frustrations, became increasingly cold and distant to his daughter.\nWhile still living on Corulag, Eclipse and her father relocated to a new home, which contained an illegal holo of Jedi armed with lightsabers. Upon discovering the holo, the father showed its content to her before erasing it. Due to his loyalty to Emperor Palpatine, he regarded the Jedi Order with hatred and disgust; its members were branded as traitors for their alleged assassination attempt on Palpatine's life shortly before the end of the Clone Wars.\nAt the age of 14, Eclipse was admitted into the Academy as the youngest cadet to ever gain entry. Given that her father was a fierce admirer of anyone who enlisted into the service of the Empire, she hoped that her own loyalty and dedication to the New Order would meet with his approval. Her actions had an obstinate effect, however. The daughter ultimately achieved everything her father had ever wanted, and on the day when she completed her time at the Academy as an honor student, her father failed to attend the graduation ceremony. After accepting the fact that her father would never give his approval to her, Eclipse departed from her homeworld to serve in the ranks of the Imperial Navy. By then, the feelings of loathing and resentment were mutually shared between father and daughter, and thus contact between the two had ceased immediately after Eclipse left Corulag. No longer caring for her father, she went on to build a successful career as an Imperial officer and TIE pilot, partly to spite him by becoming all that he could never be.\nThe Human father of Juno Eclipse was cold and distant, particularly toward his daughter. Following the death of his wife, he blamed \"insurgents\" for his family's loss, and thus came to hate all enemies of the Galactic Empire. His support for Emperor Palpatine also caused him to develop an extreme hatred for the members of the Jedi Order who, from his point of view, were all traitors for attempting to overthrow Palpatine. His adherence to the ideals of the New Order extended to its Humancentric policy; he strongly disapproved of his daughter's fascination with alien cultures, unlike his late wife who encouraged Eclipse's interest.\nThough Juno Eclipse longed for her father's approval, he refused to give it to her. An angry and ill-tempered man, he often directed his repressed feelings of frustration and resentment at his daughter through mostly verbal abuse. While his bitter disposition was largely the cause behind Eclipse's lonely childhood, his strong support for the Empire's armed forces inspired Eclipse to pursue a career in the Imperial Navy.\nJuno Eclipse's father first appeared in the novelization of the 2008 video game Star Wars: The Force Unleashed, written by author Sean Williams. He was also mentioned in the game's databank profile for Eclipse.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corulag/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Juno_Eclipse/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Juno_Eclipse%27s_mother",
  "/wiki/Species/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/19_BBY/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Imperial_records",
  "/wiki/Death/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Corulag_Academy",
  "/wiki/Engineer/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Showdown_on_Coruscant",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Cadet/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/TIE_pilot",
  "/wiki/Human_High_Culture",
  "/wiki/Alien/Legends",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/2008",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/Sean_Williams",
  "/wiki/PlayStation_3",
  "/wiki/Xbox_360"
 ]
}