{
 "name": "Jural",
 "display_name": "Jural",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Times"
     ]
    }
   ]
  }
 ],
 "content": "Jural was a female Bothan who worked for the Corellian Times during the Galactic Civil War in 1.5 ABY. She was best known for her investigative reports on galactic exploration. She and her brother, Talper, were dispatched to Mustafar to cover the excavation of a ruined Jedi temple by one Dr. Namdaot. When they arrived at the ruins, they were amazed to find the doctor was now claiming to be the Storm Lord. The Storm Lord demanded their allegiance, but they fled from the ruins. Shortly after, Talper became deathly ill, and Jural set up camp just outside the ruins. Relan and a spacer working for Ithes Olok discovered the Bothans' camp, and she relayed her story to them. Jural begged them for their help, stating that the Storm Lord had inflicted her brother with some kind of wasting disease because he refused to swear allegiance to the Storm Lord. She asked the spacer to help her brother by slaying the Storm Lord and his minions. The spacer agreed and set out towards the ruin, defeating every minion the Storm Lord threw in his way, including the Storm Lord's prophet. At the end, the spacer and the Storm Lord went head to head, and the Storm Lord was slain. The spacer returned to the two Bothans to find Talper in good health. Jural was overjoyed, and rewarded the spacer with a special Mustafarian medicine injector.\nJural was a non-playable character in the Star Wars Galaxies expansion pack Trials of Obi-Wan, released in 2005 prior to the game's closure on December 15, 2011. The mentioned Mustafarian medicine injector that she rewarded the player with was a special usable item that increased the player's combat stats for a short time. Her The Complete Star Wars Encyclopedia entry lists the Storm Lord as the \"Storm King.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corellian_Times",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Talper",
  "/wiki/Mustafar/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Storm_Lord",
  "/wiki/Spacer/Legends",
  "/wiki/Ithes_Olok",
  "/wiki/Mustafarian/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jural",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/2005",
  "/wiki/December_15",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Sony"
 ]
}