{
 "name": "Jurgan Kalta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "By 3956 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Jurgan Kalta was a Zabrak male mercenary who was active during the time before the Great Sith War of 3996 BBY. In his quest to gain recognition as a mercenary, Kalta made use of his favored assault rifle, a powerful carbine, and a custom power suit that left him without equals in conventional combat. In addition to his combat prowess, Kalta was known for his ability to adapt to any scenario or environment. However, despite his skills, Kalta's enemies were eventually able to outsmart the Zabrak mercenary with a gaxxan brain-slug placed on his pillow—an unconventional attack that ended up killing him. By the year 3956 BBY, his powerful equipment had been scattered throughout the galaxy and was for sale at various locations.\nA male member of the Zabrak species, Jurgan Kalta was active as a mercenary during the time prior to the Great Sith War, which was fought between the Galactic Republic and the forces of Exar Kun's Sith Empire during the year 3996 BBY. During his career, one of Kalta's goals was to become well known as a mercenary. While he favored his assault rifle, Kalta also commissioned a powerful carbine to use in combat. Despite his many enemies, the Zabrak mercenary was able to overcome his opponents due to his adaptability and the use of his custom power suit. After his enemies were unable to kill him in conventional combat, a gaxxan brain-slug was left on his pillow, which ultimately ended Kalta's life.\nFollowing his death, Jurgan Kalta's weapons and armor were eventually separated and scattered throughout the galaxy. By the year 3956 BBY, his assault rifle had ended up in the possession of a Twi'lek businessman named Crattis Yurkal, who placed the weapon up for sale at 8,000 credits in his shop within the Jedi Enclave on the planet Dantooine. Around the same time, Kalta's carbine was for sale at 4,500 credits at the Hunting Lodge of an Ithorian hunter named Fazza Utral, which was located in Anchorhead on the planet Tatooine. His power suit ended up in a secret stash of high-quality equipment owned by the Rodian bartender Mika Dorin, who ran The Drunk Side cantina in a settlement known as Dreshdae on the planet Korriban. While he would not sell items in his stash to the general public, Dorin was willing to sell the armor for 10,000 credits to invited individuals, who were sometimes directed to the shop by his associate, a Twi'lek named Ziagrom.\nWhile working as a mercenary, Jurgan Kalta had the goal of gaining recognition, and his preferred method of attracting attention was through the pain of his enemies. Although he found destruction to be amusing, Kalta favored adaptability over sheer power when it came to weapons. While his skills aided him in combat against his enemies, he was outwitted via the use of a gaxxan brain-slug, which ended up killing him.\nDuring his career as a mercenary, Jurgan Kalta's favorite weapon was his assault rifle, as the weapon shared his adaptive qualities. His rifle was extremely accurate and was especially effective against droids. He also commissioned a highly accurate and powerful carbine, which he viewed to be amusingly destructive. For protection, Kalta wore a custom power suit that made him very difficult to defeat in combat. In the end, all of his powerful equipment was unable to prevent his death.\nJurgan Kalta was first mentioned in the 2003 BioWare video game Star Wars: Knights of the Old Republic, where the Zabrak mercenary was only mentioned in the descriptions for his assault rifle, carbine, and power suit. The player could purchase Kalta's assault rifle from Crattis Yurkal on Dantooine and his carbine from Fazza Utral on Tatooine. For Kalta's power suit to be available, the player must first escape from the Sith Interdictor ship Leviathan and meet with a Twi'lek named Ziagrom in the landing area of any planet. The Twi'lek would speak to the player and give directions to his associate Mika Dorin on the planet Korriban. After this chain of events, the player could purchase many powerful items, including the power suit, from Dorin's shop located in the Dreshdae cantina. However, Ziagrom does not always appear every time the game is played through, and if he does not speak to the player, Kalta's power suit cannot be purchased.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3956_BBY",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Time/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/3996_BBY",
  "/wiki/Jurgan_Kalta%27s_assault_rifle",
  "/wiki/Jurgan_Kalta%27s_carbine",
  "/wiki/Jurgan_Kalta%27s_power_suit",
  "/wiki/Gaxxan_brain-slug",
  "/wiki/Pillow/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Species/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Sith_Empire_(Great_Sith_War)",
  "/wiki/Armor/Legends",
  "/wiki/Assault_blaster_rifle",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Crattis_Yurkal",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Aratech_Mercantile",
  "/wiki/Jedi_Enclave",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Hunting_Lodge",
  "/wiki/Ithorian/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Fazza_Utral",
  "/wiki/Anchorhead/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Powersuit",
  "/wiki/Rodian/Legends",
  "/wiki/Bartender/Legends",
  "/wiki/Mika_Dorin",
  "/wiki/The_Drunk_Side",
  "/wiki/Cantina/Legends",
  "/wiki/Dreshdae",
  "/wiki/Korriban",
  "/wiki/Ziagrom",
  "/wiki/Brain/Legends",
  "/wiki/Slug_(creature)/Legends",
  "/wiki/Rifle/Legends",
  "/wiki/Droid/Legends",
  "/wiki/2003",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Interdictor-class_cruiser",
  "/wiki/Leviathan_(Interdictor-class_cruiser)",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_New_Essential_Chronology"
 ]
}