{
 "name": "Jurokk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Jurokk was a Human male Jedi Master and Gate Keeper of the Jedi Temple on the planet Coruscant during the Clone Wars, having risen to the position by 22 BBY. In 19 BBY, Jedi Knight Anakin Skywalker revealed to Jedi Master Mace Windu that Supreme Chancellor Palpatine was secretly the Dark Lord of the Sith, Darth Sidious. Jurokk, along with fellow Master Shaak Ti, was tasked by Windu with the defense of the Temple while Master Windu and three other Jedi attempted to arrest Palpatine. Some time later, Jurokk approached Skywalker at the Temple Gates, asking what had happened to the Jedi Masters, before noticing thousands of clone troopers approaching the Temple behind Skywalker. Skywalker, however, had turned to the dark side and had become Sidious's apprentice, taking the moniker Darth Vader. Vader stabbed his lightsaber through Jurokk's head, killing the Gate Master and making him the first victim of the ensuing massacre in the Jedi Temple.\nJurokk was a Human male Jedi Master who had become a Gate Master by 22 BBY, a position held by members of the Temple Security Force. In this position, he monitored the entrance to the Jedi Temple on the planet Coruscant, the capital of the Galactic Republic. In 19 BBY, Jurokk attended a briefing held by Jedi Master Obi-Wan Kenobi which discussed the ongoing Outer Rim Sieges. The Clone Wars were coming to an end when Jedi Knight Anakin Skywalker reported to Jedi Master Mace Windu that Supreme Chancellor Palpatine was, in fact, the Dark Lord of the Sith Darth Sidious. Windu chose to arrest Sidious, taking a team of three Jedi Masters—Agen Kolar, Saesee Tiin, and Kit Fisto—with him while he tasked Jurokk and fellow Master Shaak Ti with the defense of the Temple.\nShortly thereafter, Jurokk spotted Skywalker on a monitor and rushed to the Temple Gate. Jurokk inquired after the four Jedi Masters, but Skywalker simply asked him where Shaak Ti was. After the Gate Master told him that Ti was meditating in her quarters, he noticed thousands of clone troopers behind Skywalker and again demanded to know what had happened to Windu's team. Unbeknownst to Jurokk, however, Skywalker had helped Sidious defeat Windu, becoming the Dark Lord's apprentice and taking the name Darth Vader. Vader put his lightsaber under Jurokk's chin and activated it, killing the Gate Master. The last thing Jurokk heard was Skywalker's response that Jurokk had \"no idea\" what was going on. Vader slew Jurokk without remorse and proceeded to kill most of the Jedi in the Temple.\nJurokk was trusted to watch over the defense of the Jedi Temple as the Gate Master. However, even though he was attuned to the Force, Jurokk couldn't sense that Skywalker had turned to the dark side, and was slain without a chance to defend himself. Jurokk was bald, with tan skin, and had a tattoo on the left side of his head.\nJurokk first appeared as a minor character in the 2005 Revenge of the Sith novelization, written by Matthew Stover. He later received a mention in The Jedi Path: A Manual for Students of the Force, written by Daniel Wallace in 2010. Endnotes for The Jedi Path identified Jurokk as having appeared in the Revenge of the Sith video game, though Wallace later admitted this was an error. In 2012, Jurokk was retconned to have appeared in Star Wars: Episode III Revenge of the Sith by Rogues Gallery: The Last Stand of the Jedi!, an article in Star Wars Insider 137.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Gate_Master",
  "/wiki/Jedi_Temple",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Showdown_on_Coruscant",
  "/wiki/Time/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Shiak",
  "/wiki/Lightsaber/Legends",
  "/wiki/Death/Legends",
  "/wiki/Operation:_Knightfall",
  "/wiki/Temple_Security_Force",
  "/wiki/Jedi_Temple_Public_Entrance",
  "/wiki/Capital/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Outer_Rim_Sieges/Legends",
  "/wiki/Agen_Kolar/Legends",
  "/wiki/Saesee_Tiin/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Shaak_Ti%27s_quarters",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(novelization)",
  "/wiki/Matthew_Stover",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Daniel_Wallace",
  "/wiki/2010",
  "/wiki/Star_Wars_Episode_III:_Revenge_of_the_Sith_(video_game)",
  "/wiki/2012",
  "/wiki/Retcon",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_137",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(unabridged_audiobook)",
  "/wiki/Star_Wars_Chronicles:_The_Prequels",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_New_Essential_Chronology"
 ]
}