{
 "name": "Just Lucky",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sixth Kin",
      "House of Tagge"
     ]
    }
   ]
  }
 ],
 "content": "Just Lucky was a human male smuggler and assassin. He had worked both with and against the rogue archaeologist Doctor Chelli Aphra on multiple occasions.\nJust Lucky was a smuggler who operated during the Imperial Era. At one point, he tried to kill rogue Doctor Chelli Aphra on Qlint and also worked with her on Dathomir. In the weeks following the Battle of Hoth, Lucky worked in a crew alongside Aphra and the bounty hunters Krrsantan and Tubleek Ruz to steal supplies that the Galactic Empire was transporting offworld. After their successful ambush of a patrol of snowtroopers, Ruz turned on Aphra, but Lucky used a sniper to kill Ruz. The three comrades then left the planet in the Ark Angel III.\nThe crew traveled to the Shadow University in the Outer Rim and, after buying drinks in the cantina, met University student Detta Yao, who offered Aphra a chance to help her find the Rings of Vaale. Unbeknownst to the others, Ronen Tagge approached Lucky in the cantina regarding his younger brother Pak's outstanding debts. Offering to pay off the debts in exchange for loyalty and service, Lucky agreed to the arrangement to benefit his brother. Rejoining with the others, Lucky followed Aphra to the Ruins of Kolkur to find Aphra's former classmate, Doctor Eustacia Okka. However, as they tried to recruit her for their expedition, a group of mercenaries arrived on behalf of Ronen Tagge, who also wanted the rings. A firefight ensued, but the group was able to escape, with Okka agreeing to help them in hopes of being reinstated to the University. As they set course for the planet Dianth, Lucky warned the crew about Tagge's influence, saying that he would likely stop at nothing to get his hands on the rings.\nEn route to Dianth, Okka's droid TA-418 played a message from Tagge to Okka and Aphra, and Lucky noted to Yao that someone with access to her droid must be helping Tagge pursue them. As Aphra told the crew about her past with Tagge, Lucky sat and cleaned his weapon. As they entered Vaale, Lucky began to hear a loud high-pitched noise that none of the other party members could hear. As the group ventured into the workshop of The Architects of Vaale and then underground into their sanctum, Lucky doubled back to the murals to look for clues on how to pass through the door along with Okka. When Yao attempted to use a code to open the door, it began to emit a loud sound. Lucky and Black Krrsantan both fired at the key, causing the noise to stop but the floor to collapse out from under them. Lucky, Krrsantan, and Okka fell while Aphra and Yao remained on the surface, where they were quickly surrounded by forces sent by Tagge.\nLucky, Krrsantan, and Professor Okka made their way from where they fell to the Mausoleum of the Architects where the Ring of Fortune sat on a pedestal. Stealing the ring from Okka without her knowledge, the three regrouped with Aphra and Yao in time for the Tagge security forces to find them and secure the room. Revealing that he possessed the Ring and was under the employ of the Tagges, Lucky ordered his troops to lock the expedition team in a cellar and bury the door behind rubble. Ordering that the Tagge fleet bombard the planet from orbit, Lucky and his team left Dianth behind to return to Ronen Tagge Cantonica and collect his payment. Arriving at Canto Bight, Lucky and his team were dismayed when Tagge cut the payment to a third because they failed to collect Professor Okka and the Ring of Immortality. Holding the threat of cutting off Lucky's brother over the mercenary's head, Lucky agreed to the pay cut and accepted a night at the Crescent Royale Casino for him and his team. While in the casino, Lucky saw the news about the explosion on the Tagge Pavilion, rushing to get there. At the penthouse, he found Ronen Tagge still alive, took the Ring of Fortune for himself and informed Domina Tagge about the incident.\nJust Lucky first appeared in the first issue of the comic series Star Wars: Doctor Aphra which was written by Alyssa Wong, illustrated by Marika Cresta, and published by Marvel Comics on May 4, 2020. The character was revealed ahead of the issue's release on January 23, 2020 in a StarWars.com article that announced the comic series and provided information regarding its narrative and principle characters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sixth_Kin",
  "/wiki/House_of_Tagge",
  "/wiki/Smuggler",
  "/wiki/Assassin",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Imperial_Era",
  "/wiki/Qlint",
  "/wiki/Dathomir",
  "/wiki/Time",
  "/wiki/Battle_of_Hoth",
  "/wiki/Bounty_hunter",
  "/wiki/Krrsantan",
  "/wiki/Tubleek_Ruz",
  "/wiki/Galactic_Empire",
  "/wiki/Snowtrooper",
  "/wiki/Ark_Angel_III",
  "/wiki/Shadow_University",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Cantina",
  "/wiki/Detta_Yao",
  "/wiki/Rings_of_Vaale",
  "/wiki/Ronen_Tagge",
  "/wiki/Pak",
  "/wiki/Ruins_of_Kolkur",
  "/wiki/Eustacia_Okka",
  "/wiki/Tagge%27s_mercenaries",
  "/wiki/Dianth",
  "/wiki/TA-418",
  "/wiki/Vaale",
  "/wiki/The_Architects_of_Vaale",
  "/wiki/Ring_of_Fortune",
  "/wiki/Orbital_bombardment",
  "/wiki/Cantonica",
  "/wiki/Canto_Bight",
  "/wiki/Ring_of_Immortality",
  "/wiki/Crescent_Royale_Casino",
  "/wiki/Domina_Tagge",
  "/wiki/Doctor_Aphra_(2020)_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Doctor_Aphra_(2020)",
  "/wiki/Alyssa_Wong",
  "/wiki/Marika_Cresta",
  "/wiki/Marvel_Comics",
  "/wiki/May_4",
  "/wiki/2020",
  "/wiki/January_23",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Just_Lucky",
  "/wiki/Doctor_Aphra_(2020)_2",
  "/wiki/Doctor_Aphra_(2020)_3",
  "/wiki/Doctor_Aphra_(2020)_4",
  "/wiki/Doctor_Aphra_(2020)_5",
  "/wiki/Doctor_Aphra_(2020)_6",
  "/wiki/Doctor_Aphra_(2020)_7",
  "/wiki/Doctor_Aphra_(2020)_8",
  "/wiki/Doctor_Aphra_(2020)_9",
  "/wiki/Doctor_Aphra_(2020)_10",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Doctor_Aphra_(2020)_11",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/Doctor_Aphra_(2020)_13",
  "/wiki/Doctor_Aphra_(2020)_14",
  "/wiki/Doctor_Aphra_(2020)_15",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Doctor_Aphra_(2020)_17",
  "/wiki/Doctor_Aphra_(2020)_18",
  "/wiki/Doctor_Aphra_(2020)_19",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/Doctor_Aphra_(2020)_23",
  "/wiki/Doctor_Aphra_(2020)_24",
  "/wiki/Doctor_Aphra_(2020)_25",
  "/wiki/Doctor_Aphra_(2020)_27",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_204"
 ]
}