{
 "name": "Juul",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darmas Pollaran's informant network"
     ]
    }
   ]
  }
 ],
 "content": "Juul was a female Human resident of Coruscant and the sister of Jiik. In 3643 BBY the Justicars' Brigade arrested her brother and Juul had to ask help from the Voidhound to get him out.\nIn the year 3643 BBY, Juul lived with her brother Jiik on the Republic capital world of Coruscant. The siblings worked as informants for the network of Darmas Pollaran. While tailing notorious criminal Skavak for Polloran, the two entered the territory of the Justicars' Brigade and were forced to separate to keep from being captured. Jiik continued following Skavak and saw him head into the Works, but was imprisoned by the Justicars. after she witnessed them meet with their backers in the reconstituted Sith Empire.\nJuul rendezvoused with Corso Riggs and a smuggler captain who had enlisted Pollaran to help them track down Skavak. She angrily confronted the smuggler, blaming them for her brother's capture, and told them they would have to free Jiik from the Justicars' Tower to find out where Skavak went. Juul warned the two they would have to disable the security cameras, which she referred to as \"droid-eyes\", so that the Justicars would not be able to identify them or her brother, and demanded they take a holocommunicator with them so she would be able to speak with Jiik once he was freed.\nThe outlaws were able to free Jiik, and the two siblings spoke over Juul's holocommunicator. Jiik told them of the Justicar's dealings with the Sith and Skavak's destination. Juul suggested that in order for him to hide from the Justicars, he crawl through a tunnel they had found earlier to a warehouse, where she could hide him from the Justicars, and had him take the holocommunicator from the captain so she would be able to watch him as he crawled through the tunnel.\nLiving in the harsher areas of Coruscant, which she referred to as 'turfer land', caused Jiik to develop a severe demeanor. When her brother was captured by the Justicars, she blamed the future Voidhound and Corso Riggs, as they were responsible for the siblings tracking Skavak, but also expressed serious concern over her brother. She made sure the Voidhound brought a holocommunicator with them so she would be able to talk to Jiik the moment he was free, and had him take it with him when he crawled through the tunnels, out of concern for her injured brother.\nJiik was aware that Corso and the smuggler would need to disable the Justicars' security cameras, so they could not be identified, but displayed an ignorance of technology by referring to them as \"droid-eyes\". She also expressed dislike and contempt towards the two outlaws, calling them \"cloudheads\" and indicated that she believed they were not used to the harsher regions of Coruscant.\nJiik had brown hair, blue eyes, and tan skin. Together with her brother, she was a skilled tracker and was able to lead the Justicars' away from Jiik without letting them catch her.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Darmas_Pollaran%27s_informant_network",
  "/wiki/Coruscant/Legends",
  "/wiki/Jiik",
  "/wiki/3643_BBY",
  "/wiki/Justicars%27_Brigade",
  "/wiki/Voidhound",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Darmas_Pollaran",
  "/wiki/Skavak/Legends",
  "/wiki/Justicar_territory",
  "/wiki/Sector_943",
  "/wiki/Prisoner/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Corso_Riggs",
  "/wiki/Smuggler/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Justicars%27_Tower",
  "/wiki/Droid/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Holocomm/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)"
 ]
}