{
 "name": "Juvard Illip Oggurobb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange-brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Scanner on right eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Kajidic",
     "values": [
      "Illip"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Task Force Nova",
      "Task Force Nova",
      "Hutt Cartel",
      "Eternal Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Juvard Illip Oggurobb, also known briefly as Lippi, was a male Hutt hailing from within the Illip clan. A scientist and an inventor, he was responsible for a number of major advances in the field of droid engineering. Doctor Oggurobb lived sometime before the renewed war between the Galactic Republic and the resurgent Sith Empire, and was a five-time recipient of the Bao-Dur Science Prize. He accompanied the Supreme Mogul Toborro to Makeb during the Hutt Cartel's takeover in 3638 BBY. Years later, he would become the Head Scientist of the Eternal Alliance.\nBorn to the Illip Hutt clan, Juvard took on the profession of a droid engineer, considered an odd career choice for a Hutt. Oggurobb soon made several major advances in droid engineering and was a five-time recipient of the Bao-Dur Science Prize. His achievements were quickly noticed by the Hutt Cartel's new Supreme Mogul, Toborro, and was hired to aid the Cartel during their invasion of the planet Makeb.\nWhen the Galactic Republic came to the aid of the people of Makeb against the Hutts and the InterStellar Regulators, Makeb's former defense force, Oggurobb pleaded with Toborro to see reason when the Republic forces captured the Ark in order to evacuate the people of Makeb when it became clear the planet was in its death throes. Toborro, paranoid and insane, refused, leaving Oggurobb no choice but to offer his services and knowledge to the Republic in exchange for getting off Makeb. He revealed to the Republic the nature of isotope-5, the rare substance discovered during the Hutts' deep-core mining operations, and revealed that the Ark would not fly without the isotope-5 fuel rods that Oggurobb had crafted for it.\nWhen the Republic forces prepared to take on Toborro himself, Oggurobb revealed that he had constructed a secret entrance into Toborro's Palace, one not even the Hutt leader himself knew about. With Oggurobb's aid, the Republic team was able to enter Toborro's palace, defeat the mad Hutt and his monstrous droid creation, and retrieve the fuel rods for the Ark. Oggurobb was onboard the craft, maintaining its power levels, as it blasted off from Makeb's surface.\nAfter the conflict, Oggurobb became the official liaison between the Cartel and the Galactic Republic, something he found irritating.\nFive years later, Oggurobb joined the Alliance to contribute his scientific expertise in combating the Eternal Empire, as well as recruiting individuals specializing in different sciences. Oggurobb petitioned the Alliance Commander for permission to run non-lethal tests on C2-N2 and 2V-R8 with isotope-5 to create droids to combat skytroopers. In the course of his experiments, Oggurobb's team was able to recover the critically damaged and deactivated HK-55. With a few modifications to the chassis, they were able to reactivate the bodyguard droid. Unfortunately, they were unable to repair his memory core and were forced to replace it. This lead to the droid having no memory of any of his adventures prior to his reactivation within Oggurobb's lab.\nOggurobb was instrumental in designing the Eternal Alliance's planetary shield. Its strength was tested after Bey'wan Aygo of the Alliance's Military Operations challenged Oggurobb to a bet. If Aygo's strongest battleship could not break through Odessen's planetary shield, then Aygo would would have to pay Oggurobb a debt. The planetary shield held the assault, thus Oggurobb won the bet.\nJuvard became a doctor/scientist, something uncommon for Hutts, a species whose members usually became crime lords. Juvard also appeared to be very self-assured of himself and called himself an artist. However, unlike his employer, Toborro, he has a self-preservation instinct.\nJuvard, like the rest of his species, was large. He also had purple skin, with blue tattoos on his chest. He also wore a computer interface visor over his right eye.\nJuvard is fluent in both Huttese and Basic, though all Hutts prefer to speak in the former language. However, when dealing with other sentients, Juvard would switch to Basic to avoid linguistic misunderstandings.\nLike several Hutts who had to work with technology in the Old Republic era, Kabbura and Qiltakka for example, Juvard wore a computer interface visor over that hooked onto his right side of his head and covered his right eye.\nOggurobb was first mentioned in the 2012 reference guide Star Wars: The Old Republic Encyclopedia. Players who pre-ordered Star Wars: The Old Republic: Rise of the Hutt Cartel, the first digital expansion for the BioWare-LucasArts video game Star Wars: The Old Republic, received an exclusive holostatue of Oggurobb as one of the rewards for purchasing the expansion before its release on April 14, 2013. The holostatue acts as a Class Trainer for all classes, both Republic and Imperial.\nIn the Rise of the Hutt Cartel, Oggurobb first identified himself as \"Lippi,\" a bit-of-a play-on with his kajidic, Illip. He is voiced by Fred Tatasciore.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Juvard_Illip_Oggurobb",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Illip",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Task_Force_Nova",
  "/wiki/Hutt_Cartel",
  "/wiki/Eternal_Alliance",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Kajidic/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Bao-Dur_Science_Prize",
  "/wiki/Supreme_Mogul",
  "/wiki/Toborro",
  "/wiki/Makeb",
  "/wiki/Conquest_of_Makeb",
  "/wiki/3638_BBY",
  "/wiki/InterStellar_Regulators",
  "/wiki/The_Ark",
  "/wiki/Isotope-5",
  "/wiki/Avesta_family",
  "/wiki/Toborro%27s_Palace",
  "/wiki/Toborro%27s_Glittering_Fury",
  "/wiki/Eternal_Empire",
  "/wiki/Alliance_Commander",
  "/wiki/Hollis-series_steward_droid",
  "/wiki/Seneschal-series_factotum_droid",
  "/wiki/Skytrooper",
  "/wiki/HK-55",
  "/wiki/Planetary_shield/Legends",
  "/wiki/Bey%27wan_Aygo",
  "/wiki/Military_Operations",
  "/wiki/Battleship/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Computer_interface_visor",
  "/wiki/Huttese/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Old_Republic_era",
  "/wiki/Kabbura",
  "/wiki/Qiltakka",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/April_14",
  "/wiki/2013",
  "/wiki/Fred_Tatasciore",
  "/wiki/Category:Images_of_Juvard_Illip_Oggurobb",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught"
 ]
}