{
 "name": "Jyl Somtay",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Lura Tranor"
     ]
    }
   ]
  }
 ],
 "content": "Jyl Somtay was a female Human Jedi Knight who served the Jedi Order and the Galactic Republic during the final decades of the Republic Classic era.\nDiscovered to be Force-sensitive as a child, the Human female Jyl Somtay entered into the academy at the Coruscant Jedi Temple and began to learn the ways of the Force. Eventually graduating the academy, Somtay was selected as a Padawan by Jedi Master Lura Tranor to travel the galaxy and train one-on-one. In 22 BBY, Somtay became well acquainted with Jedi High Councilor Coleman Trebor. Constructing for herself a blue-bladed lightsaber and growing knowledgeable about the Force, Somtay spent many years with Tranor until she was ready to pass her Trials of Knighthood.\nCompleting the trials and becoming a Jedi Knight, Somtay was not among the Jedi to travel to Geonosis at the height of the Separatist Crisis between the Republic and the Confederacy of Independent Systems; a mission that would spark the tragic and bloody Clone Wars. While both Somtay's former master Lura Tranor and her good friend Master Coleman Trebor died on the dust fields of Geonosis,\nSomtay accepted a mission to the battered world immediately after the battle there. Having been given the rank of Commander in the Grand Army of the Republic, Somtay was placed in charge of several clone troopers. Leading an occupation force of clone troopers on Geonosis, Somtay was assigned to oversee the local population's cooperation in transitioning into a Republic-occupied society. During her work there Somtay was contacted by Doctor Frayne, a scientist studying the world's local culture, and asked to join the Jedi in her work. Volunteering to aide Somtay uncover and contain Geonosian war technology, Frayne secretly desired to steal the tech and sell it on the black market. Upon meeting with Frayne, Somtay was rendered unconscious and awoke some time later tied back to back with Frayne's companion, Naj Pandoor. After freeing themselves and fighting off a group of Geonsosians, the pair set out in search of Frayne. Jedi Somtay and Pandoor quickly discovered the doctor's severed head; the woman had been killed by a loosed nexu. Somtay managed to escape the nexu herself when the beast was attacked by a pack of rogas.\nAround the year 21 BBY, Somtay joined on an attack against a Separatist munitions factory. She recovered Master Obi-Wan Kenobi and Anakin Skywalker after their fleet of Venator-class destroyers were obliterated by the Separatist battleship Starcrusher. Somtay piloted a T-6 shuttle into hyperspace past the Starcrusher. Upon their return to Coruscant, the Jedi Council decided to send a strike team to destroy the Starcrusher. The strike team consisted of Masters Kenobi, Master Mace Windu, and Ki-Adi-Mundi, along with Somtay and Skywalker's Padawan, Ahsoka Tano. Skywalker was sent to the planet Daltarri at the behest of Supreme Chancellor Palpatine.\nThe strike team, along with three Venator-class Star Destroyers, attacked a Separatist refueling ship in deep space. The Jedi team left one of the warships in a T-6 shuttle and Somtay flew them under the refueling ship's detection grid. The Starcrusher then arrived, and the Republic ships left. The Jedi team snuck aboard the refueling ship as the Starcrusher Admiral Kirst launched reinforcements. The refueling ship's Captain Jorm met the squad of B2 super battle droids as they came onboard. Once the droids were out of sight, the Jedi attacked the droids and used their shells as a disguise. The strike team then took the droid's Sheathipede-class shuttle to board the Starcrusher. Once aboard, the Jedi left their disguises. The crew of the Separatist warship detected their presence, and Admiral Kirst ordered his crew to abandon ship—the ship the Jedi had boarded was a decoy. When the Jedi went back to the hangar, the shuttle exploded. The Jedi were stuck onboard with a failing life support, and the decoy was heading into the nearby star.\n\nTano and Somtay split off from the others to explore the ship. They discovered a Separatist officer, Lieutenant Daan. Somtay tried a mind trick on the woman, but the crew had been conditioned to resist such tricks. The two Jedi convinced her to help them. Daan showed the Jedi a cache of space suits. Kenobi was then contacted by Skywalker, who had arrived after feeling a premonition of danger on Dalltarri. Just then, the real Starcrusher arrived. Kenobi came up with a plan to escape. He had the strike team pull up wire as Skywalker attacked the warship. Kenobi succeeded in magnetizing the decoy's hull and drew the real ship in. The strike team escaped from the decoy as both Separatist warships were drawn into the star, and the team was picked up by a tow cable from Skywalker's starfighter. The team later returned to the Jedi Temple, and Somtay and Tano planned on going out for caf and \"girl talk.\"On Coruscant, Senator Yong Dolor experienced an assassination attempt, in 21 BBY, by infamous bounty hunter Aurra Sing on the wishes of Lorn, Dolor's aide, wanting to take his place as Senator. Somtay confronted Sing, telling her that she was the target, and knocking her weapon away with her lightsaber. Sing drew a poisoned ryyk blade, but the Jedi succeeded in capturing her. She tried a mind trick to reveal the bounty hunter's client, but Sing faked compliance, and was dragged away by GU-series \"Guardian\" police droids.\nSomtay was then thanked by Lorn and Dolor. Later, at the Temple, Master Windu offered his assistance to Somtay as she disguised herself as Sing in an attempt to find out who the Senator's enemies were. Meanwhile, Sing broke out of confinement after faking a medical emergency. Somtay investigated a dive bar, claiming she was there to get paid. The real Sing then arrived, and the two started fighting again. They dropped a blade and a lightsaber in the melee. Ultimately Somtay prevailed, knocking out the bounty hunter. They then insisted that she get paid and met the client. When Lorn revealed himself, Somtay insisted he was under arrest. Lorn drew a spear, but she deflected it with her lightsaber, and the aide surrendered. Afterward, Windu debriefed her.\nJyl Somtay first appeared in the short story \"Death in the Catacombs\", from Star Wars Insider 79.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lura_Tranor",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Coleman_Trebor/Legends",
  "/wiki/Lightsaber",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Coleman_Trebor",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Frayne",
  "/wiki/Geonosian/Legends",
  "/wiki/Naj_Pandoor",
  "/wiki/Nexu/Legends",
  "/wiki/Roga",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Attack_on_the_Separatist_munitions_factory",
  "/wiki/Separatist_munitions_factory",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Battleship/Legends",
  "/wiki/Starcrusher/Legends",
  "/wiki/T-6_shuttle/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Daltarri",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Separatist_refueling_ship",
  "/wiki/Realspace/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Kirst_(admiral)",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/Sheathipede-class_transport_shuttle/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Star/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Daan_(Human)",
  "/wiki/Mind_trick/Legends",
  "/wiki/Enviro-suit",
  "/wiki/Power_harpoon",
  "/wiki/Anakin_Skywalker%27s_Delta-7B_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Caf/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Yong_Dolor",
  "/wiki/21_BBY",
  "/wiki/Aurra_Sing",
  "/wiki/Lorn_(aide)",
  "/wiki/Ryyk_blade",
  "/wiki/GU-series_%22Guardian%22_police_droid",
  "/wiki/Death_in_the_Catacombs",
  "/wiki/Star_Wars_Insider_79",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Clone_Wars:_The_Starcrusher_Trap",
  "/wiki/Jedi_Masquerade",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.28",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Battle_of_Christophsis/Legends",
  "/wiki/Star_Wars_Annual_2011",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Comic_UK",
  "/wiki/Burn_the_Behemoth!"
 ]
}