{
 "name": "Jyss_Cordam",
 "display_name": "Jyss Cordam",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Sandy"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ti'mere's InfoServices"
     ]
    }
   ]
  }
 ],
 "content": "Jyss Cordam worked as a slicer for Byro Ti'mere at Ti'mere's InfoServices.\nJyss Cordam was a computer technician and slicer who worked under Byro Ti'mere at Ti'mere's InfoServices. He was also one of the company's salesmen, and was InfoService's contact for corporate clients. Cordam's work led him to travel extensively throughout the Brak sector, meeting new and existing clients and opening new contracts for those seeking InfoServices' assistance. His work also takes him regularly to Brugga in the Latoma system to talk with Ti'mere.\nCordam travelled aboard his personal SU 161 stock light freighter, and was constantly accompanied by his R2-series astromech droid, R2-L3. Due to the number of corporate bounties on his head, R2-L3 records all discussions and transactions, as well as acting as a look-out in case of trouble.\nCordam was a Near-Human of medium height, with curly, sand-colored hair. He possessed a relaxed smile and bright eyes. Cordam's had an outgoing and confident, energetic personality, that he used to deliver smooth sales pitches.\nCordam always dressed in smart clothing. He carried a portable computer and computer spike, a blaster pistol and comlink.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Ti%27mere%27s_InfoServices",
  "/wiki/Slicer/Legends",
  "/wiki/Byro_Ti%27mere",
  "/wiki/Computer/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Brak_sector",
  "/wiki/Brugga",
  "/wiki/Latoma_system",
  "/wiki/SU_161_stock_light_freighter",
  "/wiki/R2-series_astromech_droid",
  "/wiki/R2-L3/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Portable_computer",
  "/wiki/Computer_spike",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Flashpoint!_Brak_Sector"
 ]
}