{
 "name": "K%27cri_Elban",
 "display_name": "K'cri Elban",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.92 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "K'cri's Cafe"
     ]
    }
   ]
  }
 ],
 "content": "K'cri Elban was the owner of K'cri's Cafe on Figg Avenue, Cloud City.\nK'cri Elban was a Human male who fought in the Clone Wars, and was regarded as a hero in the conflict. However, before Palpatine's rise to Galactic Emperor, he became withdrawn and indifferent to the affairs of the galaxy, giving help to no one. By the time of the Galactic Civil War, Elban was in his forties and running the crooked K'cri's Cafe casino on the outskirts of the Administrative Levels on Figg Avenue on Bespin's Cloud City. He was accompanied by his droid companion from the Clone Wars, Essay-Emthree, who performed songs dating back to the time of the Galactic Republic on an ancient stand up synthtone.\nFollowing the ordered evacuation of Cloud City in 3 ABY, Elban planned to take over mining operations in the city by blowing the operations up during a miner's strike, pinning the blame on Chief Pentro of Galentro Rangers Security.\nK'cri Elban was 1.92 meters tall, and by his forties had started to get soft in the fair and his hairline started to recede. He started to stoop and hunch his shoulders forward, and perpetually looked dour. His speech was peppered with \"bah\"s and \"hmmph\"s. His main concern was keeping his business running, and he refused to answer any questions about his past involvement in the Clone Wars. Although cynical and uninvolved, he was a good guy at heart and could be convinced to help the Alliance to Restore the Republic if he was approached in the correct manner.\nElban was trained to use a blaster and skilled in unarmed combat. He was knowledgeable about other alien species, bureaucratic procedure, and the business of running a casino. Elban was also also a competent gambler.\nElban carried a comlink and a datapad, and armed himself with a stun pistol.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/K%27cri%27s_Cafe",
  "/wiki/Figg_Avenue",
  "/wiki/Cloud_City/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Casino/Legends",
  "/wiki/Administrative_Levels",
  "/wiki/Bespin/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Essay-Emthree",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Synthtone/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Pentro",
  "/wiki/Galentro_Rangers_Security",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Gambler/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Stun_pistol",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)",
  "/wiki/Gamemaster_Toolkit:_Live-Action_Adventures"
 ]
}