{
 "name": "K%C3%A9ral_Longknife",
 "display_name": "Kéral Longknife",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shiva IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "T'Syriél"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Twelve Tribes of T'Syriél"
     ]
    }
   ]
  }
 ],
 "content": "Kéral Longknife was a male T'Syriél who served as the Demarch of the Twelve Tribes of T'Syriél on the planet Shiva IV during the era of the Galactic Civil War. In 2 ABY, Longknife signed the Concordat of Peace with Warlord Aron Peacebringer of the Human Calian Confederacy, ending generations of warfare between the two peoples. Afterward, the two became blood brothers and close companions, and the next year worked together to foil an Imperial plot to conquer Shiva IV.\nA T'Syriél male native of the remote planet Shiva IV, Kéral Longknife was the Demarch of his homeworld's ancient and proud Twelve Tribes of T'Syriél during the era of the Galactic Civil War. Although the T'Syriél had traditionally been at war with the Humans of the Calian Confederacy, around 2 ABY Longknife signed the Concordat of Peace with Calian Warlord Aron Peacebringer, ending generations of conflict. In doing so, Longknife and Peacebringer became blood brothers, and were at each others' sides during campaigns to come.\nIn 3 ABY, Longknife joined Peacebringer and two of his Calian companions, Jain Havero and Ygal Delois, to investigate the sudden severing of communications between the Calian capital Illyriaqüm and the city K'avor. Along the way, they rescued a young offworlder woman named Leia Organa, an important Rebel leader who had crash-landed on Shiva IV, and was being menaced by T'Syriél outcasts, and proceeded onward to find K'avor utterly destroyed in mysterious fashion. Several weeks later, they learned the cause: an Imperial General named Bentilais san Sk'ar had conspired with Delois to conquer the world and install Delois as its new ruler, and had tested a devastating anti-matter bomb on K'avor. As Peacebringer and Organa raced to prevent Sk'ar and Delois from unleashing another such weapon on Illyriaqüm, Longknife linked up with two of Organa's Rebel comrades, Luke Skywalker and Chewbacca, who had tracked Organa to Shiva IV and arrived in the nick of time. Longknife and the Rebels provided reinforcement to Peacebringer as they battled the Imperials, ultimately foiling Sk'ar's plan and keeping Shiva IV free.\nAlthough Kéral Longknife was heir to generations of enmity between the T'Syriél and the Calians, he and his blood-brother Aron Peacebringer had a different vision for their homeworld's future, forging a close companionship and bringing peace to Shiva IV together. However, Longknife took a dim view at times of his people's progression after the Concordat of Peace, lamenting their loss of bravery in battle. However, his loyalty to his blood-brother was strong, and Longknife was quick to rush to Peacebringer's aid when the battle with the Imperials became dire. Longknife was extremely impressed by the fighting might of the Wookiee Chewbacca, regarding him as one of the finest warriors he had ever encountered.\nKéral Longknife first appeared in Star Wars  53, written by Chris Claremont and released in 1981. In his two appearances in the original Marvel Star Wars comic series, Longknife's name is spelled two different ways: Kéral in Star Wars 53, Kerál in Star Wars  54. However, the inconsistency was cleared up in later mentions, which spelled his name Kéral.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shiva_IV",
  "/wiki/T%27Syri%C3%A9l",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Twelve_Tribes_of_T%27Syri%C3%A9l",
  "/wiki/Alisande",
  "/wiki/Demarch",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Concordat_of_Peace",
  "/wiki/Warlord/Legends",
  "/wiki/Aron_Peacebringer",
  "/wiki/Human/Legends",
  "/wiki/Calian_Confederacy",
  "/wiki/Blood_brother",
  "/wiki/3_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Jain_Havero",
  "/wiki/Ygal_Delois",
  "/wiki/Capital/Legends",
  "/wiki/Illyriaq%C3%BCm",
  "/wiki/City/Legends",
  "/wiki/K%27avor",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/Bentilais_san_Sk%27ar",
  "/wiki/Anti-matter_bomb",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Star_Wars_(1977)_53",
  "/wiki/Chris_Claremont",
  "/wiki/1981",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_(1977)_54",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Aliens_in_the_Empire",
  "/wiki/StarWars.com",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}