{
 "name": "Kaa'to Leeachos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kadas'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Kaat'o Leeachos was a Kadas'sa'Nikto male bounty hunter who operated during the early years of the Galactic Empire.\nKaat'o Leeachos was a Kadas'sa'Nikto male who was born during the latter years of the Galactic Republic. Leeachos began his career the service of the Hutt slaver Morbiss as a security guard. He later accompanied Morbiss on a trip to the planet Malastare, so that the Hutt could bet on the world's podraces. However, while Leeachos was dealing with a disobedient slave on the edge of Morbiss' docking bay, a rival of the Hutt detonated a bomb, killing Morbiss and causing Leeachos to lose his right leg, as well as suffering severe burns to his right arm. When a team of Gran medics arrived on the scene, Leeachos used a hidden cache of credits to bribe them into replacing his leg with a cybernetic replacement.\nFree from servitude to the Hutts, Leeachos worked as a hired guard on Malastare for a period of time until earning enough credits to gain passage off of the world. From there he ventured to Rodia, the only world to which he could afford to travel, where he entered the employ of the Rodian bounty hunter Knoke, who trained him in the art of claiming bounties. After Knoke perished while attempting to claim a contract for the capture of a rogue Jedi during the midst of the Great Jedi Purge, Leeachos successfully fulfilled the contract in the wake of his master's death and went on the forge a reputation for himself as a successful bounty hunter.\nAt some point in his career, Leeachos purchased a Z-95 Headhunter for himself, which he named the Blade's Edge.\nLeeachos later betrayed the Pyke Syndicate, a powerful underworld syndicate, who subsequently dispatched a group of agents to apprehend the Nikto. The agents subsequently tracked down and defeated Leeachos in the depths of the underworld cityscape of the planet Coruscant.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kadas%27sa%27Nikto/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Morbiss",
  "/wiki/Planet/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Death/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Cybernetics/Legends",
  "/wiki/Time/Legends",
  "/wiki/Rodia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Knoke",
  "/wiki/Bounty/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Blade%27s_Edge",
  "/wiki/Pyke_Syndicate/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Coruscant/Legends",
  "/wiki/Under_a_Black_Sun",
  "/wiki/Lords_of_Nal_Hutta",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Most_Wanted_Expansion_Pack",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Z-95-AF4_Headhunter_Expansion_Pack"
 ]
}