{
 "name": "Kaat Thrick-Thrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Somewhere in the Nebula Forso"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaat Thrick-Thrick's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light-colored"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Perpendicular Universe Fair",
      "Find Your Equilibrium",
      "Find Your Equilibrium"
     ]
    }
   ]
  }
 ],
 "content": "Kaat Thrick-Thrick was a female Xaf Award–winning horticultural educator from the Outer Rim Nebula Forso who specialized in cranial flowers and sponsored the Find Your Equilibrium contest at the Perpendicular Universe Fair. Thrick-Thrick at one point participated in a seminar along with other distinguished guests. She lived and worked with her three families in a hubcap.\nKaat Thrick-Thrick was a female member of a biped species with short eyestalks, light-colored eyes, and a shriveled mouth from Nebula Forso, within the Meram sector of the Outer Rim Territories. She was a specialist in cranial flowers and made her career by teaching horticulture. Her responsibilities as an educator revolved around everything from product development to in-vitro fertilization of skull seedlings.\nThrick-Thrick was also the main sponsor of the annual Find Your Equilibrium contest at the Perpendicular Universe Fair, which helped garner her three Xaf Awards. She lived and conducted her work inside a housing structure known as a hubcap with her three families.\nThrick-Thrick once took part in a seminar with other eminent figures such as Regalia Sub-space station-12 director mOKDAR 15, Manifold Mollusk Matrix and Matrimony Association director Skreen, University of Desultori scholar and author Aanxi Raanxi Laanxi, and Galloway Island resident 26-424, who was only present for the feedings.\nKaat Thrick-Thrick was first featured in a segment named \"The Seminar Participants,\" written by Bob Carrau for the 1993 book Monsters and Aliens from George Lucas, a publication that combines creature designs and photographs from various projects of George Lucas, creator of the Star Wars franchise, with original text by Carrau. Lucasfilm employee Leland Chee, who maintains the Holocron continuity database, has indicated that information contained in the book is non-canonical.\nStar Wars Blog contributor Kevin Beentjes speculated that Kaat Thrick-Thrick's design could have been the inspiration for the Utai species, which also had eyestalks and a humanoid figure.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Nebula_Forso",
  "/wiki/Kaat_Thrick-Thrick%27s_species",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Perpendicular_Universe_Fair",
  "/wiki/Find_Your_Equilibrium",
  "/wiki/Xaf_Awards",
  "/wiki/Horticulturist",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Cranial_flower",
  "/wiki/Unidentified_seminar",
  "/wiki/Hubcap",
  "/wiki/Eye/Legends",
  "/wiki/Mouth/Legends",
  "/wiki/Meram_sector",
  "/wiki/Standard_year/Legends",
  "/wiki/Regalia_Sub-space_station-12",
  "/wiki/Director/Legends",
  "/wiki/MOKDAR_15",
  "/wiki/Manifold_Mollusk_Matrix_and_Matrimony_Association",
  "/wiki/Skreen",
  "/wiki/University_of_Desultori",
  "/wiki/Author/Legends",
  "/wiki/Aanxi_Raanxi_Laanxi",
  "/wiki/Galloway_Island",
  "/wiki/26-424",
  "/wiki/Bob_Carrau",
  "/wiki/1993",
  "/wiki/Monsters_and_Aliens_from_George_Lucas",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars",
  "/wiki/Leland_Chee",
  "/wiki/Holocron_continuity_database",
  "/wiki/Star_Wars_Blog",
  "/wiki/Kevin_Beentjes",
  "/wiki/Utai/Legends",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/May_3",
  "/wiki/2006",
  "/wiki/The_New_Essential_Guide_to_Alien_Species"
 ]
}