{
 "name": "Kaba Baiz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Glavis Ringworld"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kaba Baiz's meat packing plant"
     ]
    }
   ]
  }
 ],
 "content": "Kaba Baiz was a Klatooinian male boss of a meat packing plant on the space station Glavis Ringworld. Baiz had a  9850 bounty for him, and was tracked down by the Mandalorian bounty hunter Din Djarin around 9 ABY. Djarin confronted Baiz, who pretended to be another individual in order to throw off the bounty hunter. The Mandalorian, though, was not fooled by the Klatooinian. Baiz's workers attacked Djarin, who defeated them all before cutting Baiz himself in two and bringing his head back to an Ishi Tib guild master.\nAround 9 ABY, the male Klatooinian Kaba Baiz was the boss of a meat packing plant on the ringed space station Glavis Ringworld, which employed many other Klatooinians. At that time, though, Baiz came to owe credits to an Ishi Tib guild master and managed to acquire a  9850 bounty on him. Hired by the guild master, the Mandalorian bounty hunter Din Djarin made his way to the meat packing plant and confronted Baiz while he and one of his workers counted New Republic credits. With the Mandalorian asked after Baiz, revealing a tracking fob for the Klatooinian, the boss pretended to be a different individual and asked what the bounty hunter wanted of Baiz.\nAfter Djarin pointed out the Klatooinian's debt, Baiz falsely promised to let the Mandalorian's target know when he saw him, only for the bounty hunter to reveal a bounty puck with his face and bounty on. Baiz denied the face on the puck was him, but the Mandalorian then told the boss's workers in the room to leave. With his workers not moving, the Klatooinian declared Djarin was surrounded and offered him a chance discuss alternative options. The bounty hunter, though, stated that he would bring Baiz in alive or dead.\nAs Djarin drew his blaster pistol, one of Baiz's workers disarmed him, and the Mandalorian fought the Klatooinian workers around him, killing all but one. Rising from his seat, Baiz drew his own blaster pistol and fired at the bounty hunter. However, Djarin dug a knife into Baiz's chest and threw him onto his table, cutting him in two with the Darksaber, a black lightsaber and a symbolic weapon for the Mandalorians. With the boss's surviving worker fleeing the room, the bounty hunter cut off Baiz's head and convinced the a group of Klatooinian meat packers, who had come to confront the Mandalorian, to go and plunder Baiz's credits. Djarin then took the head of Baiz back to the Ishi Tib guild master, who gave him the Klatooinian's reward and some information in exchange.\nA Klatooinian male, Kaba Baiz had light brown skin and brown eyes. When confronted by Din Djarin, he denied his identity to evade capture by the bounty hunter. Even when shown his own face on a bounty puck he chose to deny that it looked like him. With his efforts unfruitful, he instead threatened the Mandalorian with an attack from his workers.\nBaiz wore a white apron with a red, brown and green patterned tunic over it and brown trousers, boots and a belt. He wielded a blaster pistol.\nKaba Baiz appeared in \"Chapter 5: Return of the Mandalorian\" of the Disney+ series The Book of Boba Fett, which was directed by Bryce Dallas Howard and released on January 26, 2022. He was portrayed by Ardeshir Radpour.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_ABY",
  "/wiki/Glavis_Ringworld",
  "/wiki/Klatooinian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kaba_Baiz%27s_meat_packing_plant",
  "/wiki/Space_station",
  "/wiki/Credit",
  "/wiki/Bounty",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Hunting",
  "/wiki/Ishi_Tib",
  "/wiki/Unidentified_Ishi_Tib_guild_master",
  "/wiki/Hunt_for_Kaba_Baiz",
  "/wiki/New_Republic",
  "/wiki/Tracking_fob",
  "/wiki/Holopuck",
  "/wiki/Death",
  "/wiki/The_Mandalorian%27s_IB-94_blaster_pistol",
  "/wiki/Blaster_pistol",
  "/wiki/Knife",
  "/wiki/Darksaber",
  "/wiki/Lightsaber",
  "/wiki/Eye",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Blaster",
  "/wiki/Pistol",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Bryce_Dallas_Howard",
  "/wiki/January_26",
  "/wiki/2022",
  "/wiki/Ardeshir_Radpour",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Boba_Fett",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_7:_In_the_Name_of_Honor"
 ]
}