{
 "name": "Kad_Chun",
 "display_name": "Kad Chun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Telos IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Kad Chun, later known as Uni, was the second of the two sons born to Vox Chun, a political manipulator and powerful presence on Telos IV. His father was long under the influence of Xanatos, the rogue Jedi, and Kad was born into a world of distrust and manipulation.\nKad Chun's older brother, Bruck, had been taken to the Jedi Temple on Coruscant to be trained as a Jedi very early, quite possibly before Kad was born. When his older brother, his hero, was killed, he blamed the young Obi-Wan Kenobi and could believe no wrong of his late brother. He seemed to hate Obi-Wan for Bruck's death, and almost gave in to his anger and hurt him.\nTwelve years after the events surrounding his brother's death, Kad resurfaced as Uni, leader of a following of disenchanted idealists and \"refugees\" each leaving their planet's downward spirals. His father, Vox, now an old man, had also followed, and both still remained bitter towards Obi-Wan until Vox's selfish plan was uncovered and backfired, resulting in his death. Kad was able to forgive both his scheming father and Obi-Wan. He then went on his way in the universe, presumably to higher goals than leading his people to run away.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Telos_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Vox_Chun",
  "/wiki/Xanatos",
  "/wiki/Jedi/Legends",
  "/wiki/Bruck_Chun",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Jedi_Apprentice:_The_Day_of_Reckoning",
  "/wiki/Jedi_Apprentice_Special_Edition:_Deceptions",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}