{
 "name": "Kaeden_Larte",
 "display_name": "Kaeden Larte",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "35 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Raada resistance",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kaeden Larte was a human female who was the older sister of Miara Larte, living as a farmer on the moon Raada. After encountering Ahsoka Tano and working closely with the former Jedi in an uprising against the Galactic Empire, Larte came to serve aboard a Rebel Alliance medical frigate.\nKaeden's parents worked as farmers on the moon Raada until they died when Kaeden was about fourteen. Kaeden began working as a farmer under the crew lead Vartan, who looked out for her and her sister. A year into the Imperial Era, Kaeden befriended Ahsoka Tano when she arrived on Raada, under the false name 'Ashla', a mechanic. Kaeden helped her get settled in an abandoned house and helped her create a reputation for herself and her 'business'.\nDuring the Raada Uprising, Kaeden took part in a doomed raid on an Imperial base and was extracted by Ahsoka. In doing so, Ahsoka revealed her true identity as a former Jedi. Kaeden left their cave hideout in her anger over Ahsoka's deception and was captured by the Galactic Empire. She was tortured in preparation for interrogation, but Ahsoka rescued her before she revealed any information. After Ahsoka fled the moon, Kaeden stayed in the cave hideout with Miara and the other survivors of the raid until the Sixth Brother found them in his search for Ahsoka. The Sixth Brother captured Kaeden to lure Ahsoka back to Raada, which led to his defeat and death at Ahsoka's hands.\nAhsoka rescued her from her cell along with the other prisoners. When they were reuniting, Kaedan admitted her feelings towards Ahsoka. Kaeden and the rest of the Raada farmers were evacuated with the help of Bail Organa. Kaeden expressed a desire to join the rebellion once Miara was old enough to join with her.\nAfter the evacuation of Raada, Kaeden and her sister were initially moved to a refugee camp on Alderaan. They both eventually joined the rebellion, taking different career paths. Kaeden went to medical school on Alderaan, and by 0 ABY she served aboard a Republic medical frigate. Due to the separation of their duties, she rarely saw Miara.\nKaeden was generally friendly and kind, despite the hardship of her life on Raada and losing her parents. Her bonds with her community were especially important to her, as she regarded them as her new family. She developed feelings for Ahsoka Tano, and trusted her despite the doubts of Miara and the other farmers.\nTano described Kaeden as having lighter skin than Master Windu, but darker skin than Rex. She usually kept her hair in braids, but wore a scarf over her hair if unable to maintain them.\nKaeden Larte first appeared in the 2016 novel Ahsoka, written by E. K. Johnston. While not explicitly stated in the novel, Johnson confirmed via Twitter that Larte identifies as queer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Legends",
  "/wiki/Kaeden_Ta%27kor",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/35_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Raada_resistance",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Miara_Larte",
  "/wiki/Farmer",
  "/wiki/Moon",
  "/wiki/Raada",
  "/wiki/Ahsoka_Tano",
  "/wiki/Jedi",
  "/wiki/Raada_Uprising",
  "/wiki/Galactic_Empire",
  "/wiki/Pelta-class_frigate",
  "/wiki/Parent",
  "/wiki/Death",
  "/wiki/Vartan",
  "/wiki/Standard_year",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_base_(Raada)",
  "/wiki/Cave",
  "/wiki/Torture",
  "/wiki/Sixth_Brother",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaan",
  "/wiki/0_ABY",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Rex",
  "/wiki/Hair",
  "/wiki/Scarf",
  "/wiki/2016",
  "/wiki/Ahsoka_(novel)",
  "/wiki/E._K._Johnston",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/By_Whatever_Sun",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}