{
 "name": "Kaeline Ungasan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Kaeline Ungasan was a Human male employee from the Corporate Sector, a podracing producer, and an up-and-coming crime lord. He dared to defy the Hutt control over Ando Prime. At different points, he employed Benkudi, Ree, and Rikal Stargunner.\nKaeline Ungasan was a mid-level agent for the Corporate Sector Authority. Ungasan had previously dealt with the Hutts, although they were unaware of his relation to the CSA. He also was a hopeful crime lord who carried out a number of illicit activities. However, the CSA chose to ignore his shady business dealings. Around this time, Ungasan began to deal with Benkudi, a Dug crime broker who also dealt with the Hutts.\nThe CSA made attempts to wrestle financial control of Ando Prime from the Hutts, but they failed repeatedly. As a result, they entrusted Ungasan with this task. Ungasan agreed, considering it to be a chance to become a full-time gangster and take some profits from the Desilijic Hutt clan.\nThe podracing business on Ando Prime was under Hutt control thanks to the Ando Overland, a podrace course belonging to the Desilijics. Ungasan organized his own, alternative course: The Ungasan Cross Country. He hired podracing pilot Ree, a disgruntled employee of the Hutts, to become his chief scout for race locations.\nDuring the scouting, Ree accidentally found traces of Vonium, a valuable mineral. Ungasan decided to mine the seams illegally and use the money to fund his crime empire. Ree and Ungasan doctored podracing equipment with scanning devices and sold it to the pilots at a very low price. After the race, Ree's team could scavenge the equipment from the unavoidable debris of crashed podracers. Ungasan promoted the race by saying that the course changed every time to provide the racers and the audience with exciting new challenges. However, the course was really chosen for looking for the most probable veins of Vonium. This had the side effect of avoiding Hutt reprisals, since the Hutts did not know where they could sabotage the Cross Country. Ando Prime was too scarcely populated to attack any permanent post, and the bets were made through the HoloNet. The local authorities were bribed with CSA surplus luxury articles.\nRee warned Ungasan about his former partner Benkudi. Ree believed that Benkudi could sell any useful information on Ungasan to the Hutts. Ungasan sent some contract workers of the CSA to thrash Benkudi, as a warning against him talking about Ando Prime.\nHowever, by then the Hutts were already angry with Ungasan, and they had discovered Ree's involvement in the Ungasan Cross Country. The Hutts decided to send an assault team of Gamorreans led by Human bounty hunter Davon Gitta, to capture Ree alive, so that they could question Ree and find the well-hidden Ungasan. Because Ree himself was hard to be find, the Hutts hired some well-disposed, independent agents, who believed to be looking for a runaway child. These people were unknowingly carrying a tracking device so that Gitta could follow them.\nUnaware of this, Ungasan traveled to Ando Prime with his bodyguard, Rikal Stargunner. They met with Geon Justic, head of mining union in the town of Elesa. Justic told them that Ree wanted to survey the Juaka Canyon. Ungasan then decided to meet with him there. Although Ungasan did not know it at the time, the CSA had began to doubt his loyalty, and sent some of its own people to follow Ungasan's steps.\nRee's four-sentient survey team fell under the attack of the Talids, native people who claimed the podracer ruins. The independent agents of the Hutts were also there. It was believed that Gitta's band and the CSA faction joined the fight soon afterward.\nIn 27 BBY, Ungasan's shady activities and his use of the Cross Country as a front were discovered, and presumably stopped. This was one of the first of many controversies in podracing, leading to the ultimate criminalization of the sport.\nDuring the Galactic Civil War in 1 ABY, Ungasan ended up in the city of Mos Espa on Tatooine. While there, he decided to become a new force in the planet's \"less-regulated\" businesses. However, he needed to make new contacts if he hoped to succeed. He also considered Jabba Desilijic Tiure to be his one major obstacle to his success. Fortunately for him, he encountered a spacer willing to help him with his plan. Ungasan gave the spacer a datadisc to be delivered to Triddle \"Flip\" Flipinigan.\nThe datadisc contained a proposal for Ungasan to ally with Jabba's enemy, Lady Valarian. The spacer successfully delivered the disc to Flipinigan, and received a creditary reward from Ungasan. However, Ungasan still had work for the spacer. In order to make a name for himself, and gain a list of Jabba's employees, Ungasan tasked the spacer with killing Sil Onda'tek, one of Jabba's trusted thugs. The spacer agreed, and set off to kill Onda'tek. Sure enough, the thug had a datadisc which contained a list of security agents in Jabba's employ.\nHowever, Ungasan soon learned that an assassin was on his way to kill Valarian. Seeing this as an opportunity to gain more support, Ungasan tasked the spacer with killing the assassin, a male named Iza Paatzee. As the spacer approached Paatzee, he shouted that he had been set up by Ungasan, and began firing upon the spacer. However, the spacer succeeded in killing the supposed assassin, who in fact was likely working as a patsy for Ungasan.\nUngasan was happy to hear about the spacer's success, and recommended that the spacer see Lady Valarian in Mos Eisley for more work.\nIn the MMORPG Star Wars Galaxies, Kaeline Ungasan appears as a Non-Player Character  in Mos Espa. Players who speak to Ungasan may receive three quests which involve helping Ungasan start his criminal career on Tatooine.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Ando_Prime/Legends",
  "/wiki/Benkudi",
  "/wiki/Ree",
  "/wiki/Rikal_Stargunner",
  "/wiki/Dug/Legends",
  "/wiki/Desilijic/Legends",
  "/wiki/Ando_Overland",
  "/wiki/Ungasan_Cross_Country",
  "/wiki/Pilot/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Vonium/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Davon_Gitta",
  "/wiki/Geon_Justic",
  "/wiki/Elesa",
  "/wiki/Juaka_Canyon",
  "/wiki/Talid/Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/City/Legends",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Triddle_%22Flip%22_Flipinigan",
  "/wiki/Lord/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sil_Onda%27tek",
  "/wiki/Assassin/Legends",
  "/wiki/Iza_Paatzee",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_49",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Snow_Job",
  "/wiki/Star_Wars_Gamer_2",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide"
 ]
}