{
 "name": "Kaerobani",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lumini Pirates"
     ]
    }
   ]
  }
 ],
 "content": "Kaerobani was a Human male smuggler who led the Lumini Pirates. Operating out of Rathalay, he was known for his obsession over acquiring rare objects for his private collection. Around 10 ABY, during the time of the New Republic, Kaerobani's pirates attacked a New Republic CR90 corvette in a bid to acquire an ancient Jedi Holocron that was on board. After killing much of the ship's crew, the pirates succeeded in stealing the Holocron, and brought it back to Kaerobani's base. The Holocron was eventually recovered by Jedi Mara Jade.\nKaerobani was a Human male who became a renowned pirate and smuggling kingpin by 10 ABY, during the time of the New Republic. Obsessed with recovering rare artifacts for his private collection, Kaerobani owned a number of artifacts ranging from the helmet of a Phase II dark trooper to the cranial unit of the infamous droid information broker 8t88. At some point by 10 ABY, Kaerobani had become the leader of the Lumini Pirates and had gained the servitude of a number of Noghri. They set base on the planet of Rathalay where they took residence in a massive fortress that was complete with hangars, cantinas, and market areas. The fortress had a number of common areas as well as a trophy room where Kaerobani stored his various treasures.\nHis pirates attacked a CR90 corvette serving with the Combined Defense Forces of the New Republic, utilizing a captured Immobilizer 418 cruiser in order to hold it and steal its cargo, which included an important Jedi Holocron. Mara Jade was a part of the crew and repelled the pirates. The Holocron, however, had already been taken and Jade had to \"board\" a cargo crate in order to retrieve it. She infiltrated Kaerobani's base, reclaimed the Holocron, and escaped.\nKaerobani is named after the word \"Caribbean\".\nKaerobani is mentioned in the plot and in the game's manual. However his model only appears as a multiplayer character.\nIn an unpublished story by Daniel Wallace, a now-reformed Kaerobani was to have befriended retired Grand Admiral Grant. When the Yuuzhan Vong attacked Rathalay, Kaerobani's 8t88 head would have aided Grant in defending the planet.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lumini_Pirates",
  "/wiki/Smuggler/Legends",
  "/wiki/Rathalay",
  "/wiki/10_ABY/Legends",
  "/wiki/Time/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Crime_lord/Legends",
  "/wiki/Phase_II_dark_trooper",
  "/wiki/Droid/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/8t88/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Immobilizer_418_cruiser/Legends",
  "/wiki/Kaerobani%27s_base",
  "/wiki/Daniel_Wallace",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Octavian_Grant",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/Wizards.com",
  "/wiki/Kyle_Katarn%27s_Tale",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/StarWars.com",
  "/wiki/Jedi_Council_Forums",
  "/wiki/January_27",
  "/wiki/2013"
 ]
}