{
 "name": "Kai Justiss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kai Justiss was a Human male who served as a Jedi Knight during the time surrounding the Clone Wars, and who managed to evade Order 66 and survive the Great Jedi Purge. In his early career as a Jedi, he encountered a wide variety of creatures in his travels, such as marsh haunts and muttamoks. He also worked with the Wookiees of Rwookrrorro, Kashyyyk to thwart a plot by droid specialist Turren Lonarr to destabilize Wookiee society. When the Clone Wars broke out in 22 BBY, Justiss participated in the first battle, which took place on Geonosis.\nHe would later serve aboard the Acclamator-class assault ship VCD987, alongside fellow Jedi Tsui Choi and Sian Jeisel. In 22 BBY, the VCD987 was shipping troops to Drongar when it fell under attack from the Confederacy of Independent Systems. It was subsequently boarded, with Justiss and his companions at the mercy of Count Dooku, the Confederate leader. Dooku spared them, however, allowing Justiss to continue to serve the Galactic Republic. He was permanently assigned to Jedi diplomatic duties on Kashyyyk and was later the target of a bounty posted by enemy commander Asajj Ventress. When Order 66 was executed, Justiss was forced to flee from agents of the new Galactic Empire that had risen in the Republic's stead, and he was able to elude capture until 0 BBY, when he was captured by the Empire and executed by Darth Vader on board the first Death Star.\nKai Justiss, a Jedi Knight, wielded a blue-bladed lightsaber. In his work as a Jedi, he encountered many different creatures on far-flung worlds. In several of these encounters, such as his meeting a Force-sensitive jakobeast in the Outer Rim Territories, he would have to draw his weapon in self-defense. Together with fellow Jedi Ur-Sema Du, he came across yet another Force-sensitive species called a marsh haunt. In one mission, when he used his Delta-7 Aethersprite-class light interceptor, his datapad was stolen by muttamoks, who were known to take any shining object that caught their attention. When at the Jedi Temple, Justiss visited the Jedi Archives at least once during Jocasta Nu's tenure there.\nAt some stage in his early career, Justiss accompanied a Wookiee to his homeworld of Kashyyyk. Landing in Rwookrrorro, Justiss and his companion were greeted by the translator protocol droid K-27. As the trio began to venture further into the Wookiee city, they were met with the sight and sound of an explosion from a nearby building. As fires raged within the structure, K-27 urged Justiss and the Wookiee to attempt to save anyone inside. Just before Wookiee firefighters arrived, the Jedi and his companion were able to save some of the building's inhabitants.\nOne of the rescued Wookiees, Urrurrowo, explained that there had been flame beetles within the building for unknown reasons. K-27 mentioned that a similar blaze had torn through another part of Rwookrrorro a week prior and that the senior firefighter, Rruurrfhurra, had been hard-pressed to preserve one of the wroshyr limbs that the city rested on. Rruurrfhurra arrived shortly afterward; Justiss and his companion mentioned that they had seen some maintenance droids near the building just before the explosion. They then volunteered to help Rruurrfhurra hunt down the droids and discover just why the disaster had taken place. K-27, however, warned them that if they interfered with the droids, they would likely be fined and subsequently deported. Rruurrfhurra agreed, but accepted the help of the pair regardless.\nIn their investigations, Justiss, his companion, and Rruurrfhurra deduced that the flame beetles had been drawn to the walls of the building by what they had perceived to be a large concentration of their hatchlings. This information presented no answers as to how or if the maintenance droids had indeed started the blaze, leaving Justiss and his Wookiee companion with little to do but conclude their business on Kashyyyk. As the Wookiees dealt with the duo's cargo, they discovered the corpse of Rruurrfhurra in one of the containers. Justiss and his ally were subsequently taken into custody, where they explained over the course of several hours their whereabouts since the late firefighter had last been seen. The authorities eventually released the pair, but warned them not to depart Kashyyyk.\nUpon returning to their ship, Justiss and his companion found the craft surrounded by JR-8 janitorial droids and flame beetles. After removing the threat of the beetles and droids, the pair inspected one of the JR-8s and found that it had come from Temporary Droids—the rental agency that had supplied the Wookiees with K-27. The protocol droid bristled at the suggestion that his master, Turren Lonarr, could have been involved with any of the recent blazes, but nevertheless informed Justiss that Lonarr had come to Kashyyyk from Dosha, and that he employed Trandoshans to guard his Temporary Droids warehouse. Trandoshans, who hailed from a world that shared a system with Kashyyyk, had been engaged in a blood feud with the Wookiees for centuries.\nJourneying to the Temporary Droids warehouse, Justiss, his companion, and K-27 were set upon by the Trandoshan guards, who were buying Lonarr time to escape. Fighting their way through, Justiss and the Wookiee defeated the Trandoshans, only to see Lonarr escaping in a liftcar powered by kshyy vines. The pair attempted to override the liftcar controls, forcing Lonarr to jump to relative safety on a wroshyr limb two hundred meters above his assailants. As the Jedi and the Wookiee approached Lonarr's location, they were informed by their quarry that the Wookiee nursery ring, which was just above them, was rigged to attract flame beetles and subsequently be set ablaze if Lonarr died. Justiss and his companion were able to defuse the situation, however, preventing the nursery ring from destruction and defeating Lonarr in the process.\nIn 22 BBY, Jedi Knight Obi-Wan Kenobi sent out a distress signal from Geonosis, where he had discovered a droid army being constructed by the Confederacy of Independent Systems. Kenobi, along with his apprentice Anakin Skywalker and Senator Padmé Amidala, had been captured by the Confederacy, and so Jedi Master Mace Windu led a team of Jedi to Geonosis to save them. Justiss fought in the ensuing First Battle of Geonosis when the brief negotiations failed, alongside many of his fellow Jedi in the Petranaki arena, and was one of the few to survive the battle, which the Republic eventually won. As war broke out, Master Yoda agreed to become one of the Republic's military leaders, and Justiss succeeded him as Jedi Watchman of Kashyyyk.\nSeven months into the Clone Wars, Justiss served aboard the Acclamator-class assault ship VCD987, which was carrying reinforcements to Drongar. The world was home to the bota fungi, a healing agent that was known to deteriorate quickly when picked. Both the Republic and the Confederacy had harvesting operations there, and so the planet was a contested one. Accompanying Justiss were the Jedi Sian Jeisel and Tsui Choi. In transit, the VCD987 fell under attack from a superior Confederate force, with its engines falling prey to the enemy guns. Justiss, Jeisel and Choi fought alongside clone troopers to repel Quarren boarders, but the attackers lowered their guns as Count Dooku boarded the craft, flanked by his Dark Acolyte Sora Bulq.\nJustiss stood by and watched while Dooku verbally sparred with Jeisel, who had been reluctant to fight for the Republic earlier in the war. The Count insisted that he was not dedicated to the destruction of the Jedi, and to prove it, he had Justiss, Jeisel, and Choi shuttled to neutral territory. The clones of the VCD987, however, were killed. Later that year, Justiss was permanently assigned to Jedi diplomatic duties for Kashyyyk. In a statement to HoloNet News, the Jedi commented on the steadfast reliability of the Wookiees as a people.\nIn 21 BBY, a bounty was placed on Justiss's head by Confederate agent Asajj Ventress. The Jedi was not alone, however, as Ventress had placed bounties on the heads of many of his colleagues, such as Saesee Tiin, Luminara Unduli, and Anakin Skywalker. At the end of the war, Justiss survived Order 66 and managed to outfox Imperial Intelligence for some time afterward. For nearly twenty years he evaded death, and he sought refuge on Garqi circa 0 BBY. He was betrayed by local farmers to the Crimson Nova chapter of the Bounty Hunters' Guild, who sent a group of bounty hunters—including Breela, Boushh, and Zuckuss—after him. Justiss was forced to battle the hunters and managed to remove at least one Trandoshan's arm in the ensuing skirmish.\nJustiss was eventually captured by the Empire and brought to the first Death Star where he was executed at the hands of Darth Vader.\nJustiss, unlike some such as Sian Jeisel and Serifa Altunen, embraced his role as a Jedi during the Clone Wars. He respected the Wookiees of Kashyyyk, even going so far as to publicly applaud their loyalty on HoloNet News. Justiss was also highly adept at concealing himself, as he was able to avoid the Great Jedi Purge for twenty years.\nThe character of Kai Justiss was created by artist Joe Corroney in 2001. Corroney had been tasked with illustrating the role-playing adventure Kashyyyk in Flames, written by J. D. Wiker, for Star Wars Gamer 4. His art director, Kyle Hunter, requested that he create depictions for several \"player\" characters, so as to entice readers. As reference, Corroney based the character on his friend, webmaster, and fellow artist Justin Chung, who had been creating custom lightsabers and Jedi robes.\nThe character went unnamed in Kashyyyk in Flames, but was later identified in Republic HoloNet News Core Edition 14:10:03, written by Pablo Hidalgo. The name was coined by Corroney and Chung, and the character was subsequently used in several ensuing installments of HoloNet News. The character also featured in the Power of the Jedi Sourcebook, and John Ostrander's Jedi: Count Dooku, where Justiss was drawn by Jan Duursema. Apart from Corroney and Duursema, the only other artist to depict Justiss is Chris Trevas, who rendered the character for Ryder Windham's Jedi vs. Sith: The Essential Guide to the Force. Other authors who contributed to Justiss' story include Abel G. Peña and Ryan Kaufman.\nCorroney and Chung would later expand upon the known canonical details of Justiss' life in Corroney's blog, \"Drawing in the Empire.\" The expansions were inspired by Justiss' existing depictions and included identifying Ur-Sema Du as Justiss' master, Justiss working directly for Jocasta Nu, Justiss' promotion to the rank of Jedi Master, and Justiss' involvement in the Battle of Kashyyyk. As these details have not been published in a canonical source, however, they are not canon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/0_BBY/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Marsh_haunt",
  "/wiki/Muttamok",
  "/wiki/Wookiee/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Turren_Lonarr",
  "/wiki/22_BBY/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/VCD987",
  "/wiki/Tsui_Choi",
  "/wiki/Sian_Jeisel",
  "/wiki/Troop/Legends",
  "/wiki/Drongar/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jakobeast/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Ur-Sema_Du",
  "/wiki/Species/Legends",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Jocasta_Nu/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/K-27",
  "/wiki/City/Legends",
  "/wiki/Coruscant_Rescue_Ops/Legends",
  "/wiki/Urrurrowo",
  "/wiki/Flame_beetle/Legends",
  "/wiki/Rruurrfhurra",
  "/wiki/Wroshyr_tree/Legends",
  "/wiki/Maintenance_droid",
  "/wiki/Starship/Legends",
  "/wiki/JR-8_series_maintenance_droid",
  "/wiki/Temporary_Droids",
  "/wiki/Trandosha/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Kashyyyk_system/Legends",
  "/wiki/Liftcar/Legends",
  "/wiki/Kshyy_vine",
  "/wiki/Wookiee_nursery_ring",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/Petranaki_arena",
  "/wiki/Yoda/Legends",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Bota",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Sora_Bulq/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Saesee_Tiin/Legends",
  "/wiki/Luminara_Unduli/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Death/Legends",
  "/wiki/Garqi/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Crimson_Nova",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Breela",
  "/wiki/Boushh/Legends",
  "/wiki/Zuckuss/Legends",
  "/wiki/Serifa_Altunen",
  "/wiki/Joe_Corroney",
  "/wiki/2001",
  "/wiki/Kashyyyk_in_Flames",
  "/wiki/J.D._Wiker",
  "/wiki/Star_Wars_Gamer_4",
  "/wiki/Justin_Chung",
  "/wiki/Jedi_apparel",
  "/wiki/Republic_HoloNet_News_Core_Edition_14:10:03",
  "/wiki/Pablo_Hidalgo",
  "/wiki/HoloNet_News_(Insider)",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/John_Ostrander",
  "/wiki/Jedi:_Count_Dooku",
  "/wiki/Jan_Duursema",
  "/wiki/Chris_Trevas",
  "/wiki/Ryder_Windham",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Canon",
  "/wiki/Battle_of_Kashyyyk/Legends",
  "/wiki/Category:Images_of_Kai_Justiss",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars:_Episode_II_%E2%80%94_Attack_of_the_Clones",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_71",
  "/wiki/CIS_Shadowfeed_Dispatch_15:01:15_Edition",
  "/wiki/Star_Wars_Insider_73",
  "/wiki/Republic_HoloNet_News_Special_Inaugural_Edition_16:5:241",
  "/wiki/Star_Wars_Insider_84",
  "/wiki/Underworld:_A_Galaxy_of_Scum_and_Villainy",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/Blood_Feud!",
  "/wiki/Star_Wars_Insider_124",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2011_Topps_Star_Wars_Galaxy_Series_6",
  "/wiki/Databank_(original)",
  "/wiki/Red_Five_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_137",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Leland_Chee",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi:_Mace_Windu",
  "/wiki/Yoda:_Dark_Rendezvous"
 ]
}