{
 "name": "Kaibe",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Torso"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lok Revenants"
     ]
    }
   ]
  }
 ],
 "content": "Kaibe was a male Chiss slicer who lived during the Galactic Civil War. He worked for the pirate warlord Nym in Nym's Stronghold on Lok.\nHis torso had been replaced with cybernetics.\nWhen the rogue assassin droid IG-88 took control of Nym's Factory Compound to create droids for his Droid Revolution, Nym enlisted the help of a skilled spacer to stop the droid's plans and remove him from the factory. Nym sent the spacer to Kaibe who had already come up with a plan.\nKaibe sent the spacer to the Bothan siblings Galody and Tupit who had already scouted out the compound of Tao-Ni Security on Endor, the company responsible for the factory's security. When the spacer later returned successfully with the needed parts, Kaibe was able to remotely hack into the factory compound's security system. He added the spacer's retinal scans to the system, so the retinal scanners of the factory would allow the spacer and his comrades to enter.\nKaibe was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Kaibe was added to the game along with the \"IG-88\" Heroic Encounter, introduced with the release of the \"Chapter 7\" update, on November 1, 2007. After talking to Nym's Envoy, the player was sent to Kaibe, who in turn sent the player to Endor to solve missions for Galody and Tupit. After returning to Lok and talking to Kaibe, the player could access the heroic instance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Nym%27s_Stronghold",
  "/wiki/Lok/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Assassin_droid/Legends",
  "/wiki/IG-88A/Legends",
  "/wiki/Nym%27s_Factory_Compound",
  "/wiki/Droid/Legends",
  "/wiki/Droid_Revolution",
  "/wiki/Spacer/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Galody",
  "/wiki/Tupit",
  "/wiki/Tao-Ni_Security_Compound",
  "/wiki/Tao-Ni_Security",
  "/wiki/Endor/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_1",
  "/wiki/2007",
  "/wiki/Nym%27s_Envoy",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures"
 ]
}