{
 "name": "Kairos",
 "display_name": "Kairos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kairos's homeworld"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kairos's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "Alphabet Squadron",
      "Alphabet Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Kairos was a female humanoid individual with mauve chitinous plates, deep-set eyes, and thin black lips, who piloted a UT-60D U-wing starfighter/support craft in the New Republic's Alphabet Squadron. She rarely spoke, and was secretive about both her appearance and most details of her past. After her life was disrupted by the arrival of the Galactic Empire on her homeworld, Kairos eventually came to join the Rebel Alliance, which transitioned into the New Republic following their victory at the Battle of Endor.\nSeveral months after the events at Endor and the Empire's subsequent Operation: Cinder campaign, Kairos was recruited by the New Republic Intelligence agent Caern Adan, joining a working group with a goal of tracking down and eliminating the elite 204th Imperial Fighter Wing. The group, eventually becoming a starfighter squadron nicknamed \"Alphabet Squadron,\" fell under the leadership of former TIE fighter pilot Yrica Quell. At first, the squadron was disorganized and ineffective, but the pilots bonded over time, learning to work with their variety of craft.\nThe squadron's assignments culminated with an attack on the 204th's forces on the fortified planet Pandem Nai, in which Kairos was tasked with detonating the reactor of the Orbital One space station. While the attack went awry and Alphabet Squadron had to let the 204th's remaining forces escape in lieu of saving innocent lives on Pandem Nai, Kairos and her fellow pilots survived mostly unharmed, and the New Republic nonetheless saw the Empire's loss of Pandem Nai as a victory.\nAccording to Kairos, she was born on a world far from the Core, living a simple life. When the Galactic Empire arrived on her world, her position among her people made her the best choice as an emissary to them. Thinking she was some sort of tribal leader, the Imperials took her captive, possibly thinking it would help keep her people in line.\nThe Empire, confused about her species, conducted many tests on her. Kairos was traumatized by this, especially by IT-O giving her blood of another species. Kairos felt great shame over losing \"purity\" and decided to wear a suit to prevent further \"contamination\".\nAt some point during the Imperial Era, Kairos met Caern Adan, a journalist who had been imprisoned by the Empire, who carried a debt towards. They were imprisoned together, and along with Ver Iflan and the reprogrammed torture droid IT-O, came up with a plan to escape. However, when they did escape, Iflan was left behind. Kairos eventually came to join the Alliance to Restore the Republic, who fought to put an end to the Empire. Kairos also developed a skill at piloting UT-60D U-wing starfighter/support craft. After the Rebel Alliance victory at the Battle of Endor in 4 ABY and the death of Emperor Palpatine, Kairos became a part of the fledgling New Republic.\nSeveral months after the Battle of Endor, Kairos was recruited into a New Republic Intelligence working group under the leadership of Officer Adan, whose goal was to take down the 204th Imperial Fighter Wing, a threatening Imperial fighter wing nicknamed \"Shadow Wing\" that had managed to survive through the Imperial loss at Endor, fortifying themselves on the planet Pandem Nai. She piloted a U-wing transport to Traitor's Remorse, a shantytown for Imperial defectors, to collect Yrica Quell, a former member of Shadow Wing who had also been recruited by Adan.\nTheir next stop was the asteroid trading post Entropian Hive, to recruit former Rebel Alliance pilot Nath Tensent, whose previous squadron had been destroyed by Shadow Wing. Adan had assigned Quell to speak with Tensent, and Kairos waited in the U-wing. Tensent refused the offer, but Kairos went to him once Quell had left, showing him a recording from Adan, which promised a monetary reward if he were able to uncover Quell's true Imperial record. The promise of both vengeance on Shadow Wing and money convinced Tensent to join them, following in his Y-wing.\nAboard the bulk freighter Buried Treasure, on its way to assist the Barma Battle Group in the Barma sector, Quell briefed Adan, Kairos, and Tensent on the 204th Imperial Fighter Wing. Once the briefing was finished, Adan assigned Kairos and Tensent to investigation, while giving Quell data analysis.\nSome time later, Kairos encountered Quell attempting to steal an X-wing from the airless cargo bay of the Buried Treasure. Using a metal rod, she threw Quell to the ground, knocking away her oxygen mask. Quell, who had wanted to steal a starfighter to investigate potential Shadow Wing locations on her own, attempted to convince Kairos to give her a chance. Kairos returned Quell's mask, letting her live and continue her mission.\nA day later, Quell returned with evidence that Shadow Wing had attacked the New Republic frigate Hellion's Dare above the planet Jiruus and pursued it into the Oridol Cluster. To locate and extract the frigate, Adan and his working group planned to capture Harrikos-Fifteen Research Station, an Imperial space station studying the star cluster. Kairos piloted her U-wing, carrying a New Republic security team led by Corporal Shroi. They successfully captured the station, sending out probe droids to search for the Hellion's Dare.\nEventually, the A-wing pilot Wyl Lark and the B-wing pilot Chass na Chadic, who had barely escaped the destruction of the Hellion's Dare, jumped into the Harrikos system. Adan, who intended to recruit the two survivors, arranged for them to meet with his current working group. When the Buried Treasure joined the Barma Battle Group aboard the cruiser Lodestar, Adan spoke with General Hera Syndulla, who gave Quell leadership of the newly-formed squadron.\nQuell tested her squadron with training exercises, such as in the Gobreton minefield, a field of smart mines. The variation in starfighter type and the unfamiliarity between the pilots proved difficult for Quell to handle. Confusion among the squadron ended in damage to Lark's A-wing starfighter, and Quell was left unsure whether Kairos had provided any assistance toward the end of the exercise. Quell also attempted to utilize a simulation of the Battle of Endor, which Tensent managed to break.\nAfter some time, during which the squadron practiced in simulations and tactical analysis of encounters with Shadow Wing, General Syndulla assigned them a mission. They were sent to the planet Abednedo, which had been unsuccessfully attacked during the Empire's Operation: Cinder shortly after the Battle of Endor. The New Republic had received coded transmissions suggesting that Imperial forces survived on Abednedo, and Quell's squadron were chosen to determine whether the transmissions were true.\nThe squadron arrived above Abednedo, and Quell ordered Kairos and Chadic to follow her to the surface, while Lark and Tensent waited in orbit. They landed in the city of Neshorino, where Kairos remained with her U-wing while Quell and Chadic spoke with the contact. They discovered that their contact had a number of Imperial prisoners, which Quell inspected while Chadic escorted one, a stormtrooper sergeant, back to the U-wing. Before Chadic could return, she came under attack by Imperial forces. Kairos came to her aid, killing several Imperials, both using her bowcaster and by hand. With Kairos's help, Chadic was able to return the prisoner to the U-wing and signal Quell.\nEscorting their contact's freighter, containing the Imperial prisoners, the squadron returned into space, where several TIE bombers pursued them. The bombers chased after Kairos's U-wing, and the squadron managed to destroy two of them. The surviving bomber instead headed towards the freighter, colliding into the the starship and destroying it, killing the prisoners inside. Mostly unsuccessful, the squadron returned to the Lodestar, where Quell got into an argument with Adan.\nAs Quell's squadron, which had been nicknamed \"Alphabet Squadron\" by the other New Republic pilots, was using resources that Syndulla wanted to use elsewhere, the general sent them to collect an old Rebel Alliance supply cache on the moon of the planet Harkrova I. The squadron entered the Harkrova system, landing on a mountain on the surface of the moon. As they hiked down to the supply cache, Chadic spoke to Kairos, giving thanks for the assistance in Neshorino, which Kairos silently acknowledged.\nAs night fell, the squadron camped inside a forest, several kilometers from the supply cache. The pilots talked to each other, with Tensent telling stories of his former squadron and Lark speaking of his homeworld, while Kairos merely listened. Once the sun had risen, they continued towards the rebel base, discovering it to be in a temple which Tensent assumed to be built by the Jedi. They began removing the supplies from the base, but had not finished before the day ended, setting up camp outside the temple. As the pilots talked amongst themselves, Kairos stood, illustrating her life story in a series of drawings made of dust and dirt.\nDuring the night, they were awoken by a starship passing overhead. Quell returned to the squadron's ships in case of hostiles, leaving the other pilots to continue collecting the supplies. There were no further sightings, however, but they were woken during the next night by a ringing sound that echoed throughout the forest. Kairos began to enter the temple, waiting for her fellow pilots before stepping inside, witnessing a galactic map made from a display of light, that they also assumed was created by the Jedi.\nThe squadron finished packing up the supply cache, returning to their ships. The gear they had collected was loaded aboard Kairos's U-wing, taking two hours to do so. When the squadron was ready to depart, Lark went to check on the U-wing, discovering that Kairos was outside, staring back in the direction of the temple. Once Lark had approached, Kairos turned and cryptically spoke to him for the first time, before returning to their ships.\nFollowing the mission to the moon of Harkrova I, the squadron returned to the Lodestar in the Borleias system, where General Syndulla gave them a mission to assist with the New Republic's battle against Imperial forces on Argai Minor. They planned to patrol near the Treinhaus Citadel and allow time for a New Republic salvage team to collect data from the ruins.\nThe length of their patrol was forcibly adjusted when time estimates of the salvage team and predictions from Vanguard Squadron proved to be incorrect. For the first several hours, there was no major threat that needed to be dealt with, but nightfall brought repeated attacks from both Imperial ground forces and TIE bombers. Kairos successfully destroyed two of the TIE bombers during the following five hours, after which the attacks ceased.\nThe squadron's next mission was to Rentaxius VIII, the location of an Imperial cargo freighter that they believed had been resupplied at Pandem Nai. The vessel initially surrendered to the New Republic forces, until the captain was murdered and replaced by a new commander who refused to surrender, instead opening fire. While attempting to disable the ship, a stray shot hit an oxygen generator, and the squadron was forced to evacuate the survivors in escape pods.\nAfter Rentaxius VIII, the squadron was sent to assist Hail Squadron, who had been targeting a wrecked Star Destroyer in the Haldeen sector when they had been decimated by an Imperial cruiser-carrier. Working together, the two squadrons managed to destroy the capital ship.\nShortly after a mission to raid an Imperial outpost that had been relaying messages to Pandem Nai, Quell called the squadron into their hangar. Quell, in attempt to improve her relationship with her squadron, accepted the \"Alphabet Squadron\" nickname they had been given, getting the mechanic Ragnell to paint a crest on their respective ships. Kairos was transfixed by the emblem painted onto her U-wing, stepping over to the ship and gently touching the paint.\nAlphabet Squadron continued to prepare for an attack on the forces of Shadow Wing. General Syndulla's battle group managed to secure enough star systems to take control of the Skangravi-Mestun Regional Hyperlane, which led close to Pandem Nai. Quell developed a plan for a starfighter attack on Pandem Nai, which was reviewed and approved by New Republic High Command. Despite Syndulla's doubts about the danger of the plan, Kairos and the other pilots of Alphabet Squadron were willing to attempt it. Quell briefed the squadron on the details of the attack, and they worked over it together. After the briefing, General Syndulla offered the squadron drinks before they began the mission, but Kairos declined, choosing to remain alone.\nThe Lodestar exited hyperspace in an empty star system at one end of the Skangravi-Mestun, where the pilots of Alphabet Squadron were to depart. The pilots broke away from the Lodestar, jumping through hyperspace to the edge of the Pandem Nai system. Immediately upon their arrival, Kairos broadcasted a jamming signal from her U-wing, blocking communications between the squadron but also hiding their presence from the 204th. Within an asteroid field, the squadron encountered smart mines placed by Shadow Wing, maneuvering around each one. Kairos followed Quell's X-wing out of the field, heading towards Pandem Nai itself.\nReaching the planet's atmosphere, Kairos deactivated the jammers, allowing the squadron to communicate as they fought off Imperial TIE fighters. Kairos broke off from the rest of her squadron, heading down into Pandem Nai's atmosphere to elude notice before climbing back up to the Orbital One station, where Shadow Wing's forces were based. She landed in one of the station's docking bays, allowing a team of New Republic Special Forces personnel to disembark and infiltrate the station, planting detonators in the station's reactor. To defend the U-wing so that the team could escape, Kairos set up a turret, waiting to see if anything entered the docking bay.\nThough several stormtroopers entered the docking bay, Kairos was otherwise unbothered by Imperial forces. The strike team contacted Kairos, confirming that their detonators were in place. Kairos forwarded the message to Quell, whose response ordered Kairos to activate the detonators. The station was not destroyed by the detonation, but began to tilt and fall towards the planet. However, flames caused by destroyed gas containment pods spread, igniting the rest of the station's pods and setting the tibanna atmosphere of Pandem Nai alight.\nAs the firestorm spread through the atmosphere and Orbital One fell, Kairos assisted Lark in saving an Imperial gas tanker by shooting its gas containment pods from their moorings before they could ignite. Kairos and Lark did the same for the other tankers around Orbital One, helped by the Imperial TIE fighter pilots of Shadow Wing, who ceased their attack in favor of preventing the fire from increasing. Tensent and Chadic also arrived to assist them, and they managed to prevent any of the pods from fueling the fire.\nWhile the surviving forces of Shadow Wing escaped Pandem Nai, having lost their commander, Colonel Shakara Nuress, the New Republic declared the attack a victory, with Pandem Nai no longer an Imperial threat. The pilots of Alphabet Squadron, minus Quell, who had crash-landed on Pandem Nai while attempting to protect the city of Induchron from falling wreckage, returned to the Lodestar, where they were met with celebration.\nChadic encountered Kairos, inviting her to play a game of sabacc. Agreeing to play, Kairos won several rounds. Kairos eventually joined the celebration herself, even briefly dancing with Chadic. Once the pilots of Alphabet Squadron were tired of celebrating, Tensent offered drinks to both them and General Syndulla. As the celebrations continued into the night, Kairos was the first of the pilots to depart.\nThe Lodestar and her battle group were then deployed to the Campaign in the Cerberon system. The fighting stretched on for weeks. At one point during the fighting on Troithe, Kairos held position only 10 meters above Twilight Company troopers to provide air support.\nDuring the fighting for the capital, she piloted her U-wing directly into the battle in order to secure victory. She was wounded, and failed to respond to bacta. She was then evacuated in a medical capsule. Later, after the battle wrapped up, she returned to the squadron, albeit scarred. When she arrived, she greeted Tensent.\nKairos continued to serve with Alphabet Squadron while it hunted the 204th from the New Republic Star Destroyer Deliverance. During one of the skirmishes when they chased the Yadeez, the bulk freighter the 204th was using as a carrier, Yrica Quell announced her presence with the 204th in a comm channel. Kairos, knowing Quell was the last person to see Caern Adan alive, and out of a sense of justice, made it her mission to hunt Quell down. During a battle over the world of Chadawa where the 204th was preparing to continue the next phase of Operation: Cinder, New Republic forces noticed a stealth ship leaving the area. Guessing that Quell was aboard, Kairos and Chass na Chadic jumped after it blind.\nThey spent several days trying to determine where Quell might have gone, using records of Imperial outposts on the trajectory they'd followed. Eventually they arrived at the planet Netalych and tracked down not only Quell, but the team of Imperials from the 204th that was with her. Kairos and Chass stormed the apartment they rented, but Quell escaped out a window during their initial attack. Eventually Chass located her and brought her back to Kairos's U-wing while under fire from other members of Quell's team. The fighting caught the attention of the local defense forces, who pursued the ship, firing ion weapons. Kairos cut all power to simulate the ship getting hit and landed on the surface in secret. Unfortunately the ship had taken some damage; the hyperdrive and navicomputer were both non-functional. Despite not fully trusting Quell, Kairos permitted her to fix the hyperdrive, but there was no way to repair the navicomputer to calculate a jump back to the Deliverance. Despite that, through studying the night sky on Netalych, Kairos was able to \"eyeball\" a hyperspace jump that took the U-wing back to her homeworld.\nIgnoring the disbelief of her shipmates, Kairos took them to a part of the planet near an Imperial outpost that had been established during the early days of the Empire and explained to them that the facility was present and might have parts they could use to repair the ship. She led her comrades on foot through the jungle terrain and through a cave where there were many outfits similar to her own clothing arranged on poles. She only told Quell and Chass that they were people who no longer existed. Quell and Chass assumed it was some sort of burial ground.\nShe warned them that the jungle was dangerous and once had to assist in killing a worm-like creature large enough to eat them whole before they reached the Imperial facility. Once there they began gathering materials. After the first night, Quell told Kairos that she knew about Kairos's history in an Imperial prison. Kairos explained to Quell that as the last person to be with Caern Adan and IT-O, the debt she owed to them would pass to her, however her recent betrayal left her status in question, and she would \"judge\" Quell. She didn't explain what criteria she was using. However, she refused to allow Quell to come to harm while her judgement was pending, even refusing to allow her to take watch at night.\nEventually members of her species began surrounding the settlement, fearing the Imperials had returned. When Quell and Chass asked her to speak to them, Kairos said she could not, because she \"was not the same person\" as when she had left, and she was now ashamed of who she was. She explained that her people considered anything not of their world \"tainted and impure.\" Kairos had been so influenced by the galaxy at large she was sure her people would see her as impure and kill her. Instead, she convinced her comrades to rig the facility to explode. Doing so scared off the other members of her species, and she led them back to the U-Wing.\nWhen Quell was returned to the Deliverance, she eventually revealed the reason she was on a mission separate from the rest of the 204th. She and Soran Keize had reverse-engineered one of the Sentinel  Messenger Droids and discovered it's link to a database on Coruscant that contained information on every person who'd ever entered Imperial service, much of it incriminating. He intended to destroy it, but doing so would cause damage to a large portion of the cityscape on the planet, likely killing thousands of people as well as eliminating the data. She asked Alphabet squadron to go with her.\nThough Kairos never declared it publicly, she eventually went with Quell when the latter was given permission to pursue Keize; her debt to Adan was not discharged yet, and she still had not finished her judgement of Quell. She followed Quell's T-70 X-wing starfighter to Coruscant where they slipped through the blockade of the planet. However, they attracted the attention of a number of TIE strikers. Kairos volunteered to play rear-guard and hamper the pursuers with her U-wing while Quell pursued Keize's TIE/LN starfighter.\nKairos was significantly outnumbered in the fight and had to resort to using the U-wing's door guns while the ship was on autopilot several times, then eventually just personally shooting ties with her bowcaster. As she accumulated damage, she listened to the ongoing conversation between Quell and Keize on an open channel. When Quell finally admitted her unworthiness to determine her own guilt or what punishment was appropriate for her and suggested she was willing to accept the judgement of others, Kairos decided Quell was worthy. As the duel between Quell and Keize came to a head, Kairos led the swarm of TIEs to their location and then self-destructed her U-wing, destroying most of the TIE strikers and damaging Keize's TIE enough to bring it down.\nFollowing the destruction of her ship, she found Quell mildly wounded, but alive. At that point, because of her judgement of Quell and the discharge of her debt to Caern Adan, her body began metamorphosing. She didn't explain all the details to Quell, but said that her new form would be a chance at a new life, and even though she still couldn't go home, she wanted her new life to be untouched by the violence and war she'd known since she left. Leaving Quell to return to the New Republic on her own, Kairos disappeared into the Coruscant cityscape.\nA female humanoid being with a tall figure, Kairos masked her face, keeping her species and appearance unknown to others. Kairos seldom spoke—out of her fellow pilots in Alphabet Squadron, she spoke to Wyl Lark only once, while Yrica Quell thought she heard Kairos speak when facing her in the cargo bay of the Buried Treasure. While in flight, Kairos communicated through computerized tones, which her squadron mates could learn to recognize without requiring an astromech droid to translate. As the pilots of Alphabet Squadron grew closer, Kairos began to open up, revealing her past life through a series of intricate drawings in the dirt.\nKairos rarely displayed any emotion, often merely showing acknowledgement when spoken to. When first meeting with Yrica Quell, who asked if she could help pilot the U-wing, Kairos silently refused to allow her to do so, dispassionately disabling the copilot's station. Despite this, Kairos had occasional moments of emotion. When Quell attempted to disobey orders and escape the Buried Treasure to do her own investigation, Kairos at first did not hesitate to kill the apparent traitor, but let Quell live, giving her a chance to prove herself. During the squadron's mission to the Harkrova system, Kairos seemingly showed amusement to a comment made by squadron mate Nath Tensent. The notion of a trap made Kairos uncomfortable, having had a previous experience that she wished not to relive.\nViolent in her service to the New Republic, Kairos wished to have vengeance on the Galactic Empire for the many worlds they destroyed or devastated, including Alderaan, Nacronis, and Hetnagaro. She was aware of her murderous nature, knowing that a part of her craved death, and that she was impatient for the opportunity to kill those who served the Empire, but was able to keep herself under control, and recognized that the Emperor would have been pleased by her violence had she fought for the Empire. Nevertheless, Kairos followed orders while operating for Alphabet Squadron, partially because their plans aligned with her purpose, but also because she was pained by the thought of how Caern Adan had suffered when they met, and was aware she was indebted to him. Kairos wished she could become a better individual, and be freed of the atrocities of her life, but accepted herself for who she was.\nAfter being wounded on Troithe, her body was revealed; made up of multiple chitinous plates. Through various conversations with different members of Alphabet Squadron and Hera Syndulla, it was revealed that her species goes through molting processes where their outer skin is shed and reforms. Her species considers that process a rebirth and a chance to choose a new path for ones life. She was midway through the process when she was wounded, and the medics removing her coverings tainted that phase of her growth. She didn't begin another new phase until after the Battle of Jakku on Coruscant, where Yrica Quell was the only person to witness the start of it before Kairos explained she didn't want her new form to be tained by war and left.\nPossessing physical strength, Kairos could fight in combat, both with ranged weaponry, and when unarmed. Upon watching Kairos kill opponents with her bare hands, Chass na Chadic observed the savage, violent nature of her attacks, which left the bodies of her victims severely damaged. When unloading supplies during Alphabet Squadron's mission to the moon of Harkrova I, Kairos carried what Nath Tensent presumed was her own weight in gear. Kairos was able to move inhumanly fast, unaffected even in a cold, nearly airless environment.\nKairos was skilled at piloting her U-wing without the need for a copilot. While training her newly formed squadron, Yrica Quell noted that Kairos flew without excess motion and did not waste any shots.\nKeeping her face hidden, Kairos wore a helmet made of riveted metal and complete with a glowing visor. She wrapped herself with strips of graying fabric, over which she wore a cloak. Kairos carried an ornate weapon similar to a Bowcaster or a Lightbow that was slung around her torso, though she sometimes chose not to use it when fighting in hand-to-hand combat. In addition to taking out infantry, it was powerful enough to take down TIE/sk x1 experimental air superiority fighters. While serving in Alphabet Squadron, Kairos utilized a UT-60D U-wing starfighter/support craft, which eventually had the squadron's crest painted onto it by the mechanic Ragnell. She abandoned the helmet after her recovery following the Troithe operation.\nKairos first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed. Prior to the novel's release, publisher Del Rey revealed the character of Kairos, along with the rest of the Alphabet Squadron, through a post on Twitter, with art created by Jeff Langevin.\nDespite Kairos having no expressions and almost no voice, Freed stated in an interview on StarWars.com that it was not difficult to integrate her character into the story, as her tendency to lurk in the background meant that it was clear when she was involved in something important.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Kairos",
  "/wiki/Kairos%27s_homeworld",
  "/wiki/Kairos%27s_species",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/Alphabet_Squadron",
  "/wiki/IT-O",
  "/wiki/Humanoid",
  "/wiki/Pilot",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Galactic_Empire",
  "/wiki/Homeworld",
  "/wiki/Battle_of_Endor",
  "/wiki/Standard_month",
  "/wiki/Endor",
  "/wiki/Operation:_Cinder",
  "/wiki/New_Republic_Intelligence",
  "/wiki/Agent",
  "/wiki/Caern_Adan",
  "/wiki/Hunt_for_Shadow_Wing",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Starfighter",
  "/wiki/Squadron",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Yrica_Quell",
  "/wiki/New_Republic_pilot",
  "/wiki/Time",
  "/wiki/Starship",
  "/wiki/Attack_on_Pandem_Nai",
  "/wiki/Planet",
  "/wiki/Pandem_Nai",
  "/wiki/Reactor",
  "/wiki/Orbital_One",
  "/wiki/Space_station",
  "/wiki/Reproduction",
  "/wiki/Core_Worlds",
  "/wiki/Imperial_Era",
  "/wiki/Journalist",
  "/wiki/Prison",
  "/wiki/Ver_Iflan",
  "/wiki/Galactic_Civil_War",
  "/wiki/4_ABY",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Officer",
  "/wiki/Fighter_wing",
  "/wiki/Transport",
  "/wiki/Traitor%27s_Remorse",
  "/wiki/Asteroid",
  "/wiki/Merchant",
  "/wiki/Entropian_Hive",
  "/wiki/Nath_Tensent",
  "/wiki/Nath_Tensent%27s_squadron",
  "/wiki/Battle_at_Trenchenovu",
  "/wiki/Credit",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Bulk_freighter",
  "/wiki/Buried_Treasure",
  "/wiki/Barma_Battle_Group",
  "/wiki/Barma_sector",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Breath_mask",
  "/wiki/Standard_day",
  "/wiki/Skirmish_at_Jiruus",
  "/wiki/Frigate",
  "/wiki/Hellion%27s_Dare",
  "/wiki/Jiruus",
  "/wiki/Attack_on_the_Hellion%27s_Dare",
  "/wiki/Oridol_Cluster",
  "/wiki/Harrikos-Fifteen_Research_Station",
  "/wiki/Star_cluster",
  "/wiki/Corporal",
  "/wiki/Shroi",
  "/wiki/Probe_droid",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Wyl_Lark",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Chass_na_Chadic",
  "/wiki/Harrikos_system",
  "/wiki/Cruiser",
  "/wiki/Lodestar",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Alphabet_Leader",
  "/wiki/Gobreton_minefield",
  "/wiki/Smart_mine",
  "/wiki/A-wing_starfighter",
  "/wiki/Flight_simulator",
  "/wiki/Mission_to_Abednedo",
  "/wiki/Abednedo_(planet)",
  "/wiki/Attack_on_Abednedo",
  "/wiki/Orbit",
  "/wiki/City",
  "/wiki/Neshorino",
  "/wiki/Unidentified_Verpine_smuggler",
  "/wiki/Stormtrooper",
  "/wiki/Sergeant",
  "/wiki/Bowcaster",
  "/wiki/Prisoner",
  "/wiki/Freighter",
  "/wiki/Realspace",
  "/wiki/TIE/sa_bomber",
  "/wiki/Unidentified_moon_(Harkrova_I)",
  "/wiki/Harkrova_I",
  "/wiki/Harkrova_system",
  "/wiki/Mountain",
  "/wiki/Moon",
  "/wiki/Forest",
  "/wiki/Kilometer",
  "/wiki/Polyneus",
  "/wiki/Star",
  "/wiki/Unidentified_temple_(Harkrova_system)",
  "/wiki/Jedi",
  "/wiki/The_galaxy",
  "/wiki/Standard_hour",
  "/wiki/Borleias_system",
  "/wiki/Skirmish_on_Argai_Minor",
  "/wiki/Argai_Minor",
  "/wiki/Treinhaus_Citadel",
  "/wiki/Vanguard_Squadron",
  "/wiki/Rentaxius_VIII",
  "/wiki/Captain",
  "/wiki/Commanding_officer",
  "/wiki/Oxygen",
  "/wiki/Escape_pod",
  "/wiki/Battle_in_the_Haldeen_sector",
  "/wiki/Hail_Squadron",
  "/wiki/Star_Destroyer",
  "/wiki/Haldeen_sector",
  "/wiki/Carrier",
  "/wiki/Capital_ship",
  "/wiki/Hangar",
  "/wiki/Technician",
  "/wiki/Ragnell",
  "/wiki/Star_system",
  "/wiki/Skangravi-Mestun_Regional_Hyperlane",
  "/wiki/New_Republic_High_Command",
  "/wiki/Hyperspace",
  "/wiki/Pandem_Nai_system",
  "/wiki/Asteroid_field",
  "/wiki/Atmosphere",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/Detonator",
  "/wiki/Turret",
  "/wiki/Gas",
  "/wiki/Fuel_pod",
  "/wiki/Tibanna",
  "/wiki/Tanker",
  "/wiki/Colonel",
  "/wiki/Shakara_Nuress",
  "/wiki/Induchron",
  "/wiki/Sabacc",
  "/wiki/Campaign_in_the_Cerberon_system",
  "/wiki/Troithe_operation",
  "/wiki/Troithe",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Bacta",
  "/wiki/Deliverance",
  "/wiki/Yadeez",
  "/wiki/Chadawa",
  "/wiki/Netalych",
  "/wiki/Soran_Keize",
  "/wiki/Sentinel_(Contingency)",
  "/wiki/Coruscant",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/TIE/sk_x1_experimental_air_superiority_fighter",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Species",
  "/wiki/Astromech_droid",
  "/wiki/Alderaan",
  "/wiki/Nacronis",
  "/wiki/Hetnagaro",
  "/wiki/Battle_of_Jakku",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Temperature",
  "/wiki/Helmet",
  "/wiki/Color",
  "/wiki/Cloak",
  "/wiki/Lightbow",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Del_Rey",
  "/wiki/Jeff_Langevin",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Kairos",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/File:Del_Rey_Kairos.png",
  "/wiki/File:Del_Rey_Langevin.png"
 ]
}