{
 "name": "Kaiya Merel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Meatlumps"
     ]
    }
   ]
  }
 ],
 "content": "Kaiya Merel was a Human female who lived on Corellia during the Galactic Civil War. She was a member of the Meatlump gang.\nAfter the Battle of Yavin, Kaiya Merel was a lieutenant of the Meatlumps, a gang of technology-hating thugs and criminals, who lived in Coronet. Meatlumps under her orders included the old and disillusioned Alliin Mepou.\nIn 1 ABY, Vani Korr, a Corellia Times reporter, was investigating the Meatlumps in order to find the fabled Meatlump Hideout. She dispatched a spacer to meet Alliin Mepou. The old Meatlump wanted to leave the organization but he could not retire from being a Meatlump unless a new person take his place. The spacer, who wanted to infiltrate the Meatlumps for Vani Korr, eagerly accepted to replace Mepou.\nThe spacer encountered Kaiya Merel in Coronet and managed to convince her to be admitted among the Meatlumps. Merel proposed several jobs to test her new recruit. The woman wanted to start a collaboration with two other criminals, the Rogue CorSec officers Erinn Bonette and Echdo Bervekk. She ordered her new recruit to help the Rogue CorSec hijack a shuttle. However, the spacer instead killed them, and lured Kaiya Merel by claiming that their meeting was raided by CorSec agents.\nKaiya Merel then learnt that another Meatlump lieutenant, Stephax Dain, was planning a big operation but she was not keen on letting her rival get any credit for this action. She tasked her new recruit to search Stephax Dain's camp near Kor Vella. The spacer found a well-worn notebook that contained detailed information about Stephax's plans: attack a Weapons Research Facility located on Naboo's moon of Rori. Kaiya Merel therefore ordered the spacer to disrupt the facility operations before her rival. However, Stephax and his Meatlump pronks had already taken over the facility when the spacer arrived on Rori. The adventurer thus attacked the Meatlumps, killing Stephax Dain and a number of pronks. When the spacer returned to Corellia, Kaiya Merel was extremely satisfied of the death of her rival. She finally accepted the spacer among the Meatlumps for good and gave access to the Meatlump Hideout, located in the Coronet Maintenance Tunnels. The spacer eventually met the legendary Meatlump King in the hideout, allowing Vani Korr to write the article Who are the Meatlumps?.\nKaiya Merel appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Kaiya Merel was added to the game with the update dubbed \"Chapter 10: The Search for the Meatlump King\", released on June 19, 2008.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Meatlumps",
  "/wiki/Alliin_Mepou",
  "/wiki/Corellia/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Vani_Korr",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Corellia_Times",
  "/wiki/Journalist/Legends",
  "/wiki/Meatlump_Hideout",
  "/wiki/Rogue_CorSec",
  "/wiki/Corellian_Security_Force",
  "/wiki/Officer/Legends",
  "/wiki/Erinn_Bonette",
  "/wiki/Echdo_Bervekk",
  "/wiki/Shuttle/Legends",
  "/wiki/Stephax_Dain",
  "/wiki/Kor_Vella/Legends",
  "/wiki/Weapons_Research_Facility_(Rori)",
  "/wiki/Naboo/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Coronet_Maintenance_Tunnels",
  "/wiki/Meatlump_King",
  "/wiki/Who_are_the_Meatlumps%3F",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_19",
  "/wiki/2008",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}