{
 "name": "Kal-tan-shi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tiss'sharl"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tiss'shar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Paramexor"
     ]
    }
   ]
  }
 ],
 "content": "Kal-tan-shi was a male Tiss'shar who worked as a bounty hunter during the height of the Galactic Civil War.\nKal-tan-shi began his career as a hunter for House Paramexor, specializing in no living bounties. During this time he began a fierce rivalry with another bounty hunter, Ssach'thirix. As well he began to develop a severe hatred and almost fear of droids.\nAfter a successful career under Paramexor, he eventually made the choice to continue working alone, perhaps to further pursue his nemesis Ssach'thirix even though Paramexor were still customizing his starship at that moment . Although Guild Master Janq Paramexor frowned upon this decision, Janq and Kal-tan-shi kept a strong friendship and were seen dining together years later.\nKal-tan-shi commonly specialized in bounties that targeted members of the Rebel Alliance because the payout was typically higher than the money offered for pirates, smugglers or gangsters, and because the challenge was greater. He commonly murdered his prey if he knew that the bounty was the same for a living capture or a death mark. As of 2 ABY, he had captured or killed at least seventeen Rebel operatives, including high-ranking Generals Tfin and Wuvnir at Yuhli Docking Port 32. He also killed two Mon Calamari envoys plus a seven-member entourage in the Veron Minor system.\nRebel lieutenant Tole Warren was assigned to track Kal-tan-shi since he was the only non-droid fluent in Tiss'shar. Warren was never able to accomplish his mission, however, yet he did find the bounty hunter's ship, the Accuser, and noticed a failure in the starboard thrust converter. Warren reported this information for future Rebel watchers.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tiss%27sharl",
  "/wiki/Tiss%27shar",
  "/wiki/Gender/Legends",
  "/wiki/House_Paramexor",
  "/wiki/Emancipator",
  "/wiki/Lieutenant/Legends",
  "/wiki/Tole_Warren",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Ssach%27thirix",
  "/wiki/Droid/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Janq_Paramexor",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Tfin",
  "/wiki/Wuvnir",
  "/wiki/Yuhli_Docking_Port_32",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Veron_Minor_system",
  "/wiki/Tiss%27shar_(language)",
  "/wiki/Accuser_(Class_720_freighter)",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}