{
 "name": "Kalgrath",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yavin 4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red",
      "later green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Exar Kun's Sith Empire",
      "Brotherhood of the Sith"
     ]
    }
   ]
  }
 ],
 "content": "Kalgrath, also known as the \"Night Beast,\" was a Massassi warrior put into hibernation within the isolation chambers beneath the temples by the Dark Lord Exar Kun, to guard Yavin 4 against intruders prior to the Republic/Jedi assault on the moon.\nWhen Ulic Qel-Droma revealed the location of Exar Kun's base on Yavin 4, a Republic war fleet arrived at the jungle moon. As the fleet arrived, Exar Kun watched from atop of his temple and ordered Kalgrath to go to the isolation chambers Naga Sadow had built beneath the temples.\nThere, Exar Kun altered the mutated Massassi warrior even further. He caused his tough hide to harden until it could block most conventional energy weapons, made his skin color go from crimson to deep green, to better camouflage in the catacombs and jungles of Yavin 4, and rendered Kalgrath mute. Kalgrath was put in a deep sleep by Kun using Sith alchemy and left behind there by the Dark Lord as a guardian. Kalgrath would remain in hibernation for millennia after most of his people were exterminated, and some fled into the parts unknown.\nIn 0 ABY during an attack of Admiral Amise Griff, Kalgrath was awakened from his millennia-long sleep by a crashed TIE/sa bomber in the isolation chambers, cracking his suspended-animation capsule open. He then went to look for his people believing they were still alive, not knowing the Massassi had been killed in Kun's mad bid for supernatural power. Instead, Kalgrath discovered the Rebel base in the ancient temple. Thinking they were his ancient enemies, he attacked them. However, he was stopped by Luke Skywalker and R2-D2.\nSkywalker managed to communicate with Kalgrath through the Force. Kalgrath was able to calm himself down, allowing his insanity to fade. Luke agreed to help him to find his people. Kalgrath was put aboard a GR-75 medium transport programmed with an auto-jump to the former location of the ancient Sith Empire to find the remaining members of his people. One of the random jumps performed by the transport brought the beast back to Alliance space. This time, through the Force, Luke explained that the beast would eventually find its former masters by getting back onto the transport.\nAfter Luke founded his Jedi academy, Tionne Solusar did some research into Kalgrath's fate, and have been able to track down the creature to the deserted world of Ziost before the trail ended. She was informed by researchers on Ziost that they had seen a dark shadow creeping around their camp. Despite this, it remains unknown whether the one-of-a-kind creature found his way to the fallen Sith Empire, with little more than rumours to back up Tionne's hypothesis.\nLater, on the planet Seidhkona, the Mind-witch S'ybll conjured up an illusion of Kalgrath from Luke Skywalker's memory. Skywalker fled from the illusion and into some ruins which collapsed on him, leaving him incapacitated.\nFollowing his alteration by Exar Kun, the Night Beast could shield himself with the Force by instinct, making him invulnerable to energy weapons, including blaster fire of all types and even lightsaber attacks.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Massassi/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Night_Beast",
  "/wiki/Yavin_4/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Great_Sith_War)",
  "/wiki/Brotherhood_of_the_Sith",
  "/wiki/Isolation_chambers",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Battle_of_Yavin_4_(Great_Sith_War)",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Temple_of_Exar_Kun",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/File:KalgrathAttack-CSW9.png",
  "/wiki/0_ABY/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Admiral/Legends",
  "/wiki/Amise_Griff",
  "/wiki/TIE/sa_bomber/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/File:Nightbeast_swenc.jpg",
  "/wiki/The_Force/Legends",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/Ziost/Legends",
  "/wiki/Unidentified_camp",
  "/wiki/Seidhkona",
  "/wiki/Mind-witch",
  "/wiki/S%27ybll",
  "/wiki/Lightsaber/Legends",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_6",
  "/wiki/The_Night_Beast",
  "/wiki/The_Return_of_Ben_Kenobi",
  "/wiki/The_Paradise_Detour",
  "/wiki/Force_Illusion",
  "/wiki/A_New_Hope:_The_Life_of_Luke_Skywalker",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_3",
  "/wiki/Star_Wars_Galaxy_Collector_5",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}