{
 "name": "Kalibar Droosh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "18 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Coruscant Security Force",
      "Imperial Security Bureau",
      "Coruscant Security Force",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Kalibar Droosh was a male Bothan who lived on the planet Coruscant and served as a police officer with the Coruscant Police. By 18 BBY, Droosh had achieved the rank of lieutenant and was assigned under Prefect Pol Haus in the Zi-Kree Sector. However, Droosh secretly spied on Haus for the Imperial Security Bureau. During a confrontation with Haus, Droosh was killed by Whiplash freedom fighter Tuden Sal.\nKalibar Droosh was a male Bothan living on the planet Coruscant where he served as a police officer with the Coruscant Security Force. Droosh eventually attained the rank of lieutenant and was transferred to the the Zi-Kree Sector station. While there, Droosh began spying for the Imperial Security Bureau  on his colleagues including his commanding officer, Prefect Pol Haus, in the hopes of finding anti-Imperial activities.\nIn 18 BBY, Droosh accompanied Prefect Haus and a Special Weapons Team under Sergeant Amry to a supposed raid of a criminal hideout in a maglev train. However, unknown to Droosh and the other officers, the \"raid\" was simply a cover for Haus to prevent Whiplash freedom fighter Tuden Sal from carrying out his plans. When the maglev train failed to appear, Haus ordered Droosh and his officers to search the tunnel. They found one train car but when the officers approached the train exploded, wounding several officers and throwing Droosh to the ground. Haus, seeing his plan had failed left Droosh in charge of the scene to go find Sal. Droosh however followed Haus and arrived at the maglev train that served as the Whiplash headquarters in time to overhear Haus and Sal arguing over the future of plans for Whiplash. Droosh confronted them, revealing his affiliation with the ISB and his intentions to kill them before reporting them to his ISB superiors. Haus, angered but resigned, moved to surrender. However, Sal shot Droosh with his blaster at the same time Droosh opened fire resulting in each others death.\nThough he appeared to a proficient officer, having achieved the rank of lieutenant, Droosh had little true loyalty to either the Coruscant Police, his fellow officers, or even the Empire. Instead Droosh's loyalty to his superiors at the ISB was motivated purely by the rewards, both politically and in credits, that he saw he could attain.\nKalibar Droosh first appeared in the The Last Jedi, a novel by Michael Reaves and Maya Kaathryn Bohnhoff that was released on February 26, 2013.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/Police_rank",
  "/wiki/Lieutenant/Legends",
  "/wiki/Prefect_(Coruscant_police)/Legends",
  "/wiki/Pol_Haus",
  "/wiki/Zi-Kree_Sector",
  "/wiki/Spy/Legends",
  "/wiki/Death/Legends",
  "/wiki/Whiplash",
  "/wiki/Tuden_Sal",
  "/wiki/Officer/Legends",
  "/wiki/Special_Weapons_Team",
  "/wiki/Sergeant/Legends",
  "/wiki/Amry",
  "/wiki/Hovertrain/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/The_Last_Jedi_(novel)",
  "/wiki/Michael_Reaves",
  "/wiki/Maya_Kaathryn_Bohnhoff",
  "/wiki/February_26",
  "/wiki/2013"
 ]
}