{
 "name": "Kalit",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Kalit was a Jawa male who was present in the Hutt crime lord Jabba Desilijic Tiure's palace on the Jawa's homeworld of Tatooine in 4 ABY. He watched when the slave dancer Oola was fed to Jabba's pet rancor, Pateesa, and later peered through a grate in the palace throne room's floor when the Jedi Luke Skywalker fight and slay the beast.\nKalit was a Jawa male from the desert planet Tatooine. He was present in the palace of the Hutt crime lord Jabba Desilijic Tiure on Tatooine in 4 ABY. While there, the Jawa was present in the throne room during a performance by the Max Rebo Band which ended with Jabba dropping the slave dancer Oola through a trap door when she refused his advances. Kalit was one of several Jawas that rushed forward to peer through a grate in the palace court room's floor that allowed a view down into the pit below the throne room where Jabba kept his pet rancor, Pateesa, who devoured Oola.\nWhen the Jedi Luke Skywalker later arrived at the palace to try and negotiate with Jabba for the release of several of his allies, Kalit was present in the throne room when Jabba dropped Skywalker through the same trap door as Oola after the Jedi threatened the Hutt. Kalit once again was among the crowd that rushed forward to watch the execution through the grate, but this time it was the rancor instead that was slain. Jabba had Skywalker brought back up to the throne room and sentenced him and his allies to death, traveling to the Great Pit of Carkoon to watch their execution, but perishing there with much of his court.\nKalit had yellow eyes and rushed to watch executions twice while in Jabba's Palace.\nKalit wore brown robes and a brown bandolier while in the palace.\nKalit first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The character was first identified in Star Wars Legends by a card in the \"Jabba's Palace Limited\" set of the Star Wars Customizable Card Game, which was released in 1998. The name was then first used in canon by the video game Disney Infinity 3.0 when it was released on August 30, 2015. Despite the game's non-canon status, Lucasfilm Story Group member Pablo Hidalgo confirmed on Twitter that the names it uses for film characters are considered canon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kalit",
  "/wiki/Kalit/Legends",
  "/wiki/Tatooine",
  "/wiki/Jawa",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Homeworld",
  "/wiki/4_ABY",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Death",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Max_Rebo_Band",
  "/wiki/Time",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Bandolier",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars_Legends",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1998",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/August_30",
  "/wiki/2015",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/File:Pablo_lego_character_name_confirmation.png"
 ]
}