{
 "name": "Kalieva K'ntarr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rydonni Prime"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 14–8 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Rydonni",
      "K'ntarr family",
      "K'ntarr family"
     ]
    }
   ]
  }
 ],
 "content": "Princess Kalieva K'ntarr was a noble of the Royal House of Rydonni and a member of Rydonni Prime's ruling K'ntarr family.\nKalieva K'ntarr was the daughter of King Rilvvan K'ntarr, making her the heiress to both Rydonni Prime's throne and the family-owned Rythani Products company, which supplied walkers, weapons, and electronics to the remnants of the Galactic Empire. Beautiful and regal, Kalieva also acted much like a spoiled child and carried the typical haughtiness and commanding tone of most royalty. Nevertheless, she was both intelligent and sharp-witted, and was an incredibly skilled politician.\nAt some point after the Battle of Endor, Kalieva encountered a professional thief named Sienn Sconn during one of her father's ceremonies on behalf the sector's Moff, Caerbellak. Sconn, disguised as a servant, professed to have attended the party only to steal a prototype weapon Rythani Products was building for the Empire. Kalieva, tired of the life she was living on Rydonni Prime under the strict rule of her father, agreed to help Sconn in exchange for passage off-world. She helped a reluctant Sconn gain access to the Prototype Labs section of the Rythani Products Building, but was tied up and gagged by the thief, who saw her as a liability and wanted to prevent her from coming to any harm.\nKalieva was able to escape, however, and guilted Sconn, who had been able to steal the prototype, into letting her escape with him again. They commandeered an All Terrain Armored Transport and headed off for the rendezvous point where a freighter was scheduled to pick Sconn up. The next day, the pair found themselves in the middle of royal celebration in honor of Moff Caerbellak. Kalieva and Sconn moved their AT-AT into formation with the other walkers to prevent any suspicion from falling onto them. When they noticed that Caerbellak was threatening King K'ntarr's life after finding out the prototype had been stolen, Sconn fired on the royal reviewing stand. Kalieva and Sconn used the ensuing chaos to attempt escape. After Sconn dispatched Caerbellak's Mistryl Shadow Guard Variise, Kalieva and the thief abandoned the AT-AT in a speeder bike and were able to make it to the pick-up point.\nUpon arriving there, the two realized they had developed feelings for each other and shared a kiss, but Kalieva decided it was her duty to stay on Rydonni Prime. Ultimately, Kalieva betrayed Sconn. She planted a tracking device on the prototype on behalf of Moff Caerbellak, who had secretly formed a relationship with the princess. Kalieva and Caerbellak assassinated the king, thus instating Kalieva as Rydonni Prime's new queen.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rydonni_Prime",
  "/wiki/14_BBY/Legends",
  "/wiki/8_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Royal_House_of_Rydonni",
  "/wiki/K%27ntarr_family",
  "/wiki/Prince/Legends",
  "/wiki/Noble/Legends",
  "/wiki/King/Legends",
  "/wiki/Rilvvan_K%27ntarr",
  "/wiki/Rythani_Products",
  "/wiki/Walker/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Scoundrel",
  "/wiki/Sienn_Sconn",
  "/wiki/Sector/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Caerbellak",
  "/wiki/Rythani_Products_prototype",
  "/wiki/Prototype_Labs",
  "/wiki/Rythani_Products_Building",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Mistryl_Shadow_Guard",
  "/wiki/Variise",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Easy_Credits",
  "/wiki/Star_Wars_Adventure_Journal_9",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/4_ABY/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/10_ABY/Legends"
 ]
}