{
 "name": "Kalor_(Republic)",
 "display_name": "Kalor  (Republic)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicPersonnel Division",
      "Personnel Division"
     ]
    }
   ]
  }
 ],
 "content": "Kalor was a Mirialan male captain in the Personnel Division of the Army of the Galactic Republic during the Cold War and Galactic War. He was the supervisory officer of the defector Elara Dorne, and constantly hounded Dorne in an effort to prove she was still loyal to the reconstituted Sith Empire until Dorne exposed the excesses of his investigation.\nDuring the Cold War, Kalor became the supervisory officer of Imperial defector, Elara Dorne. After Dorne was transferred from her posting on Taris to Havoc Squad, she contacted Kalor to inform him that Havoc Squad's activities were highly classified and thus she couldn't report to Personnel Division like she did on Taris. Kalor strongly objected but was overruled by Dorne's new CO.\nLater on, when Dorne had convinced her brother, Aleksei, and his squad to defect after being disavowed by the Empire on Nar Shaddaa, Kalor called Havoc's starship, claiming that the Republic felt that she had been withholding information and asked if there's anything she'd like to share, to which Dorne declined. Kalor seemed to accept her response.\nAs time progressed, Kalor became obsessed with proving that Dorne was still loyal to the Empire and tried to make a formal inquiry that would've removed her from active duty. He obtained testimony from a civilian security officer on Taris named Ridu, who claimed that Dorne was responsible for the death of a senator visiting the planet. When Kalor informed Dorne of his evidence, she proceeded to confront Ridu, who recanted his testimony as in truth he was responsible for getting the senator killed. Angered that he lost his case, Kalor still continued to persecute Dorne.\nEventually, Kalor managed to find a loophole in military regulations to push forward with his inquiry. That was the last straw for Dorne, who confronted Kalor on Coruscant, presenting his superiors documentation that proved what a waste of resources Kalor's persecution of her was, destroying his case.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mirialan/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Human/Legends",
  "/wiki/Kalor_(Fyodos)",
  "/wiki/Fyodos",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Personnel_Division_of_the_Army_of_the_Galactic_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Elara_Dorne",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Taris/Legends",
  "/wiki/Havoc_Squad",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Aleksei_Dorne",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Ridu",
  "/wiki/Coruscant/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}