{
 "name": "Kam Nale",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ploo IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Fluggrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.02 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green",
      "purple",
      "white",
      "pink"
     ]
    }
   ]
  }
 ],
 "content": "Kam Nale, also known under the alias \"Elan Mak,\" was a Fluggrian male professional Podracer pilot who flew an outdated Kurtob KRT 410-C around 32 BBY, during the final decades of the Galactic Republic. The son of the crime lord Borzu Nale, Nale received his inheritance early when the Glymphid hitman Aldar Beedo murdered his father. Nale sought to avenge his father's death and vowed to track down Beedo, following him to the Outer Rim world of Tatooine, where Nale discovered that Beedo had entered as a contestant in the upcoming Boonta Eve Classic Podrace. Nale began to use the pseudonym \"Elan Mak\" in order to join the race without raising suspicions, all the while hoping to be able to eliminate Beedo by shooting him during the race. Nale's craft was too slow to catch up to the Glymphid but managed to finish in fifth. Realizing that he enjoyed the sport, Nale continued his career with it.\nNale, now officially known as \"Elan Mak\" in the Podracing circuits, furthered his racing career by adopting a more aggressive track personality. He eventually gained fame on the Dug Derby racecourse on Malastare, achieving the status of crowd favorite. Victories did not cloud his overall mission, however, as he continued to chase Beedo from race to race. Nale at some point regained control of his father's criminal empire but continued to Podrace. However, rather than pursuing Beedo himself, Nale used his newfound criminal funds to send numerous mercenaries after Beedo and bring him to justice. Around 22 BBY, Beedo was captured by one of the mercenaries and was brought back to Nale's headquarters, where the Glymphid was to face judgment. Right around the same time, the name \"Elan Mak\" was publicly exposed to be the crime lord Kam Nale. Beedo's capture and Nale's exposed identity were just two of several scandals that called for the sport of Podracing to be placed under scrutiny.\nKam Nale was a Fluggrian male from the watery Expansion Region planet Ploo IV, and he was the one factor that the Glymphid assassin Aldar Beedo did not consider when Beedo accepted the job of eliminating Nale's father, Borzu Nale. The elder Nale was a successful Fluggrian crime lord who posed a threat to the smuggling operations of Orin Nyell. Nyell hired Beedo to assassinate Borzu so that Nyell could continue his operation—selling Ploo IV water to the Outer Rim planet Sernpidal at inflated prices—unhindered. Nale was devastated by his father's death, and at great expense, he searched for the assassin's name. Upon learning Beedo's name, Nale swore to kill the Glymphid to avenge his father. He managed to follow Beedo, who was also a Podracer pilot, to the Outer Rim world of Tatooine, where he learned that Beedo had entered the upcoming Boonta Eve Classic Podrace as a contestant. Nale soon formulated a plan to enter the race himself and destroy Beedo and his Podracer.\nUsing whatever truguts, a type of currency, he could find, Nale purchased an old Kurtob KRT 410-C. Despite an attractive streamlined design, the Kurtob was rather outdated by the time of the Boonta race of 32 BBY. As such, it suffered from poor acceleration and top speed, though it retained a powerful boost component. A good Podracer soon became the least of his concerns, however, when Nale learned that a rookie bounty hunter named Rango Tel was hot on his heels.\nIn an attempt to avoid the bounty hunter, Nale began to go undercover with numerous aliases and false names. Tel, like Beedo, had also been hired by Orin Nyell, who feared that Kam Nale would reclaim his father's criminal empire. At the time, Nale actually had no desire to claim his inheritance. Tel actually managed to learn this fact, but nevertheless continued his pursuit. On the eve of the Boonta race, while many of the Podracer pilots who would be competing attended a concert for the glimmik singer and Podracer contestant Boles Roor, Nale created a recording detailing his plans regarding Beedo in case of his own demise during the Boonta. On the same night, Beedo was just as busy with his own schemes. While attending the concert, the Devlikk pilot Wan Sandage approached Beedo and hired him to kill the Dug pilot Sebulba, a notorious cheater, during the Boonta.\nThe next morning, the racers began to assemble, and Nale had since switched to his chosen alias of \"Elan Mak\"—which was nothing more than his name spelled backward—in order to avoid making Beedo suspicious. Before Nale could reach the arena, Tel cornered the Fluggrian in an alleyway, with Tel believing he would be the faster draw and that his armor would be sufficient to stave off any attack that Nale could present. Instead, Nale shot Tel with a heavy blaster pistol that easily punctured the rookie's flimsy armor, killing him.\nNale, now officially known as \"Elan Mak\" on the track, started the Boonta from the inside fourth row on the starting grid, next to the Phuii pilot Mars Guo and behind the Veknoid Teemto Pagalies. Meanwhile, Beedo began in the front row on the outside. As the race began, Mak was off to a good start, right up in front with the leaders, and he held second position ahead of Beedo for the first chunk of the initial lap. Falling behind, Mak was still only a short distance behind the leader, Sebulba, when the Dug smashed Mawhonic's Podracer into the side of a cliff.\nMak eventually backed off further and remained near the middle of the pack, while Beedo managed to stay ahead, aiming his own racer for Sebulba. However, Sandage crashed into a sandcrawler during lap three. Far ahead, Sebulba became entangled with the Podracer of another pilot, the Human Anakin Skywalker, and upon pulling away he crashed into the desert, paving the path to victory for Skywalker. Mak attempted to fire upon Beedo's racer with his blaster pistol, but his aim was obstructed by another contestant, Ebe Endocott. Beedo placed third, while Mak ended up in fifth place, ahead of Boles Roor in last. Realizing that he had enjoyed the race and that he had managed to finish ahead of more seasoned pilots, Mak elected to pursue Podracing as a career, while his races doubled as a front for his mission to eliminate Beedo. In addition, he decided to reinvent himself as a hardcore Podracer pilot.\nMak continued to race from that point on, achieving fame on the planet Malastare when he became the most popular pilot on the Dug Derby racecourse and became the favored racer for a Malastare drag course. However, his success on the Dug Derby stemmed more from the audience admiring his multiple attempts to finish the race in record time. Mak later competed in Malastare's Phoebos Memorial Run, the fifth race of the Vinta Harvest Classic, where he found himself pitted against Beedo once again. Beedo and Wan Sandage were both still working together to eliminate Sebulba. Mak positioned himself above Beedo during the final stretch of the race in order to shoot his target, but his plans were disrupted—Sebulba tricked the pilot By't Distombe into flying over a geyser, causing an explosion that forced many of the racers to break off. Beedo was once again unable to engineer Sebulba's demise, and Mak was unable to kill his Glymphid quarry. Sebulba won the race, followed closely by Sandage, with Mak and Beedo in tow. All four racers qualified for the final race of the Classic, which ran through the same course, but Mak again failed to eliminate Beedo in that race. When Sandage eventually died of old age sometime before 29 BBY, Beedo decided to switch allegiances and join with his former Dug target. At some point, the magazine Podracing Quarterly took notice of Mak's pursuit of Beedo, and after learning what Mak had spent on his Kurtob Podracer, they published a short blurb about their findings.\nMak was still hunting Beedo in 26 BBY, when the two eventually ended up on the planet Euceron to participate in the Galactic Games. Sebulba was also present but was allowing his son, Hekula, to race instead. The Boonta winner Anakin Skywalker, now a Jedi in training, also participated in the race on behalf of the Aleena brothers Deland and Doby Tyerell. The Boonta's runner-up, Gasgano, also competed. During the first lap, Mak caught up to Beedo and proceeded to cut off the Glymphid after narrowly avoiding the wreckage of Ody Mandrell, who had crashed while attempting a tight turn. Beedo wasn't able to avoid Mak's Podracer and slammed into it, wrecking both of their vehicles. Immediately after the crash, and having survived the wreck, both pilots climbed from the debris and dashed off of the track to avoid being crushed by the other racers. They immediately began casting blame on each other, disputing whose fault it was that the wreck had happened. Mak, however, did not apprehend or kill Beedo, and Skywalker went on to achieve a second victory. Other competitors included \"Scorch\" Zanales and Will Neluenf.\nHaving failed to avenge his father despite getting so close to his killer, Mak began to realize that he might never catch up to and kill his quarry. At the same time, he feared that he would be targeted by other bounty hunters like Rango Tel. \"Mak\" restored his former name of Kam Nale in order to retake his father's criminal empire, and using his newfound family funds, he began to hire numerous bounty hunters and mercenaries to track the elusive Glymphid. During 24 BBY, Beedo was still very much active on and off the course, still working as Sebulba's on-track bodyguard.\nHowever, Nale also continued racing under the guise of \"Elan Mak\" by the year 22 BBY. He participated in races taking place on Tatooine, Felucia, and Coruscant, among other worlds. With their careers still occurring simultaneously, it was during 22 BBY when one of Nale's mercenaries finally caught up to Beedo on the jungle world Baroonda. The mercenary shot down the Glymphid's craft in the middle of the Fire Mountain Rally race and arrested him—Beedo was finally brought before Nale for Borzu's murder. However, around the time of Beedo's capture, Nale's false identity was exposed. HoloNet News documented both the exposure and Beedo's arrest, while the seedy nature of both incidents put the future of Podracing under careful scrutiny.\nKam Nale entered into a state of vengeance-filled fury upon hearing of his father's death and set to work looking for his killer. Upon discovering that it was Aldar Beedo, a known Podracer, Nale decided to risk his life by entering the Boonta Eve Classic in order to run Beedo into the ground. On Malastare, he even risked fines and a race suspension by using an illegal weapon during a race to to try and shoot Beedo's Podracer. However, Nale eventually realized that he was unable to eliminate Beedo himself, and opted to hire other mercenaries to find Beedo for him. After his skirmish with Rango Tel, Nale became slightly paranoid, and despite his initial distaste for his father's illegal enterprises, he took over his father's organization in order to deal with future encounters. While racing as \"Elan Mak,\" he had the tendency to make fun of other racer's pods, generally remarking on cheap-looking parts.\nA Fluggrian, Nale possessed three-digit hands that ended in sharp, purple-hued claws, and the bottoms of his forearms were lined with natural spikes. He had a green exterior with a more white-colored stomach area, and he had yellow eyes along with several purple marks that stretched across his face, giving him a somewhat unique appearance among the other Boonta contestants, along with his pink, puffy lips. Fluggrians were generally short, and Nale stood at only 1.02 meters tall. The knobby protuberances on his forehead acted as sensory inputs.\nKam Nale had never piloted in a Podrace before his first Boonta race, and as such, he was pleasantly surprised that he was able to finish the race, especially with such an outdated Podracer. His piloting only continued to evolve, and he eventually became a popular pilot on Malastare. A more aggressive track personality was also notable of his career as he adopted the image of a hardcore racer. Nale was also a decent shot, being able to outdraw and out-shoot rookie bounty hunter Rango Tel. Despite that, he was unable to shoot down Aldar Beedo's Podracer during either the Boonta Eve Classic or the Vinta Harvest Classic. Nale eventually resorted to hiring others to take care of Beedo for him. Nale was trilingual; he was able to speak Huttese, Galactic Basic Standard, and another dialect.\nKam Nale wore a light brown vest when racing, as well as a headset with a comlink. He owned a silver blaster pistol that he used against Rango Tel and Aldar Beedo during the Boonta Eve Classic, and later again on Malastare.\nWhen Nale entered the Boonta Eve Classic, he did so with an outdated Kurtob KRT 410-C Podracer. The overall design of the pod was very spherical, with large bulbous engines and a circular, upright cockpit. The cockpit had a large apparatus attached to its right side, which was where one of the engine cables was connected, although this attachment was removed during Nale's participation in the Vinta Harvest Classic on Malastare. The color scheme was dominated by a white color, with red and blue markings adorned on the engines and cockpit. Similar designs adorned the flag that he used to represent himself during the Boonta.\nThe vehicle had very few advantages in competitions with modernized Podracers; it had poor acceleration and below-average handling. The engines were durable, however, and could sustain moderate damage. Despite an average top speed, the Kurtob pod had a useful boost ability and an effective cooling system that could cool down the engines fairly quickly after every boost, although the Podracer could only boost every so often due to the fact that the engines rapidly heated up. Nale managed to finish in fifth place during the Boonta Eve Classic and ranked among the top five during a qualifying race for the Vinta. As opposed to buying a stronger Podracer, he instead opted to upgrade his Kurtob and use it throughout his career.\nElan Mak first appeared in the 1999 novel Star Wars Episode I: The Phantom Menace, written by Terry Brooks and based on the screenplay for George Lucas's film of the same name. Despite having a detailed maquette built and concept art created by the film's art department, Mak was realized in the film's Podracing sequences only as a low-resolution computer-generated model that was used for distance shots of his Podracer. The character was afforded a far more detailed close-up for a deleted scene on the film's DVD release, with the character being depicted as a fully computer-generated character.\nMak had a more substantial appearance in the 1999 Nintendo 64 video game Star Wars Episode I: Racer, where the character acted as one of the available playable characters at the start of the game. In the game, he was voiced by Tom Kane. Parts of Mak's backstory, including the fact that \"Elan Mak\" was only an alias for his true name, Kam Nale, were revealed in the Episode I Racer Nintendo Power companion guide, Star Wars: Episode I: Racer: The Official Nintendo Player's Guide. He later appeared in several Star Wars Legends stories, including the comic book Star Wars: Republic: Emissaries to Malastare and the junior novel Jedi Quest: The Dangerous Games by Jude Watson.\nA Kurtob engine with the same markings as Nale's Podracer appeared in junk dealer Watto's garage in the 2002 video game Star Wars: Racer Revenge, although Nale himself did not appear. He was set to appear in the game though. His voice lines were recorded for the character, but Nale was ultimately cut from the game. His voice files and other references to his involvement can still be found in the game's files, however. The character was also incorporated into Kinect Star Wars, a video game released in 2012 for the Xbox 360. He was featured under the name \"Elan Mak\" in the game's Podracing feature, in which he was a competitor against whom the player could race. Players could also utilize his vehicle as their Podracer. The conflict between Nale and Aldar Beedo was explored in the 2000 webcomic Podracing Tales, but their conflict did not receive closure until \"The Not-So Magnificent Seven,\" a blog article published in 2013 on the Official Star Wars Blog that detailed the lives of several untalented bounty hunters. Both Nale and Beedo were referenced under Rango Tel's entry in the blog, which provided details on the outcome of Nale's hunt. Nale was also mentioned in an article in Star Wars Magazine 2, which misspelled his pseudonym as \"Elan Nak.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Elan_Mak",
  "/wiki/Kam_Nale",
  "/wiki/Kam_(disambiguation)",
  "/wiki/Ploo_IV/Legends",
  "/wiki/Fluggrian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Kurtob",
  "/wiki/KRT_410C",
  "/wiki/32_BBY/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Borzu_Nale",
  "/wiki/Glymphid/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Aldar_Beedo/Legends",
  "/wiki/Death/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Boonta_Eve_Classic/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Dug_Derby",
  "/wiki/Malastare/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Unidentified_mercenary_(Baroonda)",
  "/wiki/Time/Legends",
  "/wiki/File:Kam_Nale-crash.ogg",
  "/wiki/Water/Legends",
  "/wiki/Expansion_Region/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Orin_Nyell",
  "/wiki/Sernpidal/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Trugut/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Rango_Tel",
  "/wiki/Bounty/Legends",
  "/wiki/Boonta/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Music/Legends",
  "/wiki/Glimmik/Legends",
  "/wiki/Boles_Roor/Legends",
  "/wiki/Devlikk/Legends",
  "/wiki/Wan_Sandage/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Sebulba/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Phuii",
  "/wiki/Mars_Guo/Legends",
  "/wiki/Veknoid/Legends",
  "/wiki/Teemto_Pagalies/Legends",
  "/wiki/Mawhonic/Legends",
  "/wiki/Sandcrawler/Legends",
  "/wiki/Human/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Ebe_E._Endocott/Legends",
  "/wiki/Malastare_drag_course_3",
  "/wiki/Phoebos_Memorial_Run",
  "/wiki/Vinta_Harvest_Classic/Legends",
  "/wiki/By%27t_Distombe",
  "/wiki/Geyser/Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/Podracing_Quarterly/Legends",
  "/wiki/26_BBY/Legends",
  "/wiki/Euceron",
  "/wiki/Galactic_Games/Legends",
  "/wiki/Hekula",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Aleena/Legends",
  "/wiki/Deland_Tyerell/Legends",
  "/wiki/Doby_Tyerell",
  "/wiki/Gasgano/Legends",
  "/wiki/Ody_Mandrell/Legends",
  "/wiki/Zanales",
  "/wiki/Will_Neluenf",
  "/wiki/24_BBY/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Felucia/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Baroonda",
  "/wiki/Fire_Mountain_Rally/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/File:Kam_Nale-taunt.ogg",
  "/wiki/Limb/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Fodesinbeed_Annodue/Legends",
  "/wiki/Troig/Legends",
  "/wiki/File:Fode-Elan_Mak.ogg",
  "/wiki/Huttese/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Language/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Aldar_Beedo%27s_blaster_pistol",
  "/wiki/Engine/Legends",
  "/wiki/Paul_Griffin",
  "/wiki/Star_Wars_home_video_releases#Star_Wars_Episode_I:_The_Phantom_Menace",
  "/wiki/Terryl_Whitlatch",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Terry_Brooks",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Star_Wars_home_video_releases",
  "/wiki/Nintendo_64",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Episode_I:_Racer",
  "/wiki/Tom_Kane",
  "/wiki/Star_Wars:_Episode_I:_Racer:_The_Official_Nintendo_Player%27s_Guide",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Republic:_Emissaries_to_Malastare",
  "/wiki/Jedi_Quest:_The_Dangerous_Games",
  "/wiki/Jude_Watson",
  "/wiki/Watto/Legends",
  "/wiki/2002",
  "/wiki/Star_Wars:_Racer_Revenge",
  "/wiki/Kinect_Star_Wars",
  "/wiki/2012",
  "/wiki/Xbox_360",
  "/wiki/2000",
  "/wiki/Podracing_Tales",
  "/wiki/The_Not-So_Magnificent_Seven",
  "/wiki/2013",
  "/wiki/Star_Wars_Blog",
  "/wiki/Podracing_101!",
  "/wiki/Star_Wars_Magazine_2",
  "/wiki/Category:Audio_files_of_Kam_Nale",
  "/wiki/Category:Images_of_Kam_Nale",
  "/wiki/Star_Wars:_Anakin%27s_Speedway",
  "/wiki/Star_Wars_Episode_I_Journal:_Anakin_Skywalker",
  "/wiki/Star_Wars_Episode_I:_I_Am_a_Pilot",
  "/wiki/Star_Wars_Racer_Arcade",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(unabridged_audiobook)",
  "/wiki/Star_Wars_(1998)_14",
  "/wiki/Star_Wars_(1998)_15",
  "/wiki/Star_Wars_(1998)_16",
  "/wiki/HoloNet_News_Vol._531_49",
  "/wiki/Star_Wars_Episode_I_Who%27s_Who:_A_Pocket_Guide_to_the_Characters_of_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_I_Incredible_Cross-Sections",
  "/wiki/Star_Wars:_Episode_I_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Star_Wars:_Episode_I_Racer:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars:_Episode_I_Podracer_Punch-Outs",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_26",
  "/wiki/Star_Wars_Kids_(1997)",
  "/wiki/Who_Is_That_Alien%3F",
  "/wiki/Star_Wars_Kids_9_(1999)",
  "/wiki/Young_Jedi_Collectible_Card_Game",
  "/wiki/Boonta_Eve_Podrace_(YJCCG)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/Star_Wars_Chronicles:_The_Prequels",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary",
  "/wiki/Star_Wars:_Complete_Cross-Sections",
  "/wiki/Star_Wars_Fandex_Deluxe_Edition",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Phantom_Menace:_The_Expanded_Visual_Dictionary",
  "/wiki/The_Official_Star_Wars_Fact_File_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_3_(2013)",
  "/wiki/StarWars.com",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_3_(2014)",
  "/wiki/Star_Wars_Comic_3",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Magazine",
  "/wiki/Star_Wars:_Racer_Revenge:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Great_ReSynchronization",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Template:YearMathGRS"
 ]
}