{
 "name": "Kam Solusar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Prior to 19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic EmpireDark Side Elite",
      "Dark Side Elite",
      "New Jedi Order",
      "New Republic",
      "Galactic Federation of Free Alliances"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Ranik Solusar",
      "Vill Goir",
      "Luke Skywalker"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Octa Ramis"
     ]
    }
   ]
  }
 ],
 "content": "Kam Solusar was a Jedi Knight who turned to the dark side of the Force, but was brought back to the light side through the efforts of Luke Skywalker. After his meeting with Skywalker, Kam became one of the first students to study at the Jedi Praxeum on Yavin 4. Later on he became a Jedi Master and married fellow Jedi Tionne. He was also the genetic template for the clone Alpha.\nThe son of Ranik Solusar, a Jedi Master slain by Darth Vader, Solusar spent many years hiding from Vader's Dark Jedi. When discovered, Solusar was tortured until his spirit was broken, and then converted to the dark side of the Force. He was stripped of the memories of his former life. After training as a Dark Jedi, Emperor Palpatine selected him as a personal warrior on Byss, part of the Dark Side Elite. On Vjun, Vill Goir taught Solusar lightsaber combat techniques.\nSolusar first encountered Skywalker on Nespis VIII circa 10.5 ABY. Sensing great strength in Solusar, Skywalker was determined to turn him back. With great difficulty, Luke helped Solusar to cast off the chains of the dark side and embrace the light side of the Force as he was intended to by restoring his memories. Now loyal to Skywalker, Solusar traveled with the Jedi Master to Ossus to assist the Ysanna in their battle against Imperial forces. He was made a general of the New Republic Defense Forces; after defeating an Imperial army and two Dark Jedi, Solusar led a raid on the reborn Emperor's flagship and sabotaged it.\nThe two Jedi parted ways after the defeat of the clone Emperor, but were reunited on Yavin 4 with the establishment of the Jedi Praxeum in 11 ABY. Although older than the other Jedi candidates, Solusar proved to be one of Skywalker's strongest apprentices, eventually becoming a full Jedi Knight.\nDuring his years on Yavin 4, Solusar fell in love with the Jedi historian and minstrel Tionne. The two got married in 18 ABY.\nThe friendship between Solusar and Skywalker grew deep enough that Skywalker asked him to preside over his Jedi wedding to Mara Jade in 20 ABY. He performed the first wedding ceremony, and at the second ceremony he helped subdue attackers so that the wedding could continue.\nWhen Skywalker departed the Praxeum to assist in sporadic intergalactic conflicts, he left Solusar in his stead as administrator of the Academy.\nSolusar held the view that the light side was the only true aspect of the Force, and that the dark side was only the Force's hollow shadow.\nDuring the Yuuzhan Vong invasion, Kam and Tionne took on the responsibility of guarding the young Jedi students of the Academy. When the Peace Brigade attacked the Academy in the invasion's second year, Kam hid the children and protected them until Anakin Solo and Talon Karrde arrived. The children were loaded onto the Wild Karrde, and then the Errant Venture, and cleared a path to a new home at the forgotten Maw Installation. Kam and Tionne also scouted the Deep Core to find a secondary location for another Jedi base. They chose the world of Eclipse.\nAfter Eclipse had to be evacuated, Kam and Tionne remained with the Academy students for the duration of the war, far from the front lines. At the conclusion of the Yuuzhan Vong conflict, Kam recommended that Skywalker reestablish the Jedi Academy and New Jedi Order on the ancient world of Ossus, which Skywalker agreed to. Afterwards, Kam went on to be part of the Masters' Council.\nDuring the Second Galactic Civil War, Kam and Tionne were the caretakers of the Academy on Ossus. Following the death of Mara Jade Skywalker, many of the Jedi Masters left for Coruscant to attend her funeral, leaving Kam and Tionne in charge of a handful of Jedi Knights and Padawans. Jacen Solo, who by this time had assumed the Sith title of Darth Caedus and seized control of the Alliance, sent members of the Galactic Alliance Guard to Ossus, ostensibly to protect the Academy from terrorists, but in reality to keep the Jedi in check by threatening the Padawan learners. Kam and Tionne were unable to stop them.\nWhen the Jedi later deserted the Galactic Alliance, Darth Caedus ordered the execution of the Masters and Knights. Some were downed with coma gas, while others were shot by GAG snipers, and the Padawans were rounded up in an outdoor area. Kam and the few other Jedi remaining were forced to remain in hiding and watch until they knew the full extent of the situation.\nTionne Solusar, however, went to confront the Major in charge of the operation, Salle Serpa. Serpa begin shooting off her limbs with a blaster, attempting to draw the remaining Jedi out of hiding. Kam eventually broke from his cover, and was shot by three sniper blasts, seriously wounding him.\nAgainst all odds, Kam survived all three hits to the chest and began recovering on Endor along with Tionne.\nShortly after the end of the Second Galactic Civil War, Jedi Jaden Korr discovered an old Imperial cloning facility, which contained a mad clone of Kam Solusar, named Alpha.\nKam was one of many Jedi accompanying Grand Master Luke Skywalker when members of Galactic Alliance Security and a contingent of bounty hunters arrested him in 43 ABY. Kam activated his lightsaber and deflected several stray blaster bolts into the ground to protect Luke and the others. Skywalker was forced to agree to a deal with Chief of State Natasi Daala, that saw him exiled from Coruscant and forbidden to interfere in Jedi affairs. In his place, Daala instituted Kenth Hamner as interim Grand Master of the Jedi Order and head of the Council.\nMaster Solusar and the other Council members quickly became frustrated with Hamner's weak leadership and policy of appeasing the hostile Daala. While the Master's Solusar were not present for the actual vote of no confidence in Hamner's leadership, a majority of the Council members were and all voted to relieve the Grand Master of his position, as well as his seat on the Council. It is likely they would have voted to oust Hamner anyway however, as the entirety of the Council was said to be unsatisfied with his leadership.\nAfter Hamner died after attacking Master Saba Sebatyne, Masters Cilghal and Corran Horn attempted to convince her to take up the role of interim Grand Master in his place. Sebatyne believed they should summon the Solusar's and did not want to take up the mantle, however, the pair were busy running evacuation drills. Saba eventually reluctantly bowed to the Council's wish that she act as their leader.\nKam and Tionne Solusar helped move all of the Jedi students and their families from Ossus to Shedu Maad, however one ship was destroyed by the Sith.\nKam Solusar was a trained Force user and lightsaber duelist, first taught as a member of the Dark Side Elite, and then by Luke Skywalker. He showed his ability as a duelist by defeating his dark side trainer Vill Goir, and by the time he was a Jedi Master he was able to keep up in sparing with famed duelists like Corran Horn.\nSolusar was originally set to debut in the graphic novel Lightsider, set in between Dark Empire I \u0026 II, but the project was canceled. He thus suddenly first appears in Dark Empire II with no backstory, other than the mention of his father. In The Jedi Academy Trilogy, he's mentioned as having been defeated by Luke Skywalker in the game of Lightsider, thus bringing him back from the dark side. The meeting between the two is documented in the Dark Empire II audio drama.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Solusar",
  "/wiki/Kam_(disambiguation)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Kam_Solusar",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_Side_Elite",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Ranik_Solusar",
  "/wiki/Vill_Goir",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Octa_Ramis",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/Alpha_(clone)",
  "/wiki/Battle_of_Onderon_(Galactic_Civil_War)",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Byss/Legends",
  "/wiki/Vjun/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Nespis_VIII",
  "/wiki/10_ABY/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/Ysanna/Legends",
  "/wiki/General/Legends",
  "/wiki/New_Republic_Defense_Forces",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Dark_Empire_II",
  "/wiki/Corran_Horn",
  "/wiki/11_ABY/Legends",
  "/wiki/18_ABY/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/20_ABY/Legends",
  "/wiki/Wedding_of_Luke_Skywalker_and_Mara_Jade",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Peace_Brigade",
  "/wiki/Anakin_Solo",
  "/wiki/Talon_Karrde",
  "/wiki/Wild_Karrde",
  "/wiki/Errant_Venture/Legends",
  "/wiki/Maw_Installation",
  "/wiki/Planet/Legends",
  "/wiki/Eclipse_(planet)",
  "/wiki/Masters%27_Council",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Funeral_of_Mara_Jade_Skywalker",
  "/wiki/Padawan/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Sith/Legends",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Battle_of_Ossus_(Second_Galactic_Civil_War)",
  "/wiki/Coma_gas",
  "/wiki/Major/Legends",
  "/wiki/Salle_Serpa",
  "/wiki/Jaden_Korr",
  "/wiki/Cloning/Legends",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/43_ABY",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Kenth_Hamner",
  "/wiki/Saba_Sebatyne",
  "/wiki/Cilghal",
  "/wiki/Evacuation_of_Ossus",
  "/wiki/Shedu_Maad",
  "/wiki/Lightsider_(story)",
  "/wiki/Star_Wars:_The_Jedi_Academy_Trilogy",
  "/wiki/Lightsider",
  "/wiki/Category:Audio_files_of_Kam_Solusar",
  "/wiki/Category:Images_of_Kam_Solusar",
  "/wiki/Canon",
  "/wiki/Dark_Empire_II_1",
  "/wiki/Dark_Empire_II_2",
  "/wiki/Opening_crawl",
  "/wiki/Dark_Empire_II_3",
  "/wiki/Dark_Empire_II_4",
  "/wiki/Dark_Empire_II_5",
  "/wiki/Dark_Empire_II_6",
  "/wiki/Dark_Empire_II_(audio)",
  "/wiki/Star_Wars:_Empire%27s_End",
  "/wiki/Empire%27s_End_(audio)",
  "/wiki/I,_Jedi",
  "/wiki/Jedi_Search",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/Wizards.com",
  "/wiki/Rebel_Jedi",
  "/wiki/Darksaber_(novel)",
  "/wiki/Union_1",
  "/wiki/Union_2",
  "/wiki/Union_3",
  "/wiki/Union_4",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_I:_Conquest",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Crosscurrent",
  "/wiki/Riptide_(novel)",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Magazine_1",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/Diplomatic_Corps_Entrance_Exam",
  "/wiki/The_Jedi",
  "/wiki/Star_Wars_Galaxy_Magazine_13",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Star_Wars_Galaxy_Collector_4",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Star_Wars_Handbook_3:_Dark_Empire",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_134",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Union",
  "/wiki/Brakiss",
  "/wiki/Gantoris",
  "/wiki/Streen",
  "/wiki/Dorsk_81",
  "/wiki/Kirana_Ti",
  "/wiki/Kyp_Durron",
  "/wiki/Kyle_Katarn",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/44_ABY",
  "/wiki/Barratk%27l",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Jedi_Battlemaster",
  "/wiki/Cin_Drallig/Legends",
  "/wiki/13_ABY/Legends"
 ]
}