{
 "name": "Kan Be",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaminoan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  }
 ],
 "content": "Kan Be was a male Kaminoan who, along with Isin and Toren, attempted to help Agent Terex storm Grakkus the Hutt's fortress in Megalox prison. Their plot was foiled by the Resistance starfighter pilot Poe Dameron and his astromech droid BB-8.\nKan Be was a crime lord who was imprisoned at Megalox prison on the high gravity world of Megalox Beta. The prison was protected from the planet's high gravity by a gravity field generated by an orbiting space station. Megalox was considered by the New Republic to be a dumping ground for the worst galactic criminals, who were left to fend for themselves. Kan Be commanded a gang and was a rival of Grakkus the Hutt, who commanded his own posse of Hutts.\nAfter the First Order Agent Terex's deal with Grakkus fell apart, Terex met with Kan Be and the other crime lords Isin and Papa Toren. When Terex introduced himself, Kan Be dismissed as a \"garbage sniffer\" and likened his uniform to a \"hat on an aiwha.\" When Terex told the crime lords about his failed deal, Kan Be remarked that Terex was trying to rub their faces. Terex offered to break the crime lords out of the prison if they helped him to storm Grakkus' fortress, kill the Resistance pilot Poe Dameron and his Black Squadron and Grakkus' guards. Terex planned to interrogate Grakkus and then kill him. The crime lords agreed to Terex's bargain after he threw a knife on the table.\nWhile the gangsters' combined gangs fought Black Squadron and Grakkus' guards, Kan Be and the other crime lords watched the fighting with Terex. Kan Be remarked that riots were the only entertainment that the gangsters got. In response, Terex reminded the gangsters to spare Poe for him. Poe however outmaneuvered the gangsters and Terex by getting the squadron's astromech droids led by BB-8 to deactivate the gravity shield. Kan Be and the other gangsters were overwhelmed by the high gravity of Megalox Beta.\nWhen Isin queried why Papa Toren was weeping, Kan Be responded that one of his Ximpi had died when it crashed to the ground. He predicted that they would be dead. Terex disagreed and summoned his starship Carrion Spike, which sent a droid to pick him up. Once aboard the ship, Terex told the gangsters that he was abandoning them for failing in their mission. Kan Be protested but his pleas fell on deaf ears.\nKan Be was a male Kaminoan with gray eyes. He was a crime lord and had a rivalry with Grakkus the Hutt. Kan Be was willing to work with the other crime lords Toren and Isin to storm Grakkus' palace in return for Terex helping them to escape. He regarded riots as a form of entertainment on the bleak prison world of Megalox Beta.\nKan Be first appeared in the 2016 comic issue Poe Dameron 5, written by Charles Soule and illustrated by Phil Noto.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kaminoan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Isin",
  "/wiki/Toren",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Hutt",
  "/wiki/Fortress_of_Grakkus_the_Hutt",
  "/wiki/Megalox",
  "/wiki/Prison",
  "/wiki/Resistance",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Poe_Dameron",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Crime_lord",
  "/wiki/Megalox_Beta",
  "/wiki/Space_station",
  "/wiki/New_Republic",
  "/wiki/First_Order",
  "/wiki/Parent",
  "/wiki/Aiwha",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Ximpi",
  "/wiki/Carrion_Spike",
  "/wiki/2016",
  "/wiki/Marvel_Comics",
  "/wiki/Poe_Dameron_5",
  "/wiki/Charles_Soule",
  "/wiki/Phil_Noto",
  "/wiki/Poe_Dameron_6",
  "/wiki/StarWars.com"
 ]
}