{
 "name": "Kandria A'Daasha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Kandria A'Daasha was a female Human and the co-owner of the Glow Dome nightclub, located on the world of Adarlon, along with her twin sister Corinna. She was secretly being preyed upon by Ziakas, a dark side creature that was devouring her very essence.\nKandria and her twin sister Corinna were born into a wealthy family that provided for all their needs. As children they never struggled for anything and although her sister Corinna became bored and restless by a life of luxury, Kandria enjoyed her childhood using her economic freedom to fund lessons in dancing, singing, and musical instruments. When Corinna left home to explore the galaxy, separation did not suit either sister and shortly afterwards Kandria joined her sister in their journey through the stars.\nIt was Kandria's idea to travel to the pleasure planet of Adarlon and finally the twins found a site that suited both of their personalities. Although it was both their ideas to open up the nightclub, the Glow Dome, the day-to-day operations have fallen almost entirely on Corinna as Kandria spent her time entertaining and partying.\nA dangerous dark side creature, a Derriphan known as Ziakas, attached itself to Kandria and had begun feeding upon her thoughts and essence. Kandria attributed the fatigue as caused by too little sleep and too much partying but the truth was much more horrific. If left to feed upon Karinna the Derriphan would have drained her to an empty husk in less than a month.\nKandria was far more wild and free spirited than her sister, in fact the two were almost opposites. This would explain why she felt no particular pull towards the Rebel Alliance unlike her sister. Both sisters had a mischievous streak but while Corinna's antics were harmless, Kandria would often get herself into bad situations that resulted in her more practical sister coming to her rescue. Kandria could also be cruel and had a tendency to go through boyfriends very quickly. Kandria was a very attractive woman and wore form-fitting and revealing outfits to accentuate her body. She wore her long, curly blonde hair in elegantly styled hairdos, and she always made sure to keep up with the latest fashions.\nAlthough she had talent as a holoprogrammer, Kandria was only a moderately skilled artist and dancer despite being passionate about entertaining. She was a skilled seductress and could be very persuasive when she wanted to. She was fairly skilled with blasters as well.\nKandria carried two Quickfire-4 hold-out blasters. She often wore a form-fitting jumpsuit that was cut to be even more revealing than her sister's. Over this she would wear an azure cloak that was the exact same shade as her eyes.\nKandria A'Daasha was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. She was illustrated by Tom O'Neill.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Glow_Dome",
  "/wiki/Planet/Legends",
  "/wiki/Adarlon/Legends",
  "/wiki/Twin/Legends",
  "/wiki/Corinna_A%27Daasha",
  "/wiki/Ziakas",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Derriphan_(creature)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Model_Q4_hold-out_blaster_pistol",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Tom_O%27Neill",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}