{
 "name": "Kandar Vallan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kandar Vallan was a Human member of the Rebel Alliance.\nVallan was born on Tatooine and grew up working for various gangs, before finally becoming employed by Jabba the Hutt. However, after something happened, Bib Fortuna advised Vallan to flee Tatooine, which Vallan did, no questions asked. Vallan traveled from planet to planet, stealing ships until eventually arriving in the Corporate Sector. While there, Vallan made a lot of money and investigated in illegal modifications to a recently stolen ship, although the ship was stolen from Vallan soon after. Afterward, Vallan joined the Rebel Alliance, hoping to use this as an opportunity to meet useful contacts and find opportunities. Vallan served aboard the ship Griffon's Wings and was one of the survivors when it crash-landed on the planet Yorgraxx. Vallan and the other survivors joined up with some Imperials who were stranded on the planet and they confronted the spirit of the Sith Lord Quorlac Fornayh.\nVallan's only appearance is in Shadows in the Force, a supplement to the Star Wars Roleplaying Game. Vallan is a playable character, whose gender can be chosen by the player, so Vallan's canonical gender is not currently known.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Bib_Fortuna/Legends",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Griffon%27s_Wings",
  "/wiki/Yorgraxx",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Quorlac_Fornayh",
  "/wiki/Shadows_in_the_Force",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Gender/Legends"
 ]
}