{
 "name": "Kant Graf",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Kant Graf was a male Devaronian architect who lived during the time of the Galactic Civil War. In 1 ABY, Graf sought to begin construction on an area of land occupied by a family of Gungans. However, the Gungans refused to clear the area, losing Graf money for every day he failed to begin construction. With the help of a Force-sensitive spacer who was undergoing Jedi training, Graf hoped that the Gungans could be convinced to move out. However, after the Padawan learned that the Gungans had lived on the land for a very long time, the Force-sensitive decided to let the Gungans keep the land, much to Kant Graf's dismay.\nA male Devaronian by the name of Kant Graf lived during the time of the Galactic Civil War, a major conflict between the Galactic Empire and the Alliance to Restore the Republic. By the time following the Battle of Yavin, Graf worked as an architect. In 1 ABY, he sought to begin construction on a piece of land inhabited by a family of Gungans. However, the Gungans refused to move off the land, which ended up costing Graf money for every day construction failed to commence.\nFortunately for Graf, he was approached by a Force-sensitive spacer undergoing a series of Jedi Trials. As part of their training, the Padawan traveled the galaxy in search of citizens facing difficult situations. After hearing Graf's plight, the Jedi-to-be agreed to deal with the Gungans. Initially, the Padawan accused one of the Gungan inhabitants of trespassing on their client's land. However, the intrepid Force-sensitive soon learned that the family of Gungans had actually lived there for a very long time, and that the land was never put up for sale. The Padawan apologized for inconveniencing the Gungan landowner, and returned to Graf to inform him that he had no right to take the land away from them. Graf was left incredulous by the Padawan's \"sickening\" display of sympathy, and insisted that the land was rightfully his, despite the fact that the Gungans were occupying it.\nKant Graf had red skin, and yellow-colored eyes. Greedy and unsympathetic, Graf proved willing to evict a family of Gungans from an area of land which he believed was rightfully his, even if it meant using deadly force. Although he ordinarily acted friendly and respectful, Graf was liable to exhibit a more vicious demeanor if he did not get his way. When the Force-sensitive spacer employed by Graf refused to take the land away from the Gungans, he was sickened by the Padawan's sympathetic display, and lashed out emotionally.\nDuring his time as an architect, Graf wore all black clothing, including a leather trim shirt beneath a thick, wooly jacket, and dress slacks along with a pair of high quality boots.\nKant Graf was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. He was added to the game on August 31, 2004 as part of Publish 10, which revamped the process for becoming a Jedi in the form of newly implemented Padawan Trial quests. Graf was involved in one of the sixteen trial quests that players could complete, which required the player to resolve a land dispute with a Gungan NPC. Players would need to complete eight of these sixteen trial quests successfully in order to qualify as a Jedi Initiate. Because the trial quests were randomly assigned, it was possible for players to not be assigned Graf's quest. It was also possible for players to refuse the quest, or to fail up to three of the trials before being forced to restart the entire process over again. In this case, it was possible for players to fail the quest by wrongfully killing the Gungan landowner, instead of allowing the Gungan to keep the land. However, this article assumes 100% game completion under the light sided character choices. Each of the trial quests had a core moral that needed to be applied. In Graf's quest, the moral was, \"A Jedi must gather all possible information before making a decision.\" With the release of Publish 25's New Game Enhancements on November 15, 2005, the Jedi profession was once again revamped, this time to simply become a starter profession. The Padawan Trial quests were rendered defunct as a result, effectively removing Kant Graf from the game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Architect/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Death/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Leather/Legends",
  "/wiki/Shirt",
  "/wiki/Jacket/Legends",
  "/wiki/Boot/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_31",
  "/wiki/2004",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}