{
 "name": "Kao Cen Darach",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3681 BBY",
      "Korriban's orbital security station"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Satele Shan"
     ]
    }
   ]
  }
 ],
 "content": "Kao Cen Darach was a Zabrak male Jedi Master of the Jedi Order during the years preceding the Great Galactic War in 3681 BBY. A legendary Jedi Knight who later held the title Battlemaster, Darach trained a young Jedi Padawan named Satele Shan, who was present with him on a space station in orbit around the Sith homeworld of Korriban, along with Corporal Jace Malcom and the imprisoned smuggler Nico Okarr. The station was suddenly attacked by the Sith Empire, which had been believed to be destroyed for centuries, and who sought to retake the planet. Darach and Shan freed Okarr to help them warn the Galactic Republic, and fought the infiltrating Imperial soldiers as they raced to the hangar.\nAs they arrived, two Sith, Vindican and Malgus, entered the station and engaged in lightsaber combat with Darach and Shan. The Jedi Master had to save his apprentice from Malgus's blade during the fight, after which he instructed her to leave on Okarr's quickly departing ship. Darach stayed behind to continue fighting the Sith, now wielding Shan's double-bladed lightsaber. He was able to mortally wound Vindican but was killed by an enraged Malgus. Because of her Master's sacrifice, Shan was able to escape and warn the Republic of the Sith Empire's return.\nA Zabrak male Jedi Master, Kao Cen Darach served the Jedi Order and the Galactic Republic in the years that led up to the Great Galactic War in 3681 BBY. Many years before the war, Darach encountered a young Miraluka named Shol Bestros who had refused to join the Order throughout his childhood. Recognizing the youth's innate abilities, Darach convinced Bestros to become a Jedi, and the Miraluka went on to achieve the rank of Jedi Master around the time of the outbreak of the Great Galactic War, eventually serving as a member of the Jedi Council.\nDarach also held the position of Battlemaster of the Jedi Order, a title reserved for the premier instructor of lightsaber combat among the Jedi, and served on the Republic's capital of Coruscant during the years leading up to the war. But his idealism and staunch opposition to all forms of the dark side of the Force upset the Jedi Order's political position on the world. During his career as Battlemaster, Darach wrote a text entitled Combat Techniques of a Jedi Battlemaster.\nEventually, the Zabrak was assigned to serve on the security space station over the planet Korriban—the ancestral homeworld of the apparently defunct Sith Empire. During his time on the station, the young Jedi Padawan Satele Shan came to study the nature of the dark side and the use of a double-bladed lightsaber at his feet. During their time together, Darach trained her in lightsaber combat and guided her through her trials to become a full Jedi Knight.\nIn 3681 BBY, the two traveled to Korriban's surface to intercept Nico Okarr, a smuggler who was attempting to purchase stolen Sith artifacts from an infamous grave robber named Farel Wickes. Alongside the Republic Army Corporal Jace Malcom, the two Jedi apprehended Okarr, impounded his freighter Redshifter, and took him into custody. Okarr maintained his innocence while he was escorted up to the space station for incarceration, but Master Darach ignored his excuses. Darach questioned his Padawan when it appeared that Shan had been troubled by something that she sensed approaching. The source of her unease was revealed when the resurgent Sith Empire, which had been absent from the galactic stage for centuries, attacked the defending Republic forces in an effort to reclaim their ancestral homeworld.\nDarach prioritized warning the Republic of the Sith's return to the planet, and since none of the station's shuttles would be able to outrun the Sith fighters, Okarr volunteered his own vessel, which he claimed to be the fastest in the sector. Darach, Shan, Okarr, Malcom, and another Republic trooper fought their way to the station's hangar, through heavy resistance from Sith boarding parties. The group eventually reached the landing bay, although the troopers were killed in the process. After defeating several Sith troopers in the hangar, Darach and Shan were confronted by the Sith Lord Vindican and his apprentice, Malgus, who had arrived to prevent the Jedi's escape. While the Jedi and Sith dueled, Okarr and Corporal Malcom prepared the impounded Redshifter for departure. Darach held his own in combat against the Sith, but Shan did not fare as well, and narrowly avoided being slain by Malgus thanks to Darach timely lightsaber throw.\nAfter the initial engagement, Darach pushed Vindican away through the Force while Okarr's ship began to take flight, with Malcolm calling out for the Jedi to join them. Darach instructed Shan to board the starship and flee while he stayed behind and fought the two Sith, essentially sacrificing himself. As her master ran into the fray Shan threw her double-bladed lightsaber to him, which Darach used simultaneously with his own lightsaber to continue the battle, giving more time for her escape. Despite being outnumbered, Darach proved to be an even match for Vindican and Malgus, even managing to mortally wound Vindican. Malgus took his Master's lightsaber with the Force and moved towards Darach, who used the force to throw large pieces of wreckage towards the Sith. Malgus cut through the pieces with his lightsaber, jumping through the last one and launching a brutal, rage-filled assault on Darach, which eventually succeeded in slaying the Jedi Master. Shan felt Darach's death in the Force but continued on to warn the Republic of the Sith's return.\nDarach's sacrifice ultimately enabled the Republic to learn of the resurgence of the Sith, and prevented them from being caught completely off-guard by subsequent Sith attacks. Darach's Padawan, Shan, also went on to fight against Sith forces in numerous conflicts and eventually became the Grand Master of the Jedi Order, a feat only possible because of Darach's willingness to save her life at the cost of his own. Later in her life, Shan would remark in her annotations of the Jedi historian Gnost-Dural's journal that she felt she owed a debt to Kao Cen Darach—a debt that she was still making an effort to repay over thirty years later. Darach was eventually succeeded as Battlemaster by Jedi Master Jun Seros, who held the position during the Cold War.\nA hairless Zabrak male, Kao Cen Darach had light skin and green eyes, as well as the cranial horns typical of his species. The Zabrak Jedi Master devoutly followed his own rigid belief system, which stipulated that the dark side of the Force needed to be confronted and defeated, no matter what form it may take. His unique, hardline approach to matters of the Force made him an unpopular figure in the upper echelons of the Jedi Order on Coruscant—a fact which did little to deter the principled Jedi. Darach's assignment over Korriban was believed to be the result of this uncooperative political spirit, but Satele Shan would later postulate that Darach's stance against the dark side motivated him to choose the assignment for himself. Regardless of the reason, Darach's reputation as a determined crusader against the dark attracted the young Shan, who hoped to learn the Zabrak's philosophy through an apprenticeship.\nDuring the battle with the Sith, Darach displayed considerable bravery and did not hesitate to enter a battle despite being outnumbered. Darach was a very stoic and calm figure, and did not break his composure, even when in heated combat. By this time, he had forged a close relationship with Shan, and was immediately able to tell when something was troubling her. He was concerned for Shan's well-being during the conflict and even intervened on her behalf during combat aboard the Korriban space station.\nAs a Jedi Master and Battlemaster of the Order, Kao Cen Darach was an exceptionally capable warrior whose proficiency in lightsaber combat was unmatched among his contemporaries. In combat, Darach used a green single-hilt lightsaber, and proved capable of handling a Sith Lord and his apprentice at the same time. Darach also demonstrated the use of a style of combat where he simultaneously used a double-bladed lightsaber and a single-hilt lightsaber, thus wielding an unorthodox form of Jar'Kai. In fact, he was the one who taught Satele Shan how to use a saberstaff. His combat abilities enabled him to eventually defeat Vindican, but he was ultimately overwhelmed by Malgus's rage and brute strength; however, Malgus had been one of the Sith Empire's most seasoned fighters long before the attack on Korriban, so Darach's defeat could only be circumstantial.\nIn terms of the Force, Darach's telekinetic ability was significant enough that he was able to hurl large objects, such as pieces of starships, and repel opponents during combat. His level of control enabled him to throw his lightsaber precisely and effectively. Satele Shan believed that Darach may have been a capable seer, and that a vision of the Sith Empire's return was what drew him to Korriban.\nMaster Darach wore a complete set of armor, consisting in a suit with metal plates attached on his torso, arms, and legs underneath his standard Jedi robes. Such armor design would later became common for Jedi fighting in the Great Galactic War. As it was tradition for the Jedi, the Battlemaster featured a lightsaber at his side. It was a single bladed lightsaber with a metallic handle and a green blade.\nKao Cen Darach's first appearance in canon was in the Return cinematic trailer, released on June 6, 2011 for LucasArts's Star Wars: The Old Republic video game, developed by BioWare. While Darach had spoken lines, he was unnamed in the trailer and was not identified until a wallpaper bearing his name was later released on The Old Republic's official website. The Journal of Master Gnost-Dural, which was included with collector's editions of The Old Republic, recounted the events of the fall of Korriban and included notes and images of Kao Cen Darach. The Journal of Master Gnost-Dural and The Old Republic were released together on December 20, 2011. In the video game, an armor set called Jedi Stormguard featuring a very similar design and color scheme as the one Kao Cen Darach wore in the Return cinematic can be bought and equipped by players.\nThe 2012 reference guide Star Wars: The Old Republic Encyclopedia identified Darach as a Jedi Battlemaster, and also gave additional backstory about both Shol Bestros and Darach. In the Encyclopedia, Darach was listed alongside Revan and Ven Zallow under \"Notable Jedi Knights\", and he was also the sole entry in the \"Notable Zabrak\" field in the infobox for the Zabrak species. In summer 2013, a LEGO model of the Defender-class light corvette—titled the \"Jedi Defender-class Cruiser\"—was released that includes a minifigure of Kao Cen Darach.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3681_BBY",
  "/wiki/Korriban%27s_orbital_security_station",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Battlemaster",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Korriban",
  "/wiki/Corporal/Legends",
  "/wiki/Jace_Malcom",
  "/wiki/Prisoner/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Nico_Okarr",
  "/wiki/Battle_of_Korriban",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Time/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Imperial_soldier",
  "/wiki/Hangar/Legends",
  "/wiki/Darth_Vindican",
  "/wiki/Darth_Malgus",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/XS_stock_light_freighter/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Death/Legends",
  "/wiki/Miraluka/Legends",
  "/wiki/Shol_Bestros",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Combat_Techniques_of_a_Jedi_Battlemaster",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Farel_Wickes",
  "/wiki/Republic_Army",
  "/wiki/Freighter/Legends",
  "/wiki/Redshifter",
  "/wiki/Precognition/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Mark_VI_Supremacy-class_starfighter",
  "/wiki/Sector/Legends",
  "/wiki/Republic_trooper",
  "/wiki/Trooper/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Shiak",
  "/wiki/Telekinesis/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Death_convulsion",
  "/wiki/Grand_Master/Legends",
  "/wiki/Jedi_historian",
  "/wiki/Gnost-Dural",
  "/wiki/The_Journal_of_Master_Gnost-Dural",
  "/wiki/Jun_Seros_(Jedi)",
  "/wiki/Eye/Legends",
  "/wiki/Lightsaber_hilt/Legends",
  "/wiki/Kao_Cen_Darach%27s_lightsaber",
  "/wiki/Lord/Legends",
  "/wiki/Force_rage",
  "/wiki/Strong_style",
  "/wiki/Jedi_Seer",
  "/wiki/Jedi_apparel",
  "/wiki/Canon",
  "/wiki/Return_(cinematic_trailer)",
  "/wiki/June_6",
  "/wiki/2011",
  "/wiki/LucasArts",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/December_20",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Revan/Legends",
  "/wiki/Ven_Zallow",
  "/wiki/2013",
  "/wiki/Defender-class_light_corvette/Legends",
  "/wiki/Category:Images_of_Kao_Cen_Darach",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/3640_BBY",
  "/wiki/Timeline_6:_Onslaught_of_the_Sith_Empire",
  "/wiki/Hope_(cinematic_trailer)",
  "/wiki/The_Holonet",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/Deceived",
  "/wiki/Battle_of_Ilum"
 ]
}