{
 "name": "Karé Kun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sarq 22"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Shortly after the Battle of Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Rapier Squadron",
      "Rapier Squadron",
      "Resistance",
      "Stiletto Squadron",
      "Black Squadron",
      "Corellian Team Two",
      "Stiletto Squadron",
      "Black Squadron",
      "Corellian Team Two"
     ]
    }
   ]
  }
 ],
 "content": "Karé Kun was a human female starfighter pilot who served as a lieutenant in the New Republic Starfleet and as a member of Rapier Squadron. Along with fellow squadron members Commander Poe Dameron and Lieutenant Iolo Arana, she later joined the Resistance during its conflict with the First Order. She received a promotion to the rank of captain and was given command of her own starfighter squadron, Stiletto Squadron. Kun was married to Temmin Wexley, but was widowed when he was shot down and killed during the Battle of Exegol.\nKaré Kun was born on Sarq 22 sometime around the defeat of the Galactic Empire, and so she was known as a \"victory kid.\" At some point, she joined the New Republic Navy and became a lieutenant, as well as Rapier Two in Commander Poe Dameron's starfighter squadron, Rapier Squadron.\nAbout thirty years after the Battle of Endor, Kun, along with the rest of Rapier Squadron, responded to a distress call from the freighter Yissira Zyde near Suraz 4. The squadron emerged from hyperspace to find the freighter as it was boarded by First Order troops. They engaged the TIE fighters and shuttles nearby, managing to destroy all eight of the TIEs and one shuttle before the remaining shuttle and the Yissira Zyde jumped into hyperspace. Lieutenant Muran, Rapier Four, was killed when his vessel was caught too close to the Yissira Zyde as it went into hyperspace and the X-wing exploded.\nDuring Rapier Squadron's next patrol, Dameron embarked on a solo mission to search for the Yissira Zyde, forbidding the others to assist him. He followed the telemetry of the missing freighter and jumped into hyperspace, leaving Kun and Lieutenant Iolo Arana, Rapier Three, to patrol the sector as usual.\nFollowing Dameron's skirmish in OR-Kappa-2722, Kun, along with Dameron and Arana, joined General Leia Organa's Resistance. She and Arana were promoted to the rank of captain and given command of their own starfighter squadrons, with Kun leading Stiletto Squadron. Kun, Dameron, and Arana were transferred to the refitted MC80 Star Cruiser Echo of Hope.\nKun, along with Arana, was selected by Dameron to take part in a covert mission to steal New Republic Senator Erudo Ro-Kiintor's yacht, the Hevurion Grace, in Operation: Sabre Strike. Kun wore a bulky EVA suit and flew a Z-95 Headhunter for this mission in the Uvoss system. When the Hevurion Grace arrived in the system, Dameron disabled the ship with modified concussion missiles. He boarded the ship and forced the passengers and crew to evacuate into escape pods. While he was restarting the ships engines, a First Order fleet emerged out of hyperspace and attacked the pilots.\nIgnoring Dameron's orders to escape, Kun and Arana stayed nearby to fight off the TIE fighters swarming the yacht. They destroyed nine of the eighteen TIEs before the Resistance pilots were trapped between a gas giant and the First Order fleet. To avoid the planet's gravity, the pilots risked passing over the First Order ships and made a jump to hyperspace, completing their mission successfully.\nFollowing Operation: Sabre Strike, Dameron enlisted Kun and several other members of Black Squadron including Temmin Wexley , L'ulo L'ampar, and Jessika Pava on a secret quest to search for the explorer Lor San Tekka, whom Organa believed held the key to finding her brother Luke Skywalker. When L'ampar commented on the secrecy of the mission, Kun countered that he should be lucky that the Resistance allowed \"old-timers\" like him and Wexley near a starfighter.\nBlack Squadron traveled to the planet Ovanis, which was covered in mountains and ravines. While Dameron and BB-8 explored the Cave of the Crèche, Kun and her fellow pilots circled above in their T-70 X-wing starfighters and L'ampar's A-wing starfighter. After establishing contact with the Crèche cultists, Dameron informed L'ampar that he had found a tracker on his starfighter and warned that the First Order was on its way. Kun then warned him that the First Order had already arrived. She spotted a First Order landing platform carrying several TIE fighters, two Atmospheric Assault Landers, and a contingent of stormtroopers who were equipped with jetpacks.\nKun and her fellow pilots then discussed the meaning of Dameron's order \"get me some leverage.\" She agreed with L'ampar's assessment that they should figure out the order themselves. After studying the situation, Wexley proposed that they take control of the First Order platform since there was nowhere else to land on the mountainous planet. When Pava proposed drawing away the starfighters, Kun warned that the new TIE/sf space superiority fighters were faster and more maneuverable than X-wings. L'ampar then agreed to attack the TIE fighters, leading to a dogfight. Black Squadron managed to shoot down several TIE fighters but L'ampar accidentally downed the First Order platform, causing it to crash.\nHowever, the First Order Agent Terex had kept the Maxima-A class heavy cruiser Ravenous in reserve. The Ravenous launched more TIE fighters, which overwhelmed Black Squadron. At the advice of Wexley, Kun and her fellow pilots flew their starfighters into the canyons in an effort to disperse their pursuers. Though Pava managed to destroy several pursuing TIE fighters, her astromech droid was hit. Under fire, Wexley realized that their plan was not working and ordered them to regroup for a head-on assault. Prior to the assault, Wexley confided that he had feelings for Kun. She responded that he would propose to her back at the Resistance base on D'Qar.\nDuring the dogfight, Black Squadron managed to shoot down several TIE fighters. Kun and her fellow fighters then witnessed a fight between two large winged creatures that had emerged from the Crèche egg. After Dameron and the Crèche cultists had subdued Terex and his men, Kun and her comrades refueled their starfighters at the Cave of the Créche. After the cultists departed on the back of the black winged creature, Black Squadron departed Ovanis. Before leaving, they radioed the Ravenous to pick up the stranded Terex. Dameron had decided not to take Terex into custody to avoid risking open warfare between the Resistance and the First Order.\nFollowing a small victory celebration on D'Qar, Kun shared an awkward, yet romantic moment with Wexley before leaving for a mission to Megalox prison on the planet Megalox Beta. Dameron had learned from the Crèche leader that Tekka had spoke with Grakkus the Hutt, who was imprisoned at Megalox. The planet was a high gravity world and the prison was surrounded by a gravity field that was projected by an orbiting space station that served as the prison's control center. Organa managed to bribe Warden Luta into allowing Black Squadron to visit Grakkus.\nKun and her comrades traveled into the prison accompanied by a squad of prison guards. Upon arriving at the landing bay, Black Squadron were abandoned by the guards. Unable to bribe the guards into escorting them to Grakkus' fortress, Kun and her comrades were forced to fight their way through the criminals. After arriving at Grakkus' fortress, Kun and her fellow pilots were accosted by Grakkus and his Hutt posse. While Dameron met with Grakkus, Kun and the other pilots waited outside in the compound. Dameron soon encountered Terex, who had learned of their secret mission to Megalox. Grakkus then offered to reveal the information to whoever helped him escape Megalox.\nWhen Terex exited the building, Kun and her fellow pilots expressed surprise that the First Order agent had beaten them to Grakkus. Dameron then rejoined Black Squadron and told them that they were locked in a race with Terex to help Grakkus escape the prison. Dameron got BB-8 and the other astromech droids to embark on a mission to disable the prison's gravity shield in order to gain leverage over Grakkus and Terex. Meanwhile, Terex managed to convince the crime bosses Kan Be, Papa Toren, and Isin to organize them gangs for an attack on Grakkus' fortress in return for helping them escape offworld. Kun and her Black Squadron comrades were forced to fight off the gangsters.\nKun managed to obtain a blaster during the fight and helped hold off the assault long enough for BB-8 and the other droids to complete their mission. While Megalox Beta's high gravity overwhelmed the gangsters, Kun and her comrades were unaffected because they wore gravity belts. After rescuing Grakkus, Dameron contacted Luta and managed to convince her to let them escape with Grakkus in return for restoring the prison's gravity field. Having completed their mission, Black Squadron departed on their starfighters with Grakkus' ship.\nWhen Terex attacked the space station and several fleeing shuttles, Kun and her fellow pilots turned back at Temmin's urging and attacked Terex's ship Carrion Spike. They then returned to D'Qar.\nAfter learning that a spy within their ranks had leaked information to Terex, Dameron was unable to trust his fellow Black Squadron pilots including Kun. As a result, Poe did not include Kun and her comrades during the mission to Pheryon. While Dameron believed that Kun was loyal since she had flown with him in the New Republic Navy, he did not bring her and the other Black Squadron pilots during a mission to Kaddak to recover N1-ZX, a member of the Resistance spy droid network who had supposedly obtained valuable intelligence on the First Order. Instead, he brought BB-8, the technician Oddy Muva, and Organa's spymaster C-3PO.\nDuring the course of the mission, Dameron realized that Kun, Pava, and Wexley were innocent and that Muva was the true spy. In fact, Muva had been blackmailed by Terex into spying on Black Squadron in order to safeguard his wife Sowa Chuan. After Dameron and the droids crash-landed on a desert world, Kun and the rest of Black Squadron traveled to the planet to rescue their commander.\nKun participated in a battle over a desert planet as part of an effort to rescue Dameron from First Order forces. Black Squadron fought against Terex's flagship Carrion Spike and his fleet of Ranc Gang \"Uglies.\" Despite taking damage from the \"Uglies\" and temporarily losing control of her X-wing, she survived thanks to L'ampar providing covering fire for her. Muva reprogramming the Carrion Spike's battle computers to attack the \"Uglies.\" Muva then contacted Kun and her squadron mates and told her that he had sabotaged the Carrion Spike's computers and was evacuating his wife and Terex's slaves in escape pods. Kun and the rest of Black Squadron agreed to protect the escape pods from the Ranc fighters.\nDespite the efforts of Kun and her fellow pilots, one of the Ranc \"Uglies\" managed to destroy an escape pod. Kun was distraught and L'ampar responded by shooting down the \"Ugly.\" L'ampar's actions, however, put him directly in the firing line of First Order starfighters, resulting in his death. Kun and the rest of Black Squadron then flew against the Ranc fighters for a final sortie. Shortly later, they witnessed a First Order Maxima-A class heavy cruiser and its TIE fighters destroying the Carrion Spike and the Ranc fleet. Kun and her comrades expressed shock that the First Order was targeting one of their own, not knowing that Terex was in trouble with his First Order superiors. After the escape pods had safely landed on the desert planet, Kun and her fellow pilots flew over Dameron as he was confronting Commander Malarus and a First Order landing party. They took a holo-recording to dissuade any potential First Order attack. Fortunately for Black Squadron, Malarus had come to arrest Terex for defying Supreme Leader Snoke's orders to avoid open hostilities with the New Republic and the Resistance.\nAfter L'ampar's funeral, Kun joined the other members of Black Squadron to share drinks and stories of L'ampar's combat career.\nAfter a harrowing mission, Kun and Wexley confessed their true feelings, and were married.\nFollowing the First Order's destruction of the Hosnian system, Kun and Wexley took part in a recon run of Starkiller Base. Wexley's craft encountered trouble, but Kun threatened to divorce her new husband if he gave up. She piloted her X-wing to recover the craft and they escaped in hyperspace back to D'Qar. Using their collected data, the Resistance was able to assault and destroy Starkiller Base.\nBlack Squadron was then assigned missions of their own to gather allies.\nIn 35 ABY, Snap kept a holo of her in his cockpit. The two joined the remaining Resistance fighters at their new base on Ajan Kloss. Kun embraced her husband before he flew off to battle against the Sith Eternal's forces. He was shot down by Sith TIE fighters during the battle, and Kun's name was on his lips as he perished.\nKaré Kun was a human woman with blonde hair, tan skin, and black eyes. She was a loyal friend of Poe Dameron, who was willing to help him with anything. Kun shared Dameron's concerns that the New Republic was not doing enough to fight the First Order and joined the Resistance, a paramilitary outfit dedicated to monitoring the First Order's activities. Kun was a competent starfighter pilot who was able to improvise orders in combat to fit the situation. Kun also reciprocated Wexley's romantic feelings and the two developed a relationship following their mission to Ovanis. Kun also knew how to wield blasters and to fight in unarmed combat.\nKun's loyalty to Dameron led her and her fellow Black Squadron pilots to come to his aid over a desert planet during a mission to retrieve a spy droid. She cared for her fellow pilots and thanked L'ampar for protecting her stricken fighter from Terex's \"Uglies.\" Later, she provided firing cover for Muva and the fleeing slaves as they escaped Terex's ship Carrion Spike. Kun was distraught when L'ampar was killed in combat.\nKaré Kun first appeared in Greg Rucka's 2015 junior novel Before the Awakening, which was released in conjunction with the 2015 film Star Wars: Episode VII The Force Awakens, the first installment of the Star Wars sequel trilogy. She was first pictured in the Marvel Comics series Star Wars: Poe Dameron which was written by Charles Soule and illustrated by Phil Noto. Greg Grunberg, the actor who played Temmin Wexley in The Force Awakens, was unaware of Karé's existence until a Twitter user notified him on his Twitter account after asking him if Karé would be making an appearance in the 2019 film Star Wars: Episode IX The Rise of Skywalker.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Age_of_Resistance_-_Poe_Dameron_1",
  "/wiki/Kidnapped!",
  "/wiki/Star_Wars:_Poe_Dameron",
  "/wiki/Join_the_Resistance:_Escape_from_Vodran",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Resistance_Reborn",
  "/wiki/A_Eulogy_for_Snap",
  "/wiki/Special:Upload",
  "/wiki/Sarq_22",
  "/wiki/Battle_of_Endor",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/Rapier_Squadron",
  "/wiki/Resistance",
  "/wiki/Stiletto_Squadron",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Corellian_Team_Two",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Lieutenant",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Squadron",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Iolo_Arana",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Military_rank",
  "/wiki/Captain",
  "/wiki/Temmin_Wexley",
  "/wiki/Battle_of_Exegol",
  "/wiki/Reproduction",
  "/wiki/Galactic_Empire",
  "/wiki/Victory_kid",
  "/wiki/Rapier_Two",
  "/wiki/Standard_year",
  "/wiki/Endor",
  "/wiki/Distress_signal",
  "/wiki/Freighter",
  "/wiki/Yissira_Zyde",
  "/wiki/Suraz_4",
  "/wiki/Hyperspace",
  "/wiki/Troop",
  "/wiki/Suraz_engagement",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Shuttle",
  "/wiki/TIE_line",
  "/wiki/Muran",
  "/wiki/Rapier_Four",
  "/wiki/Death",
  "/wiki/Starship",
  "/wiki/T-85_X-wing",
  "/wiki/Rapier_Three",
  "/wiki/Sector",
  "/wiki/Skirmish_in_OR-Kappa-2722",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/Echo_of_Hope",
  "/wiki/Senator",
  "/wiki/Erudo_Ro-Kiintor",
  "/wiki/Yacht",
  "/wiki/Hevurion_Grace",
  "/wiki/Operation:_Sabre_Strike",
  "/wiki/EVA_suit",
  "/wiki/Z-95_Headhunter",
  "/wiki/Uvoss_system",
  "/wiki/Star_system",
  "/wiki/Concussion_missile",
  "/wiki/Escape_pod",
  "/wiki/Engine",
  "/wiki/First_Order_Navy",
  "/wiki/Resistance_pilot",
  "/wiki/Gas_giant",
  "/wiki/Fleet",
  "/wiki/Planet",
  "/wiki/Gravity",
  "/wiki/L%27ulo_L%27ampar",
  "/wiki/Jessika_Pava",
  "/wiki/Hunt_for_Lor_San_Tekka",
  "/wiki/Lor_San_Tekka",
  "/wiki/Luke_Skywalker",
  "/wiki/Mission_to_Ovanis",
  "/wiki/Ovanis",
  "/wiki/Mountain",
  "/wiki/BB-8",
  "/wiki/Cave_of_the_Cr%C3%A8che",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Cr%C3%A8che",
  "/wiki/Homing_beacon",
  "/wiki/Black_One",
  "/wiki/First_Order_landing_platform",
  "/wiki/AAL-1971/9.1_Troop_Transport",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Jetpack",
  "/wiki/TIE/sf_space_superiority_fighter",
  "/wiki/X-wing_starfighter",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/Maxima-A_class_heavy_cruiser",
  "/wiki/Ravenous",
  "/wiki/Astromech_droid",
  "/wiki/Fire",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Unidentified_Cr%C3%A8che_creature",
  "/wiki/Cr%C3%A8che_egg",
  "/wiki/Fuel",
  "/wiki/Cave",
  "/wiki/Mission_to_Megalox_Beta",
  "/wiki/Megalox",
  "/wiki/Prison",
  "/wiki/Megalox_Beta",
  "/wiki/Unidentified_Cr%C3%A8che_elder",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Hutt",
  "/wiki/Prisoner",
  "/wiki/Orbit",
  "/wiki/Megalox_space_station",
  "/wiki/Warden",
  "/wiki/Luta",
  "/wiki/Fortress_of_Grakkus_the_Hutt",
  "/wiki/Droid",
  "/wiki/Crime_lord",
  "/wiki/Kan_Be",
  "/wiki/Toren",
  "/wiki/Isin",
  "/wiki/Fortress",
  "/wiki/Gangster",
  "/wiki/Blaster",
  "/wiki/Gravity_belt",
  "/wiki/Space_station",
  "/wiki/Carrion_Spike",
  "/wiki/Spy",
  "/wiki/Skirmish_on_Pheryon",
  "/wiki/Pheryon",
  "/wiki/Navy",
  "/wiki/Mission_to_Kaddak",
  "/wiki/Kaddak",
  "/wiki/N1-ZX",
  "/wiki/Resistance_spy_droid_network",
  "/wiki/Technician",
  "/wiki/Oddy_Muva",
  "/wiki/C-3PO",
  "/wiki/Marriage",
  "/wiki/Sowa_Chuan",
  "/wiki/Unidentified_desert_planet",
  "/wiki/Battle_over_a_desert_planet",
  "/wiki/First_Order_military",
  "/wiki/Flagship",
  "/wiki/Ranc_Gang",
  "/wiki/Ugly",
  "/wiki/Computer",
  "/wiki/Slavery",
  "/wiki/Heavy_cruiser",
  "/wiki/Desert",
  "/wiki/Malarus",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Funeral_of_L%27ulo_L%27ampar",
  "/wiki/Snap_and_Kar%C3%A9%27s_wedding",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Hosnian_system",
  "/wiki/Starkiller_Base",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/35_ABY",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Ajan_Kloss",
  "/wiki/Sith_Eternal",
  "/wiki/Sith_Eternal_military",
  "/wiki/TIE/dg_starfighter",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Spy_droid",
  "/wiki/Greg_Rucka",
  "/wiki/2015",
  "/wiki/Before_the_Awakening",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Marvel_Comics",
  "/wiki/Charles_Soule",
  "/wiki/Phil_Noto",
  "/wiki/Greg_Grunberg",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_24",
  "/wiki/Poe_and_the_Missing_Ship",
  "/wiki/Poe_Dameron_1",
  "/wiki/Poe_Dameron_2",
  "/wiki/Poe_Dameron_3",
  "/wiki/Poe_Dameron_4",
  "/wiki/Poe_Dameron_5",
  "/wiki/Poe_Dameron_6",
  "/wiki/Poe_Dameron_7",
  "/wiki/Poe_Dameron_8",
  "/wiki/Poe_Dameron_11",
  "/wiki/Poe_Dameron_13",
  "/wiki/Poe_Dameron_14",
  "/wiki/Poe_Dameron_15",
  "/wiki/Poe_Dameron_16",
  "/wiki/Poe_Dameron_17",
  "/wiki/Poe_Dameron_18",
  "/wiki/Poe_Dameron_19",
  "/wiki/Poe_Dameron_20",
  "/wiki/Poe_Dameron_21",
  "/wiki/Poe_Dameron_22",
  "/wiki/Poe_Dameron_23",
  "/wiki/Poe_Dameron_24",
  "/wiki/Poe_Dameron_25",
  "/wiki/Poe_Dameron_Annual_2",
  "/wiki/Poe_Dameron_26",
  "/wiki/Poe_Dameron_27",
  "/wiki/Poe_Dameron_29",
  "/wiki/Poe_Dameron_30",
  "/wiki/Poe_Dameron_31",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Resistance_Conversion_Kit",
  "/wiki/T-70_X-Wing_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_26",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Databank_(website)",
  "/wiki/Poe_Dameron_12",
  "/wiki/Star_Wars:_Poe_Dameron_Book_VII:_The_Awakening",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY"
 ]
}