{
 "name": "Kar Yang",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Hurd's Moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hiitian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "c. 2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Small black hairs"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty hunter"
     ]
    }
   ]
  }
 ],
 "content": "Kar Yang was a Hiitian, considered to be the second-most skilled and feared bounty hunter in the galaxy. He was often accompanied by Lintu, his assistant droid. He came to prominence after the Battle of Endor, having never lost a fight. His hunt for Guri changed all that.\nYang was hired by the Black Sun to capture the Human replica droid Guri. While negotiating with Black Sun representative Azool, Savan, the niece of the deceased Prince Xizor and the new head of the Black Sun, secretly reprogrammed his droid Lintu to spy on him and report back.\nYang first tracked down the droid researcher Massad Thrumble, the most likely person to provide a lead as to Guri's whereabouts. He located the researcher in a cantina on Hurd's Moon. Thrumble was reluctant at first, but Yang persuaded him to talk by dispatching every other living being in the bar. Thrumble sent Yang to the swampy world of Murninkam. There Yang observed from a distance as Guri infiltrated the fortress of Spinda Caveel and retrieved A-OIC, a specialized medical droid. Just before Guri launched, Yang tagged her starship, the Stinger, with a homing device.\nHaving successfully located Guri, he explained to Lintu that he had no intention of returning her to his employer. Guri was much more valuable than the bounty he had been offered. Yang planned to keep Guri for his own purposes. Lintu waited until he believed Yang had gone to sleep, then reported back to Savan via comm. But Yang had grown suspicious of his droid and overheard the conversation. Savan ordered Lintu to dispatch Yang once Guri had been captured. Yang and Lintu tracked the Stinger to Hurd's Moon. After touching down, Yang sent the droid ahead to scout and shot him in the back.\nAt last, Yang came upon his quarry in Thrumble's hidden laboratory deep within Hurd's Moon. Guri had been prepared for a deep neural modification, though Yang forced her up from the operating table at gunpoint. In Yang's brief custody, he forced Guri to tie up Thrumble, and then led her to the lab exit. Guri managed to knock the blaster from Yang's grip, and the two engaged in hand-to-hand combat. Yang was able to recover his blaster from the floor and took a shot at Guri, though only grazed her leg. Once again, Yang had his quarry at gunpoint, though did not fire as he wanted her alive. Guri took advantage of his hesitance and punched him in the chest, tearing his heart out with her bare hand.\nThe droid A-OIC dragged Yang's bloodied carcass away while Thrumble and Guri were forced to recalibrate the medical instruments thanks to Yang's interruption.\nDespite Shadows of the Empire: Evolution touting him as the second-most skilled and feared bounty hunter in the galaxy, Kar Yang was never again featured in a Star Wars story, aside from some fleeting mentions in source material.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Hurd%27s_Moon",
  "/wiki/Hiitian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Shadows_of_the_Empire:_Evolution",
  "/wiki/Lintu",
  "/wiki/Droid/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Guri",
  "/wiki/Black_Sun/Legends",
  "/wiki/Human_replica_droid",
  "/wiki/Azool",
  "/wiki/Savan",
  "/wiki/Xizor/Legends",
  "/wiki/Massad_Thrumble",
  "/wiki/Murninkam",
  "/wiki/Spinda_Caveel",
  "/wiki/A-OIC",
  "/wiki/Stinger",
  "/wiki/Shadows_of_the_Empire:_Evolution_1",
  "/wiki/Shadows_of_the_Empire:_Evolution_2",
  "/wiki/Shadows_of_the_Empire:_Evolution_3",
  "/wiki/Shadows_of_the_Empire:_Evolution_4",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_74",
  "/wiki/The_Official_Star_Wars_Fact_File_130",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/The_Not-So_Magnificent_Seven"
 ]
}