{
 "name": "Kar_Vastor",
 "display_name": "Kar Vastor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Haruun Kal"
     ]
    },
    {
     "name": "Born",
     "values": [
      "43 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Over 2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Upland Liberation Front",
      "Blackhole"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Depa Billaba",
      "Cronal"
     ]
    }
   ]
  }
 ],
 "content": "Kar Vastor was a leader in the Upland Liberation Front on Haruun Kal in the decade before the outbreak of the Clone Wars. He was the lor pelek of the Korunnai, and their military leader during the local Summertime War. Kar and his people sided with the Galactic Republic during the Clone Wars, but his actions were judged as \"crimes against civilization\" and he was ultimately defeated and arrested by Jedi Master Mace Windu.\nYears later, Kar was forced to serve as a host for Imperial warlord Cronal, until he was saved by Jedi Knight Luke Skywalker during the Battle of Mindor.\nBorn a Korun, Kar Vastor's early life seemed ordinary, though he was more in touch with Pelekotan  than most. It was the Summertime War which forever changed Kar's destiny, as well as the destiny of Haruun Kal. At the age of fourteen, Kar Vastor saw his whole family massacred by jups, also known as jungle prospectors. How Kar Vastor escaped is a mystery. The stories among the Korunnai were contradictory, and Kar himself would not discuss it.\nVastor was abandoned in the jungle without weapons, grassers, akk dogs, people, or food and supplies of any kind. For most beings, it was a death sentence. However, Kar survived on his own for more than a standard year.\nIn the jungle, he learned all his impressive Force powers, but lost the ability to form normal speech like most other sentient beings. Mace Windu later suspected that it was the price Kar paid for his survival: he traded Pelekotan power for his humanity.\nIn the jungle, Kar likely discovered the Jedi starship that carried the Korun ancestors to Haruun Kal and used the starship armor to build his weapon of choice: vibroshields. A weapon of Kar's own design, they were shield-shaped vibro-axes. The sonic generators that powered the shields were fully sealed, and therefore were resistant to the metal-eating molds and fungi of the jungle. Also, because the starship armor was a superconductor; that is, it remained the same temperature throughout; not even a lightsaber blade could cut through the shields.\nKar Vastor grew to become a lor pelek; a jungle master shaman, witch doctor, wizard, and demon. In Korun legend, the lor pelek was a person of great power, and great peril. Kar Vastor lived up to his title—he was as unpredictable as the jungle, bringing life or death, a gift or a wound. In some Korun stories, a lor pelek was not a being at all, but was rather Pelekotan incarnate: the avatar of the \"jungle mind.\" Kar Vastor, although still Human, became the avatar of the jungle's darkness.\nDuring the Summertime War, Kar Vastor formed a clan he named the Akk Guard. Kar and the Guards were masters of both unarmed and melee combat, as well as the use of the Force. Without proper training, their usage of the Force was without grace; they relied on natural instincts, their Force powers aggressive and wild.\nThirty-five years before the outbreak of the Clone Wars, Jedi Master Mace Windu visited the Koruns and shared with them tales of the Jedi. Kar Vastor possibly heard those tales, ending with he and the Akk Guards starting to mirror Jedi Knights. When Kar accepted a man as his Akk Guard, the man would build his own shields, in much the same manner as Jedi built their own lightsabers. Beginning with this ritual, the Akk Guards became a dark simulacrum of the Jedi. They relied on instinct while the Jedi relied on training; they used anger and aggression as sources of power, while the Jedi based their power upon serenity and defense; they used their shields as swords, while the Jedi used their swords as shields.\nKar and the Akk Guards used their vibroshields to deflect blaster bolts and projectiles in the same manner as the Jedi. This skill may have also been the result of tales of Jedi training told by Mace Windu.\nVastor's experience in the jungle determined his view on Tan Pel'trokal: Jungle Justice, a penalty devised by Korun culture, to punish crimes deserving death. Vastor sent all his captives in the Summertime War into the jungle without weapons, clothing, or other supplies. Because no captive could survive the jungle to tell the tale, the Balawai believed the Korun always killed their captives, further darkening the war.\nKar was a member of Ghôsh Windu. He believed himself to be its last surviving member before his dỏshalo , Mace Windu, revisited the planet. The Summertime War had slowly killed the whole clan.\nDespite the fact that every Korun could use the Force, and that Kar Vastor with the Akk Guards were nearly untouchable, the Korunnai were slowly losing the war. The Korunnai lived in the jungle, and because the jungle's fungi would eat almost every kind of metal, it made it impossible for the Korunnai to use technological weapons and equipment in the jungle. They fought with slug rifles, while Balawai used blasters. The Summertime War was also a war of extermination. Enemies were killed at first sight, regardless of age and conditions. While the Balawai could hide non-combatants in the city, the Koruns had no place to hide their own. However, as the name hinted, the Summertime War would halt during seasons like autumn and winter, and so the Korunnai still had time to recover.\nWith the outbreak of the Clone Wars, the Balawai sided with the Confederacy of Independent Systems, thus gaining even more supplies and technological advantages: battle droids, vulture droids, De-Orbiting Kinetic Anti-emplacement Weapons , and gunships. Despite Kar's abilities and leadership, the Korun were losing badly, and facing extinction.\nThe arrival of Jedi Master Depa Billaba changed everything. Assigned by the Jedi Council to liberate the system, Depa fought alongside Kar Vastor, his Akk Guards, and the Korunnai. With her mastery of the Force and the seventh lightsaber combat form known as Vaapad, the tide started to change. The Korunnai considered Depa a goddess and their only hope. However with each victory, with each killing, the darkness of the jungle and the terror of warfare began to corrupt and torture Depa. Depa's mastery in Vaapad furthered the corruption as she channeled her inner darkness to be the weapon of light.\nAs a result, the actions of Korun combatants darkened, both in reality and in tales, and the Balawai responded in kind. Working together, Kar and Depa invented the name \"Upland Liberation Front\" to describe their fighting force. This proved to be a successful tactic to confuse the enemy; the Balawai kept trying to figure out the tactics and pattern of the Front's attack, which was always futile because there was no Upland Liberation Front. The Front was merely a name to blame every attack on; the Korun fighting force was just a group of Humans scavenging for supplies and struggling for survival.\nFinally, the Separatists fell back and abandoned the planet to the Balawai themselves. However, they continued to supply them with weapons and equipment. The Korunnai were unable to celebrate as long as the Balawai existed. As a result, Depa remained with the Korunnai and fought with them, neglecting any order from the Council. Determined to teach her Master a lesson of war and its darkness, Depa and Kar set up a terrifying scene to draw Mace Windu to the planet.\nWhen Windu came, Nick Rostu, Chalk, Lesh, and Besh were sent to meet him. However, Mace was captured by Balawai commander Colonel Geptun. Geptun interrogated him, then released him in exchange for three thousand credits. Mace had to, as part of the release deal, try to stop Depa's atrocities against Balawai. Unknown by Mace, Geptun had monitored his lightsaber's frequency so that his satellites would tell him whenever Mace turned on his lightsaber. This meant that the Colonel could track him as he met with the Korunnai.\nMace was saved from an ambush by Nick and his companions, and so joined them to find Depa. They had a brief fight with gunships, one of which Mace destroyed. This unlocked a blood fever in him. Not long after, Lesh died of fever wasps. Chalk and Besh were infected. Nick realized that Kar might be able to save Chalk and Besh. They took a Balawai outpost, put the two in suspended animation, and sent Nick off for Kar. Mace stayed as a guard. When a nearby volcano erupted, Balawai children called for help. Being a Jedi, Mace saved them. More Balawai came, in steamcrawlers. Mace tried to negotiate the release of children and the abandonment of the outpost, but the Balawai were desperate. Just as Mace was near success, Kar and the Akk Guards came.\nThe superhuman skill and strength of the Korun easily killed the Balawai. Kar entered the bunker, and Mace found himself struggling with blood fever. Kar used his Force powers to effectively show Mace his dark side. Then Kar killed a child who had been attempting to kill Chalk and Besh. The Korun took the survivors prisoner.\nHowever, Mace and Nick later freed the prisoners and followed after, reaching a camp. Kar cornered them too late—a gunship had already taken the Balawai to safety. Kar and Mace had a brawl, ending with the Jedi Master falling into unconsciousness.\nMace arrested Depa and got her parole in exchange for her agreement to leave with him. Kar took Mace's lightsaber. This allowed Mace to track Kar through the Force.\nDepa did not meet Mace—she sent Kar. By that time, Geptun had found a Korun base. Kar and Mace joined forces to stop the Balawai. Mace used his natural resources and allies to repel the militia. Kar and Depa hijacked a gunship. Mace, Chalk, and Nick took another. In the skies, the group saved the Halleck by tricking the droid fighters to turn on themselves. Then they broke into the Ministry.\nGeptun demanded surrender. Mace gave it, and Nick found Geptun's signal at the Ministry of Justice; Mace knew that he was at the Washeteria. They went to Washeteria and convinced the colonel to deactivate the Vulture droids. Kar attempted an assassination, but Mace and Nick survived. Chalk, however, was killed soon after taking the Ministry.\nKar and Depa went wild, burning Pelek Baw and slaughtering civilians. Mace, Nick, and Geptun returned to the Ministry to stop Kar and Depa.\nMace called the clones on his aid. Kar and Akk Guards killed many, but Nick proved himself a skilled fighter with a gun by taking out at least three Akk Guards. Mace and Depa dueled, during which Mace was wounded just as Depa returned to the light. Realizing what she had done, she nearly committed suicide before Nick shot her lightsaber out of her hand, and she collapsed into a coma.\nLater, an Akk Guard by the name of Iolu's slashed Nick's stomach, and the young Korun collapsed, leaving Mace and Kar to duel. Geptun was in the control room. Mace gave a warning threat to Kar, but the lor pelek defied him. With a cry of sleep when you're dead, Kar charged Mace.\nMace was able to sidestep the attack, seeing how Kar was strong, young, fast, and could eventually beat him on his best day, and this was one of his worst. Instead, he used the Force to snag one of Iolu's shields that was lodged above Nick's head. He sent it whizzing at Kar, and the weapon sliced right through Kar's, cutting through both wrists and embedding itself in his chest, less than a centimeter short of his heart. Kar Vastor collapsed with surprise on his face, though he survived to be placed in custody.\nVastor was taken to Coruscant, and was held in the Jedi Temple. His wounds were healed and his hands were saved, though he was placed in detention within the Temple. He was later charged with crimes against civilization, a category that had not been invoked since the time of the Great Sith War.\nAt some point after his imprisonment, Vastor became a pawn of Blackhole. As a recipient of Blackhole's meltmassif treatment, he was used as a host body of the warlord to capture Leia Organa from \"wild\" Melters and attack Luke Skywalker. He was freed from Cronal's control when he assisted Skywalker in communicating with the Melters, beings who used the meltmassif for their corporeal forms. Skywalker was then able to destroy the connection Cronal had with the meltmassif.\nAlthough not a friend of the Jedi, he was impressed with and appreciative of Luke Skywalker's assistance. He later assisted Nick Rostu and Aeona Cantor in their hunt for Cronal.\nVastor was an immensely tall, extremely muscular bald man. He had dark skin and needle-sharp teeth; Nick Rostu estimated that Vastor massed twenty kilograms more than Darth Vader.\nBeing left for dead in his youth in the hostile jungles of his homeworld, Vastor survived by drawing upon the darkness in the jungle which fueled his tremendous power. One of the consequences of this was that he lost the ability to speak as normal people did—instead he either growled, grunted, or roared, and used the Force to convey his meaning to other beings in conversations. He displayed exceptional Force ability for having no formal training. Mace Windu himself, after doing battle with Vastor, stated that the latter's raw power in the Force put him on par with Yoda or Anakin Skywalker. He could also use his power in the Force to heal, as he did with Liane Trevval and Besh when they had been bitten by the fever wasp larva.\nVastor also possessed incredible physical strength and lightning fast speed and reflexes for a man of his size, which made him an excellent hand-to-hand combatant. He was trained in the use of vibroshields and bladed weapons, making him a frightening opponent in battle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Haruun_Kal/Legends",
  "/wiki/43_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Korun/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Upland_Liberation_Front",
  "/wiki/Cronal",
  "/wiki/Depa_Billaba/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Nick_Rostu",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Lor_pelek",
  "/wiki/Summertime_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Crime_against_civilization",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Battle_of_Mindor",
  "/wiki/Tan_pel%27trokal",
  "/wiki/The_Force/Legends",
  "/wiki/Jup",
  "/wiki/Grasser",
  "/wiki/Akk_dog/Legends",
  "/wiki/Death/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Vibroshield",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Akk_Guard",
  "/wiki/Balawai",
  "/wiki/Gh%C3%B4sh_Windu",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/De-Orbiting_Kinetic_Anti-emplacement_Weapon",
  "/wiki/Gunship/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Form_VII/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Chalk",
  "/wiki/Lesh",
  "/wiki/Besh/Legends",
  "/wiki/Geptun",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Fever_wasp/Legends",
  "/wiki/Duel_at_Pelek_Baw",
  "/wiki/Halleck",
  "/wiki/Ministry_of_Justice_(Balawai)",
  "/wiki/Highland_Green_Washeteria",
  "/wiki/Iolu",
  "/wiki/Coruscant/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Meltmassif",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Melter",
  "/wiki/Aeona_Cantor",
  "/wiki/Special:EditPage/:Kar_Vastor",
  "/wiki/Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Liane_Trevval",
  "/wiki/Shatterpoint_(novel)",
  "/wiki/Coruscant_Nights_I:_Jedi_Twilight",
  "/wiki/Luke_Skywalker_and_the_Shadows_of_Mindor",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}