{
 "name": "Kara_Safwan",
 "display_name": "Kara Safwan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rang Clan"
     ]
    }
   ]
  }
 ],
 "content": "Kara Safwan was a human female who worked as a spy for the criminal Rang Clan. In 10 BBY, she attended a party on board the First Light, the yacht of Dryden Vos, a crime lord of the Crimson Dawn syndicate which she had been hired to gather intel on. While on board, Vos's concierge Margo blocked her from entering the crime lord's inner circle. After the yacht arrived on the planet Vandor, Safwan drank Vandor ice water with an Imperial officer on the viewing deck.\nKara Safwan was a human female who was hired by the criminal Rang Clan to spy and gather intel on the operations of the Crimson Dawn, a rival criminal syndicate. In 10 BBY, she attended a party on board the First Light, the personal yacht of the Crimson Dawn crime lord Dryden Vos.\nShe was on board when it arrived on the planet Vandor to collect a delivery of stolen coaxium. Safwan blended in well with the other revelers on board; however, Vos's concierge Margo suspected she was up to something and discreetly blocked her attempts to get deeper into the crime lord's inner circle. During a performance by the singers Aurodia Ventafoli and Luleo Primoc, Safwan stood with an Imperial officer on the yacht's viewing deck drinking from a flask of Vandor ice water to keep her head clear. After the performance ended, she and a brightly dressed human man then spoke with another pair of humans before passing by Vos himself after he descended from a raised area of the deck.\nSafwan had fair skin and brown eyes and hair.\nWhile on the yacht, Safwan wore a matching black and gold dress and top. She also had a mid-cochlear recording device in her right ear.\nKara Safwan first appeared in the 2018 film Solo: A Star Wars Story and was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo. Lucasfilm Ltd. employee Kristen Hidalgo confirmed on Twitter that the character was named by Pablo after Saf Davidson, a host of several Star Wars podcasts.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rang_Clan",
  "/wiki/Spy",
  "/wiki/Safwan",
  "/wiki/Kara",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/10_BBY",
  "/wiki/First_Light",
  "/wiki/Yacht",
  "/wiki/Dryden_Vos",
  "/wiki/Crime_lord",
  "/wiki/Crimson_Dawn",
  "/wiki/Margo",
  "/wiki/Planet",
  "/wiki/Vandor",
  "/wiki/Vandor_ice_water",
  "/wiki/Imperial_officer",
  "/wiki/Coaxium",
  "/wiki/Musician",
  "/wiki/Aurodia_Ventafoli",
  "/wiki/Luleo_Primoc",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Starship",
  "/wiki/Clothing",
  "/wiki/Ear",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Kristen_Hidalgo",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lop_%26_Och%C5%8D",
  "/wiki/File:Kara_Safwan_name.png"
 ]
}