{
 "name": "Karagga",
 "display_name": "Karagga",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3639 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue-grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Plum"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Cartel",
      "Hutt Domain"
     ]
    }
   ]
  }
 ],
 "content": "Karagga, known as Karagga the Unyielding, was a Hutt crime lord that lived in the years of the Cold War. The Supreme Mogul of the Cartel, Karagga held a number of titles, such as Supreme Power of Hutta, Unquestioned Ruler of the Hutt Domain, and Paragon of the Hutt species.\nDuring his youth, this young Hutt was noted for being a Cartel boss. In this time, he came into a disagreement with the Exchange crime syndicate that had turned into a turf war. This in turn led to a peace meeting formed to end the contentious conflict. However, Karagga simply wiped out the Exchange cell. That action earned him both wealth and respect in the criminal underworld. His victory led to him earning the unofficial title of Karagga the Unyielding with nothing stopping his rise to power.\nThis led to a period of him ruling as Supreme Mogul of the Hutt Cartel for nearly two centuries by the Cold War era, and was noted to be over 800 years old. Only extreme riches fueled his appetite for the ostentatious and made the Hutt one amongst the galaxy's wealthiest as well as most extravagant beings. From his grandiose palace on Nal Hutta, he ruled his Cartel and was draped in ornamental frocks where he gorged on daily banquets of Hutt delicacies. However, his rise in power and privilege led to a souring of Karagga's temperament. This turned a once approachable crime boss into a despot who became unsatisfied with anything less than perfection.\nDuring the Galactic War the Hutt Cartel suffered 15 incursions from the Dread Masters, Karagga then lead a campaign trying to gain territories to replace the lost ones, putting aside the Hutt neutrality to attack the Republic and Sith Empire alike. As a result of these moves, a strike team was sent to confront him at his palace on Hutta. Refusing to negotiate, Karagga tried to kill the team through his pet rancor Bonethrasher, hired bounty hunters Jarg and Sorno, a trained Kintan crusher named Foreman Crusher, and a special foreman droid the G4-B3 Heavy Fabricator. When the strike team proved to be stronger than he expected, he fought them with a walker-like vehicle. In the end, he proved no match for the team, and was dispatched.\nKaragga spoke to visitors at his palace via a protocol droid known as the Herald of Karagga.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3639_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Hutt_Domain",
  "/wiki/Crime_lord/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Supreme_Mogul",
  "/wiki/Exchange",
  "/wiki/Galaxy/Legends",
  "/wiki/Galactic_War",
  "/wiki/Dread_Masters",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Karagga%27s_Palace",
  "/wiki/Rancor/Legends",
  "/wiki/Bonethrasher",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jarg_(mercenary)",
  "/wiki/Sorno",
  "/wiki/Kintan_crusher",
  "/wiki/Foreman_Crusher",
  "/wiki/G4-B3_Heavy_Fabricator",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Herald_of_Karagga",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Barabbula",
  "/wiki/3840_BBY",
  "/wiki/Toborro",
  "/wiki/3638_BBY"
 ]
}