{
 "name": "Karae_Nalvas",
 "display_name": "Karae Nalvas",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Saren Valek"
     ]
    }
   ]
  }
 ],
 "content": "Karae Nalvas, also known as Boss Nalvas and sometimes known by the pseudonym Fesvk Wefos, was a male Human who was a former Jedi Knight who fell to the dark side and became a rogue Jedi during the waning years of the Galactic Republic. He traveled to the planet Genarius where he became a Dark Jedi and creating a floating fortress, the Conkesta, to threaten the cities on the planet and unleash a war.\nKarae Nalvas began his career as a Padawan studying the light side of the Force under an unidentified Jedi Master in the planet Coruscant. At that time, Nalvas was considered a knowledge-seeking sentient, a skilled diplomat, and a promising scholar.\nIn 46 BBY, Nalvas and his master were sent to an undisclosed place in the Outer Rim Territories to research a disturbance in the Force that had been detected by the Jedi Order. Although the detected ripples had been weak, their source was a planet powerful in the dark side of the Force. When the two Jedi reached the planet, both were tempted by the power of the dark side, with Nalvas embracing it. No longer a Jedi, Nalvas fought, injured and abandoned his master. The master, considering himself also tainted by the evil, contacted the Jedi Council to tell them of the danger he and Nalvas could become, and suggested sectoral quarantine to contain the evil.\nNalvas disappeared for twelve years. During that time all the records of the Jedi Order about Nalvas, including those with his image, were deleted, and nobody alive seemed to remember Nalvas's face. However, his name and history up to this point were relatively well-known among scholars of Jedi lore. Nalvas became a dark side practitioner in the move through the Outer Rim. Although the Jedi Order received reports about this person, they did not relate them to the missing Nalvas.\nIn 34 BBY, Nalvas recruited a Jedi Padawan, Saren Valek, and turned him into his apprentice in the dark side. Valek's master, the Jedi Knight Alec, began tracking Nalvas to bring him to justice. For three years, Nalvas trained Valek in the dark side, with Alec being unable to stop him.\nNalvas wanted to create a mobile fortress with enough firepower to level any of the cloud cities of Genarius, a gas giant in the Cularin system. He had spent the previous years amassing resources, including money, technological blueprints and several high- and low-level employees, most of whom did not know about Nalvas's destructive goals thanks to some cleaver use of Nalvas's Force abilities. What he wanted to achieve by ravaging the Genariusan metropolises is unclear, but Alec has theorized that, if Nalvas should have taken over the main centers of business in the Cularin system, then the chain reaction could end in an open war either in-system or in a wider scale.\nNalvas managed to start building the Conkesta, a mobile city itself with powerful shielding and almost ready for its intended goal. To do so, he used the services of several scientists, including Dr. Shilaea Motacc, an expert in large-scale propulsion systems and planetary propulsion. As Dr. Motacc would have not work for him knowing his intentions, Nalvas pretended to be entrepreneur Fesvk Wefos  from the Usable Resource Location, Recovery, and Development Corporation , which wanted to expand its operations to Genarius, and hired Motacc to develop a new system to propel flying cities. Secretly, Nalvas used Motacc's work in the Conkesta.\nIn 31 BBY, the Conkesta was near completion. To avoid detection, Nalvas hid a skeleton-staffed Conkesta at a very low orbit, near the core of Genarius. Nalvas felt safer doing so, and in fact he did avoid detection.\nBefore Motacc had finished his work for Nalvas, she was abducted during a vacation in the resort city of Rorkee, Genarius. The kidnappers were some partners of Nalvas's in the Conkesta project, who wanted the designs of the fortress for their own ends and were ready to use the force to get them. Pretending to be a worried and sympathetic employer, Nalvas  met with an independent team in Bath Rabbud's, a bistro in the nearby planet Cularin. In a relaxed meeting, \"Wefos\" convinced his new friends to investigate Motacc's disappearance in Rorkee for a price, and at the same time enjoy a paid holiday. He also said he was forced to hire external agents because U.R.L.R.D. did not have these kind of agents on payroll.\nThe team rescued Motacc and took her to Nalvas. Nalvas paid them their money with a bonus and partied with them and Motacc in Bath Rabbud's. Even then, Motacc was unaware of the reasons behind her kidnapping or the identity of her captors. Due to this, Wefos developed a reputation of being a good payer and sending his employees to exotic places.\nHowever, when Motacc returned to her work, she discovered that her colleagues were the guilty part and, scared, she tried to escape. Fortunately, she was contacted by Alec, who had finally found Nalvas and was looking for a way to stop him. Alec helped Motacc and both of them disappeared. Alec also stole the valuable blueprints of the Conkesta, much to Nalvas's chagrin.\nNalvas discovered that Alec had been seen in the so-called City of Masks, Depatar, a place in Genarius known for its strict bureaucracy and for its forced carnival for outsiders: A person without the proper permit or without a mask could be easily expelled from the city. Nalvas also discovered Alec's secret hideout for the stolen blueprints, but Nalvas needed to distract Alec before getting the designs.\nTrying to repeat his previous success, Nalvas decided to hire an independent team  using deception and his Wefos persona. Nalvas hired professional Depataran bureaucrat Fot Ducela to help his team with Depataran permits, bought the permits that the team would surely need, booked a private dining room in Bath Rabbud's and met with his new agents.\nNalvas falsely told his employees that Alec was a courier working for U.R.L.R.D. and that he had mysteriously disappeared with the prototype of a new resource extraction equipment before giving it to company executives. Asking them to recover both the plans and the courier, Nalvas provided the team with some available information and disguises, and sent them to Depatar. Nalvas knew that the team would probably find Alec, and that Alec would tell them about Nalvas's real identity and plans; however, Nalvas used his chance to recover the lost document. Alec offered to go with the team and met with \"Wefos\".\nAlec and the team waited for Nalvas in Bath Rabbud's, but Nalvas had anticipated this move. Nalvas arranged an astromech droid to show a hologram of himself mocking and showing the blueprints, and then the droid would begin the countdown of a bomb. Although the bomb was outwardly similar to a thermal detonator, it only had the power of a fragmentation grenade. However, the end of the countdown would melt the explosive, while any unsuccessful attempt to disarm it would trigger the explosion: Nalvas liked the irony of his enemies causing their own deaths. However, at least Alec survived, and maybe the others too.\nNalvas had staffed the Conkesta with some 6,000 sentients brought from other systems. Those included the Gungan Gus-Gus Tren, who called his employer \"Boss\" Nalvas; it is unclear whether Nalvas was a honorific Gungan Boss or Tren was using the word metaphorically.\nTwo weeks after Nalvas's recovery of the plans, the Conkesta was almost ready to attack other cities, but she was also found by Alec. Motacc and Alec's slicer contacts developed a virus that could affect the propulsion system of the city, theoretically sending the Conkesta to outer space, where it would be destroyed. Unbeknownst to them, the virus really would send the fortress down, to the planet's core. Alec asked the heroes of Cularin to infiltrate the Conkesta and upload the virus in the Conkesta main computer while he was busy elsewhere stopping Nalvas himself. He did not reveal whether Nalvas was in the station itself or not.\nAlthough Alec's raiders succeeded in hacking the Conkesta and doomed her to its end, they were blocked during their escape by Valek and several guards. Nalvas, appearing as a hologram, ordered all of them to kill the intruders, but some of the guards tried to leave the sinking ship. Valek died during this fight and Alec's allies escaped. However, Alec himself was unable to stop Nalvas from leaving the Cularin system asteroid belt and later the Cularin system. The Jedi decided to continue his mission and try to take Nalvas to justice.\nDuring the following years, Nalvas's name rose to prominence in the Cularin system, along with stories about his evil scheme. Jedi scholars studied the reports and rumors about Nalvas. Scholar Dazen Mok, a former Jedi himself, analyzed Nalvas's actions and hypothesized that Genarius held a powerful dark side energy that created the storms and that allowed fellow dark-sider Nalvas to create his fortress near the core; however, this theory was not proved.\nLater, in around 20 BBY, Nalvas became the partner-in-crime of Chevin slaver Phylus Mon. Phylus Mon had been informed of the process to create Sith battlelords, who controlled their armies using the dark side of the Force as a leash. Nalvas wanted to become a Sith battlelord. Secretly, Nalvas schemed to betray Phylus Mon after that.\nFollowing Phylus Mon's plan, Nalvas and other prospective Battlelords traveled to the Almas Sith fortress, where the ritual would be performed. They invaded the fortress, killing four Jedi and kidnapping two others for the ritual. During the ritual, a pendant with an orange gemstone was placed in Nalvas's neck. However, probably due to the interference of the Darkstaff, a damaged Sith artifact, the ritual failed: Instead of transforming them in Battlelords, Phylus Mon simply uprooted the Force essences of the candidates, which would be then stored in a crystal. Nalvas's and the others' bodies were still alive, but unable to move, as their minds and souls were not there. Phylus Mon left the fortress with the crystal, but without the empty bodies. The Darkstaff would then drain the Force essences from Phylus Mon's secret headquarters.\nThe bodies were found by a Jedi search team and taken to the Almas Academy. There, librarian Oden Malksch, who recognized Nalvas, attempted to analyze the amulet. When trying to take them, it cracked and suddenly Malksch's Force essence was forced in Nalvas's body. Malksch could feel that Nalvas's essence was trapped and that the body needed to reach it. The body felt where the essence was, so Malksch could guide a rescue team there.\nIt is unclear whether Nalvas's body survived the rescue mission or not.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Saren_Valek",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Genarius",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Fortress/Legends",
  "/wiki/Conkesta",
  "/wiki/City/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/46_BBY/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Disturbance_in_the_Force/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/34_BBY/Legends",
  "/wiki/Alec_(Jedi)",
  "/wiki/Gas_giant/Legends",
  "/wiki/Cularin_system",
  "/wiki/The_Force/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Shilaea_Motacc",
  "/wiki/Usable_Resource_Location,_Recovery,_and_Development_Corporation",
  "/wiki/31_BBY/Legends",
  "/wiki/Rorkee",
  "/wiki/Bath_Rabbud%27s",
  "/wiki/Cularin/Legends",
  "/wiki/Depatar",
  "/wiki/Fot_Ducela",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Fragmentation_grenade/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gus-Gus_Tren",
  "/wiki/Boss/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Hologram/Legends",
  "/wiki/Cularin_system_asteroid_belt",
  "/wiki/Dazen_Mok",
  "/wiki/20_BBY/Legends",
  "/wiki/Chevin/Legends",
  "/wiki/Phylus_Mon",
  "/wiki/Sith_battlelord",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Darkstaff",
  "/wiki/Almas_Academy",
  "/wiki/Oden_Malksch",
  "/wiki/Head_in_the_Clouds",
  "/wiki/Clouded_Paths",
  "/wiki/Into_the_Storm_Clouds",
  "/wiki/Blown_Away",
  "/wiki/The_Kaluthin_Are_Always_Greener",
  "/wiki/Coruscani_Dawn",
  "/wiki/In_the_Name_of_the_Maker",
  "/wiki/A_Mon_Alone",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Wizards.com",
  "/wiki/A_Changing_Galaxy",
  "/wiki/Tales_of_Nub_Saar",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Night%27s_Homecoming"
 ]
}