{
 "name": "Karbin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Vrogas Vas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown mottle"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic body"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cylo Directive"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Cylo"
     ]
    }
   ]
  }
 ],
 "content": "Karbin was a male Mon Calamari who served as a commander at the time the Clone Wars. Towards the end of the conflict, his starship was damaged, causing him considerable and untreatable injuries. After the incident, Karbin spent the next eighteen years on life support, the final two of which he spent being enhanced with a cybernetic body inspired by that of the late General Grievous by Doctor Cylo and trained to replace Darth Vader, Darth Sidious' Sith apprentice.\nCommander Karbin fought in the Clone Wars until his ship was lost towards the end of the conflict, which resulted in him receiving considerable injuries that were considered to be untreatable. He spent the next eighteen years on life support in a medical center, and during the final two of which he was given a cybernetic body inspired by that of the late General Grievous by Doctor Cylo.\nHis cybernetic body had two arms which could split to reveal another pair, giving him four arms, thus Commander Karbin could wield up to 4 lightsabers at once, just as his predecessor General Grievous did.\nShortly after the Battle of Yavin, the Sith Lord Darth Vader discovered Cylo's research base and met up with both the latter and his own potential \"replacements\": several cybernetically-augmented candidates among whom Karbin was counted. Before he could strike down Cylo, Vader was interrupted by the intervention of his Master, Sidious. With the Emperor's permission, the Doctor unleashed his creations upon both former's Sith apprentice and one another to demonstrate their abilities. After having seen enough of their display and having been introduced to the background of each contestant, including Karbin, Sidious bid Cylo to have the battle cease. The Emperor then informed them all until he would make his mind on whom would stand by his side, all of the assembled warriors would play a part in overseeing the Galactic Empire's efforts against the Rebellion.\nNot long after, Grand General Cassio Tagge dispatched Commander Karbin to track down the Rebel pilot who had destroyed the Death Star. While Lord Vader was assigned another mission, he was personally pursuing the same target for his own reason: the young man was in fact his son, Jedi trainee Luke Skywalker. He learned that the latter was on the planet Vrogas Vas. However, Karbin planned an ambush to eliminate Vader.\nThe Sith Lord crashed on Vrogas Vas and fought the insurgents there. In the middle of the battle, the Rebel leader Leia Organa sent a squadron of bombers to eliminate Darth Vader, however they were shot down by Karbin's forces as he landed on the planet. While the Imperial and Rebel soldiery clashed, the commander personally engaged the Sith Lord in a duel, believing that with four lightsabers against his rival's one, he would be victorious. Using the Force, Vader got the upper hand on Karbin and severed one of his arms. Eventually, the cyborg lured the Mon Calamari onto a natural bridge made of rock and had his minion Doctor Aphra crash her ship, the Ark Angel, into him. The commander barely survived the impact, and was executed shortly after by the Sith Lord. In his last moments of life, Karbin realized that Vader had a personal reason for pursuing Luke, but would never know what it was.\nFollowing their confrontation, Vader hauled the upper half of Karbin's body into Sidious' office at the Imperial Palace, mockingly answering the Emperor's question as to the commander's whereabouts.\nKarbin's cybernetic body was modeled after the infamous Kaleesh warlord General Grievous, with four arms, two legs, and a silver exoskeleton covering the torso. However, unlike his predecessor, a jetpack was installed in the back. During the Clone Wars, Karbin had earned experience as a commander. Karbin expressed his outrage and stated since that he had more experience in campaigning, he should have been given this task to eliminate the Plasma Devils instead. He was convinced that Vader could not defeat him.\nWith his arms split into two, wielding four lightsabers  at once, he represented the same threat as Grievous, whose cybernetic form served as the model for his improvements.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/0_ABY",
  "/wiki/Vrogas_Vas",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cyborg",
  "/wiki/Cylo_Directive",
  "/wiki/Cylo",
  "/wiki/Commander",
  "/wiki/Clone_Wars",
  "/wiki/Starship",
  "/wiki/Standard_year",
  "/wiki/Life_support",
  "/wiki/Death",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Doctor",
  "/wiki/Anakin_Skywalker",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_apprentice",
  "/wiki/Medcenter",
  "/wiki/Cybernetics",
  "/wiki/Battle_of_Yavin",
  "/wiki/Sith_Lord",
  "/wiki/Cylo%27s_research_base",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Grand_General",
  "/wiki/Cassio_Tagge",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Jedi_training",
  "/wiki/Luke_Skywalker",
  "/wiki/Battle_of_Vrogas_Vas",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Amber_Wing",
  "/wiki/Lightsaber",
  "/wiki/The_Force",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Ark_Angel_II",
  "/wiki/Imperial_Palace",
  "/wiki/Kaleesh",
  "/wiki/Warlord",
  "/wiki/Limb",
  "/wiki/Exoskeleton",
  "/wiki/Jetpack",
  "/wiki/Plasma_Devils",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Karbin",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Darth_Vader_(2015)_4",
  "/wiki/Darth_Vader_(2015)_5",
  "/wiki/Darth_Vader_(2015)_6",
  "/wiki/Darth_Vader_(2015)_7",
  "/wiki/Darth_Vader_(2015)_8",
  "/wiki/Darth_Vader_(2015)_10",
  "/wiki/Darth_Vader_(2015)_12",
  "/wiki/Vader_Down_1",
  "/wiki/Darth_Vader_(2015)_14",
  "/wiki/Star_Wars_(2015)_14",
  "/wiki/Darth_Vader_(2015)_15",
  "/wiki/Darth_Vader_(2015)_16",
  "/wiki/Darth_Vader_(2015)_20",
  "/wiki/Darth_Vader_(2015)_21",
  "/wiki/Darth_Vader_(2015)_22",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_12",
  "/wiki/Starfighter_Aces",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith"
 ]
}