{
 "name": "Karis Nemik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 BBY",
      "Frezno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aldhani rebel infiltration team"
     ]
    }
   ]
  }
 ],
 "content": "Karis Nemik was a human male freedom fighter who served as part of a team assigned to steal the quarterly payroll of the Galactic Empire's base on Aldhani. At the time of the mission, the young Nemik was a passionate and idealistic supporter of anti-Imperial causes and was in the stages of drafting a manifesto detailing his thoughts on the Empire and its rampant oppression of the galaxy. As a member of the Aldhani infiltration team under Vel Sartha's command, Nemik, a talented astro-navigator, aided in the planning of the robbery and calculated the group's escape trajectory.\nUnlike the rest of the Aldhani team, Nemik welcomed the addition of a new recruit, \"Clem,\" the alias of Cassian Andor, just days before the infiltration. Though the mission was successful at first, the group was discovered while stealing the payroll and engaged in a shootout. Nemik survived the firefight alongside Sartha, Andor, and Arvel Skeen, but he was severely injured when he was crushed by a payload of credits during the escape through the Eye of Aldhani. Sartha brought Nemik to a doctor on Frezno sympathetic to the cause, Quadpaw, but Nemik's injuries were too great, and he died on the operating table after requesting that his manifesto be given to Andor.\nKaris Nemik was a male human who was a part of a team of rebels commanded by Vel Sartha. He joined Sartha, Arvel Skeen, Cinta Kaz, and Taramyn Barcona on the planet Aldhani as part of an operation to rob an Imperial garrison there, hoping to steal the payroll for the entire sector that was located there. When Sartha left camp and returned with a new team member, introduced as \"Clem,\" the rest of the team was displeased by having to welcome a new face into the fold only days before they intended to go about their plan. Nemik however was more open and welcomed Clem to the team.\nDuring the Mission on Aldhani, Nemik was severely injured after being crushed by a payload of credits. Andor, Skeen, and Sartha took him to the planet Frezno where he was operated on by the four-limbed Dr. Quadpaw. Despite Quadpaw's attempts, Nemik died on the operating table. One of his final wishes was to give his manifesto to Andor, who took it as he fled, leaving the team.\nKaris Nemik was a kindly individual who was more receptive of Andor joining the team than the rest of his comrades, whose reactions ranged from discontentment to outrage. Nemik was eager to help Sartha when she explained the plan to their new recruit. He had a tendency for carelessness, falling asleep on watch on at least one occasion.\nNemik had light skin, brown hair, and blue eyes. He wore a brown coat and red hat.\nKaris Nemik first appeared in \"Aldhani,\" the fourth episode of Andor. He was portrayed by Alex Lawther.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Karis_(disambiguation)",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/5_BBY",
  "/wiki/Frezno",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Galactic_Empire",
  "/wiki/Aldhani_dam",
  "/wiki/Aldhani",
  "/wiki/Nemik%27s_manifesto",
  "/wiki/The_galaxy",
  "/wiki/Vel_Sartha",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Arvel_Skeen",
  "/wiki/Eye_of_Aldhani",
  "/wiki/Quadpaw",
  "/wiki/Death",
  "/wiki/Cinta_Kaz",
  "/wiki/Taramyn_Barcona",
  "/wiki/Planet",
  "/wiki/Aldhani_Garrison",
  "/wiki/Credit",
  "/wiki/Limb",
  "/wiki/Doctor",
  "/wiki/Aldhani_(episode)",
  "/wiki/Alex_Lawther",
  "/wiki/Category:Images_of_Karis_Nemik",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Announcement",
  "/wiki/Star_Wars",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Kassa_(episode)"
 ]
}