{
 "name": "Karn_Valanti",
 "display_name": "Karn Valanti",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Remnant",
      "Darkmeld"
     ]
    }
   ]
  }
 ],
 "content": "Karn Valanti was a Human male who served as a double for Imperial Remnant Head of State Jagged Fel. In 43 ABY, he traveled with Fel to the Unification Summit on the planet Coruscant. During one of Fel's missions with Darkmeld—a secret pro-Jedi organization—Valanti covered for the Head of State at the Imperial Embassy so he would not be missed. Later, Valanti dined with Lina Zev—a double of Jedi Knight Jaina Solo—at the restaurant Indigo Tower in order to draw journalist Javis Tyrr away from Fel and Solo. After Fel and Solo were married in 44 ABY, Valanti and Zev again posed as the two on the planet Hapes.\nKarn Valanti was a male Human who worked for the Imperial Remnant government around 43 ABY. He often served as a double for the Imperial Head of State, Jagged Fel. In 43.5 ABY, Valanti accompanied Fel as part of the Imperial Remnant delegation to the Unification Summit on the galactic capital of Coruscant. During the Summit, Fel joined Darkmeld, a secret organization created by Jedi Knight Jaina Solo to counter Galactic Federation of Free Alliances Chief of State Natasi Daala's anti-Jedi policies. During one of Darkmeld's missions, in which they captured the psychotic Jedi Knight Seff Hellin, Valanti took up Fel's place at the Imperial Embassy, so the Head of State would not be missed.\nShortly after, Valanti officially joined Darkmeld, taking on the codename of \"Carved.\" Meanwhile, reporters and journalists had begun following Fel and Solo—who were in a relationship—wherever they went, making it difficult for the two to have an evening alone together. During a mission deemed Operation Caranak, Valanti partnered up with a double of Solo, Lina Zev, and the two dined together at the restaurant Indigo Tower to throw off anyone who might be following Fel and Solo. One such journalist, Javis Tyrr, fell for the ploy and dined at the restaurant, hoping to raise the ratings of his show by exposing information about Fel and Solo's relationship. He eventually discovered that Valanti and Zev were simply doubles, but by that time Fel and Solo were on their way to an inn halfway around the planet, free to dine alone. Later, in 44 ABY, Valanti and Zev again masqueraded as the two on the planet Hapes, making occasional public appearances while the real Fel and Solo—who had recently been married—embarked on a secret trip to the planet Sakuub.\nAs Jagged Fel's double, Karn Valanti was very similar in appearance to the Imperial Remnant Head of State, with black hair, green eyes, and light skin. Valanti also studied Fel's movements, and was able to imitate them perfectly. His voice, however, was somewhat deeper and more nasal than Fel's.\nKarn Valanti first appeared in author Christie Golden's 2009 debut Star Wars novel, Fate of the Jedi: Omen, the second novel in the Fate of the Jedi series. Valanti had previously been alluded to in the first novel of the series, Aaron Allston's Fate of the Jedi: Outcast. Valanti was later mentioned in a short story by Golden, Getaway, released in issue 134 of Star Wars Insider magazine in 2012. In the story, Valanti's surname was misspelled \"Valenti.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Darkmeld",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Head_of_State/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/43_ABY",
  "/wiki/Unification_Summit",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Raid_on_the_Armand_Isard_Correctional_Facility",
  "/wiki/Jedi/Legends",
  "/wiki/Lina_Zev",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Indigo_Tower",
  "/wiki/Journalist/Legends",
  "/wiki/Javis_Tyrr",
  "/wiki/Wedding_of_Jagged_Fel_and_Jaina_Solo",
  "/wiki/44_ABY",
  "/wiki/Hapes/Legends",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Anti-Jedi_sentiment/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Seff_Hellin",
  "/wiki/Caranak/Legends",
  "/wiki/Javis_Tyrr_Presents:_The_Jedi_Among_Us",
  "/wiki/Skirmish_on_Sakuub",
  "/wiki/Sakuub",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Christie_Golden",
  "/wiki/2009",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Aaron_Allston",
  "/wiki/Getaway",
  "/wiki/Star_Wars_Insider_134",
  "/wiki/Star_Wars_Insider",
  "/wiki/2012",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Star_Wars_Insider:_The_Fiction_Collection_Volume_1"
 ]
}