{
 "name": "Karrek Flim",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corporate Sector Authority"
     ]
    }
   ]
  }
 ],
 "content": "Karrek Flim was a Viceprex of the Corporate Sector Authority.\nDuring the Galactic Civil War, Karrek Flim operated on Corellia, primarily from Vreni Island. He was both romantically and professionally linked with Didina Lippinoss, whom he employed to commit various criminal activities.\nAt some point between 1.5 ABY and 3 ABY, Flim was implicated in the leveling of several old-growth forests in the Corellian system. Didina Lippinoss hired a wandering spacer to recover the records implicating Flim. Around the same time, Shalera the Hutt took an interest in Flim, and hired Crev Bombaasa to gather incriminating evidence against him by having Lippinoss followed by Bothan informant Sli'woon Biul. Bombaasa planned to release details of Lippinoss's criminal activities committed on Flim's behalf if Flim did not comply with Shalera's demands. Bombaasa further attempted to blackmail Lippinoss into funneling classified CSA data from Flim's hands to Bombaasa's, but she did not cooperate.\nAround the same time, one of his underling's tried to damage Flim's reputation by hiring a data slicer to alter shipping documents to make Flim seem incompetent and corrupt. When Vinya Maysor, who worked for Flim, learned of this attempt, she hired a slicer herself to alter records that would make the underling look like a fool instead.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Viceprex/Legends",
  "/wiki/Flim",
  "/wiki/Con_artist/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Vreni_Island",
  "/wiki/Didina_Lippinoss",
  "/wiki/1_ABY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Corellian_system",
  "/wiki/Spacer/Legends",
  "/wiki/Shalera",
  "/wiki/Hutt/Legends",
  "/wiki/Crev_Bombaasa/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Sli%27woon_Biul",
  "/wiki/Slicer/Legends",
  "/wiki/Vinya_Maysor"
 ]
}