{
 "name": "Kasarax",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dellalt"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Swimming People of Dellalt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Kasarax was a male member of the sauropteroid Swimming People of Dellalt, who served as a fearsome example of his species with fangs longer than a Human forearm. By 2 BBY, the hot-headed and wild Kasarax was known as the \"Top Bull\" of a pack of Swimmers on his homeworld, and ran an operation offering rides across his lake to land-dwelling sentients on his back for a hefty fee: 40 drift for each passenger.\nKasarax's racket employed a large shore gang that kept competitors out of the market. Kasarax had wrested the title of Top Bull away from his uncle Shazeen, who became a strenuous opponent of Kasarax's dominance. That rivalry came to a head with the arrival of Corellian smuggler Han Solo and his crew at Kasarax's lake: when Solo chose to cross the lake on Shazeen's back, it led to a battle between the two Swimmers' factions. Kasarax attempted to challenge Shazeen directly during the fighting, only for the weathered old Swimmer to outsmart and defeat Kasarax, forcing the Top Bull to submit. The defeat led to the downfall of Kasarax's racket, and the dissolution of his shore gang.\nKasarax first appeared in Han Solo and the Lost Legacy, a novel written by Brian Daley and released in 1980.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dellalt/Legends",
  "/wiki/Swimming_People_of_Dellalt",
  "/wiki/Gender/Legends",
  "/wiki/Species/Legends",
  "/wiki/Human/Legends",
  "/wiki/Limb/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Water/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Shazeen",
  "/wiki/Corellian/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Han_Solo_and_the_Lost_Legacy",
  "/wiki/Brian_Daley",
  "/wiki/1980",
  "/wiki/A_Guide_to_the_Star_Wars_Universe",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}