{
 "name": "Kasan Moor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "128th TIE Interceptor Squadron",
      "128th TIE Interceptor Squadron",
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Rogue Flight",
      "Red Squadron",
      "Rogue Flight",
      "Rogue Flight",
      "New Republic",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Kasan Moor was an Imperial TIE interceptor pilot and flew as the lieutenant of the elite 128th TIE Interceptor Squadron. Following the destruction of her homeworld, Alderaan, by the Empire's Death Star, Moor grew something of a hatred for the Empire and would defect to the Rebel Alliance during the Alliance's liberation of Gerrard V.\nMoor's knowledge of Imperial installations and her exceptional piloting skills were reason for her induction into Rogue Flight, an Alliance starfighter unit led by Lieutenant Commander Luke Skywalker. Flying under the callsign Rogue Seven, Moor led the Alliance through a string of several victorious hit and run operations against various Imperial bases. Following her assistance in bringing down Moff Kohl Seerdon, Moor retired from being an active member of Rogue Flight to be an advisor to Mon Mothma, Chief of the Rebel Alliance. She would once more fly with the Rogues during the Battle of Calamari years later.\nAs a pilot for the Empire, Moor rose to the rank of lieutenant and, after proving her prowess, was given command of the 128th TIE Interceptor Squadron, which Rogue Squadron member Wes Janson later referred to as \"the best of the best.\" One of her known activities with the group during her time with the Empire was to find potential candidates for Imperial takeover on the gas giant Taloraan. Moor and the 128th were so well regarded that both she and the squadron were mentioned as an example of what the best pilots and machines can do in the official Imperial Handbook: A Commander's Guide.\nHer views on the Empire changed following the destruction of her home planet, Alderaan, by the first Death Star. After she was assigned to put down a rebel uprising on the planet Gerrard V, Kasan's TIE Interceptor's controls were damaged by repeated ion cannon blasts from Gold Squadron member Crix Madine. When Madine forced Moor to surrender herself, Moor admitted her quarrels with the ideals of the Empire, and offered defection to the Alliance.\nKasan was taken to Rebel service during the Liberation of Gerrard V by one of Crix Madine's Y-wings. Moor donated her TIE interceptor to the Alliance Fleet, and offered her knowledge of Imperial installations to Rogue Flight, led by Lieutenant Commander Luke Skywalker. Due to her knowledge and prowess as a starfighter pilot, Moor was inducted into the group as Rogue Seven. Her knowledge was used to lead a raid on an Imperial storage facility on the Jade Moon. Rogue pilot Wedge Antilles did not trust Moor, but Moor continued to prove her allegiance by assisting the Rogues in attacks on Balmorra and Kile II.\nMoor took part in the rescue of Antilles from the Imperial prisons on Kessel following his capture on Kile II. With the Rogues again at full strength, Moor assisted in attacks on Taloraan and Fest, raids which were aimed at reducing the resources of Imperial Moff Kohl Seerdon, who was amassing his forces for a massive attack on the Alliance's bacta supply on the jungle world Thyferra. She confronted Seerdon directly during Seerdon's retaliatory attack on Chandrila, homeworld of one of the Alliance's founders, Mon Mothma. Seerdon insisted that her defection to the Rebellion would be her undoing, and was a waste of her prowess. While Moor was intent on pursuing Seerdon, Luke Skywalker persuaded her otherwise.\nMoor's knowledge led to another raid on Imperial territory, this time on the Capacitor on the volcanic planet of Sullust. Seerdon had used this raid to his advantage, and used the time that the Rebellion was focused on Sullust to achieve his goal of seizing the Alliance's supply of bacta on Thyferra. Moor took part in the battle to reclaim the bacta. During the battle, her X-wing starfighter was shot down by Imperial forces, but she managed to survive the crash-landing. Years later, Moor flew with the Rogues during the Battle of Calamari.\nKasan Moor was voiced by Olivia Hussey in Star Wars: Rogue Squadron. She is heard only through radio transmissions with her fellow pilots, heard over exterior shots of the various craft she pilots in the game itself. Moor is seen in a still photo in the character biographies section of the Nintendo 64 version of the game  and in the Official Nintendo Player's Guide of the game. The model seen in the photo is not Olivia Hussey.\nAccording to game designer and writer Ryan Kaufman, Kasan Moor was named after the radio station KSAN.\nHe jokingly described Moor as being thrown into the \"La Brea Tar Pits\" of secondary videogame characters, as she was created solely for one video game and has barely appeared in any source material since. Kaufman offered insight into what Moor's life was like between the Attack on Thyferra and the Battle of Calamari, and suggested that her participation in the latter battle was a personal favor for Wedge Antilles, with no New Republic records recording her involvement.\nDespite showing up with Rogue Squadron in Forces of Corruption, there are no female vocals as part of that hero unit—her audio consists of Dak Ralter's lines dubbed from The Empire Strikes Back.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/128th_TIE_Interceptor_Squadron",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Red_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Defection",
  "/wiki/Liberation_of_Gerrard_V",
  "/wiki/Gerrard_V",
  "/wiki/Starfighter/Legends",
  "/wiki/Lieutenant_Commander/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Rogue_Seven/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kohl_Seerdon",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Battle_of_Calamari",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Taloraan/Legends",
  "/wiki/Imperial_Handbook:_A_Commander%27s_Guide",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Gold_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/Crix_Madine/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Battle_of_the_Jade_Moon",
  "/wiki/Jade_Moon",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Raid_on_Balmorra",
  "/wiki/Assault_on_Kile_II",
  "/wiki/Rescue_on_Kessel",
  "/wiki/Kessel/Legends",
  "/wiki/Fest/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Thyferra/Legends",
  "/wiki/Chandrila/Legends",
  "/wiki/Raid_on_Sullust",
  "/wiki/Capacitor_(Sullust)",
  "/wiki/Sullust/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Olivia_Hussey",
  "/wiki/Star_Wars:_Rogue_Squadron_(video_game)",
  "/wiki/Nintendo_64",
  "/wiki/Star_Wars:_Rogue_Squadron:_The_Official_Nintendo_Player%27s_Guide",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Attack_on_Thyferra",
  "/wiki/Dac",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption",
  "/wiki/Dak_Ralter/Legends",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_PocketModel_TCG",
  "/wiki/Scum_%26_Villainy",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_21",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Imperial_Handbook:_A_Commander%27s_Guide",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com"
 ]
}