{
 "name": "Kashina_Furt",
 "display_name": "Kashina Furt",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pa'lowick"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "Kashina Furt was a Male Pa'lowick who lived on the planet Lowick, the homeworld of his species. At some point prior to 19 ABY, the Hutt Parella Jiramma Baco traveled to Lowick on an expedition to hunt the Gorach, a legendary being that he believed to live on the world, and he hired Furt to act as his guide. As the hunt commenced, Parella sent out some droid drones to carpet-bomb the jungle region in which he suspected that the Gorach lived, which forced the creature to reveal itself. Furt whimpered at the sight of the beast and the pair set off in pursuit of the creature, although Furt struggled to keep up with the Hutt's pace. The hunters eventually located the Gorach's lair and Parella tossed Furt inside, to test whether the hideaway was safe to enter, which caused him to pass out. Parella continued the hunt without him, and soon afterward he slew the Gorach. When Furt came to, he found the Gorach's home to be filled with high-quality works of art and he realized that the being had been a skilled artist. He made his way back to Parella's ship and told him of his discovery, and he was distressed after he informed him that he had killed the artist.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Pa%27lowick/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Lowick/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Species/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Parella_Jiramma_Baco",
  "/wiki/Gorach",
  "/wiki/Droid/Legends",
  "/wiki/Artist/Legends",
  "/wiki/Star_Wars_Insider",
  "/wiki/Hunting_the_Gorach",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}