{
 "name": "Kasif",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Outer Rim Expedition and Supply"
     ]
    }
   ]
  }
 ],
 "content": "Kasif was a Trandoshan male hunter and merchant who operated in the town of Black Spire Outpost on the planet Batuu. He ran the company known as Outer Rim Expedition and Supply, selling goods that included starships and weaponry.\nDuring the war between the First Order and the Resistance, a supply cart operated by Kasif was visited by the Resistance spy Vi Moradi, who the Trandoshan attempted to scam until threatened by Black Spire Station proprietor Salju. Kasif also sold out the pirate Hondo Ohnaka to the mercenary Bazine Netal, who visited Batuu in search of Ohnaka. After the First Order occupied Batuu, Kasif saw an increase in sales and enjoyed the extra profit regardless of the reason behind it.\nIn 34 ABY, Kasif worked as a merchant within Black Spire Outpost, a settlement located on the Outer Rim planet Batuu. He was in charge of the business Outer Rim Expedition and Supply and additionally ran a supply cart within the town, selling goods to inhabitants and visitors. Kasif was also a hunter, and at some point acquired a taxidermic wampa from the planet Hoth. He gifted the wampa to a friend of his, the Ithorian collector Dok-Ondar, who kept it in his store, Dok-Ondar's Den of Antiquities.\nDuring the war between the First Order and the Resistance, the Resistance spy Vi Moradi was tasked by General Leia Organa with finding a new base of operations; she eventually chose Batuu, but her starship crashed upon arrival, and her belongings and supplies were stolen by thugs working for the local crime boss, Oga Garra. Salju, the proprietor of Black Spire Station, set out to help Moradi acquire new supplies, visiting Kasif's supply cart to buy sleeping bags. Kasif attempted to deceive Moradi into paying a high price for what he claimed was the latest innovation in sleeping bags—which, in reality, were used and lightly ragged—but Salju interrupted the merchant, threatening to raise Kasif's fuel prices at Black Spire Station. Flustered by the threat, Kasif brought out the sleeping bags, revealing their true condition and swearing that nobody had died in them. Moradi bought two sleeping bags before she and Salju departed.\nWhen the mercenary Bazine Netal visited Black Spire Outpost in search of Hondo Ohnaka, pirate and owner of Ohnaka Transport Solutions, she encountered Kasif in the middle of running his company. Without question, Kasif informed Netal of Ohnaka's location in exchange for credits.\nAs the war between the First Order and the Resistance continued, First Order presence on Batuu increased. With the raised First Order occupation, Kasif saw a surge in sales, and was pleased by the increase in profit that he gained. At some point during the occupation, he spoke with fellow merchant Kamka Lira, who lamented at having trouble with importing goods due to the First Order. Kasif did not share Lira's complaints about the First Order's presence and instead bragged about his increased sales, prompting Lira to accuse him of profiting from war.\nAt some point during the occupation, Kasif was not present at his establishment. After learning from a visitor to Batuu that a Z-6 jetpack was available at Outer Rim Expedition and Supply, the scoundrel Pride Aully planned to contact Kasif about collecting it.\nA Trandoshan male, Kasif was both scruffy and arrogant, attempting to lie to Vi Moradi about the merchandise that he sold. When confronted, however, Kasif became flustered, revealing that his merchandise was worth less than he had claimed.\nKasif was more than willing to sell out Hondo Ohnaka, a fellow businessman at Black Spire Outpost, in exchange for credits, without asking why Netal was searching for the pirate. He also enjoyed the increased business and profit that the war between the First Order and the Resistance brought him, boasting about his situation when Lira expressed concern over the effect the occupation was having on imports.\nKasif operated a supply cart in Black Spire Outpost, selling items that included sleeping bags. He also sold starships and blasters, a trade that increased with the First Order occupation.\nKasif was created for the backstory of the Dok-Ondar's Den of Antiquities store at the Star Wars: Galaxy's Edge themed land, which opened to guests at Disneyland Park and Disney's Hollywood Studios Park in 2019. He appeared, and was named, in Star Wars: Datapad, the mobile application companion to Galaxy's Edge that launched alongside the land. In Star Wars: Datapad, his conversation with Kamka Lira is one of the transmissions that Datapad users can listen in on, though the icon used to depict Kasif is a featureless placeholder silhouette. The 2020 reference book Star Wars: Galaxy's Edge: Traveler's Guide to Batuu identified Kasif as the gifter of the taxidermic wampa that can be seen in Dok-Ondar's store.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Outer_Rim_Expedition_and_Supply",
  "/wiki/Hunting",
  "/wiki/Merchant",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Starship",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Vi_Moradi",
  "/wiki/Black_Spire_Station",
  "/wiki/Salju",
  "/wiki/Pirate",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Mercenary",
  "/wiki/Bazine_Netal",
  "/wiki/34_ABY",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Wampa",
  "/wiki/Hoth",
  "/wiki/Ithorian",
  "/wiki/Collector",
  "/wiki/Dok-Ondar",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Thief",
  "/wiki/Crime_lord",
  "/wiki/Oga_Garra",
  "/wiki/Sleeping_bag",
  "/wiki/Fuel",
  "/wiki/Death",
  "/wiki/Ohnaka_Transport_Solutions",
  "/wiki/Credit",
  "/wiki/Kamka_Lira",
  "/wiki/Z-6_jetpack",
  "/wiki/Pride_Aully",
  "/wiki/Blaster",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/2019",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/2020",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/Pirate%27s_Price",
  "/wiki/Pirate%27s_Price_(audiobook)",
  "/wiki/File:LifeInTheOutpost4-GEDatapad.jpg",
  "/wiki/File:PrideAullyMission-GEDatapad.jpg",
  "/wiki/File:PrideAullyConv-GEDatapad.png",
  "/wiki/File:PrideAullyConv2-GEDatapad.jpg",
  "/wiki/File:PrideAullyConv3-GEDatapad.jpg",
  "/wiki/File:PrideAullyComplete-GEDatapad.jpg",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Battle_of_Batuu",
  "/wiki/Star_Wars:_Rise_of_the_Resistance",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}