{
 "name": "Kaskutal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Antar 4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Antarian Rangers"
     ]
    }
   ]
  }
 ],
 "content": "Kaskutal was a male Gotal who lived about six centuries before the Clone Wars. He was the founder of the Antarian Rangers.\nBorn on Antar 4, Kaskutal possessed slight Force sensitivity, but had been turned down for Jedi training at an early age by Master Marus Timpel. Undaunted, he returned to his home planet and grew up to become a successful businessman, known for his negotiation skills. His success, no doubt in part thanks to his slight Force abilities and Gotal senses, allowed him to amass considerable wealth.\nYears later, Kaskutal again encountered Master Timpel, who had traveled to Antar 4 on a routine mission. The two struck up a friendship, and in conversations, the Gotal came to understand the difficulties Jedi had with resource allocation and travel limitations. Inspired, Kaskatul proceeded to organize a means to supplement the Jedi Order. This was the genesis of the Antarian Rangers.\nDrawing upon donations and investments by parties supportive of the Jedi, as well as more than a few shrewd business deals, Kaskatul was able to expand the Rangers to multiple systems and assist the Jedi without draining their limited resources. His minor Force talents and financial acumen proved invaluable to Master Timpel as they continued to work together until the end of Timpel's life.\nAt that point, Kaskutal took on an administrative role to manage the operations of the organization. With his strong business and managerial skills, Kaskutal ensured that the organization was financially stable and helped to continue its expansion. Even centuries after Kaskutal's death, the organization he founded flourished and assisted the Jedi Order through the tough times of the Clone Wars, the rise of the Galactic Empire, and even into the era of the New Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Antar_4/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Antarian_Rangers/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Marus_Timpel",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Hero%27s_Guide",
  "/wiki/Wizards.com",
  "/wiki/Antarian_Rangers_(article)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/Fly_Casual"
 ]
}