{
 "name": "Kasmira",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Kasmira was a Pantoran female scholar who studied the Force. On the eve of Reflection Day one year, she traveled on board a transport full of pilgrims to Jedha City on the moon Jedha in order to see all of the sites linked to the Force in the city. On the transport she excitedly spoke with fellow passenger Zallo Blaak about the trip, but found him rude and disinterested.\nAfter arriving in the city, she saved Blaak from being trampled by a spamel after he had gotten caught up in a parade. He thanked her, after which she left and went to purchase food for herself from on of the city's stalls. After serving herself, she realised she had lost her credits, but Blaak spotted her distress and offered to cover the meal. The pair then ate together before parting ways again. On Reflection Day, Kasmira visited the Dome of Deliverance, where Blaak planned to look into the Kyber Mirrors, and she approached him as he looked at his reflection. The pair then agreed to explore the city together.\nKasmira appeared in \"Reflection Day\", a short story illustrated by Grant Griffin and published in Life Day Treasury, a 2021 short story collection written by Cavan Scott and George Mann.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Scholar",
  "/wiki/The_Force",
  "/wiki/Reflection_Day",
  "/wiki/Standard_year",
  "/wiki/Transport",
  "/wiki/Jedha_City",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/City",
  "/wiki/Zallo_Blaak",
  "/wiki/Spamel",
  "/wiki/Foodstuff",
  "/wiki/Credit",
  "/wiki/Dome_of_Deliverance",
  "/wiki/Kyber_Mirrors",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Kasmira",
  "/wiki/Reflection_Day_(short_story)",
  "/wiki/Grant_Griffin",
  "/wiki/Life_Day_Treasury",
  "/wiki/2021",
  "/wiki/Cavan_Scott",
  "/wiki/George_Mann",
  "/wiki/StarWars.com"
 ]
}