{
 "name": "Kass_Tod",
 "display_name": "Kass Tod",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 39 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 22 BBY",
      "Jabiim"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kass Tod was a female Zabrak Padawan serving the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars.\nA Force-sensitive Zabrak, Kass Tod was educated in the ways of the Force by the Jedi Order during the decade marked by the Separatist Crisis. Selected as a Padawan, Tod constructed a green-bladed lightsaber which she wielded in battle. When the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Tod took up the rank of Commander within the Grand Army of the Republic. Along with her master, Tod was assigned to the planet Jabiim where they were to join other Jedi in a months-long battle with the Confederacy-backed Jabiimi Nationalists.\nDuring the fighting, Tod's master was slain and command was turned over to Obi-Wan Kenobi who ordered that her small force remain behind the main battle line until the main Republic force could overrun the main weapons emplacement of the Jabiimi Military. Along with other masterless apprentices, Tod became known as a member of the so-called Padawan Pack. General Kenobi ordered Tod to ambush the retreating soldiers as they fled along the flanks of the main column of the Republic army. Separated from the rest of her group after the battle, Tod eventually regrouped with the other Padawans as they made for the main outpost of the Grand Army. During the fighting Tod grew extremely fond of fellow Padawan Mak Lotor and the two formed a romantic bond forbidden by the Jedi Code.\nAs the Padawan Pack made a break for the main Republic outpost they came into open conflict with Jabiimi Nationalist leader Alto Stratus. Fighting alongside Lotor for four days on the battlefield, they were able to corner Stratus at long last. Using her lightsaber Tod removed Stratus' right leg, leaving the leader crippled and dying. Before she could finish off her opponent, a Hailfire droid fired its rockets at the wounded Jedi. Unable to divert the missiles due to fatigue Tod cradled the wounded Lotor and, having decided to die together at peace, were killed in a fiery explosion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/39_BBY",
  "/wiki/22_BBY/Legends",
  "/wiki/Jabiim/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Star_Wars:_Republic:_The_Battle_of_Jabiim",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Jabiim",
  "/wiki/Jabiimi_Nationalists",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jabiimi_Military",
  "/wiki/Padawan_Pack",
  "/wiki/Jedi_General/Legends",
  "/wiki/Mak_Lotor",
  "/wiki/Jedi_Code/Legends",
  "/wiki/File:KassTodd.jpg",
  "/wiki/Alto_Stratus",
  "/wiki/Cho_mok/Legends",
  "/wiki/IG-227_Hailfire-class_droid_tank/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides"
 ]
}