{
 "name": "Kassar Forge",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kessel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "\"Very Tall\""
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Neutral"
     ]
    }
   ]
  }
 ],
 "content": "Kassar Forge was a Human teacher who worked on a Galactic Republic program on Kessel to educate inmates on how to re-enter society upon release. He is the father of Lujayne and Inyri Forge, who both became Rogue Squadron pilots.\nPrior to the Clone Wars, Kassar volunteered to go Kessel, the infamous prison world, in an effort to teach and reform the criminals there, with the hopes of preventing them from returning to a life of crime upon their release. Following the Battle of Endor, when inmates overthrew their masters and took control of the planet, he voluntarily remained on the moon, believing that he still could make a difference in the lives of the criminals.\nHe was a modest man who often described himself and his accomplishments in a self-deprecating fashion. He would often say he was not sure how much good he had done throughout his life, and he said he had been \"judged harmless\" by the Kessel residents from whom he earned respect.\nKassar fell in love with Myda, one of the inmates, and married her. Although she would not have chosen to live on Kessel without him, she remained by her husband's side and also began teaching there.\nThe two spent the rest of their lives on the planet, rejecting all opportunities to leave, including an offer by Commander Wedge Antilles in 6.5 ABY, who was freeing high-profile prisoners to help disrupt Imperial operations on Coruscant in the months leading up to its liberation.\nKassar and Myda had multiple sons and daughters, most of whom continued to live on the planet with them. Among their children were Lujayne and Inyri, who both went on to become pilots in Rogue Squadron, the elite group of starfighter pilots for the New Republic Defense Force.\nKassar passed knowledge from many of the trade skills that he taught to inmates on to his children. In particular, he instructed Lujayne on landspeeder repair, and her expertise in repairing and maintaining T-47 airspeeders proved particularly helpful during her time with Rogue Squadron.\nIn 6.5 ABY, Kassar and his family were devastated by the loss of his daughter, Lujayne, who was killed in her sleep by Imperial stormtroopers during a surprise covert assault on Talasea.\nHe was only slightly less troubled when his younger daughter, Inyri, became the \"glitterstim cutter\" and lover to Zekka Thyne, a dangerous Black Sun criminal, who she insisted upon leaving Kessel with when he was selected by Wedge to be taken to Coruscant. Although Myda implored Wedge to separate the two when he took Zekka, Kassar insisted that Inyri had to be left to make her own decisions, much like the inmates he instructed were left to make their own paths after leaving their instruction.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lujayne_Forge",
  "/wiki/Inyri_Forge",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Myda_Forge",
  "/wiki/Commander/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Landspeeder/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Talasea",
  "/wiki/Glitterstim/Legends",
  "/wiki/Cutter",
  "/wiki/Zekka_Thyne",
  "/wiki/Black_Sun/Legends",
  "/wiki/X-Wing:_Rogue_Squadron",
  "/wiki/X-Wing:_Rogue_Squadron_(unabridged_audiobook)",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}