{
 "name": "Kassar Kosciusko",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "73 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarro"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Intelligence",
      "Alliance Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Kassar Kosciusko was a male Tarro assassin who later became the owner and proprietor of the Royal K Hotel and Casino on Kwenn Space Station as well as a secret undercover operative of the Rebel Alliance.\nKassar Kosciusko was born in the year 73 BBY. He became an assassin and in 20 BBY he encountered five Loag assassins on the East side of Luj City on the planet Novor 23. Both the Loag and Kosciusko were assigned the same target to kill and Kosciusko ended up also eliminating the Loag assassins, although he received a long scar in the process. Kassar Kosciusko was a friend of Meysen Kayson, having saved Kayson's life on Pernam Minor. Shortly after the Battle of Yavin, Kosciusko was known as \"Mr. K,\" the owner and operator of a casino that was located on Kwenn Space Station. He gathered resources and information under the guise of being an aggressive businessman however by 0 ABY he was secretly feeding information to Alliance Intelligence. His skills as an assassin were sometimes used as well and he was responsible for the \"mysterious disappearance\" of Moff Chorkun.\nKosciusko kept a cell of Rebel operatives on Kwenn Station, but their activities were often disrupted by Imperial-aligned spy Derrida. After foiling at least five Rebel operations in Kwenn, Derrida became Kosciusko's personal nemesis.\nKosciusko was a male Tarro with dark green skin, dark blue hair, and bright yellow eyes. He had a mouthful of sharp teeth that he could use to intimidate others and his body also had a long scar. He wore elegant clothing that complemented his muscular physique and also wore long flowing cloaks.\nKosciusko was a skilled combatant being highly trained in using blasters, melee weapons, or using his fists. He was very strong, fast and physically fit. He was very in tune with the operations of Kwenn Space Station. For social skills Kosciusko was adept at both intimidation and persuasion and was an effective leader and business owner. Finally Kosciusko was skilled at riding swoops, especially the Nebulon-Q.\nKosciusko wore expensive tailored clothes and cloaks. He also carried a heavy blaster pistol, a stun cloak and an Ar'gor blade.\nKassar Kosciusko was designed by Craig Robert Carey and Michael Denbo for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/73_BBY",
  "/wiki/Tarro",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Assassin/Legends",
  "/wiki/Royal_K_Hotel_and_Casino",
  "/wiki/Kwenn_Space_Station/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Loag",
  "/wiki/Luj_City",
  "/wiki/Planet/Legends",
  "/wiki/Novor_23",
  "/wiki/Meysen_Kayson",
  "/wiki/Pernam_Minor",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Casino/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Chorkun",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Derrida/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Nebulon-Q_Swoop_Racer",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Stun_cloak",
  "/wiki/Ar%27gor",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Michael_Denbo",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Vilardi",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Greel_Wood_Haven",
  "/wiki/Star_Wars_Adventure_Journal_6",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}