{
 "name": "Kath Scarlet",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Binayre Pirates"
     ]
    }
   ]
  }
 ],
 "content": "Kath Scarlet was the female Human captain of the Binayre Pirates, a band of pirates and smugglers that operated within the Corellian sector during the Galactic Civil War. Scarlet preyed upon unarmed starships passing through Corellian space, using her Firespray-31-class patrol and attack craft to ambush them and capture their cargo. When the Galactic Empire dispatched a team to destroy a Rebel base on Talus, Scarlet attacked and boarded their shuttle as it emerged from hyperspace, only to be driven back by the well-armed Imperials. Around the same time, she attempted to take possession of the Z-95 Headhunter Dire Hound from its spacer owner, but retreated when the spacer defended the starfighter.\nThe Human female Kath Scarlet operated as a pirate during the Imperial era. By the Galactic Civil War, she was the captain of the Binayre Pirates, a group of pirates and smugglers based out of the twin worlds of Talus and Tralus, who controlled several areas of the Corellian sector, including the Trifecta Star and the Rayless Lantern. Scarlet preyed upon merchant vessels passing through the area, hiding her Kuat Systems Engineering Firespray-31-class patrol and attack craft among asteroids to ambush and capture unwary starships.\nDuring the Galactic Civil War, the Galactic Empire learned of a secret Rebel base on Talus and dispatched several Imperial officers from the Raithal Academy to seek out and destroy it. Scarlet's Firespray was nearby when the Imperial squad's Lambda-class T-4a shuttle emerged from hyperspace in the Corellian system. Believing the new arrival to be a cargo vessel, Scarlet attacked, using her ship's ion cannon to target the shuttle's hyperdrive, disabling it and preventing the ship from escaping. The stricken shuttle was then grappled and boarded, with Scarlet personally leading several pirates in a boarding party. Met by the shuttle's crew, Scarlet demanded that they surrender and take her to their cargo hold. However, the Imperials refused and drew their hidden weapons, leading to a vicious firefight in which the Imperials managed to gain the upper hand. Sensing the situation worsening for her side, Scarlet deftly escaped back through the airlock to her Firespray and escaped before the Imperials could repair their hyperdrive to give chase, though several of her pirates ended up in Imperial custody.\nAround the same time, the Binayre Pirates learned of a spacer who was in the Corellian system to recover the Z-95 Headhunter Dire Hound, which had previously belonged to their aunt Evgenia, from a secret hangar on Talus. The Empire too had learned of the Z-95 and dispatched a team led by Imperial Security Bureau agent Jeffren Brek to impound it. Scarlet and a group of Binayres followed the Imperials to the hangar and waited while a shootout developed between Brek's team and the spacer. Only when the Imperials were driven back did the pirates reveal themselves to the spacer. With her heavy blaster pistol aimed at the spacer, Scarlet demanded that they turn the Z-95 over to her, but the spacer intended to defend their property and put up a short, but brutal firefight. Deciding that the price was not worth the effort, Scarlet and a couple of her pirates escaped, leaving the spacer alone.\nKath Scarlet was a cunning pirate whose favorite trick was to hide her vessel among asteroids to take ships unaware and who did not hesitate to attack an unarmed vessel. Most pilots preferred to trail targets at a short distance, allowing them to fire while staying out of their target's own firing arc. Scarlet, however, to overshoot her opponents in an opening tilt and use a series of unpredictable, low-speed maneuvers to get into firing position and catch them off-guard. She was sometimes known to use a Koiogran turn to move directly in front of her adversary and rely on her own skills to fire before her enemy. After disabling a target she would board it and give the crew one chance to surrender their cargo to her, but was willing to kill if necessary. She would also pursue targets of a personal interest, seeking to capture the Z-95 Headhunter Dire Hound after taking a liking to its uprated 2b fission engines and bubble canopy. Under her leadership, the Binayre Pirates were well-armed and organized. However, Scarlet put her own wellbeing ahead of her crew's, fleeing a fight with Imperial forces while leaving several of her crew behind to be captured. She was often sarcastic when addressing her victims and even winked at the Imperials when fleeing their shuttle. Scarlet was typically clad in a flight suit and carried a heavy blaster pistol.\nKath Scarlet was created for Squadrons Over Corellia, an expansion set for the Star Wars Galaxies Trading Card Game, released on December 16, 2008. Scarlet is involved in both the light and dark side campaigns and is depicted on the \"Kath Scarlet\" card. Game designer Chuck Kallenbach teased players with the possibility of Scarlet choosing a side in the Galactic Civil War.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Binayre_Pirates",
  "/wiki/Captain/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Corellian_sector/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Kath_Scarlet%27s_Firespray-31-class_patrol_and_attack_craft",
  "/wiki/Firespray-31-class_patrol_and_attack_craft/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Time/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Dire_Hound",
  "/wiki/Spacer/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Double_Worlds",
  "/wiki/Tralus/Legends",
  "/wiki/Trifecta_Star",
  "/wiki/Rayless_Lantern",
  "/wiki/Merchant/Legends",
  "/wiki/Kuat_Systems_Engineering/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Raithal_Academy/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Corellian_system",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Evgenia",
  "/wiki/Hangar/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Jeffren_Brek",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Koiogran_turn",
  "/wiki/2b_fission_engine",
  "/wiki/Flight_suit/Legends",
  "/wiki/Squadrons_Over_Corellia",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/December_16",
  "/wiki/2008",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Chuck_Kallenbach",
  "/wiki/Category:Images_of_Kath_Scarlet",
  "/wiki/Template:SWGTCG",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Slave_I_Expansion_Pack",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Most_Wanted_Expansion_Pack",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Z-95-AF4_Headhunter_Expansion_Pack",
  "/wiki/Slave_I_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Sony",
  "/wiki/CorSec_Database_A-G",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/December_17",
  "/wiki/2009",
  "/wiki/November_9",
  "/wiki/2011"
 ]
}