{
 "name": "Katha_Niar",
 "display_name": "Katha Niar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Dromund Kaas"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3638 BBY",
      "Makeb"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireMinistry of Logistics",
      "Ministry of Logistics"
     ]
    }
   ]
  }
 ],
 "content": "Katha Niar was a Human female working for the reconstituted Sith Empire during the Galactic War. She worked for the Ministry of Logistics until 3638 BBY, when she was chosen to run the support team for the Imperial strike force during the Conquest of Makeb.\nUnfortunately her involvement was discovered by the Hutt Archon. Szajin captured and tortured her, and eventually learned the Empire's true plan. She remained prisoner until the Sith strike team finally confronted and killed Szajin, but died from her wounds shortly thereafter.\nIn 3638 BBY, Niar was part of a strike team sent to the planet Makeb to secure isotope-5 for the Sith Empire. Their mission was paramount and was to be undertaken with utmost secrecy, lest the Hutts, who had seized control of the planet, learn of their intentions. Once the strike team secured Gravity Hook Seven, the Imperials started up operations. Niar, along with Doctor Nadrin Tro and Lord Cytharat, guided the strike team in their efforts to obtain isotope-5.\nOnce the strike team obtained intel from Solida Hesk that the Hutts' mining of isotope-5 had destabilized Makeb's core, Niar organized a plan to storm Stronghold One, where the isotope-5 was lying in wait. As the fortress was too well-guarded, especially by an isotope-5-powered droid, the Imperials organized civil uprisings against the InterStellar Regulators reinforcements.\nThe strike team set off a series of explosive charges in the volcanic mesa where Stronghold One stood, destroying its primary power source - including its security grid - without arousing suspicion. Once the defenses were down, the strike team went in to claim the isotope-5 vault, with Cytharat leading troops in support to prevent reinforcements from following. Guarding the entrance to the vault was the prototype isotope-5 war droid, and the Imperial team was forced to redirect the room's turret defenses to make a dent in it, and also lower a forcefield holding back magma to break through its energy shields.\nUnfortunately, the strike team discovered that the Hutts had all but one sample of the isotope to create an army of war droids. When the droids were activated by Archon Szajin, the strike team was forced to flood the chamber with lava, sacrificing Cytharat and his team.\nDarth Marr was none too pleased to learn of the team's failure. He reminded them that three Imperial worlds had fallen to the Republic to buy time for the team on Makeb and ordered them to find a way to rectify the situation. The strike team consulted with their support team, as well as science and engineering experts from Taris and Quesh, to find a way to save Makeb. They determined that the first step would be to map out all the isotope-5 deposits, and then develop a way to stabilize the core. The abandoned drilling station where the isotope was first discovered was determined to be the ideal place to set off the pulse, but it also caused a groundquake that buried the team in an emergency bunker for six hours before Niar and a squad of Imperial troops came to rescue them.\nMoving their base to a drilling platform, Nadrin explained that the damage to Makeb's core was too extensive to correct, so they would use the drilling platforms to accelerate the destruction so the core would pass into a new state of equilibrium. The problem was that none of their team on-hand were capable of operating the laser drills, forcing them to seek the aid of local engineers.\nWhile the strike team was off commandeering the laser drills, the Archon dispatched a Regulator assault shuttle, taking Niar and several others prisoner for interrogation. By the time the strike team managed to storm Szajin's palace, they found Niar mortally wounded. She confessed that she broke under torture and now the Archon was going to contact the Cartel fleet to inform them of the Empire's true plans.\nNiar managed to muster the strength to make it to the Archon's throne room and see him defeated. The indignant Hutt boasted that his ground forces were spread across Makeb and could contact his fleet before they were silenced. However, Niar noted that the Empire could prevent that by killing them all. The strike team backed up her threat by ordering Nadrin to start groundquakes at all mercenary locations, burying them all in lava, before executing Szajin.\nAs Niar died from her wounds, she expressed her gratitude in serving the Empire.\nKatha Niar first appeared in Star Wars: The Old Republic: Rise of the Hutt Cartel, a Digital Expansion released in 2012 for the video game Star Wars: The Old Republic. According to the game's conversation files, Niar's name was originally \"Kiar Onila.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/3638_BBY",
  "/wiki/Makeb",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Ministry_of_Logistics",
  "/wiki/Galactic_War",
  "/wiki/Conquest_of_Makeb",
  "/wiki/Hutt/Legends",
  "/wiki/Archon_(Hutt)",
  "/wiki/Szajin",
  "/wiki/Prisoner/Legends",
  "/wiki/Death/Legends",
  "/wiki/Isotope-5",
  "/wiki/Nadrin_Tro",
  "/wiki/Cytharat",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Solida_Hesk",
  "/wiki/Stronghold_One",
  "/wiki/InterStellar_Regulators",
  "/wiki/Darth_Marr",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/2012",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2013",
  "/wiki/Standard_year/Legends",
  "/wiki/2014",
  "/wiki/3637_BBY",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/3636_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}