{
 "name": "Kathikiis_Ruwahurr",
 "display_name": "Kathikiis Ruwahurr",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selonian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Kathikiis Ruwahurr was the Selonian ambassador to Talus at the time of the Galactic Civil War.\nIn 1.5 ABY, a group of Humans that hated aliens threatened Ruwahurr and the ambassador's people. Ruwahurr endeavored to open a dialogue with them, but the alien haters showed no interest in peaceful talks. Soon after, they kidnapped Ruwahurr's assistant, a Selonian healer. Ruwahurr met a spacer who was willing to help the ambassador. The spacer ambushed the alien haters, freed the assistant and escorted the Selonian to safety. Then Ruwahurr learned from a friend that the alien haters had hired a bounty hunter to kidnap the diplomat. Once again the ambassador could rely on the helpful adventurer who tracked down the bounty hunter and killed him in a fight to the death. Ruwahurr thanked the spacer and rewarded him with a small sum of credits.\nKathikiis Ruwahurr was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies, prior to its closure on December 15, 2011. The Selonian could be found in the Dearic Cantina. The NPC offered two small quests to players. For the first quest, the player had to travel to coordinates outside of Dearic, fight a few low-level NPCs and escort the Selonian healer back to the Dearic cantina. For the second quest, the player had to travel to a location outside of Dearic again and kill the bounty hunter NPC.\nAlthough Ruwahurr consistently spawned as a female Selonian, her appearance was randomized between one of thirty possible depictions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Selonian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Ambassador/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/Dearic_Cantina",
  "/wiki/Dearic/Legends"
 ]
}