{
 "name": "Katiz Xemir",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Remote colony world"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    }
   ]
  }
 ],
 "content": "Katiz Xemir was a Human male mercenary who hired himself out against Imperial targets after the Empire killed his family. In 0 ABY, while he was on StarForge Station, Xemir applied for a berth on the Far Orbit, an Alliance to Restore the Republic privateering frigate that had docked there.\nKatiz Xemir was a Human male settler on a remote colony world. When he refused to leave and go offworld to make way for a mining facility, the Galactic Empire killed his family. Left without a home and his closest of kin, Xemir drifted around, becoming a mercenary who only took jobs that targeted Imperials. In 0 ABY, he was on the space station known as StarForge Station, located in the StarForge Nebula, when the Far Orbit docked there. An EF76 Nebulon-B escort frigate whose crew had recently mutinied from under Imperial control and become privateers for the Alliance to Restore the Republic, the Far Orbit's call for new crew members caused Xemir to apply for a position on the ship.\nAfter the death of his family at Imperial hands, Xemir took up a grudge, hiring himself out as a mercenary to people who targeted the Empire. The man stood two meters tall and was lean, quiet, and self-absorbed. Xemir owned a heavy blaster pistol, two smaller pistols, a hold-out blaster, and a combat knife. He, at some point in time, wore a helmet and a cloak, and on at least one occasion chewed a toothpick.\nKatiz Xemir first appeared in Preparing for War, an adventure idea from 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games' Star Wars: The Roleplaying Game and was a sequel of sorts to the previous publication, Pirates \u0026 Privateers, carrying on that book's theme by following the privateering vessel Far Orbit. The man was provided as a sample character of the individuals who could apply for berths on the ship. It is up to player discretion as to who gets a job on the ship. The scenario mentions that Xemir would probably end up serving in the Alliance sometime after his encounter with the Far Orbit.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Katiz_Xemir%27s_homeworld",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Mercenary/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Death/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/StarForge_Station",
  "/wiki/Far_Orbit",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/StarForge_Nebula",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Mutiny_on_the_Far_Orbit",
  "/wiki/Starship/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Time/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Toothpick/Legends",
  "/wiki/Preparing_for_War",
  "/wiki/1998",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Timothy_S._O%27Brien",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Standard_week/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}