{
 "name": "Katya M'Buele",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Tirahnn"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Katya M'Buele was a Corellian smuggler who was an early flame of Han Solo, with whom she served on the crew of a Corellian rim-runner. M'Buele flew with Solo during the Battle of Ylesia, and the two Corellians were the only two survivors of a doomed smuggling mission to Skye. In 0 ABY the two briefly reunited on Tirahnn, only for M'Buele to die shortly after at the hands of a smoke demon conjured by Kharys, the Majestrix of Skye.\nA Corellian, Katya M'Buele entered into a smuggling career during the Imperial Period, serving on the crew of a Corellian rim-runner alongside a young Han Solo. The pair became romantically involved, and once narrowly survived an aborted smuggling mission to the restricted world of Skye, when they were captured and hunted by the Majestrix of Skye, Kharys—a dangerous Dark Jedi who had once been trained by the Sith Lord Darth Vader. Out of 20 Corellians who had traveled to Skye, M'Buele and Solo were the only two survivors. However, their relationship eventually ended when Solo left to further pursue his own smuggling career sometime after the two flew together during the Battle of Ylesia.\nFor her participation in the fighting on Ylesia—where an alliance of Rebel forces and a smuggler fleet clashed with the Besadii Hutts—M'Buele was one of the few smugglers who actually got paid. M'Buele and fellow smuggler Zeen Afit celebrated lavishly as a result, and passed the news on to acquaintance Dash Rendar. M'Buele briefly re-entered Solo's life in 0 ABY, when the two reunited on the planet Tirahnn—by this point, Solo had become entangled in the Rebel Alliance himself. After briefly catching up aboard Solo's Millennium Falcon, Solo and M'Buele realized that Solo's friend Luke Skywalker had encountered Kharys, who had hunted Solo since their escape from Skye. Although M'Buele wanted to join her former flame on his search for information that night, she stayed behind on the Millennium Falcon at his behest. However, the ship proved no safer than the streets of Tirahnn, as M'Buele was killed in her bed by a smoke demon, a dark side entity summoned by Kharys.\nKatya M'Buele had a close relationship with Han Solo, and even though their romance broke off, they still had warm feelings for one another long afterward. M'Buele thought Solo handsome, and remarked that she could not refuse her fellow Corellian anything.\nKatya M'Buele first appeared in Star Wars Annual  1, written by Chris Claremont and released in 1979. In the issue, M'Buele was illustrated by Mike Vosburg and Steve Leialoha. The character Arwen Cohl in the 2001 James Luceno novel Cloak of Deception was originally named Margrave M'Buele, as a reference to Katya M'Buele.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Tirahnn/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Corellian_rim-runner",
  "/wiki/Battle_of_Ylesia",
  "/wiki/Skye",
  "/wiki/Death/Legends",
  "/wiki/Smoke_Demon",
  "/wiki/Kharys",
  "/wiki/Magister_of_Skye",
  "/wiki/Imperial_Period",
  "/wiki/Planet/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Besadii/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Zeen_Afit",
  "/wiki/Dash_Rendar/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars_Annual_(1977)_1",
  "/wiki/Chris_Claremont",
  "/wiki/1979",
  "/wiki/Mike_Vosburg",
  "/wiki/Steve_Leialoha",
  "/wiki/Arwen_Cohl",
  "/wiki/2001",
  "/wiki/James_Luceno",
  "/wiki/Cloak_of_Deception",
  "/wiki/Rebel_Dawn",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Aliens_in_the_Empire",
  "/wiki/StarWars.com",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Insider",
  "/wiki/Legendary_Authors",
  "/wiki/Star_Wars_Insider_146"
 ]
}