{
 "name": "Kav Bayons",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Vigilance",
      "Christoph system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chagrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kav Bayons was a male Chagrian Jedi Knight who fought for the Galactic Republic during the Clone Wars. Bayons accompanied his Jedi colleagues Akar-Deshu, Obi-Wan Kenobi, and Anakin Skywalker on a mission to apprehend the turncoat Jedi Master Quinlan Vos, who was secretly colluding with the Separatist leader Count Dooku. Bayons died during the second battle of Christophsis when Vos and Dooku staged an escape aboard the Venator-class Star Destroyer Vigilance. Bayons was killed when Vos Force-shoved Deshu into him; causing Deshu's stinger to inject poison into his bloodstream, which proved fatal for Bayons.\nKav Bayons was a Jedi Knight during the last years of the Galactic Republic. He distinguished himself in combat during the Clone Wars. During the second year of the Clone Wars, Bayons accompanied the Mahran Jedi Knight Akar-Deshu \"Desh\" on a mission to apprehend the Jedi Master Quinlan Vos, who had been exposed as a traitor for colluding with Count Dooku. Bayons, along with Desh and Commander Cody, were present on the bridge of the Venator-class Star Destroyer Vigilance when their Jedi comrades Obi-Wan Kenobi and Anakin Skywalker informed them that they had apprehended both Vos and Dooku.\nDesh and his colleagues were shocked by the news of Vos' betrayal and the prospect of having to execute their former comrades. Nevertheless, they complied with Kenobi's orders to meet them in the Vigilance's hangar bay with reinforcements. When Kenobi and Skywalker returned with their captives, Bayons, Desh, Commander Cody and his men were tasked with leading their captives to the ship's brig. Bayons was tasked with leading Dooku into custody. When Dooku spoke about Vos' betrayal, Bayons ordered him to be silent.\nOn the way, Vos halted under the pretext of revealing to Desh why he had defected to Dooku. While his Jedi and clone captors were distracted, Vos used the Force to levitate Desh's lightsaber and free Dooku from his restraints. Dooku then emulated Vos by stealing Bayons' lightsaber and slaying a clone trooper. After hurling Cody and freeing Vos, Dooku blasted Bayons and several clones with Force lightning. Bayons was hurt by the Force lightning, but he managed to join Desh in the pursuit to recapture the two Sith fugitives.\nTo delay Bayons and Desh, Dooku Force choked two clone troopers and hurled their bodies at the two Jedi. Desh then attempted to kill Vos by unsheathing the stinger in his right wrist—an anatomical feature unique to the Mahran species. Desh attempted to stab Vos, but the Sith hurled him against Bayons, exposing him to Desh's venom. The stinger grazed Bayon's face, causing it to swell immediately and his eyes to to turn wide. Dying, Bayons slumped against a wall. After killing Desh, Vos and Dooku escaped the Vigilance with the help of his lover Asajj Ventress, who was unaware of Vos' collusion with Dooku.\nFollowing the events of the second battle of Christophsis, a penitent Vos admitted to killing Bayons, Desh, and the clone troopers among other crimes, including sabotaging the Republic war effort and falling to the dark side. Vos also revealed that his collusion with Dooku was merely a ruse to force the Separatist leader and Sith Lord to lead him to his master, Darth Sidious. Vos had wanted to destroy the Sith, but had strayed to the dark side in the process.\nAs a Chagrian, Kav Bayons had light-blue skin and a humanoid form. He was taller than the Mahran Jedi Knight Akar-Deshu. Bayons was upset to learn about Quinlan Vos' collusion with Count Dooku and sympathized with Desh's unhappiness; knowing that Desh was a close friend of Vos. While Bayons had distinguished himself in combat during the Clone Wars, he was no match for the Force powers of Count Dooku and Quinlan Vos.\nKav Bayons first debuted as a supporting character in Christie Golden's 2015 novel Dark Disciple, which was based on eight unproduced screenplays from the canceled Cartoon Network TV series Star Wars: The Clone Wars. Dark Disciple is part of the Canon The Clone Wars Legacy, an ongoing multimedia project using material from the canceled TV series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/19_BBY",
  "/wiki/Vigilance_(Venator-class)",
  "/wiki/Christoph_system",
  "/wiki/Chagrian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Knight",
  "/wiki/Clone_Wars",
  "/wiki/Akar-Deshu",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi_Master",
  "/wiki/Quinlan_Vos",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Second_battle_of_Christophsis",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Standard_year",
  "/wiki/Lightsaber_combat",
  "/wiki/Mahran",
  "/wiki/Jedi",
  "/wiki/Treason",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Bridge_(starship)",
  "/wiki/Death",
  "/wiki/Hangar",
  "/wiki/Starship",
  "/wiki/Clone_trooper",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Akar-Deshu%27s_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Kav_Bayons%27s_lightsaber",
  "/wiki/Force_lightning",
  "/wiki/Sith",
  "/wiki/Force_choke",
  "/wiki/Species",
  "/wiki/Poison",
  "/wiki/Eye",
  "/wiki/Asajj_Ventress",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sith_Lord",
  "/wiki/Sith_Master",
  "/wiki/Darth_Sidious",
  "/wiki/Humanoid",
  "/wiki/Force_power",
  "/wiki/Christie_Golden",
  "/wiki/2015",
  "/wiki/Dark_Disciple",
  "/wiki/Cartoon_Network",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars_Legacy",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}