{
 "name": "Kavas_Urdano",
 "display_name": "Kavas Urdano",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Valarian Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "Kavas Urdano was a female Chiss criminal who lived on Tatooine during the Galactic Civil War.\nAfter the Battle of Yavin, Kavas Urdano worked for Lady Valarian, the leader of the Valarian criminal syndicate, in Mos Eisley's Lucky Despot cantina. Kavas was in charge of Valarian's smuggling operations. The Chiss woman was one of the two main lieutenants of Lady Valarian, the other being the Gran woman Ind. Urdano and Ind had a very conflicting relationship as both competed for getting Valarian's attention.\nIn 1 ABY, the conflict between the Hutt crime lord Jabba Desilijic Tiure and Lady Valarian, her biggest competitor on Tatooine, turned to open war. At that time, Kavas Urdano recruited skilled spacers to help her with several missions. These adventurers first proved their loyalty by assassinating the traitor Cie Vos. The spacers were then dispatched by Kavas to fight a group of Jabba's enforcers came to eliminate Valarian operatives on the edge of Mos Eisley. In another mission, they rescued Lady Valarian's advocate Ysho from Jabba's henchmen. The spacers later collected a camera from an individual named Ki'shai and brought it back to Urdano. They also assassinated one of Jabba's thugs who harassed the patrons of the Lucky Despot. For their last mission, Kavas Urdano tasked the spacers with finding and killing one of Jabba's assassins who had failed in murdering Lady Valarian but had managed to grab most of the Valarian financial records. Again, the adventurers were successful and eventually returned with the sensitive information before it was delivered to Jabba. Lady Valarian was so pleased by this outcome that she requested the spacers to go work for Ind in the inner sanctum of the Lucky Despot.\nLater the same year, many people were caught in a firefight between Lady Valarian's guards and Jabba's thugs in Mos Eisley. A medic sent by the 2-1B droid Billingsly attempted to examine a wounded man named Jorund Redd. However, Kavas Urdano sent thieves to attack the medic as she did not appreciate people interfering with Lady Valarian\"s business. Surprisingly, the medic managed to kill both thieves and then treated Redd's injuries.\nKavas Urdano was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Kavas Urdano was present in the original release of the game, being part of Lady Valarian's Quest Series.\nWith \"Publish 20\" released on July 19, 2005, it was announced that the \"Valarian Quest Series\" would be phased out during \"Publish 22\" to make way for a revamped questline during \"Publish 23.\" The story of this new Valarian Themepark was centered on the rivalry between Ind and Kavas Urdano. While the old Valarian Quest Series was fully deactivated by Publish 23 on August 31, 2005, the newly proposed questline was never fully implemented to replace it. Kavas Urdano remained present in the game but was not involved in any quest anymore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Valarian_Syndicate",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Lucky_Despot",
  "/wiki/Cantina/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Ind",
  "/wiki/1_ABY/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Cie_Vos",
  "/wiki/Lawyer/Legends",
  "/wiki/Ysho",
  "/wiki/Camera/Legends",
  "/wiki/Ki%27shai",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Medic/Legends",
  "/wiki/2-1B_surgical_droid",
  "/wiki/Billingsly",
  "/wiki/Jorund_Redd",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/July_19",
  "/wiki/2005",
  "/wiki/August_31",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/CorSec_Database_H-Z",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}