{
 "name": "Kavafi",
 "display_name": "Kavafi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 50 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Kavafi was a doctor and a friend of Mammon Hoole, dedicated to improving the lot of sentient beings.\nA doctor, Kavafi served in the Imperial Biological Welfare Division. He met and befriended Mammon Hoole, a fellow Imperial scientist.\nIn 0 ABY, Kavafi was working as a doctor and virus researcher at the Mah Dala Infirmary, in Mah Dala, Gobindi. When the Shi'ido Borborygmus Gog arrived to develop a weaponized virus for the Imperial Biological Warfare Division, Gog imprisoned Kavafi and used his powers as a Shi'ido shapeshifter to impersonate Kavafi and take over the Mah Dala Infirmary.\nSix weeks later, Tash Arranda, Mammon Hoole's niece, found Kavafi. Gog observed, however, and before she could free Kavafi, Gog released the virus to test it upon the pair. Arranda used an electroscope to find an area of the cell to which the airborne virus had not yet spread. There Kavafi stayed safe while Arranda escaped through an air vent, freed Hoole, and returned after the virus had quickly lost its viability. The group, deep within one of the ziggurats on which Mah Dala was built, left out a door that opened into the Gobindi jungle, where they found Zak Arranda and a pair of Rebels working with the Arrandas. Hoole, also a Shi'ido, transformed into a mammoth frog, allowing him to carry the others to the top of the ziggurats and away from the menacing blobs that carried the virus.\nKavafi developed an antidote to the virus, which he used to cure Tash Arranda of the infection she had developed, and fled the planet with the others.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/50_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Mammon_Hoole",
  "/wiki/Imperial_Biological_Welfare_Division",
  "/wiki/0_ABY/Legends",
  "/wiki/Mah_Dala_Infirmary",
  "/wiki/Mah_Dala",
  "/wiki/Gobindi",
  "/wiki/Shi%27ido",
  "/wiki/Borborygmus_Gog",
  "/wiki/Tash_Arranda/Legends",
  "/wiki/Zak_Arranda/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Mammoth_frog",
  "/wiki/Galaxy_of_Fear:_Planet_Plague",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}