{
 "name": "Kavel Mesa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Captain Kavel Mesa was Chief Logistics Officer for the Rebel Alliance's Haven Base on the planet Arbra during the Galactic Civil War. One of the main point-men running the construction of Haven Base within a large system of caverns, in 3 ABY, Mesa was placed in charge of a special project that involved using five Kerts-Bhrg field generators to create a protective environmental field around the Rebel fleet. Mesa reported directly to Rebel leader Leia Organa, who hoped the novel experiment could allow the Alliance to effectively hide their ships within the chromosphere of the nearby star Arbran. During the fields' initial testing phase, an absorption circuit overloaded and the command center on the control generator was filled with noxious gas. Captain Mesa and several members of the maintenance crew passed out for a brief period of time before the circuit could be repaired.\nKavel Mesa appeared in Star Wars 58, written by David Michelinie, illustrated by Walter Simonson and released in 1982. There is significant confusion about Mesa's rank across his various mentions in the Legends continuity. Both the Wizards of the Coast supplement Arbra: Sanctuary In the Storm and The Complete Star Wars Encyclopedia refer to Mesa as both a Captain and a Colonel, just several sentences apart from each other. However, as Mesa's original appearance in Star Wars 58 refers to him as a Captain, for the purposes of this article he is referred to as such.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mesa_Greenbark",
  "/wiki/Mesa_291",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Haven_Base",
  "/wiki/Planet/Legends",
  "/wiki/Arbra/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Kerts-Bhrg_field_generator",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Star/Legends",
  "/wiki/Arbran",
  "/wiki/Star_Wars_(1977)_58",
  "/wiki/David_Michelinie",
  "/wiki/Walter_Simonson",
  "/wiki/1982",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Arbra:_Sanctuary_In_the_Storm",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Colonel/Legends",
  "/wiki/Wizards.com"
 ]
}