{
 "name": "Kawlan_Roken",
 "display_name": "Kawlan Roken",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hidden Path"
     ]
    }
   ]
  }
 ],
 "content": "Kawlan Roken was a human male dissident during the height of the Galactic Empire, who operated an underground network known as Hidden Path that smuggled surviving Jedi and Force-sensitives to safety during the Great Jedi Purge. He was once married to a force-sensitive woman, who was hunted down by the mysterious, force-sensitive agents of the Inquisitorius.\nKawlan Roken once married a woman who turned out to be Force-sensitive. The couple tried hard to hide her Force-sensitivity, but she was hunted down by the Inquisitorius, an organization of the Galactic Empire dedicated to hunting down Force-sensitives. After her disappearance, Roken helped operate and lead The Path, an underground network which smuggled Jedi and Force-sensitives from the Empire. When he learned that Obi-Wan Kenobi survived the Great Jedi Purge and needed his help to rescue Alderaanian Princess Leia Organa, he was reluctant to offer it. Eventually, he helped Kenobi and Tala Durith infiltrate Fortress Inquisitorius, and the Alderaanian princess was rescued.\nOnce they arrived at the planet Jabiim, Roken began leading an evacuation effort in order to allow the refugees being hidden to escape, with the usage of a soon-to-be-closed trade route. Unknown to any of the members of the rescue team, Leia's toy droid companion L0-LA59 was outfitted with a tracker which traced the rescue team's location to Jabiim, leading to a siege of the planet led by Darth Vader and Third Sister. Initially unaware, Roken was caught off-guard when the base hangar's blast doors were sealed shut, until he was made aware of an Imperial-class Star Destroyer in orbit of the planet. Working with the former Jedi General, Roken, along with many other denizens of the underground operation, helped direct the task of sealing all the other blast doors, and helped handle the unlocking of the hangar's main doors. At Organa's insistence and at Kenobi's urging, Roken helped the Princess climb into the vents to help with the hangar's doors.\nRoken later helped guard the main blast door to the base, wielding a bowcaster and blasting multiple Stormtroopers. He expressed disbelief at Kenobi's defeated attitude, and watched as he surrendered himself to the Imperials waiting outside. Kawlan later evacuated with the refugees and Kenobi onboard a transport; being made aware of the transport's hyperdrive being nonoperational and expressing worry, he mentioned it to Kenobi. When Kenobi realized he could leave from the freighter to distract Vader, Roken objected but ultimately relented. Parting ways with the rebel leader, Kenobi advised him not to stop his stand against the Empire, which Roken promised he would not stop any time soon.\nKawlan Roken was a human male with dark skin and dark hair that included a beard.\nKawlan Roken first appeared in \"Part IV\" of the television series Obi-Wan Kenobi, which premiered on Disney+. He was portrayed by actor O'Shea Jackson Jr. His full name was revealed in the Obi-Wan Kenobi series official Twitter account on June 13, 2022, along with the character's official poster.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hidden_Path",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Jedi",
  "/wiki/Force-sensitive",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Marriage",
  "/wiki/Kawlan_Roken%27s_wife",
  "/wiki/Dark_side_adept",
  "/wiki/Inquisitorius",
  "/wiki/The_Force",
  "/wiki/Hunting",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Tala_Durith",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Planet",
  "/wiki/Jabiim",
  "/wiki/Refugee",
  "/wiki/Hyperspace_route",
  "/wiki/Toy_droid",
  "/wiki/L0-LA59",
  "/wiki/Attack_on_Jabiim",
  "/wiki/Anakin_Skywalker",
  "/wiki/Reva_Sevander",
  "/wiki/Hangar",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Orbit",
  "/wiki/Jedi_General",
  "/wiki/Bowcaster",
  "/wiki/Stormtrooper",
  "/wiki/Transport",
  "/wiki/Hyperdrive",
  "/wiki/Part_IV",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Disney%2B",
  "/wiki/O%27Shea_Jackson_Jr.",
  "/wiki/June_13",
  "/wiki/2022",
  "/wiki/Part_V",
  "/wiki/Part_VI",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Obi-Wan_Kenobi:_A_Jedi%27s_Return",
  "/wiki/Databank_(website)"
 ]
}