{
 "name": "Kay Cavarat",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Marshalls",
      "Republic Marshalls"
     ]
    }
   ]
  }
 ],
 "content": "Kay Cavarat was a Human female Republic Marshall and the chief law enforcement officer of the Belsavis prison during the Cold War and subsequent Galactic War between the Galactic Republic and the reconstituted Sith Empire.\nRepublic Marshall Kay Cavarat was stationed on the planet Belsavis during the Cold War and subsequent Galactic War between the Galactic Republic and the Sith Empire. She was charged with the overall security of the Belsavis prison and reported only to the Senate Security Committee. She was in command of the prison wardens who directed the daily activities of various sections including the minimum security, high security, and maximum security areas. When the Sith Empire sent an attack force to invade the prison, Cavarat did her best to keep control of the prison. Many of her top wardens were killed and the guards had a hard time keeping control with prisoners staging continual riots. Cavarat requested help and Republic troopers with the Republic Special Forces Division were sent to restore order and fight off an Imperial invasion. She also helped the smuggler known as the Voidhound track down the escaped Rattataki crime lord Ivory.\nMarshall Cavarat was known to be a tough cop and ran the prison with brutal efficiency. Cavarat was also attracted to men who were more of the \"bad boy\" type and was more interested in one night stands than long relationships. However, underneath, Cavarat also had a soft heart though she hid it well. Cavarat was dedicated to her job and relished locking up criminals.\nKay Cavarat appeared in Star Wars: The Old Republic, a massively multiplayer online roleplaying game by BioWare released on December 20, 2011. Cavarat is a Republic sided character throughout the Voidhound's missions on Belsavis. She is also a possible love interest if smuggler is male.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Brown",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Marshall",
  "/wiki/Police_officer/Legends",
  "/wiki/Belsavis_prison",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Planet/Legends",
  "/wiki/Belsavis/Legends",
  "/wiki/Senate_Security_Committee",
  "/wiki/Warden/Legends",
  "/wiki/Invasion_of_Belsavis",
  "/wiki/Republic_trooper",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Smuggler/Legends",
  "/wiki/Voidhound",
  "/wiki/Rattataki/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Ivory",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}