{
 "name": "Kayo_Organa",
 "display_name": "Kayo Organa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Elder Houses",
      "House of Organa",
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Duke Kayo Organa was a human male member of the House of Organa. In 9 BBY, he and his family—his wife Celly and son Niano—traveled to visit Celly's sister, Breha Organa, and her family, who lived on the planet Alderaan. While visiting, Kayo enjoyed the food at the Royal Palace and conversed with Breha's husband, Bail.\nDuke Kayo Organa was a human male of the House of Organa who was married to Duchess Celly Organa, sister of Queen Breha Organa of the planet Alderaan. The two had a child named Niano. At some point, Kayo confided in his son that his niece, Princess Leia Organa, was adopted—and therefore, in his eyes, not a \"real\" Organa. He also claimed that her parents kept her a secret by keeping her on her homeworld of Alderaan. In 9 BBY, Kayo and his family visited the family of Celly's sister. Arriving via starship, Kayo, Celly, and Niano greeted Breha's family at a dock and then made their way to the Royal Palace of Alderaan.\nWhile at the palace, Kayo talked with Breha and her husband, Senator Bail Organa, regarding pros and cons of the Galactic Empire versus the Galactic Republic. Kayo was happy that his profits were good, but Bail was more concerned with slave labor and unjust taxation in the Outer Rim Territories; Kayo, on the other hand, was more interested in Bail's food than slaves. Also at the party, Niano restated the claims that his father had made to Leia, who shot back that Niano only repeated his father's words in an effort to gain his respect even if he did not fully understand them. She further explained that Niano did this out of an attempt to make others scared of him, although in reality, he was really scared of his father and others more.\nKayo Organa was more interested in enjoying the profits that the Empire granted him than discussing the issues of the galaxy, encouraging his senator brother-in-law to save such debate for the Imperial Senate. He had black hair, brown eyes, and tan skin.\nKayo Organa appeared in \"Part I,\" the first episode of the live-action series Obi-Wan Kenobi, which premiered on May 26, 2022. In the episode, he was portrayed by Gabe Fonseca, and his name was revealed in the credits. After having grown up with Star Wars, Fonseca was very thankful to casting director Carmen Cuba for the opportunity to act in Obi-Wan Kenobi and wear costumes by costume designer Suttirat Anne Larlarb, work with director Deborah Chow, and work with Bail Organa actor Jimmy Smits. He also noted that he learned a lot from the experience and considered himself lucky for it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Kayo_Organa",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Elder_Houses",
  "/wiki/House_of_Organa",
  "/wiki/File:Bail-Kayo.ogg",
  "/wiki/Duke",
  "/wiki/9_BBY",
  "/wiki/Marriage",
  "/wiki/Celly_Organa",
  "/wiki/Niano_Organa",
  "/wiki/Breha_Organa",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/Foodstuff",
  "/wiki/Royal_Palace_of_Alderaan",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/File:Kayo-Pockets.ogg",
  "/wiki/Queen",
  "/wiki/Youngling",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Eye",
  "/wiki/Parent",
  "/wiki/Homeworld",
  "/wiki/Starship",
  "/wiki/Senator",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Republic",
  "/wiki/Slavery",
  "/wiki/Outer_Rim_Territories",
  "/wiki/File:Kayo-BleedingHeart.ogg",
  "/wiki/The_galaxy",
  "/wiki/Imperial_Senate",
  "/wiki/Hair",
  "/wiki/Part_I",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/May_26",
  "/wiki/2022",
  "/wiki/Gabe_Fonseca",
  "/wiki/Star_Wars",
  "/wiki/Carmen_Cuba",
  "/wiki/Suttirat_Anne_Larlarb",
  "/wiki/Deborah_Chow",
  "/wiki/Jimmy_Smits",
  "/wiki/Category:Audio_files_of_Kayo_Organa",
  "/wiki/Category:Images_of_Kayo_Organa",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/May_27"
 ]
}