{
 "name": "Kazdan_Paratus",
 "display_name": "Kazdan Paratus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Raxus Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aleena"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Robotic arms on his back"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kazdan Paratus was a male Aleena Jedi Master who served the Jedi Order and the Galactic Republic as a General of the Grand Army of the Republic during the Clone Wars. When the Galactic Empire came to power and the Republic and Jedi Order were dissolved, Paratus abandoned his colleagues and fled to the planet Raxus Prime on the Outer Rim of the galaxy. Living in isolation on the junk planet, Paratus slowly descended into madness, attempting to reconstruct the Order from the junk that surrounded him. He was killed by Darth Vader's secret apprentice Galen Marek sixteen years after the Clone Wars ended, and Raxus Prime was subsequently annexed by the Empire.\nA Force-sensitive Aleena, Kazdan Paratus was taken to the Coruscant Jedi Temple for training in the ways of the Force by the Jedi Order. During his time at the Temple's academy, Paratus lacked the martial skills of his peers, and instead focused on building machines and tinkering with droids; his lack of social skills troubled his instructors and peers. Following an apprenticeship with a Jedi Master, Paratus surprised his mentors when he successfully passed his Trials of Knighthood through unusual means. Constructing battle droids to assist in the Trials, he passed and was given the rank of Jedi Knight by the Jedi High Council.\nPreferring to remain at the Temple during his tenure as a Knight, Paratus did take the occasional mission, using his battle droids to assist him when conflict arose. He was stationed at the Temple as an instructor at the academy and worked as a member of the Technical division, crafting training droids for the Temple. During this time, he constructed a lightsaber pike with a blue blade.\nWhen the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Paratus could not refuse the opportunity to study the droids of the Confederacy. Paratus served as a General in the Grand Army of the Republic, positioning himself on the front lines, building medical and power droids as well as other machines designed to support the Grand Army. To increase his size and mobility, he designed four mechanical arms to wear on his back. Eventually, he took command of a group of clone troopers that were mostly killed off in a disastrous campaign. Due to these circumstances, he was forced to create his own troops that consisted of combat droids that he assembled using makeshift parts. After a great battle, Paratus returned to the Temple and continued teaching at the academy.\nIt was possibly around this time that Paratus was made a Jedi Master.\nStationed at the Temple in the final days of the war, Paratus was present following the issuance of Contingency Order 66 by the Supreme Chancellor. The order, effectively disbanding the Jedi Order, was a plan by the Dark Lord of the Sith Darth Sidious to trap and destroy the Jedi. When Darth Vader led the 501st Legion against the Temple, Paratus suffered a breakdown and fled in terror from the Temple, leaving his peers and his students to die. He escaped Coruscant in a nondescript freighter with several droid prototypes in tow.\nWracked with guilt over his abandonment of the Jedi, Paratus descended into insanity. Going into hiding on the waste-covered planet of Raxus Prime, he became a reclusive droid maker. Paratus built an army of personally customized combat droids to protect himself from intruders, creating massive droids and sentries held together by the Force. In his attempt to rebuild the Jedi Order, Paratus built a replica of the Coruscant Jedi Temple out of refuse and made puppets of all the High Councilors for the Council Chamber, arming them with various melee weapons. In his delusional state, Paratus would hold mock Council meetings, vowing to protect them from harm.\nApproximately 16 years after the collapse of the Jedi Order, the insane Jedi was discovered by Darth Vader who sent his secret assassin, Starkiller, on a mission to eliminate the Aleena Jedi. Paratus noticed his ship landing and consulted a metallic effigy of Grand Master Yoda as to this matter and grew nervous after his silent \"answer,\" moving his lightsaber from hand to hand.\nAfter navigating the junk world, the assassin arrived in Paratus's facsimile Temple and was confronted by a Titan armed with two large vibro-axes and a variety of weapons tipping its other arms. The Sith apprentice dodged blows from the junk warrior, and as the floor buckled under the Titan's weight, knocked off one of its weapons with a telekinetic punch. Dodging another attack by the golem, slicing as he went, Starkiller removed more of its weapons. He rolled through the machine's legs and cut up its spine, scoring a deep blow.\nThe crippled machine attempted to turn at the man, but he used his lightsaber to cut at both its vibro-axe arms, forcing it to drop one axe. He sent a barrage of lightning at the machine, sending all the strength he could muster at it. Its photoreceptors became nonfunctional, though it still charged at Marek with its other axe. The apprentice used the Force to push the creature, knocking it off one of its legs through the walls of the Temple, following it and finally bringing it down in a junk version of the High Council Chamber of the Jedi Temple with junk effigies of the late or missing Council members.\nFrom a hatch in the machine's front emerged the Jedi Master that Starkiller had been searching for. Paratus swore he would protect the \"Masters\" and the mannequins began to stir, distracting the apprentice. Paratus lunged at the invader, slightly scoring a cut down Starkiller's left arm before it was parried. Though the assassin fought back, every move he made was either blocked almost instantly by the Aleena's lightsaber pike or missed because of the Jedi's constant hopping from place to place. During the battle, Starkiller was suddenly struck from behind and his lightsaber fell from his hand.\nConfronted by a replica of Master Plo Koon standing behind him in a Form V stance, a vibroblade in place of his lightsaber. After a moment of surprise, Starkiller used the Force to blow apart the patchwork tribute and regained his lightsaber, deflecting a blow from the recovered Paratus. More \"Masters\", including Obi-Wan Kenobi, Yoda, and Anakin Skywalker attempted to face the apprentice, but all were destroyed. With each \"death,\" Paratus clasped his chest deeper in pain and despair at their loss, crying out when the last one, Master Agen Kolar, fell.\nThe old Jedi then attempted a telekinetic assault, but the Sith apprentice fought back, catching the massive chunk of machinery Paratus used and throwing it back. Paratus dodged, leaping onto the narrow window struts above the chamber floor, with Marek in pursuit. Starkiller, worried that he might experience another vision as he had while dueling Rahm Kota, intensified his attack, battering Paratus with debris and detritus. The two exchanged blows on the ledge, until Paratus suddenly retreated and fired a blast of Force energy at the dark sider. Starkiller blocked and rebounded it, slamming Paratus into one of the support struts. The Aleena retreated to the chamber floor and again attempted a telekinetic assault, casting another massive chunk of machinery at the assassin. However, Starkiller again caught it and threw it back, sending it crashing into the Jedi Master, crushing him against the chamber floor and mortally wounding him.\nAs he lay dying, Paratus uttered his last words, apologizing to the 'Masters' for failing them again. Paratus then became one with the Force and his body disappeared in a flash. Starkiller took Paratus' lightsaber and left the ruined temple.\nAfter Paratus' death, Starkiller claimed Paratus's lightsaber pike as a gift for his master, as other than being snapped in half, it had survived the ordeal it had gone through when Paratus was crushed. Although he took the damaged weapon to his quarters and attempted for an hour to repair it, he was unsuccessful in restoring the weapon as he could not realign the lightsaber crystals to the lens and failed to connect the emitter matrix to the power conduit.\nLater, Darth Sidious learned about Darth Vader's secret apprentice and their plan to kill him. Palpatine had his spies follow the Rogue Shadow to the Executor, Darth Vader's still uncompleted flagship. The Emperor boarded and told Vader to kill the apprentice, at which he reluctantly complied, impaling Starkiller, using the Force to throw him around the room, and finally out of a viewport into the vacuum of space. While he floated there, drifting in and out of consciousness, he experienced numerous visions of past and future events, including one of Paratus worriedly watching the Rogue Shadow land on the surface of Raxus Prime.\nAfter Paratus' death, Raxus Prime was left defenseless, as Paratus' droids had protected the planet during his lifetime. Drexl Roosh was angered by Paratus' death as the droids kept the Empire at bay for many years. Although Rodian scavengers remained on the planet for some time, the Empire soon took over the planet, stripping its metals to create Star Destroyers, leaving little for scavengers to obtain. The metals and ores taken from the planet after Paratus' death were used in orbiting construction facilities, such as the one Starkiller later destroyed using an ore cannon.\nAs a young Jedi, Paratus was more antisocial than some Padawans, preferring to hole himself up in his personal quarters to work upon his droids than to socialize. Not possessing the detachment of most Jedi, Paratus created the droids originally to aid with training Padawans in the Temple, and managed to pass his trials not through physical prowess with a lightsaber, but with intelligence. However, when Order 66 was initiated, and Operation: Knightfall subsequently occurred, Paratus fled the Jedi Temple in an act of his own perception of cowardice, leaving his comrades to their fate at the hands of Darth Vader and the 501st Legion.\nAfter abandoning the Jedi at the Temple on Coruscant, Paratus was consumed by guilt, which would eventually lead to madness. The initial stages of his insanity caused Paratus to form an inferiority complex regarding his small size, prompting him to construct the four mechanical limbs he kept strapped to his back to provide him with the desired height and mobility. The next stage of his madness caused him to fall into a delusion of being a member of the Jedi Council, which in turn motivated him to construct the replica of the Jedi Temple out of the abundant debris on Raxus Prime. By the time Paratus faced Marek in combat, the Aleena Jedi was past the brink of schizophrenia, as shown by how he reconstructed all the Jedi Council members out of junk and believing them to be the actual individuals.\nDue to a special robotic rig on his back which served as additional limbs for him, Paratus was able to walk on walls and vertical surfaces. A Shien practitioner, Paratus handled his lightsaber pike with two of his mechanical limbs, allowing him to wield his chosen weapon with great dexterity, as shown by the way he mounted almost continuous attacks upon Starkiller during their duel. He was also able to use his lightsaber staff to block the various counter-attacks utilized by Starkiller. He appeared to know the lightsaber form of every member of the Jedi Council who was present by the end of the Clone Wars; he used that intimate knowledge via the Force to imbue on the mannequins of those Council members, causing them to mimicking each individual fighting style.\nAdept with the Force, Paratus had a great level of control over his droid creations, and was capable of giving life to robotic creations that were subject to his will. He was capable of making such creations like the Junk Titan in a short span of time and with ease. With his death, all of the junk creatures he created collapsed. In combat, Paratus had the ability to suspend himself in mid-air and to hurl objects at an opponent using the Force, as he demonstrated against Starkiller.\nKazdan Paratus was voiced by Larry Drake in The Force Unleashed video game.\nKazdan Paratus wields a blue lightsaber pike in the Xbox 360 and PlayStation 3 versions of the game, but a yellow lightsaber pike in the Nintendo DS version, and a yellow double-bladed lightsaber with an elongated hilt in the Wii, PlayStation 2, and PlayStation Portable versions. The novelization also describes his lightsaber staff as having two blades, one significantly shorter than the other.\nParatus' death also plays out differently in the Wii and PS2 versions; instead of crushing him with junk as in the PS3 and Xbox 360 version, Starkiller smashes him against a wall before finishing him off with Force lightning.\nKazdan Paratus does not appear in the graphic novel adaptation of The Force Unleashed. In The Force Unleashed Campaign Guide, Paratus is depicted as having a yellow Long-handle lightsaber.\nFor some reason Shaak Ti isn't among Kazdan's junk Jedi Council in the PlayStation 3 version of the game. This may be a reference to the Aleena Jedi Master Tsui Choi, who was supposed to take Shaak Ti's seat on the Council before it was decided that she wouldn't die at the hands of General Grievous.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Raxus_Prime/Legends",
  "/wiki/Aleena/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/First_mission_to_Raxus_Prime",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Galen_Marek",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Droid/Legends",
  "/wiki/Jedi_instructor",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Technical_division/Legends",
  "/wiki/Jedi_Training_Droid",
  "/wiki/Lightsaber_pike/Legends",
  "/wiki/Blue",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Medical_droid/Legends",
  "/wiki/Power_droid/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Operation:_Knightfall",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Scrap_Guardian",
  "/wiki/Junk_Titan",
  "/wiki/Junk_golem",
  "/wiki/Junk_Temple",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Photoreceptor/Legends",
  "/wiki/High_Council_Chamber",
  "/wiki/Shiim/Legends",
  "/wiki/Sun_djem/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Form_V/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Agen_Kolar/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Emitter_matrix/Legends",
  "/wiki/Rogue_Shadow",
  "/wiki/Executor/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Shiak",
  "/wiki/Viewport/Legends",
  "/wiki/Drexl_Roosh",
  "/wiki/Rodian/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Ore_cannon",
  "/wiki/Schizophrenia",
  "/wiki/Kazdan_Paratus%27s_lightsaber_pike",
  "/wiki/Larry_Drake",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/Xbox_360",
  "/wiki/PlayStation_3",
  "/wiki/Nintendo_DS",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Wii",
  "/wiki/PlayStation_2",
  "/wiki/PlayStation_Portable",
  "/wiki/Force_lightning/Legends",
  "/wiki/Star_Wars:_The_Force_Unleashed_(comic)",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Tsui_Choi",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Category:Images_of_Kazdan_Paratus",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/The_Force_Unleashed_II_(novel)",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Force_Unleashed",
  "/wiki/The_Force_Unleashed_(Star_Wars_Miniatures)",
  "/wiki/Wizards.com",
  "/wiki/The_Force_Unleashed_Preview_2:_Maris_Brood_and_Kazdan_Paratus",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Insider",
  "/wiki/Classic_Moment",
  "/wiki/Star_Wars_Insider_140",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.47",
  "/wiki/Star_Wars:_The_Clone_Wars_Magazine_19",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars:_The_Force_Unleashed:_Prima_Official_Game_Guide"
 ]
}