{
 "name": "Kazen Harn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Kazen Harn was a Human male medical professional and scientist who worked at the Mos Eisley Medical Center on the Outer Rim world of Tatooine during the time of the Galactic Civil War. Sometime following the Battle of Yavin in 0 BBY, Harn met with a spacer directed to him by Trehla Keelo, a street-smart native of Mos Eisley who would aid individuals in finding suitable professional work. Harn taught the spacer some of the basics about medical work, and bestowed to the individual a stimpak to help the individual along in their travels.\nA Human male medical professional and scientist by the name of Kazen Harn lived during the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. By the time following the Battle of Yavin, Harn worked at the Mos Eisley Medical Center, a hospital located in the city of Mos Eisley on the Outer Rim Territories desert planet of Tatooine.\nThe street-smart Trehla Keelo, a Human female native of Mos Eisley, took it upon herself to aid travelers in finding suitable professional work. She directed one particular spacer to meet with Kazen Harn and deliver to him a viewscreen. Harn accepted the viewscreen from the intrepid spacer, and then went on to explain to the individual some basic information regarding medical work. Specifically, Harn explained to the spacer that physical damage could be remedied through the use of bacta shots. He also explained that stimpaks could be used for a quick shot of healing, even in the absence of medical training. To aid the spacer in their travels, Harn provided to the spacer one such stimpak to help them along. However, Harn also cautioned that more serious damage would result in wounds that could only be remedied by spending time in medical center or by accepting the services of a trained doctor. He urged the spacer to familiarize themselves with proper healing techniques before going out to hunt. The spacer thanked Harn for his enlightening counsel, and returned to Trehla Keelo to seek out additional assignments.\nKazen Harn had fair skin, and brown colored eyes. As a professional, Harn was knowledgeable about medical technology, including bacta shots and stimpaks, which he was more than willing to share with others.\nKazen Harn was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.\nWith the release of Publish 17.0 on May 26, 2005, Kazen Harn was included as part of a simple New Player Tutorial quest titled \"Time for a Break\". In the quest, players were tasked by Trehla Keelo to deliver a viewscreen to Harn in Mos Eisley. Upon doing so, Harn would offer the player brief information regarding how to heal wounds and damage. He would then provide the player with a stimpack A device as a reward. Although the player could lose the viewscreen or choose not to complete the quest, this article assumes 100% game completion. Because Harn spawned under the generic \"scientist_human_male\" template, his graphical appearance was randomized under one of two possible Human male depictions. Because both depictions portrayed Harn with fair skin and brown eyes, this article considers those specific attributes to be canon in the Star Wars Legends continuity. Following the release of Publish 25's New Game Enhancements on November 15, 2005, the New Player Tutorial was revamped, and Trehla Keelo was updated to tie into the newly introduced expansive Legacy Quest series. Because of these changes, the quest involving Harn was removed, but he could still be found inside the Mos Eisley Medical Center and briefly interact with players.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Medic/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Mos_Eisley_Medical_Center",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Trehla_Keelo",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Stimpak",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/City/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Canon",
  "/wiki/Viewscreen/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Eye/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/May_26",
  "/wiki/2005",
  "/wiki/Star_Wars",
  "/wiki/November_15",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience"
 ]
}