{
 "name": "Kazic_Pendre",
 "display_name": "Kazic Pendre",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pendretronics",
      "Chirq Council"
     ]
    }
   ]
  }
 ],
 "content": "Kazic Pendre was a Human male businessman and criminal who lived on the planet Corellia during the time of the Galactic Civil War.\nBy the time following the Battle of Yavin, Kazic Pendre was the owner of Pendretronics, an engineering company based in Doaba Guerfel. Beyond his legal activities, Pendre was also a high-ranking member of the criminal organization known as the Chirq Council. Within the criminal group, Kazic Pendre had several people under his orders, including Trins Evnar, and reported only to the underboss Jzoro Quanera.\nIn 1 ABY, the Corellian Security Force started an investigation against the Chirq Council following the increase of ryll traffic on Corellia. Captain Vitala Baize decided to infiltrate the organization with a CorSec agent using the identity of Pendre's henchman, Trins Evnar. In order to permit the infiltration mission, an independent spacer who previously worked for the CorSec killed Trins Evnar, as well as every other Chirq Council criminals who used to know him, including Kazic Pendre. The CorSec agent later assumed Evnar's identity towards the underboss Jzoro Quanera and managed to infiltrate the organization. The CorSec operation eventually led to the destruction of the Chirq Council.\nAround the same time, an engineer by the name Shobbo Durron designed a power cell that was more efficient and potentially cheaper to manufacture than those on the market. Just prior to his death, Kazic Pendre stole Durron's design notes and her schematic for the benefit of his own company, Pendretronics. Shobbo Durron later hired a spacer to recover her power cell schematic from Pendre. The spacer entered the Pendretronics headquarters and sliced Kazic Pendre's data terminal, successfully recovering the data.\nKazic Pendre was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Kazic Pendre was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Pendretronics",
  "/wiki/Chirq_Council",
  "/wiki/Captain/Legends",
  "/wiki/Vitala_Baize",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Shobbo_Durron",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Doaba_Guerfel/Legends",
  "/wiki/Trins_Evnar",
  "/wiki/Jzoro_Quanera",
  "/wiki/Corellian_Security_Force",
  "/wiki/Ryll/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}