{
 "name": "KD-121",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "KD-121 was a Human Male who served as a stormtrooper of the Galactic Empire during the Galactic Civil War.\nAfter the Battle of Yavin, scout trooper KD-121 was stationed at the Imperial Research and Prison Facility on the planet Dathomir, along with fellow stromtroopers GT-643 and HX-138.\nIn 1 ABY, an accident took place in the Imperial Research and Prison Facility. The Blackwing virus that was studied there escaped containment and decimated most of the people in the area, turning them into starving undead creatures. In response, the Galactic Empire promptly established a Quarantine Zone to contain the infection. KD-121, GT-643, and HX-138 were part of a contingent of stormtroopers who appeared to be immunized to the virus. They survived the outbreak but were trapped in the Quarantine Zone like other survivors. The stormtroopers and the other refugees created a makeshift camp, designated as Camp Epsilon, in order to to repel the regular assaults of the zombies and try to live in safety while waiting for an evacuation. Those other survivors included the former prisoner Zsu Val, the technician Sogan Varga, the mechanic Nils Cridmeen, and the Inquisitor Klex Fulgor. In fact, Camp Epsilon was very unsafe since it was located in the courtyard of the Imperial Research and Prison Facility, the place where lived the most dangerous undeads. However, the camp was established around a Lambda-class shuttle, the last starship in the area that was not destroyed during the outbreak. The ship was damaged and unable to fly but Nils Cridmeen and the stormtroopers expected to fix it in order to allow the survivors to escape the Quarantine Zone.\nA group of spacers visited Camp Epsilon during their journey in the Quarantine Zone. They assisted the stormtroopers in rescuing some survivors and finding parts to fix the shuttle. The spacers later left Camp Epsilon to enter the Imperial Research and Prison Facility in order to recover a sample of the Blackwing virus. The spacers survived to their mission and finally came back to Camp Epsilon. In the meantime, Nils Cridmeen was able to fix the Lambda-class shuttle. The refugees of Camp Epsilon and the spacers eventually escaped the Quarantine Zone altogether with the repaired shuttle.\nKD-121 was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. KD-121 was added to the game with the \"Game Update 14\", a.k.a. the \"Death Troopers\" update, released on October 12, 2009.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gray",
  "/wiki/Blue",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Trig_Longo",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Liam_Waurie",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Scout_trooper/Legends",
  "/wiki/Imperial_Research_and_Prison_Facility",
  "/wiki/Dathomir/Legends",
  "/wiki/GT-643",
  "/wiki/HX-138",
  "/wiki/Camp_Epsilon",
  "/wiki/Quarantine_Zone_(Dathomir)",
  "/wiki/1_ABY/Legends",
  "/wiki/Blackwing_virus_outbreak_on_Dathomir",
  "/wiki/Imperial_bioweapons_Project_I71A",
  "/wiki/Zombie/Legends",
  "/wiki/Zsu_Val",
  "/wiki/Sogan_Varga",
  "/wiki/Nils_Cridmeen",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Klex_Fulgor",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Starship/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/October_12",
  "/wiki/2009",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}