{
 "name": "Ke Daiv",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Batorine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "29 BBY",
      "Zonama Sekot"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Blood Carver"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Ke Daiv was a male Blood Carver assassin who lived during the waning years of the Galactic Republic. In the service of Wilhuff Tarkin, and dispossessed by his own people, he had the unfortunate distinction, in 29 BBY, of being the \"first personal kill\" of Anakin Skywalker, then a 12-year-old Jedi Padawan on a mission to Zonama Sekot with his Master, Obi-Wan Kenobi.\nAn orphan, Daiv was adopted into the family of one of the last Blood Carver clans. The clan leader commanded Daiv to take the son of his benefactor on a ritual feragriff hunt on one of Coruscant's moons, despite the fact it was prophesied he would die of a head wound. Daiv accidentally killed the young Blood Carver with a stray shot to the head, for which he was exiled from his tribe.\nHe was hired by dissident members of the Trade Federation to kill Jedi Padawan Anakin Skywalker for his role in the Battle of Naboo. In 29 BBY, he very nearly killed Anakin during a Pit race in the Wicko District Garbage Pit. However, Anakin's mentor, Jedi Knight Obi-Wan Kenobi, arrived just in time to foil his attempt to kill Anakin. Ke Daiv barely managed to escape from the encounter with his life. Shortly after Daiv's failure to kill Anakin during the garbage pit race, Wilhuff Tarkin sent him to Zonama Sekot with Raith Sienar, with orders to kill Sienar if he deviated from Tarkin's plan. However, Sienar convinced Daiv to ignore Tarkin's orders, and sent him to buy one of Zonama Sekot's organic starships. The Seed-partners rejected him, so instead he kidnapped Skywalker and a young native girl, Jabitha. He threatened Jabitha's life in order to force Skywalker to take him on his own Sekotan starship. During this time, Tarkin launched his attack on the planet. Daiv forced Skywalker to fly to the Magister's Palace to refuel the ship. Once there, Skywalker, weaponless, killed Daiv by the sheer power of the Force, an action he regretted.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Batorine",
  "/wiki/29_BBY/Legends",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/Blood_Carver",
  "/wiki/Gender/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Assassin/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Feragriff",
  "/wiki/Coruscant/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Pit_racing",
  "/wiki/Wicko_District_Garbage_Pit",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Raith_Sienar/Legends",
  "/wiki/Sekotan_Personal_Starship",
  "/wiki/Seed-partner",
  "/wiki/Jabitha_Hal",
  "/wiki/Jabitha",
  "/wiki/Second_Battle_of_Zonama_Sekot",
  "/wiki/Magister%27s_Palace",
  "/wiki/The_Force/Legends",
  "/wiki/Rogue_Planet",
  "/wiki/Anakin:_Apprentice",
  "/wiki/Star_Wars:_The_Clone_Wars_(novelization)",
  "/wiki/Star_Wars:_The_Clone_Wars_(audiobook)",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_III:_Reunion",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_Jedi_Order",
  "/wiki/Star_Wars_Insider_62",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}