{
 "name": "Keal Roscon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "The Shield"
     ]
    }
   ]
  }
 ],
 "content": "Keal Roscon was a Sullustan pilot and was a member of The Shield around 0 BBY. He was also secretly a member of the Rebel Alliance.\nKeal began his career with the Sullustan Home Guard, but his situation was short-lived as he could not keep himself out of trouble while he was off-duty. He left his homeworld and found employment with a number of other transportation corporations before meeting Peert Ginzork and signing on with The Shield. The Shield was a private security company that was secretly a front for the Rebel Alliance.\nRoscon was a male Sullustan known for his daring  tactics. He was a quiet one, unless the subject of space travel came up, in which case he became very excited and began to endlessly relay tales about famed smugglers and pilots.\nRoscon was a decent pilot for both space transports and archaic starfighters. He was also skilled at astrogation and operating ship's sensors. He was an experienced spacer and was a decent combatant with both blasters and brawling.\nRoscon carried a heavy blaster pistol that had a hair trigger on it. He also wore a blast vest and carried a hold-out blaster, a comlink, a datapad and a micronite explosive charge.\nKeal Roscon was designed by Rick Olshak for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/The_Shield",
  "/wiki/Pilot/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Sullustan_Home_Guard/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Peert_Ginzork",
  "/wiki/Smuggler/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Blast_vest",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Explosive_charge",
  "/wiki/Rick_Olshak",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Vilardi"
 ]
}