{
 "name": "Kedar Blackgate",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sacorria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Kedar Blackgate was a male Human who served as the warden of Dorthus Tal Prison. He was a fierce upholder of Sacorrian law. He had short black hair, a trimmed beard and goatee. Blackgate had a pair of loyal massiff pets that he named Emperor and Merciless.\nKedar Blackgate was born on the planet Sacorria, an agriworld colonized by the Corellian Empire, and was raised in a privileged family. He joined the Sacorrian military at a young age. He quickly got promoted to the rank of colonel.\nDuring the Rebellion era, Blackgate became the warden of Dorthus Tal Prison following a prison riot that was mishandled by the facility's previous warden. Blackgate assumed command of the prison with zeal, he installed various innovative programs to prevent further riots. Although his methods were more benevolent than those of his predecessors, most prisoners lived in constant fear of him. He treated and disciplined them like they were his own children, he cared for their basic needs and was enforcing a strict regimen of diet and exercise. He didn't tolerate prisoner abuse and could put even the most hardcore criminal in his place with his icy glare. He held the position of the warden of Dorthus Tal Prison for several years following the Battle of Endor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sacorria",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Dorthus_Tal_Prison",
  "/wiki/Massiff/Legends",
  "/wiki/Emperor_(massiff)",
  "/wiki/Merciless_(massiff)",
  "/wiki/Planet/Legends",
  "/wiki/Agriworld/Legends",
  "/wiki/Corellian_Empire",
  "/wiki/Colonel/Legends",
  "/wiki/Rebellion_era",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Coruscant_and_the_Core_Worlds"
 ]
}