{
 "name": "Kee_(Devaronian)",
 "display_name": "Kee  (Devaronian)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Crew of the Grinning Liar"
     ]
    }
   ]
  }
 ],
 "content": "Kee was a female Devaronian smuggler copilot and mechanic onboard the Grinning Liar, a YX-1980 space transport belonging to the Wookiee Chak. She enjoyed taking mechanical things apart just for the joy of reassembling them and specialized in micro/biocircuitry.\nWhen Cade Skywalker visited Rik's Cantina on Coruscant in 137 ABY, she threatened him with a blaster pistol, hoping he could reveal where her former crew members, Jariah Syn and Deliah Blue had absconded with the Grinning Liar, which they had rented after leaving Cade's employ. Unfortunately, Cade was unable to help her or Chak, though he made a joking pass at her.\nAfter Cade became enthralled to the Sith, Kee along with Chak joined the crew of the Mynock in Cade's rescue as a necessary step to reaquiring the Grinning Liar which had somehow ended up in the hands of Rav.\nKee, along with Chak, Deliah Blue, and Jariah Syn, were later hired by Morrigan Corde to help rescue Cade, who was her son. She assisted Syn in attaching miniature cameras to Yuuzhan Vong bugs Corde obtained from the Empire. After three weeks, when they finally managed to locate Cade and his attempt to escape the Temple of the Sith, Kee commented on how he is \"chucking Darth Hottie out the airlock.\nKee flew with Chak, Corde, Blue and Syn in the Mynock over the Temple. She made a sarcastic joke about one of the craziest things Syn has ever done. The mission ended in Cade's escape from the Sith.\nShe later accompanied Chak, Cade, and Syn in an attempt to get the Grinning Liar back from Rav. After retrieving the ship, she wished Cade well and asked him to say goodbye to Blue for her. When he told her that the two weren't interacting, the Devaronian called him a nerfherder and encouraged him to talk to her.\nJan Duursema, the main penciller behind the Legacy comics in which Kee first appeared has stated that Kee is in no way related to Vilmarh Grahrk.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kee",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Grinning_Liar",
  "/wiki/Morrigan_Corde",
  "/wiki/Smuggler/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Technician/Legends",
  "/wiki/YX-1980_space_transport",
  "/wiki/Wookiee/Legends",
  "/wiki/Chak_(Wookiee)",
  "/wiki/Cade_Skywalker",
  "/wiki/Rik%27s_Cantina/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/137_ABY",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Jariah_Syn",
  "/wiki/Deliah_Blue",
  "/wiki/One_Sith",
  "/wiki/Rav",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Temple_of_the_Sith",
  "/wiki/Darth_Talon",
  "/wiki/Airlock/Legends",
  "/wiki/Nerf_herder/Legends",
  "/wiki/Jan_Duursema",
  "/wiki/Vilmarh_Grahrk",
  "/wiki/Legacy_(2006)_14",
  "/wiki/Legacy_(2006)_16",
  "/wiki/Legacy_(2006)_17",
  "/wiki/Legacy_(2006)_18",
  "/wiki/Legacy_(2006)_19",
  "/wiki/Legacy_(2006)_23",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}