{
 "name": "Keela Egast",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 49 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Naboo Security Forces",
      "Naboo Royal Space Fighter Corps",
      "Echo Flight",
      "Naboo Royal Space Fighter Corps",
      "Echo Flight",
      "Echo Flight"
     ]
    }
   ]
  }
 ],
 "content": "Keela Egast was a Human female pilot in the Naboo Royal Space Fighter Corps' Echo Flight.\nIn 33 BBY, she, along with twelve other pilots, was chosen to participate in a battle over Station TFP-9 which was under attack by pirates in Z-95 Headhunters coming from a Hornet-class carrier. She would fly in a N-X Police Cruiser as Echo Eight. She would be watched over by Bravo's Seven, Essara Till, and Bravo Eight, Dren Melne, who secretly sought to steal her cruiser along with a couple of others and two N-1 starfighters for Governor Challep of Agamar.\nOnce the fighters arrived, both squadrons engaged the first squadron of Z-95s and were easily dealt with, however, her flight group was soon was attacked by another squad of Z-95s armed with concussion missiles which was followed by Captain Sorran of the second carrier Velumina who demanded their surrender. It was then Dren Melne betrayed both Till and Echo flight and engaged both Echo One, Evenyl Yob, and Two, Kerl. Dren promised to spare the lives of the pilots if they surrendered their fighters, but Keela called him out on what she initially thought was Kerl's death and continued to fight until her cruiser was soon disabled by Dren and was out of contact, but ultimately the battle ended in victory after it became clear that Dren was unable to deliver his promise and was killed by Sorran. She was one of Echo Flight's five pilots who survived when technicians recovered her fighter and received medical treatment. Essara Till then gave her name, along with Rhys Dallows and Evenyl Yob to Ric Olié as a recommendation for a position in Bravo Flight.\nAlthough Keela was barely able to fit in her flight suit and spoke in a soft voice during the briefing, her knowledge about different models of Z-95 Headhunters meant that only experience pilots like Till had the answer to questions regarding fighters. Despite her young age and little experience she had a strong edge in her voice when calling out Dren for attacking his own forces. She refused to give in the fight, only being disabled by Dren Melne near the end stages of the battle.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Keela",
  "/wiki/Naboo/Legends",
  "/wiki/49_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Naboo_Royal_Space_Fighter_Corps/Legends",
  "/wiki/Echo_Flight",
  "/wiki/Pilot/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Battle_at_TFP-9",
  "/wiki/Station_TFP-9",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Hornet-class_carrier",
  "/wiki/N-X_Police_Cruiser/Legends",
  "/wiki/Echo_Eight_(Echo_Flight)",
  "/wiki/Bravo_Flight/Legends",
  "/wiki/Bravo_Seven",
  "/wiki/Essara_Till/Legends",
  "/wiki/Bravo_Eight",
  "/wiki/Dren_Melne",
  "/wiki/N-1_starfighter/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Challep",
  "/wiki/Agamar/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Concussion_missile/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Sorran",
  "/wiki/Velumina",
  "/wiki/Echo_One",
  "/wiki/Evenyl_Yob",
  "/wiki/Echo_Two",
  "/wiki/Kerl",
  "/wiki/Technician/Legends",
  "/wiki/Rhys_Dallows",
  "/wiki/Ric_Oli%C3%A9/Legends",
  "/wiki/Flight_suit/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Starfighter_Trap",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}