{
 "name": "Keeramak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lwhekk"
     ]
    },
    {
     "name": "Died",
     "values": [
      "28 ABY",
      "Bakura"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ssi-ruuk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Genderless"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ssi-ruuvi Imperium",
      "P'w'eck Emancipation Movement"
     ]
    }
   ]
  }
 ],
 "content": "The Keeramak was a mutant Ssi-ruu who possessed all the colors of the Ssi-ruuvi castes: gold, blue, yellow, red, black, green, and brown.\nIt was born from a union between two Ssi-ruuk of different colored scales. The Keeramak had no gender and had an abnormal size for a Ssi-ruu. Its birth sent shock waves throughout the Ssi-ruuvi Imperium and fulfilled a Ssi-ruuk prophecy from the sacred text known as G'nnoch that one born with many colors would free the oppressed lower castes—particularly the brown scaled Ssi-ruuk, which were born from a union between two Ssi-ruuk from different castes, and the lowly P'w'ecks.\nThe Ssi-ruuk adored the Keeramak and raised it like a king. The Keeramak was wise, intelligent and powerful in combat. It argued with the Shreeftut over the limits of power, it challenged the powerful religious Conclave on Ssi-ruuvi religion and rivaled the Elders' Council in law. Eventually, the Keeramak was elected Shreeftut.\nThe Ssi-ruuk had intended to reconquer Bakura and rename it Xwhee, consecrating it as a Ssi-ruuvi homeworld and use it as a staging base to attack the galaxy with their newly improved entechment power. The Keeramak would deceive the Bakurans by telling them that the P'w'ecks had overthrown the Imperium and had come to sign a peace treaty with them. This plan however backfired when the P'w'eck Lwothin shot and killed the Keeramak and the P'w'ecks really did revolt, due to the Elder's Council accidentally predicting this very event. The body was sent back to Lwhekk after the battle, in an attempt to appease the Conclave, as well as agitate the Elders' Council. Molierre Cundertol stole the shuttle and took it to a meeting place with General E'thinaa.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Keeramak",
  "/wiki/Lwhekk/Legends",
  "/wiki/28_ABY/Legends",
  "/wiki/Bakura/Legends",
  "/wiki/Ssi-ruu",
  "/wiki/Gender/Legends",
  "/wiki/Ssi-ruuvi_Imperium",
  "/wiki/P%27w%27eck_Emancipation_Movement",
  "/wiki/Lwothin",
  "/wiki/C-3PO/Legends",
  "/wiki/Mutant",
  "/wiki/G%27nnoch",
  "/wiki/P%27w%27eck",
  "/wiki/King/Legends",
  "/wiki/Shreeftut",
  "/wiki/Conclave",
  "/wiki/Ssi-ruuvi_religion",
  "/wiki/Elders%27_Council",
  "/wiki/Entechment",
  "/wiki/Molierre_Cundertol",
  "/wiki/General/Legends",
  "/wiki/E%27thinaa",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_II:_Refugee",
  "/wiki/Star_Wars_Insider",
  "/wiki/Or_Die_Trying",
  "/wiki/Star_Wars_Insider_75",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/The_Unknown_Regions",
  "/wiki/14_ABY/Legends"
 ]
}