{
 "name": "Keerin_Fionn",
 "display_name": "Keerin Fionn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 230 BBY",
      "Banchii"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Lily Tora-Asi"
     ]
    }
   ]
  }
 ],
 "content": "Keerin Fionn was a human male Jedi Padawan who was the apprentice of Jedi Knight Lily Tora-Asi during the High Republic Era. Along with his master, Fionn was stationed at the Jedi Temple on Banchii.\nA member of the Jedi Order, Keerin Fionn was selected to be the Padawan of Jedi Knight Lily Tora-Asi and assigned to the newly constructed Jedi Temple on the frontier world, Banchii. Under the leadership of Jedi Master Arkoff, the Banchii Jedi were tasked with assisting the newly founded settler village around the Temple, and exploring the planet and mapping its terrain. Along with Jedi Initiates Viv'nia and Nima, Fionn and his master would travel into the surrounding forests looking for native flora and fauna to add to the Temple Archives, under the stewardship of Jedi archivist Ru-Ru. During one such mission, the group of young Jedi discovered that Banchii had native inhabitants, small bird-like beings that lived in caves in the surrounding regions. While Fionn was quick to draw his lightsaber when the Banchiians caught Nima in a rudimentary trap, Tora-Asi used the moment to teach her student the importance of patience and the need to respect the lightsaber and not wield it recklessly.\nIn the wake of the Great Hyperspace Disaster and the emergence of the Nihil as a galactic threat, Fionn remained on Banchii as his master conducted several supply runs between the Temple and the Jedi outpost on Hon-Tallos. Upon his master's return, Fionn and the Initiates greeted her and the refugees she had transported from the planet Ta'klah, before taking the group of settlers on a tour of the Temple and the surrounding settlement. Sometime later, Tora-Asi and Fionn meditated by a pond when the Jedi Knight was beset by a disturbing Force vision. Before they could interpret it, they were joined by the Initiates and Master Arkoff, the latter of whom prompted the Master-Padawan duo to demonstrate their dueling skills for Viv'nia and Nima.\nWhile walking through the village and the surrounding fields, Fionn and his master were informed that Kooba, one of the settlers, had been petrified in his home. While Kooba recovered under the care of Doctor Silar, reports of continued disruption in the village prompted an investigation by Fionn and Tora-Asi. Searching the forest for signs of mischief, the Master and Padawan stumbled upon a disturbing trail of debris heading towards the settlement. Rushing to the aid of the settlers, Fionn and Tora-Asi found several inert bodies scattered among the fields and smoke billowing from the village center. The two Jedi found the source of the attack: a Drengir rampaging through the village, devouring villagers. Engaging the creature, the Drengir grabbed Fionn with one of its appendages, but Tora-Asi used the Force to free him. The two were aided by Master Arkoff, who used his lightsaber to hack at its flailing tendrils, though they just regrew rapidly. Hearing a commotion at the Temple, Tora-Asi and Fionn left Arkoff to deal with the first attacker and sprinted to the aid of the settlers taking refuge in the outpost. Arriving just in time, Fionn and his Master baited the second Drengir and led it out of the Temple, but were confounded by its ability to regrow itself after any attack with their lightsabers. As Ru-Ru and Arkoff kept the Drengir engaged, Fionn helped his Master prepare several oil canisters by the lake in a bid to defeat the Drengir. Luring the creatures to the lake and surrounding them with oil, Fionn set the beasts alight with a torch and watched as they were engulfed in fire.\nIn the wake of the Drengir attack, the Jedi of Banchii believe that a Nihil incursion against their settlement is in the works, and begin to prepare the settlement's defenses. While Master Arkoff is away, Fionn's master takes stewardship of the Temple, leaving the Padawan to oversee the training of the Initiates. Drilling them on lightsaber combat in the yard, Fionn believes that the burden of leadership is weighing heavily on his Master, and offers to carry some of that burden after she snaps at the playful children. When Sav Malagán, the Jedi Master from Takodana arrives with a warning of Nihil threat, Fionn listens as the two older Jedi debate the best course of preparation for such an assault. While Tora-Asi chafed under the disruptive personality of Master Malagán who wishes to arm the villagers and have them fight in their own defense in the impending assault, Fionn did his best to support his master and the works of the settlers as they prepared bunkers to hide in. When an explosion in the work site leads to injuries, Fionn leads the wounded to the Temple for treatment while Tora-Asi is forced to confront the possibility that Malagán is right about the wrongness of her strategy.\nWhen Tora-Asi left to consult with Starlight Beacon on future strategy, Fionn worked with Master Ru-Ru to identify the problem plaguing their communications systems. Discovering that the central computer had been sabotaged in the Temple, Fionn hoped to warn Master Malagán, but the assault was already underway. Drawing his lightsaber in defense of the settlers, Fionn engaged the Nihil directly, with the settlers providing covering fire from the gates of the Temple. As Fionn fought, his master arrived back on Banchii and joined in the fighting. In the confusion, Initiates Viv'nia and Nima disappeared, and Fionn rushed off to locate them and ensure they were safe from the Nihil marauders. Finding the Initiates conferring with Banchiians in the forest, Fionn was followed by Master Malagán who was prepared to support him if they ran into trouble. The four Jedi were led by the natives to a clearing in the forest, where a group of Nihil were conferring over a cannon they had set up to attack the Temple. After the Initiates had been set away, Fionn rejected Malagán's arguments that they should exercise caution and instead rushed into the clearing when the Nihil turned their backs. Holding his blade to the throat of one of the marauders and ordering the others to stand down, Fionn was caught off guard when the Nihil revealed a prisoner: Mr. Zaret from the village. Disengaging his lightsaber and releasing the captive Nihil in exchange for Zaret's life, Fionn was fully exposed when Zaret pulled a blaster and fired a single shot, hitting Fionn's heart and killing him instantly.\nUnable to move fast enough, Malagán sprung from her hiding spot and struck down the Nihil. Joined by Tora-Asi, who had sensed Fionn's death in the Force, Malagán encouraged the young Knight to continue to fight, and not allow grief to cripple her. As the Nihil launched their assault on the Temple itself, the Jedi returned to the Temple determined to fight on in Fionn's memory. Recognizing that the odds were against them, Tora-Asi ordered the Temple emptied before launching missiles into its superstructure to prevent the Nihil from capturing its treasures. With the battle over, the Jedi returned to the clearing to recover Fionn's body. As the other Jedi returned to Coruscant, Tora-Asi remained with Fionn's corpse, picking up his lightsaber and vowing to remain as the protector of Banchii and its natives as a way of celebrating the life of her student.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/230_BBY",
  "/wiki/Banchii",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Lily_Tora-Asi",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Jedi_Knight",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_Temple_(Banchii)",
  "/wiki/Jedi_Master",
  "/wiki/Arkoff",
  "/wiki/Jedi_Initiate",
  "/wiki/Viv%27Nia_Nia%27Viv",
  "/wiki/Nima_Allets",
  "/wiki/Jedi_archivist",
  "/wiki/Ru-Ru",
  "/wiki/Banchiian",
  "/wiki/Lightsaber",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Nihil",
  "/wiki/Hon-Tallos",
  "/wiki/Ta%27klah",
  "/wiki/Force_vision",
  "/wiki/Kooba",
  "/wiki/Doctor",
  "/wiki/Silar",
  "/wiki/Drengir",
  "/wiki/Sav_Malag%C3%A1n",
  "/wiki/Takodana",
  "/wiki/Starlight_Beacon",
  "/wiki/Zaret",
  "/wiki/Coruscant",
  "/wiki/The_Banchiians",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._1",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Nan",
  "/wiki/Graf_family",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/231_BBY",
  "/wiki/Template:OutoftheShadowsDate",
  "/wiki/Destruction_of_Starlight_Beacon"
 ]
}