{
 "name": "Keeve_Trennis",
 "display_name": "Keeve Trennis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Sskeer"
     ]
    }
   ]
  }
 ],
 "content": "Keeve Trennis was a human female Jedi Knight who lived during the High Republic Era. Originally the Padawan of the Trandoshan Jedi Master Sskeer, Trennis rose to the rank of Knight in 232 BBY after saving a city of diminuitive Ximpi on the planet Shuraden from space-faring ridadi. She found herself stationed aboard the newly-christened Starlight Beacon, a Republic space station that stood as a symbol of hope and prosperity in the Outer Rim Territories. Although she had great skills, Trennis harbored feelings of self-doubt while stationed on the Beacon. Nevertheless, she resolved to be the best Jedi she could be while in service to the Order.\nAn investigation Trennis performed with Sskeer, and the bond-twins Terec and Ceret lead them to the world Sedri Minor, where Ceret went missing. Trennis discovered that a boy named Julus was missing too, so Trennis followed Julus' friend Bartol into caverns beneath the planet's surface where they discovered the presence of the Drengir, who were a species of sentient amorphous carnivorous plant-like creatures. Jedi Master Avar Kriss arrived to help them, but then they were approached by Sskeer, who was now mind controlled by the Drengir. Trennis refused to believe that her former master was gone and managed to get through to him. Sskeer used his attachment to the Drengir to push the creatures away fro them with the force.\nA confrontation with the Hutt Cartel lead Sskeer to to almost be overtaken by the influence of the Drengir, but Trennis approached Sskeer and managed to get through to him and help him resist. Sskeer told Trennis to perform a mind touch on him, and therefore convince the Drengir he was connected to that they shouldn't eat people. Trennis did so, and it worked, but it also sent Sskeer into a comatose state. Refusing to give up on Sskeer, Trennis eventually joined him in the Drengir root-mind and together discovered the location of the Great Progenitor, the leader of the Drengir. Trennis suffered horrifying visions because of it, but it allowed the Jedi to perform an assault against the Progenitor, alongside the Hutts, who had made an alliance with the Jedi, which resulted in the capture of the creature.\nThe victory would be short lived as the Republic Fair on Valo was destroyed by the organization of mauraders known as the Nihil during the assault. Believing that the Jedi Council was not doing enough to stop the Nihil, Trennis would form a plan headed by Marshal Avar Kriss that would see Trennis and Terec going undercover within the Nihil. The plan was successful for a short time, until on the planet Xais the Jedi's former ally, the captured Hutt Myarga, revealed Trennis and Terec's true idenities. Trennis and Terec fought back, but would be defeated by Tempest Runner Lourna Dee, who unleashed the Great Leveler on them. Trennis had horrifying and terrifying visions due to the attack, and was left at the mercy of the Nihil until Sskeer and Kriss arrived and rescued her.\nKeeve Trennis underwent training in the ways of the Jedi Order during the High Republic Era, becoming the Padawan of the Jedi Master Sskeer. The two went on dozens of missions together as master and apprentice as the Trandoshan taught Trennis the ways of the Force. After suffering the loss of both his right arm and his fellow Jedi, Jora Malli, at the Battle of Kur, Sskeer took Trennis to the planet Shuraden aboard a Jedi Vector in 232 BBY. Once on the colorful world in the Galactic Frontier, Trennis encountered an inquisitive local, a Ximpi named Kanrii, who excitedly followed her until the Padawan was ambushed by her master, engaging his student in a sparring match. The duel ended with Trennis sending Sskeer hurtling through a tree. The young Padawan helped her master off the ground and confessed that she was confused why he had brought her to this place when she should have been preparing for her Jedi Trials. The Trandoshan revealed to her that they had come to Shuraden for exactly that reason.\nSskeer led her to a place known as the Needles, a group of ancient rock pillars that rose above the planet's surface. After informing her that many individuals had tried and failed to climb the Needles for millennia, the Jedi Master instructed her to scale the pillars and find a Tythonian pendant that he had hung from one of the peaks. Although she questioned how the one-armed man had climbed the supposedly unclimbable, Trennis began her work. She was followed by the winged Kanrii, who curiously wondered how the Jedi could brave the ascension without her own pair of wings. As she reassured the alien that she would be fine, the fragile pillar broke under the weight of Trennis's hands. She drew her lightsaber and stabbed it's blade into the rock, bringing her descent to a halt. Hanging from her lightsaber hilt, Trennis was less than thrilled when a second inquisitive Ximpi, Lekaki, flew up to greet his friend Kanrii. The two tiny beings discussed the Jedi's predicament when a swarm of enormous insects burst through the Needles, killing Lekaki and sending Trennis plummeting to the ground.\nAs she caught her bearings, the insects proceeded to swarm a nearby Ximpi city, throwing its inhabitants into chaos. Trennis chose to abandon her Trial and boarded the Vector starfighter, ignoring her master as he called to her. Landing outside the city, she contacted Jedi Master Estala Maru aboard the Starlight Beacon and informed him of the carnage. He told Trennis that the beasts were a species of star-locust known as ridadi that traveled through space once a generation, though their natural instincts should have caused them to avoid an inhabited world like Shuraden. Reaching out through the Force, Trennis connected with the hive mind of the creatures and realized that the signal of the newly constructed Starlight Beacon had disrupted the ridadi's senses and thrown them off-course. Trennis rigged her Vector to give off the same signal as Starlight and sent it flying off into the atmosphere on autopilot while Maru recalibrated the space station to transmit on a different frequency. Their plan worked, and the ridadi followed the starfighter off into space as Trennis and Kanrii returned to the ravaged city.\nTrennis helped the displaced Ximpi repair their homes, using the Force to lift the stone of their buildings back into place. She was confronted by Sskeer, who questioned her as to the whereabouts of their Vector. Learning that it was gone, he left his Padawan alone with the Ximpi to contact Starlight for the delivery of a transport, causing Trennis to suspect that she was in trouble. On the return trip to the Beacon aboard the Radiant Blessing, the duo stopped at the moon Wevo in the Haileap system, where they rescued the stranded passengers of the Steady Wing, a Galactic Republic ship that had been bombed in a Nihil attack. The passengers included the young Jedi Vernestra Rwoh and Imri Cantaros as well as Avon Starros, daughter of Senator Ghirra Starros.\nThe group then returned to Starlight Beacon, which was scheduled to have its formal dedication very soon. Sskeer brought his Padawan before Jedi Master Avar Kriss, who had just been named marshal of the station. Still believing she was about to be reprimanded, Trennis was surprised when Kriss ignited her lightsaber. The Jedi Master proclaimed Trennis as a Jedi Knight, protector of light in the galaxy. All three attended the dedication ceremony afterwards, where Trennis reflected on her journey thus far. She guessed that Sskeer had somehow known that the ridadi would attack and planned for her to be there to save the Ximpi. As she and every other Jedi present raised their lightsabers to the sky, Trennis shed tears and personally vowed to always uphold light and life.\nSometime later, the Starlight Beacon picked up a faint, scrambled distress signal from the Kazlin system. Trennis was one of a team of Jedi dispatched in a T-1 shuttle to assist, along with her former Master Sskeer as well as Terec and Ceret, Kotabi bond-twins whom Trennis had difficulty distinguishing. Piloting the shuttle, Trennis brought the ship into the star system to discover that the group had been too late: all of the Jedi beheld a ravaged starship with bodies and wreckage floating around it. Trennis and her companions, however, sensed life aboard the vessel, prompting the newly-minted Jedi Knight to bring the shuttle in to dock.\nBoarding through the T-1's docking tube, Sskeer ordered the team to don their rebreathers upon realizing that the ship was filled with noxious gas and slaughtered corpses, which likely meant that the vessel had fallen victim to the Nihil, the group of maruaders that Sskeer had battled at Kur. The Trandoshan ordered Trennis and Ceret to head for the flight deck while he and Terec searched the rest of the ship. As they ventured further into the ship, Trennis began to worry about Sskeer, sensing his unrest and noting his atypical communication with her. She and Ceret soon stumbled upon the corpse of a large Hutt riddled with stab wounds and blaster burns. In another part of the ship, Sskeer and Terec were attacked by a Nihil sniper. As Trennis ran to find them, she found that her former master had not only killed the assassin but also violently mutilated the enemy's remains.\nSskeer left for the planet Sedri Minor with Terec on orders from Marshal Kriss to investigate the origins of a barley crop found aboard the Hutt ship. Worried about her master, Trennis volunteered to go along with Sskeer, but he ordered the young Knight to remain aboard the vessel and tend to Terec's injuries until Kriss and Vernestra Rwoh arrived aboard the Ataraxia. Once the cruiser arrived, Trennis showed Kriss the Nihil's shattered corpse and confessed her worries to the marshal, who realized she should not have sent Sskeer on missions after his trauma at Kur. As they spoke, Terec collapsed into the arms of Jedi Knight Rwoh. The Kotabi had sensed their twin falling victim to an unknown danger on Sedri Minor.\nAfter arriving at Sedri aboard the Ataraxia, Trennis was forced to watch as Terec grew increasingly wild and hostile, frothing at the mouth as they lashed out against Sskeer. The Trandoshan, in turn, struck back, condemning the Kotabi as a mindless fool while Kriss tried to steady the two squabbling Jedi. Feeling helpless, Trennis left the ship and encountered a group of concerned locals who offered her and her companions bread, thinking they may be hungry. In conversation, Trennis was told that several settlers had recently disappeared, including a young Rodian boy named Julus. The boy's mother confessed that some considered Sedri Minor to be cursed, a belief bolstered by the fact that their crop of Vratixian barley was mysteriously rotting in the fields. Before Trennis could discover more, she was accosted by Kalo Sulman, the town's isolationist Speaker who viewed the Jedi as trespassers.\nUnsatisfied, Trennis set out on her own to learn more about the disappearances. Although she intended to go alone, she was followed by a human child named Bartol, a friend of Julus desperate to find the missing Rodian. As the two made their way through the Vratixia fields, Trennis began to sense an encroaching darkness before coming across a massive sinkhole. Bartol eagerly jumped down the pit, forcing Trennis to catch the boy with the Force before impacting the ground below. Deeper in the cavern, Trennis felt an ominous, expectant shadow waiting for them. At the end of the tunnel, the duo discovered the bodies of Ceret and Julus hanging above them, with rotting vines protruding from their mouths, ears, and noses.\nCutting them down, Trennis determined that Ceret held onto life, but the boy Julus had died. Devastated, Bartol sought solace with the young Jedi Knight. Trennis consoled the child as best she could, embracing him in the dark pit. Still needing to tend to Ceret, she trusted Bartol to hold her saber as a light so that she could inspect the vines growing from the Kotabi's body. Ceret regained consciousness, but they were not themselves; their mind had been infected by the Drengir, an ancient race of sentient plant-based beings that desired to consume all flesh. Ceret turned on Trennis as Drengir began to converge on them from deeper within the tunnel. Avar Kriss arrived, bursting in from the surface and slicing a Drengir in two. Although Kriss was able to talk some sense into Ceret, the group was halted in their tracks by an infected Sskeer, who held his lightsaber in a newly-grown arm of vines and roots. Now controlled by the Drengir, Sskeer captured Trennis, Kriss, and Ceret, wrapping and suspending their bodies with vines, while Bartol was also held captive by the Drengir.\nTrennis attempted to reach her former master, insisting that he was not Drengir, that she still believed in him, and that they would work through whatever was hurting him together. With Trennis's encouragement, and his own strength of will, Sskeer broke free from the Drengir's control, revealing that he joined with the Drengir in order to understand them, and their weaknesses. Sskeer then used the force and his connection to the Drengir to free Trennis, Kriss, and Ceret, as well as push away and weaken the Drengir. Sskeer apologized to Kriss, and told Trennis that he had a lot to tell her about what he was going through in the weeks since the Battle of Kur. Trennis, Kriss, Ceret and Sskeer, began to battle against the Drengir, and in doing so freed Bartol from the Drengir's capture.\nTrennis, Kriss, and Sskeer went to confront Kal Sulman. Sskeer insisted that Sulman had known the Drengir had taken root on his planet and started to threaten him, but Trennis attempted to keep Sskeer in control. But Trennis interrupted the interrogation when she noticed a large vessel landed nearby. The owners of the vessel revealed themselves to be part of the Hutt Cartel, and declared that they were seizing the planet in its name. Sulman revealed he had made a bargain with the Hutts, promising to give them regular payments of grain in exchange for protection.\nKriss attempted to negotiate with the leader of the present sect of the Hutt Cartel, Myarga the Benevolent. Sskeer was unsupportive of this tactic, saying she wasn't doing enough, but Trennis expressed her support, saying it was doing something. However, Trennis's attempt to quell Sskeer's discontent failed, and with his connection to the Drengir further agitating this feeling, Sskeer lashed out against Myarga, taking hold of her with his vine arm. In response to this, Myarga called on her people to retaliate against the Jedi, sending the two groups into battle, and seeing Trennis defend against the Cartel's attacks alongside, Kriss, Terec, and Ceret.\nDuring the battle with the Cartel, Trennis and Kriss approached Sskeer, who was still in hold of Myarga. Trennis attempted to reach Sskeer once again, begging him to push back against the Drengir's influence by reconciling with the pain and hurt he was feeling, begging him to come back to them. Trennis sliced off Sskeer's vine arm in an attempt to further disconnect him from the Drengir, but it did not work, and the Drengir took full control of Skeer once again. Despite not getting the outcome she wanted, Trennis continued to try and reach Sskeer, insisting that he was still there inside of him despite the Drengir's control.\nEventually, Sskeer was able to break through the Drengir's control and talk to Trennis, though he told her he didn't have much time to speak to her before they took over his mind again. He revealed that he didn't just become part of the Drengir to gain intelligence on them, but because he was losing his connection to the force. He explained that he didn't tell Trennis because he felt like he was letting her down. Sskeer continued, telling Trennis that she was essential to his plan to stop the Drengir. She would have to perform a mind touch on Sskeer and reach into the the Drengir's telepathic root system. Then she could convince the Drengir that the people—or 'meat' as the Drengir call them—they were attempting to eat were 'spoiled' and would be poison if eaten. Sskeer needed Trennis specifically to do it because the mind touch would only work on Sskeer if he lowered his defenses to someone he trusted.\nTrennis executed Sskeer's plan successfully and convinced the Drengir to stop attacking them. In doing this she stopped the Drengir's attack on Sedri Minor, as well as their assault on Starlight Beacon, which was occurring concurrently. However, after Trennis completed the mind touch, Sskeer fell into an unconscious and comatose state, leaving Trennis overwhelmed and distraught.\nMaster Avar Kriss led a continued assault against the Drengir in the Outer Rim with the help of Myarga and the Hutt Clan due to a newly formed alliance with the Jedi. While this occurred, Keeve Trennis stayed on Starlight Beacon in order to watch over a comatose Sskeer, who was being held in a stasis field to keep his Drengir infestation in check. She worked closely with the Anacondan doctor Gino'le, who was serving as the Chief of Medical Operations on Starlight Beacon. Trennis wanted to run many tissue scans in order to find something physically ill about Sskeer, but Gino'le suggested that Sskeer's issue, was not physical, but due to a crisis of faith.\nAfter being overwhelmed by the Drengir on Daivak in the Outer Rim, Kriss called for reinforcements from every Jedi on Starlight Beacon. Master Estala Maru insisted to Trennis that she must go with him to help Kriss as well, but she refused to leave Sskeer. Instead, Trennis deactivated the stasis field and allowed the vines of Sskeer's vine arm to enwrap and enter her body, determined that Sskeer was the key to fighting the Drengir and that he just needed help. Doing this connected Trennis to the Drengir's root mind, and allowed her to speak to Sskeer. Trennis was overwhelmed and started to cry when she was finally reunited with him again. After she regained composure, Sskeer explained that the root mind allows the Drengir to telepathically communicate by connecting them all, and that understanding it would be the key to defeating the Drengir.\nWhile Trennis was within the Drengir's root mind, Kriss could feel her song within the Drengir and told Maru to find her. Maru and Jedi Archivist OrbaLin found Trennis infested with the vines. Trennis was able to communicate to Maru that she and Sskeer were looking for the heart of the Drengir. Kriss, who heard this on comms, put together from something that Sskeer talked about on Sedri Minor that Trennis was referring to The Great Progenitor, the oldest and greatest of all the Drengir that had been released on the Amaxine Station earlier that year. However, locating the Great Progenitor proved harder than Trennis hoped, as the roots of the root mind started to take hold of Sskeer and Trennis. Trennis feared that they would not be strong enough to resist, but Maru and OrbaLin reached out to them through the force and were able to make the roots in the root mind retreat. But before the roots could fully retreat, Trennis and Sskeer grabbed onto them. They pulled the two of them through the root mind and took them to the Great Progenitor at the center of the root mind. Trennis was able to see into the Progenitor's mind with the intent of finding its location. However, the Progenitor attempted to stop her by stabbing her with a root. In response to this, Sskeer, determined not to lose Trennis, managed to rip his vine arm out of his body in the real world, and in doing so disconnect himself and Trennis from the Drengir root mind. Sskeer believed that doing this had caused them to not be able to find the location of the Progenitor, but Trennis revealed that she had been able to scratch it onto her arm guard while connected to the Progenitor's mind. The name she scratched was 'Mulita' which Maru determined to be a system deep within wild space, allowing the Jedi to be one step closer to defeating the Progenitor and the Drengir.\nAfter connecting herself to the Drengir's root mind, and looking into the mind of the Great Progenitor, Trennis began to have terrible and all-consuming visions. Trennis had one such vision while attempting to meditate in the meditation chamber on Starlight Beacon. In her vision Trennis found herself on the Amaxine Station, but she did not recognize it. She called out for help, but only a dark voice responded, telling her that she will only ever be no one. Then Kanrii, Bartol, and Julus appeared, all of them saying they did not know where they were. Then a ghostly apparition representative of Jedi Wayseeker Orla Jareni appeared and asked Trennis what she was waiting for. But then the apparition of Jareni, as well as Kanrii, Bartol, and Julus, all disappeared. A voice declared that those four were never real, but that he was. The owner of the voice emerged from the shadows, revealing himself to be Darth Krall. He ignited his red lightsaber and swung at Trennis, and she parried with her green lightsaber. Krall asked her if she thought she could defeat them, and if she thought she could consume them. She started to say no, but then she answered, in the Drengir's voice: \"The Harvest will be protected.\" Krall insisted that no it wouldn't. Krall declared \"The Harvest will be ours!\" while stabbing Trennis in the chest with his lightsaber. Trennis's lightsaber fell to the ground and she was left paralyzed, unable to move. The apparition of Jareni appeared again and asked Trennis who was stopping her from moving. Then hooded figures appeared, declaring that \"The circle is complete.\" Finally, Trennis, now solidified and cracking apart, found herself and a group of Drengir surrounded by giant glowing golden versions of the binding statues, with a horde of hooded figures in front of her. Krall declared to the figures that \"The Circle shall be forever!\" and then Trennis awoke from the vision, screaming \"No!\"\nWhen Trennis awoke, Doctor Gino'le called her on her comm, telling her that the sensors Kriss had him place on her were indicating all of her vitals had just jumped off the scale. Trennis got herself to her feet and insisted that she was just meditating and that she was fine. But then Trennis saw her reflection in the reflective walls of the meditation chamber turn into a Drengir. She smashed the wall with her hand to dispirse the reflection and ran out of the room. She went to talk to Master Maru, who offered her to assign her to a mission in the Rseik Sector, where they had gotten a report that Agricultural Hub 42 on Chortose was under attack by Nihil. Trennis decided to go on that mission instead of going to help Kriss and the Jedi with the assault on Mulita.\nTrennis arrived at Agricultural Hub 42 and found a trio of Nihil raiders after sprayer droids that were attacking two Chortose brothers named Pango and Gru. Trennis ignited her lightsaber and protected the brothers from the Nihil's blaster bolts. But when Trennis turned to the brothers to give them instructions, the leader of the trio, a Storm, hit Trennis on the side of the head with the pole of their vibro-ax. After this, Trennis no longer saw the storm as themselves, and instead they appeared to her as Darth Krall. But before the Storm could kill Trennis, Orla Jareni arrived and threw a sprayer droid into the Storm's head, and with her white double-bladed hinged lightsaber ignited, ordered the last standing Nihil to free the Chortose. Trennis recognized her from her vision and they exchanged introductions. Jareni helped Trennis understand that she should be on Mulita helping the Jedi fight the Nihil, that she belongs with them. But before Trennis could accept that she retorted, saying that she thought she could embrace the darkness and survive, but now she sees the darkness everywhere, referring to her visions. Trennis expressed that if the darkness had almost taken Sskeer, with all his knowledge and experience, then she felt like she had no chance of beating it, and that's why she hadn't gone to Mulita. Then, Trennis screamed and her head was filled with pain as the Drengir root-mind spoke to her. She explained to Orla that it had told her that it's over, that the Jedi have already lost, as well as showing her a vision of Avar Kriss's decaying skeleton being taken over by Drengir roots.\nAfter the Drengir root-mind spoke to Trennis, she and Jareni took Jareni's starship named the Lightseeker to Mulita to join in the Jedi and Hutts' assault against the Drengir. When they arrived, Trennis used the force to save Sskeer and Myarga's lives by using the force to burst the heads of giant arthropods that the Drengir had weaponized. Jareni flirted with Sskeer after she arrived, and Master Cohmac Vitus revealed that the two had been in a relationship in the past. Trennis found this horrifying, saying that she might never sleep again. Trennis then went to find Marshal Kriss, who went to the center of the forest to face the Great Progenitor. Terec joined her, but on their way Trennis stumbled over Nihil remains, revealing that they had been on Mulita. But before Trennis could process that, the Great Progenitor revealed herself, and had already captured Kriss.\nNow facing the Great Progenitor, Terec wanted to call the others for help, but Trennis declared that they were enough. The Great Progenitor declared that the harvest will be theirs and that the Jedi, like the Sith and the Nihil, would spread the Drengir's 'empire of thorns.' Trennis explained to Terec that it was the Sith who had trapped the Drengir on the Amaxine station long ago after their alliance fell through, before the Jedi had accidentally freed them a year earlier. Trennis realized that the Progenitor had fed Trennis her location deliberately, knowing that Kriss would lead the charge against her. The Progenitor wanted to bond with Kriss because her unique ability to form a telepathic network between the Jedi would allow her to use Kriss to connect all of the Jedi to the Drengir's root-mind.\nDespite this, Trennis stayed confident, declaring that the Progenitor had 'kriffed up,' because she underestimated Kriss's power to bring the Jedi together, because of the incredible things the Jedi can do when all connected. Kriss connected to Trennis and all of the Jedi present on Mulita, activating her network. Now all connected, the Jedi used the force and Kriss's connection to the Drengir root-mind to free Kriss from the Progenitor's control and cut of the Progenitor from the Drengir root-mind, thus giving the Jedi a chance to subdue her. But before they could, Myarga ordered her goons to fire on and destroy the Progenitor, but Kriss ordered them to lower their weapons, telling Myarga that the Jedi protect life. While Terec and Ceret set up a stasis field generator, Myarga charged forward at the Progenitor, swinging her whip. Trennis cut Myarga's whip and insisted that death wouldn't come to the Drengir while the Jedi's sabers still burned. After this, Jedi Padawan Reath Silas activated the stasis field generators and the Great Progenitor was trapped within a giant stasis field.\nHowever, Myarga continued to insist that it is not over until she had killed the Progenitor. But the Jedi all stood together and Kriss declared that if Myarga wanted to go through with her threat, she would have to go through them. Knowing she could not take the Jedi, Myarga and her goons left Mulita. Kriss thanked Trennis and said they could not have won against the Drengir without her, but Trennis brushed it off, saying it was a team effort. But before they could truly celebrate, Master Maru called Kriss on her comm, and revealed to her and Trennis that the Nihil had destroyed the Republic Fair on Valo.\nIn the aftermath of the Attack on Valo, Keeve Trennis participated in altercations against the Nihil. One included assisting alongside Sskeer after an attempted prison break by the Nihil on Starlight Beacon, helping get Vane Sarpo, who was turned into a living bomb by the Nihil, to Starlight's medicenter. Another more significant event she participated in was the Battle of Galov, which was a Nihil attack against the space station Relay Post Epsilon One. During the Battle, Trennis and Sskeer boarded Relay Post Epsilon 1 in order to secure it and defend against the Nihil attack. The two discovered the room where the Chief Technician of the station, Raleigh, and the Station Controller, Macken, were sheltering, and defeated a Nihil raider who was attempting to break in. At Raleigh and Macken's request, they used the force to clear the room of the Nihil's toxic gas. Master Avar Kriss informed Trennis and Sskeer over comm that the Nihil were launching a wave of scavenger droids to dismantle the station, and that they needed to get out of there. Trennis and Sskeer started on their way to escape from the station with Raleigh and Macken in tow. During their escape, Trennis gave Macken her rebreather, deciding just to use the force to protect herself from the gas. When scavenger droids confronted Trennis and the others, she heard a message on a Nihil comm from Storm Tasia telling the Nihil forces to evacuate the station. Trennis realized what this meant and told the others to brace themselves as the station rocked from turbolaser fire from the Nihil cruiser named the Lourna Dee. The laser fire caused a hull breach in the station that threatened to pull the four of them out into space. Trennis held Raleigh with the force to stop him from being sucked out into space as Sskeer used the force to plug the breach with a hull plate. After they were safe again, Raleigh thanked Trennis for saving his life. Finally, Trennis and Sskeer took Raleigh and Macken to their vectors and all four of them escaped to the Ataraxia before the station exploded and was thus destroyed.\nHowever, that would not be the end of the battle. Trennis and Sskeer would be sent by Master Kriss to board the Lourna Dee to help secure it and take it from Nihil control. Trennis piloted the shuttle that the group took and landed it on the Lourna Dee. Trennis joked that Sskeer was not great at landing ships after he complimented her piloting skills. As they exited the shuttle, Master Kriss felt in the force that there were Nihil nearby. Trennis and Sskeer stood with Kriss as she ordered the hiding Nihil, who were Storm Andrik Keller and Tasia, to come out from hiding or face consequences. Sskeer ignited his lightsaber, which Trennis scolded him for because she didn't think they should escalate the situation. Sskeer dismissed it as adding credence to Kriss's threat. After taking a stim, Keller ran out of hiding and opened fire on the Jedi. The Jedi deflected the blasterbolts for a long while, with Keller not being able to make any headway. Sskeer became fed up of the deflecting the blasterbolts so he moved the shuttle that Tasia was hiding behind to remove her cover. Sskeer chased after Keller and ordered Trennis to go after Tasia, who was under the shuttle, injured by Kriss deflecting blaster bolts at her leg.\nLater, presumably after securing Tasia aboard the shuttle, Trennis searched the Lourna Dee for Sskeer. She found him in an almost trance-like rage, standing over and with his lightsaber pointed at an incapacitated Lourna Dee—a Nihil Tempest Runner who the Jedi mistakenly believed to be the Eye of the Nihil. However, neither Trennis nor Sskeer knew that the Twi-lek was Lourna Dee as she was not wearing her mask or her armor. After Trennis broke him out of his uncontrolled moment of rage, Sskeer expressed that for a moment he had been unable the use the force, to which Trennis assured him that \"the force was with .\" She told him that he had remembered himself and kept control. She noticed Sskeer was bleeding and became concerned for him. He insisted he was okay, so Trennis turned from him for a second and searched for a pulse on Dee's body, confirming that she was alive. He explained to her that he and Dee had fought, that his injury was from her hitting him with a vibro-ax, and that Keller had ran off through a gap in the collapsed hallway next to him. So after telling Sskeer to stay where he was and that they would get him fixed up, Trennis cut through the wreckage with her lightsaber and chased after Keller. Trennis found Keller and told him to stop as he crawled into an escape pod, but she didn't make it in time before he ejected it and escaped.\nLater, at Starlight, Doctor Gino'le put Sskeer into a bacta tank to recover from his injuries, though Sskeer had to be convinced by Kriss. Trennis watched on upon Sskeer as Jedi Knight Nib Assek arrived and asked Trennis about Sskeer's struggle with the force. Trennis explained Sskeer's belief that he was losing his connection to the force, but Assek dismissed it as impossible. She then told Trennis about how she, her Padawan the Wookiee Burryaga Agaburry, and Skyhawk pilots from Firebird Squadron had boarded the Lourna Dee to locate the ship's namesake. Assek expressed her belief that Lourna Dee had died when one of the pilots, Jano Brayson, had shot \"Lourna Dee\" in the head, and explosives on the \"body\" went off afterwards. In reality, the \"Lourna Dee\" that they faced had really just been a droid named H7-09 who had been dressed in Dee's mask and armor as a decoy. Assek revealed that all of the Skyhawk pilots had been killed in the explosion except for Brayson. Just then, Padawan Agaburry ran up to Assek and Trennis and told them in Shyriiwook that Brayson had gone missing, as he was no longer where he had been being treated for injuries from the explosion, but that he knew where to find him.\nTrennis helped Agaburry and Assek chase after Brayson. He had gone to the medbay where the injured Nihil were being treated and had started threatening to kill them as revenge for his friend Teff's death. Burryaga pounded on the door when he, Trennis, and Assek arrived as Tasia cried out to him from inside for help. Trennis and the others could hear Tasia and Brayson get into a fistfight. When the three of them managed to shatter the glass door and get inside, they discovered that Dee—though the Jedi did not know her identity—had hit Brayson with her ventilator and knocked him out. Trennis recognized Dee and told Assek that she had been the one who had attacked Sskeer, but she still did not know that she was Lourna Dee. Now without her ventilator, Dee started to pass out. Assek sent Trennis to get the doctor while Assek and Agaburry watched over Dee and Tasia.\nSometime after the Battle of Galov, Trennis was present for a meeting on Starlight Beacon that included Sskeer, Master Avar Kriss, and Jedi Council Member Master Stellan Gios, the latter of whom joined via hologram. In this meeting Gios expressed his beliefs that the Nihil were 'running scared' and close to being defeated. Kriss, however, believed that their response was not enough and that they needed to increase their efforts, which Gios waved away and declined. This angered Trennis, who stood up to Gios, insisting that Master Kriss was right and that they needed to do more. Trennis invoked the evidence found of the Nihil on Mulita and her belief that the Nihil had seeded the Drengir across the frontier to keep Starlight Beacon busy, and therefore not be able to respond to the crisis on Valo. Trennis insisted that they had to show the Nihil that they could not mess with Starlight like that ever again. Gios responded to this by saying that the Jedi had to work as part of the Unified Response and not run off on their own just to assuage their guilt. He then hung up the call. Trennis insisted to Kriss and Sskeer that after everything they've been through, they needed to do more, before storming out of the room.\nAfterwards, Sskeer found Trennis elsewhere in Starlight Beacon. She immediately said that she knows she shouldn't have lost her temper, and that lesson number one of being a Jedi is that there is no passion. Sskeer refuted this, saying that there is always passion. He then informed Trennis that Kriss had an idea, and wanted to speak with her.\nTrennis met with Kriss and Maru, who wanted to send Trennis on a secret mission behind Gios' back. She would be going undercover within the Nihil, pretending to be part of Pan Eyta's Tempest. Kriss told her that she would be tested, and would have to respond to those 'tests' not as a Jedi, but as a Nihil, if she wanted to gain their trust.\n\nIn the Soola system, Orla Jareni, who was piloting the Lightseeker, had just reported in to Estala Maru that she had completed her sweep of the system when her targes scanner picked up vibrations from hyperspace. Trennis and Terec, now undercover as Storm Trennis and Ter, exited hyperspace near Jareni in a stormship salvaged from the Battle of Grizal named the Ransacker. Trennis and Ter persued Jareni, firing at her with all of their weapons. Jareni had been able to send her location to Starlight Beacon, so the Ataraxia arrived as reinforcements and ordered the stormship to surrender. Trennis send out a distress call of her own to Nihil command, but Jedi Vectors had already been deployed from the Ataraxia, one of which was piloted by Master Sskeer, and one of the others by Master Nib Assek. The Vectors shot at the Ransacker's engines, disabling them and their shields. But before they could be defeated, Nihil reinforcements from Zeetar's Tempest arrived to help. Trennis targeted one of the Vectors, which was pilotless and being remote controlled by Ceret aboard the ataraxia, and fired on it, destroying it. The Nihil reinforcements locked onto the Ransacker with magclamps, and took them with them into hyperspace.The starships landed at the Nihil Warcloud Forge on the planet Xais, and after exiting the Ransacker, Trennis and Terec were met by a Crolute who asked what Tempest they were from. Trennis told him she was from Pan Eyta's tempest. The Crolute said that Eyta was one of the best of them, and then asked Trennis if she was too before attacking her with an electro-whip. Trennis fought back, grabbing the whip, slamming the Crolute to the ground, and wrapping the whip around his neck. Then Zeetar arrived in a powersuit, remarking that Trennis really was from Eyta's Tempest after seeing the situation. He told her to let the Crolute go, which she did, and then asked her if she knew who he was. She didn't know him by name, but recognized him from a picture shown at meetings discussing the Nihil. But then the Crolute made a comment where he mentioned Zeetar's name. Trennis said that the Jedi had been 'rugging them ragged' for months and asked Zeetar what the Eye was 'playing at,' but Zeetar said before he would tell her she would have to prove she were actually Nihil. He handed her a giant metal hammer, and brought in a prisioner, who happened to be Myarga the Hutt. Zeetar ordered Trennis to kill Myarga to show she was really Nihil, leaving Trennis unsure and conflicted.\nIn order to avoid killing Myarga, Trennis used the force to tip over a vat of Nagnol that an Nihil Lepi was carrying. This caused a large explosion that pushed everyone in the vacinity back and set the Lepi on fire. Zeetar was furious, to the point of even shooting and killing the Lepi with a blast from his powersuit. But Trennis attempted to turn the situation around, telling Zeetar that the Lepi had done him a favor by inadvertently preventing Myarga from being killed. Trennis suggested that since Myarga was found on the edge of Wild Space she might be the Hutt that was working with the Jedi against the Drengir, and thus would know Jedi secrets that they could get her to tell. Zeetar agreed to keep Myarga alive for a while and try to torture secrets out of her.\nA short time later, Zeetar lead Trennis, Terec, and a group of other Nihil to a modified bacta tank where he was holding Myarga. On the way there Terec revealed to Trennis that Ceret and the others were on their way. When they arrived at the bacta tank, Zeetar started to add unrefined nagnol to the tank, and told Trennis that she needed to interrogate Myarga quickly before her lungs burned. Myarga announced to Trennis that she would not talk, leaving Trennis confused as she figured Myarga knew she was trying to help. Before the interrogation could continue, Terec used the force to block the valve that was adding the unrefined nagnol to the tank. This caused Zeetar to change course and instead electrocute Myarga and interrogate her himself. Myarga revealed to Zeetar and the Nihil that Trennis and Terec were Jedi undercover, blowing both of their covers.\n\nTrennis and Terec ignited their lightsabers and began to defend against the Nihil's attacks, telling them that they should surrender. But the Nihil continued to fight back. Trennis attempted to use the force to break or disable Zeetar's powersuit but failed, and Zeetar managed to reactivate the apparatus that was electrocuting Myarga. Myarga's pain from the electrocution washed over Trennis and Terec through the force, leaving them disoriented and weakened, and therefore allowed Zeetar and the Crolute to knock them down. While Trennis and Terec were knocked down, Lourna Dee arrived. She had recently rejoined the Nihil after commandeering the prison vessel the Restitution where she was sent after being arrested. Terec remarked that she was supposed to be dead. Dee 'proved' that she wasn't dead by punching Terec in the face and shooting Myarga with a blaster, both of which angered Trennis. She stood and raised her lightsaber towards Dee, but before she could do anything, Dee asked Doctor Uttersond to open a large box. When he opened the box a purple glow emanated from the box and Trennis staggered backwards, shocked. The Great Leveler rose from the box and immediately Trennis and Terec were overwhelmed and afflicted by its power. And as Trennis was filled with horrifying visions and immeasurable fear, Terec began to turn to stone.\nThe effects of the Great Leveler on Trennis had caused her mind to be in utter dissarray, leaving her inconsolable, vulnerable, and at the mercy of the Nihil. Zeetar began to approach Trennis with a blue electric weapon on his mecha-suit activated, but before he could kill her, Lourna Dee sliced off the electric weapon with Terec's lightsaber. She told Zeetar that they needed Trennis alive to prove that what happened on Grizal, referring to Loden Greatstorm's death due to the attack of the Leveler, wasn't a fluke.\nMasters Kriss and Sskeer arrived on Xais aboard the Ataraxia to rescue Trennis and Terec. Kriss noted that she could not sense Trennis, which concerned her, but Sskeer was used to it due to his waning connection to the force. After finding Trennis's location on the planet, Sskeer went out of control, jumping out of a Jedi Vector, destroying Nihil ships, and brutally killing many Nihil with his lightsaber. It wasn't until he sliced the legs off of Zeetar's mecha-suit and threatened his life that Trennis revealed herself to him. Trennis told Sskeer about how something attacked her in the shadow, but she couldn't remember clearly. But then she suddenly remembered Terec being hurt, so she and Sskeer ran to their body, which Kriss already hovered over. Terec was comatose, and parts of their body had become rock-like, which Trennis thought was a horrific sight.\nAvar deduced that the person who would know what could have that effect on Terec was Lourna Dee, who was escaping in her stormship. Avar grabbed the ship with the Force, refusing to let Dee escape again. She begged Trennis and Sskeer to help her, but, as stated by Sskeer, Trennis was in no condition to help. Avar insisted that the Force would provide, but she lost her hold on the stormship and it escaped. Avar collapsed onto her knees declaring that they should have been enough to stop Dee. That moment, and Avar's anguish and pain she felt in it, would fill Trennis's mind constantly for weeks, haunted by wishing she had been able to do more. After Dee got away, Avar stripped Sskeer of his duties as a Jedi and ordered him to give up his lightsaber because of his reckless brutalization and murder of the Nihil fighters. Trennis exclaimed to Kriss that she couldn't do this, that they needed him. Kriss was sympathetic, but ignored her request.\nAfter Xais, Trennis returned to Starlight Beacon and joined it as it was towed to Dalna and Eiram to asist those planets. Trennis often went to the medicenter on Starlight to visit Terec and Ceret, who were both partially calcified and sent into a hibernation trance after the events on Xais. Jedi investigator Emerick Caphtor, private eye Sian Holt, and Jedi Master Stellan Gios visited Trennis, Terec, Ceret, an Doctor Gino'le in the medicenter to question them and investigate what happened on Xais. Caphtor asked Trennis what she saw, and she told him that the Nihil brought out a giant monster that towered over her. She was clearly overwhelmed by the memory, so Caphtor comforted her, giving her a hug.\nAfter one occasion when Trennis visited Terec and Ceret in the medicenter, Jedi Master Estala Maru arrived to visit. Maru asked Trennis to watch over Marshal Kriss, because he feared Kriss was allowing her emotions to govern her actions. He claimed that Kriss was not listening to others and not listening to the force. Trennis said that she was flattered Maru would ask her this, though she said that it should be Sskeer who watched over her, though recognized that was not possible.\nTrennis then visited Sskeer in his quarters, breaking in by using the force on his door. Trennis asked him to tell her what was wrong, why he couldn't trust her. He explained to her that he had developed a trandoshan condition called Magrak Syndrome which causes trandoshans to revert to their base instincts of rage and aggression. His brain dealing with the condition is what left Sskeer unable to connect to the force. Sskeer expressed that he was resigned with Kriss's decision and believed her, while Trennis begged him not give up and continue being a Jedi.\nTrennis committed to joining Kriss's team that would travel to the Great Hall of the Nihil in No-Space to hunt down and capture Lourna Dee, who they incorrectly believed to be the Eye of the Nihil. After Trennis had talked to him, Sskeer arrived at the Ataraxia and told Kriss that he wanted to come too. Trennis vouched for him, saying that she would make sure he would not get up to any trouble, and that if he did, she would stop him. The Ataraxia then departed for No-Space, with Trennis and Sskeer onboard.\nWhen the Ataraxia arrived, it fired the first shot at the Great Hall, surprising the Nihil and beginning the factions' battle. The ship docked at the main entrance where Trennis, Kriss, Sskeer, and Goonral Monshi cut their way through the front entrance of the hall and marched through, deflecting the shots of the Nihil. Kriss ordered them to 'take them,' to which Trennis responded 'take them prisoner' and attempted to clarify whether or not Kriss had meant that all along. But while declaring 'For light and life,' Kriss murdered a few Nihil, including Muglan. After Kriss then reflected Tempest Runner Zeetar's flamethrower back at him and thus killed him, Kriss told Trennis and the others to deal with the stragglers while she went after Dee. But this concerned Sskeer, who said Trennis's name, to which Trennis said she understood and went after Kriss.\nTrennis located Kriss and called out to her, with Kriss responding that she had told her to stay with the others. Trennis said that the couldn't do that, and expressed that she hoped Kriss knew why. Trennis reminded Kriss that she had just taken Sskeer's lightsaber away from killing in cold blood, but added that he had been sick, and asked Kriss what her excuse was for doing the same thing. Kriss lashed out, attacking Trennis with her lightsaber and forcing them into a duel. Kriss declared that that was enough and that she would not be lectured by a Jedi who she knighted, who constantly doubts her abilities, and questions the song of the Force. But Trennis retorted by asking Kriss if she was really listening to the song of the Force, or her own.\nTrennis knocked Kriss to the ground with the Force and stood over the Marshal. Trennis declared that Kriss was not thinking straight and that many were worried about her. But then an explosion rattled behind Trennis and knocked her to the ground. It had been caused by a projectile shot by Lourna Dee using Zeetar's powersuit. This angered Kriss, who then proceeded to fight Dee in earnest. When Kriss was knocked to the ground by Dee, she looked over at the unconscious Trennis and said that she was sorry. She then used the force to destroy Dee's powersuit and entered into a lightsaber duel with Dee, who was using Terec's lightsaber.\nKriss managed to cut off Dee's hand and disarm her, after which Trennis regained consciousness, just in time to see Kriss raise her lightsaber to cut down a defenseless Dee while declaring, 'For light and life.\" Trennis screamed out to Kriss telling her not to kill Dee before jumping in front of her blade. Kriss stopped her blade in front of Trennis. Trennis told Kriss that she couldn't let her kill her, and reemphasized that Dee was injured and disarmed so she already won. Kriss lowered her saber and admitted that Trennis was right and that she lost control. But then Dee reclaimed Terec's lightsaber and held it up to Trennis's throat, declaring that the mercy that the Jedi show was weakness. Kriss rebuted that by declaring that it was their strength, while using the force to slam Dee into a wall and save Trennis's life. Kriss started to ask if Dee was alive to which Trennis revealed that Dee was only unconscious. Before Kriss could apologize, Trennis told her that she understood, no one is infallible and thinking one is leads only to the dark side. Kriss asked Trennis when she got so wise, to which Trennis responded that she was lucky and had the best teachers in the galaxy. The two then took Dee captive aboard the Ataraxia.\nWhile the Ataraxia exited hyperspace in the Eiram system, where Starlight Beacon was located at this time, Trennis and Sskeer were stationed in the brig of the ship to watch over the prisoners. Trennis noticed that Sskeer was bleeding, but he insisted that it would heal given time. But Trennis wondered if Sskeer had time, considering his condition. Sskeer told her that his condition would not change and could not be cured, so no matter what the council would decide it would be his last mission. Trennis didn't want to accept that, but Sskeer reminded her that one can't escape the truth. He also added that there was no better time for it to happen because he had got to see her become the Jedi he always knew she would be.\nSskeer then told Trennis that they should return to the flight deck and that the guards could handle it from there. But before they went, Trennis told Sskeer that whatever happened, she would make him proud and would be his legacy. But Sskeer declared that that was the last thing she should be, as it wasn't about him. He insisted that she follow her own path, create her own legacy, and become her own Jedi. He told her that the the greatest reward of every master since before the dawn of the Luminous was to see that happen. But as Trennis and Sskeer made their way to the flight deck, the Ataraxia was rocked by an explosion.\nStarlight Beacon had exploded, knocking the Ataraxia back in the blast and causing the ship to lose its deflectors and lose power on all of its decks. Trennis, now on the bridge, asked if Starlight had been what exploded, to which Nooranbakarakana confirmed that there had been an explosion in the engineering section. When Trennis wondered aloud what had happened, Nooran explained that they had no way of knowing, but also revealed that the station was drifting steadily towards the planet Eiram. Nooran insisted that they find a way to stop the station from moving. Kriss had Nooran bring the Ataraxia alongside the station and extend a docking tube, a difficult maneuver, but one they accomplished.\nKriss ordered archivist OrbaLin to check on the prisoners and told Trennis, Sskeer, Moshi, and Nooran to come with her. Kriss also told them to put on their rebreathers, to which Trennis and the others obliged. Trennis then noticed that something felt wrong with the force and expressed this to Sskeer, telling him that she wished he could feel it, to which he agreed. When the airlock wouldn't respond, Kriss cut a whole in the door with her lightsaber and led Trennis and the others inside the station. Trennis was relieved to find that the station had oxygen, and Kriss noted that they could hear voices. The group of jedi then discovered a horde of people attempting to reach the escape pods to evacuate. Kriss told them not to panic and had Monshi escort them to the Ataraxia where they would be safe.\nAs Monshi led the civilians to the Ataraxia, Trennis and the rest of the Jedi regrouped at an information panel that Nooran accessed. Sskeer attempted to reach Master Maru on comm, but Nooran revealed to the group that the comms on the entire station were down and that the entire midsection of the station was flooded with radiation, almost completely cutting off the top and bottom halves of the station from each other.\nAfter hearing the situation from Nooran, Trennis and the Jedi looked to Kriss for a plan. She decided that they should focus their energy to helping the people in the top half of the station and then maybe find a way to reconnect the two. She also added that the stabilizers could be operated from the Hub by Maru, but before she could finish, doubled over. Trennis was then immediately overwhelmed with a wave of pure fear and began muttering 'no, not again' over and over as well as foaming at the mouth. Sskeer asked her what was wrong, as he was not being affected like the others were. But Kriss, her view of the world distorted with horrifying visions, stood in between them, and told Sskeer to stay away from Trennis as well as calling him a monster. Sskeer asked Kriss with confusion what was happening, to which Trennis managed to respond that Kriss was not herself. Trennis explained that it was like what happened on Xais, and that the thing that had attacked her and Terec was now there on Starlight.\nTrennis realized that there was now a legion of the monsters when before there had only been one. Trennis noticed the slashing of a green lightsaber through her visions, but was subdued by the monsters and tempted to give in. Parts of Trennis' face had started to turn into stony husk that Terec and Ceret had been turned into, but before she gave in Sskeer scared off the monsters and manage to jolt Trennis out of her fearful visions. Sskeer told her that they needed to move, and that though he had scared them off, they'd come back. Kriss then told Trennis that Sskeer was right, and that they needed to get to the hub to stop Starlight from drifting into the planet's atmosphere. She assured Trennis that she was fine, but then revealed that Nooran had died, turned into a husk by the monsters.\nSskeer told Trennis that while Nooran was one with the force, she was still alive. He then revealed that the creatures weren't affecting him the same way they were her and the other Jedi, and declared that he would hold them back. But Trennis refused to leave him. Sskeer told her that this was the reason the force blessed him with his condition. He told her that it was not the end, and that the two would see each other again. Trennis began to cry, and said Sskeer's name one last time before Sskeer told her to go. As Trennis and Kriss ran off, Sskeer proclaimed that this was the way it was always meant to be. When the monsters returned, Sskeer declared that the force was with him, now and forever, and turned to face the monsters while still wielding his former Padawan's lightsaber.\nTrennis and Kriss continued traveling to the hub of the station. Kriss told Trennis that they were almost there, to which Trennis asked if they were almost at the hub or almost at the edge of Eiram's atmosphere, to which Kriss replied that both were true. As they arrived at the hub, Trennis wondered aloud how the station was staying together, but she quickly got her answer as she and Kriss discovered Master Estala Maru holding the station together with the force, floating in the air with his arms outstretched. Maru screamed to them, telling them to get to an escape pod immediatley. Trennis began to ask but Kriss confirmed before she finished her sentence that Maru was holding the Beacon together, adding that it was the same as it always was. Maru told them that the spire had been evacuated and that everyone was safe. But Maru's droid, KC-78 revealed to Trennis that Terec and Ceret were still onboard the Beacon in the healing chamber. Kriss told Trennis to go get them and bring them to safety. Trennis protested, saying Maru would never be able to hold the station on his own. Kriss said that he wouldn't have to and activated her network to connect all of the Jedi on the beacon and help Maru.\nTrennis climbed the stairs of the spire to the chamber even as the spire itself started to crumble. Trennis was reassured and strengthened due to being able to feel all of the Jedi still alive on the station thanks to Kriss's network. She was still haunted by the fact that many Jedi were already dead, but decided to focus on the living as she entered the healing chamber. She found that Terec and Ceret were still there, but realized that it would be difficult to move them and their hover-stretchers to an escape pod before the station fell apart. Just then, a large hole burst open in the wall of the healing chamber, threatening to pull her out into space. She tried to save herself by reaching into the network, the song of the force, but could not do so as it had been broken. But before she could be thrown into space, Trennis was saved by Terec and Ceret holding her with the force, the twins having been awakened by feeling the 'song' of Kriss' network. The twins told her that they had her and that she would not die, and that none of them would die.\nTrennis and the twins managed to escape the beacon in an escape pod, landing on Eiram's surface. There they found Master Kriss, who was staring up at the beacon burning in the sky. Trennis told her that the beacon was gone, and Kriss cried out for all the people they had lost. Kriss then revealed that Maru had sacrificed himself to save her, and had said that she was their light. As Trennis held Master Kriss in her arms, she resolved to step up and be strong like Kriss had once been. She told herself that she would be strong enough to figure out what happened on the beacon and what the mysterious creatures were. But she did not want to do so for Kriss, or for Sskeer, or for even herself, but for the people who had trusted them, for those they'd said they'd protect, and for light and life.\nKeeve Trennis was a human female with dark skin and brown eyes. She wore her curly brown hair to the right side of her face, whereas the hair on her left side was shaved short. Trennis was a determined Jedi who trusted deeply in her connection with the Force, though she was prone to feelings of self-doubt. Although she was skilled in the Force, she thought to herself that others believed she wasn't ready for knighthood. In truth, several beings believed that the young Jedi had a bright future ahead of her. Trennis believed in hope, and trusted that good could prevail if it was worked towards.\nTrennis was inspired by individuals like Avar Kriss, whom she admired for her accomplishments on Hetzal Prime during the Great Hyperspace Disaster. She had some trouble controlling her excitement around the esteemed Jedi Master, and found herself starstruck after learning of Kriss's great actions in the past. Trennis was aware of the fact that she negatively compared herself to more experienced Jedi like Kriss and the bond-twins Terec and Ceret, whom she considered to to be living legends. Trennis also thought very highly of and was very fond of her former master Sskeer. Even after becoming a Knight, Trennis was known to often be by her former master's side and helped him frequently. Despite conflicts within herself, Trennis vowed to never let down people like Kriss and Sskeer who truly believed in her.\nStill, Trennis was not perfect, and it was impossible for her to ensure that pain would not befall the people she cared about. During her master's struggles with the dark side of the Force, Trennis felt helpless. She desired to help Sskeer make it through his troubles, but she had no idea how to do so. Trennis was fiercely protective of the defenseless, but she learned from experience that she could not stop death, no matter how much she wished it could always be prevented. Upon discovering the corpse of the boy Julus on Sedri Minor, she consoled the child's friend Bartol, confessing to him that it was normal to feel sorrow for another.\nTrennis was a young firebrand, and more impulsive than was becoming of a Jedi Knight. She was a sarcastic and quick-witted individual, trading barbs with her master Sskeer while on missions that poked fun at each others abilities. She was easily annoyed by beings like the Ximpi of Shuraden, thinking to herself that she had been cursed by the Force to have them in her presence. Trennis was prone to swearing, using expletives like kriff in formal settings when even she knew it was best to avoid such language.\nTrennis was passionate and determined, and was willing to defy authority to stand up for what she believed in. During the fight against the Drengir, she disobeyed Master Estala Maru when he ordered her to come asist Avar Kriss, and instead entering the stasis field holding a comatose and infected Sskeer, believing that he was the key to defeating the Drengir, and was thus connected to the Drengir root-mind. She also later stood up to Jedi Council Member Stellan Gios during a meeting with him that she was present for, passionately expressing to him her belief that the Jedi should do more to fight back against and stop the Nihil.\nTrennis was trained in the Jedi arts, and as such could use the Force to accomplish tasks. She was able to telekinetically move objects as well as telepathically sense danger and communicate with other beings. While on Shuraden, Trennis connected with the hive mind of the ridadi, sensing the whole of their journey through space and seeing a possible future in which the locusts attacked the Starlight Beacon.\nThe Jedi Knight was trained in the usage of a lightsaber by her master, Sskeer. During their training session on Shuraden, she was able to best her one-armed master in combat, though the Trandoshan criticized her technique, instructing her to improve on her lateral sweep. She was also able to fly several types of ships, including the T-1 shuttle as well as the Jedi Vector, a highly dangerous starship that only a skilled Force-sensitive could properly operate.\nTrennis was also able to perform a mind touch, which was not a very commonly used ability in the High Republic Era. During the fight against the Drengir on Sedri Minor, Trennis performed a mind touch on Sskeer, who at the time was connected to the Drengir root-mind, and was thus able to perform a mind trick on all of the Drengir connected to the root-mind at once, convincing them not to eat people for a few months.\nTrennis carried a green double-bladed lightsaber. The weapon was ornately designed and could be split down the middle, allowing her to use two single-bladed sabers. She possessed Jedi clothing that was the standard for her time, with two sets each; one was a mostly brown attire for missions out in the galaxy and the other was a set of ceremonial white and yellow robes reserved for important occasions. As a Padawan, Trennis wore a Padawan braid that signified her position. For dangerous situations in which oxygen was a scarcity, Trennis carried a rebreather. She flew a Jedi Vector on Shuraden that she purposefully lost in order to lure away a swarm of ridadi.\nKeeve Trennis is a character created for the Star Wars: The High Republic comic series written by Cavan Scott as part of the Star Wars: The High Republic multimedia project. Prior to the comic's release, Trennis first appeared in the 2021 junior novel The High Republic: A Test of Courage, written by Justina Ireland. In the 2021 audio drama The High Republic: Tempest Runner, Trennis was voiced by Soneela Nankani. She shares her last name with Trennis, a female Jedi Master and member of the Lost Twenty first mentioned in Dooku: Jedi Lost, also written by Scott, but no explicit connection between them has yet been made.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Trennis",
  "/wiki/Keev_Crater",
  "/wiki/City/Legends",
  "/wiki/Nox",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Sskeer",
  "/wiki/Jedi_Knight",
  "/wiki/High_Republic_Era",
  "/wiki/Padawan",
  "/wiki/Trandoshan",
  "/wiki/Jedi_Master",
  "/wiki/232_BBY",
  "/wiki/Unidentified_Ximpi_city",
  "/wiki/Ximpi",
  "/wiki/Planet",
  "/wiki/Shuraden",
  "/wiki/Realspace",
  "/wiki/Ridadi",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Galactic_Republic",
  "/wiki/Space_station",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Jedi",
  "/wiki/Bond-twins",
  "/wiki/Terec",
  "/wiki/Ceret",
  "/wiki/Sedri_Minor",
  "/wiki/Julus",
  "/wiki/Bartol",
  "/wiki/Drengir",
  "/wiki/Sentience",
  "/wiki/Carnivorous_plant",
  "/wiki/Plant",
  "/wiki/Avar_Kriss",
  "/wiki/Hutt_Clan",
  "/wiki/Mind_trick",
  "/wiki/Great_Progenitor",
  "/wiki/Assault_on_Mulita",
  "/wiki/Hutt",
  "/wiki/Stasis_field",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Attack_on_Valo",
  "/wiki/Nihil",
  "/wiki/Jedi_Council",
  "/wiki/Marshal",
  "/wiki/Xais",
  "/wiki/Myarga",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Great_Leveler",
  "/wiki/Jedi_training",
  "/wiki/The_Force",
  "/wiki/Limb",
  "/wiki/Jora_Malli",
  "/wiki/Battle_of_Kur",
  "/wiki/Jedi_Vector",
  "/wiki/Galactic_Frontier",
  "/wiki/Kanrii",
  "/wiki/Lightsaber_combat",
  "/wiki/Lightsaber_duel",
  "/wiki/Tree",
  "/wiki/Jedi_Trials",
  "/wiki/Needles_(Shuraden)",
  "/wiki/Millennium",
  "/wiki/Tythonian_pendant",
  "/wiki/Split_saber",
  "/wiki/Lightsaber_hilt",
  "/wiki/Lekaki",
  "/wiki/Death",
  "/wiki/Insect",
  "/wiki/Homeworld",
  "/wiki/Chaos",
  "/wiki/Starfighter",
  "/wiki/City",
  "/wiki/Estala_Maru",
  "/wiki/Species",
  "/wiki/Star-locust",
  "/wiki/Telepathy",
  "/wiki/Atmosphere",
  "/wiki/Autopilot",
  "/wiki/Telekinesis",
  "/wiki/Transport",
  "/wiki/Radiant_Blessing",
  "/wiki/Moon",
  "/wiki/Wevo",
  "/wiki/Haileap_system",
  "/wiki/Steady_Wing",
  "/wiki/Attack_on_the_Steady_Wing",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Imri_Cantaros",
  "/wiki/Avon_Starros",
  "/wiki/Senator",
  "/wiki/Ghirra_Starros",
  "/wiki/Avar_Kriss%27_lightsaber",
  "/wiki/Knighting_ceremony",
  "/wiki/The_galaxy",
  "/wiki/Lightsaber",
  "/wiki/Water",
  "/wiki/Distress_signal",
  "/wiki/Kazlin_system",
  "/wiki/T-1_shuttle_(Jedi_Order)",
  "/wiki/Kotabi",
  "/wiki/Shuttle",
  "/wiki/Star_system",
  "/wiki/Starship",
  "/wiki/Docking_tube",
  "/wiki/Breath_mask",
  "/wiki/Gas",
  "/wiki/Attack_in_the_Kazlin_system",
  "/wiki/Unidentified_Hutt_trader",
  "/wiki/Blaster",
  "/wiki/Unidentified_Nihil_sniper",
  "/wiki/Mission_to_Sedri_Minor",
  "/wiki/Vratixia_renanicus",
  "/wiki/Ataraxia",
  "/wiki/Cruiser",
  "/wiki/Mouth",
  "/wiki/Bread",
  "/wiki/Rodian",
  "/wiki/Youngling",
  "/wiki/Reeta",
  "/wiki/Kalo_Sulman",
  "/wiki/Speaker_(Sedri_Minor)",
  "/wiki/Vine",
  "/wiki/Ear",
  "/wiki/Nose",
  "/wiki/Assault_on_Starlight_Beacon",
  "/wiki/Anacondan",
  "/wiki/Gino%27le",
  "/wiki/Daivak",
  "/wiki/Jedi_archivist",
  "/wiki/OrbaLin",
  "/wiki/Amaxine_space_station",
  "/wiki/Wild_Space",
  "/wiki/Meditation_chamber",
  "/wiki/Wayseeker",
  "/wiki/Orla_Jareni",
  "/wiki/Darth_Krall",
  "/wiki/Sith_lightsaber",
  "/wiki/Binding_statues",
  "/wiki/Rseik_sector",
  "/wiki/Agricultural_Hub_42",
  "/wiki/Chortose",
  "/wiki/Chortose_(species)",
  "/wiki/Pango",
  "/wiki/Gru_(Chortose)",
  "/wiki/Unidentified_Nihil_Storm",
  "/wiki/Storm_(rank)",
  "/wiki/Vibro-ax",
  "/wiki/Droid",
  "/wiki/Orla_Jareni%27s_lightsaber",
  "/wiki/Lightseeker",
  "/wiki/Arthropod",
  "/wiki/Cohmac_Vitus",
  "/wiki/Sith",
  "/wiki/Avar_Kriss%27s_network",
  "/wiki/Reath_Silas",
  "/wiki/Valo",
  "/wiki/Vane_Sarpo",
  "/wiki/Battle_of_Galov",
  "/wiki/Relay_Post_Epsilon_One",
  "/wiki/Raleigh",
  "/wiki/Macken",
  "/wiki/Salvage_droid",
  "/wiki/Tasia",
  "/wiki/Lourna_Dee_(cruiser)",
  "/wiki/Andrik_Keller",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Twi%27lek",
  "/wiki/Bacta_tank",
  "/wiki/Nib_Assek",
  "/wiki/Wookiee",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Z-29_Skyhawk",
  "/wiki/Firebird_Squadron",
  "/wiki/Jano_Brayson",
  "/wiki/Self-destruct_mechanism",
  "/wiki/H7-09",
  "/wiki/Teff",
  "/wiki/Stellan_Gios",
  "/wiki/Pan_Eyta",
  "/wiki/Tempest",
  "/wiki/Soola_system",
  "/wiki/Targes_scanner",
  "/wiki/Hyperspace",
  "/wiki/Stormship",
  "/wiki/Battle_of_Grizal",
  "/wiki/Ransacker",
  "/wiki/Zeetar%27s_Tempest",
  "/wiki/Magclamp",
  "/wiki/Crolute",
  "/wiki/Pan_Eyta%27s_Tempest",
  "/wiki/Electro-whip",
  "/wiki/Zeetar",
  "/wiki/Power_armor",
  "/wiki/Nagnol",
  "/wiki/Lepi",
  "/wiki/Lourna_Dee_(prison_ship)",
  "/wiki/Kisma_Uttersond",
  "/wiki/Grizal",
  "/wiki/Loden_Greatstorm",
  "/wiki/Dalna",
  "/wiki/Eiram",
  "/wiki/Jedi_investigator",
  "/wiki/Emerick_Caphtor",
  "/wiki/Sian_Holt",
  "/wiki/Magrak_Syndrome",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/No-Space",
  "/wiki/Battle_for_No-Space",
  "/wiki/Goonral_Monshi",
  "/wiki/Muglan",
  "/wiki/Eiram_system",
  "/wiki/Nooranbakarakana",
  "/wiki/Nameless",
  "/wiki/KC-78",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Hetzal_Prime",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Kriff",
  "/wiki/Language",
  "/wiki/Force_vision",
  "/wiki/Time",
  "/wiki/Force-sensitive",
  "/wiki/Double-bladed_lightsaber",
  "/wiki/Jar%27Kai",
  "/wiki/Jedi_robes",
  "/wiki/Padawan_braid",
  "/wiki/Oxygen",
  "/wiki/Rebreather",
  "/wiki/Star_Wars:_The_High_Republic_(Marvel_Comics_2021)",
  "/wiki/Cavan_Scott",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/2021",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/Justina_Ireland",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Soneela_Nankani",
  "/wiki/Lost_Twenty",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/The_High_Republic:_A_Test_of_Courage_(audiobook)",
  "/wiki/The_High_Republic_(2021)_1",
  "/wiki/The_High_Republic_(2021)_2",
  "/wiki/The_High_Republic_(2021)_3",
  "/wiki/The_High_Republic_(2021)_4",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/The_High_Republic_(2021)_6",
  "/wiki/The_High_Republic_(2021)_7",
  "/wiki/The_High_Republic_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/Star_Wars_Insider",
  "/wiki/Starlight:_Past_Mistakes",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Category:Images_of_Keeve_Trennis",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/The_High_Republic_1_Behind-the-Scenes_Exclusive",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Accessories_and_Structures",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Light_of_the_Jedi"
 ]
}