{
 "name": "Keikana_Herot",
 "display_name": "Keikana Herot",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Keikana Herot was a Human female who served the House of Organa during the Cold War. She was stationed at Wardpost Duvaal, in the Alsakan Lowlands on Alderaan.\nHerot was a scientist from a research background. She was drafted into House Organa's forces under the title of \"Science Commander\" to find weaknesses in the native Killiks, and find out how House Ulgo, under leader Bouris Ulgo, was controlling them to attack Organa forces. She was also the regional supervisor for the House Organa garrison, responsible for research and strategy. Herot felt that she had ultimately earned her command, even if she didn't like it.\nThe area that Wardpost Duvaal was located at was once a staging point against House Ulgo, but they were instead tied up by dealing with the Ulgo-controlled Killiks. A Republic strike team was sent into Killik territory to investigate by capturing a Joiner for examination and questioning, prisoners that had been absorbed into the Killik hive mind. Questioning revealed that Killiks had been kidnapped by House Ulgo to a \"pain factory\", a facility housed in a cave system nearby and were being tortured, thus causing the Killiks to swarm against House Organa.\nThe strike team took down the Ulgo forces in the pain factory and contacted Herot. She revealed that she thought of the Killiks as little more than semi-sentient animals, and wanted to salvage the data and equipment to replicate the torture experiments to turn them against House Ulgo, or at least learn from the combat routines from the Ulgo torture droids for House Organa's defense strategy against Killiks. When the strike team declined to do so she accused them of only thinking of themselves, but later offered to forget their differences.\nNevertheless, one way or another Duke Charle Remmot Organa got word of Herot's intentions to replicate the experiments. Noting that this was not in line with House Organa's goals and that this showed she was not fit for her post, he had her reassigned.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Wardpost_Duvaal",
  "/wiki/Alsakan_Lowlands",
  "/wiki/Alderaan/Legends",
  "/wiki/Killik/Legends",
  "/wiki/House_Ulgo",
  "/wiki/Bouris_Ulgo",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Joiner",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Duke/Legends",
  "/wiki/Charle_Remmot_Organa",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}