{
 "name": "Kelbis Nu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Susevfi"
     ]
    },
    {
     "name": "Died",
     "values": [
      "26 ABY",
      "Eriadu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jensaarai",
      "New Jedi Order",
      "New Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Saarai-kaar"
     ]
    }
   ]
  }
 ],
 "content": "Kelbis Nu was a Force-sensitive Rodian male who grew up on Susevfi as part of the Jensaarai community. The Jensaarai were in enforced service to former Imperial Moff Leonia Tavira, who threatened to kill the population of Susevfi if the Jensaarai did not serve her. Kelbis Nu was one of five Jensaarai that were sent to Courkrus to ambush the Jedi Knight Corran Horn. They lost the encounter when Luke Skywalker arrived to help Horn, and Nu was knocked unconscious. Horn and Skywalker subsequently defeated the leader of the Jensaarai, and forced Tavira to leave Susevfi. Nu later became a member of the New Jedi Order. He fought against the Yuuzhan Vong during the Yuuzhan Vong War, and was later attacked and killed by the Yuuzhan Vong-affiliated Peace Brigade on Eriadu in 26 ABY.\nThe Rodian Kelbis Nu grew up on Susevfi as part of a Sith sect, the Jensaarai. The Jensaarai were led by a female Saarai-kaar who kept the movement growing. Under her leadership, Nu constructed his own orange-bladed lightsaber and a suit of cortosis armor; the latter considered the final test in a Jensaarai's training. Nu was promoted to the rank of Defender, and worked with four other Jensaarai Defenders stationed on ex-Moff Leonia Tavira's Star Destroyer, the Invidious, detecting potential traps set for the woman. Meanwhile, Tavira held the Susevfi population hostage in order to ensure cooperation from the Jensaarai.\nWhile Nu was serving Tavira, she kidnapped the wife of Jedi Knight Corran Horn. In order to track down his wife, Horn infiltrated one of Tavira's pirate squadrons, the Khuiumin Survivors. He then haunted the base, disguising himself as a Jedi Knight. Tavira dispatched Nu and four other Jensaarai to apprehend Horn. They tracked him down on Courkrus and trapped him in an alley, unaffected by the Force illusions he conjured against them. Just as Kelbis and the other Jensaarai were about to attack Horn, however, Jedi Master Luke Skywalker arrived—guided by the Gand Ooryl Qrygg—and helped Horn fight the Jensaarai. While three of the Jensaarai attacked Skywalker, Nu and another fought against Horn. Horn quickly defeated them both, catching Nu by the wrist and knocking him out with a blow from the end of his lightsaber pommel to the right side of his head.\nUsing a ysalamir to confuse the Jensaari, as well as the presence of Skywalker as intimidation, Horn interrogated Nu and the other Jensaarai until they revealed their origins and the location of the Jensaarai base. While Skywalker and Horn traveled to Susevfi to defeat Tavira and rescue Horn's wife, the five Defenders, including Nu, were kept on Courkrus in the custody of the pirate Jacob Nive, remaining under the Force-neutralizing presence of a ysalamir. Horn and Skywalker went on to defeat the Jensaarai and convince their leader, the Saarai-kaar, that the Jedi were not evil as they had believed. Skywalker then extended an invitation for the Jensaarai to join the Jedi and train at the Praxeum. In due course, Kelbis Nu took up this offer and became a Jedi Knight in the New Jedi Order.\nAs a Jedi Knight, Nu took an active role in the Yuuzhan Vong War. It was while monitoring Yuuzhan Vong fleet movements on a trip to Yag'Dhul Station that he discovered the undercover Yuuzhan Vong agent Nom Anor. Fleeing, he was caught on the Outer Rim Territories planet Eriadu by members of the Yuuzhan Vong-affiliated Peace Brigade. Nu was cornered in an alley by five Peace Brigade assailants; two armed with blasters and three with stun batons.\nHis former opponent and now fellow Jedi, Corran Horn, was also on Eriadu at the time, but detected Nu's presence too dimly in the Force to be able to help him. The young Jedi Anakin Solo and Tahiri Veila, however, were much closer and came running to his aid. Still, one of the Peace Brigade members shot Nu before they could arrive. While Solo and Veila managed to chase off the Peace Brigade thugs, they were too late to save Nu's life. Straining with his last breath, Kelbis managed to whisper to the young Jedi the Vong's next target—Yag'Dhul, the homeworld of the mathematical Givin. Though it cost him his life, the information was enough to enable a Givin and New Republic victory at the ensuing Battle of Yag'Dhul.\nAs a Jedi, Kelbis Nu took part in the Yuuzhan Vong War, during which he showed devotion to the safety of the New Republic by using his final breath to warn Solo and Veila of an impending Yuuzhan Vong attack on Yag-Dhul.\nAs a member of first the Jensaarai and later the Jedi Order, Nu was Force-sensitive. Nu was skilled enough to become a Jensaarai Defender, and he was later deemed worthy of the rank of Jedi Knight by Luke Skywalker. His training as a Jensaarai enabled him to see through the Force illusions that Corran Horn once use against him on Courkrus. Nu was skilled in lightsaber combat although he was unable to overcome a heavily armed, five-member Peace Brigade team sent to kill him.\nKelbis Nu was created by Greg Keyes for a brief appearance in the novel The New Jedi Order: Edge of Victory II: Rebirth. Later, Daniel Wallace provided some backstory for Nu in Who's Who in the New Jedi Order, an article in Star Wars Insider 57. This identified Nu as a previously anonymous Rodian member of the Jensaarai, from Michael A. Stackpole's I, Jedi, although Wallace erroneously referred to Nu's first name as \"Kubis\" in his article. Dan Veesenmeyer and Russell Walks illustrated the Insider article, providing the only canonical depiction of the Jedi Knight.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Koobis_Nu",
  "/wiki/Susevfi",
  "/wiki/26_ABY",
  "/wiki/Eriadu/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Jensaarai/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Unidentified_female_Saarai-kaar",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Leonia_Tavira",
  "/wiki/Death/Legends",
  "/wiki/Courkrus",
  "/wiki/Duel_on_Courkrus",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Corran_Horn",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Skirmish_on_Eriadu_(Yuuzhan_Vong_War)",
  "/wiki/Peace_Brigade",
  "/wiki/Sith/Legends",
  "/wiki/Female_Saarai-kaar",
  "/wiki/Lightsaber/Legends",
  "/wiki/Cortosis/Legends",
  "/wiki/Jensaarai_armor",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Invidious",
  "/wiki/Mirax_Terrik_Horn",
  "/wiki/Marriage/Legends",
  "/wiki/Invids",
  "/wiki/Squadron/Legends",
  "/wiki/Khuiumin_Survivors",
  "/wiki/Mind_trick/Legends#Force_illustion",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Gand/Legends",
  "/wiki/Ooryl_Qrygg",
  "/wiki/Lightsaber_hilt/Legends",
  "/wiki/Ysalamir",
  "/wiki/Prison/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Jacob_Nive",
  "/wiki/The_Force/Legends",
  "/wiki/Saarai-kaar",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yuuzhan_Vong_fleet",
  "/wiki/Yag-prime",
  "/wiki/Executor_(Yuuzhan_Vong_rank)",
  "/wiki/Nom_Anor",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Stun_baton/Legends",
  "/wiki/Anakin_Solo",
  "/wiki/Tahiri_Veila",
  "/wiki/Yag%27Dhul/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Givin/Legends",
  "/wiki/Battle_of_Yag%27Dhul_(26_ABY)",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Greg_Keyes",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/Daniel_Wallace",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/Michael_A._Stackpole",
  "/wiki/I,_Jedi",
  "/wiki/Dan_Veesenmeyer",
  "/wiki/Russell_Walks",
  "/wiki/Retcon",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Polyhedron",
  "/wiki/I,_Jensaarai",
  "/wiki/Polyhedron_157"
 ]
}