{
 "name": "Kelek",
 "display_name": "Kelek",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tefaun"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Wheel"
     ]
    }
   ]
  }
 ],
 "content": "Kelek the Blue, also known as Kelek the Insensate, was a Tefaun female banker who purchased the Wheel space station during the latter years of the Galactic Republic. While administrator, she launched the gladiatorial event known as the Big Game, but was eventually forced to sell the station in order to pay back a loan.\nThe Tefaun female Kelek lived during the latter years of the Galactic Republic, and during her life earned the nicknames Kelek the Blue, and Kelek the Insensate. After Skijid Vrescot, the administrator of the Wheel space station and gambling resort, was killed by pirates, Kelek purchased the station and made herself the new administrator. During her time as the station's third administrator, the Tefaun expanded the station's facilities and launched the Big Game, a brutal gladiatorial competition that was held aboard the Wheel. Despite these additions, the Wheel's revenues fell under Kelek's administration due to a loss of wealthy clientele, who despite initial enjoyment of the Big Game, had been deterred from visiting due to an increasing number of scoundrels frequenting the facility. In the hopes that their backing would draw back her patrons, Kelek borrowed money from the InterGalactic Banking Clan; however, after she became unable to meet her payment schedule, the IBC called in her loan. In order to pay, Kelek was forced to sell her shares in the station to the businessman Dominic Raynor sometime prior to 1 BBY.\nKelek earned nicknames describing her as insensate and blue.\nKelek was first mentioned in the first part of Viva Space Vegas! The History of the Marvelous Wheel, and article written by Abel G. Peña and Rich Handley which was published on the StarWars.com blog in 2013.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tefaun",
  "/wiki/Gender/Legends",
  "/wiki/The_Wheel/Legends",
  "/wiki/Banker/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Administrator/Legends",
  "/wiki/Gladiator/Legends",
  "/wiki/The_Big_Game",
  "/wiki/Skijid_Vrescot",
  "/wiki/Gambling/Legends",
  "/wiki/Death/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Scoundrel",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/Dominic_Raynor",
  "/wiki/1_BBY/Legends",
  "/wiki/Viva_Space_Vegas!_The_History_of_the_Marvelous_Wheel",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Rich_Handley",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Blog",
  "/wiki/2013"
 ]
}