{
 "name": "Kellik",
 "display_name": "Kellik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kellik was a Human male soldier who served the Galactic Republic during the Cold War.\nStationed on Ord Mantell, a planet that is in a civil war, Kellik worked inside Fort Garnik's interrogation center where he works to identify separatist collaborators and extract information. One such suspect was a young Human woman named Qo'el, who had attended a few separatist rallies, which gave Kellik probable cause to detain her. Throughout her interrogation, Qo'el insisted that she had no information on the separatists to share, but Kellik refused to believe her and repeatedly beat her until she told him what he wanted to hear.\nKellik was soon confronted by a Republic patriot, who was sent by Qo'el's father, Odar, having been told that his daughter was taken without cause. Kellik attempted to justify his actions, claiming that the courts didn't have the time to deal with every separatist sympathizer, which he believed granted him leeway.\nKellik then offered the Republic hero a more subtle way to get information on the separatists, offering a ring with a listening device inside it and instructed them to return to it Odar and claim that it's the only thing of his daughter's they could find. However, his offer was refused and as the Republic hero drew their blaster, Kellik, unwilling to get in a shootout, agreed to surrender Qo'el, though he contemptuously stated that they were aiding the enemy.\nKellik is a non-player character in the Star Wars: The Old Republic video game, on an Ord Mantell side mission exclusive to players playing either as Smugglers or Republic Troopers.\nWhen Kellik makes his offer to plant a listening device on Odar, the player can either refuse, gaining light side points, or consent, gaining dark side points.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Separatist_War",
  "/wiki/Fort_Garnik",
  "/wiki/Qo%27el",
  "/wiki/Odar",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Kellik"
 ]
}