{
 "name": "Kell Bircher",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chandrila"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Chandrilan Special Forces",
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Kell Bircher was a male Human who was a Rebel spy and nephew of the Rebel leader, Mon Mothma. Following the Battle of Yavin, he used the skills of a Bothan slicer to enter his identity in the Imperial database as a colonel. He was able to parlay his station to become the commander of the Imperial I-class Star Destroyer, Devastator, taking control of the ship from its previous commander, Darth Vader. As commander of the Devastator, he was involved in hunting down the Rebel fleet, personally piloting a TIE interceptor to engage Rebel forces. Bircher was eventually able to track the location of the Rebel fleet after following the Rebel pilot, Prithi, who had skirted protocols of making several different hyperspace jumps before returning to base. In the ensuing attack, Bircher was forced to reveal his double agent status, shutting down his TIE interceptor squadron, and disabling Devastator. The Imperial Star Destroyer was forced to abandon the attack while Bircher turned himself over to Mothma. Although the other Rebels were suspicious of him, Mothma vouched for his character, and he returned to the Chandrila system to continue aiding the Alliance.\nKell Bircher was a Human male from Chandrila and the nephew of the Rebel leader, Mon Mothma. He was a student of political history and was a member of the Chandrilan Special Forces. He eventually became a devoted member of the Rebellion and was chosen for a secret mission for the Rebellion. With the aid of a Bothan slicer, Bircher's name was inserted into the civilian and military databases of the Galactic Empire. He was given the rank of colonel and was able to smuggle himself into Imperial ranks shortly before the Battle of Yavin.\nTwo months after the Battle of Yavin, Bircher was ordered by Emperor Palpatine to take over command of Darth Vader's Star Destroyer, the Devastator. Bircher was assigned Ensign Llona who was to serve as a guide on board the vessel, but the colonel decided that he was well acquainted with the model of ship, and immediatly reassigned the young ensign as his permanent personal assistant. He later briefed a group of TIE interceptor pilots, the best-of-the best who were going to fly advanced models. Bircher wore a red flight suit. He personally led two squadrons of those pilots in an ambush of Gray Flight. When the Rebel X-wings launched proton torpedoes and destroyed eleven interceptors, he did not authorize a withdrawal. Instead, he called for evasion pattern Delta Delta Victor. The Rebels were able to escape from the ambush.\nWhen the Devastator chased the Rebels to their next ambush point, Bircher led the remaining Interceptors to face Gray Flight. The Rebels launched more torpedoes, and Bircher confirmed that they were going to miss the Star Destroyer. However, the Rebels were actually targeting a fusion generator, which blew up. Bircher, at the last moment, realized that the Rebels were retreating and ordered his own forces to fall back. He then activated his hyperdrive to escape to rendezvous coordinates Beta One. The Devastator escaped, although their Interdictor was heavily damaged. Later, aboard the Devastator, Bircher ordered updates on damage reports.\nShortly afterward, he was aboard the Devastator at a no-fly zone with an Imperial fleet. He ordered a shuttle piloted by the Rebels Luke Skywalker and Wedge Antilles to stand down and prepare to be boarded. He ordered a search, and then greeted Lieutenant Birra Seah as she arrived on the bridge. Bircher followed the Alliance Fleet and when they arrived at the coordinates, ordered all of his TIE fighters to launch. He planned on joining them himself. As the Devastator opened fire on the fleet, Bircher led his group into range. At two kilometers out, he ordered them to open fire. During the battle, he transmitted external control of the Imperial fighters over to Home One and jammed tactical communications. He then crashed aboard Hangar Five on the cruiser and met his aunt, Mon Mothma.\nBircher revealed himself as a Rebel spy and was forced to explain his actions to members of Gray Flight, claiming that he had always had a backup plan to shut down weapons control of his forces if he believed that they might kill any Rebel pilots. Although Wedge Antilles offered Bircher a position in the newly formed Rogue Squadron from the remains of Gray Flight, he was forced to decline as he had business back in the Chandrila system. As he departed, he complimented Gray Flight's leader, Leia Organa, claiming that she was a \"damn fine pilot\".\nIn response to Bircher's infiltration, Darth Vader embarked on a secret mission to eliminate the hackers who had placed him into the system, and to purge those who had fallen into his deception. Vader's search eventually brought him to Chandrila, but Bircher was not at the Mothma home at the time when Vader destroyed it.\nEmperor Palpatine considered him a young and capable officer. When he arrived aboard the Devastator, he stated he had already taken precautions to ensure that he was prepared for anything.\nHe disregarded the lives of his men, speaking of how it was their moment of triumph. He was able to recognize a trap when the Rebel starfighters began retreating.\nHe considered himself an Imperial pilot above all else, and did not hesitate to tell his subordinates as such. He saw pilots as precision instruments and not bombs.\nBircher appears in Dark Horse Comics Star Wars: In the Shadow of Yavin comic book arc which was written by Brian Wood. He appeared in the following series, which revealed that he was a Rebel spy under the direct command of Mon Mothma.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chandrila/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Chandrilan_Special_Forces",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Devastator/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Prithi",
  "/wiki/Hyperspace/Legends",
  "/wiki/Attack_on_the_Rebel_Fleet",
  "/wiki/Chandrila_system/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/Llona",
  "/wiki/TIE_pilot",
  "/wiki/Flight_suit/Legends",
  "/wiki/Ambush_of_Gray_Flight",
  "/wiki/Power_fusion_generator",
  "/wiki/Unidentified_Interdictor-class_Star_Destroyer_(ambush_of_Gray_Flight)",
  "/wiki/Shuttle/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Birra_Seah",
  "/wiki/Home_One/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars:_In_the_Shadow_of_Yavin",
  "/wiki/Brian_Wood",
  "/wiki/Star_Wars_(2013)_1",
  "/wiki/Star_Wars_(2013)_2",
  "/wiki/Star_Wars_(2013)_3",
  "/wiki/Star_Wars_(2013)_5",
  "/wiki/Star_Wars_(2013)_6",
  "/wiki/Star_Wars_(2013)_7",
  "/wiki/Star_Wars_(2013)_10",
  "/wiki/Star_Wars_(2013)_11",
  "/wiki/Star_Wars_(2013)_12",
  "/wiki/Star_Wars_(2013)_13",
  "/wiki/Star_Wars_(2013)_14",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_(1977)_21",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Mulchive_Wermis",
  "/wiki/0_ABY/Legends"
 ]
}