{
 "name": "Kell Douro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "41.5 ABY",
      "Frozen moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anzat"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith"
     ]
    }
   ]
  }
 ],
 "content": "Kell Douro was a Force-sensitive male Anzat assassin and spy employed by the One Sith around 41.5 ABY. He claimed to be able see the daen nosi, the \"Lines of Fate,\" and was convinced that they contained a pattern which he came close to understanding when he fed on the soup of enlightened beings.\nAfter centuries of feeding, Kell Douro believed that only by feeding on a Jedi or a Sith could the fabric of Fate be revealed to him. One such Jedi was Jaden Korr.\nCenturies old and a Force-sensitive male Anzat, Kell Douro was trained as an assassin and a spy. Kell captured being that he held in his ship and later used as food, consuming their brain matter that he referred to as their \"soup\". Kell had performed services for the Galactic Empire, and decades later in 41.5 ABY, he often worked for the One Sith, and was once more called to Korriban where he was met by Darth Wyyrlok I. Wyyrlok ordered Kell to travel to the planet Fhost, wait for a sign and report back to the Sith. Wyyrlok also strongly hinted that Kell might find the \"enlightened being\" he was searching for on Fhost.\nOnce in the Black Hole cantina on Fhost, Kell saw Jedi Knight Jaden Korr and noticed that his Fate lines were entangled with his own. Convinced that it was his destiny to find revelation by consuming Jaden's soup, the Anzat secretly followed the Jedi, who was on his own search for revelation. Kell tracked Korr to a secret cloning lab on a Frozen moon, the location of which was his actual objective. There, he encountered Khedryn Faal, who had brought Jaden there. Moments before killing Faal, he decided that he would feed on no one but Jaden Korr, Kell left Faal wounded and unarmed in the upper level research lab. In the lower level he found Jaden Korr, exhausted from his fight with a mad clone of Kam Solusar, unable to resist the Anzat. Preparing to feed on Korr's soup, Kell suddenly saw his own silver daen nosi coming to an abrupt end rather than consuming the Jedi's. Faal had armed himself with a E-11 and shot Kell in the head, killing the Anzat instantly.\nKell Duoro owned two Cortosis-coated Vibroblades and had a Mimetic suit he used to sneak up on targets. He flew a heavily modified CloakShape fighter, Predator with a hyperdrive sled and stasis containers to store to feed on in space.\nKell Douro was created by Paul S. Kemp for his novel Crosscurrent.\nKell's perception of the daen nosi was similar to Jax Pavan's perception\nof the Force. However, this may be purely coincidence.\nThough Anzati usually lacked hearts, it is stated in Crosscurrent that he had two hearts.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/41_ABY",
  "/wiki/Frozen_moon",
  "/wiki/Anzat_(species)",
  "/wiki/Gender/Legends",
  "/wiki/One_Sith",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Daen_nosi",
  "/wiki/Soup_(Anzati)",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jaden_Korr",
  "/wiki/Darth_Wyyrlok_(I)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Korriban",
  "/wiki/Planet/Legends",
  "/wiki/Fhost",
  "/wiki/Black_Hole_(Fhost)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Khedryn_Faal",
  "/wiki/Alpha_(clone)",
  "/wiki/Kam_Solusar",
  "/wiki/E-11b_blaster_rifle",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Kell_Douro",
  "/wiki/Cortosis/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Mimetic_suit/Legends",
  "/wiki/CloakShape_fighter/Legends",
  "/wiki/Predator_(Kell_Douro%27s_ship)",
  "/wiki/Hyperdrive_sled",
  "/wiki/Paul_S._Kemp",
  "/wiki/Crosscurrent",
  "/wiki/Jax_Pavan",
  "/wiki/Riptide_(novel)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Jedi_Council_Forums",
  "/wiki/February_10",
  "/wiki/2013"
 ]
}