{
 "name": "Kelly_Vermillion",
 "display_name": "Kelly Vermillion",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human/Orlak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Kelly Vermillion was a Human/Orlak halfbreed of slight build, with red hair and light red fur on his extremities. He had pointy ears and a prehensile \"nasty-looking\" tail. He stood roughly five-and-a-half feet tall, or 1.67 meters. He always carried around enough weapons to take out an entire bar single-handedly. He kept these weapons well hidden, but keen eyes could still notice them.\nKelly's alien appearance generally made him stand out in a crowd but, if not, then his penchant for being a walking armory would. He carried around a knife in a jeweled scabbard, but preferred using his two vibroblades in combat. Nobody was quite sure as to what the purpose of the knife was, perhaps just for show. He was known to have a short fuse; not unlike the explosives he loved to use, generally carrying around two grenades at any time. However, a bad accident with a thermal detonator made him leery of explosives in other people's hands.\nHe was known for having the right tool for any job, but was very capable of making  primitive weapons or gadgets from scraps of machinery.\nHe was the leader of a smaller group, including Tyric and Nana. While they were on the planet Mandrine, in a bar called Maizie's, they met up with the smuggler Captain Scarlet Bloodhawk. While they were talking with him, a thug known as Kronus and his goons came into the bar and caused a brawl. While Bloodhawk and other patrons of the bar took cover, Kelly and his group fought and killed Kronus and his goons. Afterward, they headed into the Rebel base on the planet, where a Proliferan called Red was thrown into the group.\nAfter leaving the planet, Kelly and his group of misfits went to the planet Kessel, where they somehow acquired the starship Long Shot in the spice mines. Shortly afterward, they rechristened the ship the Menagerie in honor of their ragtag group.\nSoon afterward, the group joined the Rebellion officially, and were caught up in the resettling after the apparent treason of the droid VDT-1E. Red was eventually discovered to be a spy for the Proliferan Empire and was imprisoned for his espionage activities. This was a blow to Kelly, as he trusted the ant and believed he could be reformed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Orlak",
  "/wiki/Gender/Legends",
  "/wiki/Polyhedron_59",
  "/wiki/Hair/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Foot/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Eye/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Scabbard/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Tyric_(Shaliz%27Na)",
  "/wiki/Nana",
  "/wiki/Planet/Legends",
  "/wiki/Mandrine/Legends",
  "/wiki/Maizie%27s",
  "/wiki/Smuggler/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Scarlet_Bloodhawk",
  "/wiki/Kronus",
  "/wiki/Proliferan",
  "/wiki/Spy_189",
  "/wiki/Kessel/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Menagerie",
  "/wiki/Spice/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Droid/Legends",
  "/wiki/VDT-1E",
  "/wiki/Spy/Legends",
  "/wiki/Proliferan_Empire",
  "/wiki/Polyhedron",
  "/wiki/The_New_Rogues_Gallery:_Unsung_Heroes_of_the_Rebellion"
 ]
}