{
 "name": "Kell Lapaz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Lok"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Kell Lapaz was a male Bith mercenary who lived during the time of the Galactic Civil War.\nAfter the Battle of Yavin, Kell Lapaz and his group of mercenaries were recruited by the Galactic Empire to ensure the security of a secret Imperial research facility on the planet Lok. Because of a feud between General Otto, the commander of the Imperial garrison on Lok, and Imperial officers in charge of research facility, these officers deployed mercenaries and battle droids to guard the facility instead of requisitioning Otto's troops. The mercenaries were led by Udo Barnet and Kell Lapaz, with Barnet commanding many activities in the facility beyond security. However, the work at the Imperial Research Facility was quite boring for the mercenaries and some of them including Kell Lapaz, Udo Barnet, Kendo Ryzak, Platt Pareja, Goll Bardok and Jeran Tarven, found themselves involved in illegal activities. As they frequently meddled in the affairs of the Lok Revenants, the most powerful criminal organization on Lok, they provoked the ire of their leader: the warlord Nym.\nIn 1 ABY, Nym and his lieutenant Kole decided to raid the Imperial research facility to steal the weapons developed there. As the criminals were planning their operation, Grenz Zittoun, another lieutenant of Nym, realized that the attack on the facility could be an unique opportunity to get rid of some annoying mercenaries. A group of spacers affiliated with the Lok Revenants then assaulted the research facility. They had to fight numerous mercenaries to get access to the research complex but they finally retrieved experimental weapons and research data. During the battle, a group of Revenants attacked Kell Lapaz and Udo Barnet and killed them in the ensuring firefight.\nKell Lapaz was a Non-Player Character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Kell Lapaz was added to the game as part of the revamped \"Nym's Theme Park,\" released with the \"Game Update 16,\" on March 23, 2010.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Grenz_Zittoun",
  "/wiki/Mercenary/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Imperial_Research_Facility_(Lok)",
  "/wiki/General/Legends",
  "/wiki/Otto",
  "/wiki/Imperial_Outpost_(Lok)",
  "/wiki/Officer/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Udo_Barnet",
  "/wiki/Kendo_Ryzak",
  "/wiki/Platt_Pareja",
  "/wiki/Goll_Bardok",
  "/wiki/Jeran_Tarven",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Kole",
  "/wiki/Spacer/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_23",
  "/wiki/2010",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}