{
 "name": "Kenner Loring",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "204th Imperial Fighter Wing",
      "Imperial Officer Corps",
      "Imperial Army",
      "204th Imperial Fighter Wing",
      "Imperial Officer Corps",
      "Kenner Loring's faction"
     ]
    }
   ]
  }
 ],
 "content": "Kenner Loring was a human male officer who served in the army of the Galactic Empire. After attending the Imperial Academy of Uyter, he came to lead the Empire's 204th Imperial Fighter Wing and eventually held the rank of grand general by the late Galactic Civil War. Following the Emperor's death at the Battle of Endor, Loring's own splinter group of the Empire became an obstacle to Fleet Admiral Gallius Rax, the \"de facto\" ruler of the fractured Empire. Loring conspired with Commander Valent, but Rax learned of their relationship and had the commander killed.\nAt the beginning of his military career, Loring attended the Galactic Empire's officers' academy on the planet Uyter, along with the future commander, Valent. At some point prior to the Battle of Endor, which occurred in 4 ABY, Loring had command over the 204th Imperial Fighter Wing, using his position as leverage to rise the ranks of the Imperial Military. By the late Galactic Civil War, Loring held the rank of Grand General in the Imperial Army, which had once been held by Cassio Tagge before he perished between 0 ABY and 1 ABY. A number of Imperial individuals, including Rae Sloane, wondered why the grand general received his position over General Hodnar Borrum, a longtime veteran of the Empire.\nFollowing the death of Emperor Palpatine at the Battle of Endor, the Empire fragmented. While Fleet Admiral Gallius Rax claimed de facto rule of the Empire, Loring and an Imperial faction became an obstacle for Rax. In 5 ABY, The grand general conspired with Commander Valent, who was allied with Rax, and entrenched himself on the planet Malastare. After concluding Valent to be a potential dissenter, Rax used messages from Grand Admiral Rae Sloane's station to lead Valent and his Star Destroyer, the Scythe, into a New Republic trap with the help of Sloane's aide Adea Rite. The commander was lost along with his vessel.\nA human male, Kenner Loring utilized his leadership of the 204th Imperial Fighter Wing as a stepping stone to greater opportunities with in the Imperial military hierarchy, not acknowledging the true potential of the fighter wing. After the Emperor's death, the grand general became a challenge for Gallius Rax's leadership and conspired with one of the fleet admiral's associates, Commander Valent.\nKenner Loring was first mentioned in the 2016 novel Aftermath: Life Debt, written by Chuck Wendig.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Kenner_Loring%27s_faction",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_Academy_of_Uyter",
  "/wiki/Military_rank",
  "/wiki/Grand_General",
  "/wiki/Galactic_Civil_War",
  "/wiki/Darth_Sidious",
  "/wiki/Death",
  "/wiki/Battle_of_Endor",
  "/wiki/Fleet_Admiral",
  "/wiki/Gallius_Rax",
  "/wiki/Shadow_Council",
  "/wiki/Commander",
  "/wiki/Valent",
  "/wiki/Imperial_Military",
  "/wiki/Planet",
  "/wiki/Uyter",
  "/wiki/4_ABY",
  "/wiki/Imperial_High_Command",
  "/wiki/Cassio_Tagge",
  "/wiki/0_ABY",
  "/wiki/1_ABY",
  "/wiki/Rae_Sloane",
  "/wiki/General",
  "/wiki/Hodnar_Borrum",
  "/wiki/Galactic_Emperor",
  "/wiki/Endor",
  "/wiki/5_ABY",
  "/wiki/Malastare",
  "/wiki/Grand_Admiral",
  "/wiki/Star_Destroyer",
  "/wiki/Scythe_(Star_Destroyer)",
  "/wiki/New_Republic",
  "/wiki/Aide",
  "/wiki/Adea_Rite",
  "/wiki/Starship",
  "/wiki/Fighter_wing",
  "/wiki/Emperor",
  "/wiki/Fleet",
  "/wiki/Admiral",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Chuck_Wendig",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/Darth_Vader_(2015)_25",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}