{
 "name": "Kentara",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kentara was a male Wookiee who became a member of the Alliance to Restore the Republic.\nKentara was a male Wookiee who served the Alliance to Restore the Republic during the Galactic Civil War. Shortly after the Battle of Yavin, Kentara disappeared. No one was sure of his whereabouts, but rumors circulated that Kentara was on a secret mission for General Airen Cracken. Kentara was on the planet Bundim in the Trax sector during an Imperial assault on the planet, and was captured at the Battle of Heg. The Imperials did not know of Kentara's importance to the Alliance, and he ended up in the possession of Harthusa, a Devaronian slaver based on Deysum III. During an auction, Kentara was sold to Quintarus Returyl, a representative of the Spice Mines of Kessel. However,\nan Alliance team witnessed the auction and recognized Kentara; they were on Deysum III investigating the construction of an Imperial resupply depot in the Bissillirus system. The same night, the Alliance agents rescued Kentara and the other slaves being held in the slave camp outside the city. Following his rescue, Kentara insisted on returning to Bundim to aid the continuing fight against the Empire. Providing his rescuers with all the knowledge he had regarding the occupation forces on the planet, the Alliance team braved the Imperial blockade of the planet and returned Kentara to the remains of the Alliance forces on the planet, under the command of the Mon Calamari Kray'geen T'ihar.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bundim",
  "/wiki/Trax_sector",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Battle_of_Heg",
  "/wiki/Harthusa",
  "/wiki/Devaronian/Legends",
  "/wiki/Slaver/Legends",
  "/wiki/Deysum_III",
  "/wiki/Quintarus_Returyl",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/Bissillirus_system",
  "/wiki/Slavery/Legends",
  "/wiki/City/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Kray%27geen_T%27ihar",
  "/wiki/West_End_Games",
  "/wiki/Rebel_Enslaved!",
  "/wiki/Star_Wars_Gamemaster_Kit",
  "/wiki/Classic_Campaigns",
  "/wiki/Return_to_Bundim",
  "/wiki/All_Our_Sins_Remembered"
 ]
}