{
 "name": "Keoulkeech",
 "display_name": "Keoulkeech",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Red Bush Grove",
      "Bright Tree Village"
     ]
    }
   ]
  }
 ],
 "content": "Keoulkeech was an Ewok shaman and the older brother of Leektar.\nGrowing up in Red Bush Grove, Keoulkeech surpassed Leektar in many areas, including healing and animal bonding. Leektar grew jealous of Keoulkeech and prayed to the Leaf Queen to gain greater status within his tribe; this resulted in an electrical fire spreading across Red Bush Grove, killing all but Leektar and Keoulkeech, though neither of them knew the other was alive. Keoulkeech fought in Chief Chirpa's attack group during the Battle of Endor, working afterwards to cure the forest of its pain. It was during this time that he discovered that he could communicate with the Great Trees of the forest moon, telling him which of them needed aid. Keoulkeech was soon reunited with his younger brother, who had become an Honorary Elder in Bright Tree Village.\nHowever, this reunion was not to last. After his healing mission was completed, Keoulkeech visited Salfur's Trading Post, where he saw a Carosite medical transport laden with supplies bound for Yir Tangee. Keoulkeech realized that his healing talents were needed beyond just the forest, and departed with it. He became a passenger aboard the Carosite medical frigate Sudden Restoration, bringing medical service to worlds ravaged by the Galactic Civil War. He also became an associate of the Bith musician Ballifore Figg and the Bimm bard Vasnish Kay.\nKeoulkeech received his first Hasbro action figure in 2008, as part of an Ewok three-pack including Machook and Kettch, the packaging of which appears to indicate that an Ewok named Keoulkeech participated in a conflict with the Lahsbees after the Battle of Endor. The San Diego Comic Con  2008: Hasbro Star Wars presentation announcing future figures to be released initially identified Keoulkeech as a dark-furred Ewok wearing a red hood; however, Keoulkeech was later released as a tan-colored Ewok wearing a purple hood, the Ewok initially identified as Machook.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Endor/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Red_Bush_Grove",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Shaman/Legends",
  "/wiki/Leektar/Legends",
  "/wiki/Leaf_Queen",
  "/wiki/Chirpa/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Salfur%27s_Trading_Post",
  "/wiki/Carosite",
  "/wiki/Yir_Tangee/Legends",
  "/wiki/Sudden_Restoration",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Ballifore_Figg",
  "/wiki/Bimm_(Near-Human)",
  "/wiki/Vasnish_Kay",
  "/wiki/Hasbro_Inc.",
  "/wiki/Machook",
  "/wiki/Kettch",
  "/wiki/Lahsbee/Huhk",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars_(1977)_94",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Arthur_Papadam",
  "/wiki/StarWars.com"
 ]
}