{
 "name": "Kerred_Santhe_the_Second",
 "display_name": "Kerred Santhe the Second",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Santhe/Sienar Technologies"
     ]
    }
   ]
  }
 ],
 "content": "Kerred Santhe the Second was a male Human who was the son of industrialist Kerred Santhe, the Chief Executive Officer of Santhe/Sienar Technologies. Following his father's death at the hands of the Sith Lord Darth Plagueis, the younger Santhe inherited ownership of his father's company and became the corporation's new leader. He embarked on a life of drinking and gambling. He reached debts of several millions of credits to the criminal organization Black Sun which threatened to publicize Santhe's predicament if the debts were not paid. Santhe feared that such a scandal would persuade the board of Santhe/Sienar to fire him and appoint his rival Narro Sienar as the corporation's new CEO, so he enlisted the help of a certain Force-sensitive Shi'ido gambler, who earned large amounts of gambling winnings and paid them into Santhe's bank account. However, Plagueis eventually learned of the Shi'ido's activities and put a stop to them and Sienar eventually succeeded Santhe as CEO.\nKerred Santhe the Second was mentioned in the 2012 novel Darth Plagueis written by James Luceno.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kerred_Santhe",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Santhe/Sienar_Technologies",
  "/wiki/Chief_Executive_Officer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Black_Sun/Legends",
  "/wiki/Narro_Sienar",
  "/wiki/Unidentified_Shi%27ido",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Shi%27ido",
  "/wiki/2012",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/James_Luceno",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/67_BBY"
 ]
}