{
 "name": "Kerritamba",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kerritamba Village"
     ]
    }
   ]
  }
 ],
 "content": "Chief Kerritamba was the Wookiee leader of Kerritamba Village during the time of the Galactic Civil War. Kerritamba led an ongoing fight to protect his people and Kkowir Forest from the Sayormi clans of the Dead Forest.\nEarly in the Galactic Civil War, the Great Tree of his village became diseased, leading to Kerritamba wanting a cure for it. To this end, he recruited an individual to go to the Myyydril Caverns and retrieve the cure's ingredients, which included a Nak'tra crystal, Luilris mushrooms, and a Urnsor'is' egg sac.\nOnce his recruit returned, he sent the being back to retrieve an Osera seed from a Mouf, Webweaver silk, a Ranrt crystal, and finally a Mysess blossom. Using all of these ingredients, he created a cure for the tree, and rewarded the individual with the Blade of Nyenthi'Oris and 5,000 credits. Shortly thereafter he went back to fighting the Sayormi.\nOnce again, he called on the aid of an outsider, pleading for the individual to help by killing twenty Sayormi, Cyrans the Unfeeling and the Sayormi Queen. Unfortunately, this angered the Village Champion, Wirartu, who thought only he was worthy of such a task. Wirartu challenged the outsider to a duel and lost in the arena . The individual then returned to Kerritamba and was awarded the Champion's sword and an Arena Champion badge.\nKerritamba was a non-playable character in Star Wars Galaxies prior to the game's closure on December 15, 2011. He was added in the Rage of the Wookiees expansion pack in 2005. It was possible for the player to not spare Wiratu's life, instead killing him. This forced Kerritamba to exile the player from the village, after which the player began doing quests for the Outcasts, which eventually led to Kerritamba's death. No official source ever set a canonical outcome.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kerritamba_Village",
  "/wiki/Chief/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Kkowir_Forest",
  "/wiki/Sayormi",
  "/wiki/Dead_Forest_(Kashyyyk)",
  "/wiki/Great_Tree_(Kashyyyk)",
  "/wiki/Myyydril_Caverns",
  "/wiki/Nak%27tra_crystal",
  "/wiki/Luilris_mushroom",
  "/wiki/Urnsor%27is",
  "/wiki/Egg/Legends",
  "/wiki/Osera_seed",
  "/wiki/Mouf",
  "/wiki/Wyyyschokk/Legends",
  "/wiki/Ranrt_crystal",
  "/wiki/Mysess_blossom",
  "/wiki/Tree/Legends",
  "/wiki/Blade_of_Nyenthi%27Oris",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Cyrans",
  "/wiki/Sayormi_Queen",
  "/wiki/Arena_Champion",
  "/wiki/Wirartu",
  "/wiki/Champion%27s_sword",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/December_15",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/2005",
  "/wiki/Outcasts_(Kashyyyk)",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Squadrons_Over_Corellia",
  "/wiki/Template:SWGTCG"
 ]
}