{
 "name": "Kes Dameron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Special Forces Trackers Unit",
      "Endor strike team",
      "Special Forces Trackers Unit",
      "Endor strike team",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kes Dameron was a human male soldier who served as a sergeant in the Alliance to Restore the Republic during the Galactic Civil War. He was married to Shara Bey, a Rebel pilot, with whom he had a son named Poe. They both fought against the Galactic Empire in the Battle of Endor, during which Dameron was part of the Pathfinders, a special forces strike team led by General Han Solo that destroyed the Death Star II's deflector shield generator. After the Empire's defeat during the battle, both Dameron and Bey participated in an assault on an outpost manned by Imperial holdouts on Endor.\nDameron fought with the Pathfinders for the next several weeks, including the raid at the Wretch of Tayron. After fighting their way into an Imperial Security Bureau black site, the team was able to gain data needed to uncover and stop Operation: Cinder, an Imperial operation designed to destroy numerous worlds to avenge the death of the Emperor, Darth Sidious, who had been killed during the Battle of Endor. Three months after the raid, Dameron and Bey both left Rebel service and began a new life together. At their new home on Yavin 4, they planted a fragment of a Force-sensitive tree, one that had once dwelled at the heart of the Jedi Temple on Coruscant, after it had been gifted to Bey by Commander Luke Skywalker.\nKes Dameron attended a university, where he took two architecture courses, though he barely passed one.\nKes Dameron was a soldier in the Alliance to Restore the Republic during its fight against the Galactic Empire in the Galactic Civil War. He was married to Rebel pilot Shara Bey, with whom he served in the Rebel Alliance, and together they had a son, Poe. Because of their service in the Rebellion, Dameron and Bey only saw each other for short periods of time, often for hour-long intervals after several weeks apart. Despite their separation, they eventually started their family with the birth of their son, Poe, in 2 ABY. Poe lived with Bey's father as his parents continued their service, with both Dameron and Bey unable to frequently visit him.\nAt Hoth, Dameron helped design Echo Base. With Bey he used an A-wing cannon to carve out tunnels for the base. As they worked, one of the tunnels collapsed and the pair were trapped. Dameron offered Bey his equipment so she could survive long enough to be rescued. She refused to let him die, but both were rescued by Commander Luke Skywalker and Chewbacca. Dameron and Bey were then taken aboard a EF76 Nebulon-B escort frigate for medical treatment.\nFollowing the Battle of Hoth, Dameron was aboard a CR90 corvette with rest of the Pathfinders. He watched as his wife's Green Squadron fought off TIEs during a battle at Rendezvous Point Delta-Three.\nEventually Dameron became a sergeant, and during the Battle of Endor, he fought as part of a special-forces group known as the Pathfinders under the command of General Han Solo. The group's objective was to destroy the generator powering the shield for the orbiting DS-2 Death Star II Mobile Battle Station, which would allow the Alliance Fleet to destroy the battle station. The plan was successful; the Death Star was destroyed, the Emperor, Darth Sidious, was killed, and the Empire was dealt a crippling blow before retreating from Endor. Dameron and the surviving Pathfinders returned to Bright Tree Village, the home of the native Ewoks who helped them win the battle, where they and others in the Rebellion celebrated their victory over the Empire. Many of the Alliance pilots and other personnel also ferried down to the village, including Bey, who flew with Green Squadron during the battle to destroy the Death Star. They were relieved to find one another safe and sound, and they took a walk through the village to talk about their future and what they would do with the war coming to an end. They then spent the night together.\nThe next morning, Solo reassembled the Pathfinders and informed them that a group of Imperials was still holding out in an outpost on the far side of Endor. Solo intended to attack the base, not wanting to leave a group of Imperials on Endor after the Ewoks helped the Alliance in the battle. Dameron and the rest of the Pathfinders would assault the outpost, while Bey volunteered to pilot the gunship that would transport the soldiers to the base. The gunship soon arrived and assaulted the outpost, and the Pathfinders deployed into the area. As he disembarked from the gunship, Dameron told Bey that he was ready to settle down on another planet and build a house. Dameron and the Pathfinders fought their way into the base, where they found Imperial intelligence suggesting that the Empire still had plans for the galaxy, before returning to the ship. Dameron and Bey were soon sent on separate assignments, with Dameron continuing to serve alongside General Solo. His duties necessitated a communications blackout, so he was unable to speak with Bey for several weeks.\nTwenty days after the Battle of Endor, Dameron fought with the Pathfinders in a raid on the Wretch of Tayron, the location of an Imperial Security Bureau black site in the Outer Rim Territories. He and Sakas, a fellow Pathfinder, performed reconnaissance before the raid began, while other members of the strike team set up charges to infiltrate the secret base. Dameron and other Pathfinders fired several shots at the base, taking out All Terrain Scout Transports and other heavy equipment. The Pathfinders moved in, with Dameron having cleared a hole, and began fighting the stormtroopers stationed outside the base. Dameron was nearly shot by a scout trooper, but he was saved by Chewbacca, General Solo's Wookiee companion, who attacked the trooper before he could kill Dameron. Solo soon arrived and reviewed the plan of attack, at which point they entered the base.\nThe Pathfinders fought their way through the base and captured its commander before he could purge the data from the ISB computer banks. The commander surrendered, and the Rebels, using the protocol droid C-3PO, hacked into the computers. Once inside the computers, Threepio discovered that an Imperial operation known as Operation: Cinder was underway, including on Naboo—where Bey was located, as she was serving as the personal pilot of Princess Leia Organa. With Naboo under heavy, world-ending siege to enact the Emperor's final wrath, a Rebel fleet under the command of General Lando Calrissian made their way to Naboo. They were able to rescue Bey and Organa, who, along with Queen Sosha Soruna, flew a mission to destroy the Imperial satellites being used in an attempt to destroy Naboo. The Rebels stopped the Empire from destroying Naboo, and Dameron reunited with Bey on the Rebel fleet. For his actions during the raid at the Wretch of Tayron, as well as the assault on the Imperial base on Endor, General Solo remarked in a letter to General Madine that Dameron had performed several acts of valor.\nThree months later, Dameron put in a request to end his service to the Rebel Alliance. The paperwork was approved, and Bey also faced a decision of whether she wanted to leave the Rebellion. Bey eventually chose to follow in her husband's footsteps. After a final mission with Skywalker, in which Bey helped save and was given ownership of a fragment of a Force-sensitive tree that once dwelled in the Jedi Temple on Coruscant, she too ended her service to the Rebel Alliance. Dameron and Bey settled on Yavin 4, where they planted the tree from the Jedi Temple.\nFollowing the war, Dameron and his family continued their life on Yavin 4. Dameron enjoyed telling his son war stories in contrast to his wife. However, when Poe was just eight, Bey unexpectedly died. Dameron was grief-stricken and became overprotective of his son, who wanted to become a pilot just like his mother. Dameron leaned heavily on his wife's friend L'ulo L'ampar for support, and the Duros played a key role in his son's upbringing. As Poe grew up, Dameron's attitude clashed with his son, who wanted to be more free and experience the galaxy in contrast to Dameron's intent to protect his son. In Poe's teenage years, he began to get in trouble for various things, including flying starships without permission. Dameron used his status to bail his son out, but despite this, the rift between them grew. When Poe joined the Spice Runners of Kijimi, Kes pursued him with aid from L'ulo.\nKes Dameron was a human male with black hair, brown eyes, and tan skin. He loved his wife, Shara Bey, and wanted to start a new life with her after the Empire's defeat in the Battle of Endor, including building a home on another world. Such dreams of the future were ideas he never let himself have before the Battle of Endor, due to the struggles of the Galactic Civil War. Three months after the Battle of Endor, however, they both retired from Rebel service and began a new life together.\nKes Dameron was created for the 2015 comic book Shattered Empire 1 by Greg Rucka, with art by Marco Checchetto. The issue identified him as the Rebel soldier who was seen briefly in one of the scenes in Star Wars: Episode VI Return of the Jedi throwing a shaped charge to Han Solo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dameron",
  "/wiki/Shattered_Empire_1",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/An_Echo_of_Victory",
  "/wiki/Star_Wars_(2020)_1",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/Star_Wars_(2020)_6",
  "/wiki/Star_Wars:_Operation_Starlight",
  "/wiki/Star_Wars_(2020)_15",
  "/wiki/Star_Wars_(2020)_19",
  "/wiki/Star_Wars_(2020)_21",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Star_Wars_(2020)_23",
  "/wiki/Star_Wars_(2020)_24",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Poe_Dameron:_Free_Fall",
  "/wiki/Before_the_Awakening",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/The_Rebel_Alliance",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/Endor_strike_team",
  "/wiki/New_Republic",
  "/wiki/Rebel_trooper",
  "/wiki/Sergeant",
  "/wiki/Galactic_Civil_War",
  "/wiki/Marriage",
  "/wiki/Shara_Bey",
  "/wiki/Rebel_pilot",
  "/wiki/Poe_Dameron",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Endor",
  "/wiki/General",
  "/wiki/Han_Solo",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Deflector_shield_generator",
  "/wiki/Assault_on_an_Imperial_outpost",
  "/wiki/Imperial_outpost_(Endor)",
  "/wiki/Endor",
  "/wiki/Standard_week",
  "/wiki/Raid_at_the_Wretch_of_Tayron",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Operation:_Cinder",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Standard_month",
  "/wiki/Dameron_homestead",
  "/wiki/Yavin_4",
  "/wiki/Great_Tree_(Coruscant)",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Commander",
  "/wiki/Luke_Skywalker",
  "/wiki/University",
  "/wiki/Architect",
  "/wiki/Standard_hour",
  "/wiki/2_ABY",
  "/wiki/Shara_Bey%27s_father",
  "/wiki/Hoth",
  "/wiki/Echo_Base",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/RG-9_laser_cannon",
  "/wiki/Chewbacca",
  "/wiki/EF76_Nebulon-B_escort_frigate",
  "/wiki/Battle_of_Hoth",
  "/wiki/CR90_corvette",
  "/wiki/Green_Squadron_(Rebel_Alliance)",
  "/wiki/TIE_line",
  "/wiki/Battle_at_Rendezvous_Point_Delta-Three",
  "/wiki/Rendezvous_Point_Delta-Three",
  "/wiki/Deflector_shield",
  "/wiki/Orbit",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Battle_station",
  "/wiki/Bright_Tree_Village",
  "/wiki/Ewok",
  "/wiki/Squadron",
  "/wiki/Pilot",
  "/wiki/Gunship",
  "/wiki/Planet",
  "/wiki/The_galaxy",
  "/wiki/Standard_day",
  "/wiki/Wretch_of_Tayron",
  "/wiki/Tayron",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Sakas",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Stormtrooper",
  "/wiki/Scout_trooper",
  "/wiki/Wookiee",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Slicer",
  "/wiki/Naboo",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Sosha_Soruna",
  "/wiki/Satellite",
  "/wiki/Mission_to_Vetine",
  "/wiki/L%27ulo_L%27ampar",
  "/wiki/Duros",
  "/wiki/Spice_Runners_of_Kijimi",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/2015",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Greg_Rucka",
  "/wiki/Marco_Checchetto",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Star_Wars_(2020)_9",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars_(2020)_12",
  "/wiki/Retcon",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Shattered_Empire_2",
  "/wiki/Shattered_Empire_3",
  "/wiki/Shattered_Empire_4",
  "/wiki/Poe_Dameron:_Free_Fall_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Kidnapped!",
  "/wiki/Star_Wars_Adventures_(2017)_24",
  "/wiki/Poe_Dameron_7",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/Through_the_Turbulence",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Saga_of_Rey",
  "/wiki/The_Star_Wars_Book",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_6",
  "/wiki/Pilots_and_Crew",
  "/wiki/Protocol_and_Service_Droids",
  "/wiki/Hoth_and_Other_Outer_Rim_Planets",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Reproduction",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY"
 ]
}