{
 "name": "Kespral",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Advozse"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kouhun",
      "The Smuggler"
     ]
    }
   ]
  }
 ],
 "content": "Kespral was an Advozse male who ran errands for the Kouhun from time to time despite not being a member. During the Galactic Empire's Iron Blockade of the Anoat sector, he joined the crew of the Smuggler, who sent him on missions across the sector.\nKespral was an Advozse male criminal who operated in the Anoat sector during the Galactic Empire's Iron Blockade, a lockdown of the sector to prevent its occupants from learning of the Empire's crushing defeat at the Battle of Endor and the death of Galactic Emperor Sheev Palpatine. Kespral often ran errands, including pick ups, for the Kouhun, a secretive order of assassins. He was not a member of the group, but was confident they would never harm him.\nSeveral months into the blockade, Kespral joined the crew of the Smuggler, a young member of an Uprising forming against the Empire. The smuggler sent the Advozse on a variety of missions across the sector.\nKespral preferred acting defensively while on missions and was a skilled jeweler. He had pink skin and black eyes.\nKespral wore a blue and black shirt, gray pants, a black belt, and black boots. He used a black vibrosword.\nKespral was created for the mobile game Star Wars: Uprising, which was developed by Kabam and released on September 10, 2015. The Advozse served as a unique five-star crew member available through the Premium Crane, an in-game shop where the player, as the Smuggler, can spend chromium, an in-game currency, in exchange for randomized loot ranging from three stars or better in quality.\nAs such, the acquiring Kespral as a crew member is optional; however, this article assumes 100 percent game completion of Star Wars: Uprising, which means the Smuggler acquired Kespral as a member of the crew and dispatched him on Crew Runs. On Crew Runs, Kestral is strong on Crystal Finder Runs.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Advozse",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kouhun_(order)",
  "/wiki/The_Smuggler",
  "/wiki/Time",
  "/wiki/Galactic_Empire",
  "/wiki/Iron_Blockade",
  "/wiki/Anoat_sector",
  "/wiki/Sector",
  "/wiki/Battle_of_Endor",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Assassin",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Standard_month",
  "/wiki/Uprising",
  "/wiki/Smuggler",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Vibrosword",
  "/wiki/Video_game",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/Chromium",
  "/wiki/Category:Images_of_Kespral",
  "/wiki/StarWars.com"
 ]
}