{
 "name": "Ket Maliss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dashade"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red-orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Sizhran",
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Ket Maliss was a Dashade male assassin from the time of the Great Sith War who was cryogenically frozen for nearly 4,000 years following the near-extinction of his species. As a Shadow Killer, Maliss was one of the most accomplished Dashade assassins; having originally worked as an enforcer for members of the Falleen House Sizhran, he was awoken several decades before 3 ABY to serve their descendant, Prince Xizor. Under the Prince's employ, Maliss visited Chalmun's Spaceport Cantina in Tatooine's city of Mos Eisley on at least two occasions. During the latter visit in 1 ABY, an Imperial curfew was imposed on the entire Tatoo system. A reluctant Maliss only left the establishment after Ackmena, the bartender, prompted the cantina's patrons to waltz out the door to her rendition of the song \"Goodnight, But Not Goodbye.\"\nBy 3 ABY, Xizor had become the head of the criminal syndicate Black Sun, and that year saw Maliss wipe out the leadership of the Disac pirates on behalf of the Black Sun Vigo Sprax. He later joined a team of mercenaries and bounty hunters assembled by Xizor to track down the mercenary Limna Yith, who had stolen a datacard that contained a list of every Black Sun operative in the Verde system. The team pursued her to the planet Sedri, where they learned that she was on her way to an underwater village. Maliss and the others arrived first and massacred the village's residents, but they were soon joined by Yith, held captive by a team of smugglers who were working in opposition to them. A lightfight broke out that saw many of Maliss's allies killed, and the Dashade attempted to escape and fight another day.\nKet Maliss was a Dashade male who lived during the Great Sith War, a massive conflict that pitted the Galactic Republic and the Jedi Order against the Brotherhood of the Sith. The Dashade were renowned and feared throughout the galaxy as deadly assassins and mercenaries, and Maliss was one of the species' Shadow Killers, an honorary title given to the most accomplished Dashade assassins. The species' combat prowess saw them frequently hired by the Jedi, Sith, and cultures such as the Falleen species; Maliss in particular worked as an enforcer for the Falleen House Sizhran.\nIn the year 3996 BBY, during the height of the war, the Cron Cluster of stars went supernova, and the nearby Dashade homeworld of Urkupp was destroyed. The species was nearly annihilated, but members of House Sizhran had Maliss and their thirty-seven other remaining Dashade enforcers cryogenically frozen so as to preserve their abilities for use by future generations of Falleen leaders. Roughly every century, a new enforcer was released and made to serve House Sizhran; Maliss was the thirty-eighth and final one, woken up several decades before the year 3 ABY to be a servant of the Falleen Prince Xizor, a member of the Black Sun criminal syndicate. Throughout those decades, Maliss served his master well as the last Shadow Killer.\nLate in 0 BBY, Maliss was on the planet of Tatooine to conduct lethal business in the city of Mos Eisley. While he was in the local Chalmun's Spaceport Cantina, a skirmish at the bar occurred between the Jedi Master Obi-Wan Kenobi and the outlaws Ponda Baba and Cornelius Evazan. Maliss was again in the cantina one evening midway through 1 ABY when an officer of the Galactic Empire appeared on the establishment's wallscreen and announced a system-wide curfew. Despite the urging of Ackmena, the bartender, none of the cantina's patrons were eager to leave, and Ackmena reluctantly served a final round of drinks to everyone free of charge. She sang the song \"Goodnight, But Not Goodbye\" as she dispensed the drinks, and the serenade prompted Maliss and the other drunken denizens to waltz out the door. The evening's events were recorded and broadcast throughout the galaxy as a program called \"Life on Tatooine,\" which was required viewing for all members of the Imperial forces. It was shown with the hope that viewers would be uplifted by a feeling of superiority over the cantina's lowly occupants.\nOver the next few years, Maliss continued to work for Xizor, who by 3 ABY had become Black Sun's leader. In that year, Maliss was hired by the Black Sun Vigo Sprax to deal with the Disac pirates, who had long pillaged the star systems surrounding the Sisar Run hyperlane. When Sprax had attempted to subtly discourage them from continuing, the pirates had responded by virtually shutting down the Sisar Run for three weeks, and Black Sun's profits in the region had subsequently suffered. Maliss killed Stano Hapin, the group's leader, and a number of other high-ranking Disac pirates within a matter of days. Sprax's agents were thus able to flush the leaderless group from the Sisar Run, but the Disac survivor Morturr Heth vowed revenge on both Maliss and Black Sun. Sprax's personal bodyguard, Shotarr Kass, also began to despise Maliss and view him as a threat.\nNot long afterward, Maliss joined a team of bounty hunters and mercenaries gathered by Xizor to track down the Barani List, which contained the names of every Black Sun operative in the Verde system. A datacard that housed the list had been stolen by the mercenary Limna Yith, who then left a trail of destruction across the Sisar Run while fleeing from a team of smugglers hired by Vigo Sprax. When the Imperial Commander Surlev followed her trail to the Abek's Station shadowport and destroyed the station after Yith was not turned over to him, Xizor assembled Maliss's team to work in opposition to Sprax's agents in order to speed up the chase and stave off any further Imperial interference in Black Sun affairs. Maliss boarded the bounty hunter Gyran's Arc Razor and lazed listlessly around the passenger compartment with most of the team while Gyran and the assassin droid ERYX-4 tracked Yith to the planet of Sedri.\nAfter picking an abandoned Imperial Garrison Base as Yith's most likely hideout, Gyran landed his ship outside of the base's sensor umbrella. The team then rafted to their destination and scaled the walls of its vehicle bay. When ERYX-4 detected a large heat signature, Maliss and the others followed it to an armory and discovered a large gweld creature, which they shot dead. The room also contained an empty lock box, which prompted concerns of a trap set by Yith; EYRX-4 hid a listening device inside the box in case she returned. While they waited aboard the Arc Razor, the device eventually picked up a conversation between Sprax's team of smugglers and a captive Yith who revealed that they were headed for a nearby Sedrian village. As the native Sedrians were an aquatic species, the team donned wetsuits and breath masks before pursuing. The team swam to the submerged village, massacred its residents and commenced searching for the datacard in the adjoining underwater caves, where they had to fend off blood-frenzied razorts.\nYith and Sprax's team soon arrived in the caves with a group of Sedrian warrior monks and were attacked by four surviving villagers. Maliss and his team joined in the fray and lobbed grenades at both groups. Gyran and two others then provided covering fire while Maliss and ERYX-4 charged in to kill anyone who had been stunned by the explosions. They wanted Yith alive, but she proceeded to kill several members of Maliss's team with discarded Sedrian weaponry.\nThe surviving villagers were armed by Sprax's agents and joined in the lightfight on their side. Maliss eventually realized that the battle was hopeless, and he attempted to escape in order to fight another day.\nAfter winning the battle, Sprax's agents continued their search. They soon recovered the datacard, which they were able to return to the Black Sun agent Kalend Thora.\nKet Maliss was a merciless warrior and a Dashade Shadow Killer—one of the most accomplished assassins among his species. During the Great Sith War, \"Shadow Killer\" was spoken only in whispers and gave those who heard it involuntary shivers; nearly 4,000 years later, Prince Xizor still used it to denote Maliss. One of Xizor's top operatives, Maliss served the Prince well for decades and eliminated the leadership of the Disac pirates in a matter of days. While hunting for Limna Yith, he and his entire team massacred a Sedrian village that stood between them and their quarry.\nMaliss was the most feared member of the team assembled by Xizor to hunt for Yith. While the team was en route to Sedri, he warned Gyran with a snarl not to wake him frivolously; upon rising, he did not interact with his fellows and only stared forward with determination. While drinking at Chalmun's Cantina, Maliss was one of many customers reluctant to leave in the wake of an Imperial curfew, but he joined in the line of patrons who danced out the door during Ackmena's song. Maliss had dark green skin, red-orange eyes, and a hairless head. As a Dashade, he could dissipate the heat emanated from his body and thus become difficult to detect with sensors.\nKet Maliss first appeared as a nameless alien drinking in the Mos Eisley Cantina in 1978's The Star Wars Holiday Special, in which he was played by an uncredited actor. Although a number of the alien masks in the scene were re-used from 1977's original Star Wars film, Maliss's was built new for the Holiday Special under the supervision of makeup artist Rick Baker. The Cantina scene took twenty-four hours to shoot, and some of the actors in alien suits passed out due to a lack of oxygen. One year later, Maliss appeared in the background of a drunk driving public service announcement set in the Mos Eisley Cantina.\nMaliss was first identified by name in the 1995 Premiere Limited set of the Star Wars Customizable Card Game. The \"Ket Maliss\" card gave the character a brief backstory and included a digitally manipulated photo that made it appear as if he were present in the Mos Eisley Cantina during the events of the original Star Wars film. Maliss's backstory was significantly expanded in the 1997 sourcebook Secrets of the Sisar Run, written by Craig Robert Carey; Shane Hensley; and Pablo Hidalgo for West End Games's Star Wars: The Roleplaying Game. In one of the book's roleplaying scenarios, The Barani Conspiracy, Maliss opposes the player characters in a lightfight that they must win, but the only clue given to his fate is that he attempts to escape if the battle seems hopeless.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Dashade/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Sizhran",
  "/wiki/Black_Sun/Legends",
  "/wiki/Unidentified_near-Human_mercenary",
  "/wiki/The_Barani_Conspiracy",
  "/wiki/Assassin/Legends",
  "/wiki/Time/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Suspended_animation/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Cron_Supernova/Legends",
  "/wiki/Species/Legends",
  "/wiki/Shadow_Killer",
  "/wiki/Falleen/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/City/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Tatoo_system/Legends",
  "/wiki/Ackmena/Legends",
  "/wiki/Bartender/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Music/Legends",
  "/wiki/Goodnight,_But_Not_Goodbye/Legends",
  "/wiki/Disac_pirates",
  "/wiki/Vigo/Legends",
  "/wiki/Sprax",
  "/wiki/Mercenary/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Limna_Yith",
  "/wiki/Datacard/Legends",
  "/wiki/Barani_List",
  "/wiki/Operative",
  "/wiki/Verde_system",
  "/wiki/Planet/Legends",
  "/wiki/Sedri/Legends",
  "/wiki/Sedrian_village",
  "/wiki/Death/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Skirmish_in_the_underwater_caves",
  "/wiki/Standard_day/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Brotherhood_of_the_Sith",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/3996_BBY",
  "/wiki/Cron_Cluster/Legends",
  "/wiki/Star/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Urkupp",
  "/wiki/Speciecide",
  "/wiki/Standard_century/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Ponda_Baba/Legends",
  "/wiki/Cornelius_Evazan/Legends",
  "/wiki/Unidentified_Imperial_officer_(wallscreen)",
  "/wiki/Wallscreen",
  "/wiki/Alcohol/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Life_on_Tatooine",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Sisar_Run/Legends",
  "/wiki/Hyperlane",
  "/wiki/Pirate/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Stano_Hapin",
  "/wiki/Agent/Legends",
  "/wiki/Morturr_Heth",
  "/wiki/Bodyguard/Legends",
  "/wiki/Shotarr_Kass",
  "/wiki/Commander/Legends",
  "/wiki/Surlev",
  "/wiki/Abek%27s_Station",
  "/wiki/Shadowport/Legends",
  "/wiki/Destruction_of_Abek%27s_Station",
  "/wiki/Space_station/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Gyran",
  "/wiki/Arc_Razor",
  "/wiki/Assassin_droid/Legends",
  "/wiki/ERYX-4",
  "/wiki/Imperial_Aquatic_Garrison",
  "/wiki/Starship/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Raft",
  "/wiki/Hangar/Legends",
  "/wiki/Gweld",
  "/wiki/Listening_device/Legends",
  "/wiki/Sedrian",
  "/wiki/Wetsuit",
  "/wiki/Breath_mask/Legends",
  "/wiki/Water/Legends",
  "/wiki/Cave/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Razort",
  "/wiki/Warrior_monk",
  "/wiki/Grenade/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Canon",
  "/wiki/Lightfight",
  "/wiki/Kalend_Thora",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Mors_Odrion",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/1978",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Rick_Baker",
  "/wiki/1979",
  "/wiki/Star_Friends",
  "/wiki/1995",
  "/wiki/Premiere_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Star_Wars",
  "/wiki/1997",
  "/wiki/Secrets_of_the_Sisar_Run",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Shane_Hensley",
  "/wiki/Pablo_Hidalgo",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Last_Page",
  "/wiki/Star_Wars_Insider_48",
  "/wiki/Alien_Anthology",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_at_War",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_144",
  "/wiki/The_Star_Wars_Holiday_Special_Cantina:_Who%27s_Who",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_4",
  "/wiki/Coruscant_Nights_I:_Jedi_Twilight",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee",
  "/wiki/October_12",
  "/wiki/2006",
  "/wiki/Starwarsholidayspecial.com",
  "/wiki/October_14",
  "/wiki/2011",
  "/wiki/Cantina_Roll-Call:_Shedding_Light_on_Some_Alien_Aliases",
  "/wiki/Starlog_(magazine)",
  "/wiki/February",
  "/wiki/December_22",
  "/wiki/2008",
  "/wiki/August_29",
  "/wiki/2010"
 ]
}