{
 "name": "Ketar Nor's parents",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cato Neimoidia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Prior to or during 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    }
   ]
  }
 ],
 "content": "The parents of Ketar Nor were artists who lived on Cato Neimoidia whose works utilized the bioluminescent oils procured from the trees native to Cato Nemoidia's surface. Despite working to optimize computer systems for improved transactional databases, they found fame amongst their people for their artwork, becoming esteemed enough in their sector that they were invited to Coruscant for the Festival of Stars to show off one of their art pieces. Despite taking all the necessary precautions to protect their art from the dangers of hyperspace travel and atmospheric re-entry, their art was not well received by the native Coruscanti who accused the art of being inauthentic and on the third day, vandals even defaced the art by writing anti-Neimoidian slurs on it. Upon seeing the negative reception to their work, Nor's parents decided to use the remaining time they had left to tour the worlds of the Galactic Republic using the Republic's supposedly secure hyperlanes. Despite the claims of the hyperlanes being secure, Ketar Nor's parents were killed in a pirate attack after only being able to send out one unanswered distress call. Affected by their deaths due to the inaction of the Republic toward Neimoidians, their son told their life's story to the beings present at Obi-Wan Kenobi's trial in the Grand Theatre of Judgment to try and show how the Republic looks down upon Neimoidians.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Cato_Neimoidia",
  "/wiki/22_BBY",
  "/wiki/Neimoidian",
  "/wiki/Ketar_Nor",
  "/wiki/Bioluminescence",
  "/wiki/Tree",
  "/wiki/Computer",
  "/wiki/Quellor_sector",
  "/wiki/Coruscant",
  "/wiki/Festival_of_Stars",
  "/wiki/Hyperspace",
  "/wiki/Atmosphere",
  "/wiki/Coruscanti",
  "/wiki/Planet",
  "/wiki/Galactic_Republic",
  "/wiki/Hyperlane",
  "/wiki/Pirate",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Grand_Theatre_of_Judgment",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ketar_Nor%27s_parents",
  "/wiki/Brotherhood",
  "/wiki/Brotherhood_(audiobook)"
 ]
}