{
 "name": "Keth-Keth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Three feet"
     ]
    }
   ]
  }
 ],
 "content": "Keth-Keth was a male Jawa who lived on the planet Cularin during the time of the Clone Wars.\nAfter a friend of theirs was captured by the Metatheran Cartel and held in a building on Cularin, Keth-Keth, the Rodian Meelo, the Wookiee Roorrwiir, a Jedi, and a number of other individuals attempted to free the captive. After a failed attempt at infiltrating the facility, Keth-Keth suggested that they smash a speeder into the building, but the team rejected his proposal, believing it to be irrational and illegal. However, Roorrwiir accidentally crashed the team's speeder into the building, and Keth-Keth and the others quickly made their way through the building and rescued their friend. However, while they were attempting to leave, an Office of Peace and Security speeder arrived, and Keth-Keth threw a stun grenade at it. Believing that they needed someone to blame the incident on, Keth-Keth used spray-namel to write the words \"W.O.L.F.\" on the OPS speeder, and he ran around shouting the phrases \"Free Kashyyyk\" and \"Wookiee Liberation Front\". The incident gained the supposed \"Wookiee Liberation Front\" a lot of publicity and it eventually developed into a real organization, assisting the Wookiees of Kashyyyk.\nAt some point after the incident, Keth-Keth and Meelo were stopped by some clone troopers in the city Hedrett, for an I.D. check. One of the troopers started harassing Keth-Keth and suggested that the Jawa should go back to Tatooine, so Keth-Keth pulled out a stun glove.\nMeelo considered Keth-Keth to be the most annoying Jawa on Cularin. Keth-Keth wore a blast helmet with a vocabulator attached, which translated his speech into Basic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Metatheran_Cartel",
  "/wiki/Rodian/Legends",
  "/wiki/Meelo",
  "/wiki/Wookiee/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Office_of_Peace_and_Security",
  "/wiki/Stun_grenade/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee_Liberation_Front",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Hedrett",
  "/wiki/Tatooine/Legends",
  "/wiki/Blast_helmet/Legends",
  "/wiki/Vocabulator/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Wizards.com",
  "/wiki/Life_According_to_Meelo"
 ]
}