{
 "name": "Kettch",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Kettch was a semi-fictional Ewok X-wing pilot serving with Wraith Squadron.\nKettch was created by Wes Janson during the hunt for Warlord Zsinj as a prank, much to Wedge Antilles's dismay. According to Wes, Kettch was an eager Ewok fitted with prosthetics which enabled him to fly an X-wing.\nAfter the Wraiths assumed the guise of a pirate group, the Hawk-bat Independent Space Force, the prank took on life of its own. An Ewok stuffed toy began making appearances around the Hawk-bat base, in the pilots starfighter cockpits, and Wedge even found his TIE/IN interceptor's comm system modified, distorting his voice to sound like an Ewok.\nWhen the Wraiths visited Iron Fist disguised as Hawk-bat pirates, Zsinj asked Garik \"Face\" Loran  whether there was an Ewok starfighter pilot among their ranks, having been informed of Wedge's analyzed transmissions.\nFace quickly spun a story about Kettch's origins, borrowing heavily from the real life story of Gamorrean pilot Voort \"Piggy\" saBinring, a fellow Wraith. This then led Warlord Zsinj to conclude that Kettch might be an escaped subject from Epsilon Wing of the Binring Biomedical Product facility on Saffalore.\nThus, during the Battle of Kuat, Antilles was forced to fly his fighter with the Kettch doll attached to his body, giving many pilots the impression that an Ewok was really flying the starfighter. At the onset of the battle, the Hawk-Bats employed the tactical maneuver known as Kettch's Drill, designed by Antilles, to eliminate a number of enemy fighters before engaging in the battle's heaviest dogfighting.\nIn the end, Wedge used the Kettch ruse to repay Wes for all his pranks. Enlisting the help of the other Wraiths, Wedge crafted an elaborate scheme which resulted in Wes appearing stark naked before the entire squadron. That was the end of Lieutenant Kettch's appearances and the Kettch-related pranks.\nIn a way, however, the legend of Kettch lived on. His fictional story motivated Zsinj to order his scientists to create a real Ewok pilot, Kolot, complete with prosthetics and the ability to speak Basic. Kolot escaped Iron Fist with Gara Petothel, and went with her to Corellia. Gara, or rather, Kirney Slane, found this ironic. \"We're both lies that eventually became the truth.\"\nAn image of an Ewok pilot from 1993's Star Wars Gamemaster Handbook, predates the character of Kettch by several years. The image is in itself canon in the Legends continuity, and may have even inspired the Kettch plotline, but it is not clear whether it should be seen as a portrait of Wraith Squadron's stuffed Ewok, or whether it reflects a real Ewok pilot like Kolot or Tarfang.\nAuthor Chris Cassidy helped make a custom Kettch action figure for Aaron Allston.\nKettch received his first Hasbro action figure in 2008, as part of an Ewok three-pack including Machook and Keoulkeech, the packaging of which appears to indicate that an Ewok named Kettch participated in a conflict with the Lahsbees after the Battle of Endor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Ketch",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Kettch",
  "/wiki/Endor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Wraith_Squadron",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Hawk-bat_Independent_Space_Force",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Iron_Fist_(Executor-class)",
  "/wiki/Garik_Loran",
  "/wiki/Kargin",
  "/wiki/Starfighter/Legends",
  "/wiki/Voort_saBinring",
  "/wiki/Binring_Biomedical_Product",
  "/wiki/Saffalore",
  "/wiki/Battle_of_Kuat_(Hunt_for_Zsinj)",
  "/wiki/Kettch%27s_Drill",
  "/wiki/Kolot",
  "/wiki/Gara_Petothel",
  "/wiki/Corellia/Legends",
  "/wiki/Aaron_Allston",
  "/wiki/Star_Wars_Gamemaster_Handbook",
  "/wiki/Canon",
  "/wiki/Tarfang",
  "/wiki/Chris_Cassidy",
  "/wiki/Hasbro_Inc.",
  "/wiki/Machook",
  "/wiki/Keoulkeech",
  "/wiki/Lahsbee/Huhk",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/X-Wing:_Wraith_Squadron",
  "/wiki/X-Wing:_Iron_Fist",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/X-Wing:_Isard%27s_Revenge",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Rogue_Leaders",
  "/wiki/Star_Wars_Galaxy_Collector_4",
  "/wiki/Star_Wars:_The_Legacy_Collection"
 ]
}