{
 "name": "Kevreb Bebo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "D'vouran"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Misanthrope"
     ]
    }
   ]
  }
 ],
 "content": "Kevreb Bebo was the captain of the Misanthrope, a ship that crash-landed on D'vouran, a planet that was \"created\" as part of Project Starscream.\nHe and his friend Lonni survived the crash with eighteen other people but many of them went missing after some time. While they waited for help, the rest discovered an old Imperial laboratory, in which they stayed. When one of them went to their emergency signal he disappeared too and in the end only Bebo and Lonni remained. The native Enzeen told them that the Imperials gave Bebo the blame for the crash and now he and Lonni had to stay on D'vouran. As other settlers came to the planet, Bebo tried—and failed to warn them of the disappearance of the people. Because he found an Imperial amulet, which protected him from D'vouran and saved him for disappearing, he was safe to warn the settlers, though they thought he was a madman.\nIn 0 ABY Mammon Hoole, DV-9, Tash and Zak Arranda arrived on D'vouran and met Bebo. Tash wanted to hear his story and went with him to the laboratory, where he gave her his protective amulet. After she left, he was killed by a Gank killer who was following the orders of Smada the Hutt.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/D%27vouran",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Misanthrope",
  "/wiki/Captain/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Project_Starscream",
  "/wiki/Lonni",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Enzeen",
  "/wiki/Mammon_Hoole",
  "/wiki/DV-9",
  "/wiki/Tash_Arranda/Legends",
  "/wiki/Zak_Arranda/Legends",
  "/wiki/Gank/Legends",
  "/wiki/Smada",
  "/wiki/Hutt/Legends",
  "/wiki/Galaxy_of_Fear:_Eaten_Alive",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}