{
 "name": "Khaat Qiyn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi assault team",
      "Jedi assault team",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Bairdon Jace"
     ]
    }
   ]
  }
 ],
 "content": "Khaat Qiyn was a female human Jedi who served in the Jedi Order in the waning years of the Galactic Republic. In the years leading up to the Invasion of Naboo she apprenticed Bairdon Jace. At some point the two briefly encountered the Sith apprentice, Darth Maul. Later, together they fought in the First Battle of Geonosis as members of the Jedi assault team. She frequently used Form V of lightsaber combat.\nAt some point prior to the Invasion of Naboo, Khaat Qiyn and her Padawan, Bairdon Jace, were monitoring the streets of the Coruscant Underworld. Unbeknownst to them, the Sith apprentice Darth Maul was lurking in the shadows, watching them. As they traversed through the crowds of alien species, Qiyn noted to her Padawan that she felt someone's presence watching them, to which he replied that he could sense it too, and that he felt cold. Qiyn then went on to warn Jace of how shadows hold great rage, so much so that it could metaphorically swallow you whole. Jumping to conclusions, Jace suggested that their senses could be betraying them, as he was unable to see anything. Keeping cool and collected, Khaat Qiyn told him to remain steady, and to always trust in the Force, while cautioning that such distractions could cause his undoing.\nBy 22 BBY, tensions between the Galactic Republic and a rising faction known as the Confederacy of Independent Systems were growing at an alarming rate. After Senator Padmé Amidala of Naboo narrowly survived multiple assassination attempts, it was discovered that the bounty hunter Jango Fett was behind it. Jedi Master Obi-Wan Kenobi subsequently followed the Fett to the barren world of Geonosis, discovering that the Separatists had been developing their own droid army, and contacted the Jedi Temple about his findings. Moments after sending a hologram, the Jedi was discovered and captured. Mace Windu then made the decision to assemble a Jedi assault team, made up of over two-hundred Jedi to crush the droid army the Separatists had been creating and to rescue Kenobi as well as Anakin Skywalker and Amidala, who had followed Kenobi to the planet.\nKhaat Qiyn, as well as Jace, were two of the many Jedi sent out to Geonosis, as part of the Jedi assault team. Upon arriving on Geonosis, Khaat Qiyn and the Jedi infiltrated the arena, and hid until the time was right. After Windu revealed himself to Count Dooku, the leader of the Separatists, they deployed their newfound droid army, and so the Jedi revealed themselves. With thousands of droids in front of them, Khaat ignited her blue-bladed lightsaber, and alongside her fellow Jedi, she engaged the droid army and began cutting her droid adversaries down one by one.\nAs the battle raged on the droid forces began to overwhelm the Jedi with a large quantity of their numbers being shot down. Before they could be annihilated however, Grand Master Yoda arrived with a clone army and assisted in evacuating the remaining Jedi. With these reinforcements the Jedi spearheaded the invasion of Geonosis which would become the first conflict of the Clone Wars.\nKhaat Qiyn had black hair, brown eyes, and tan skin. She believed that all Jedi should trust in the Force, or it would lead to their downfall.\nKhaat Qiyn was able to sense the presence of the Sith Lord Darth Maul. During the First Battle of Geonosis Khaat utilized Form V to cut down her opponents.\nIn battle Khaat utilized a blue-bladed lightsaber. She wore a set of standard Jedi robes most of the time; when in battle she removed her outer robe like many Jedi.\nKhaat Qiyn was portrayed by Zuraya Hamilton, who also portrayed Senator Onaconda Farr.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Khaat_Qiyn",
  "/wiki/Khaat_Qiyn/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/Bairdon_Jace",
  "/wiki/Jedi",
  "/wiki/Republic_Era",
  "/wiki/Standard_year",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Sith_apprentice",
  "/wiki/Maul",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Form_V",
  "/wiki/Lightsaber",
  "/wiki/Lightsaber_combat",
  "/wiki/Padawan",
  "/wiki/Coruscant_Underworld",
  "/wiki/Darth",
  "/wiki/Alien",
  "/wiki/Species",
  "/wiki/The_Force",
  "/wiki/22_BBY",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Assassin",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Geonosis",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Imperial_Palace",
  "/wiki/Hologram",
  "/wiki/Mace_Windu",
  "/wiki/Droid",
  "/wiki/Army",
  "/wiki/Anakin_Skywalker",
  "/wiki/Planet",
  "/wiki/Time",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Sith_Lord",
  "/wiki/Jedi_robes",
  "/wiki/Zuraya_Hamilton",
  "/wiki/Onaconda_Farr",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Darth_Maul_(2017)_1",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition"
 ]
}