{
 "name": "Khabarakh",
 "display_name": "Khabarakh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Honoghr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Noghri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.3 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Clan Kihm'bar",
      "Galactic Empire",
      "Noghri Death Commandos",
      "Noghri Death Commandos",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Khabarakh was a Noghri male member of Clan Kihm'bar hailing from the planet of Honoghr. He participated in Chiss Grand Admiral Thrawn's campaign to destroy the New Republic, attempting to kidnap Princess Leia Organa Solo during a Mission to the Mid Rim planet of Kashyyyk. During the mission, his teammates were killed by the planet's inhabitants, Wookiees. However, when Khabarakh got near his target, his sense of smell allowed him to recognize Solo a Mal'ary'ush, the \"daughter of the savior\" of the Noghri people, the daughter of Darth Vader, who was considered by the Noghri as their savior. The Noghri agent agreed to take Leia to Honoghr, as she had promised him the New Republic would help his species.\nAlthough Chewbacca, a Wookiee agent of the New Republic, had agreed to stay on the Millennium Falcon, he changed his mind and insisted on accompanying the princess to the Noghri homeworld, stating that he had extended his life debt he owed to Solo's husband, Han Solo to Organa. Khabarakh agreed, as he believed that the Wookiee code of honor was similar to the Noghri's code of honor. However, Chewbacca's statements were undone after Thrawn's Imperial-class Star Destroyer, the Chimaera appeared over the planet, prompting Chewbacca to assault the Noghri. Later, Noghri was brought to Honoghr, suprising Thrawn, who had thought him dead, and expected him to be a traitorous Noghri. After the Chiss found evidence of possible treason and imprisoned him at Nystao, where he was later freed by Organa, who later freed the Noghri's word from the Empire's control and helped him rebuild it with other Noghri after Thrawn's death.\nSent by Grand Admiral Thrawn on a mission to capture the Princess Leia Organa Solo, he and his teammates in Imperial Noghri Commando Team 22 traveled to Kashyyyk. There his teammates were killed by Wookiees, but when he came close to Leia, his highly acute sense of smell helped him recognize her as Mal'ary'ush: the biological daughter of Lord Darth Vader, whom the Noghri considered their savior. Khabarakh agreed to take Leia, who had promised him the New Republic would help the Noghri people, to Honoghr.\nAlthough Chewbacca had previously agreed to stay on the Millennium Falcon, he changed his mind and insisted on accompanying Leia to Honoghr, as he had extended the life debt he owed Han Solo, to her and her brother. Khabarakh agreed to this, stating that \"The Wookiee code of honor is similar to our own.\" However, the unexpected appearance of a Star Destroyer sent Chewbacca into a rage, as the Wookiee believed the Noghri had betrayed him and Leia to Thrawn. Chewbacca and Khabarakh scuffled in the cockpit for a while, and though Khabarakh was a skilled warrior, Chewbacca's pure strength overwhelmed the Noghri, and he was forced to use a stun weapon to save the lives of his passengers and himself. With Chewbacca subdued Khabarakh sent out the recognition code, albeit late.\nHis reappearance on Honoghr, however, drew the attention of Thrawn, who thought him dead on Kashyyyk, and believed that he was interrogated and released after divulging some Imperial information. Thrawn wanted to find out exactly what the information was. Khabarakh showed Chewbacca several Noghri styles of combat, teaching him a bit in the lull. Furthering Thrawn's belief that he was interrogated was that Imperials found Wookiee hair in his ship. Khabarakh was arrested for treason, and was imprisoned in Nystao, but was freed when Leia revealed the Imperials' treachery in poisoning their world.\nWhen Luke Skywalker came to Honoghr seeking the aid of the Noghri, Khabarakh and Ovkhevam greeted Luke at a new area of clean lands and helped him repair his ship. Luke reflected that he didn't really need the help but that the sooner the Noghri people got over their insisted debt to the Skywalkers, the better.\nLater, Khabarakh was part of the elite guard, commanded by Cakhmaim, who were chosen to protect Leia and the Solo twins. After the death of Thrawn, he returned to his planet to help rebuild it, with the help of the New Republic, as Leia had promised.\nAt the time of the Caamas Document Crisis, Khabarakh commanded the sub-detail of Leia's honor guard assigned to her children, who now also included the twins' younger brother, Anakin Solo. These guards accompanied the Solo children during Leia's vacation to Wayland, and later to Kashyyyk when the children were sent there to wait out the Crisis.\nKhabarakh first appeared in Heir to the Empire, the first volume in Timothy Zahn's Star Wars: The Thrawn Trilogy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Honoghr/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Clan_Kihm%27bar",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Noghri_Death_Commando",
  "/wiki/New_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/Death/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Mission_to_Kashyyyk_(Thrawn_campaign)",
  "/wiki/Mid_Rim",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Mal%27ary%27ush",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Species/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Life_debt/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Chimaera/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Nystao",
  "/wiki/Battle_of_Bilbringi_(9_ABY)",
  "/wiki/Imperial_Noghri_Commando_Team_22",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Ovkhevam",
  "/wiki/Cakhmaim",
  "/wiki/Solo_twins",
  "/wiki/Caamas_Document_Crisis",
  "/wiki/Anakin_Solo",
  "/wiki/Wayland",
  "/wiki/Heir_to_the_Empire",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars:_The_Thrawn_Trilogy",
  "/wiki/Dark_Force_Rising",
  "/wiki/Dark_Force_Rising_(unabridged_audiobook)",
  "/wiki/The_Last_Command",
  "/wiki/The_Last_Command_(unabridged_audiobook)",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/Heir_to_the_Empire_Sourcebook",
  "/wiki/Dark_Force_Rising_Sourcebook",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/The_Last_Command_Sourcebook",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_121",
  "/wiki/The_Official_Star_Wars_Fact_File_139",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}