{
 "name": "Khalu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "During the Iron Blockade",
      "Burnin Konn"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kyuzo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Olive"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "South Sector Sinners"
     ]
    }
   ]
  }
 ],
 "content": "Khalu was a male Kyuzo member of the South Sector Sinners gang on the planet Burnin Konn. He was killed by the Smuggler for stealing cargo from the Trade Spine League.\nA member of the South Sector Sinners, Khalu used to follow the human thief Riley around during the month of two she was part of the gang. During the Iron Blockade, the Galactic Empire's attempt to prevent the Anoat sector's populace from learning of the crushing Imperial defeat at the hands of the Alliance to Restore the Republic in the Battle of Endor, Riley asked her sibling, a young smuggler, to kill the Kyuzo while they were in the South Sector Sinners' territory to recover the cargo of the Trade Spine League starship Cruel Mistress after it was shot down by the Empire. When the smuggler discovered the missing cargo, which had been stolen by the Sinners, they were attacked by Khalu, though Riley's sibling killed the Kyuzo and successfully recovered the cargo.\nA male Kyuzo, Khalu had olive skin and yellow eyes with black, slit-shaped pupils. When he met Riley's sibling, he expressed surprise that they had survived the South Sector Sinners' thugs and refused to negotiate with the smuggler when they suggested resolving their confrontation without bloodshed.\nKhalu wore a Kyuzo war helmet, along with bandages over his mouth. He also carried a DLT-19 heavy blaster rifle and several thermal detonators.\nKhalu was created for the canon mobile game Star Wars: Uprising, which was developed by Kabam for iOS and Android platforms, and released in 2015, where he was the boss of the Story Mission \"Salvage of The Cruel Mistress.\" Prior to the Uprising's 2.0 update, his appearance was that of a Zabrak.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Iron_Blockade",
  "/wiki/Burnin_Konn",
  "/wiki/Kyuzo",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/South_Sector_Sinners",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/The_Smuggler",
  "/wiki/Trade_Spine_League",
  "/wiki/Human",
  "/wiki/Thief",
  "/wiki/Riley",
  "/wiki/Standard_month",
  "/wiki/Galactic_Empire",
  "/wiki/Anoat_sector",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Endor",
  "/wiki/Smuggler",
  "/wiki/Starship",
  "/wiki/Cruel_Mistress",
  "/wiki/Eye",
  "/wiki/Blood",
  "/wiki/Kyuzo_war_shield",
  "/wiki/Mouth",
  "/wiki/DLT-19_heavy_blaster_rifle",
  "/wiki/Thermal_detonator",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)",
  "/wiki/2015",
  "/wiki/File:Khalu.png",
  "/wiki/Zabrak"
 ]
}