{
 "name": "Kho_Phon_Farrus",
 "display_name": "Kho Phon Farrus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Non-binary"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pink and purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "University of Bar'leth"
     ]
    }
   ]
  }
 ],
 "content": "Kho Phon Farrus was a non-binary archaeologist who had an obsession with the dark side of the Force and occult rituals. They had previously met the archaeologist Doctor Chelli Lona Aphra, claiming to be her sworn nemesis. During the Imperial Era, they sought after artifacts of the dark side cult known as the Ascendant. On Coruscant, Farrus encountered Aphra and the smuggler Sana Starros after acquiring an Ascendant thought dowser.\nOn new student welcoming day at the University of Bar'leth, Farrus attempted to register using the name \"Kho Phon Farrus\" but was told that there was no-one with that name on record, and the name on their Imperial identification card was different. This difficulty was observed by the group of students, Chelli Lona Aphra, Sana Starros, and Eustacia Okka. Aphra approached and vouched that she knew Farrus and there was a mistake on their ID. The registrar was suspicious but let Farrus in.\nWhen Farrus asked Aphra why she vouched for them, she claimed she wanted to be friends but also asked Farrus to help her break into Sava Iglan'tine Nos' office. She said that Farrus just had to let her and her friends in, since she wasn't allowed into the office anymore, and she and her friends would handle the rest. Farrus did as she asked, but when they opened the door, Iglan'tine Nos was in the office. She took Farrus to the dean, letting Aphra, Starros, and Okka sneak in and steal almost half of the sava's collection. The sava advocated for Farrus' expulsion, but was outvoted.\nSava Iglan'tine Nos' considered Farrus to have the best student translation of the Ascendant's Mantra, and called them an overachiever.\nKho Phon Farrus used different pieces of Ascendant tech, including the Whip of Sorrows.\nKho Phon Farrus first appeared in Doctor Aphra  16.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Kho_Phon_Farrus",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/University_of_Bar%27leth",
  "/wiki/Archaeologist",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Imperial_Era",
  "/wiki/The_Ascendant",
  "/wiki/Coruscant",
  "/wiki/Smuggler",
  "/wiki/Sana_Starros",
  "/wiki/Thought_dowser",
  "/wiki/Imperial_identification_card",
  "/wiki/Eustacia_Okka",
  "/wiki/Sava",
  "/wiki/Iglan%27tine_Nos%27_office",
  "/wiki/Iglan%27tine_Nos",
  "/wiki/Ascendant%27s_Mantra",
  "/wiki/Ascendant",
  "/wiki/Whip_of_Sorrows",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Category:Images_of_Kho_Phon_Farrus",
  "/wiki/Obi-Wan_2",
  "/wiki/Doctor_Aphra_(2020)_17",
  "/wiki/Doctor_Aphra_(2020)_18",
  "/wiki/Doctor_Aphra_(2020)_19",
  "/wiki/Doctor_Aphra_(2020)_20",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/Doctor_Aphra_(2020)_23",
  "/wiki/Doctor_Aphra_(2020)_24",
  "/wiki/Doctor_Aphra_(2020)_25",
  "/wiki/Doctor_Aphra_(2020)_26",
  "/wiki/Hidden_Empire_2",
  "/wiki/Revelations_1",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_The_Ascendant"
 ]
}