{
 "name": "Khundu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chromium Kings"
     ]
    }
   ]
  }
 ],
 "content": "Khundu was a human male who served as a member of the Chromium Kings. During the Iron Blockade of the Anoat sector, the Chromium Kings forces were attacked and defeated on the planet Burnin Konn by a smuggler associated with the Ivax Syndicate. The smuggler then confronted Khundu and revealed the attack was due to the Kings bragging about selling protocol droids to the syndicate.\nKhundu was a human male criminal who operated within the Chromium Kings during Imperial Governor Ubrik Adelhard's Iron Blockade of the Anoat sector. After the Chromium Kings bragged about having sold \"specialized\" protocol droids to the criminal Ivax Syndicate, Nogba Quush of the syndicate sent a young smuggler to terrorize the Chromium Kings on the planet Burnin Konn, as the syndicate wished to remain discreet and not gain a reputation.\nThe smuggler defeated a number of enforcers serving the Chromium Kings and then their MRK-3 Assassin Prototype droid, before approaching Khundu. Khundu complained about the loss of the droids and blamed the Ivax Syndicate until the smuggler informed him that the attack was to teach the Chromium Kings to keep their mouths shut. Khundu quickly claimed to in fact have no idea who had attacked the Chromium Kings, satisfying the smuggler.\nKhundu had fair skin and brown hair. He initially did not grasp why the Chromium Kings were being attacked, but quickly submitted to what the Ivax Syndicate wanted upon being threatened.\nKhundu wore a brown and gray shirt, gray pants and black boots.\nKhundu first appeared in the 2015 mobile game Star Wars: Uprising.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chromium_Kings",
  "/wiki/Iron_Blockade",
  "/wiki/Anoat_sector",
  "/wiki/Planet",
  "/wiki/Burnin_Konn",
  "/wiki/The_Smuggler",
  "/wiki/Ivax_Syndicate",
  "/wiki/Smuggler",
  "/wiki/Protocol_droid",
  "/wiki/Galactic_Empire",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Chromium",
  "/wiki/Nogba_Quush",
  "/wiki/MRK-3_Assassin_Prototype",
  "/wiki/Droid",
  "/wiki/Mouth",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/2015",
  "/wiki/Star_Wars:_Uprising"
 ]
}