{
 "name": "Khyyynett",
 "display_name": "Khyyynett",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 17 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Khyyynett was a Wookiee male musician who attended the launch of a luxury hovertrain on the planet Alderaan in around 17 BBY. A group of Trandoshan mercenaries raided the train and Khyyynett was killed in the attack.\nKhyyynett was a Wookiee male musician who played the clarion trumpet and who had reached middle age by the early years of the Imperial Period. Circa 17 BBY, Khyyynett was among over one hundred guests from among the galactic elite that were invited to the maiden journey of the luxury hovertrain the Gem of Alderaan on the planet Alderaan. The Wookiee attended launch gala held at a hoverstation in the city Aldera to open the event and then boarded the train as it departed on a six hour trip.\nDuring the journey, accompanied by an entourage, Khyyynett visited the Decadence nightclub in the train's rear car. There, he had an altercation with his fellow guest Zalar Rishek, an arrogant Human of the House of Rishek, while the pair's respective entourages watched on. However, the scuffle was quickly broken up by a group of undercover Alderaanian Resistance agents.\nA short time later, the Gem of Alderaan was raided by Trandoshan mercenaries who sought to capture Alderaan's senator, Bail Organa and incorrectly believed Organa to be traveling on the train. Khyyynett was killed by the mercenaries during the attack, thereby cutting short his musical career.\nKhyyynett appeared within The Gem of Alderaan, a roleplaying module by Gary M. Sarli set within Star Wars Legends continuity. The adventure was published on Wizards.com on February 5 2009 as the eight instalment of Wizards of the Coasts' Dawn of Defiance roleplaying campaign. In the adventure, the player characters roleplay as agents of the Alderaanian Resistance who infiltrate the Gem of Alderaan and it is possible for the players to break up Khyyynett's tussle with Rishek. Alternatively, the players can be unsuccessful at separating the pair or to fail to intervene at all, in which case the disturbance escalates into brawl. Khyyynett was later mentioned in Slugthrowers: An Overview of Popular Music and Musicians in a Galaxy Far, Far Away, Part 2, an article by Edward M. Erdelac published on StarWars.com on January 21 2014. The article confirmed that the Wookiee musician was killed during an attack by Trandoshan mercenaries depicted in The Gem of Alderaan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/17_BBY/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Musician/Legends",
  "/wiki/Gem_of_Alderaan",
  "/wiki/Planet/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Battle_of_the_Gem_of_Alderaan",
  "/wiki/Train/Legends",
  "/wiki/Death/Legends",
  "/wiki/Trumpet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Imperial_Period",
  "/wiki/The_galaxy/Legends",
  "/wiki/Hovertrain/Legends",
  "/wiki/Train_station/Legends",
  "/wiki/City/Legends",
  "/wiki/Aldera/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/The_Gem_of_Alderaan",
  "/wiki/Canon",
  "/wiki/Decadence_nightclub",
  "/wiki/Zalar_Rishek",
  "/wiki/Human/Legends",
  "/wiki/House_of_Rishek",
  "/wiki/Alderaanian_Resistance",
  "/wiki/Time/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Gary_M._Sarli",
  "/wiki/Wizards.com",
  "/wiki/February_5",
  "/wiki/2009",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Dawn_of_Defiance",
  "/wiki/Slugthrowers:_An_Overview_of_Popular_Music_and_Musicians_in_a_Galaxy_Far,_Far_Away",
  "/wiki/Edward_M._Erdelac",
  "/wiki/StarWars.com",
  "/wiki/January_21",
  "/wiki/2014",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vhiin_Thorla",
  "/wiki/Almas_Academy",
  "/wiki/Order_66/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Dawn_of_Defiance:_Gamemaster_Primer"
 ]
}