{
 "name": "Ki-Adi-Mundi",
 "display_name": "Ki-Adi-Mundi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cerea"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mygeeto"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi assault team",
      "Jedi High Council",
      "Jedi assault team",
      "Galactic Republic",
      "CC-1993's battalion",
      "21st Nova Corps",
      "CC-1993's battalion",
      "21st Nova Corps"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Yoda"
     ]
    }
   ]
  }
 ],
 "content": "Ki-Adi-Mundi was a Force-sensitive Cerean male Jedi Master and member of the Jedi High Council during the last decades of the Galactic Republic. Following the outbreak of the Clone Wars after the First Battle of Geonosis, Mundi became a Jedi General of the Grand Army of the Republic. Like his Jedi colleagues, he led the Republic clone troopers against the Separatist Alliance forces in several battles across the galaxy, including the second campaign on Geonosis.\nIn 19 BBY, the third and final year of the war, the Republic was engaged in the Outer Rim Sieges, during which Mundi oversaw the Republic invasion of Mygeeto with the 21st Nova Corps under his command. During the invasion, Supreme Chancellor Sheev Palpatine—secretly the Sith Lord Darth Sidious—instructed the Grand Army clone soldiers to execute their Jedi leaders in accordance with Order 66, an act that resulted in the death of Mundi along with the majority of the Jedi Order.\nDespite Mundi's death, his lightsaber endured many long years and eventually came into the possession of the collector Dok-Ondar, who recounted some elements of its past to a sergeant of the First Order.\nA native of Cerea, Ki-Adi Mundi achieved the rank of Jedi Master and he held a seat on the Jedi High Council. Following the death of Master Katri on Raxus Secundus by a group of security guards, Mundi gathered at the Jedi Temple on Coruscant alongside other Jedi and attended her funeral. As her body was lowered into the grounds of the temple, Mundi gave a eulogy to the gathered regarding Katri's patience with younglings and other Jedi, as well as how the force flew with certainty through her. After the service, Mundi exited the Jedi Temple alongside Tera Sinube and Jocasta Nu.\nIn 32 BBY, Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, approached the Jedi Council and informed them of the lightsaber duel they had had on Tatooine with a Zabrak. Jinn believed the warrior to be a Sith, a claim that the Council, and Mundi in particular, met with skepticism. Jinn also brought Anakin Skywalker in front of the Jedi Council, the boy had a high Midi-chlorian count and had a good grasp on the Force, but the Council denied his and Jinn's wishes to train him as a Jedi, believing he was too old, and had much fear in him. Following the Battle of Naboo and the death of Jinn at the hands of the warrior Darth Maul, the Council reversed their decision to allow Skywalker to be trained. Mundi traveled to Naboo for Jinn's Funeral.\nSeveral years later, Mundi traveled with a Republic task force to Carnelion IV where they rescued Kenobi and Skywalker and also ended the war between the Open and Closed human inhabitants of the world.\nJust before the dawn of the Clone Wars, Mundi attended a meeting with Supreme Chancellor Sheev Palpatine in his office, along with fellow Jedi Mace Windu, Yoda, Plo Koon, Kit Fisto, Luminara Unduli and Barriss Offee. Palpatine explained an alarming number of star systems were breaking away from the Galactic Republic to join the Confederacy of Independent Systems, a Separatist movement led by the former Jedi Master Count Dooku. The Senate was to consider a vote on the establishment through the Military Creation Act, a move Palpatine claimed he wished to avoid if possible, as some feared it could lead to war with the Separatists. As the meeting concluded, Senator Padmé Amidala of Naboo, who had just survived an assassination attempt, arrived and explained she believed Dooku was the one behind the attack. Windu reminded Amidala that Dooku had been a Jedi once, and Mundi reasoned that he was simply a political idealist.\nLater, when Obi-Wan Kenobi reported that the bounty hunter Jango Fett was behind the assassination attempts on Amidala, Mundi and the Council ordered Kenobi to track the bounty hunter down, and commanded Skywalker to bring Amidala safely back to Naboo. Later, Mundi listened along with the rest of the Jedi High Council to a message from Kenobi, who had tracked Fett to the droid foundries of Geonosis, where it appeared the Trade Federation was about to take delivery of a droid army. Kenobi explained Trade Federation Viceroy Nute Gunray was behind the attempts on Amidala's life. Kenobi's transmission was interrupted as he was attacked by a droidekas, prompting a meeting between Mundi, Yoda, Windu, Palpatine and Senators Bail Organa, Ask Aak, Jar Jar Binks and Mas Amedda. When the Jedi explained only about 200 fellow Jedi were available to go to Geonosis to stop the Separatist forces from assembling, the current senator of Naboo, Jar Jar Binks made plans to vote Palpatine emergency powers so he could call the recently-discovered clone army into battle.\nWindu assembled a strike team of Jedi to rescue Kenobi on Geonosis. Mundi was among the Jedi who traveled to the planet's surface and infiltrated the arena, where Kenobi, Skywalker and Amidala were about to be executed. Mundi appeared at a ledge overlooking the arena along with Aayla Secura and Koon, all of whom ignited their lightsabers as Windu personally confronted Dooku. Although they were desperately outnumbered by the Separatist Droid Army, Mundi and his fellow Jedi engaged the droids in a bloody battle.\nAfter several tense minutes of fighting, the majority of the Jedi were slain and Dooku's forces gained the upper hand, rounding Mundi and the other surviving Jedi into the center of the arena. Before he could kill them, however, the Jedi were rescued by the Republic's newly-acquired clone army, led into the arena by Yoda aboard Low Altitude Assault Transport/infantrys. As the gunships opened fire on the droids, the Jedi resumed their lightsaber battle against the droids, with Mundi deflecting blaster shots and fighting back-to-back with Amidala.\nThe Cerean helped Fisto get aboard before taking off and escaping the arena. As they flew away, Yoda insisted to Windu and Mundi that they must attempt to prevent Dooku's escape or he would rally more systems to his cause. Windu ordered the pilot to land in an assembly area in the desert. Mundi continued to fight until the Separatists ordered a full retreat. Mundi was one of the few Jedi to survive the battle at Geonosis, which formally marked the beginning of the Clone Wars.\nShortly after the battle of Geonosis, Mundi met with Windu via hologram to discuss the battle. The two of them discussed how so many Jedi were killed in the battle, and that those Jedi would be missed, but that it was good that they were one with the Force. The two old friends also discussed how the Clone Wars were upon the galaxy, with Windu stating he felt uneasy about leading the Clone Army, but stated that sometimes they must be offensive. Mundi then remarking the title of General must be added to the Jedi among their other titles. The two raised their cups to peace and the fallen. Mundi was also at the Council meeting a short time later, assigning Windu to go to Hissrich.\nLater, Mundi was present via hologram for the Council meeting where Windu reported his mission to be a success. However, during the mission, one of Windu's team, Prosset Dibs, had turned against them and attempted to murder Windu. He was therefore brought before the Council to stand trial for this. Mundi chastised Dibs for his actions, which were deemed both treasonous and heretical, but nevertheless gave him the chance to defend himself. Dibs refused to find fault in his actions, insisting that the Council were the ones in the wrong and they were twisting the Jedi Code for their own selfish gain. Ultimately, Dibs was found guilty of treason and, at the request of Windu, sentenced to confinement in the Jedi Archives.\nSeveral weeks into the war, Mundi had endured an encounter with a recently emerged Separatist leader, General Grievous, that left him with several scars on his cheek. By the time of the Cadesura disaster on the planet Cato Neimoidia, the scars were still healing. Following the disaster, Mundi was present for a Jedi Council meeting concerning Kenobi's upcoming mission to investigate the crisis and listened intently to Kenobi's plan.\nAlthough Geonosis had been captured by the Republic at the onset of the Clone Wars, resistance from the Geonosian natives and their loyalty to Count Dooku proved stronger than the Jedi Order anticipated, and the Jedi soon discovered Separatist leader Poggle the Lesser had established several battle droid foundries on the planet capable of creating thousands of weapons. The Jedi Council dispatched Mundi, Kenobi, and Unduli to lead a massive clone army fleet to retake Geonosis and destroy the droid foundries, the destruction of which was viewed as essential to the Republic war effort. Aboard the bridge of one of the Star Destroyers during the voyage, Mundi and Kenobi lamented at the Republic's failure to recognize how loyal the native Geonosians remained to the Confederacy.\nLater, a hologram meeting session was held between Mundi, Obi-Wan Kenobi, Anakin Skywalker, Luminara Unduli, Ahsoka Tano, Sheev Palpatine, Yoda, and Mace Windu to discuss the battle plan. Mundi, Kenobi and Skywalker were to lead three separate fronts of a three-pronged attack on the ray shield generator that protected the primary droid foundry where Poggle had established his command post. Mundi and Jet were to lead a northern advance through the Geonosian defense lines to a staging area called Point Rain a short distance from the shield generator. The troops would establish a defensive perimeter around the staging area, where Mundi's forces would meet up with those of Kenobi and Skywalker, who would be coming in after leading their forces through central and southern advances, respectively. Once they rendezvoused, the three Jedi were to combine their forces on an attack against the shield generator. Mundi suggested if either of the three forces were met with heavy resistance that prevented them from reaching the staging area on time, the others should wait until they arrive before advancing on the shield generator.\nWith their planning complete, the Jedi split up to mobilize forces for the upcoming battle. Shortly after Kenobi and Skywalker's men entered the battle, Mundi boarded an LAAT/i gunship and launched along with Jet and a company of clones aboard the Resolute, the flagship of Admiral Wullf Yularen. Mundi led several other gunships into the battle and were immediately met with extremely heavy anti-artillery batteries. Several of the ships among Mundi's forces were destroyed, and Mundi quickly lost contact with Skywalker after his own gunship was shot down. Many of the ships were carrying All Terrain Tactical Enforcers and Mundi ordered them to be dropped to the ground right away, before they were all destroyed all with the gunships. Immediately after issuing this order, the gunship was struck by enemy fire and crashed onto the planet surface below. Many of the clones aboard were killed but Jet and Mundi survived, although the Cerean was injured. Jet reported that only Kenobi's forces made it to the staging area, and that Skywalker and his men had crashed were caught in a firefight with the Geonosians.\nMundi ordered the injured among his men to be loaded onto the AT-TE walker, and then for the forces to move forward toward a nearby bridge, where Mundi hoped to meet up with Skywalker's forces on their way to Kenobi's position. As the forces traveled through a large caltrop field, Mundi went up ahead and used his lightsaber to cut down the giant caltrops so his walkers could pass them unharmed. Jet requested air support from Yularen, but the admiral denied the request, claiming all starfighters and other resources were engaged elsewhere in the planetary invasion. Upon arriving at a trail leading up to a clifftop cave, Mundi split up his forces, ordering the AT-TE walkers to take the longer route to Kenobi's position while the Jedi took a squad of 13 clones to investigate what Mundi believed was a shortcut through the cave. Mundi admitted to Jet he did not know for sure the cave would be a faster route, but could only trust his instincts. After entering the cave, which disrupted their communications, Mundi sensed an incoming presence and ordered his men to take defensive positions just as a swarm of winged Geonosian warriors attacked them.\nSeveral of the clones were swept up and carried deeper into the cave to be killed, but Mundi ordered the men not to stop and continue pushing forward. Despite heavy casualties, Mundi's men cut their way through the cave, and upon reaching the other side, the Cerean ordered his clone flametroopers to fire their flamethrowers. Most of the remaining Geonosians were killed, allowing Mundi and his surviving troops to exit the cave. Afterward, Mundi made contact with Skywalker, who informed him the path to the staging area was now clear but that Kenobi's forces were being overwhelmed by the enemy there. Upon a request for air support from Skywalker, Yularen dispatched a BTL-B Y-wing starfighter/bomber squadron, which bombed the advancing Separatist tanks just as Mundi, Skywalker and Tano arrived at Kenobi's position. The Jedi regrouped and determined that, despite their losses, their combined forces were still sufficient to destroy the shield generator. Skywalker took a small force through the shield barrier and jammed the Geonosians' scanners, which freed the AT-TE walkers to fire upon the shield generator without risk of being targeted. Once the generator was destroyed, Mundi led the rest of the clone troopers into the battle via gunships.\nAfter they landed, the remaining Geonosians at the ray shield generator were outnumbered by the clones and forced to surrender, marking the end of the initial phase of the battle. The injured Mundi and Kenobi were unable to continue with the rest of the attack, and were to be taken back to the fleet along with the other injured soldiers for bacta tank treatment. Skywalker was left in charge of the remaining Republic forces, which were to set out for Poggle's primary droid foundry. Before departing the planet, Mundi overheard Skywalker and Tano boasting about their number of kills during the battle, and the Cerean noted that his own kill total of 65, which was greater than that of either of the two other Jedi and thus earned Skywalker's respect. Mundi and the rest of the injured left the planet, while Skywalker and Unduli later led a successful effort to destroy the primary droid foundry.\nBy the time Mundi recovered from his injuries in the bacta tank, he was aboard a Jedi transport docked at a Geonosian landing zone. Anxious to return to the mission at hand, Mundi reviewed strategic charts and maps to help continue the search for Poggle, who had escaped the primary droid foundry. Mundi and Kenobi were contacted via holocomm by Unduli, who had been tracking Poggle and believed he was hiding at the nearby the Progate Temple. Mundi felt that location was unlikely because little would have survived the first wave of Republic attacks there, which would leave Poggle to exposure at the temple. Unduli nevertheless decided to investigate, despite Mundi's warnings against it due to an incoming sandstorm. The storm left the Jedi unable to leave the transport and provide Unduli assistance and, when Skywalker grew concerned that she failed to report in several hours later, Mundi urged him to have patience.\nWhen Unduli finally reported back, she explained Poggle had been tracked to the temple, and her holocomm transmission cut out just as she was attacked by unseen assailants. Skywalker wished to rescue her immediately, but Mundi and Kenobi said they had no choice but to wait for the sandstorm to die down. Later, Mundi stayed behind while Kenobi and Skywalker led forces into the temple to rescue her. After getting attacked by Geonosians infected with brain worms, the Jedi tried to send clone troopers to Mundi for reinforcements, but they were killed and the message never reached him. Kenobi and Skywalker ultimately succeeded in rescuing Unduli and taking Poggle prisoner.\nAs they prepared to take Poggle back to Coruscant, Mundi received a transmission from Windu on Dantooine. Although Windu's forces had fended off an attack there, they had suffered heavy casualties and were in immediate need of medical supplies from a medical station at Ord Cestus. Mundi informed the others, who decided to send Tano and Offee to pick up the supplies while Mundi, Kenobi and Unduli took Poggle back to Coruscant to be interrogated. Later, on the Venator-class Star Destroyer making the voyage back to Coruscant, Skywalker informed Mundi, Kenobi, Unduli and Captain Rex that the ship carrying Tano and Offee has been infected by Geonosian brain worms. Skywalker later interrogated Poggle alone and learned the brain worms were susceptible to cold temperatures. When Mundi asked Skywalker how he convinced Poggle to talk, the Jedi Knight declined to answer, and the Cerean was unaware that Skywalker had used violent methods to achieve his means.\nMundi was present at the Jedi Temple when the Council viewed a hologram transmission from General Grievous, who had captured Eeth Koth. Upon discovering Koth secretly used hand signals in the message to indicate he was in the Saleucami system, the Council assigned Skywalker, Kenobi and Adi Gallia to rescue him.\nSome weeks later, Mundi also viewed a holocomm strategy session led by Koon on Coruscant along with Tano and Secura, who were interrupted by the astromech droid R2-D2. When R2 projected a message that Skywalker and Windu were trapped on Vanqor and in grave danger, Koon prepared his ship for an immediate rescue.\nNot too long afterward, Mundi and the rest of the Council received a report from Admiral Tenant about a mysterious transmission that had been intercepted in the Chrelythiumn system. Although the source for and reason behind the call were unknown, Tenant reported that it contained a Jedi distress signal that had not been used in more than 2,000 years.\nSometime after that, the Council learned that Dooku schemed to abduct Chancellor Palpatine at the Festival of Light on Naboo. As a result of this, the Council hatched a plan to thwart Dooku's efforts. Kenobi would fake his death by assassination and then pose as Rako Hardeen to infiltrate Dooku's cadre of bounty hunters and provide information to the kidnapping itself. Mundi attended the mock funeral for Kenobi.\nSometime afterwards the Jedi received an extraordinarily shocking transmission sent from the Outer Rim planet of Raydonia by Darth Maul - the Sith Lord that killed Qui-Gon Jinn on Naboo years earlier. Mundi and Koon watched Maul's transmission via hologram, as Maul massacred a village of people ordering Kenobi face him alone. Kenobi went against Windu's wishes of caution and headed out to face the resurrected Sith Lord alone.\nMundi, along with Yoda, announced to Kenobi that Duchess Satine Kryze had asked for his help to free Mandalore from criminals. Mundi argued that the Jedi would not be able to help her, because intervening on neutral Mandalore would be considered an act of war. Nevertheless, Kenobi secretly traveled to Mandalore to assist his former lover.\nSometime later the Jedi temple was attacked by an unknown assailant. The attack killed six Jedi, maintenance crew and clone soldiers within the Jedi Temple hangar. As a result of this attack, Grand Master Yoda contacted Skywalker and Tano, recalling them from the battle on Cato Neimoidia to question witnesses and lead the investigation. In the Council chamber, the Council briefed Skywalker and Tano as to what they needed to do. Windu told them to be on alert and to not make any assumptions. The Council also aired out their concern that someone within the Jedi would have turned to the dark side and committed the act. Soon after, it was discovered that anti-Jedi activist Letta Turmond fed her husband, Jedi Temple worker Jackar Bowmani, nano-droids which unwittingly caused him to explode, thus causing the damage to the hangar bay. Shortly after Turmond's arrest, Mundi and the rest of the Council attended a joint funeral for the six Jedi—including Jedi Knight Tutso Mara—that perished.\nSometime after that, the Council learned that Tano had been arrested by Clone Commander Fox after she allegedly murdered the imprisoned Turmond via the Force. Soon after that, Tano broke free and escaped a Republic military base, eventually reaching the portal to the Coruscant Underworld. Skywalker, Fox and Rex failed to re-apprehend Tano as she made her getaway.\nAfter that, the Council held a meeting to discuss the course of action to take. Koon and Skywalker were sent with Commander Wolffe and Rex to find Tano and bring her back into Jedi custody. Their search led them to the Coruscant Underworld level of Level 1315, where Tano was found in a warehouse with crates full of nano-droids.\nA little while later, the Council received a transmission from Admiral Wilhuff Tarkin, who requested, on behalf of the Senate, that Tano be expelled from the Jedi Order so that she could be dealt with by the Republic in a more easier fashion. Once the transmission ended, Kenobi strongly suggested that the Council side with Tano, but Mundi, Saesee Tiin and Windu refused, noting that in addition to the evidence against her, failing to comply could be regarded as an act of opposition to the Senate. Yoda then stated that Tano should come before them in the Chamber of Judgment alongside her master, Skywalker.\nMundi was a part of that meeting, seated alongside Kenobi, Windu, Koon, Yoda and Shaak Ti. Although Tano insisted she was innocent, Mundi remained unconvinced and pointed out the fact that Tano was alone with Letta Turmond when she died. Ultimately, Windu closed the matter by formally expelling Tano from the Jedi Order. As Tano's platform lowered, Mundi informed her that she was banished from the Jedi Order, and therefore stripped of her Padawan status. In addition, her battlefield privileges were revoked and she was subsequently remanded to the custody of the Republic.\nAfterward, a military trial was held for Tano. But before the verdict could be given out for Tano, Skywalker burst into the room and revealed that the true culprit that framed Tano was Offee, who openly confessed to her crimes and claimed that the Jedi had fallen to the dark side by fighting in the Clone Wars. As a result, Offee was imprisoned while Tano was cleared of all charges.\nFollowing Tano's acquittal, the Council personally invited her to rejoin the Order, with Mundi and Tiin praising her efforts to prove her innocence, and Windu observing her ordeal as the great trial in her path to Jedi Knighthood. But, to Mundi and the others' aghast, Tano refused to come back, having become disillusioned with both herself and the Jedi as a result of the Council's lack of faith in her.\nWhile on a mission to uncover the secrets regarding the death of Master Sifo-Dyas, Skywalker and Kenobi learned that the mysterious \"Tyranus,\" who helped to create the clone army was in fact Dooku. The Council realized the implications of this, that Dooku had helped to create the army he was fighting against, but decided to keep these revelations a secret as it would damage the war effort, and the Jedi trusted the clones they'd fought alongside.\nYoda informed the Council that he had been contacted by the spirit of Qui-Gon Jinn. Mundi and the Council meditated with him, but none could hear the voice. Mundi suggested that Yoda may be affected by the Sith, and as Yoda slept in the Temple's medical ward, suggested that Yoda's relationship with Dooku may have left him vulnerable. After Yoda emerged from a deprivation ritual, claiming to have spoken to Qui-Gon, Mundi remained skeptical.\nMundi attended a Council meeting to discuss rescuing Master Quinlan Vos, who had been captured by Dooku while on an undercover mission to assassinate the Separatist leader. Mundi was also aware about the damage that Dooku's new right-hand man \"Admiral Enigma\"  had inflicted on the Republic. He advocated capturing him in order to prevent another Sith Lord from being let loose in the galaxy. After learning from Admiral Yularen that Enigma's Providence-class Dreadnought was planning to attack Taris, the Council decided to authorize a mission to rescue Vos. In addition, the Council agreed to pardon Asajj Ventress, Dooku's former Sith apprentice in return for helping to rescue Vos.\nFollowing the rescue of Vos, Mundi was present at a Council meeting where Vos was assigned to lead a Jedi and Republic mission to raid a Separatist supply storage base for supplies. Mundi reported that the base contained medications, weapons, ship repair materials, and foodstuffs that would be of valuable assistance to desperate worlds. Unknown to the Council, Vos was secretly colluding with Dooku in order to discover the identity of Darth Sidious so that he could destroy the Sith Order. Vos leaked intelligence of the Republic raid to Dooku and planted explosives which destroyed much of the supplies in the asteroid.\nAfter the failed asteroid heist and another failed raid on a Separatist listening post on Vanqor, Mundi took part in a Council emergency meeting to discuss Vos' treason against the Jedi. During the meeting, he cited Offee's actions as a sign that the Jedi had a problem with traitors within their own ranks. He supported Windu's suggestion that they should execute Vos as a deterrent. When Kenobi recommended banishing him, Mundi argued that Vos posed a serious threat to the galaxy due to status as a highly-trained Jedi Master who had turned to the dark side. In the end, the Council decided to test Vos' loyalty by sending him on a mission to kill Dooku.\nLater, Mundi was present when the Council deliberated including Ventress in this mission. Mundi supported Vos' arguments that Ventress should come along on the grounds that the Council had given her a full pardon. Ventress informed the Council that Dooku was last sighted in a Separatist dreadnought above Christophsis. The Council's suspicions were proven when Vos failed to kill Dooku and instead attempted to force the Sith Lord to lead him to Darth Sidious. Kenobi and the Skywalker apprehended Vos but the turncoat Jedi and Dooku escaped to Christophsis, leading to the events of the Second battle of Christophsis; which ended in Vos' redemption.\nAs General Grievous engaged the Republic in the Outer Rim Sieges, Mundi joined a meeting with the Jedi Generals via hologram. During the meeting, which took place around the Battle of Yerbana, Yoda dispatched the Generals to various systems. Mundi himself was sent to Mygeeto, where he fought alongside the 21st Nova Corps. During the sieges, however, Grievous led a counteroffensive with a Confederate fleet into Coruscant, kidnapped Chancellor Palpatine, and took him hostage aboard his ship, the Invisible Hand. In the ensuing battle, Generals Skywalker and Kenobi managed to retrieve the captive Chancellor, killing Dooku in the process.\n\nIn the wake of the battle, Palpatine appointed Skywalker as his personal representative on the Jedi Council, hoping to increase his influence over the body and further ingratiate himself with Anakin and lure him to the dark side. The Council begrudgingly accepted Palpatine's interference, but they refused to grant Skywalker the rank of Master, infuriating him. Furthermore, the Council assigned Skywalker the unofficial task of spying on the Chancellor, an assignment that Skywalker was less than enthusiastic about because he considered Palpatine to be a friend and mentor. Mundi then reported that, despite surveying all Republic systems, they had found no sign of Grievous. When Yoda recommended searching the outlying systems, Mundi reminded him of the Separatist attack on the Wookiees of Kashyyyk. To this, Yoda said he would go to Kashyyyk himself, as he had good relations with the Wookiees.Sometime later, CC-2224, also known as \"Cody,\" interrupted Mundi's meeting with Yoda, Windu, Secura, and Skywalker and reported that General Kenobi had engaged Grievous on Utapau, the planet where the cyborg had been located. Windu subsequently sent Skywalker to notify Chancellor Palpatine of the information, and Cody disconnected. Windu then informed the others that he sensed a plot to destroy the Jedi, and that the dark side surrounded the Chancellor. To this, Mundi asserted that, should Palpatine refuse to relinquish his emergency powers once Grievous was killed, he should be removed from office. Windu claimed the Jedi Council would have to take control of the Senate to secure a peaceful transition, and Yoda pointed out they must take great care as this line of thought could take them to a dark place. \nThey were then joined by Tano and Commander Rex, who reported that she and her forces had successfully captured Maul on Mandalore. Yoda thanked Tano for her service, but Ahsoka asserted that she had done her duty as a citizen. Windu then informed her that Skywalker had been sent to inform the Chancellor of the battle on Utapau, and Tano asserted that Grievous's death could end the war. Windu rebutted that all of that was dependent on the Chancellor, and when Ahsoka asked what he meant, Windu told her that that was business for the council to discuss. Mundi, Secura, and Windu disconnected, and Mundi returned to the fight on Mygeeto.\nJust days after Grievous's death at the hands of General Kenobi, the Council confirmed its suspicions that Chancellor Palpatine was in fact, Darth Sidious. Master Windu attempted to arrest Sidious, but he and the three Jedi with him, Kit Fisto, Saesee Tiin, and Agen Kolar, were killed by the Sith Lord with aid from Anakin Skywalker, who had long been groomed by Palpatine to turn to the Dark Side of the Force. Realizing that the time had come for him to make his moves against the Jedi and the Senate, Sidious initiated Order 66, declaring all Jedi traitors to the Republic and ordering the Grand Army to execute them at once.\nAs this happened, Mundi led the in a charge across a bridge on Mygeeto when Order 66 reached Clone Commander Bacara, who ordered the other marines to open fire. Realizing too late he had been betrayed by his clone troopers, Mundi raised his lightsaber and deflected a handful of the shots, sending them hurling back toward the squad. However, one of the blasts struck Mundi in the stomach, which rendered him incapable of defending himself from a subsequent barrage of shots. Dropping his lightsaber, Mundi was riddled with blaster fire and fell to the ground, dead.\nThree years before the Battle of Yavin, Mundi's lightsaber was seen in former Jedi Padawan Kanan Jarrus's vision of the Jedi Temple's dojo during his second visit to Lothal's Jedi Temple.\nKi-Adi-Mundi was a Cerean male who had white hair, yellow eyes, light skin, and a height of 1.98 meters. He was a logical and methodical Jedi Master who was well-known for his wisdom, his noble thinking, and his courage. Like other Cereans, he was highly intelligent due to his binary brain, which allowed him to observe both sides of a situation simultaneously. His wise way of thinking made him an excellent strategist. When Jedi Masters needed advice, they often sought Mundi's opinion.\nIn Mundi's opinion, the adventurous natures of Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano were unusual. During the second battle of Geonosis, Mundi was shown to be self contradicting, stating to Wullf Yularen \"there is no such thing as luck,\" but later saying his troops needed \"some luck\" to reach the landing zone on Geonosis. Like his fellow Jedi Master Luminara Unduli, he was disturbed by Skywalker's brutal interrogation methods on Poggle the Lesser shortly after Poggle's capture during the Second Battle of Geonosis.\nHowever, because of his strict adherence to logic, Mundi had a tendency to refute unlikely events. For example, he doubted Qui-Gon Jinn's revelation that the Sith had returned, arguing that such a notion was \"impossible\" because they had not been sighted for a millennium. He was also dubious about Count Dooku's possible involvement in an assassination attempt on Senator Padmé Amidala, believing he was incapable of violence or murder because of his Jedi past. When Ahsoka Tano was framed for treason, the evidence against her, as well as the wish to keep the relationship between the Jedi Order and the Galactic Senate undamaged, led Mundi and the Council to expel Tano from the Order and turn her over to the Republic military. However, after her innocence was proven and the real traitor apprehended, Mundi joined his colleagues in offering to reinstate Tano into the Order, praising her efforts to prove her innocence and stating that she had shown the \"true sign of a Jedi Knight.\" He was aghast when she instead chose to walk away from the Order.\nMundi was a lightsaber expert, possessing at least some skill with Makashi. Mundi also had extremely fast reflexes which allowed him to react in time to defend himself for a short while after his clone troopers attacked him after the enactment of Order 66. While he was ultimately killed in the encounter, Mundi was able to deflect several shots and kill one of his troopers before they killed him.\nKi-Adi-Mundi was designed by artistic director and concept designer Iain McCaig for the 1999 film Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy. The design for what eventually became Mundi began when Star Wars creator and executive producer George Lucas asked McCaig to draw sketches for alien characters to be featured on the Jedi High Council. In doing so, McCaig experimented by drawing some unusual parodies of the elderly Obi-Wan Kenobi, including one with whale-like features, and an elongated head with ridges along the back of the neck. While drawing early conceptual sketches of the Jedi characters for the 2005 film Star Wars: Episode III Revenge of the Sith, the final installment in the trilogy, concept artist Derek Thompson proposed a version of Mundi that had lost his left eye during the battles of the Clone Wars and now wore an eye patch along with a black and gold cape. The concept was ultimately not used in the final film.\nKi-Adi-Mundi was portrayed by Silas Carson in all three prequel films. Carson originally auditioned for the supporting role of a fighter pilot role, but the character was eliminated from the script a few days after the audition. However, George Lucas screened a video of Silas' audition and was so impressed he encouraged the actor to accept the role of Mundi, which led him to play the other parts as well. In addition to appearing on-screen, Carson also performed Mundi's voice, mimicking that of an elderly man who speaks slowly and deliberately. During the filming of The Phantom Menace, executive producer George Lucas had not yet decided whether he would keep Carson's voice or dub in that of another actor, as he had done for several other characters, but Lucas found he liked Carson's vocal performance and decided to keep it. To create Mundi's movements, Carson spent time with elderly people and watched the ways they moved and spoke. In crafting Mundi's manner of speech, Carson said he spoke slowly not only because of the Jedi's age, but because he believed Mundi was wise and would not waste his words.\nLucas did not give Carson any backstory from which to build his performance as Mundi, but simply left it up to the actor to create. Once the shooting of each film was completed, Carson did not know right away whether he would be returning for the next film. According to Star Wars Insider writer Scott Chernoff, Lucas, producer Rick McCallum and casting director Robin Gurland were so impressed with Carson's four performances in The Phantom Menace that they decided to expand upon Mundi's role in the second film.\nThe Mundi costume and prosthetics were designed by the Industrial Light \u0026 Magic visual effects creature shop. They included a prosthetic head, fake hair and two cheek pieces that were built and glued onto Carson's face so they would actually move along with his facial reactions. During the first film, it took about four hours to apply Mundi's make-up and prosthesis, but in the later films the process was narrowed down to three hours. However, while the process took longer to prepare for Mundi than it did for Nute Gunray or Lott Dod, Carson said the Mundi make-up was less hot and more comfortable to wear than those other character and that he would often walk around off-set and forget he had the make-up on at all. During filming for the 2002 film Star Wars: Episode II Attack of the Clones, the make-up artists used a different brand of make-up glues and removers, causing Silas' skin to break out due to allergies. Silas was trained by stunt coordinator Nick Gillard for his lightsaber scenes in Attack of the Clones. Upon learning Mundi would be fighting in that film, Carson worked out a great deal before filming began to get physically fit, and claimed he was even outrunning some of the stunt performers. For these scenes, Carson decided that although Mundi appeared slow and frail at normal times, he should be fast and strong while fighting, although the actor struggled to maintain the balance between those two different aspects of the character.\nMundi is the only sitting Jedi High Council member other than Yoda and Windu to have a speaking role in the final cut of the first three films. In Attack of the Clones, Mundi can be seen fighting with a green-bladed lightsaber during a shot when he stands back-to-back with Padmé Amidala. The character uses a blue-bladed lightsaber in every other shot in the film, including those that come immediately before and after that particular shot. A scene was partially filmed for Attack of the Clones in which Mundi and Plo Koon led a group of Jedi on a raid of a Trade Federation ship during the battle of Geonosis. This scene did not appear in the final version of the film, but the rough cut and animations later became available on the official website for registered Hyperspace customers. That rough cut was also included among the deleted scenes for Attack of the Clones in the Star Wars: The Complete Saga Blu-ray collection, which was released in September 2011.\nAccording to the illustrated screenplay of Revenge of the Sith, Mundi was intended to be blasted by Bacara and his troops before having the chance to defend himself during Order 66. This portrayal of Mundi's death was depicted in the 2019 comic book Galaxy's Edge 2.\nKi-Adi-Mundi was voiced by Brian George in the Star Wars: The Clone Wars television series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/Mundi_(disambiguation)",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Hyperspace_Stories_1",
  "/wiki/Kanan_7",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Star_Wars_Lightsabers:_A_Guide_to_Weapons_of_the_Force",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Workbook:_2nd_Grade_Reading",
  "/wiki/Special:Upload",
  "/wiki/Cerea",
  "/wiki/19_BBY",
  "/wiki/Mygeeto",
  "/wiki/Cerean",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/CC-1993%27s_battalion",
  "/wiki/21st_Nova_Corps",
  "/wiki/Yoda",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Standard_decade",
  "/wiki/Clone_Wars",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Jedi_General",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi",
  "/wiki/Clone_trooper",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_military",
  "/wiki/The_galaxy",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Geonosis",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Mygeeto_Campaign",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_Lord",
  "/wiki/Army",
  "/wiki/Cloning",
  "/wiki/Soldier",
  "/wiki/Order_66",
  "/wiki/Death",
  "/wiki/Ki-Adi-Mundi%27s_lightsaber",
  "/wiki/Collector",
  "/wiki/Dok-Ondar",
  "/wiki/Sergeant",
  "/wiki/First_Order",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Katri",
  "/wiki/Raxus_Secundus",
  "/wiki/Security_guard",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Funeral_of_Katri",
  "/wiki/Jedi_Initiate",
  "/wiki/Tera_Sinube",
  "/wiki/Jocasta_Nu",
  "/wiki/32_BBY",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Duel_on_Tatooine",
  "/wiki/Tatooine",
  "/wiki/Zabrak",
  "/wiki/Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Midi-chlorian",
  "/wiki/The_Force",
  "/wiki/Jedi_training",
  "/wiki/Battle_of_Naboo",
  "/wiki/Maul",
  "/wiki/Naboo",
  "/wiki/Funeral_of_Qui-Gon_Jinn",
  "/wiki/29_BBY",
  "/wiki/Carnelion_IV",
  "/wiki/Mission_to_Carnelion_IV",
  "/wiki/Open-Closed_war",
  "/wiki/Open",
  "/wiki/Closed",
  "/wiki/Emperor%27s_office",
  "/wiki/Mace_Windu",
  "/wiki/Plo_Koon",
  "/wiki/Kit_Fisto",
  "/wiki/Luminara_Unduli",
  "/wiki/Barriss_Offee",
  "/wiki/Star_system",
  "/wiki/Separatist_Crisis",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Galactic_Senate",
  "/wiki/Military_Creation_Act",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Politics",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Assassin",
  "/wiki/Bounty",
  "/wiki/Geonosian_droid_factories",
  "/wiki/Trade_Federation",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Droideka",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Ask_Aak",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Mas_Amedda",
  "/wiki/Jedi_strike_team",
  "/wiki/Petranaki_Arena",
  "/wiki/Aayla_Secura",
  "/wiki/Lightsaber",
  "/wiki/Droid",
  "/wiki/Standard_minute",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Gunship",
  "/wiki/Fire",
  "/wiki/Blaster",
  "/wiki/Pilot",
  "/wiki/Desert",
  "/wiki/Hologram",
  "/wiki/Galaxy",
  "/wiki/Operation_on_Hissrich",
  "/wiki/Hissrich",
  "/wiki/Mace_Windu%27s_squad",
  "/wiki/Tenth_Brother",
  "/wiki/Jedi_Archives",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Cadesura_disaster",
  "/wiki/Cato_Neimoidia",
  "/wiki/Mission_to_Cato_Neimoidia_(Kenobi_and_Skywalker)",
  "/wiki/File:MyEverlastingRespect-LaPR.ogg",
  "/wiki/Geonosian",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Battle_droid",
  "/wiki/Factory",
  "/wiki/Fleet",
  "/wiki/Bridge_(starship)",
  "/wiki/Star_Destroyer",
  "/wiki/Ahsoka_Tano",
  "/wiki/Ray_shield",
  "/wiki/Geonosis_primary_droid_foundry",
  "/wiki/CC-1993",
  "/wiki/Staging_area",
  "/wiki/Point_Rain",
  "/wiki/Deflector_shield_generator",
  "/wiki/Troop",
  "/wiki/Company",
  "/wiki/Resolute",
  "/wiki/Flagship",
  "/wiki/Admiral",
  "/wiki/Wullf_Yularen",
  "/wiki/Starship",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Walker",
  "/wiki/Caltrop_field",
  "/wiki/Starfighter",
  "/wiki/Cave",
  "/wiki/Clone_flametrooper",
  "/wiki/Flamethrower",
  "/wiki/BTL-B_Y-wing_starfighter/bomber",
  "/wiki/Squadron",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Bacta_tank",
  "/wiki/Republic_Military",
  "/wiki/Transport",
  "/wiki/Progate_Temple",
  "/wiki/Sandstorm",
  "/wiki/Brain_worm",
  "/wiki/Trooper",
  "/wiki/Prisoner",
  "/wiki/Dantooine",
  "/wiki/Defense_of_Dantooine",
  "/wiki/Ord_Cestus_medical_station",
  "/wiki/Ord_Cestus",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Skirmish_aboard_TB-73",
  "/wiki/Brain",
  "/wiki/Worm",
  "/wiki/Temperature",
  "/wiki/Jedi_Knight",
  "/wiki/Capture_of_Eeth_Koth",
  "/wiki/Eeth_Koth",
  "/wiki/Saleucami",
  "/wiki/Saleucami_system",
  "/wiki/Adi_Gallia",
  "/wiki/Battle_of_Saleucami",
  "/wiki/Standard_week",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Vanqor",
  "/wiki/Nils_Tenant",
  "/wiki/Chrelythiumn_system",
  "/wiki/Distress_signal",
  "/wiki/Standard_year",
  "/wiki/Festival_of_Light",
  "/wiki/Rako_Hardeen",
  "/wiki/Funeral_of_Obi-Wan_Kenobi",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Raydonia",
  "/wiki/Darth",
  "/wiki/Massacre_on_Raydonia",
  "/wiki/Raydonian_settlement",
  "/wiki/Skirmish_above_Raydonia",
  "/wiki/Lord",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Mandalore",
  "/wiki/Shadow_Collective",
  "/wiki/Mandalorian_civil_war_(Clone_Wars)",
  "/wiki/Battle_of_Mandalore",
  "/wiki/Jedi_temple",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Hangar",
  "/wiki/Grand_Master",
  "/wiki/Defense_of_Cato_Neimoidia",
  "/wiki/Jedi_Council_Chamber",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Anti-Jedi_sentiment",
  "/wiki/Letta_Turmond",
  "/wiki/Marriage",
  "/wiki/Jackar_Bowmani",
  "/wiki/NM-K_reconstitutor",
  "/wiki/Funeral_of_the_Jedi_Temple_bombing_victims",
  "/wiki/Tutso_Mara",
  "/wiki/Clone_Commander",
  "/wiki/CC-1010",
  "/wiki/Prison",
  "/wiki/Escape_from_the_Republic_military_base",
  "/wiki/Imperial_Inspectorate_HQ",
  "/wiki/Underworld_portal",
  "/wiki/Coruscant_Underworld",
  "/wiki/Commander",
  "/wiki/Wolffe",
  "/wiki/Level_1315",
  "/wiki/Abandoned_munitions_warehouse",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Saesee_Tiin",
  "/wiki/Chamber_of_Judgment",
  "/wiki/Shaak_Ti",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Jedi_Trials",
  "/wiki/Mission_to_Oba_Diah_(Clone_Wars)",
  "/wiki/Mission_to_Oba_Diah_(pre%E2%80%93Naboo_Crisis)",
  "/wiki/Sifo-Dyas",
  "/wiki/Force_spirit",
  "/wiki/Meditation",
  "/wiki/Quinlan_Vos",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/Head_of_State",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Taris",
  "/wiki/Rescue_of_Quinlan_Vos",
  "/wiki/Asajj_Ventress",
  "/wiki/Sith_apprentice",
  "/wiki/Destruction_of_the_Separatist_supply_storage_base",
  "/wiki/Separatist_supply_storage_base",
  "/wiki/Foodstuff",
  "/wiki/Asteroid",
  "/wiki/Destruction_of_the_Vanqor_listening_station",
  "/wiki/Vanqor_listening_station",
  "/wiki/Listening_post",
  "/wiki/Treason",
  "/wiki/Christophsis",
  "/wiki/Second_battle_of_Christophsis",
  "/wiki/Battle_of_Yerbana",
  "/wiki/Invisible_Hand",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Wookiee",
  "/wiki/Kashyyyk",
  "/wiki/CC-2224",
  "/wiki/Battle_of_Utapau",
  "/wiki/Duel_in_Palpatine%27s_office",
  "/wiki/Agen_Kolar",
  "/wiki/Dark_Side_of_the_Force",
  "/wiki/CC-1138",
  "/wiki/Ki-Adi-Mundi%27s_squad",
  "/wiki/Stomach",
  "/wiki/Unidentified_First_Order_stormtrooper_sergeant",
  "/wiki/Battle_of_Yavin",
  "/wiki/Kanan_Jarrus",
  "/wiki/Jedi_Temple_dojo",
  "/wiki/Lothal",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Millennium",
  "/wiki/Form_II",
  "/wiki/Iain_McCaig",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/George_Lucas",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Derek_Thompson",
  "/wiki/Eye_patch",
  "/wiki/Silas_Carson",
  "/wiki/Lott_Dod",
  "/wiki/Antidar_Williams",
  "/wiki/Star_Wars_Insider",
  "/wiki/Scott_Chernoff",
  "/wiki/Rick_McCallum",
  "/wiki/Robin_Gurland",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Nick_Gillard",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/2011",
  "/wiki/Star_Wars_Episode_III_Revenge_of_the_Sith:_Illustrated_Screenplay",
  "/wiki/2019",
  "/wiki/Comic_book",
  "/wiki/Brian_George",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Choices",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Age_of_Republic_-_Obi-Wan_Kenobi_1",
  "/wiki/Obi-Wan_and_Anakin_5",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/Brotherhood",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Weapons_Factory",
  "/wiki/Legacy_of_Terror",
  "/wiki/Brain_Invaders",
  "/wiki/Grievous_Intrigue",
  "/wiki/The_Deserter",
  "/wiki/R2_Come_Home",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Intermission,_Part_I",
  "/wiki/Star_Wars_Adventures_(2017)_12",
  "/wiki/Overlords",
  "/wiki/Kidnapped",
  "/wiki/Deception",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Revenge_(episode)",
  "/wiki/A_War_on_Two_Fronts",
  "/wiki/The_Lawless",
  "/wiki/Kenobi%27s_Shadow",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Conspiracy",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/The_Lost_One",
  "/wiki/Voices",
  "/wiki/Destiny_(episode)",
  "/wiki/The_Big_Bang",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Gone_with_a_Trace",
  "/wiki/Shattered",
  "/wiki/Kanan_2",
  "/wiki/A_New_Dawn_(novel)",
  "/wiki/A_New_Dawn_(audiobook)",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/Obi-Wan_4",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Yoda_%E2%80%93_The_Jedi_Master",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Ki-Adi-Mundi",
  "/wiki/Category:Images_of_Ki-Adi-Mundi",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/A_Trip_to_the_Light_Side",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/Journey_Through_Space_(2015)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Star_Wars_Helmet_Collection_32",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Star_Wars_Helmet_Collection_72",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_31",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/A_Galaxy_for_Everyone",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/The_Phantom_Apprentice",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Shroud_of_Darkness",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/Star_Wars_Insider_55",
  "/wiki/The_Art_of_Star_Wars_Episode_I:_The_Phantom_Menace",
  "/wiki/The_Art_of_Star_Wars_Episode_III:_Revenge_of_the_Sith",
  "/wiki/Star_Wars_Insider_44",
  "/wiki/Multiple_Personality",
  "/wiki/Star_Wars_Insider_83",
  "/wiki/Even_Piell",
  "/wiki/Yarael_Poof",
  "/wiki/Oppo_Rancisis",
  "/wiki/Yaddle",
  "/wiki/Depa_Billaba",
  "/wiki/22_BBY",
  "/wiki/Coleman_Trebor",
  "/wiki/20_BBY",
  "/wiki/Coleman_Kcaj",
  "/wiki/Stass_Allie"
 ]
}