{
 "name": "Ki_Sazen",
 "display_name": "Ki Sazen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Teal"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Cult of Ki Sazen"
     ]
    }
   ]
  }
 ],
 "content": "Ki Sazen was a female Zabrak Jedi who lived during the Cold War and the Galactic War. She was admired for her many accomplishments despite her young age, but her pride ultimately caused her to fall to the dark side of the Force.\nHaving attracted the support of a Nikto cult that became known as the Cult of Ki Sazen, the fallen Jedi abused her position within the Jedi Order to steal important artifacts and technology. As a result the Republic Strategic Information Service labeled her a rogue element.\nBringing her cult to Taris, Sazen sent her followers to raid both Republic and Imperial scientific outposts in search of the information needed to complete the Ultrawave Transmitter, which would allow her to create an army of rakghouls and take control of the planet.\nHowever, her plans were foiled by the Imperial Agent Cipher Nine.\nConsidered an exceptionally accomplished Padawan, Ki Sazen was widely known for saving Starbright Station and achieving the Treaty at Bresnan. She later traveled to the planet Tas-La and killed the Spine Dragon of M'dweshuu, a creature ravaging the homeland of the planet's Nikto. Many Nikto swore a life debt to her out of gratitude.\nHoping to turn this to the Republic's advantage, Sazen tasked her followers to fight for the Republic in exchange for land and weapons and to ask their kin to do the same. As a result, many Nikto followers of Ki Sazen left Tas-La and joined the Republic's resettlement efforts on Taris. Due to the Imperial bombardment during the war, Taris had become heavily polluted and infested with rakghouls. Ki Sazen considered it a \"festering pus-hole of a planet\" and swore she would join her followers on Taris in order to lead them. Soon the Nikto followers gathered as a cult that worshipped her as a savior.\nSazen's Jedi Master was concerned by the effect the cult's worship was having on her, and encouraged her to release them from their life-debt. Sazen, however, felt that he was holding her back because he questioned her capabilities and readiness to lead. She considered this unfair in light of her many accomplishments.\nSoon after, Sazen's master was faced with an unknown threat. Sazen had the opportunity to save him but, angry with him, allowed him to die. She then took over leading the cult more directly, beginning to believe in their vision of her as a savior and spiritual guide. However, she was eventually betrayed by Thothash, a member of the cult who killed another member and questioned the cult's spiritual principles.\nShaken by this betrayal, Sazen decided to go into exile in a figurative new Wannschok. Reluctant to kill someone she'd fought beside, she brought Thothash with her as his penance. She began to travel the galaxy in search of the new home she had promised for her cult, growing more and more distant from the principles of the Jedi.\nStill considered an accomplished member of the Jedi Order, Sazen used her time in exile to fight for the Republic. However, she abused her position to benefit her cult, stealing important materials she was assigned to guard. She also became increasingly reckless and selfish, fully believing in the legend of her greatness that her cult had propagated.\nAs a result of this mindset she was less concerned with protecting her Republic allies, and many of them were killed on missions. She also ruined Republic treaties. Her increasingly poor record on behalf of the Republic deeply concerned the Republic Strategic Information Service, which labeled her a corrupt Jedi and began to track her movements.\nEventually, Sazen came to believe that she was being called by the Force to Taris.\nSazen ended her exile by sending her chosen to contact the cult and notify them of her decision to join them on Taris. She and the Nikto set up their main base in an abandoned tunnel system in the main Republic compound. Her goal was to use Republic scientist Nasan Godera's Ultrawave Transmitter to create a rakghoul army and take control of the planet.\nThe cult was successful in retrieving the device, ransacking Godera's lab before abandoning it to the rakghouls, but Sazen soon learned that Godera had never completed it, and additional data was required. She sent her chosen to secure data on rakghoul physiology and movement patterns as well as the cooperation of Republic rakghoul experts.\nThe cult successfully captured Doctor Vernon and Professor Sadus Vraal, but Sazen murdered them when they were unable to fix the transmitter. She hunted the remaining scientist, Ianna Cel, across Taris for weeks, trying to use threats and her authority as a Jedi to convince Cel to surrender to her.\nAround this time Imperial Intelligence agent Cipher Nine, posing as SIS operative \"Legate\", was sent to Taris by the SIS to investigate Sazen. With the help of Doctor Eckard Lokin and the SIS operative Chance, the agent was able to intercept the chosen Chevuk while he was searching for rakghoul biological data at Ryler Dorant's laboratory.\nCipher Nine tortured Chevuk nearly to death, forcing him to reveal Sazen's plot and the roles of the other two chosen. However, he still refused to reveal Sazen's location, so the agent executed him. Cipher Nine was then able to intercept and eliminate the chosen Bo'kesh, preventing him from securing data on rakghoul colony movements.\nAfter rescuing Doctor Cel, the agent and Doctor Lokin hatched a plot in which Lokin, the kind of rakghoul expert Sazen needed, would be captured by Sazen's cult. He would then contact Cipher Nine and reveal the location of Sazen's base. The plan worked, and the agent confronted Sazen and her last chosen, Fhentar.\nCipher Nine defeated them both, killing Fhentar and badly wounding Sazen. Sazen was defiant in defeat, telling the agent that the Nikto would sing the Death Song of Thre'shalu for her and ensure that her legend would live on.\nWith Sazen at the agent's mercy, Cipher Nine was forced to decide what to do with her.\nThe agent ultimately chose to offer her a place among the Sith. Sazen accepted, gathering her cult and departing from Taris. She later sent Cipher Nine a message informing the agent that she had embraced her new role, killing any who questioned taking orders from an ex-Jedi. She settled her cult on a different planet she believed they would love.\nSazen also mentioned that she had been offered the protection of Darth Serevin. Due to this rapid advancement, she was confident that she would soon become a Sith Lord.\nA prodigy who had accomplished more during her time as a Padawan than many Jedi did in their entire lives, Sazen drifted away from the Jedi code due to her pride in her achievements. She felt that her master should recognize her greatness, and was hurt by what she interpreted as his lack of faith in her.\nThe worship of her Nikto cult, which considered her a savior and provided the recognition she craved, pushed her further from the Jedi path. She came to believe completely in her role as their leader, both physically and spiritually, and saw herself as responsible for them. Establishing a paradise for them, the only ones to acknowledge her greatness, became her driving motivation.\nExtremely proud and self-confident, Sazen was fearless even in the face of death. She always sought to protect her cult, but as she increasingly succumbed to the dark side she began to place little value on the lives of beings that were not her subjects. At first it was her recklessness that allowed for the deaths of Republic allies, but she eventually progressed to personally murdering Republic personnel who displeased her.\nSazen believed that she could never go back to the Republic and the Jedi after what she had done, as she felt that the Jedi were not truly as merciful and understanding as most believed them to be. She also considered the Jedi to be dull, further stating that she had tried being passionless and found it too boring.\nSazen had fair skin, brown hair, and teal eyes.\nSazen was an accomplished lightsaber duelist who used an offensive style incorporating martial arts. Her charisma and commanding presence ensured the continued devotion of her Nikto cult. Her knowledge of the Republic allowed her to use her position as a Jedi to turn Republic supplies, bases, and personnel to her own ends.\nSazen fought unarmored, wearing a v-cut top that exposed her midriff, bracers, pants, and boots, all patterned in grey and brown. She wielded a single-bladed green lightsaber with a gold pommel and emitter and a purple grip.\nKi Sazen is a character in the 2011 video game Star Wars: The Old Republic, voiced by Laura Bailey. She is the primary antagonist of the Imperial Agent's class story arc on Taris. Depending on the player's choices, light side dialogues can lead to Sazen either rejoining the Jedi Order or joining the SIS; they may also result in Sazen attacking the player again, leading to her death. Dark side dialogue will involve either executing her or encouraging her to join the Sith.\nA male Agent who chooses the latter dark side option can romance Sazen.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Wolf_Sazen",
  "/wiki/New_Jedi_Order",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cult_of_Ki_Sazen",
  "/wiki/Ardun_Kothe",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Jedi/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Nikto/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Taris/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Ultrawave_Transmitter",
  "/wiki/Rakghoul",
  "/wiki/Imperial_Agent",
  "/wiki/Cipher_Nine",
  "/wiki/Padawan/Legends",
  "/wiki/Starbright_Station",
  "/wiki/Treaty_at_Bresnan",
  "/wiki/Tas-La",
  "/wiki/Death/Legends",
  "/wiki/Spine_Dragon_of_M%27dweshuu",
  "/wiki/Life_debt/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Thothash",
  "/wiki/Wannschok",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Chosen_(Ki_Sazen)",
  "/wiki/Nasan_Godera",
  "/wiki/Doctor/Legends",
  "/wiki/Vernon",
  "/wiki/Professor/Legends",
  "/wiki/Sadus_Vraal",
  "/wiki/Ianna_Cel",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Eckard_Lokin",
  "/wiki/Chance_(SIS)",
  "/wiki/Chevuk",
  "/wiki/Ryler_Dorant",
  "/wiki/Dorant%27s_laboratory",
  "/wiki/Canon",
  "/wiki/Bo%27kesh",
  "/wiki/Fhentar",
  "/wiki/Death_Song_of_Thre%27shalu",
  "/wiki/Darth_Serevin",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Laura_Bailey",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}