{
 "name": "Kicker",
 "display_name": "Kicker",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Brighthome"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "\"Kicker\" was a clone stormtrooper in service to the Galactic Empire after the Clone Wars, and a former clone trooper of the Galactic Republic. He was assigned to clearing out Jedi artifacts from a Jedi outpost in the Mid Rim, before it was attacked by the Sith Lord Darth Vader. He was ultimately Force-choked to death while defending the outpost from the Sith Lord.\nGrown on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the Grand Army of the Republic, the individual who adopted the nickname \"Kicker\" was a clone trooper who served as a stormtrooper in the early days of the Galactic Empire. Assigned to the Mid Rim Jedi space station Brighthome during the Great Jedi Purge, Kicker and the contingent of clones at Brighthome were tasked to document the Jedi artifacts held there. Eight clone stormtroopers, including Kicker, \"Ding,\" their stormtrooper leader, and four ARC-170 starfighters were assigned to the Brighthome when it was attacked by the newly christened Dark Lord of the Sith, Darth Vader.\nAlthough they were all allied troops, Vader decided to attack the clone Imperial contingent, destroying the starfighter forces before landing in the Brighthome. Determining Vader to be a surviving Jedi, the troopers attacked Vader once he broke through the sealed doors, eventually killing all troopers including Kicker, who was ultimately Force-choked to death.\nAs a clone, Kicker was a human male who stood 1.83 meters tall. Kicker was annoyed when his comrade Ding ignited a lightsaber and pretended to be a Jedi, and complained that the Empire's best troops were conducting inventory checks rather than engaging in combat. Kicker had a strong sense of duty, considering the mission to clear out the outpost to be important, however menial it may be.\nAs a stormtrooper during the early years of the Galactic Empire, Kicker wore standard-issue Phase II clone trooper armor that was devoid of any markings or color. While defending the outpost from Darth Vader, Kicker utilized a blaster.\nKicker debuted in Darth Vader  2, a 2017 canon comic written by Charles Soule and penciled by Giuseppe Camuncoli. In several sequences in the comic, the speech bubbles of Ding and Kicker are incorrectly switched.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Clone_trooper",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Kicker_(stormtrooper)",
  "/wiki/Kicker_(grav-ball)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Brighthome",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Stormtrooper",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_artifact",
  "/wiki/Jedi",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Attack_on_Brighthome",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Force_choke",
  "/wiki/Death",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Jango_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/Standard_day",
  "/wiki/Space_station",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Ding",
  "/wiki/Unidentified_stormtrooper_(Brighthome)",
  "/wiki/Aggressive_ReConnaissance-170_starfighter",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Starfighter",
  "/wiki/Lightsaber",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Blaster",
  "/wiki/Darth_Vader_(2017)_2",
  "/wiki/2017",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Databank_(website)"
 ]
}