{
 "name": "Kid_Malmash",
 "display_name": "Kid Malmash",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Shungbeek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Citizens' Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Kid Malmash was a young Shungbeek male who transported fugitives to safe zones in his Lancer-class pursuit craft, the Nebular Kelpie. In 35 ABY, he was one of the many unaffiliated pilots who answered the call of the Resistance when they asked for aid in fighting Darth Sidious and the Sith Eternal at the planet Exegol. After they triumphed, he joined in the celebrations on the moon, Ajan Kloss.\nKid Malmash transported fugitives to safe zones aboard his Lancer-class pursuit craft, the Nebular Kelpie, for a steep price. This included wanted criminals and political refugees. By the time of the war between the First Order and the Resistance, Malmash was beginning to run out of safe destinations to take his passengers to. This cut into his profits.\nIn 35 ABY, Kid Malmash was one of many unaffiliated pilots who heard a plea for aid from Resistance agents Chewbacca and Lando Calrissian. Malmash and many others followed them through the hyperspace anomalies of the Unknown Regions in order to reinforce the Resistance as they fought against the forces of the Sith Eternal above the planet Exegol.\nAfter the Final Order fleet of Xyston-class Star Destroyers was destroyed, Kid Malmash was amongst the many participants of the battle who returned to the Resistance base on the jungle moon Ajan Kloss to celebrate the victory. As the droids BB-8 and D-O reunited, Malmash danced next to a GNK-series power droid before moving to stand with the pilot AL1-L3 and the bounty hunter Seleno Chandro as the pirate Maz Kanata spoke with Chewbacca.\nKid Malmash was a male Shungbeek with white skin and red eyes. He required an argon-rich atmosphere to breath.\nKid Malmash wore a black suit with a perspex dome that retained an argon-rich atmosphere. He flew a Lancer-class pursuit craft named the Nebular Kelpie, which he modified with stealth technology.\nKid Malmash first appeared in J.J. Abrams's film Star Wars: Episode IX The Rise of Skywalker, which premiered on December 20 2019. He was identified in Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo and released on the same day as the film. Concept art of Malmash with much longer arms was created for the film by creature concept designer and senior sculptor Ivan Manzella and titled \"Wizard 40\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shungbeek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Lancer-class_pursuit_craft",
  "/wiki/Nebular_Kelpie",
  "/wiki/35_ABY",
  "/wiki/Pilot",
  "/wiki/Resistance",
  "/wiki/Battle_of_Exegol",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_Eternal",
  "/wiki/Planet",
  "/wiki/Exegol",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Time",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Chewbacca",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Hyperspace",
  "/wiki/Galactic_Barrier",
  "/wiki/Unknown_Regions",
  "/wiki/Sith_Eternal_military",
  "/wiki/Final_Order",
  "/wiki/Fleet",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Jungle",
  "/wiki/Droid",
  "/wiki/BB-8",
  "/wiki/D-O",
  "/wiki/GNK-series_power_droid",
  "/wiki/AL1-L3",
  "/wiki/Bounty_hunter",
  "/wiki/Seleno_Chandro",
  "/wiki/Pirate",
  "/wiki/Maz_Kanata",
  "/wiki/Eye",
  "/wiki/Argon",
  "/wiki/Atmosphere",
  "/wiki/Clothing",
  "/wiki/Perspex",
  "/wiki/J.J._Abrams",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/December_20",
  "/wiki/2019",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Ivan_Manzella",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/Star_Wars",
  "/wiki/File:EpisodeXI_release_date.png"
 ]
}