{
 "name": "Kidi_Aleri",
 "display_name": "Kidi Aleri",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Survey Corps",
      "Imperial Survey Corps",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kidi Aleri was a Cerean female signals analyst who joined the Rebel Alliance as a communications specialist in the Galactic Civil War. She was one of several individuals that were part of team headed by Princess Leia Organa for a mission known as Operation Yellow Moon.\nKidi Aleri was a female Cerean communications specialist in the Alliance military. Before that, she was a signals analyst in the Imperial Survey Corps until she deserted. She was assigned to Operation Yellow Moon at the suggestion of General Airen Cracken.\nOn the way to the planet Basteel, Aleri got into a heated argument with her team member Lokmarcha. She expressed hope that her former colleagues would be pardoned if the Alliance won the war, but Lokmarcha suggested that they should be imprisoned or executed. When the team arrived at Basteel, Leia Organa commanded Aleri to scan for both rebel and Imperial communications. Aleri did this, but was greatly unnerved by the rough approach to Eladro City and Nien Nunb's casual piloting. After they landed, she accompanied Nunb and Antrot to the bazaar while Organa and Lokmarcha met with a local contact. She rejoined the team in Bon Yoth's home and climbed up into the tunnels above the city so she could enter the encryption codes into the hyper-transceiver beacon. Lokmarcha realized she had all the Alliance codes memorized and chastised her. Aleri admitted she hadn't thought of that. She climbed to the surface and waited for Nunb to pick her up. Despite the harsh climate, she heard Nunb's call and sent him the location of the team.\nOnce on board the Mellcrawler, Aleri bickered with Lokmarcha about the best way to warm up and wondered why the Empire had shown up so quickly on Basteel. The next day, Aleri realized that the codes she was using were older codes that had been discontinued due to the fact that Imperial slicers might have broken them. She was worried that she might be responsible for the Empire's presence in the Corva sector. She showed the rest of the team an unauthorized holofeed of the Imperial crackdown on Basteel. Aleri wanted to change the encryption codes but was dissuaded by Organa.\nAfter they landed on Thrinaka, Aleri wondered why they hadn't just landed at the site of the beacon placement and was informed by Nunb that it was more inconspicuous to take a boat to the island instead. She bought some local clothes to better blend in with the tourists, including a garish tropical shirt. When Lokmarcha complained how the locals were more worried about the local weather than the Galactic Civil War, she reminded him that that was what they were fighting for. Lokmarcha admitted he hadn't thought of it in that way before. She traveled with the rest of her team to the volcanic island that was the location for the beacon. She and Antrot were escorted by Lokmarcha up the slope of the volcano to setup the beacon while Organa stayed behind on the beach to await a rendezvous with Aurelant. After activating the beacon, she returned to the beach and headed back to Thrinaka.\nOn the way back, they were intercepted by Imperial forces. Organa ordered Aleri to find a comm channel to use in case the Imperials attempted to jam them. Aleri was able to eavesdrop on their communications and informed Organa that it was Khione who was chasing them. After being captured by the pirates on the Daggadol, Aleri offered their ship in exchange for freedom, but was rebuffed. Once Organa convinced the pirates to ally themselves with the Rebel Alliance, Aurelant asked Aleri if she could tune a Horvax-16 transmitter. She replied that she was familiar with the Horvax-8 but did not have any knowledge on the subaquatic amplifying array that the Horvax-16 used. Antrot spoke up and said he had experience with customizing communication equipment. The pair was tasked with configuring the equipment so they could arrange their escape off the planet.\nOn the way to their next destination, Aleri showed Organa footage of Imperial action on Sesid and expressed her dismay. She was upset that everyone they interacted with was suffering. Organa reminded her of how evil the Empire was and that is why they were fighting against it. Above the planet, she remarked about how quiet it was in terms of electronic communications. Nunb explained that the inhabitants of the planet concentrated mostly on farming and feeding nearby planets. After landing, she accompanied the team to meet up with Nyessa, the local contact on the planet. Nyessa provided riding animals so that the rebels could make it to the communication tower and plant the beacon. After falling of her urda three times, Aleri rode with Lokmarcha. When they reached the tower, Aleri realized it wasn't a transmitter, only a conduit, and that she would need to modify the signal from the beacon so that it wouldn't be lost in the planet's communication traffic.\nAfter placing the beacon, the tech returned to the ground where Organa revealed the true nature of Operation Yellow Moon. The Cerean was shocked and upset at the deception and refused to participate in any more actions that might lead to innocents being harmed. They returned to Jowloon and setup an ambush in Old Grimshaw's barn. When Organa left the barn to engage the Imperials, Aleri grabbed an E-11 medium blaster rifle and joined her. She attempted to shoot a stormtrooper, but forgot to undo the safety on her weapon. Aleri turned off the safety and mistakenly fired a bolt by the princess's head.\nAs they were leaving the planet, the Mellcrawler was intercepted by the Shieldmaiden. Aleri noticed that the Star Destroyer was hailing them and expressed dismay when the captain threatened to attack Jaresh if they did not surrender. After they escaped, Aleri met with the rest of the team to decide on a plan of action. When Organa decided that they would continue to Yellow Moon in an attempt to warn off any ships that might show up, Aleri stated that she wanted to go also to help in any way possible. Lokmarcha pointed out that they couldn't warn anyone without the possibility of tipping off the Empire to the true nature of Operation Yellow Moon, but Aleri conceived of a plan to use a tightbeam to broadcast a new encryption code directly to any ships that responded to the beacons' call. After the meeting broke up, she and Lokmarcha shared a romantic encounter on the acceleration couch.\nWhen they arrived at Yellow Moon Aleri contacted and sent the encryption code to all the ships that showed up. As they were being captured by the Imperials who had followed them, Aleri expressed fear at the possibility of interrogation. She was able to escape her cell after Lokmarcha detonated the electromagnetic pulse bomb in his chest that disabled all the electronics in the area. She became distraught when she saw his corpse. Organa ordered her to find some binders to use as props in a ruse to get by Imperial scrutiny. When they were discovered in the landing bay, Aleri was able to escape and board the Tydirium. Once on-board, she got on comm and followed Organa's order to broadcast to the rebel ships that they were friendly so they wouldn't get shot down during their escape. She also informed them that there was another Star Destroyer in the area, and there was a fleet comprised of all the ships that had responded to their beacons that was engaging the Imperials. After they escaped, Aleri mourned the fact that she had lost Lokmarcha but Organa reassured her that he did love her. She later broadcast an encrypted transmission to R2-D2 so that Organa could converse with Luke Skywalker.\nAleri was thin and pale, with a large conical head and blonde hair. She was upbeat, but naïve about the workings of the galaxy.\nAleri was very adept in finding signals and hiding messages in standard communications. She was adept at riding aryx. She was capable of using a blaster, but not very competent with it.\nAleri wore multiple datapads and headphones. The datapads were strapped to her limbs for easy access. Her headphones had a built-in translator unit.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Cerean",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Survey_Corps",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Civil_War",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Operation_Yellow_Moon",
  "/wiki/General",
  "/wiki/Airen_Cracken",
  "/wiki/Basteel",
  "/wiki/Lokmarcha",
  "/wiki/Prison",
  "/wiki/Death",
  "/wiki/Eladro_City",
  "/wiki/Nien_Nunb",
  "/wiki/Bon_Yoth",
  "/wiki/Slicer",
  "/wiki/Thrinaka",
  "/wiki/Aurelant",
  "/wiki/Khione",
  "/wiki/Daggadol",
  "/wiki/Nyessa",
  "/wiki/Urda",
  "/wiki/Grimshaw",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Stormtrooper",
  "/wiki/Star_Destroyer",
  "/wiki/Yellow_Moon",
  "/wiki/Acceleration_couch",
  "/wiki/Electromagnetic_pulse",
  "/wiki/Stuncuffs",
  "/wiki/Tydirium",
  "/wiki/R2-D2",
  "/wiki/Luke_Skywalker",
  "/wiki/The_galaxy",
  "/wiki/Aryx",
  "/wiki/Datapad",
  "/wiki/Category:Images_of_Kidi_Aleri",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)",
  "/wiki/Leia_and_the_Great_Island_Escape",
  "/wiki/Rebel_Rescues",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Highlights_of_the_Saga"
 ]
}