{
 "name": "Kiera Swan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sriluur"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Kiera Swan was a female Weequay pirate-turned-bounty hunter in operation during the Clone Wars. Swan won the Obsidian Sphere twice. Swan's skills caught the eye of the Sith Lord Count Dooku and Phindian criminal mastermind Moralo Eval, who invited Kiera to participate in a series of challenges at the Box on the planet Serenno.\nAt some unspecified point of her life, Kiera Swan became a pirate, and became well known in the galaxy. However, she later abandoned that occupation and became a bounty hunter, something which made her more famous than she was before. In 20 BBY, during the Clone Wars, Swan was invited along some other fellow bounty hunters by the Sith Lord Count Dooku and the Phindian criminal mastermind Moralo Eval to participate in a series of challenges at the Box on the planet Serenno. Swan's skills were the main reason for which she caught Dooku's eye.\nCompeting against other bounty hunters in the potentially fatal challenges, the victors would receive the honor of kidnapping Supreme Chancellor Sheev Palpatine of the Galactic Republic. Kiera did well the first challenge like the others and made it to the second challenge. Following Onca's death, all the bounty hunters started to search possibilities to escape from the room with laser spike-tipped horizontal columns. Just when Cad Bane was seeing how Rako Hardeen managed to escape from the room, Kiera jumped but a electrified laser blade column impaled her before she could take the Duros' life, killing her.\nA legendary bounty hunter and pirate, Kiera Swan was known for being skilled enough to do the transition from a notorious Weequay pirate to a famous bounty hunter, passing from breaking interstellar shipping laws to being licensed to hunt criminals.\nWith a price on Swan's head for her ship-raiding past, Kiera Swan just tended to accept sometimes illegal bounties, although she avoided working closely with other bounty hunters, as she literally didn't trust on them.\nSwan's name is a reference to Pirates of the Caribbean, in which the character Elizabeth Swann was played by Keira Knightley, who played handmaiden Sabé in the 1999 film Star Wars: Episode I The Phantom Menace.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kiera_Swan",
  "/wiki/Kiera_Swan/Legends",
  "/wiki/Sriluur",
  "/wiki/20_BBY",
  "/wiki/Serenno",
  "/wiki/Weequay",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Pirate",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_Wars",
  "/wiki/Obsidian_Sphere",
  "/wiki/Eye",
  "/wiki/Sith_Lord",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Phindian",
  "/wiki/Moralo_Eval",
  "/wiki/Box",
  "/wiki/Planet",
  "/wiki/The_galaxy",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Republic",
  "/wiki/Onca",
  "/wiki/Death",
  "/wiki/Cad_Bane",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Electrified_laser_blade",
  "/wiki/Duros",
  "/wiki/Starship",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Kiera_Swan",
  "/wiki/Keira_Knightley",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Sab%C3%A9",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Box",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Bane%27s_Story",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Category:Images_of_Kiera_Swan",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Prisoners",
  "/wiki/Standard_year"
 ]
}