{
 "name": "Kier Domadi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Paucris system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark-brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Golden tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Apprentice Legislature",
      "Apprentice Legislature"
     ]
    }
   ]
  }
 ],
 "content": "Kier Domadi was a human male from the planet Alderaan who, alongside Princess Leia Organa, represented Alderaan in the Apprentice Legislature in 3 BBY. Unlike most of the other Apprentice Legislators, Domadi did not intend to further his career in politics, intending to become a historian specializing in the Clone Wars. He participated in illegal Clone Wars reenactments, usually playing the role of a clone SCUBA trooper. Due to taking historical anthropology classes, he was knowledgeable about many primitive skills, including building a travois and knapping flint knives. He and Organa were attracted to each other, and started a relationship. Organa eventually chose to let Domadi in on the secret that her parents, Queen Breha and Viceroy Bail, were involved in building a rebellion against the Galactic Empire. Domadi was critical of the Organas' involvement due to his strong belief in Alderaanian pacifism, and also told Leia he was concerned about what the Empire might do to Alderaan if it found out about what the Organas were doing. This belief, coupled with his love of his homeworld being stronger than his fear of the Empire, led him to secretly collect data on the rebellion, intending to hand it over to the Empire in an attempt to ensure the safety of Alderaan and Leia.\nWhen Organa traveled to the Paucris system to warn a rebel base there that the Empire planned to investigate the system, Domadi, who Organa had contacted beforehand to tell him about her mission as explanation for why she had to cancel plans to meet him, followed in a cutter in an attempt to gather more information on the rebels. He arrived in the system just as the orbital platforms that had been used by the rebels were about to self-destruct. Organa, horrified when she realized who was piloting the ship, attempted to warn him, but the warning came too late and Domadi's ship was severely damaged by the explosions. He was mortally injured from the shockwave, and when Organa boarded his ship, he told her about his collection of information and asked her to turn in the memory rod with the data before dying. Organa instead took Domadi's body aboard her ship, and left the memory rod aboard Domadi's cutter to burn up in Paucris Major's atmosphere. Domadi's parents were told that he had died saving Leia during a small-craft accident in Alderaan's upper atmosphere. After Domadi was buried on his homeworld, Organa placed a lock of Domadi's hair in her keepsake chest. By 28 ABY, the lock of hair was still in Organa's chest.\nKier Domadi first appeared in Leia, Princess of Alderaan a young adult novel written by Claudia Gray that was released on September 1, 2017. Gray stated that in her mind, Domadi was a young Rami Malek. She also explained that Domadi was effectively the anti-Han Solo, but having the same opinion that Leia ought to have a personal life.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Alderaan",
  "/wiki/3_BBY",
  "/wiki/Paucris_system",
  "/wiki/Human",
  "/wiki/Alderaanian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Apprentice_Legislature",
  "/wiki/Planet",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Apprentice_Legislator",
  "/wiki/Politics",
  "/wiki/Historian",
  "/wiki/Clone_Wars",
  "/wiki/Cloning",
  "/wiki/Clone_SCUBA_trooper",
  "/wiki/Travois",
  "/wiki/Parent",
  "/wiki/Queen",
  "/wiki/Breha_Organa",
  "/wiki/Viceroy",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/House_of_Organa",
  "/wiki/Homeworld",
  "/wiki/Rebel_base_(Paucris)",
  "/wiki/Star_system",
  "/wiki/Starcutter",
  "/wiki/Orbit",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Pilot",
  "/wiki/Starship",
  "/wiki/Data_rod",
  "/wiki/Death",
  "/wiki/Paucris_Major",
  "/wiki/Atmosphere",
  "/wiki/Burial",
  "/wiki/Hair",
  "/wiki/Leia_Organa%27s_keepsake_chest",
  "/wiki/Keepsake_chest",
  "/wiki/28_ABY",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Claudia_Gray",
  "/wiki/September_1",
  "/wiki/2017",
  "/wiki/Han_Solo",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Leia,_Princess_of_Alderaan_(audiobook)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Birthday",
  "/wiki/Del_Rey",
  "/wiki/File:New_Republic_Bloodline_Twitter_Post.jpg",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/34_ABY",
  "/wiki/File:Kier_Domadi_Claudia_gray.png",
  "/wiki/StarWars.com"
 ]
}