{
 "name": "Kijo Mnuue",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 147 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Herglic"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tallaani Shipyards",
      "Guild of Non-Human Skilled Laborers",
      "Alliance to Restore the Republic",
      "Alliance Intelligence",
      "Alliance Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Kijio Mnuue was a male Herglic, who worked for the Alliance to Restore the Republic during the Galactic Civil War.\nFor over a century, Mnuue worked at Tallaani Shipyards and over that time held various jobs, working as a hull welder, a loadlifter foreman, a cargo inspector and department manager. By the time of the Galactic Civil War, he worked as the director of the yards' \"Department of Environmental Maintenance\". He formed the Guild of Non-Human Skilled Laborers, to oppose the way that the Galactic Empire was trying to get alien workers out of the labor pool at the yards, which resulted in him regularly being tailed by Imperial agents. Mnuue also joined a Rebel Alliance cell and gathered information for the Alliance through his contacts at the yard, and also from other contacts in the Corellian Shipbuilders Union and the Mon Calamari community.\nMnuue was a male Herglic who had an even temperament and a calm demeanor. He was a strong leader and worked tirelessly to protect the livelihood of the non-humans working at the shipyard. He had a slow, careful way of speaking that made him appear slow-witted but was actually quite intelligent.\nDue to his diverse career Mnuue was skilled in almost all areas of the shipyard from starship and droid repair to managing and leading teams of workers. He was naturally very strong and had could work for hours without rest.\nMnuue carried a comlink, a badge of office, and a datapad.\nKijo Mnuue was designed by Paul Sudlow for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/147_BBY",
  "/wiki/Herglic/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tallaani_Shipyards",
  "/wiki/Guild_of_Non-Human_Skilled_Laborers",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Corellian_Shipbuilders_Union",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Paul_Sudlow",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Vilardi",
  "/wiki/Lords_of_the_Expanse",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}