{
 "name": "Killi Gimm",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jedha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Disciples of the Whills"
     ]
    }
   ]
  }
 ],
 "content": "Killi Gimm was a human female member of the Disciples of the Whills, a religious group that congregated around the Temple of the Kyber in Jedha City on the moon Jedha. She was present in the city in the year 0 BBY shortly before its destruction by the Galactic Empire's Death Star superweapon. She ran an orphanage with her sister Kaya. Gimm suffered from breathing problems, forcing her to wear a mask and air filter.\nA human female, Killi Gimm was a member of the Force religion the Disciples of the Whills and lived in the Holy City on Jedha and considered to be one the eldest of the order. During the reign of the Galactic Empire, Jedha was occupied by Imperial forces in order to mine kyber crystals for use in the Death Star's superlaser. Citizens began to die in great numbers in the mines and during attacks from insurgent groups attempting to drive out the Empire. These deaths lead to a large number of orphans within Jedha City. Gimm persuaded her younger sister, Kaya Gimm, to turn her home and droid repair shop into an orphanage.\nGimm became friends with Chirrut Îmwe and Baze Malbus, who shared in her religion as Guardians of the Whills. Îmwe and Malbus helped the Gimm sisters maintain the orphanage by stealing supplies from the Empire. The Empire retaliated, destroying Kaya's home and forcing the Gimm sisters and their charges to flee. Malbus found an abandoned home for the two sisters to move into along with their orphans. A few months later, it soon became clear that Jedha was no longer safe for the orphans and Gimm sisters. With the help of Saw Gerrera and his Partisans, Îmwe and Malbus were able to steal a Sentinel-class landing craft in order to evacuate the Gimm sisters and the orphans. However, due to her poor health, Killi decided to remain on Jedha. Kaya and the orphans departed, hoping to find a safer world. Killi remained in Jedha City, and was present shortly before its destruction by the Death Star.\nKilli Gimm was first shown in the reel of promotional footage released for the film Rogue One: A Star Wars Story at Celebration Europe on July 15, 2016. Gimm then went on to appear in the film itself which was released in North America on December 15 later that year. Gimm was not named in the film, but received identification in the reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was released the day after the film.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jedha",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Disciples_of_the_Whills",
  "/wiki/Temple_of_the_Kyber",
  "/wiki/Jedha_City",
  "/wiki/Moon",
  "/wiki/City",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Galactic_Empire",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Gimm_sisters%27_orphanage",
  "/wiki/Kaya_Gimm",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_Military",
  "/wiki/Mining",
  "/wiki/Kyber_crystal",
  "/wiki/Superlaser",
  "/wiki/Death",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Baze_Malbus",
  "/wiki/Guardians_of_the_Whills",
  "/wiki/Standard_month",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Celebration_Europe_(2016)",
  "/wiki/July_15",
  "/wiki/2016",
  "/wiki/December_15",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/December_16",
  "/wiki/Guardians_of_the_Whills_(novel)",
  "/wiki/Guardians_of_the_Whills:_The_Manga",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/StarWars.com"
 ]
}