{
 "name": "Kin'ade",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Short"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Lanoree Brock"
     ]
    }
   ]
  }
 ],
 "content": "Kin'ade was a Je'daii Master who served as one of the instructors of Stav Kesh for the Je'daii Order on Tython at the height of the Infinite Empire's reign.\nKin'ade was a Forceful Zabrak member of the Je'daii Order on Tython. A talented healer, Kin'ade elected to serve as a Je'daii Master at Stav Kesh rather than Mahara Kesh, for which Je'daii Temple Master Lha-Mi was grateful. Her talents in marital arts were legendary, and she served alongside Temple Master Lha-Mi and Master Tave as the top ranking instructors of the Martial Arts Temple. Developing the Darrow Sphere, Kin'ade was able to control the ambiguous and mysterious training device during her sessions with Je'daii Journeyer's high atop the Ice Giant Range's peaks. Training with the Darrow Sphere involved wearing a blindfold, earplugs, a nose clip, and a mask to drown out all senses and rely totally on the Force. During the Great Journey of Lanoree and Dalien Brock, Kin'ade was forced to intervene when the Force-weak brother nearly suffered greatly from the Darrow Sphere. Called before the Temple Master, Kin'ade detailed the incident without exaggeration or excuse to the Lha-Mi, who instructed her to use more conventional methods over the course of the next few days, to which she agreed. At the end of the Brock's time at Stav Kesh, Kin'ade oversaw a controlled fight in the Great Hall of the Temple, after which she escorted Lanoree Brock to a private audience with the Temple Master. Hesitating before leaving, Kin'ade merely wishes Brock good fortune on the rest of her journey before leaving her.\nAfter the Brocks had left Stav Kesh, Kin'ade had discussed her concerns for Dalien Brock with Master Dam-Powl, a Master at Anil Kesh. She believed that Brock was troubled and would cause problems for the Order in the near future. After Brock had gone missing in the ruins of the Old City, Master Kin'ade had led a group of Journeyers into the bowels of the ruins but were unable to recover any remains.\nShort and slight, Kin'ade had tattooed her dark-complected face with ritualistic Zabraki lines. Lanoree Brock thought of her as the most deadly person she had ever met. She was possessed of an easy manner and was always balanced in the Force. She made smooth movements and alway bore a calm and tranquil expression.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Lanoree_Brock",
  "/wiki/Je%27daii_Master",
  "/wiki/Stav_Kesh",
  "/wiki/Tython/Legends",
  "/wiki/Infinite_Empire",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Mahara_Kesh",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Lha-Mi",
  "/wiki/Tave",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Ice_Giant_Range",
  "/wiki/Great_Journey",
  "/wiki/Dalien_Brock",
  "/wiki/Dam-Powl",
  "/wiki/Anil_Kesh",
  "/wiki/Old_City_(Tython)",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}