{
 "name": "Kina Ha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaminoan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Altisian Jedi"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kras'dohk"
     ]
    }
   ]
  }
 ],
 "content": "Kina Ha was a female Kaminoan Jedi Master trained during the era of peace known as the Republic Classic era. A wizened and distant Jedi, she allied herself with the Jedi Code, more than the Jedi Order, remaining reclusive and rarely appearing at the Jedi Temple. One of the few to survive Order 66, Ha lived on Mandalore during the Dark Times before joining the Altisian Jedi survivors.\nBorn on Kamino, Kina Ha was a Kaminoan who had been genetically altered to survive long hyperspace journeys. These deep-space missions were never carried out, and Ha was left without purpose on her highly organized homeworld. Matters grew worse as she entered adulthood: her Force-sensitivity began to manifest itself, drawing the criticism and disdain of her perfectionist peers. Viewed as an outcast and possessive of socially reprehensible traits, Ha departed her homeworld for fear of being \"reeducated\". During her journeys, Ha came under the tutelage of the rogue Jedi Master Kras'dohk who trained her as a Guardian and instructed her on how to construct her own lightsaber. The Trandoshan Jedi taught Ha all he knew, eventually bestowing upon Ha the rank of Master.\nAlive to witness struggles between the Mandalorians and the Jedi Order and the ensuing civil war, Ha traveled the galaxy for a century after the death of her Master. Ha had very distant relations with the Jedi High Council, only meeting with the august body half a dozen times in the centuries she was active in the galaxy. Eventually, Ha took up temporary residence on the planet Vorusku; during her stay she was struck with a terrifying vision from the Force. In her mind she saw countless soldiers of the dark side emerging from her homeworld. Returning home in a rush, Ha found no unusual presences on the water world, and certainly no dark side army. Prepared to prevent her vision from coming true, Master Ha delved deep into the sea using a Uulshos DPx to locate the ruins of the Slici Canyon outposts on the floor of Kamino's ocean. Occupying the lonely, hermetically-sealed chambers of the outpost, Ha lived out her hermitage in absolute solitude, watching Human holovids, waiting to strike should a dark side army arise.\nOver the decades the Kaminoans produced many clone armies, a foolish practice in Ha's mind; though she was unable to discern which clone army was the one she foresaw. Indeed, when the Grand Army of the Republic was created at Tipoca City, Master Ha was unaware that the Dark Lord of the Sith Darth Sidious had a hand in their programming. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, the Jedi Order was drawn into the war, fighting against the Separatist Droid Army with the clone troopers at their sides. When the Sith concocted Contingency Order 66 was issued to the Grand Army, the Order was effectively disbanded and the Republic abolished. Ha immediately came out of hiding, fleeing Kamino and being rescued by smuggler Nyreen Vollen.\nJoined by Padawan Tallisibeth Enwandung-Esterhazy aboard the Cornucopia, Ha was taken to Mandalore by Vollen to find sanctuary at Kyrimorut, the home and fortress of Kal Skirata. Skirata had a strong hatred for Kaminoans and Jedi, but allowed Ha to remain at his compound if she permitted Doctor Ovolot Qail Uthan to take samples of her genes for testing. The ultimate goal of this test was to harness Ha's longevity and program the Skirata's refugee clone troopers' DNA with a similar long life, as they already had been programming for accelerated aging. Ha agreed on the basis of her disagreement with her species' activities in the past centuries. Patient and gracious around the Mandalorians so as not to put them more on edge then they already were, the regal Jedi Master kept company with Padawan Enwandung-Esterhazy and later, Master Arligan Zey. After the samples were given and her usefulness to the Mandalorian clan expired, the mercenaries decided not to kill their Jedi guests. Instead Bardan Jusik, former Jedi and an ally of Skirata, made contact with rogue Jedi Djinn Altis who agreed to take the Jedi in to his secret Jedi refuge.\nAlthough Kina Ha was a Kaminoan, she lacked the general disdain for imperfection typical in her species. As the lone Force-user of her race, she was considered by the scientists of her world to be a threat. She chose to leave the planet rather than face daily hostility. By the end of the Clone Wars she had been living for over 3,000 years and had seen events such as the Mandalorian Wars, Jedi Civil War, the Sith going into hiding, the invention of bolo-ball, and the creations of hundreds of cloned armies and factory workers on her homeworld.\nThe Mandalorians she resided with after the Clone Wars saw her as an ancient and regal lady that baffled them by going against all Kaminoan stereotypes. While most Kaminoans prefer water worlds with little sun, she sat outdoors with the rest of the Skirata clan at Kyrimorut . Unlike most of her race, she possessed a cunning sense of humor and was known to cheat at pazaak.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Kaminoan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Altisian_Jedi",
  "/wiki/Kras%27dohk",
  "/wiki/Zalorian_rock-lion",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Order_66/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Hyperspace/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Mandalorian/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Vorusku",
  "/wiki/Force_vision/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/DPx_yacht",
  "/wiki/Slici_Canyon",
  "/wiki/Human/Legends",
  "/wiki/Holovid/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Tipoca_City/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Smuggler/Legends",
  "/wiki/Nyreen_Vollen",
  "/wiki/Padawan/Legends",
  "/wiki/Tallisibeth_Enwandung-Esterhazy",
  "/wiki/Cornucopia",
  "/wiki/Kyrimorut",
  "/wiki/Kal_Skirata",
  "/wiki/Doctor/Legends",
  "/wiki/Ovolot_Qail_Uthan",
  "/wiki/Arligan_Zey",
  "/wiki/Bardan_Jusik",
  "/wiki/Djinn_Altis/Legends",
  "/wiki/Chu%27unthor_(Clone_Wars)",
  "/wiki/Limmie/Legends",
  "/wiki/Pazaak/Legends",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}