{
 "name": "Kindoro",
 "display_name": "Kindoro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vena"
     ]
    },
    {
     "name": "Died",
     "values": [
      "49 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Venan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Kindoro was the Baron of Vena. He died in 49 BBY, widowing a wife, Omnino, and leaving his son Sando fatherless. Omnino blamed the Jedi Order for his demise.\nCirca 57 BBY, the rise of Baron Kindoro and Baroness Omnino to power on Vena changed the historical isolationist position the system always maintained. Due to the fact that Kindoro and Omnino had been both ambassadors to Coruscant and Alderaan, this contact with outsiders motivated an economic deregulation and active foreign policy, including trade agreements, in order to make goods accessible to the Venan royal family.\nThis radical shift angered many Venans, who resented the fact that only the royal family was benefitting from the economic opening. The commoners called for a return to isolationism and the old-fashioned values. The regents, unwilling to give in to popular demands, imprisoned the movement leaders and sent them to labor camps. This move aggravated tensions and motivated the emergence of terrorism and sabotage against Venan nobility.\nThis conflict was worsened with the death of Kindoro, as Baroness Omnino proved herself even more unmerciful than her husband, and waged bloody war for years against her subjects.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vena/Legends",
  "/wiki/49_BBY/Legends",
  "/wiki/Venan",
  "/wiki/Gender/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Death/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Omnino",
  "/wiki/Sando_(Baron)",
  "/wiki/Parent/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/57_BBY/Legends",
  "/wiki/Vena_system",
  "/wiki/Ambassador/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Venan_civil_war",
  "/wiki/Qui-Gon_and_Obi-Wan:_Last_Stand_on_Ord_Mantell_1",
  "/wiki/Qui-Gon_and_Obi-Wan:_Last_Stand_on_Ord_Mantell_3",
  "/wiki/Wizards.com",
  "/wiki/Before_the_Rise"
 ]
}