{
 "name": "Kine_(pirate)",
 "display_name": "Kine  (pirate)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Radix"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Radix"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Eiattu pirates"
     ]
    }
   ]
  }
 ],
 "content": "Kine was a male Human TIE pirate active during the Galactic Civil War. A former captain of the Imperial Navy, Kine continued to aid his former Imperial comrades during their crusades against the fledgling New Republic.\nA Human from Radix, Kine joined the Galactic Empire's Imperial Navy and ascended to the rank of captain during the Galactic Civil War, but left his post to became a small-time pirate. Maintaining ties with several high-ranking Imperial officers and organizations across the galaxy, Kine was an active pirate at the time of the birth of the New Republic.\nDuring this time, Kine was approached by Republic loyalist Lando Calrissian for a mission to locate a group of anti-Republic pirates. Keeping his Imperial past a secret, Kine agreed to assist in the hunt, tracking the pirates' activity to his homeworld of Radix in the Abraxas system. At the same time, Kine had been contacted by Lieutenant Harme Kiela of the Imperial Navy, who ordered him to accompany Calrissian and free Air Marshal Von Asch from a Republic prison. Working undercover for Kiela, Kine shot Calrissian in the back when they were ambushed by pirates on Radix. Leaving Calrissian for dead, Kine attempted to complete his assignment but was incapacitated by Isolde Siro and Calrissian. Kine, with the help of Lieutenant Kiela, attacked Siro and revealed his secret weapon: a stolen lightsaber. Waving the weapon, Kine tried to kill Siro but was thwarted by Asch, the man he was trying to rescue. Asch, having decided to freely join the Republic, stood in the way of Kine's killing stroke and sacrificed his life for Siro. Shocked at what had just transpired, Kine failed to regain his wits in time to defend himself against Siro, who killed the pirate with a well-placed blaster shot.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kine_(stormtrooper)",
  "/wiki/Radix",
  "/wiki/4_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Eiattu_pirates",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Abraxas_system",
  "/wiki/Lieutenant/Legends",
  "/wiki/Harme_Kiela",
  "/wiki/Air_Marshal",
  "/wiki/Von_Asch",
  "/wiki/Mission_to_Radix",
  "/wiki/Isolde_Siro",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lando%27s_Commandos:_On_Eagles%27_Wings",
  "/wiki/Star_Wars_Tales_5",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}