{
 "name": "Kinnin_Vo-Shay",
 "display_name": "Kinnin Vo-Shay",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 100–110 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Masters",
     "values": [
      "Aryzah"
     ]
    }
   ]
  }
 ],
 "content": "Kinnin Vo-Shay was a slightly Force-sensitive gambler. He was considered a handsome man, with stony features and a jagged scar starting at his lip and running past his nose. His hair had turned white by the time he reached his fifties. Vo-Shay's trademark was an obsidian pendant, which many people believed was a mystical artifact and the source of his good luck.\nCirca 50 BBY, Vo-Shay piloted his freighter, the Ashanda Ray into a dangerous region of space called the Tyus Cluster. There, he was trapped in the island of stability, at the center of a cluster of black holes. He would have died there, had he not met the ghost of a previous victim, a Jedi Master named Aryzah. She taught him a little about the ways of the Force, and somehow helped Vo-Shay escape the cluster. Aryzah's ghost came along with him when he escaped.\nThough some fifty years had passed to the outside galaxy, the gravitational fields of the Tyus Cluster had distorted the flow of time in Vo-Shay's frame of reference. As Vo-Shay put it, \"time was nonexistent\" at the cluster's center: he did not age a day.\nVo-Shay promptly returned to the gambling tables, skinning a Herglic named Doune out of a quarter of a million credits. The single credit he had bet at the beginning of the sabacc game had been provided by a farmboy named Nyo, who hoped to use his share of the cash to buy a lightsaber. Nyo got his lightsaber, and Vo-Shay decided to sign him on as the first mate of the Ashanda Ray, where Aryzah decided to teach Nyo the ways of the Force.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/100_BBY/Legends",
  "/wiki/110_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Aryzah",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Gambler/Legends",
  "/wiki/Obsidian/Legends",
  "/wiki/50_BBY/Legends",
  "/wiki/Ashanda_Ray",
  "/wiki/Tyus_Cluster",
  "/wiki/Black_hole/Legends",
  "/wiki/Force_ghost",
  "/wiki/Jedi_Master/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Time_travel/Legends",
  "/wiki/Herglic/Legends",
  "/wiki/Doune",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sabacc/Legends",
  "/wiki/Nyo",
  "/wiki/Lightsaber/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Last_Hand_(short_story)",
  "/wiki/Star_Wars_Adventure_Journal_13",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}