{
 "name": "Kino_Loy",
 "display_name": "Kino Loy",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unit Five-Two-D"
     ]
    }
   ]
  }
 ],
 "content": "Kino Loy was an inmate on Narkina 5 who oversaw the work of his fellow prisoners working the day shift in Unit Five-Two-D as their manager.\nIn 5 BBY, with two hundred and forty nine days left of his sentence, Loy was introduced to \"Keef Girgo\", a new prisoner who would be working in Five-Two-D. Loy explained how the system of tables and levels worked before assigning \"Keef\" to his place on Table Five where he worked alongside Jemboc, Xaul, Taga, Ulaf, Ham and Ruescott Melshi.\nLater, Loy instructed Jemboc to explain their cells to \"Keef\" and the prisoners became interested to know about the Public Order Resentencing Directive, a piece of Imperial legislative that was put in place due to rebel activity on the planet Aldhani, which had doubled the prisoners' sentencing. Melshi however told \"Keef\" that it didn't matter if his number was doubled or even tripled as the Empire would simply keep them until they didn't want them anymore and that escape was impossible. Loy, angered by Melshi's words, ordered him to stop talking before eventually pinning him to a nearby wall. Loy then returned to his cell along with the others.\nThirty one shifts later, Loy, along with the rest of his cell block, was awoken in the night by the sound of the prisoner Veemoss stepping out of his cell and killing himself. Loy then ordered the other prisoners to go back to sleep.\nAfter Ulaf's's health got progressively worse because of his advanced age and from being over worked, he eventually had a massive stroke. While Loy and Andor were waiting for one of the prison's doctors, Rhasiv, to arrive it was revealed that Loy had given the nickname \"Uli\" to the older man. When Rhasiv arrived, and after he euthanized Ulaf, he told Loy that no prisoners had been released since the P.O.R.D was invoked. This further cements Kino's sense of powerlessness and he decides to help Andor escape the prison.\nAt the beginning of the next shift, Loy told the other prisoners that the rumours concerning Level 2 were in fact true and that no one would be released, which meant that escaping was now the only solution. While the prisoners pretended to be working, Andor took a wrench and proceeded to cut a water pipe, as he had attempted several shifts before. This caused a water flood. As the guards sent a new man on the floor, Andor used to wrench to stuck the elevator in place and Loy ordered the other prisoners to attack. While the guards were overwhelmed, the prisoners, including Loy, started to grab tools from their tables to attack them. The guards eventually tried to use the metallic floors to fight back but the water caused them to short-circuit. Loy and the other prisoners then killed the guards and left Unit Five-Two-D.\nWith the revolt spreading to the other floors, Loy and Andor were now able to reach the command center and forced the crew to deactivate the prison's hydro-generators. Andor then encouraged Loy to use the intercom to talk to the prisoners. Despite being reluctant at first, Loy ended up telling his fellow prisoners that they needed to escape, even if it meant that they had to die trying to take the guards down. Nevertheless, Loy urged the prisoners to help one another. Loy's words were heard by the entire building and all the inmates ran to the top of the prison complex, while the remaining guards hid in fear. The prisoners then jumped into the sea and started swimming in the hope they would reach the shores. Loy hesitated, and Andor asked him what was wrong. Loy revealed that he could not swim, and Cassian was inadvertently toppled off the edge into the water by another inmate while Loy backed away from the edge with resignation.\nAccording to Kino Loy when escaping the Narkina 5 prison, he could not swim.\nKino Loy made his debut in \"Narkina 5,\" the eighth episode of Tony Gilroy's live-action Disney+ series Andor which was released on October 26, 2022. He was portrayed by Andy Serkis, who had previously portrayed Supreme Leader Snoke in the Star Wars Sequel trilogy. Bradley Farmer served as a stunt double for the character in the later episode \"One Way Out,\" which was released on November 9 of that year.\nAccording to an interview, Andy Serkis created a backstory for Kino in his head. Whether or not this backstory conflicts with anything the showrunner has in mind remains to be seen.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Unit_Five-Two-D",
  "/wiki/Narkina_5",
  "/wiki/5_BBY",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Jemboc",
  "/wiki/Xaul",
  "/wiki/Taga",
  "/wiki/Ulaf",
  "/wiki/Ham",
  "/wiki/Ruescott_Melshi",
  "/wiki/Galactic_Empire",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Planet",
  "/wiki/Aldhani",
  "/wiki/Veemoss",
  "/wiki/Death",
  "/wiki/Rhasiv",
  "/wiki/Public_Order_Resentencing_Directive",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Tony_Gilroy",
  "/wiki/Disney%2B",
  "/wiki/October_26",
  "/wiki/2022",
  "/wiki/Andy_Serkis",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/One_Way_Out",
  "/wiki/November_9",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/Databank_(website)",
  "/wiki/November_3",
  "/wiki/November_6",
  "/wiki/August_10",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens"
 ]
}