{
 "name": "Kir-Tja Dilsn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Kir-Tja Dilsn was a Human male Jedi Knight who was active during the Clone Wars. Circa 21 BBY, Dilsn was injured and stopped over on the moon Iktotch to recover. He later required transport to the planet Almas, and a group of freelance agents subsequently collected him aboard their starship, temporarily stopping over at the space station Burnout while en route to the world.\nKir-Tja Dilsn was a Human male who served in the Jedi Order as a Jedi Knight during the waning years of the Galactic Republic. By the time of the Clone Wars, Dilsn was an elderly man. Around 21 BBY, after suffering several injuries, Dilsn had surgery performed on his leg and hip, and, following the procedure, he recovered from the operation on the moon Iktotch. Later, while he was still not fully healed, Dilsn required transport to the planet Almas, the site of a Jedi academy. The Heroes of Cularin, a group of freelance agents from the Cularin system, agreed to take Diln to Almas in their starship, and they subsequently collected him from Iktotch.\nEn route to Almas, the agents landed their ship on Burnout, a space station located in the Thaereian system, in order to refuel. However, while they were there, the rogue Trandoshan intelligence operative Xirossk stole the starship's modulator chip, preventing the craft's sublight engines from working. The agents set out to recover the chip while Dilsn opted to remain aboard the starship and guard it, as his injuries prevented him from pursuing the saboteur. The agents eventually recovered the chip and departed Burnout with Dilsn.\nDilsn was a trained Jedi Knight, and he possessed the ability to pilot a starship.\nKir-Tja Dilsn was created by Lee Pickler and Morrie Mullins, and he appeared in The Air Up Thaere, a roleplaying supplement for the Living Force campaign. During the scenario, if none of the players—who roleplay as the agents transporting Dilsn—are pilots, Dilsn flies their ship for them when they leave Burnout.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Iktotch/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Starship/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Burnout_(space_station)",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Time/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Agent/Legends",
  "/wiki/Cularin_system",
  "/wiki/Thaereian_system",
  "/wiki/Fuel/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Thaereian_Intelligence",
  "/wiki/Xirossk",
  "/wiki/PU-36_modulator_chip",
  "/wiki/Sublight_drive",
  "/wiki/Saboteur/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Lee_Pickler",
  "/wiki/Morrie_Mullins_(person)",
  "/wiki/The_Air_Up_Thaere",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Roleplaying_game",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/32_BBY/Legends",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/The_Clone_Wars_Campaign_Guide"
 ]
}