{
 "name": "Kira Carsen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Korriban"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3663 BBY",
      "Dromund Kaas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Children of the Emperor",
      "Children of the Emperor",
      "Jedi Order",
      "Galactic Republic",
      "Task Force Nova",
      "Task Force Nova"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Bela Kiwiiks",
      "Hero of Tython"
     ]
    }
   ]
  }
 ],
 "content": "Kira Carsen was a Human female Jedi Knight who served the Jedi Order during the Cold War and the Galactic War between the Galactic Republic and the reconstituted Sith Empire. Born in 3663 BBY on the Empire's capital planet of Dromund Kaas to Sith parents, Carsen underwent Sith training as a child, but she fled the Empire after discovering she had been turned into a Child of the Emperor—an unwilling puppet of the Sith Emperor. Carsen survived on her own through her teenage years on the moon Nar Shaddaa, but when she met the Jedi Master Bela Kiwiiks, she was recruited into the Jedi Order as Kiwiiks' Padawan, though Carsen told no one of her true origins.\nIn 3643 BBY, Carsen became involved in a crisis involving stolen Republic superweapons and the agents of the Sith Lord Darth Angral, and was reassigned as the Padawan of a young Jedi Knight who was the former student of Jedi Master Orgus Din. Carsen and her new teacher proved integral in stopping Darth Angral's crusade of vengeance against the Republic, chasing the Sith's agents across the galaxy, but in doing so she came to the attention of the Sith Emperor, and her past was exposed to the Jedi Order when the Emperor's agent tried to capture her.\nThough some Jedi believed her to be untrustworthy, Carsen purged the Emperor's influence in the final battle with Angral, earning herself the rank of Jedi Knight. Carsen continued to serve alongside her former teacher, now known as the Hero of Tython, as the galaxy erupted into renewed war, and worked as part of a Jedi effort to capture the Sith Emperor, though the mission ultimately failed and the group was captured. When they were finally freed from the Emperor's clutches, Carsen and her allies raced to stop the Emperor's agents from bringing about death on a galactic scale, and fought alongside her friends in a mission that saw the Hero strike down the Sith Emperor on Dromund Kaas, turning the tide of the war.\nCarsen continued to travel with the Hero in the years that followed, but when the Jedi Master disappeared around the time of the Eternal Empire's invasion of the galaxy in 3636 BBY, causing the Hero's group to fragment in the chaos. However, she eventually reunited with another member of the Hero's group—the former Sith Lord Scourge—and the two made it their mission to track down and eliminate their old enemy, the Sith Emperor, who had continued to escape the clutches of death. To that end, the pair struck down the Emperor's original body, and allied with the Commander of the Eternal Alliance in order to ensure that the threat of the Emperor was ended once and for all.\nKira Carsen was born to Human parents on Dromund Kaas, the capital planet of the Sith Empire, in 3663 BBY. Both of her parents were Sith, and Carsen inherited her parents' Force-sensitivity, prompting the Empire to take her from them when she was extremely young as part of the Children of the Emperor project—a plot by the Sith Emperor to create a host of puppet Force-users.\nSent to the Sith Academy on the planet Korriban, Carsen underwent training as a Sith alongside other young Force-users such as Valis; she killed her first tuk'ata, a hound native to Korriban, at age six. During her time on Korriban, she encountered the Sith Lord Darth Angral, to the point where the Sith was able to recognize Carsen when she was fully-grown over a decade later.\nHowever, during her time at the Academy, Carsen noticed that other children would disappear for unknown amounts of time. When they returned, they were different, unable to remember where they had been or sometimes who they or others were. In 3653 BBY, a ten-year-old Carsen discovered she could not recall days or weeks of time and realized that she too had been taken. The process had been completed, and she was now truly a Child of the Emperor, meaning that the Emperor could possess her mind and body at will.\nFearful of what the Emperor could do to her, Carsen became determined to escape the Empire, and stowed away on a freighter after it delivered a shipment of slaves to Korriban. She jumped ship when it stopped at the moon Nar Shaddaa, where she spent the next eight years living in alleys and stealing to survive. She joined a group of alien refugees in the High Security Lockdown, where she met the Evocii Enaq and the Anomid Darshyn.\nCarsen spent her teenage years on Nar Shaddaa, using her nascent Force powers to defend herself and her friends. She would often bundle up in extra clothes to make herself look bigger, and was fiercely protective of her friends. When a street gang called the Ur'kossags began terrorizing the refugees, Kira paid the gang a visit. However, her attempt to negotiate with them ended poorly, and Carsen ended up killing several gang members. Carsen's actions backfired, however, causing everyone in the area to fear the refugee group's reputation. Carsen did not understand what she had done, because she left the planet not long after.\nCarsen's life changed when she attempted to steal a hyperdrive engine from an expensive ship in the spaceport, of which she planned to disassemble and sell off the pieces. She did not realize, however, that the ship belonged to the Jedi Master Bela Kiwiiks, who was very surprised to catch Carsen in the middle of her planned theft. Master Kiwiiks quickly recognized Carsen's affinity for the Force and offered Carsen the opportunity to join the Jedi Order.\nDuring her time with Master Kiwiiks, the two visited the agriworld Uphrades, and Carsen was struck by how green the planet appeared from space. The two had a very relaxed relationship, with Kiwiiks allowing Carsen a great deal of freedom as long as she was not in the Jedi Master's way.\nTwo years into her apprenticeship, in 3643 BBY, Carsen and Kiwiiks were on the Jedi homeworld of Tython when the Jedi Order began encountering organized resistance from the native Flesh Raiders. During the conflict, Carsen met the Padawan of Orgus Din.\nCarsen and Kiwiiks were then sent to the Republic capital of Coruscant. They worked together to stop Tarnis from unleashing the Planet Prison. She chose to travel with her new partner, now a Jedi Knight, and Satele Shan made her the Padawan of the Hero of Tython after Bela Kiwiiks left on a lone assignment to Tatooine. Carsen was later captured by agents of Darth Angral on the Ord Mantell space station. Angral, who had sworn a vendetta against Carsen's new Master, demanded to know where the Knight was. Carsen misled him into believing that her Master was on Corellia. As Angral's retainers kept an eye on her, her new partner/master returned from the planet surface and freed her. Unfortunately, this allowed the Sith Emperor to find her at long last. He arranged for another Child, Valis to retrieve her. Carsen and her teacher were able to best Valis but Carsen was forced to come clean about her past, and decided to reveal the truth to the Jedi Council. Despite Jaric Kaedan's attempt to have her imprisoned, the rest of the Council decided to show leniency.\nLater, Carsen and her Master rescued Bela Kiwiiks on Tatooine, and redeemed Lord Praven. She told her former Master everything about her past. Kiwiiks, an understanding Jedi, explained that she always had great faith in Carsen and her potential to become a Jedi.\nEventually things came to a head on Tython. Darth Angral, driven insane by the death of his son, had attacked and planned to use the Desolator to destroy the entire planet, and the majority of the Jedi. Kira and her Master disabled the superweapon and confronted Angral. The Emperor possessed Carsen, and ordered Angral to kill the Knight. Soon after, Carsen regained her senses and felt the Emperor's hold over her. Angral encouraged her to join him, claiming it was her destiny to be Sith. Carsen stated that she'd \"rather jump out of an airlock naked.\" When Angral failed, the Emperor stepped in, reasserting control over Carsen, and engaged the Knight. He had seen visions in which the Knight would rise and defeat him and he was determined to keep that from happening. When the Knight proved stronger, the Emperor called Carsen weak, unfinished from being away from him for so long. He then began to channel red Force energy through her in a renewed attempted to kill her Master, even if Carsen was to die in the process. Carsen refused to be his pawn and opened herself to the light, banishing the Emperor and severing the link. Returning to Tython's surface, Carsen was formally granted the rank of Jedi Knight by the Jedi Council.\nCarsen eventually became part of a Jedi strike team, led by Master Tol Braga, tasked with capturing the Emperor and redeeming him to the light side. Unfortunately, they underestimated the Emperor's power, which he used to subdue the Jedi and corrupt them to the dark side. Carsen was placed in an interrogation device called the Tormentor, about to be subjected to torture by her own Master. Luckily, her Master had been released from the Emperor's control with the assistance of the ghost of Orgus Din. After disposing of the Sith Overseer, Carsen and her Master made to free their companions, only to find the Emperor's Wrath, Lord Scourge, had already done so. Scourge stated that he had waited three hundred years for the appearance of Carsen's Master, whom he believed to be the one who would destroy the Emperor.\nReturning to Tython, Scourge revealed to the Council the Emperor's plan to consume all life in the galaxy but he had foreseen that the Hero of Tython would rise to stop him. Carsen continued to travel with her Master as they went to Belsavis, Voss and Corellia, well as redeem the fallen members of the Jedi strike team. Their efforts had weakened the Emperor enough that the Republic could make a strike on Dromund Kaas so the Hero of Tython could confront and defeat him. Carsen, along with the rest of the Hero's crew, excluding T7-01, kept their distance from the Emperor to avoid falling under his control while the Hero engaged him. Following the Emperor's apparent death, the Hero's crew rendezvoused with the flagship Valiant, where they are awarded with the Cross of Glory for their actions.\nShortly afterwards, she and her master were given a holocall from a fellow Child of the Emperor, Suri, who was driven mad from Vitiate's lingering calls to her. Since the two of them have previously broken free from the Emperor's control, Suri told them to meet her on Voss. When they arrived, Kira and the Hero of Tython tried to help her by convincing her to join them on Tython. Then a group of Sith, other Children of the Emperor, arrived. Led by Tannac, he told them that they managed to block out the Emperor and warned that if Suri went to Tython, she would die. After some deliberation with her master, Kira reluctantly allowed Suri to go with Tannac. She recorded the events and delivered it to the Jedi Council later on, to show how the Children of the Emperor were still active.\nAt a later stage in the Galactic War, Carsen was in the middle of a sparring session with Scourge, despite Doc's worry over using lightsabers. When their match came to an end, Carsen's Master suddenly had a vision of the planet Rishi. Coincidentally, T7 mentioned that Rishi had turned up on the Defender's navigation computer, so the Hero set a course for the planet.\nDuring the Eternal Empire's Conquest, Kira's master went missing. After the war was lost, the Defender's crew disbanded, much to Kira's sadness. Eventually, Kira joined the fight against Emperor Arcann alongside rebels against the Eternal Empire. According to Master Ranos, her group was eventually tracked down by Arcann and suffered heavy losses. Later, Kira and her team attempted to infiltrate Arcann's carbonite prison, but were discovered and thwarted by High Justice Vaylin. Despite Vaylin's great strength in the Force, Kira survived the encounter and, according to Darth Hexid, was last seen disappearing into Wild Space.\nAt some point Kira regrouped with Scourge, and, learning from an \"old ally\" of the ex-Emperor's Wrath, they hunted down Vitiate's true body . The pair then managed to destroyed Vitiate's true body at the exact moment the Outlander purged Vitiate's spirit, ensuring that the galaxy's greatest evil would never return. However, in doing so, they unwittingly unleashed a powerful Sith ritual Vitiate carved into his body as a final failsafe. Having been infused with the Emperor's power in the past both she and Scourge were rendered comatose for just over a year until Satele Shan and her followers managed to save them. But Shan and her people also fell to the plague unleashed by Vitiate's body, prompting Carsen and Scourge to quarantine them aboard a vessel they left drifting in the Outer Rim until help could be found.\nSensing the plague victims' minds were communicating and merging together, Carsen and Scourge suspected the plague might be trying to resurrect Vitiate. Concerned that Vitiate might've faked his death as he had done in the past, Scourge traveled to Mek-Sha and ambushed the Outlander, briefly engaging his opponent in battle before fleeing, confident that Vitiate was indeed dead. Following the Meridian Complex assault, Carsen and Scourge make themselves known to the Outlander and later explained the threat of Vitiate's plague at the Alliance base on Odessen.\nIn the year 3626 BBY, Kira Carsen and Scourge, with the aid of T7-O1, were able to locate the ship that they had placed Satele and her students aboard. With the aid of the Alliance Commander, they made their way aboard in order to stop Tenebrae from fully resurrecting himself. They were attacked by remnants of the Emperor's Hand, led by Servant Four, whom they fought with in order to get to Satele. Carsen, following their fight with Servant Four, then led them in a ritual that allowed them to enter Satele Shan's mind.\nOnce inside, Carsen found herself alone with the Alliance Commander, having been separated from Scourge and the rest. Pushing onwards, they encountered the visage of Tenebrae, who taunted them for believing they could ever try to defeat him. Soon after, Carsen was separated from the Commander, who continued their journey to the center of Satele Shan's mind, aided by the spirits of Revan, Meetra Surik, and Darth Marr. Once at the center, Carsen met up with the Commander and helped fight against the Emperor, alongside the spirits of all those that had been victimized by him over the centuries. After a long-fought battle, they were successfully able to vanquish the Sith Emperor once and for all.\nKira Carsen was a headstrong and confident Jedi, with a strong sense of loyalty towards her friends and allies. Behind this confident front, she hid fear of her past and a near-desperate desire to prove herself. She believed that her past in the Sith Empire would cause those she knew to turn on her if they ever found out, so Kira was determined to prove her loyalty and worth to the Jedi Order. She was also mildly claustrophobic, and she masked fear behind a quick tongue and sharp wit.\nKira Carsen was adept with a double-bladed lightsaber. Her combat skills allowed her to deal a large amount of damage over a short period of time. Kira was considerably strong in the Force, being able to break free of the Emperor's control over her during the Desolator Crisis.\nKira Carsen appears in the BioWare MMORPG Star Wars: The Old Republic, as a companion character for the Jedi Knight character. She has fair skin, red hair, full lips, and a scar on her left cheek. The player gains her as a companion during the class storyline on Coruscant. Kira is voiced by Laura Bailey.\nIf the Jedi Knight player character is male, the player can choose to have a romance with Kira and can eventually marry her. Initiating a romance will affect dialogue in certain story missions. If the player is romancing Kira, then she will speak to the player about the future, children as one of the last topics. If the player is married to Kira, then a cutscene of her speaking to the player at the Emperor's temple won't be seen.\nFollowing the conclusion of the Onslaught expansion, the player can re-commit their romance with Kira. Additionally, if the player is a female Jedi Knight who initially flirts with Kira, she later expresses that she has always been \"a little... in love\" with the player since their disappearance. The player can reciprocate those feeling and initiate a relationship with Kira.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kira_(disambiguation)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Template:Update",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Talk:Kira_Carsen",
  "/wiki/Korriban",
  "/wiki/3663_BBY",
  "/wiki/Dromund_Kaas",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Task_Force_Nova",
  "/wiki/Bela_Kiwiiks",
  "/wiki/Hero_of_Tython",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sith_training",
  "/wiki/Tenebrae",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/3643_BBY",
  "/wiki/Desolator_crisis",
  "/wiki/Superweapon/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Angral",
  "/wiki/Orgus_Din",
  "/wiki/The_galaxy/Legends",
  "/wiki/Valis",
  "/wiki/Battle_of_the_Oppressor",
  "/wiki/Hunt_for_the_Sith_Emperor",
  "/wiki/Emperor%27s_ritual_crisis",
  "/wiki/Death/Legends",
  "/wiki/Dromund_Kaas_operation",
  "/wiki/Eternal_Empire",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/3636_BBY",
  "/wiki/Scourge",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/Kira_Carsen%27s_mother",
  "/wiki/Kira_Carsen%27s_father",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Tuk%27ata/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/3653_BBY",
  "/wiki/Standard_day/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/High_Security_Lockdown",
  "/wiki/Evocii",
  "/wiki/Enaq",
  "/wiki/Anomid/Legends",
  "/wiki/Darshyn",
  "/wiki/The_Force/Legends",
  "/wiki/Ur%27kossags",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Agriworld/Legends",
  "/wiki/Uphrades",
  "/wiki/Homeworld/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Flesh_Raider",
  "/wiki/Coruscant/Legends",
  "/wiki/Tarnis_(Sith_Lord)",
  "/wiki/Planet_Prison",
  "/wiki/Satele_Shan",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jaric_Kaedan",
  "/wiki/Tatooine/Legends",
  "/wiki/Praven",
  "/wiki/Desolator_(superweapon)",
  "/wiki/Jedi_strike_team_(capture_of_the_Sith_Emperor)",
  "/wiki/Tol_Braga",
  "/wiki/Force_ghost",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Voss",
  "/wiki/Valiant_(Valor-class)",
  "/wiki/Cross_of_Glory",
  "/wiki/Suri",
  "/wiki/Tannac",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Archiban_Frodrick_Kimble",
  "/wiki/Rishi/Legends",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Arcann",
  "/wiki/Dazh_Ranos",
  "/wiki/High_Justice",
  "/wiki/Vaylin",
  "/wiki/Darth_Hexid",
  "/wiki/Wild_Space/Legends",
  "/wiki/Mek-Sha",
  "/wiki/Meridian_Complex_assault",
  "/wiki/Alliance_base",
  "/wiki/Odessen",
  "/wiki/3626_BBY",
  "/wiki/T7-O1",
  "/wiki/Kira_Carsen%27s_ship",
  "/wiki/Hand_of_the_Empire",
  "/wiki/Servant_Four",
  "/wiki/Mindscape",
  "/wiki/Revan/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Darth_Marr",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/BioWare",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Laura_Bailey",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Galactic_Standard_Calendar"
 ]
}