{
 "name": "Kiran_Tatch",
 "display_name": "Kiran Tatch",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jiroch-Reslia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tunroth"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Granse Confederacy"
     ]
    }
   ]
  }
 ],
 "content": "Kiran Tatch was a male Tunroth from Jiroch-Reslia. He excelled as a hunter, attaining a high level in the Tunroth Hunters. He later took up bounty hunting and joined the Granse Confederacy, an elite team, with special animosity to the Rebel Alliance.\nComing from a strong hunting culture, Tatch excelled at the discipline, qualifying as a Tunroth Hunter, the most highly respected organization on his homeworld. This involved a 3 month initiation period and recognition by 3 other Hunters. Of the 27 levels, Tatch eventually attained the rank or shturlan . He became a proficient archer with the traditional klirun bow, and fought against the invading Lortans in the Reslian Purge. Despite the massive defeat that the Tunroth suffered at the hands of their technologically advanced foes, Tatch distinguished himself and was one of the few survivors of the Purge. The experience also improved his tracking and combat abilities.\nTatch soon left behind the devastation of his homeworld, with the hunt becoming the only thing that mattered to him. Tatch found employment as a skip tracer, chasing down individuals who tried to escape their debts to various crime lords and loan sharks. Tatch was successful in every job he undertook, and soon came to work for various Hutts in the Y'Toub system. From there his reputation spread, and it was even rumored that Jabba the Hutt considered hiring him to capture Han Solo and Chewbacca. While employed by the Hutts, Tatch was introduced to a fellow bounty hunter, Arcuse. Kiran often worked with this Ubese, appreciating the contrast between his quiet ways and the boastful Hutts. His disdain for them gradually grew until on a visit to Glorga the Hutt, in the Hollastin system, he spat on the crime lord in disgust. While lesser beings would have been executed for such an affront, Tatch was merely ordered to leave—a sign of the clout he possessed. His partner, Arcuse, left with him, and the two were soon blacklisted.\nWhile departing Hutt Space, they encountered Rodick Tag, an Iotran Braceman who had also taken leave of the Hutts. The three of them joined the Granse Confederacy, a group of eight elite hunters established in 2 ABY by the Kuati assassin, Callandri. The Confederacy prioritized bounties on members of the Rebel Alliance, with a staggering six assaults on Rebel personnel in four months. Tatch developed a specific antagonism towards the Wookiee Tirranna and Lieutenant Alton Lochner.\nThis animosity was noticed by the Alliance, with Lieutenant Commander Anson Blazer submitting a file on his activities. Even before joining the Confederacy, Tatch had had run-ins with Rebel operatives. In 1 ABY, he almost got Blazer killed, when he spotted him investigating the Kalstan gangsters in the Xorao system. Tatch reported the Rebel presence, and instead of chasing them himself, merely enjoyed watching the ensuing mayhem.\nThe Alliance were especially concerned about the Confederacy's actions as one of its members, the Gand Lu'daal-ud, possessed key datafiles on the Alliance. On one occasion, Commander Zgorth'sth dispatched operatives to apprehend the Gand. Tatch and the rest of the Confederacy were forced to come to his aide to frustrate the Rebel's mission. Tatch was also known to work on Ord Mantell and Draria.\nKiran Tatch was deeply affected by fighting in the Reslian Purge. His traumatic experiences changed him, leaving him a bitter and sullen individual. To deal with his loss, he focused entirely on the hunt, disdaining other concerns. Unlike many of his species who returned home to aid in the reconstruction, Tatch left his world behind.\nTatch remained withdrawn even after discovering companionship with Arcuse and the Confederacy. He often dined alone, choosing not to share in their revelries nor celebrate their successes. This was apparent even to outsiders, with Alliance profilers suspecting his loyalty to the Confederacy was not complete, despite his sworn oath.\nAt some point in his career, Tatch sustained large scarring over his right eye.\nAs was typical of his species, Tatch preferred low technology, continuing to use his klirun bow offworld. He used caros arrows with it, tipping them with talar, a stun-substance that enabled non-lethal strikes. His one accommodation to \"high\" technology was an archaic Yctor Arms black-powder pistol. He also commonly used syntherope and grappling hooks in pursuit of his quarry.\nKiran Tatch was first mentioned in the role-playing book Alliance Intelligence Reports. A later book, Ultimate Alien Anthology, lists his name among possible Tunroth names.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jiroch-Reslia",
  "/wiki/Tunroth",
  "/wiki/Gender/Legends",
  "/wiki/Granse_Confederacy",
  "/wiki/Lieutenant_Commander/Legends",
  "/wiki/Anson_Blazer",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Tunroth_Hunter",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Shturlan",
  "/wiki/Klirun",
  "/wiki/Lortan",
  "/wiki/Reslian_Purge",
  "/wiki/Homeworld/Legends",
  "/wiki/Skip_tracer/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Y%27Toub_system",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Arcuse",
  "/wiki/Ubese/Legends",
  "/wiki/Glorga",
  "/wiki/Hollastin_system",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Rodick_Tag",
  "/wiki/Iotran/Legends",
  "/wiki/Braceman",
  "/wiki/2_ABY/Legends",
  "/wiki/Kuati/Legends",
  "/wiki/Callandri",
  "/wiki/Wookiee/Legends",
  "/wiki/Tirranna",
  "/wiki/Lieutenant/Legends",
  "/wiki/Alton_Lochner",
  "/wiki/1_ABY/Legends",
  "/wiki/Kalstan_gangsters",
  "/wiki/Xorao_system",
  "/wiki/Gand/Legends",
  "/wiki/Lu%27daal-ud",
  "/wiki/Datacard/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Zgorth%27sth",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Draria",
  "/wiki/Caros_arrow",
  "/wiki/Talar",
  "/wiki/Yctor_Arms",
  "/wiki/Syntherope",
  "/wiki/Grappling_hook/Legends",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies"
 ]
}