{
 "name": "Kiro Chen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alderaanian faction"
     ]
    }
   ]
  }
 ],
 "content": "Kiro Chen was a Human male from the planet Alderaan. In 0 BBY, the Galactic Empire destroyed his homeworld with the first Death Star, making Chen and thousands of Alderaanians refugees to Delaya, Alderaan's sister planet. Chen became a leader of one of the many Alderaanian survivor groups and at some point formed an Alderaanian faction with his lover Halle Dray, and fellow refugee J'er Nahj. The faction was strongly opposed against the Organa Family, blaming them for entangling Alderaan into the war and causing its destruction.\nWith his work with the survivor groups, Chen eventually came into contact with General Carlist Rieekan of the Rebel Alliance. Acting as a representative, Chen hinted that his group was planning to join the Alliance and for weeks, was instrumental in helping Rieekan draft survivors for the Rebels, earning the General's confidence. In 0 ABY, Princess Leia Organa visited Delaya to lead a memorial for Alderaan's lost. However, her true mission was to assist in the enlistment of new Alliance members. Rieekan introduced Chen to Organa as her local contact before leaving Delaya for a separate mission. A day after attending the memorial, Chen arranged a meeting between the Princess and the survivor communities willing to join the Alliance.\nThe meeting turned out to be a ruse and Chen helped his faction in abducting Organa under the orders of Dray. They planned to turn her over to the Empire in exchange for a new planet for the refugees. During their meeting, the Imperials betrayed the faction leaders and killed them all, save for Chen, who was able to escape with Organa's help when she refused to reveal his location to the Imperials. After Organa was rescued by her Rebel companions, Chen met with her once again and she forgave his betrayal. Chen refused her offer to join the Alliance and decided to stay in Delaya and help lead the remaining survivors.\nKiro Chen was a Human male native to the planet Alderaan. In 0 BBY, Alderaan was destroyed by the Galactic Empire's first Death Star, sending Chen, and thousands of Alderaanian refugees to Alderaan's sister planet Delaya. The refugees created communities in their new residence and Chen was recognized as a leader by some these groups. It was also during this time that Chen formed a faction with Halle Dray, his lover, and J'er Nahj, another Alderanian refugee. Their faction despised the Organas for getting Alderaan involved in the war, and subsequently destroyed.\nGoing undercover, Chen approached General Carlist Rieekan as a representative of a group of Alderaanian survivors willing to join the Rebel Alliance. For weeks, Chen worked tirelessly in recruitment efforts and eventually earned Rieekan's trust. When Princess Leia Organa visited Delaya to help the refugees, Chen was introduced to her by Rieekan as someone who's been a great help to the Rebellion.\nChen was instrumental in abducting Organa before her meeting with the other representatives of various Alderaanian survivor groups that wanted to join the Rebel Alliance. Dray, one of the leaders of the faction, contacted the Empire and planned to turn Organa over to them in exchange for a new planet the Alderaanians could settle on. However, the Imperials reneged on the deal and took Organa after killing her abductors. Chen was the only one who survived when Organa did not divulged his hiding place to her new captors. Later on he informed Organa's companions, Luke Skywalker, Han Solo and Ferus Olin, that Delaya's Deputy Minister Var Lyonn was secretly collaborating with the Imperials and knew where Organa was taken. After her rescue, Organa forgave Chen and invited him to join the Rebel Alliance; an offer Chen declined. He explained that with the recent deaths of Dray and J'er Nahj, the Alderaanian survivors on Delaya would need a leader to look up to and he planned on filling in that role.\nKiro Chen had spiky black hair and his eyes were hooded and red rimmed. He had a habit of using easy as skinning a nerf as a metaphor, which led to Luke Skywalker realizing that he was part of the Alderaniaan faction that abducted him previously.\nKiro Chen was a character created by author Alex Wheeler for the 2008 novel Rebel Force: Hostage, the second volume in the Star Wars: Rebel Force series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alderaanian_faction",
  "/wiki/Planet/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Homeworld/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Delaya",
  "/wiki/Halle_Dray",
  "/wiki/J%27er_Nahj",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/General/Legends",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Mission_to_Delaya",
  "/wiki/Memorial_service_on_Delaya",
  "/wiki/Standard_day/Legends",
  "/wiki/Alderaanian/Legends",
  "/wiki/Delaya/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Deputy_Minister/Legends",
  "/wiki/Var_Lyonn",
  "/wiki/Hair/Legends",
  "/wiki/Alex_Wheeler",
  "/wiki/2008",
  "/wiki/Rebel_Force:_Hostage",
  "/wiki/Star_Wars:_Rebel_Force",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_New_Essential_Chronology"
 ]
}