{
 "name": "Kirst  (pilot)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Fleet",
      "Rogue Squadron",
      "Alliance Fleet",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Kirst was a Human female starfighter pilot who flew in the Rebel Alliance's Rogue Squadron in the year 4 ABY. She was close with her fellow Rogue, Wister. When the Alliance Fleet struck at the Galactic Empire's unfinished Death Star II battlestation in orbit of the moon of Endor, Kirst and the Rogues—temporarily rechristened Red Squadron by Rogue Leader Wedge Antilles—flew their X-wing fighters in the attack. The Empire had anticipated their strike, however, and the Battle of Endor saw the Alliance Fleet fight off an onslaught from the Imperial Navy until Antilles and several other pilots were able to enter the Death Star's superstructure and destroy the entire station.\nThe Alliance remained at Endor for some time, and Rogue Squadron participated in post-battle cleanup operations. During one such operation, Kirst, Wister, and Antilles clashed with remaining Imperial starfighters and pursued a TIE Advanced x1 into Endor's atmosphere. The TIE led them to a clearing that housed the remains of the downed Super Star Destroyer Executor, which fired its still-active turbolasers and destroyed Wister's X-wing. Kirst and Antilles then fired on a nearby canyon cliff, which created an avalanche that finished off the massive ship, and returned to the Rebel Star Cruiser Home One. Kirst, severely shaken by Wister's death, was comforted by Antilles.\nKirst was a Human female who served the Rebel Alliance in 4 ABY as a member of Rogue Squadron, an elite group of twelve starfighter pilots. In that year, as the Alliance's war with the Galactic Empire raged, the Alliance Fleet massed near the planet Sullust in preparation for a major attack on the Empire's unfinished Death Star II battlestation, which was orbiting the forested moon of Endor. Rogue Leader Wedge Antilles temporarily rechristened the Rogues Red Squadron prior to the battle, in honor of a squadron in which he had once served. Red Squadron was attached directly to the MC80 Star Cruiser Home One, the flagship of the entire fleet.\nThe fleet was not scheduled to arrive in the Endor system until a strike team on Endor's surface disabled the shield generator that protected the Death Star, and before the battle, Red Squadron met in a briefing room, where Antilles told them that they would be entering the Death Star's superstructure and firing on its reactor core. Kirst and her squadron, flying T-65 X-wing starfighters, were with the fleet as it flew through hyperspace to Endor, and upon reaching their target, they discovered that the deflector shield was still operational. Additionally, the Empire had anticipated their arrival, and the Rebels were forced to fend off attacking Imperial starfighters as they waited for the strike team to succeed. Although several Alliance squadrons were devastated by the onslaught, Red Squadron scored a large number of kills and remained mostly intact.\nThe Death Star itself joined in the Battle of Endor when its superlaser began taking out Rebel capital ships, and the Alliance Fleet consequently began to attack Imperial Star Destroyers at point-blank range in order to avoid the battlestation's powerful laser. Several of the Imperial warships were destroyed, among them the Super Star Destroyer Executor. When the strike team finally destroyed the shield generator, Antilles and several other pilots entered the unfinished Death Star and knocked out the reactor core, which set off a chain reaction that ultimately destroyed the entire station. Galactic Emperor Palpatine was one of the Imperials killed aboard the Death Star, but the Imperial Navy fought on for nearly four more hours before retreating, and the Rebels celebrated their victory on the surface of the forest moon. The Alliance maintained a presence at Endor for some time, and Kirst flew with Rogue Squadron during post-battle cleanup operations.\nKirst had grown close with fellow Rogue Wister during their time together in the squadron, and during one cleanup operation, the two of them flew as Antilles's wingmates, respectively holding the call signs of Rogue Three and Rogue Two. The three Rogues pursued several Imperial fighters that remained in the system, and after Antilles destroyed a TIE Fighter, the trio pursued a TIE Advanced x1 toward Endor's surface. Although Kirst had a clean shot at their last enemy, Antilles told her to hold her fire, as he wanted to see where the fighter was going. After they entered the moon's atmosphere, the TIE led the trio through a series of rocky canyons and into a clearing, where the remains of the downed Executor laid. The massive vessel's turbolasers were still operational, and their sudden fire destroyed Wister's X-wing. Antilles told a stunned Kirst to hold together and transmitted attack coordinates to her fighter; the two then fired proton torpedoes at a canyon cliff, and the resulting avalanche finished off the Executor. When their sensors detected no further hostiles, they returned to the Home One, where a tearful Kirst hugged Antilles before leaving the hangar with no words spoken.\nKirst was a member of Rogue Squadron, one of the Rebel Alliance's most elite starfighter squadrons. Rogue Leader Wedge Antilles felt that the Rogues who fought at the Battle of Endor had the same fire and determination as the original Red Squadron, and during the battle, they scored many kills. Kirst was horrified to come across the still-operational remains of the Executor after the battle and was devastated when its guns killed her wingmate, Wister. She held her emotions in check after Antilles prompted her to do so, but after landing aboard the Home One, she let her tears flow and wrapped her squadron leader in a wordless hug. Kirst had blonde hair, brown eyes, and light skin. She wore a Rebel flight suit while in her X-wing.\nKirst first appeared in \"A Day in the Life\", a short comic story that was included in Star Wars Tales 12, a 2002 issue of Dark Horse Comics's anthology-style Star Wars Tales series. Written by Brett Matthews, penciled by Adrian Sibar, and colored by Guy Major, the comic depicts Kirst as a member of Rogue Squadron in the days after the Battle of Endor. In 2006, Keeper of the Holocron continuity database Leland Chee stated that every story from the first twenty issues of Tales that was not \"completely outrageous or intentionally comic\" should be considered ambiguously canonical, with its status upgraded to fully canonical if it were referenced in a later, non-Tales source. Both Kirst and her wingmate Wister received entries in 2008's The Complete Star Wars Encyclopedia, which cemented their places in Star Wars canon. The entries also added new continuity by establishing that both pilots actually served in Rogue Squadron during the Battle of Endor. Although the squadron's Endor roster is briefed by Wedge Antilles in the 1990 short story \"The Briefing of Red Group,\" this article endeavors to avoid the conjecture involved in definitively stating that Kirst appears in said story.\nThe canon status of A Day in the Life presents several continuity issues. The story dates itself at three days after the Battle of Endor, but a different post-Endor timeline is given for Wedge Antilles and Rogue Squadron in the 1993 novel The Truce at Bakura—the book has them leave Endor two days after the battle and spend three days in hyperspace before arriving at the planet Bakura. This article therefore treats the three-day date given in A Day in the Life as erroneous and assumes that the story takes place at some other point shortly after the battle. Another continuity error concerns the Executor, the largely intact wreckage of which Kirst, Wister, and Antilles stumble across in A Day in the Life. According to the 1991 novel Heir to the Empire, the Executor completely disintegrated after crashing into the Death Star during the Battle of Endor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/A_Day_in_the_Life",
  "/wiki/Heir_to_the_Empire",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Wister",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battlestation",
  "/wiki/Orbit/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Red_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Space_warfare",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Time/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/TIE_Advanced_x1/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/TIE_Series",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Turbolaser/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/MC80_Home_One_type_Star_Cruiser",
  "/wiki/Home_One/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Endor_system/Legends",
  "/wiki/Endor_strike_team/Legends",
  "/wiki/SLD-26_planetary_shield_generator/Legends",
  "/wiki/Reactor/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Superlaser/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Wingmate/Legends",
  "/wiki/Call_sign",
  "/wiki/Rogue_Three/Legends",
  "/wiki/Rogue_Two/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Rebel_flight_suit",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Tales_12",
  "/wiki/2002",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars_Tales",
  "/wiki/Brett_Matthews",
  "/wiki/Adrian_Sibar",
  "/wiki/Guy_Major",
  "/wiki/2006",
  "/wiki/Holocron_continuity_database",
  "/wiki/Leland_Chee",
  "/wiki/Canon",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars",
  "/wiki/1990",
  "/wiki/The_Briefing_of_Red_Group",
  "/wiki/Standard_day/Legends",
  "/wiki/1993",
  "/wiki/The_Truce_at_Bakura",
  "/wiki/Bakura/Legends",
  "/wiki/1991",
  "/wiki/3_ABY/Legends",
  "/wiki/Nrin_Vakil",
  "/wiki/5_ABY/Legends",
  "/wiki/Galaxy_Guide_5:_Return_of_the_Jedi_(Second_Edition)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/West_End_Games",
  "/wiki/Galaxy_Guide_5:_Return_of_the_Jedi",
  "/wiki/The_Truce_at_Bakura_Sourcebook",
  "/wiki/Star_Wars_(1977)_100",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/June_4",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/X-Wing_Rogue_Squadron_35",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_The_Warrior_Princess",
  "/wiki/Star_Wars_Omnibus:_X-Wing_Rogue_Squadron_Volume_2",
  "/wiki/Evacuation_of_Ciutric",
  "/wiki/Star_Wars_Omnibus:_X-Wing_Rogue_Squadron_Volume_3"
 ]
}