{
 "name": "Kitha Farlander",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Agamar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Kitha Farlander was an Agamarian female who was raised in Tondatha, a small town on Agamar, during the Imperial Period. Early in the Galactic Civil War, an Imperial attack on the town killed her mother and father and left her with severe burns. Following the attack, her brother Keyan sent her to live with relatives on the planet Oorn Tchis, while he joined the Agamar Resistance and later the Alliance to Restore the Republic. Her aunt and uncle arranged for her to receive treatment for her injuries, though her recovery was slow.\nThe Human female Kitha Farlander grew up on the agricultural planet Agamar in the Lahara sector of the Outer Rim Territories. She lived, along with her mother, father and brother Keyan, on a struggling mugruebe ranch in the small town of Tondatha.\nEarly in the Galactic Civil War, the Galactic Empire, believing that the people of Tondatha had been plotting against Emperor Palpatine, dispatched an Imperial-class Star Destroyer to make an example of the town. The Imperials launched an assault craft into the atmosphere, from where it launched an orbital bombardment which left Tondatha in ruins. During the assault, a direct blaster strike on the Farlander family resulted in the young Agamarian suffering severe burns that left her disfigured. Though her brother survived with only minor burns, both of their parents were killed in the attack.\nIn the aftermath of the Imperial attack, Keyan decided to move to the Agamarian capital of Calna Muun and join the fledgling Agamar Resistance. Keyan sent Kitha to live with their aunt Mimya and uncle Trinn on Oorn Tchis, where he hoped she would be able to receive treatment. Mimya and Trinn ensured that Farlander was cared for at all times and arranged for doctors to treat her injuries. Though she did not initially respond to treatment, the physicians advised the family not to give up hope. Some time later, after Keyan had joined the Alliance to Restore the Republic, his aunt and uncle wrote to update him of Kitha's progress. However, her status was unknown to him at the time of the Battle of Yavin in 0 BBY.\nKitha Farlander had what doctors described as a strong will. Though the injuries she sustained during the Imperial attack on Tondatha were severe—her brother feared she would never recover and she did not initially respond to treatment—doctors remained confident that she would pull through and recover in time.\nKitha Farlander was created by Rusel DeMaria and was first mentioned in 1993's X-Wing: The Official Strategy Guide, a strategy guide that accompanied the LucasArts video game Star Wars: X-Wing and told the story of the game's player-character, Keyan Farlander. The death of her parents and the injuries that Kitha sustains serve to provide Keyan with the incentive to join the Rebel Alliance, leading on to the game's story. The character was later given an entry in 2008's The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Agamar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Agamarian",
  "/wiki/Tondatha",
  "/wiki/Imperial_Period",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Destruction_of_Tondatha",
  "/wiki/Keyan_Farlander%27s_mother",
  "/wiki/Keyan_Farlander%27s_father",
  "/wiki/Keyan_Farlander/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Oorn_Tchis",
  "/wiki/Agamar_Resistance",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Mimya",
  "/wiki/Trinn",
  "/wiki/Agriworld/Legends",
  "/wiki/Lahara_sector",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Mugruebe",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Calna_Muun",
  "/wiki/Doctor/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Rusel_DeMaria",
  "/wiki/1993",
  "/wiki/X-Wing:_The_Official_Strategy_Guide",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_X-Wing",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/X-Wing_Collector%27s_CD-ROM:_The_Official_Strategy_Guide",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/The_New_Essential_Chronology"
 ]
}