{
 "name": "Kith_Kark",
 "display_name": "Kith Kark",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Antar 4"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3998 BBY",
      "Onderon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Mroon Jassa"
     ]
    }
   ]
  }
 ],
 "content": "Kith Kark was a Gotal male who served as a Jedi Knight during the days of the Old Republic. He received his training under the Jedi Master Mroon Jassa on the planet of Truuine. During his life before becoming a Jedi, Kark was unusually sensitive, even for a Gotal, to the electromagnetic emissions given off by devices; as a result, he preferred to live away from major city centers, choosing instead to live in the wilderness of his homeworld of Antar 4.\nDespite some initial troubles with beginning his training, Kark was able to become a successful apprentice of Master Jassa's, excelling in his Jedi lessons. When Jassa was unexpectedly called away for an indefinite amount of time, Kark traveled to the Jedi library world of Ossus in order to complete his training. He was chosen as one of five Jedi to be sent to Onderon to assist fellow Jedi Ulic Qel-Droma during the Freedon Nadd Uprising of 3998 BBY. During the fight, a dark side wave of energy ripped down Kark's defenses, allowing fire from a Naddist cannon to hit the Gotal, leaving him mortally wounded. Kark died before the Naddist Revolt was resolved.\nKith Kark was a Gotal male who lived on the moon Antar 4 in the years before the Great Sith War. A Gotal's cones were naturally responsive to any electromagnetic emissions around them, but Kark's were unusually sensitive to the point where he was in constant pain if near any electronic devices. The sensitivity affected him so badly that Kark could not even be within twelve meters of any electronics, especially computers and droids. Due to that problem, Kark's family was compelled to move away from their home in the city and take up residence in the wilderness of the Antar 4.\nWhile living in the wilderness, Kark was able to tame several large beasts and use them for transportation over short distances. However, when Kark was forced to travel outside of the immediate area, or even wanted to see other systems, he used his personal ship in which he manually programmed his hyperspace jumps—the ship was an old, abandoned starship out of which Kark had ripped all traces of computers and droids, even if it meant that his journeys were made much more dangerous.\nKark routinely traveled to the immediate systems around Antar 4 on short sightseeing trips to break the boredom of his life at home. He knew that his life had no direction, with the majority of his time being spent taking care of his parents' livestock, and he could feel that something was missing in his life—not having an identity of his own weighed heavily upon him. While on one such sightseeing trip to the planet Truuine, Kark encountered a group of newly arrived Jedi apprentices who had come to study under the Jedi Master Mroon Jassa. Right away, Kark could feel not only the Jedi's excitement, but also the calm that seemed to permeate and surround them all. The feelings of coexistence and peace that he felt were unlike anything Kark had ever experienced before—he began to wonder if these Jedi held the answers for which he was looking. Meanwhile, the apprentices continued on their way to Master Jassa's praxeum, and Kark decided that he would follow and join them.\nUpon arriving at the praxeum, the Jedi apprentices were all greeted by Master Jassa, but Kark received no such welcome. Kark, who felt slightly offended at that, presented himself to Jassa and proudly stated that he wanted to be trained as a Jedi. Jassa, however, continued to ignore Kark and instead focused on the Jedi apprentices. Kark, who at that point was rather annoyed, pushed himself to the front of the Jedi and again stated that he wanted to be trained as well. By that time, Jassa allowed his annoyance to show, and simply told Kark that by his own actions and attitude he had demonstrated to all those present that he was not yet ready to walk the road of a Jedi.\nKark left the praxeum feeling humiliated and angry. On the trip back to Antar 4, he thought over what had happened and was unsure of what exactly Jassa had meant when he said that Kark was not ready. However, he knew that he would become a Jedi—the only question was how? Kark traveled back to his home and vowed to learn everything he could about the Jedi, their order, and the mystical thing they called the Force. Back on Antar 4, Kark spent every spare minute studying any information about the Jedi he could find, whether it be legends passed by word of mouth or ancient history texts which were in the possession of the residents of Antar 4. After he had expended all information available to him, he traveled back to the praxeum on Truuine, confident that he would be accepted for training.\nKark arrived back on Truuine and again presented himself to Master Jassa—but Kark was shunned just as he had been before. Kark left again, feeling anger and contempt for Jassa. He continually wondered why, if he knew his destiny was to become a Jedi, Master Jassa was not allowing him to be trained. Over the next few months he came to the conclusion that he must have missed something crucial that was holding him back from being a Jedi. He once again poured over all the information at his disposal, but failed to find anything that he had not known before. He began to review everything that had happened from the beginning, starting with his chance meeting of the Jedi apprentices. He asked himself what had drawn him to the Jedi in the first place—he believed it was the feeling of calmness—but he realized that that was only part of it. It was then that Kark saw all the pieces fall into place, and he finally understood.\nKark gathered up what belongings he had and traveled back to the praxeum. Once there, Master Jassa asked him why he had come to him again. Kark replied that he now understood that the Force had called him to that place and that he was ready to surrender himself and his life fully to the way of the Jedi. Master Jassa slowly circled Kark and prodded him with questions, telling him several times that the easy part was over, and inquiring if he realized that the hard part had just begun. Kark stated that he did not believe in difficulty, but only in his own efforts. Master Jassa accepted Kark to be an apprentice and welcomed him in to the praxeum to begin his training.\nA year passed, with Kark excelling in his training under the guidance of Master Jassa. When Jassa was unexpectedly called away for an uncertain period of time, Kark traveled to the library world of Ossus to complete his training in the ways of the Force, and was eventually promoted to the rank of Jedi Knight.\nIn the year 3998 BBY, following the capture of Master Arca Jeth by King Ommin of Onderon, Jedi Knight Ulic Qel-Droma sent out a request to Ossus for additional Jedi aid to be sent to the planet. The Jedi assembly on Ossus gathered to discuss who would go—it was decided that Kith Kark, Dace Diath, Shoaneb Culu, Qrrrl Toq, and Nomi Sunrider would be sent as reinforcements for Ulic Qel-Droma, on behalf of the Jedi and the Galactic Republic.\nWhen the Jedi reinforcements arrived on Onderon, they immediately sensed Qel-Droma and his remaining forces not far from the walled city of Iziz, battling past scores of enemies with the help of Force-fueled battle techniques like Force shield and Battle meditation. The reinforcements from Ossus were able to join up with Qel-Droma and charge the ranks of the more numerous Naddist rebels.\nDuring the attack, Kark and the others noticed that there was a dark side power at work influencing the battle. The Jedi, in response, erected Force shields to protect themselves; however, the Jedi could feel the dark side presence intensify its shadow against them. It was the dark energy that drained Kith Kark's shield, leaving him open to attack. At the same moment that his shield was ripped away, a Naddist cannon fired on Kark, mortally wounding him—despite having trained so long to become a Jedi, Kark's first mission was also his last. The wound drained the life force from his broken body, and Kith Kark was made one with the Force.\nKith Kark never liked or enjoyed technology. Some Gotals were able to adapt to the constant electromagnetic emissions, but Kark was not one of them. His sensitivity to these emissions caused him great discomfort within twelve meters of any technology which emitted such waves—he was especially affected by computers and droids. However, upon becoming a Jedi, Kark was able to learn how to control his sensitivities so that he was not in constant discomfort when surrounded by technology.\nKith Kark had brown hair, grey eyes, and carried a green lightsaber. He was a proud individual and displayed a great amount of self-esteem in everything he did, especially his accomplishments as a Jedi Knight. However, his path to Jedi knighthood was one which presented Kark with many difficulties which stemmed from his proud character; his own feelings of self-worth led him to believe that he was ready to become a Jedi, even though Master Jassa advised him otherwise. Though Kark was initially angry and embarrassed by Master Jassa's rejection of him, Kark was able to overcome the negative sides of his proud persona and realize that he had blinded himself by his behavior: he realized that he must suppress the need to impress others, and that the Force was calling him to be a Jedi; until he surrendered himself fully to its designs, he would continually fail. With Kark's new outlook, he excelled at his training and eventually fought during the Naddist Uprising.\nKark was a Force-sensitive member of the Jedi Order. During his early life, he possessed the ability to talk to various wild animals and was even able to tame them. Though he did not realize it at the time, he held within him a natural affinity for a Force power which many referred to as Beast Control. During the Freedon Nadd Uprising, Kark was able to erect a Force shield, but he was unable to maintain it when bombarded with an intense dark side presence.\nKith Kark's first and only appearance was in the sub-series The Freedon Nadd Uprising of the comic series Tales of the Jedi. The Freedon Nadd Uprising was written by Tom Veitch and drawn by Tony Akins and Denis Rodier. Kark's character was later heavily expanded upon in the sourcebook Tales of the Jedi Companion, written by George R. Strayton.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook",
  "/wiki/Antar_4/Legends",
  "/wiki/3998_BBY",
  "/wiki/Onderon/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mroon_Jassa",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Truuine",
  "/wiki/Jedi/Legends",
  "/wiki/Electromagnetic_field/Legends",
  "/wiki/City/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_library",
  "/wiki/Ossus/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Freedon_Nadd_Uprising",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Naddist",
  "/wiki/Cannon/Legends",
  "/wiki/Death/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Computer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Programmer/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jedi_Praxeum_(Truuine)",
  "/wiki/The_Force/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Library/Legends",
  "/wiki/Tales_of_the_Jedi:_The_Freedon_Nadd_Uprising",
  "/wiki/Arca_Jeth",
  "/wiki/King/Legends",
  "/wiki/Ommin/Legends",
  "/wiki/Dace_Diath",
  "/wiki/Shoaneb_Culu",
  "/wiki/Qrrrl_Toq",
  "/wiki/Nomi_Sunrider",
  "/wiki/Iziz/Legends",
  "/wiki/Tutaminis",
  "/wiki/Battle_meditation",
  "/wiki/Oneness",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Animal_bond",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(comic_series)",
  "/wiki/Tom_Veitch",
  "/wiki/Tony_Akins",
  "/wiki/Denis_Rodier",
  "/wiki/Tales_of_the_Jedi_Companion",
  "/wiki/George_R._Strayton",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Freedon_Nadd_Uprising",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}