{
 "name": "Kitomag",
 "display_name": "Kitomag",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kitomag was a Mon Calamari male, who joined the rebellious Alliance to Restore the Republic during the reign of the Galactic Empire. A veteran soldier well-versed in guerrilla combat, Kitomag worked against the forces of the Empire as part of a team of rebel agents under the leadership of Tam Bastion. Around the time of the second Death Star's destruction, Kitomag and his unit were in the Anoat sector, and became trapped there when Imperial Governor Ubrik Adelhard locked down the sector in a move that became known as the Iron Blockade. As Imperial forces hunted the rebel presence, Kitomag and his team attempted to go into hiding.\nWhen Tam Bastion arranged to meet a young smuggler at the Konn-Nevos Spaceport to enlist their covert aid in exchange for information, Kitomag joined his team's leader at the spaceport as backup. There, Bastion introduced Kitomag to the smuggler, and offered the Mon Calamari's expertise should the young scoundrel desire to learn guerrilla tactics. Over time, Kitomag imparted the rebels' associate with training in several varied techniques.\nKitomag first appeared in Star Wars canon in the multiplayer mobile game Star Wars: Uprising, created by the Kabam company and released on September 10, 2015 for iOS and Android platforms. Within the scope of the game, Kitomag acts as one of several skill vendors from whom the player character may purchase new abilities.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Kitomag",
  "/wiki/Wookieepedia:Star_Wars:_Uprising_Super_Walkthrough/Kitomag",
  "/wiki/Canon",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Soldier",
  "/wiki/Tam_Bastion",
  "/wiki/Time",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_of_Endor",
  "/wiki/Anoat_sector",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Sector",
  "/wiki/Iron_Blockade",
  "/wiki/The_Smuggler",
  "/wiki/Konn-Nevos_Spaceport",
  "/wiki/Spaceport",
  "/wiki/Smuggler",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)"
 ]
}