{
 "name": "Kitrep Soh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Daghee"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 248 BBY",
      "Daghee"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Kitrep Soh, nicknamed \"Kip\", was a male human from Daghee whose mother, Lina Soh, served as the Supreme Chancellor of the Galactic Republic during the High Republic Era. When he was around seventeen years old, he joined his mother for the Republic Fair on Valo. Upon arrival on the host planet, he met Jom Lariin, son of Mayor Nas Lariin. The two bonded quickly and had snuck away from the public eye when the Nihil attacked the Valo Republic Fair. The two young men survived the attack, but Chancellor Soh was injured, resulting in Kitrep staying by her side once she regained consciousness.\nKitrep Soh was from the planet Daghee, and was the son of Lina Soh. Kitrep was a shy individual and disliked the spotlight, which became a problem after his mother became Supreme Chancellor of the Galactic Republic. He hated the media spotlight on him and wished he could be ignored, and not considered part of his mother's political life. Despite this difficulty, and the often very busy schedule his mother kept, he knew she was not a bad mother. Lina Soh always made time for Kitrep. However, while Lina knew that Kitrep would dislike the voyage and the media storm at the event, she still made him come with her to the Republic Fair on Valo.\nKitrep Soh, along with his mother Chancellor Soh, her pet targons, his mother's top aide Norel Quo, her deputy Larep Reza, reporter Rhil Dairo and her droid T-9, and a Jedi escort of Jedi Masters Stellan Gios and Nib Assek and Padawan Burryaga, landed in his mother's shuttle in Lonisa City a few days before the Fair was to begin. They were greeted by a welcoming committee made up of Jedi Master Elzar Mann, Idrax Snat, the head of the Valo Security Force, Republic Fair Coordinator Samera Ra-oon, Lonisa City's mayor Nas Lariin, their son Jom, and a handful of other local officials. Kitrep, while uncomfortable, was immediately drawn to Jom Lariin, constantly looking at him as his mother and the Mayor exchanged greetings. Kitrep then accompanied his mother and the rest of her party away from the shuttle.\nThe following day was to be the opening of the Republic Fair. Prior to the ceremony however, Kitrep was with Lina Soh in his mother's suite at the Hotel Republica, and watched her unveil her outfit for the day's events. This was followed by the reveal of an outfit chosen for him to wear, and once he was dressed in it, she asked him to look interested during the event, and that was all she wanted of him. Kitrep retorted, asking if she was sure that was all she was asking of him and removed the collar from the outfit he'd been made to wear. In reply to his removal of the collar, she adjusted the clothing's fastening, smoothing it down before she rested a hand against his cheek. She stated that he was right to be uncomfortable, that the fair was a lot and that she knew he hadn't wanted to come to Valo in the first place. He had started to contradict her, but stopped. He knew his mother knew what he was thinking, and that she did care for him. He also understood why she was making the request.\nLater, the first part of the day's events called for Lina Soh to greet the Regasa of Shili, Elarec Yovet, and was to take place at the Lonisa City Spaceport. Kitrep accompanied his mother to the event, where he stood in a prominent position alongside Lina Soh's targons, surrounded by a legion of officials and Jedi who were in attendance for the regasa's arrival. Kitrep bore witness to his mother's greeting of the monarch, and was similarly in attendance for the opening of the Republic Fair at the Unity Arc.\nWith the Republic Fair now open, Kitrep was glumly dragged along with his mother's party of dignitaries and the regasa in their movements around the Fair. He was made to make small talk with delegates he barely knew, and he actively avoided Norel Quo as he found him both creepy and nagging. By the time the group reached the Faith and Life zone, Kitrep was hating every minute of the experience, and longed to run back to his mother's suite at the Hotel. However, he was prevented by his obligation, and he had to admit that it wasn't all bad. He did like talking to Rhil Dairo, though he suspected that she was looking to get an interview with him. The reporter asked him what he thought of the United in Song exhibit as they passed a preview of the spectacle, to which he tactically replied that it was catchy. Dairo smiled and mentioned that Dantari flu was too, eliciting a laugh from Kitrep. In reality, he found the song somewhat infuriating given it's ear-worm lyrics, and he pitied anyone who would be working near the display as he could think of nothing worse than the lyrics and tune looping over and over again.\nIt was then that Jom Lariin approached the pair, and commented that Soh would be humming the tune of the display all night. Kitrep Soh stammered out an agreement, but found it difficult to speak. Lariin added that the song was making Porter Engle, who was standing nearby, not very happy as the Jedi Master was frowning quite hard at the preview. Soh laughed at that, with Dario smiling and moving to excuse herself from the presence of the two teenagers. Kitrep quickly said she didn't have to go, but she insisted on continuing her rounds for soundbites and more images to gather, though she commented that she hadn't forgotten about the interview she and Jom had arranged for the following morning. Jom Lariin smiled and agreed that he'd be there, but once she was out of earshot, muttered that he wouldn't be, mentioning to Soh that he disliked the cam droids and intended to avoid them as much as possible. Kitrep Soh agreed with the sentiment, and Lariin suggested that they could avoid them together, that was unless Soh wanted to spend time with Dario. Kitrep Soh flushed and stated no, and that while the reporter was lovely, both personality-wise and appearance-wise, she wasn't his type.\nThere was a brief awkward silence following this exchange, before Kitrep Soh offered his name, with Jom Lariin confirmed he already knew, followed by Soh stating Lariin's name, which he again confirmed, resulting in another awkward silence. Soh desperately tried to think of something to say given his unique status as the chancellor's son, but failed. Norel Quo then ushered the group forward through the event, causing Lariin to move off and state he would hopefully meet with Soh later at the Melahnese Pavilion where a spread of food might be, a prospect he was looking forward to as he was starved. Soh agreed with the hope of there being food, but upon seeing Larin approach Bell Zettifar, an extremely good-looking Jedi in Soh's estimation, he quickly caught up to the pair.\nHe asked the pair if they had heard the story about Rhil Dairo, though neither had, with Kitrep Soh explaining that she was a big deal according to his mother. Soh briefly regretted bringing up the importance of his mother, but barreled on, explaining that Dairo had gotten sacked from her first job. The evidence of the event was on the holonet, which Kitrep Soh had watched. He explained that she had been fired after she was covering wildfires on a planet, and discovered corruption as the local fire chief was extracting payments to save people's homes. Zettifar was appalled by the news, with Soh continuing, describing how Dairo lost her cool live, and told him that he deserved to burn, to which Lariin agreed. Soh finished his story, talking animatedly by now as he spoke about how after being told it was none of her business by the fire chief, she grabbed a hose from a nearby firefighting droid and doused the offended in litres of foam right to his face.\nThis produced laughter from Jom Lariin who agreed that he had to find a clip of the event, before Soh went on to describe how, despite being fired in the wake of the event, the clip went galactic and GoNet snatched her up quickly. He added that his mother, Lina Soh, frequently watched Dairo's reporting. When Lariin asked if that was how the reporter got the job of covering the Republic Fair, Soh replied non-comitadly though he mentioned that GoNet had wanted to send Sine Spenning. When asked if he knew who that was, Bell Zettifar replied that he did not, with Jom Larinn explaining that he was a typical news anchor with flashy suits, and crazy teeth, which Soh affirmed, claiming they were whiter than the moons of Dutar.\nKitrep Soh then pushed on, claiming that his mother refused the request, wanting Dairo instead, feeling the reporter was a hero, and she'd stood up for what was right. Jom Lariin commented that Lina Soh sounded like a fan of Dairo, with Kitrep Soh agreeing, though Lariin offered a lopsided smirk in response and stated he still didn't want to be interviewed by the reporter. Soh grinned back and agreed. A short time later, he was still with Lariin and Zettifar, the group having reached the Melahnese Pavilion as the crowd thinned. Soh and Lariin did not stop talking throughout the evening, the earlier awkwardness having evaporated, as had Kitrep Soh's jealousy about Bell Zettifar. At some point in this discussion, Jom Lariin mentioned how much he was looking forward to touring the Innovator the next day, and he also fed Bell Zettifar's charhound Ember treats when he thought the Padawan wasn't looking. Ultimately, Kitrep Soh had never felt happier, and he spent a portion of the evening fantasizing what it would be like to hold Jom Lariin close.\nThe next morning, Chancellor Soh, her party of guests and their Jedi escort were touring through the Republic Gardens at the edge of the Technology and Science zone. However, while Kitrep Soh and Jom Lariin were part of the group and followed everyone into the gardens, they ducked out and joined the wider crowd at the fair. Their destination was the Innovator, which Kitrep had mentioned he could get them in through the use of his VIP pass, and stated that no one would miss them. Instead, the Jedi did notice them missing, and sent Bell Zettifar to go find the pair of teenagers. A short time later, the pair made their way on board the Innovator and went to the far viewing platform set on the rear of the starship. By the time Padawan Zettifar reached the ship, and was able to see them, the pair were laughing with Kitrep Soh looking far more relaxed than even the previous night.\nIt was then that the Nihil attacked the fair, strafing the Innovator in their opening assault on the festivities. Jom Lariin and Kitrep Soh were successfully herded to safety off the far platform by a Human fair attendant named Leesa, but the group became lost on board the ship as the attack progressed. During their travels through the ship's corridors, the small group encountered an injured Quarren named Nwo. Luckily for the three humans, Kitrep Soh spoke Quarrense and the trio became four, continuing their travels through the ship. Leesa led them all through the damaged vessel with a similarly damaged datapad, seeking out a shuttle bay, but their progress was not easy. Nwo's injuries were worrying for Kitrep, and both he and Jom Lariin frequently had to help the Quarren stand and walk through the corridors. At one point, they were blocked by a stalled door, which Leese, Lariin and Soh helped to pull it open, though in the process Lariin and Soh were sent flying onto the floor in a tangled pile. Lariin grasped Soh tight and helped him to stand, avoiding a fall back down the stairs the group had just climbed, forcing Soh to actively ignore his dreams from the previous evening about just such a scenario.\nThe pair of young men again helped Nwo through the wreckage in the corridors, being led by Leesa to a turbolift shaft which would give them access to the bay she was seeking. Soh commented that he didn't think people were supposed to use turbolifts in emergencies, but Leesa admitted she doubted it was working, unlocking the lift door and showing them a deep drop while she also secured a light for them. The four then all started to climb down, with Jom Lariin first, followed by Kitrep Soh, Nwo and Leesa. They had climbed much of the way they needed before Lariin pointed out an issue, with Soh looking down and confirming the issue, that being pitch black water which had risen up through the shaft and blocked their path. There was a brief discussion of what to do, with Nwo offering to swim down and open the doors to help drain the water, insisting he was as strong as a keelkana. However, Jom Lariin butted in and stated he had been swimming in the lake since he was knee-high to a beeta-grub, and took up the task himself, diving into the water before anyone could stop him.\nKitrep Soh worried for the other young man despite the assurances that he'd likely be fine by Leesa, beginning to hold his breath during the process. However, as the burst of bubbles from the water began to dwindle, and finally stop, he called out for the other and was prepared to jump into the water, despite his lacking swimming ability. Before he could will himself to jump, the water level suddenly dropped as Jom triggered the doors, and helped everyone into the targeted corridor. During the process, Leesa lost her footing and the datapad with it, which fell into the dark water still in the shaft. She was pulled to safety, and stated she didn't need it any longer, as they were close to the bay in question. They traveled a short way, rounding a corner, and found the shuttle bay.\nThe room was in bad shape, the Innovator's listing having caused cargo to tumble across the space. However, a sublight shuttle was intact, and the group got onboard intending to fly their way out of the sinking starship. Their progress was blocked by a lack of power to the hanger's doors, with Kitrep Soh briefly turning to start making his way to the manual hanger door controls. He was stopped by Lariin, who asked if the ship had weapons, with Leesa in the pilot's seat stating they were only simple lasers. The real issue however, was that Leesa didn't know how to properly fly, with Lariin looking to Soh, who also had no knowledge of the subject. Nwo interrupted the three, insisting he take the pilot's chair as he used to be a pilot, and he successfully took the controls. The group then listened to a message broadcast by Vam Targes, which was ended by an explosion which coincided with the shuttle bay lurching backwards causing everyone to cry out and hang on.\nThe ceiling gave away to the lakewater, which now poured into the hanger, and a heavy beam from the ceiling landed on top of the shuttle, trapping the four survivors in a room that was rapidly filling with water. Nwo attempted to shake them loose by firing up the engines, but that did nothing as they remained stuck. Lariin, Soh, and Leesa then scrambled out of the ship to try and manually push the beam, but this proved futile as well. Kitrep Soh then went to search for possible metal cutting equipment onboard the shuttle, but slipped during the trip, and thought he was going to plunge into the water, bracing himself. However, it was with the timely arrival of Bell Zettifar that allowed him to be held aloft through use of the Force, and prevented a soaking by the still rising lakewater. Set down safely on the shuttle roof, Soh thanked Zettifar, before the Padawan turned to the group's current predicament. When filled in, he ignited his green lightsaber stating it would be their metal-cutting tool and insisted everyone get back in the shuttle, which they then did, Leese shutting the shuttle's hatch behind them.\nSoh insisted that they could not leave Zettifar on the roof, but Leesa was already strapped into her seat, stating it was what they do as Jedi. Soh bit back, asking if they committed suicide, to which Zettifar shouted his disagreement from outside of the ship, asking if everyone was ready. Soh then explained the likely plan to Nwo, who agreed that they were ready, at which the Padawan began to cut through the beam. He succeeded on the right-hand side and moved across the ship, preparing to cut them totally loose while Nwo and Lariin prepared the ship's lasers to blow the doors off, and the pilot controls to fly them to safety. However, Nwo was unwilling to wait as Zettifar neared completion of his task, the water in the shuttle bay having now fully covered the transparisteel cockpit window and causing cracks. Nwo punched the engines and had Lariin shoot the lasers, despite Soh's protest that they had to wait, and the shuttle flew out of the bay.\nSoh couldn't see where they were going, but they did exit the water soon after and enter the smoggy skies of Valo. Soh then tried not to be sick as Nwo rapidly turned the ship around, heading back toward the city's harbor allowing the group to see the extent of the chaos. Soh quietly commented that his mother was down in said chaos as the shuttle was nosed down by Nwo, Leesa shouting that they were going to fast, though the Quarren merely replied with a shout for them to brace. Soh did, and was uninjured in the following crash, asking Jom Lariin if it was safe as the Valon jumped to his feet and hot the hatch open. They all left the shuttle, Soh helping Nwo out even though he wanted to scream at him for leaving Bell Zettifar behind. The gas in the air outside however, knocked Soh to his knees, which caused him to also bring down the Quarren. When Lariin rushed over asking if they were alright, Soh furiously questioned how could they be, they had left a Jedi to die. Despite Lariin's wounded tone agreeing with the statement, Soh pushed forward, asking what it made them since they killed one of the good guys.\nFurther arguments were interrupted by the arrival of Ember, who was barking and running at the group. Soh considered it a likely attack, as his own mother's animal companions, Matari and Voru, would have done the same to anyone who killed, let alone harmed, their owner. However, Ember ran past them all and into the arms of Bell, who was sprawled on the shuttle's roof. Soh was immediately ecstatic to learn of his survival, though Lariin was ashamed when Zettifar offhandedly mentioned that it might have been easier for him if he'd not been hanging on the ship's outside as the shuttle rocketed out of the hangar. However, Zettifar shook off the issue, stating that survival was the more important thing, though he had lost his lightsaber. Soh blurted out that he had to find his mother, with Bell laying a supporting hand on his shoulder and agreeing, though it would only work if they kept together. They were then joined by other survivors who Bell Zettifar had helped earlier onboard the Innovator, and the Padawan turned to face the Nihil's war-cloud, stating the real challenge would be what lay ahead.\nKitrep Soh and the rest of the group moved through the city and fair grounds, picking up an increasingly large number of survivors. When communications were restored, Padawan Kettifar got into contact with other Jedi and officials across the city who had also survived the attack, and he worked with them to push the Nihil's war-cloud out of the way. However, this, alongside a lack of contact from Nihil Tempest Runner Lourna Dee, caused fellow Tempest Runner Pan Eyta to start the final stage of the Nihil's attack, a bombing run and long-range bombardment of the fair and the city. During this chaos, Chancellor Soh was gravely injured, rendered unconscious and surrounded by those who had been in her group throughout the attack. Kitrep Soh found her clutched in the arms of Master Stellan Gios, sprinting over as he yelling out for her, crashed to his knees in front of the kneeling Jedi once he got close enough. Soh's taragons joined the teenager, nuzzling him as he cried in fear and sadness. Jedi medic Torban Buck then worked to stabilize Lina Soh's condition, maintaining it, with Republic medics arriving later on to assist.\nSome time later, as the relief effort was in full swing on Valo, Soh remained in a clinical coma, ready to be transported back to Coruscant once doctors agreed that she could be moved. Her taragons permanently lay at her side. However, she regained consciousness, and after speaking with several key figures, Soh soon saw her son waiting in the Valo Jedi Temple's medical center reception room with Jom Lariin. She asked for a moment alone with her son, who ran to her as she beckoned him into her arms, hugging Kitrep Soh as those others in the room left. Soh's taragons stayed, and purred at the unification of mother and son.\nSoh barely left his mother's side for the rest of their time on Valo, save one time when he went to say goodbye to Jom Lariin at the Lonisa City Spaceport. Lariin gave the chancellor's son the digits of a private frequency, and in response, Soh leaned in and gave the Valon a long, lingering kiss. Despite the intimacy being captured by cam droids, Kitrep Soh didn't care, and felt he'd never care about them again. He then boarded the Coruscant Dawn, which was returning to the Core of the galaxy with his mother on board. He was present for a meeting Soh had with Stellan Gios as he and a drift of Vectors approached the Nihil's base attested to in intelligence reports obtained earlier on from the Togruta government. Soh ordered the Jedi to discover everything possible about the Nihil, as she had no intention of underestimating them twice. She then offered Master Gios goodbye, and the Jedis holograms all turned off as they gave a united goodbye. Lina Soh then relaxed back into the medbed installed in her office, squeezing her son's hand. When Kitrep Soh asked her if she was okay, she smiled weakly and suddenly looked far older than she was. She stated she would be, and asked him to stay a bit longer with her, to which the younger Soh agreed, mentioning that he wouldn't be going anywhere.\nKitrep Soh was a thin young man with green eyes and dark hair. He had a complicated relationship with his mother, understanding her drive to push forward despite opposition, and understood the difficulties that came with the Sohs coming from a relatively isolated, backwater planet, resulting in a loss of respect which his mother had to earn back. This, along with her rise to the position of Supreme Chancellor, resulted in heavy media and political attention, which Kitrep Soh loathed. He hated cameras and the spotlight, wishing that he could be ignored in favor of just his mother and her pet targons, who he felt were actually interesting. Kitrep Soh appeared to have an introverted personality, often lacking the ability to properly engage in social graces unless relaxed, though he was capable of overcoming these issues in times of duress or importance. Kitrep Soh also had a slightly pessimistic viewpoint, often making negative comments or statements on situations and jumping to the worst conclusion, a fact commented on by Jom Lariin. Finally, the young male Soh also had an extensive linguistic education at the insistence of his mother, speaking Quarrenese in addition to a number of other languages.\nKitrep Soh is a character that was created for the Star Wars: The High Republic publishing project. He first appeared in the novel The High Republic: The Rising Storm, which was written by Cavan Scott and published in 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kip_(disambiguation)",
  "/wiki/Special:Upload",
  "/wiki/Daghee",
  "/wiki/248_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Parent",
  "/wiki/Lina_Soh",
  "/wiki/Supreme_Chancellor",
  "/wiki/Galactic_Republic",
  "/wiki/High_Republic_Era",
  "/wiki/Standard_year",
  "/wiki/Republic_Fair",
  "/wiki/Valo",
  "/wiki/Planet",
  "/wiki/Jom_Lariin",
  "/wiki/Mayor",
  "/wiki/Nas_Lariin",
  "/wiki/Nihil",
  "/wiki/Attack_on_Valo",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Targon",
  "/wiki/Norel_Quo",
  "/wiki/Larep_Reza",
  "/wiki/Rhil_Dairo",
  "/wiki/Droid",
  "/wiki/T-9",
  "/wiki/Jedi",
  "/wiki/Jedi_Master",
  "/wiki/Stellan_Gios",
  "/wiki/Nib_Assek",
  "/wiki/Padawan",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Lonisa_City",
  "/wiki/Elzar_Mann",
  "/wiki/Idrax_Snat",
  "/wiki/Samera_Ra-oon",
  "/wiki/Regasa",
  "/wiki/Shili",
  "/wiki/Elarec_Yovet",
  "/wiki/Unity_Arc",
  "/wiki/Faith_and_Life_zone",
  "/wiki/United_in_Song",
  "/wiki/Dantari_flu/Legends",
  "/wiki/Porter_Engle",
  "/wiki/Cam_droid",
  "/wiki/Melahnese_Pavilion",
  "/wiki/Bell_Zettifar",
  "/wiki/Firefighting_droid",
  "/wiki/GoNet",
  "/wiki/Sine_Spenning",
  "/wiki/Dutar",
  "/wiki/Innovator",
  "/wiki/Charhound",
  "/wiki/Ember",
  "/wiki/Technology_and_Science_zone",
  "/wiki/Leesa",
  "/wiki/Quarren",
  "/wiki/Nwo",
  "/wiki/Datapad",
  "/wiki/Turbolift",
  "/wiki/Keelkana",
  "/wiki/Beeta-grub",
  "/wiki/Vam_Targes",
  "/wiki/The_Force",
  "/wiki/Lightsaber",
  "/wiki/Valon",
  "/wiki/Matari",
  "/wiki/Voru",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Pan_Eyta",
  "/wiki/Torban_Buck",
  "/wiki/Coruscant",
  "/wiki/Coruscant_Dawn",
  "/wiki/Core",
  "/wiki/Vector",
  "/wiki/Togruta",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Cavan_Scott",
  "/wiki/2021",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Showdown_at_the_Fair",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/231_BBY",
  "/wiki/Reproduction"
 ]
}