{
 "name": "Kitster_Chanchani_Banai",
 "display_name": "Kitster Chanchani Banai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 42 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.24 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "31 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  }
 ],
 "content": "Kitster Chanchani Banai was a Human slave boy on Tatooine, and the best friend of Anakin Skywalker. After not seeing his smuggler father, Rakir Banai, in many years, Kitster gave up hopes of being rescued from Tatooine and instead hoped to one day be a majordomo for a wealthy Mos Espan estate.\nKitster Chanchani Banai was born the son of smuggler Rakir Banai, circa 41 BBY. Rakir was wanted by the Hutts, who eventually tracked him down and captured his ship with his family on board. As a result, Kitster and his mother were sold into slavery, which brought them to the Tatooine city of Mos Espa.\nA short time before the 32 BBY Boonta's Eve, the young Kitster, with Anakin Skywalker and their friends, narrowly avoided disaster upon hearing of children who had been captured and imprisoned by Sebulba. The Dug intended to sell the captives, including Princess Arawynne, to Gardulla the Elder. The children, disguised as Jawas, sneaked into Gardulla's estate and freed the Ghostling children.\nKitster was the best friend of Anakin Skywalker on Tatooine, but he was also a slave—property of Gardulla, who was ever threatening to sell him to the glitterstim miners if he didn't \"shape up.\" Both boys  once revered the Sith based on a holo-recording they had seen replayed by a Sith droid Watto had somehow acquired. Their games of \"Sith Warrior\" came to an end when an old spacer explained the true nature and history of the Sith. During the podrace on Boonta Eve, Kitster was part of Anakin's pit crew.\nBefore Anakin left to become a Jedi, he left Kitster some of his prize credits. With it, Kitster bought Par Ontham's Guide to Etiquette, a book that Kitster memorized to secure a job at the Three Moons, run by Rarta Dal. With that job, Kitster earned enough to buy his own freedom by the time he had grown up.\nIt was said that when Kitster grew up years later during the Clone Wars, he became a smuggler and disappeared on one of his runs. However, he was seen at Mos Espa again, in 1 ABY. He did not know at the time that his best friend fell to the dark side and became the dreaded Darth Vader. In fact, he believed Anakin died during the Clone Wars.\nWhen Kitster attempted to improve the lives of a group of slaves, he ended up offending their owner, the slaver Drik Bandrik. Angered, Bandrik framed Kitster by manipulating a tribe of violent Jawas into believing that Kitster had stolen a droid from them. Luckily for Kitster, a benevolent traveler agreed to help Kitster and kill the group of aggressive Jawas, all of whom were working for Wittin. As a reward, Kitster gave the traveler Anakin's podracing helmet. However, Kitster's problems were not yet over.\nBandrik had once again framed Kitster, this time planting evidence with Jabba the Hutt that implicated Kitster with attempting to lead a slave revolt at his palace a few years ago. Though a revolt did take place, and fail, Jabba was still enraged enough to send a Rodian henchman named Deeng to kill Kitster. The same traveler who had helped him before agreed to hunt down and kill Deeng.\nThough the traveler succeeded in killing Deeng, Bandrik's persistence in framing Kitster did not end there. This time Kitster was being implicated in the murder of a moisture farmer. Kitster insisted that he was nowhere near the murder, and had the evidence to prove it. Kitster's alibi was that he was rotting in an Imperial jail cell during the time of the murder. He was arrested for \"political agitation,\" as a result of his attempts to promote slave rights. Ultimately, the Galactic Empire released Kitster, because they believed him to be harmless. However, Sont Toipo, a local vigilante leader on Bandrik's payroll, was already rallying a lynch mob to kill Kitster. Kitster surmised that the mob consisted of six or eight local moisture farmers. He pleaded with the traveler to kill Sont Toipo, but to make an effort to spare the others, as they were merely farmers. Kitster hoped they would run off after Toipo was killed. The traveler agreed, and set out to successfully kill Toipo, while making an effort to spare the lives of the farmers. For the traveler's efforts, Kitster gave away another souvenir, a droid brain built by his old friend Anakin.\nEventually, Kitster learned that the \"murdered\" moisture farmer was in fact not murdered at all, but rather paid by Bandrik to leave town long enough for a lynch mob to be formed. In order to clear his name, Kitster asked the traveler to find the moisture farmer, a female Twi'lek named Krin Vel, and bring her back to Mos Espa. Despite being ambushed by thugs working for Bandrik, the traveler managed to find Krin, and escort her back. Krin claimed that she did not know she was being used in a plot against Kitster. She wished to be brought back, so that both Kitster and herself could see to it that Bandrik went to prison.\nWith the help of Krin, Kitster managed to assemble enough evidence that would clear him of Bandrik's fake charges. He considered sending the evidence to the police, but soon changed his mind when he surmised that the police and the Empire would have no reason to arrest him. He instead told the traveler to bring the evidence to a slicer friend, a Kitonak who went by the name Thermal Det. The traveler agreed to Kitster's final task, and succeeded in finding Thermal and giving him the evidence. Thermal saw to it that the information went straight to Jabba, and made it onto the HoloNet. Kitster thanked the traveler once again for helping him. Kitster concluded that Jabba would be angered with Bandrik for being manipulated. He believed that Bandrik would have to leave the planet if he ever hoped to survive.\nIronically, Kitster's father, Rakir Banai, was working for Bandrik during these events. Bandrik personally tasked Rakir to deal with the troublemaker, without informing him of his identity. Thanks to the help of a spacer, Rakir finally discovered that Bandrik was a slaver and that his long missing son was the troublemaker. Rakir later send out messengers to the various cities of Tatooine to find Kitster.\nEventually, Kitster married a local Kuati woman named Ulda, who maintained the old Podracing Arena, eventually turning it into a swoop bike arena. However, Kitster quickly fell in love with the arena's bartender, Tamora Spice. Kitster left Ulda and married Tamora, and together they had two kids, Ji and Elly.\nWith Tamora by his side, Kitster soon accomplished his ultimate goal in life by becoming the majordomo at the Rendala Estate in Mos Espa. However, by 8 ABY the estate had been foreclosed, leaving Kitster unemployed. Times became so hard that Kitster took to auctioning off personal objects, such as a holocube of his old friend Anakin Skywalker after winning the Boonta Eve Classic. The holocube was sold to a Gotal collector for thirteen hundred credits at the same auction as the famous painting Killik Twilight, which held Rebel codes in it.\nIn 8.5 ABY, he met Leia and Han Solo at the same auction. When Killik Twilight was threatened with destruction, Kitster acted fast, stealing the painting and using his old friend Wald's swoop bike to escape into the deserts from pursuing stormtroopers. When a huge sandstorm struck, Kitster took shelter in a Jawa Sandcrawler that eventually was attacked by Tusken Raiders. The Sand People kidnapped Kitster and the painting and brought them back to the Valley of the Spirits, where they planned on sacrificing him to the \"angry ghost\" that had slain an entire tribe with a \"glowing, humming sword.\" The Tuskens began to torture Kitster as part of the sacrifice by breaking his fingers for every time the moss painting needed to be watered. Fortunately, within a few days, Han and Leia found and rescued him and the painting. Before parting, Kitster explained his beliefs that Anakin must have always regretted his vengeful attack on the Tuskens, even after becoming the feared Darth Vader, which eventually brought Leia to conclude that she should forgive her father.\nKitster Banai was portrayed by Dhruv Chanchani in The Phantom Menace. \"Chanchani\" was later given as his middle name in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kitster_Banai",
  "/wiki/Kitster_Chanchani_Banai",
  "/wiki/Tatooine/Legends",
  "/wiki/42_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Black",
  "/wiki/Brown",
  "/wiki/Slavery/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Rakir_Banai",
  "/wiki/Majordomo/Legends",
  "/wiki/Mos_Espa/Legends",
  "/wiki/41_BBY/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/W._Wald",
  "/wiki/Boonta_Eve_Classic/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Boonta%27s_Eve",
  "/wiki/Sebulba/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Arawynne",
  "/wiki/Gardulla_Besadii_the_Elder/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Ghostling",
  "/wiki/Glitterstim/Legends",
  "/wiki/Miner/Legends",
  "/wiki/Sith_Warrior",
  "/wiki/Podracing/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Par_Ontham%27s_Guide_to_Etiquette",
  "/wiki/Three_Moons_(hotel)",
  "/wiki/Rarta_Dal",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/1_ABY/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Drik_Bandrik",
  "/wiki/Spacer/Legends",
  "/wiki/Wittin/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Rodian/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Deeng",
  "/wiki/Moisture_farmer/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Sont_Toipo",
  "/wiki/Droid_brain/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Krin_Vel",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Kitonak/Legends",
  "/wiki/Thermal_Det",
  "/wiki/HoloNet/Legends",
  "/wiki/Kuati/Legends",
  "/wiki/Ulda",
  "/wiki/Mos_Espa_Grand_Arena/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Tamora_Spice",
  "/wiki/Ji_Banai",
  "/wiki/Elly_Banai",
  "/wiki/Rendala_Estate",
  "/wiki/8_ABY/Legends",
  "/wiki/Holocube/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Killik_Twilight",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Sandcrawler/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Valley_of_the_Spirits",
  "/wiki/Mission_to_Tatooine_(Separatist_Crisis)",
  "/wiki/Lightsaber/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Dhruv_Chanchani",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Anakin%27s_Fate",
  "/wiki/Episode_I_Adventures_5:_The_Ghostling_Children",
  "/wiki/Episode_I_Adventures_6:_The_Hunt_for_Anakin_Skywalker",
  "/wiki/Episode_I_Adventures_7:_Capture_Arawynne",
  "/wiki/Episode_I_Adventures_8:_Trouble_on_Tatooine",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(unabridged_audiobook)",
  "/wiki/Star_Wars:_Episode_I_%E2%80%94_The_Phantom_Menace",
  "/wiki/Star_Wars_Episode_I:_The_Phantom_Menace_(junior_novelization)",
  "/wiki/Episode_I:_The_Phantom_Menace_Movie_Storybook",
  "/wiki/Episode_I:_Anakin_Skywalker",
  "/wiki/Episode_I:_The_Phantom_Menace_%C2%BD",
  "/wiki/Episode_I:_Queen_Amidala",
  "/wiki/Episode_I:_Qui-Gon_Jinn",
  "/wiki/Dear_Anakin",
  "/wiki/Jedi_Quest:_The_Dangerous_Games",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Thank_the_Maker",
  "/wiki/Star_Wars_Tales_6",
  "/wiki/The_Rise_and_Fall_of_Darth_Vader",
  "/wiki/A_New_Hope:_The_Life_of_Luke_Skywalker",
  "/wiki/Tatooine_Ghost",
  "/wiki/Star_Wars:_Episode_I_The_Visual_Dictionary",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Around_the_Galaxy",
  "/wiki/Star_Wars_Galaxy_Collector_6",
  "/wiki/Use_the_Force",
  "/wiki/Young_Jedi_Collectible_Card_Game",
  "/wiki/Boonta_Eve_Podrace_(YJCCG)",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_9",
  "/wiki/The_Official_Star_Wars_Fact_File_123",
  "/wiki/Star_Wars_Insider",
  "/wiki/Bookshelf",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Chronicles:_The_Prequels",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Agents_of_Deception",
  "/wiki/Template:SWGTCG",
  "/wiki/Star_Wars:_Head-to-Head_Tag_Teams",
  "/wiki/Databank_(original)",
  "/wiki/Things_To_Look_Out_For_In_Star_Wars_Episode_I:_The_Phantom_Menace_3D!",
  "/wiki/Star_Wars_Insider_131",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Roleplaying_Game_Core_Rulebook",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}