{
 "name": "Kitster Banai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 41 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.24 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  }
 ],
 "content": "Kitster Banai was a human male slave who lived on the Outer Rim world of Tatooine during the Naboo Crisis. As a child, he befriended Anakin Skywalker—a fellow slave and podracing enthusiast. Banai supported Skywalker as a member of his pit team at the Boonta Eve Classic. As a result of winning the event, Banai's friend gained his freedom and subsequently departed the desert planet to join the Jedi Order. Banai was eventually freed from slavery and moved to the planet Gabredor III where he lived with other freed slaves from Tatooine in a colony.\nKitster Banai was a child enslaved on Tatooine, an Outer Rim planet that was too distant to be affected by the anti-slave laws of the Galactic Republic. Born during the final years of the Republic, he was around the same age as his friend, Anakin Skywalker. Like Banai, Skywalker was also a slave—having been sold to the Toydarian junk dealer Watto. As children, Banai and Skywalker protected each other while braving the dangerous streets of Mos Espa. Though they would sometimes argue, the two were great friends and enjoyed playing pranks on each other. When Skywalker entered his custom-built podracer in the Boonta Eve Classic podracing event, Banai supported him as a member of his pit team. Skywalker ultimately won the race along with his freedom, leading Banai and his childhood friend to part ways as Skywalker embarked on a journey to become a Jedi.\nAs the years went by, an older Skywalker still thought about Banai and hoped that his friend had been able to make it off of Tatooine. In the early days of the Clone Wars in 22 BBY, Skywalker reflected on his childhood memories while giving a lesson to Jedi younglings. He imparted upon the initiates that every person they would meet in their lives would have something to teach them, citing Banai as an individual who taught him how to find joy in the bleakest of times.\nBanai was eventually freed from slavery by Sabé, one of the Naboo Royal Handmaidens, and the royal guard Tonra as part of a slave liberation movement they were conducting in Shmi Skywalker's honor. Banai eventually ended up on Gabredor III and lived in a colony with the other freed slaves from Tatooine, including Wald. Eventually, the Governor of Gabredor III, Tauntaza, began to neglect the planet and the colony as she used the Crimson Dawn criminal syndicate to consolidate her power. Between 3 ABY and 4 ABY, Sabé enlisted the help of the Sith Lord Darth Vader to help free the colony from the governor, and brought him to the colony where they met with Banai and Wald. Darth Vader was secretly Anakin Skywalker, and recognized Banai and Wald from his childhood. Due to the governor's meddling, the planet was experiencing a drought, which inadvertently caused a group of tangor to attack the colony.\nBanai attempted to fight back, but had to be saved by Darth Vader, who slew the beasts. Vader and Sabé then continued their plan to take the governor out, utilizing the help of Banai and the colonists. The two watched as Sabé equipped herself with Imperial armor, with Banai realizing she may have created a dangerous situation for herself.\nKitster Banai was a human male who possessed black hair, brown eyes, and tan skin. During his childhood, he had a height of 1.24 meters. As an adult sometime between 3 ABY and 4 ABY, Banai was bald with a beard without a mustache that had two tufts of gray hair in it.\nAs a child, Kitster Banai had a confident, positive outlook which he shared with his friend Anakin Skywalker. He was often supportive of Skywalker, both prior to and during the Boonta Eve Classic. Although victory had eluded Skywalker in previous racing events, he offered encouraging words nonetheless. Despite his optimism, he was also doubtful as to whether or not Skywalker could repair his podracer, let alone win the race. Even so, Banai attended the event where he cheered on his friend. He enjoyed playing pranks on others, including Skywalker, though he often enlisted the boy in helping him complete his jokes.\nKitster Banai was portrayed by Dhruv Chanchani in the 1999 film Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kitster_Banai",
  "/wiki/Kitster_Chanchani_Banai",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/Tatooine",
  "/wiki/41_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Slavery",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Anakin_Skywalker",
  "/wiki/Podracing",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Desert",
  "/wiki/Jedi_Order",
  "/wiki/Gabredor_III",
  "/wiki/Gabredor_III_colony",
  "/wiki/Galactic_Republic",
  "/wiki/Reproduction",
  "/wiki/Standard_year",
  "/wiki/Toydarian",
  "/wiki/Junk_dealer",
  "/wiki/Watto",
  "/wiki/Mos_Espa",
  "/wiki/Anakin_Skywalker%27s_Podracer",
  "/wiki/Jedi",
  "/wiki/Standard_day",
  "/wiki/Clone_Wars",
  "/wiki/22_BBY",
  "/wiki/Jedi_Initiate",
  "/wiki/Sab%C3%A9",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Tonra",
  "/wiki/Shmi_Skywalker_Lars",
  "/wiki/Wald",
  "/wiki/Governor",
  "/wiki/Tauntaza",
  "/wiki/Crimson_Dawn",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Dhruv_Chanchani",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Brotherhood",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Darth_Vader_(2020)_23",
  "/wiki/Darth_Vader_(2020)_24",
  "/wiki/Darth_Vader_(2020)_25",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/Darth_Vader_(2020)_27",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/LEGO_Star_Wars:_The_Resistance_Rises",
  "/wiki/The_Trouble_with_Rathtars",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_4",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Jedi_Knight",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo"
 ]
}