{
 "name": "Kivvaaa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Myyydril tribe"
     ]
    }
   ]
  }
 ],
 "content": "Kivvaaa was a female Wookiee who lived during the Galactic Civil War as the patrol leader for the Myyydril, a tribe that lived in the Myyydril Caverns on the planet Kashyyyk. Shortly after the Battle of Yavin, Kivvaaa was stationed at the entrance of the caverns when she encountered a spacer passing through the area. Like many of the Myyydril, Kivvaaa was suspicious of outsiders, but, after the spacer spoke with her, the being quickly gained her trust. The spacer wished to assist the Myyydril with the Urnsor'is spider infestation that had long plagued the tribe, and Kivvaaa directed the being to the Myyydril's chief, Kallaarac.\nKivvaaa was a female Wookiee and a member of the Myyydril—a secluded multi-species tribe that resided in the Myyydril Caverns in the Kkowir Forest on the planet Kashyyyk—during the Galactic Civil War. Kivvaaa served as the tribe's patrol leader, tasked with guarding the entrance of the caverns from outsiders. During this time, the Myyydril were being harassed by Urnsor'is spiders that had infested the caverns, killing many Myyydril, especially the youth of the tribe. Kivvaaa lost her entire right arm when it was infected with the flesh-eating Poltur Virus in one of these Urnsor'is attacks. She replaced the lost limb with a cybernetic one.\nShortly after the Battle of Yavin, Kivvaaa was stationed at the entrance to the Myyydril Caverns when she encountered a wandering spacer attempting to enter. Like many of the Myyydril, Kivvaaa was highly suspicious of outsiders, and at first did not permit the being from entering the caverns, demanding to know why the traveler wanted to pass. However, the spacer—able to understand Kivvaaa's Shyriiwook language—only wished to explore the area.\nFeeling embarrassed for her original rudeness, Kivvaaa apologized and explained that the caverns were extremely dangerous due to the Urnsor'is infestation and that she did not want the spacer to pass just to be killed by the spiders. The spacer offered to assist the Myyydril with ending the Urnsor'is menace, and Kivvaaa—now trusting the being for the traveler's kindness—allowed the spacer to enter the caverns and directed the spacer to the Myyydril chief, Kallaarac. The spacer was eventually able to gain Kallaarac and the rest of the tribe's trust and successfully managed to destroy the Urnsor'is infestation.\nLike most of the Myyyndril, Kivvaaa was suspicious of strangers, which she showed when she initially prevented the spacer from going into the caverns. However, the being quickly gained her trust by being able to understand the Wookiee language of Shyriiwook—a rarity among outsiders—and showing sympathy for the Myyyndril's plight. Kivvaaa was saddened that many of the young Myyyndril had been killed by the Urnsor'is and did not want the spacer, whom she considered young, to be slain as well. Kivvaaa had dark brown hair.\nKivvaaa first appeared in Rage of the Wookiees, a 2005 expansion pack for Star Wars Galaxies. In the video game, Kivvaaa is the first character the player encounters during the \"Myyydril Trust\" quest line, allowing the player to continue on with the quest after a short conversation with her. Although the player does not need to take part in the quest, this article assumes 100 percent game completion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Cybernetics/Legends",
  "/wiki/Myyydril",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Myyydril_Caverns",
  "/wiki/Planet/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Urnsor%27is",
  "/wiki/Spider/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Kallaarac",
  "/wiki/Species/Legends",
  "/wiki/Kkowir_Forest",
  "/wiki/Time/Legends",
  "/wiki/Death/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Poltur_Virus",
  "/wiki/Canon",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Language/Legends",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Video_game"
 ]
}