{
 "name": "Kiza",
 "display_name": "Kiza",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia",
      "Pantora"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 ABY",
      "a core ship",
      "Kiza's world"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue-black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Golden"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kiza's family",
      "Acolytes of the Beyond",
      "Kiza's army"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Exim Panshard"
     ]
    }
   ]
  }
 ],
 "content": "Kiza was a Pantoran female member of the Acolytes of the Beyond. During the Coronet City revolution on Corellia in the months following the Battle of Endor, Kiza freed a fellow acolyte, Remi, from the Peace and Security station in the city. After freeing the boy, they killed all but one of the detectives in the station. Kiza later took part in an attack on a New Republic outpost on Devaron. During that attack, she wore the mask of Viceroy Exim Panshard. Consumed by the dark side of the Force, she killed her lover Remi.\nKiza was born to a lowborn family of Pantoran exiles on Corellia where she lived in the impoverished parts of Coronet City on the planet. Throughout her life, Kiza harbored rage at her perceived \"oppressors\": the peace officers who hassled her, the chits-and-debits office that pursued her family's debts, and the highborn Corellians who looked down on her lowborn origins. During her adolescence, Kiza began to experience Force visions. Following the Battle of Endor, she was recruited by a man from the Acolytes of the Beyond, a cult of non-Force-sensitive individuals that revered the Sith and the dark side of the Force.\nBuilding her way up the ranks, Kiza initially started off tagging walls with the Darth Vader mask sigil and the warning \"VADER LIVES.\" She also stole credits and tithed them to the cause. Kiza also scouted locations for dead-drops of safe meetings. In the months after the Battle of Endor, Kiza developed romantic feelings for a youth named Remi, who shared her passion for the dark side. Prior to the Coronet City revolution, the Acolytes assigned Kiza with the task of infiltrating the local Peace and Security station. They created a false identity which allowed her to pose as a secretary.\nDuring the Coronet City revolution, Kiza killed several Corellian peace officers with a blaster. When the detective Erno demanded to know what was going on, she told him that she was no longer his doll. Meanwhile, Remi retrieved a lightsaber from the archives beneath the station. Before Erno could subdue Kiza, Remi cut off his blaster hand with the lightsaber. Kiza then clubbed Erno on the head and told him that Vader lived. She spared his life so that he could warn the others that the Acolytes were coming. \nAt some point she became close to an Acolyte named Komat, who became like a sister to her.\nPrior to the Battle of Jakku, Kiza and her fellow Acolytes regrouped on the Colonies world of Devaron. They took part in an attack on a New Republic outpost in the Karatokai Mountains. This attack was part of a coordinated series of attacks on New Republic outposts throughout the galaxy. Her cell group was led by Yupe Tashu, a former adviser to the late Emperor Sheev Palpatine. During that time, Kiza came to doubt whether she was as strong as Remi, who had become besotted with the lightsaber he had obtained on Corellia.\nAfter communing with the spirits of fallen Sith, Tashu gifted the mask of Viceroy Exim Panshard to Kiza. When Remi expressed jealousy and demanded the mask, Tashu chastised him for angering the specters. As punishment, he confiscated the lightsaber from Remi and gave it to Kiza. The Acolytes then launched a surprise attack on the New Republic outpost. During the assault, Kiza struck down several New Republic personnel with her lightsaber, including slicing the legs off a fleeing woman.\nKiza also allowed the dark side influence within the mask to consume her mind and body, with the voice of Panshard holding onto life and speaking to her. Remi took advantage of the chaos to try and recover his lightsaber. He managed to knock her to the ground, causing her to drop her lightsaber. While struggling against Remi, Kiza managed to find the blade and jammed the unignited blade against Remi's temple. She then ignited the blade through his skull, killing him. After adjusting her mask, Kiza rejoined the attack on the New Republic outpost, now fully consumed by the dark side. Komar came to realize her friend had changed, and she and Kiza herself believed the corrupted Acolyte killed Tashu.\nFor so long she lost count, Kiza continued to follow the orders of a Sith who had died long before, slowly but surely losing herself to it but becoming addicted to its power. Panshard promised her power if they could find the Sith world of Exegol, so Kiza established her base of operations on a large asteroid next to the Red Honeycomb Zone. Following Panshard's orders, Kiza collected an army of battle droids that she kept in an old core ship.\nIn 21 ABY, she was present during the raid on Nightside where she attempted to confront Luke Skywalker and recover a portion of a bled kyber crystal from him as part of Panshard's plan to navigate the Red Honeycomb Zone. However she was forced to flee without her prize after the station she was on collapsed.\nShe met her end during a duel with Skywalker in the ruins of a core ship she called home. However even after her death her body continued to serve the Sith.\nKiza endured poverty and humiliation during her childhood. This fueled her anger and hatred. Despite not being Force-sensitive, Kiza experienced Force visions of the Sith. Kiza later joined a dark side sect called the Acolytes of the Beyond, who revered the Sith. As an Acolyte, Kiza learned to channel her hatred and anger. Her initial contributions to the group included tagging walls with the Vader mask sigil and the message \"VADER LIVES.\" As she rose through the ranks, Kiza took part in killing enemies of the Acolytes including peace officers. As a Pantoran, Kiza was regarded as attractive by humans like Erno.\nFollowing the Coronet City revolution, Kiza was chosen by fallen Sith spectres to bear the mask of Viceroy Exim Panshard and Remi's stolen lightsaber. Giving in completely to the dark side, she slew numerous New Republic personnel. When Remi tried to reclaim his blade, Kiza slew him in a fit of rage and hatred.\nKiza was a Pantoran female who had blue-black hair, golden eyes, and blue skin.\nKiza first appeared as a tertiary character in Chuck Wendig's 2016 novel Aftermath: Life Debt. She was given a brief point-of-view chapter in the novel's 2017 sequel Aftermath: Empire's End.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Corellia",
  "/wiki/Pantora",
  "/wiki/21_ABY",
  "/wiki/Kiza%27s_world",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kiza%27s_family",
  "/wiki/Acolytes_of_the_Beyond",
  "/wiki/Exim_Panshard",
  "/wiki/Coronet_City_revolution",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Endor",
  "/wiki/Remi",
  "/wiki/Peace_and_Security_Headquarters",
  "/wiki/City",
  "/wiki/Death",
  "/wiki/Erno",
  "/wiki/Detective",
  "/wiki/Attack_on_a_New_Republic_outpost",
  "/wiki/New_Republic",
  "/wiki/Devaron",
  "/wiki/Mask_of_Viceroy_Exim_Panshard",
  "/wiki/Viceroy",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Reproduction",
  "/wiki/Exile_(punishment)",
  "/wiki/Coronet_City",
  "/wiki/Planet",
  "/wiki/Coronet_City_Peace_and_Security",
  "/wiki/Corellian",
  "/wiki/Force_vision",
  "/wiki/Sith_cult",
  "/wiki/Force-sensitive",
  "/wiki/Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Vader%27s_armor",
  "/wiki/Credit",
  "/wiki/Endor",
  "/wiki/Officer",
  "/wiki/Blaster",
  "/wiki/Kiza%27s_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Komat",
  "/wiki/Battle_of_Jakku",
  "/wiki/Colonies",
  "/wiki/Karatokai_Mountains",
  "/wiki/The_galaxy",
  "/wiki/Yupe_Tashu",
  "/wiki/Emperor%27s_adviser",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Time",
  "/wiki/Limb",
  "/wiki/Exegol",
  "/wiki/Red_Honeycomb_Zone",
  "/wiki/Battle_droid",
  "/wiki/Raid_on_Nightside",
  "/wiki/Luke_Skywalker",
  "/wiki/Bleeding",
  "/wiki/Kyber_crystal",
  "/wiki/Duel_on_Kiza%27s_world",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Chuck_Wendig",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/2017",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Shadow_of_the_Sith_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Template:ShadowoftheSithDate",
  "/wiki/May_9",
  "/wiki/2022"
 ]
}