{
 "name": "Klaatu",
 "display_name": "Klaatu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kintan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Klaatu was a male Kadas'sa'Nikto gambler who worked for Jabba the Hutt repairing the crime lord's skiffs. Klaatu also took enjoyment in Jabba's executions by rancor in Jabba's Palace.\nHe was killed aboard Jabba's sail barge Khetanna on Tatooine during the failed execution of Luke Skywalker and his companions.\nKlaatu was a Kadas'sa'Nikto male from the planet Kintan who served as a bodyguard for the Hutt crime lord Jabba Desilijic Tiure in the criminal's palace on the desert planet Tatooine. At the palace, Klaatu spent his time repairing skiffs and amassing larger and larger gambling debts. During the childhood of Luke Skywalker, who was raised as a moisture farmer on Tatooine from 19 BBY, Klaatu became infamous across the planet for his dark deeds. In 4 ABY, the guard was present early one morning when the droids R2-D2 and C-3PO arrived at the palace, carrying a message for Jabba from Skywalker, who was now a Jedi Knight. In the message, Skywalker asked to bargain with the Hutt for the freedom of the smuggler Han Solo and then gifted the droids to Jabba as a sign of good will. After viewing it, Jabba declared that he had no interest in losing Solo, who was frozen in carbonite and kept displayed on the wall of the Hutt's throne room.\nSkywalker's ally Princess Leia Organa later arrived at the palace in order to try and rescue Solo, and presented herself to Jabba while disguised as the bounty hunter Boushh. After handing over the Wookiee Chewbacca as a prisoner to Jabba, Organa snuck back into the throne room at night to unfreeze the smuggler; however, having been tipped off by the bounty hunter Boba Fett, the Hutt knew Boushh was not who they seemed, and had laid a trap for Organa. Klaatu and a number of other court members lay in wait behind curtains for the princess, and after an hour she snuck into the throne room, believing the court to all be asleep. After she released Solo and removed her helmet, Jabba sprung the trap. The curtains were pulled back to reveal Klaatu and many other guards stood on the stairway to the throne room's exit, blocking Organa and Solo's escape. Jabba then had the pair taken prisoner, with Solo dragged off to the dungeons while Organa was forced closer to the Hutt.\nWith his allies captured, Skywalker himself then arrived at the palace early in the morning while Jabba and much of his court still slumbered. After the crime lord's majordomo, was mind tricked by Skywalker into waking the Hutt, the Jedi demanded that Solo and the others be freed. Klaatu stood with fellow guards Vizam and Nysad on the steps beside Jabba's throne, as the Hutt refused the demands, causing Skywalker to threaten the Hutt with a blaster pistol. The crime lord quickly dropped Skywalker, and the unfortunate Gamorrean guard Jubnuk, into the pit beneath the throne room where they were attacked by Jabba's pet rancor, Pateesa. Klaatu rushed forward to the grating above the pit to watch the execution, but after Pateesa devored Jubnuk, Skywalker managed to slay the beast. Outraged, Jabba had Skywalker and his allies dragged up to the throne room and sentenced the Jedi to death along side Solo and Chewbacca. Klaatu then joined the crowd of courtiers that followed the prisoners as they were marched from the throne room.\nKlaatu then traveled on board Jabba's sail barge, the Khetanna, to the Great Pit of Carkoon, where the prisoners would be fed to the sarlacc that dwelt there. Upon reaching the pit, Klaatu took up position on the sail barge's top deck and looked down on the prisoners, who had been brought above the pit on separate Bantha-II cargo skiffs, while they were given a chance to plead for mercy. After refusing to beg, Skywalker was pushed forward into the pit, but then leapt back onto the skiff carrying the prisoners armed with his lightsaber, which R2-D2 had launched to him from the barge. As Skywalker defeated the guards on the skiff with him, Klaatu rushed around toward the rear of the deck as more of his colleagues emerged to begin firing at the Jedi.\nSkywalker soon worked his way up onto the deck of the barge, killing Vizam, Nysad, and several others, before Klaatu confronted him alongside a human guard. The Jedi disarmed the pair with a stroke of his lightsaber, and both fled back through one of the hatches into the barge's interior. Organa, who had already strangled Jabba, then aimed the barge's deck cannon down at the vehicle itself and fired before escaping with Skywalker and her other allies. The blast from the cannon caused the sail barge to explode, and Klaatu perished when he was pulverized in the blast.\nKlaatu was a thug with the blood of innocents on his hands, but ultimately proved a coward when he fled from Skywalker on the sail barge. Also a gambler, the Kadas'sa'Nikto eagerly awaited executions while at the palace and enjoyed viewing those held in the pit below Jabba's throne room. He possessed a gift for repairing the skiffs that he worked on. As a Kadas'sa'Nikto, Klaatu had green skin and black eyes.\nKlaatu wore a tunic, which was still wet with blood when R2-D2 and C-3PO first arrived in the palace.\nDuring Jabba's Palace scenes, Klaatu was portrayed by English actor John Simpkin, while during the Great Pit of Carkoon battle, Klaatu was played by Corey Dee Williams, son of Billy Dee Williams, who played Lando Calrissian. In Star Wars: Card Trader's Galactic Underworld set, an image of Yotts Oren was used to depict Klaatu.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Klaatu",
  "/wiki/Klaatu/Legends",
  "/wiki/Nikto/Legends",
  "/wiki/Species/Legends",
  "/wiki/Kadas%27sa%27Nikto/Legends",
  "/wiki/Subspecies/Legends",
  "/wiki/Star_Wars_Legends",
  "/wiki/Kintan",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Nikto",
  "/wiki/Kadas%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Skiff",
  "/wiki/Rancor",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Death",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Luke_Skywalker",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Klaatu",
  "/wiki/Planet",
  "/wiki/Bodyguard",
  "/wiki/Desert",
  "/wiki/Time",
  "/wiki/Gambling",
  "/wiki/Moisture_farmer",
  "/wiki/19_BBY",
  "/wiki/Standard_day",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Jedi_Knight",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Throne",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Bounty_hunter",
  "/wiki/Boushh",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Prisoner",
  "/wiki/Boba_Fett",
  "/wiki/Standard_hour",
  "/wiki/Sleep",
  "/wiki/Security_guard",
  "/wiki/Majordomo",
  "/wiki/Mind_trick",
  "/wiki/Jedi",
  "/wiki/Vizam",
  "/wiki/Nysad",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Gamorrean",
  "/wiki/Jubnuk",
  "/wiki/Pateesa",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Sarlacc",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Cannon",
  "/wiki/Eye",
  "/wiki/John_Simpkin",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Corey_Dee_Williams",
  "/wiki/Billy_Dee_Williams",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Yotts_Oren",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Luke_vs._Jabba_-_Sail_Barge_Escape",
  "/wiki/A_Vader_Family_Sithmas",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2021",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star"
 ]
}