{
 "name": "Klarymére",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skye"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "S'kytri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Amber"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Supreme Council of the S'kytri"
     ]
    }
   ]
  }
 ],
 "content": "Klarymére was a male S'kytri and Lord of the Highland Clans of the planet of Skye. Serving as the people's Patriarch at the start of the Clone Wars, he resided in the planet's capital city, the City of the Winged People.\nA green-pigmented S'kytri of the Highland Clans, Klarymére served as the Patriarch of the planet Skye in 22 BBY. He had a daughter named Kharys, who was to succeed him as Matriarch of the S'kytri. At this time, the crazed Arkanian mutant, Zeta Magnus had brought a pathogen to Skye and unleashed it on her people, declaring himself Magister in the process. Sending a transmission to the Jedi High Council, Klarymére requested Jedi assistance in eliminating Magnus in exchange for the S'kytri people's unending fealty to the Order. When three escape pods arrived on the planet, the Patriarch traveled to the rendezvous point and met with Jedi Knight Obi-Wan Kenobi and his two Padawans, Anakin Skywalker and Halagad Ventor, hoping that they had brought supplies and an antidote to the pathogen. While those things were destroyed in the destruction of their ship in orbit, the Jedi and their four clone commandos assured Klarymére that they would do all they could to bring the Magister to justice. Escorting the offworlders to the gates of the City of the Winged People high in the summits of a nearby mountain, Klarymére brought the Jedi before the Supreme Council of the Highland Clans to discuss the future of the Tyrant which ruled over them. When the Jedi successfully convinced the Council to honor Klarymére's promise, the Patriarch's daughter suggested that the group infiltrate Magnus' citadel atop Canaitith Mountain by traversing the legendary underworld of Entyrmion. When Kharys agreed to lead them, the Patriarch warned the Council that they should prepare an assault on the citadel and attack on their signal.\nEntering into the fabled caverns of the Entyrmion, Klarymére traveled with his daughter, the Jedi and clones through the chilly cave system, cautious of encountering the legendary beasts said to have been sealed beneath the earth by the mythical Hormaket the Vanquisher. When the group entered into a sweltering chamber, they encountered dozens of Magnus' mutant Oskan blood eaters. As the Oskans swarmed around them, the Jedi and the S'kytri drew their blades while the clones fought with blasters. When his daughter Kharys was outnumbered, Klarymére flew to assist her but was skewered by a towering Oskan from behind. Collapsing to the floor, Klarymére bled out in a puddle of his own blood. While Skywalker killed the beast that struck down the Patriarch and the room was eventually cleared, the Jedi stood by as Kharys mourned her dying father. After swearing the Jedi to the task of killing Magnus, he told Kharys she would make a great Matriarch before expiring. Overwhelmed with grief, Kharys gave into the dark side and butchered the corpse of the Oskan which had slew her father before storming of with his body into the sky through a passage which had opened in the roof during the fighting. From there, Kharys delivered her father's body to the summits of Mount Krisklar so that skingles could devour his heart, eyes, and liver as was custom.\nAfter the Jedi rescued the planet from Magnus, Klarymére's oath was upheld by the Supreme Council and the S'kytri swore eternal fealty to the Jedi. This action would lead to their planet's undoing years later, when Skywalker, reborn as the Dark Lord of the Sith, Darth Vader, invoked their oath, forcing the S'kytri to submit to the rule of the Galactic Empire.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Skye/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/S%27kytri",
  "/wiki/Gender/Legends",
  "/wiki/Supreme_Council_of_the_Highland_Clans",
  "/wiki/Lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Patriarch_(Skye)",
  "/wiki/Clone_Wars/Legends",
  "/wiki/City_of_the_Winged_People",
  "/wiki/Kharys",
  "/wiki/Arkanian/Legends",
  "/wiki/Zeta_Magnus",
  "/wiki/Magister",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Halagad_Ventor",
  "/wiki/Clone_commando/Legends",
  "/wiki/Kharys%27_fortress",
  "/wiki/Canaitith_Mountain",
  "/wiki/Entyrmion",
  "/wiki/Hormaket",
  "/wiki/Oskan_blood_eater",
  "/wiki/Mount_Krisklar",
  "/wiki/Skingle",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Aragh"
 ]
}