{
 "name": "Klaud",
 "display_name": "Klaud",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trodatome"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.89 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Engineering Corps",
      "Engineering Corps"
     ]
    }
   ]
  }
 ],
 "content": "Klaud was a Trodatome male mechanic who worked during the war between the First Order and the Resistance. Hapless and helpful, Klaud was brought into the Resistance, who he assisted with their mechanical needs. Klaud accompanied Poe Dameron, Finn, Chewbacca, and R2-D2 on a mission to the Sinta Glacier Colony. Believed to originally be a parts pickup, the mission's true purpose was hidden by the informant Boolio, who had First Order intelligence to deliver to the Resistance. The Millennium Falcon came under attack from TIE/sf fighters and TIE whisper fighters shortly after the handover, and Klaud was overwhelmed by the chase. Piloting the Falcon, Dameron eventually managed to escape the First Order, returning with the intelligence to the Resistance base on Ajan Kloss.\nKlaud was a male Trodatome. During the war between the First Order and the Resistance, Klaud worked as a mechanic. He was eventually brought into the Resistance thanks to a case of mistaken identity, but he was nevertheless welcomed into its ranks and joined its Engineering Corps. By 35 ABY, Klaud was stationed at the base of the main Resistance cell on the jungle moon Ajan Kloss. At one point during his time in the base, Klaud was with Resistance pilot Temmin Wexley, who gestured at the Trodatome in confusion. Eventually, the Resistance was contacted by Boolio, a mine overseer at the Sinta Glacier Colony who had acquired information from an anonymous high-ranking First Order officer. As Boolio did not want to risk revealing the intelligence, Boolio claimed that he could provide a regulator required for the Resistance's CR90 corvette Tantive IV.\nThe Resistance sent several operatives on the Millennium Falcon to meet with Boolio. As the mission was believed to be a parts pickup, Klaud accompanied Poe Dameron, Finn, Chewbacca, and the astromech droid R2-D2 aboard the Falcon. Dameron had requested Rey's help instead but was overruled by General Leia in favor of Klaud. None of the other members of the crew could understand Klaud, but since he displayed talent for mechanicals, Poe assigned him to continue repairing the ship. While the Falcon was on its way to the Sinta Glacier, Klaud made some repairs to the freighter. The Falcon arrived at the colony, where Boolio transferred the First Order intelligence to R2-D2. Before the Resistance operatives could depart, however, a number of First Order Special Forces TIE fighters and TIE whisper fighters approached the colony, chasing the Falcon through the icy corridors of the Sinta Glacier.\nAs the Falcon navigated the corridors, Klaud was surprised by the chase and was knocked aside by the sharp turns the ship made. Cornered by TIE fighters, Dameron chose to lightspeed skip away from the Sinta Glacier, placing the Falcon into a number of dangerous locations, including the Megafauna Chasm of the Typhonic Nebula, the Mirror-Spires of Ivexia, and the Crystal Chaos of Cardovyte. The heavily damaged Falcon eventually managed to evade its First Order pursuers and returned to the Resistance base on Ajan Kloss.\nBoolio's intelligence revealed that Darth Sidious, the Dark Lord of the Sith and Galactic Emperor who was presumed dead during the Battle of Endor decades earlier, was alive and had been plotting his return to power from the hidden Sith world of Exegol. Klaud was present in the Resistance briefing where Dameron and Finn plotted the Battle of Exegol with the rest of the Resistance fighters. The battle was a success, resulting in the death of Darth Sidious and the destruction of the Sith Eternal, and Klaud took part in the celebration on Ajan Kloss when the victorious Resistance returned.\nA hapless Trodatome male, Klaud was eager to help the Resistance. However, when the mission to the Sinta Glacier that was believed to be a parts pickup turned into an intelligence operation and an escape from TIE fighters, Klaud was overwhelmed. He was bewildered by the human Resistance pilot Temmin Wexley, who was unable to translate Klaud's confusing language. Klaud had blue eyes and yellow skin.\nKlaud had a keen mind and a talent for the mechanical, using his skills to assist the Resistance. He spoke a complex language that was difficult to understand.\nKlaud is a character created for the 2019 film Star Wars: The Rise of Skywalker. He was introduced by director J.J. Abrams during the Episode IX panel at Celebration Chicago 2019. Klaud was performed by Nick Kellington, who wore a full-body suit with animatronic features that were remotely operated.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Trodatome",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Engineering_Corps",
  "/wiki/Technician",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Poe_Dameron",
  "/wiki/Finn",
  "/wiki/Chewbacca",
  "/wiki/R2-D2",
  "/wiki/Mission_to_Sinta_Glacier_Colony",
  "/wiki/Sinta_Glacier_Colony",
  "/wiki/Boolio",
  "/wiki/Millennium_Falcon",
  "/wiki/TIE/sf_space_superiority_fighter",
  "/wiki/TIE/wi_Interceptor",
  "/wiki/Pilot",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Ajan_Kloss",
  "/wiki/35_ABY",
  "/wiki/Jungle",
  "/wiki/Moon",
  "/wiki/Resistance_pilot",
  "/wiki/Temmin_Wexley",
  "/wiki/Mining",
  "/wiki/Military_rank",
  "/wiki/First_Order_officer",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Astromech_droid",
  "/wiki/Rey_Skywalker",
  "/wiki/Sinta_Glacier",
  "/wiki/Freighter",
  "/wiki/Water",
  "/wiki/TIE_line",
  "/wiki/Starfighter",
  "/wiki/Hyperspace_skipping",
  "/wiki/Megafauna_Chasm",
  "/wiki/Typhonic_Nebula",
  "/wiki/Mirror-Spires",
  "/wiki/Ivexia",
  "/wiki/Crystal_Chaos",
  "/wiki/Cardovyte",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Battle_of_Endor",
  "/wiki/Standard_decade",
  "/wiki/Sith",
  "/wiki/Exegol",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal",
  "/wiki/Human",
  "/wiki/Language",
  "/wiki/Eye",
  "/wiki/John_Boyega",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/J.J._Abrams",
  "/wiki/Celebration_Chicago",
  "/wiki/Nick_Kellington",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Book_and_Magnetic_Playset",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Battle_Beyond_the_Stars",
  "/wiki/Star_Wars_Insider_194",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Image_Archive",
  "/wiki/Star_Wars_Insider_195",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2021",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/The_Eyes_Have_It",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Neal_Scanlan:_A_Force_Reawakended",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2023",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Klaud",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi"
 ]
}