{
 "name": "Kleeve",
 "display_name": "Kleeve",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Confederacy military",
      "Confederacy military",
      "Janus Kasmir's crew"
     ]
    }
   ]
  }
 ],
 "content": "Kleeve was a male Devaronian who served as a general in the Confederacy of Independent Systems during the Clone Wars. Toward the end of the war, Kleeve and his droids occupied the planet of Kaller, until the Galactic Republic troops led by Jedi Master Depa Billaba intervened.\nSome time after the end of the Clone Wars, Kleeve relocated to the planet Lahn and assumed the name \"Jondo.\" While there, he was reacquainted with Billaba's former padawan, Caleb Dume, who was now traveling in the company of scoundrel Janus Kasmir. Although Dume was initially hostile towards the former general, now that the war was over they decided to put aside their differences. Kleeve had arranged a deal with Kasmir, a trade that turned out to be for a ship formerly called Farbrooke's Hope. However, before the deal could be completed, Kasmir, Dume, and Kleeve were taken into Imperial custody by the clone troopers Grey and Styles. However, it turned out that the clones were only interested in the former Padawan and they let both Kasmir and Kleeve free after they collected the boy. Somewhat unexpectedly, Kleeve agreed to aid Kasmir in an attempt to rescue Caleb from the clones' Gozanti-class cruiser in orbit above Kaller. With Kasmir piloting his Kasmiri and Kleeve piloting Farbrooke's Hope, the pair managed to rescue Caleb as well as destroy the Imperial freighter. After the battle, the team landed on Kaller, where Caleb announced his intention to strike out on his own, taking Kleeve's ship, which he renamed the Escape.\nKleeve was born sometime during the last years of the Galactic Republic. Years later, war came to the Republic when the thousands of star systems seceded from the Republic and formed Confederacy of Independent Systems, which was led by Count Dooku, a former Jedi Master. The Confederacy yearned to form a government that was independent from the corruption, bureaucracy and taxes of the Republic. The Separatists soon found themselves at war with the Republic, using their droid armies against the Republic's clone army. Kleeve eventually joined the Separatists, valuing their plight for freedom from the Republic, and became a General in their Separatist Droid Army. Kleeve fought in multiple battles, becoming a prestigious commander on the battlefront.\nNear the end of the Clone Wars, Kleeve, along with Grievous, then planned a suicide attack on the Jedi Temple. Using the specifications on the Jedi Temple from bounty hunter Cad Bane, Kleeve sent the Confederacy's top explosive expert to carry out the attack. After the failed bombing, Kleeve then discovered that the Republic had sent a clone battalion under Jedi General Depa Billaba to Kardoa. He objected to Grievous attacking Kardoa for no other reason besides Billaba. Kleeve then received orders from Count Dooku to lead the conquest of Kaller.\nDuring the Outer Rim Sieges, Kleeve led a Separatist droid army to the planet Kaller, which was located in the Outer Rim Territories. Kaller's leader, the Kalleran Gamut Key, resented the Confederate occupation of his world. Kleeve had bigger problems to worry about, however, when the Republic dispatched a legion of clone soldiers and two Jedi—Jedi Master Depa Billaba and her Padawan Caleb Dume—to free Kaller from the Separatists and annihilate Kleeve and his forces; bringing forth the Conquest of Kaller.\nKleeve led his forces from Key's palace, and watched as his forces were routed by the Jedi and their loyal troopers. A B1-series battle droid informed Kleeve that the droids had been overrun, so Kleeve, realizing the battle was lost, informed Key of his intent to retreat and left the planet in a Separatist command shuttle before Billaba, Dume and the clones invaded the compound and freed Kaller from the Confederacy.\nThe day after Kleeve retreated from Kaller, Supreme Chancellor of the Republic, Sheev Palpatine, in front of the Galactic Senate, declared himself the Galactic Emperor of the galaxy, transformed the Republic into the First Galactic Empire and declared the Jedi enemies of the state; dispatching all clone troopers to execute them on sight. Kleeve abandoned the Confederacy as it dwindled out, its leaders were assassinated, and much of the rest of the Confederacy was absorbed into the Empire or formed into holdouts that rebelled against the Empire. Kleeve knew the new Empire would punish and execute him if he was identified as Separatist General Kleeve, so he took on a new life—over the next several months, he went into hiding on the Outer Rim ocean planet Lahn, changed his name to Jondo, and established himself as a crime boss who worked outside of the Empire's laws and regulations. He took up residence in a hut in a Lahn settlement, where he traded illegal goods, such as spice, an illicit drug that was in high-demand throughout the galaxy.\nMonths later, about a standard year since the end of the Clone Wars, Kleeve and Kalleran smuggler Janus Kasmir arranged a trade: stolen goods for stolen goods—Kleeve would give the Kalleran a starship, the Farbrooke's Hope, in exchange for a valuable shipment of spice. Kasmir's partner happened to be former Jedi Padawan Caleb Dume, and he came to Kleeve'e residence to ensure the deal was still on. Dume, under the impression that Kleeve was his alias of Jondo, was horrified when he instantly recognized Jondo as General Kleeve, therefore pulled his blaster pistol on him. Kleeve didn't recognize Dume, but due to Dume's hostility towards him, deduced that they had met during the Clone Wars, where they had been enemies. Kleeve explained that he had fought against the Republic in order to establish freedom in the galaxy, but he had put his faith on the wrong leadership and suffered for it when they had failed, adding that they both had put their trust in governments that ended up a much different entity than what they had signed on to protect and fight for. Dume holstered his weapon, prompting Kleeve to get to business and asked if the trade was a go. Dume was excited to learn that Kasmir had signed on for a ship, and raced out to thank Kasmir, who intended the Farbrooke's Hope to be Dume's. However, Dume soon returned with ill tidings: Kasmir had been arrested by Captain Grey, who was hunting Dume because he, as a Jedi, was an enemy of the Empire. Dume, on the basis of the \"enemy of my enemy is my friend\" convinced Kleeve to loan him the Farbrooke's Hope in order to rescue Kasmir, even though Kleeve wasn't going to receive anything from it.\nThe pair set out aboard a boat to a Lahn spaceport. On the journey, Kleeve remarked multiple times that he believed himself to be out of his mind in helping the Padawan and not receiving anything in return. The pair reached bay seventeen, where the ship was docked, however, Commander Styles, Grey's partner, tracked Dume to the spaceport and knocked him unconscious while a pair of other clone troopers detained Kleeve and put him on Stuncuffs. The clones, however, did not recognize Kleeve as a former Separatist general, so they released him along with Kasmir, and took Dume prisoner and to a Gozanti-class cruiser and traveled back to Kaller's star system. Kleeve and Kasmir quickly boarded their ships—Kleeve the Farbrooke's Hope, and Kasmir his Kasmiri—and jumped into pursuit of the cruiser.\nThe pair of ships emerged from hyperspace soon after, and near the Imperial cruiser. Dume, however, managed to eject himself from the cruiser's airlock using the Force and was sucked into the vacuum of space. Kasmir quickly pulled the Padawan into the Kasmiri and revived him. The cruiser raised its deflector shields and prepared to attack, so Kleeve and Kasmir did likewise in their vessels. Kleeve asked Kasmir why men such as them—criminals—were risking their lives for Dume, a child. Kasmir replied that he did not even pretend to understand that. Kleeve was relieved that it wasn't just him, and attacked the cruiser. Both pilots quickly learned, however, that they were hopelessly outmatched, so they began to retreat. Although, Dume ordered them to stay and fight. Kleeve and the Kalleran obeyed, even when both their vessel's shields fell to single digits. With little choice, the Devaronian and Kasmir followed Dume's instructions and looped around to strafe the Imperial ship. They opened fire and the cruiser unexpectedly exploded; killing all aboard. The two ships then landed on Kaller to regroup.\nKleeve examined the damage to the Farbrooke's Hope while Dume informed Kasmir that he had decided to leave his company and seek his own way in the galaxy. Kasmir was bewildered at the boy's decision, but let him go after Dume struck out and attacked him. Dume took only his lightsaber, his holocron, and the Farbrooke's Hope, which he renamed the Escape.\nOver the next fourteen years, Kleeve continued to work with Kasmir, basing their operations out of the Kasmiri. One day, while working on Lahn, Kasmir was noticeably late to their operation. While aboard the Kasmiri above the planet, Kleeve asked his partner to explain why, so Kasmir admitted he had helped \"some random kid\" by knocking out two stormtroopers who were about to catch him. When Kleeve asked who the individual had been, Kasmir revealed he did not know, making Kleeve question why he had felt the need to help. Referring to Dume, Kasmir guessed the young man had reminded him of someone the two of them used to know; unknown to Kleeve and Kasmir, the person the smuggler had saved was Ezra Bridger, the Jedi Padawan of Dume, who had taken on the name \"Kanan Jarrus.\"\nUnder General Grievous, Kleeve was a prominent Separatist leader. While he has commanded troops on the battlefield in numerous battles, his true talent is dealing with bounty hunters and mercenaries to achieve his goals in unconventional ways. Kleeve considered Grievous's obsession with the Jedi Order to be a distraction.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Devaronian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_military",
  "/wiki/Janus_Kasmir%27s_crew",
  "/wiki/General",
  "/wiki/Clone_Wars",
  "/wiki/Battle_droid",
  "/wiki/Planet",
  "/wiki/Kaller",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Depa_Billaba",
  "/wiki/Conquest_of_Kaller",
  "/wiki/Lahn",
  "/wiki/Padawan",
  "/wiki/Kanan_Jarrus",
  "/wiki/Janus_Kasmir",
  "/wiki/Clone_trooper",
  "/wiki/CC-10/994",
  "/wiki/Styles",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Kasmiri",
  "/wiki/Standard_year",
  "/wiki/Star_system",
  "/wiki/Separatist_Crisis",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Commander",
  "/wiki/Grievous",
  "/wiki/Bombing_at_the_Jedi_Temple",
  "/wiki/Imperial_Palace",
  "/wiki/Cad_Bane",
  "/wiki/Depa_Billaba%27s_second_battalion",
  "/wiki/Kardoa",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Kalleran",
  "/wiki/Gamut_Key",
  "/wiki/Jedi",
  "/wiki/Gamut_Key%27s_residence",
  "/wiki/Trooper",
  "/wiki/B1-series_battle_droid",
  "/wiki/Separatist_command_shuttle",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Senate",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Galactic_Empire",
  "/wiki/Jedi_Order",
  "/wiki/Order_66",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Separatist_holdouts",
  "/wiki/Ocean",
  "/wiki/Crime_lord",
  "/wiki/Spice",
  "/wiki/Smuggler",
  "/wiki/Escape",
  "/wiki/Blaster_pistol",
  "/wiki/Captain",
  "/wiki/Boat",
  "/wiki/Brain",
  "/wiki/Spaceport",
  "/wiki/Stuncuffs",
  "/wiki/Prisoner",
  "/wiki/Cruiser",
  "/wiki/Airlock",
  "/wiki/The_Force",
  "/wiki/Deflector_shield",
  "/wiki/Kanan_Jarrus%27_lightsaber",
  "/wiki/Kanan_Jarrus%27_holocron",
  "/wiki/Ezra_Bridger",
  "/wiki/Stormtrooper",
  "/wiki/Separatist",
  "/wiki/Bounty_hunter",
  "/wiki/Mercenary",
  "/wiki/Kanan_8",
  "/wiki/Kanan_9",
  "/wiki/Kanan_1",
  "/wiki/Kanan_4",
  "/wiki/Kanan_5",
  "/wiki/Kanan_12",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_92",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Tarkin_(novel)",
  "/wiki/Kanan_3",
  "/wiki/Star_Wars:_Kanan_Book_I:_The_Last_Padawan",
  "/wiki/Kanan_6"
 ]
}