{
 "name": "Kleyvits",
 "display_name": "Kleyvits",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Selonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selonian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Overden"
     ]
    }
   ]
  }
 ],
 "content": "Kleyvits was a sterile female Selonian of advanced age, with graying fur. She was a speaker for the Overden, the Selonian ruling body. She was shrewd, with an air of calm and reason, but was unusually crafty by Selonian standards.\nKleyvits was a diplomat and representative of her faction and sought to unify all of Selonia, including the renegade Hunchuzuc Den and its allies, under their banner of independence from the New Republic. The movement named itself the Absolutists and desired to rid the planet of non-Selonian influences.\nThe Overden concealed a terrible secret, however, that they had allied themselves with the Selonians of the Sacorrian Triad, a group of offworlders descended from a dishonored den exiled generations earlier. Such was the extent of their dishonor that they formed a new den under a new name, since the old name had become an obscenity. Kleyvits strove to conceal this in order to achieve consensus among all Selonians. Selonians as a race are honest, or are at least unacquainted with deceit and confused by it. Kleyvits was unable to lie about their alliance, and even her keeping it secret brought with it great dishonor.\nWhen Dracmus, acting as a Hunchuzuc Den representative, arrived on Selonia along with Han Solo, Leia Organa Solo, and Mara Jade, negotiations began in earnest between the Overden and its opponents. Each side sought to prove that its point of view was inevitable and guide the other side into falling in line. Kleyvits gained the upper hand: her faction was larger, possessed the planetary repulsor on Selonia, and their call for independence from the New Republic resonated better with the Selonian psyche.\nHan, Leia, and Mara were kept as captives and questioned for a time, but together they reasoned that the Overden must have had outside help to control the repulsor. During an interrogation, Han Solo asked Kleyvits who was operating the planetary repulsor on Selonia, and Kleyvits found herself in the uncomfortable position of being unable to answer. Dracmus seized upon the opportunity and demanded to know, and the balance of power tipped as Kleyvits, exposed as fraudulent, cowered and admitted that her allies were the Selonians of the Triad. From that point, the Overden and the Absolutists had lost their psychological edge, and the supporters of the New Republic ascended to power.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Selonia/Legends",
  "/wiki/Selonian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Overden",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Hunchuzuc_Den",
  "/wiki/New_Republic/Legends",
  "/wiki/Absolutists",
  "/wiki/Sacorrian_Triad",
  "/wiki/Dracmus",
  "/wiki/Planetary_repulsor",
  "/wiki/Showdown_at_Centerpoint",
  "/wiki/Cracken%27s_Threat_Dossier",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}