{
 "name": "Kleya_Marki",
 "display_name": "Kleya Marki",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Luthen Rael's network"
     ]
    }
   ]
  }
 ],
 "content": "Kleya Marki was a human female who served as a concierge at Luthen Rael's gallery of artifacts and antiquities in the upper levels of the galactic capital Coruscant. In 5 BBY, she, along with Rael, welcomed Chandrilan Senator Mon Mothma to the gallery, who visited to purchase a gift for her husband Perrin Fertha.\nKleya Marki was a human female who worked at Luthen Rael's gallery on Coruscant as a concierge, performing tasks such as assisting customers and restoring precious artifacts. In 5 BBY, Marki was present when Chandrilan Senator, Mon Mothma, came to the gallery looking for a gift for her husband, Perrin Fertha, for his Day of Days, a Chandrila custom.\nShe announced Mothma's arrival to Rael, highlighting the fact that she was accompanied by a new driver she hadn't seen before and probably thought was Chandrilan. As Mothma and Rael began to converse between the lines, Marki made sure to distract the senator's driver, Kloris, by asking him if anything in the gallery was of interest to him and recommending looking at some ancient coins. When Rael asked her to wrap Mothma's chosen gift, Marki walked to the counter with the artifact and left it with Rael as the senator departed from the gallery.\nMarki later met Vel Sartha, the leader of a rebel infiltration team assembled by Rael to steal an Imperial payroll on Aldhani, outside the Coruscant spaceport in the aftermath of the mission. She congratulated her on her success while acknowledging the losses, noting that she had personally recruited one of the team's members, the ex-stormtrooper Taramyn Barcona. Finally, she warned Sartha to be careful about sending messages and instructed her to track down Cassian Andor, who had been paid to join the team at the last minute. Sartha expressed hesitancy, but Marki told her that he had to be eliminated because he knew of Rael.\nKleya Marki had brown hair and tan skin. Marki was a true master of disguise, performing her duties as a concierge at Rael's gallery, but serving as an emissary, messenger, and enforcer for Rael's spy operation, with highly attenuated intuition and unflinching commitment to the rebel cause.\nKleya wore a gray tunic with a black trim over a white turtleneck top, complete with backcombed hair. At another point in that year, she wore a dark red hooded gown, complete with reddened lips and straight, flowing hair.\nKleya Marki first appeared in the fourth episode of the first season of the live-action series Andor, \"Aldhani\". She was portrayed by Elizabeth Dulau.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Luthen_Rael%27s_network",
  "/wiki/Luthen_Rael",
  "/wiki/Galactic_Antiquities_and_Objects_of_Interest",
  "/wiki/The_galaxy",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/5_BBY",
  "/wiki/Chandrilan",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/Perrin_Fertha",
  "/wiki/Marriage",
  "/wiki/Day_of_Days",
  "/wiki/Kloris",
  "/wiki/Coin",
  "/wiki/Vel_Sartha",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani",
  "/wiki/Coruscant_spaceport",
  "/wiki/Stormtrooper",
  "/wiki/Taramyn_Barcona",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Hair",
  "/wiki/Emissary",
  "/wiki/Clothing",
  "/wiki/Standard_year",
  "/wiki/Andor_Season_One",
  "/wiki/Andor_(television_series)",
  "/wiki/Aldhani_(episode)",
  "/wiki/Category:Images_of_Kleya_Marki",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/One_Way_Out",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}