{
 "name": "Kli_Sithrin",
 "display_name": "Kli Sithrin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Kli Sithrin was a male Zabrak Imperial who lived during the Galactic Civil War. Bren Kingal of Mos Taike sent a spacer to find him. Kingal knew of Sithrin's allegiance to the Empire, but in order to avoid a political disagreement, he fooled the spacer into believing that Sithrin was merely a thief. Sithrin, was in fact meeting with an Imperial Security Bureau official, but was killed by the spacer in the confusion.\nSometime following 0 BBY, Bren Kingal tasked a spacer with finding Kli Sithrin, and taking a medpac from him which he supposedly stole from a little girl. However, this was nothing more than a lie, designed to fool the spacer into confronting a member of the Empire. The spacer ended up killing Sithrin, who just prior had called out for Mangler to attack. Whether or not Mangler was the ISB official, or some other companion of his is unclear, as Sithrin ended up fighting the spacer on his own, before being slain.\nKli Sithrin was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Due to the nature of many older quests in Star Wars Galaxies, the species and appearance of Kli Sithrin changed each time a player performed this quest. The quest dialogue given by Bren Kingal indicated that Sithrin was a male, but there is some confusion regarding his species. In the quest dialogue, Kingal initially referred to Sithrin as a big Sullustan gangster. Yet, when the player accepted the quest, he then told the player to look for a tough Zabrak with orange skin and slashing tattoos. Kingal had a habit of lying perpetually during his quests, but this was more than likely an error by the developers. In the Star Wars Galaxies TRE files, Sithrin was consistently referred to as a Zabrak, instead of a Sullustan. Unlike the game, where Kingal initially referred to Sithrin as a big Sullustan, the TRE files have the identical dialogue, but with the word Zabrak substituting the word Sullustan. Furthermore, because Kingal went into much more detail describing Sithrin as a Zabrak , this article assumes that Sithrin was a Zabrak, and that the reference to him being a Sullustan was a typo. Furthermore, although not mentioned in the quest dialogue, examining Sithrin revealed him to be a sharpshooter. However, it should be noted that this was primarily due to game mechanics, as a result of Sithrin being placed under the randomized sharpshooter spawn template appearance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Orange",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bren_Kingal",
  "/wiki/Mos_Taike/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Kli_Sithrin",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Species/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Sniper/Legends"
 ]
}