{
 "name": "Klias_Teradine",
 "display_name": "Klias Teradine",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 241 BBY",
      "Mount Bikja"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zeltron"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Klias Teradine was a Zeltron male Padawan of the Jedi Order who lived during the High Republic Era. A proud and arrogant apprentice, Teradine trained alongside fellow Padawan Tylera under Jedi Master Cibaba on Alaris Prime. At some point during his apprenticeship, Teradine discovered the Bogan Collection of dark side artifacts. He later found the location of the Yallow Shrine on Mount Bikja and persuaded Tylera to explore it with him against the wishes of their Masters. There, Teradine was killed by Tylera in a lightsaber duel after he became affected by a Yellow vitalicron. While Tylera departed the Jedi, Teradine's fate was covered up as he vanished from Jedi history, with individuals in later generations thinking he might have been expelled from the Order.\nKlias Teradine was a Zeltron male who was a Padawan of the Jedi Order during the High Republic Era. He studied at a Jedi temple on Alaris Prime, where he was friends with the Tholothian Padawan Tylera. The two studied under the Azumel Jedi Master Cibaba, who lectured Teradine on his lack of humility. Teradine himself thought that the meek Tylera could stand to be more like him. At some point during his apprenticeship, Teradine discovered the Bogan Collection of dark side artifacts.\nAround 241 BBY, Teradine was sparring with Tylera when he told her she never changed and should be more like him. After she swept his leg and defeated him in the duel, he congratulated her and told her his brilliance appeared to be wearing off on her. Cibaba approached and pointedly asked Teradine if he remembered what he had been taught about Jedi humility, but Teradine responded with a quip that he was extremely good at it. Tylera, helping Teradine to his feet, said that he was joking, before quietly asking Teradine to tell Cibaba he was joking. Cibaba told Tylera not to worry as he was well aware of what Teradine thought of himself, before reminding her that she needed to follow her own path rather than emulating someone she was not.\nLater, Teradine discovered that a sanctum of the Yallow Fellowship, a group of long-dead users of the dark side of the Force, was located on Mount Bikja. Sneaking out of evening meditation with Tylera, Teradine showed her a hologram of the mountain and told her it was what they had been looking for. Tylera was concerned that going to Mount Bikja could get them expelled from the Jedi Order, but Teradine did not believe it was possible, having never heard of such a thing happening. He told her about the sanctum, and when Tylera expressed concern about the Fellowship's Force allegiance, Teradine glibly responded that that had been a long time ago, the Fellowship was all dead, and the shrine would be full of interesting stuff which it was their duty as Jedi to know about.\nTylera was still uncertain about going, saying that Master Cibaba would not approve, but Teradine countered that Cibaba did not need to know, and that he would have to go alone since Tylera was scared. This finally led Tylera to agree to come along, and she told Teradine he was a pain in the backside. He quipped that they both were before expressing the opinion that their expedition was going to be great. Tylera stopped Teradine from running into a passing Jedi in the corridor, and he commented that the encounter was close. His friend reminded him that that had been too close, becoming worried about what the Masters would do if the two Padawans were discovered to have snuck out of evening meditation. Teradine said they would not be caught, and pulled Tylera along, reminding her they had a mountain to climb.\nWhen Teradine and Tylera arrived at Mount Bikja, they climbed the mountain. Tylera lost her grip and nearly fell, but Teradine saved her life, demonstrating the ability to walk on a vertical surface. He revealed to Tylera that he had learned the Force power from the teachings of the Sabracci Sages, a group of Zeffo. The duo eventually reached the sanctum at the top of the mountain, and entered it after Teradine cut open an entry hole with his lightsaber.\nFollowing Teradine's death, Tylera left the Jedi Order, becoming a mercenary and monster hunter known as Ty Yorrick. Teradine vanished from Jedi history, with his true fate being covered up.\nA decade after leaving the Jedi, Yorrick remembered her training with Teradine when her admin unit KL-03 remarked that she never changed, something Teradine had told her. When the droid commented on Yorrick's reaction to the phrase, she merely said that Kayel had reminded her of someone. Yorrick was shortly reminded of her and Teradine's expedition to the Yallow Shrine when she went on a job to Loreth to kill a Gretalax that had been terrorizing local colonists, finding the shape of a local mountain to be similar to that of Mount Bikja.\nSeveral months later, during the Nihil attack on the Republic Fair at Valo, Yorrick made a reluctant team-up with Jedi Master Elzar Mann. The two shared some memories during a Force vision, and Mann saw both Teradine and Cibaba. Yorrick later remembered what had happened with Teradine at the Yallow Shrine sadly, before agreeing to work with the Jedi against Klerin Chekkat, a former client of hers.\nAfter the end of the High Republic Era, Teradine was remembered for his discovery, but believed to have been expelled from the Order, possibly for either stealing records from the Jedi Archives or having an affair with the Chancellor's aide. Regardless of what had actually transpired, Teradine afterwards vanished from Jedi history, although he was still remembered, with the Padawan Dooku later finding out about his existence.\nDuring his time in the Jedi Order, Teradine was remembered as being problematic. He was constantly testing the boundaries of his Masters and on more than one occasion brought the name of the Jedi Order into disrepute. When chided about humility by Master Cibaba, he responded that he was extremely good at it, drawing the Master's irritation.\nTeradine was a male Zeltron with pink skin and brown hair, as well as slightly pointed ears. He had jagged black markings on his forehead above his eyes.\nTeradine was skilled in lightsaber combat, usually besting Tylera when they sparred. His studies of esoteric Force sects meant he knew some unusual Force powers, such as the Sabracci Sages' ability to walk on vertical surfaces.\nTeradine wore brown and cream Jedi robes, and wielded a green-bladed lightsaber with a physical crossguard on the hilt.\nKlias Teradine was first mentioned in the 2019 canon audio drama Dooku: Jedi Lost, written by Cavan Scott. The spelling of his name was revealed in the script book of the audio drama.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/241_BBY",
  "/wiki/Mount_Bikja",
  "/wiki/Zeltron",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Padawan",
  "/wiki/High_Republic_Era",
  "/wiki/Ty_Yorrick",
  "/wiki/Jedi_Master",
  "/wiki/Cibaba",
  "/wiki/Alaris_Prime",
  "/wiki/Bogan_Collection",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Yallow_Shrine",
  "/wiki/Death",
  "/wiki/Lightsaber_duel",
  "/wiki/Vitalicron",
  "/wiki/Jedi",
  "/wiki/Jedi_temple",
  "/wiki/Tholothian",
  "/wiki/Azumel",
  "/wiki/Yallow_Fellowship",
  "/wiki/Meditation",
  "/wiki/Hologram",
  "/wiki/Mountain",
  "/wiki/The_Force",
  "/wiki/Time",
  "/wiki/Force_power",
  "/wiki/Sabracci_Sages",
  "/wiki/Zeffo_(species)",
  "/wiki/Lightsaber",
  "/wiki/Mercenary",
  "/wiki/Standard_decade",
  "/wiki/Admin_unit",
  "/wiki/KL-03",
  "/wiki/Loreth",
  "/wiki/Gretalax",
  "/wiki/Standard_month",
  "/wiki/Nihil",
  "/wiki/Attack_on_Valo",
  "/wiki/Republic_Fair",
  "/wiki/Valo",
  "/wiki/Elzar_Mann",
  "/wiki/Force_vision",
  "/wiki/Klerin_Chekkat",
  "/wiki/Jedi_Archives",
  "/wiki/Supreme_Chancellor",
  "/wiki/Dooku",
  "/wiki/Hair",
  "/wiki/Ear",
  "/wiki/Eye",
  "/wiki/Lightsaber_combat",
  "/wiki/Jedi_robes",
  "/wiki/2019",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Cavan_Scott",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_1",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_2",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_3",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_4",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/Category:Images_of_Klias_Teradine",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Battle_of_Grizal",
  "/wiki/231_BBY",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak"
 ]
}