{
 "name": "Klieri",
 "display_name": "Klieri",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Klieri was a female Human from the planet Coruscant who worked as an intelligence agent for the Galactic Republic. During the waning years of the Republic, while Klieri was in her twenties, Klieri and the Trandoshan intelligence operative Yrssk were dispatched to the planet Nyriaan to investigate the Deluge Experiment, an covert effort that the Corporate Sector Authority had initiated to flood Nyriaan and alter the world's climate. Operating from an apartment in the city Locus, Klieri spent several months gathering information on the Deluge Experiment. However, unbeknownst to her, Yrssk was secretly working for the CSA, and he fabricated some evidence to make it appear that Klieri was aiding the CSA. Eventually, the CSA decided to eliminate Klieri, and they sent an MRD-39B assassin droid to her apartment, to murder her. While Klieri was in her living room, the droid fired shots into her chest and abdomen with it's blaster, and with her last breaths, she crawled into her bedroom and died. The Republic subsequently sent a team of agents to Nyriaan to investigate Klieri's disappearance, and several days later they discovered her corpse inside her apartment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Yrssk",
  "/wiki/Nyriaan/Legends",
  "/wiki/Deluge_Experiment",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/City/Legends",
  "/wiki/Locus_(settlement)",
  "/wiki/MRD-39B_assassin_droid",
  "/wiki/Death/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/The_Perfect_Storm",
  "/wiki/Galaxy_of_Intrigue"
 ]
}