{
 "name": "Klik-Klak",
 "display_name": "Klik-Klak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Geonosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Klik-Klak's droid army"
     ]
    }
   ]
  }
 ],
 "content": "Klik-Klak was a male Geonosian who lived on Geonosis two years before the Battle of Yavin. The last of his kind, the Geonosian kept a Queen egg hidden under his protection in the hopes of resurrecting his species after the Galactic Empire brought the Geonosians to near-extinction after finishing the primary stage of construction of the Death Star in the planet's orbit.\nKlik-Klak had a home in the depths of an old Geonosian temple where he was able to build his own droid army from the resources left by the Confederacy of Independent Systems back from the Clone Wars. With the use of his droids, they were able to ambush anyone or anything that entered the Geonosian's lair. In 2 BBY, Klik-Klak ambushed Saw Gerrera and a team of his Partisans who had been sent by Rebel Command to investigate the disappearance of the Geonosian people. Believing they were threats, he killed all but Saw, who managed to escape.\nLater, Klik-Klak encountered members of the rebel cell Spectres who had been sent to find Saw. Following a brief skirmish and pursuit, the rebels and Saw managed to capture him. Despite their initial hostile encounter, the rebel Ezra Bridger managed to convince his comrades and Saw that Klik-Klak was no threat. Klik-Klak attempted to explain to the Rebels the existence of the Death Star but was unable to do so due to only being able to draw a circle within a circle. While exploring an underground air shaft, the rebels and Saw discovered evidence that the Empire had exterminated the Geonosians with chemical weapons. After allowing Klik-Klak to flee underground with the Queen egg, the rebels managed to escape an attack by an Arquitens-class command cruiser and flee offworld with news of the Imperial genocide against the Geonosians.\nKlik-Klak was the sole survivor of the Imperial sterilization of Geonosis. He became the custodian of a Geonosian queen's egg, which he kept in an underground nest near an air shaft. Klik-Klak also managed to rebuild and reprogram several B1-series battle droids and droidekas, which he used to guard his territory. Several of the droidekas were used to guard a military-grade Deflector shield generator on the surface. Klik-Klak also kept a transmitter inside his nest.\nIn 2 BBY, Klik-Klak came into conflict with the rebel Saw Gerrera and a team of his Partisans. Saw had been sent by Rebel Command to investigate the apparent disappearance of the Geonosian people. Believing Saw and his team to be hostile, Klik-Klak attacked and killed Saw's team. Saw survived and managed to hide in the underground labyrinth long enough until the Captain Rex and several members of the Spectres rebel cell arrived to find him and continue his mission. With the help of Saw, the Spectres Kanan Jarrus, Ezra Bridger, Chopper, and Rex managed to destroyed a unit of battle droids and droidekas that Klik-Klak had sent to ambush them.\nWhile exploring the central air shaft, the droid Chopper discovered Klik-Klak hiding on the other side. Believing that Klik-Klak held the answers as to what the Empire was building on Geonosis, the rebels and Saw pursued him through the mine. He also used a remote controller to activate the droidekas on the surface. These droidekas attacked the Spectres Sabine Wren and Garazeb Orrelios, who were extracting the deflector core from the shield generator. Chopper and Ezra attempted to corner him but Klik-Klak managed to fight off his pursuers. Following a prolonged struggle, Klik-Klak was cornered by Saw, Kanan, and Rex. Saw shot out his remote controller and demanded to know what the Empire was building on Geonosis.\nDue to Klik-Klak's role in the death of his comrades, Saw was harsh in questioning Klik-Klak. His harsh methods alarmed Ezra and his rebel comrades. Ezra managed to gain Klik-Klak's trust by reassuring him that they were not there to harm him. He also managed to convince Klik-Klak to share his name. Unable to pronounce Klik-Klak's name, Ezra nicknamed him Klik-Klak. When Ezra asked him what the Empire was doing on Geonosis, Klik-Klak drew two circles in the ground in reference to the Empire's planned space station known as the Death Star, however, none of the group understood the message, instead interpreting it as the rings of Geonosis and other objects. After Chopper picked up an energy reading, Saw forced Klik-Klak to lead them there. Not trusting the Geonosian, Saw handcuffed him with restraints.\nKlik-Klak reluctantly led the rebels into his nest. Klik-Klak protested when Saw began rummaging through his place for information on the Empire's activities. Saw's harsh methods alarmed Ezra, Kanan, and Rex. At Ezra's prompting, Klik-Klak revealed that he had been sheltering a Geonosian queen egg. After some discussion, the rebels and Saw reached an agreement which allowed Saw to take Klik-Klak off world for interrogation on the condition that they return him safely to Geonosis once they were finished with him. After restablishing contact with Hera, the rebels and Klik-Klak rendezvoused with the ship Ghost in the central air shaft. The Ghost's arrival coincided with the arrival of an Imperial light cruiser commanded by Captain Brunson.\nOnce aboard the Ghost, Saw broke his agreement with the Spectres and Rex and attempted to leave with Klik-Klak aboard the Phantom II. Saw also electrocuted Klik-Klak with an electro-shocker to force his cooperation. Saw's behavior sparked an argument with the Spectres and Rex. When Saw threatened to shoot the Geonosian queen egg in order to extract results from Klik-Klak, Ezra warned him that resorting to such behavior would make him no better than the Empire. The rebels and Saw later put aside their differences to fight off Brunson's boarding party of Jumptroopers. Pursued by the Imperial light cruiser, the rebels fled on the Ghost into the depths of Geonosis.\nAfter reaching the depths of the air shaft, Klik-Klak and the rebels disembarked. They soon discovered several poison canisters which the Empire had used to kill many Geonosians. Having learnt that the Empire had perpetrated genocide against the Geonosians to hide a secret project, Saw freed Klik-Klak and the egg. Despite his past animosity towards the Geonosians, Saw believed that the Geonosians deserved the right to rebuild like everyone else. Klik-Klak took the egg into the deepest depths of Geonosis while the rebels left Geonosis with visual evidence of the Imperial poison canisters.\nThe egg that Klik-Klak hid later hatched to become a Geonosian queen that called herself Karina by 0 ABY. After losing her womb she attached herself to a portable droid factory and started using it as a mechanical womb to produce B1 battle droids which she saw as her Geonosian children. In 0 ABY, the Sith Lord Darth Vader visited Geonosis and forcefully took the droid factory away from her.\nKlik-Klak was a male Geonosian who was accustomed to the dark conditions of Geonosis' underground labyrinths. He was capable of running for long distances and was a capable fighter, being able to defeat Ezra Bridger in a fistfight with ease. As a Geonosian, Klik-Klak only spoke Geonosian and had to draw symbols on the ground when trying to communicate with off-worlders who spoke Galactic Basic Standard. Following the sterilization of Geonosis, Klik-Klak became the custodian of a Geonosian queen egg, which was believed to be one of the last surviving eggs left on the planet. Due to his people's recent history, Klik-Klak was suspicious of armed strangers especially those who were armed with guns. While he was initially hostile to the Spectres, he warmed up after Ezra befriended him and defended him from Saw Gerrera's harsh interrogation methods.\nKlik-Klak, voiced by Matthew Wood, first appeared in \"Ghosts of Geonosis\", the twelfth and thirteenth episodes of the third season of Star Wars Rebels, which aired on January 7, 2017. Klik-Klak was created to show that a sympathetic Geonosian was possible. The production team looked to the 2009 film District 9 as inspiration.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Geonosian",
  "/wiki/Klikklak",
  "/wiki/Special:Upload",
  "/wiki/Geonosis",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Klik-Klak%27s_droid_army",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Queen",
  "/wiki/Egg",
  "/wiki/Species",
  "/wiki/Galactic_Empire",
  "/wiki/Sterilization_of_Geonosis",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Planet",
  "/wiki/Orbit",
  "/wiki/Droid",
  "/wiki/Army",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Clone_Wars",
  "/wiki/2_BBY",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Alliance_High_Command",
  "/wiki/Mission_to_investigate_Geonosis",
  "/wiki/Death",
  "/wiki/Spectres",
  "/wiki/Ezra_Bridger",
  "/wiki/Death_Star",
  "/wiki/Karina",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Klik-Klak%27s_nest",
  "/wiki/B1-series_battle_droid",
  "/wiki/Droideka",
  "/wiki/Deflector_shield_generator",
  "/wiki/Transmitter",
  "/wiki/Captain",
  "/wiki/Rex",
  "/wiki/Kanan_Jarrus",
  "/wiki/C1-10P",
  "/wiki/Sabine_Wren",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Space_station",
  "/wiki/Rings_of_Geonosis",
  "/wiki/Brunson%27s_Arquitens-class_command_cruiser",
  "/wiki/Brunson",
  "/wiki/Jumptrooper",
  "/wiki/0_ABY",
  "/wiki/Portable_droid_factory",
  "/wiki/Sith",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Anakin_Skywalker",
  "/wiki/Secret_mission_to_Geonosis",
  "/wiki/Geonosian_hive-mind",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Matthew_Wood",
  "/wiki/Ghosts_of_Geonosis",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/Star_Wars_Rebels",
  "/wiki/January_7",
  "/wiki/2017",
  "/wiki/2009",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Darth_Vader_(2015)_4"
 ]
}