{
 "name": "Klo_Merit",
 "display_name": "Klo Merit",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Equanus"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Drongar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Equani"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Slate gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Slate gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Confederacy of Independent Systems",
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Klo Merit was an Equani male from Equanus, who was a trained physician and, due to the empathic abilities possessed by all Equani, he was also a minder. Merit also helped Jos Vondar on Drongar as a physician pretending to be an ally of the Republic.\nSix months prior to the outbreak of the Clone Wars, Equanus was destroyed due to a Galactic Republic weapons test. Although Merit was one of a handful of Equani who were off-world at the time, he was deeply scarred by this incident.\nIt is unknown when Merit began to work as a double agent for both the Confederacy of Independent Systems and Black Sun, but it was likely not long after the outset of the Clone Wars. His motives for working with Black Sun, who knew him as Lens, are unknown; but his choice to work for the Confederacy, who knew him as Column, are rooted in his desire to make the Republic hurt as much as they hurt his people.\nAs a physician and minder, Merit secured employment in RMSU-7, on the remote world of Drongar. Drongar was prized solely for bota, a plant with astonishingly useful adaptogenic properties. Bota was why the Republic, the Confederacy, and Black Sun were all interested in Drongar.\nAs Column, Merit provided the Confederacy with excellent intelligence, the destruction of a bota transport, an explosion on the Medstar ship, and likely many other heinous acts in the name of the Confederacy.\nAs Lens, Merit provided Black Sun with surveillance of the Drongar operation, the locations of all the local bota fields and the murder of corrupt Republic quartermaster Filba the Hutt.\nEventually, the bota mutated into a useless weed and the Republic chose to leave Drongar. It was during this time that Jedi Padawan Barriss Offee realized that Merit was an enemy of the Republic. She told Chief Surgeon Jos Vondar, who confronted Merit, and killed him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Equanus",
  "/wiki/20_BBY/Legends",
  "/wiki/Drongar/Legends",
  "/wiki/Equani",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Minder_(occupation)",
  "/wiki/Jos_Vondar",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Republic_Mobile_Surgical_Unit_7",
  "/wiki/Bota",
  "/wiki/MedStar-class_frigate/Legends",
  "/wiki/Filba",
  "/wiki/Hutt/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Barriss_Offee/Legends",
  "/wiki/MedStar_I:_Battle_Surgeons",
  "/wiki/Star_Wars_Insider",
  "/wiki/MedStar:_Intermezzo",
  "/wiki/Star_Wars_Insider_83",
  "/wiki/MedStar_II:_Jedi_Healer",
  "/wiki/Coruscant_Nights_I:_Jedi_Twilight",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}