{
 "name": "Klossi_Anno",
 "display_name": "Klossi Anno",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chalacta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chalactan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Klossi Anno's master"
     ]
    }
   ]
  }
 ],
 "content": "Klossi Anno was a female Chalactan Padawan serving the Jedi Order and the Galactic Republic during the final years of the Republic. A commander within the Grand Army of the Republic, she survived the Clone Wars and the execution of Contingency Order 66, unlike her master, who died during the initial stages of the Great Jedi Purge.\nDiscovered to be Force-sensitive near birth on Chalacta, Klossi Anno was taken to the Coruscant Jedi Temple and inducted into the academy there. Studying the ways of the Force, Anno eventually graduated after years of study and was selected by a Jedi Master for one-on-one training. During her apprenticeship, the tensions between the Galactic Republic and the Confederacy of Independent Systems came to a breaking point resulting in the start of the Clone Wars. Reporting to the Jedi High Council, Anno was given the rank of Commander in the Grand Army of the Republic and leadership of clone troopers.\nAfter years of fighting, the war ended abruptly when the Republic's Supreme Chancellor disbanded the Jedi Order with the issuance of Contingency Order 66. When her clone troopers turned their blasters on her, Anno's master sacrificed herself so that Anno could flee. Making her way to Dellalt, Anno joined with nine other fugitive Jedi in hijacking an SX troop shuttle from the newly formed Galactic Empire. While they were pursued by a group of ARC-170s and a light cruiser, losing two of their company, Anno and the others escaped pursuit and were given sanctuary by the crew of the Drunk Dancer. In the company of smuggler Jula Shryne, the group was eventually joined by Master Roan Shryne and Padawan Olee Starstone. Given new hope by Starstone's enthusiasm and determination, Anno and her companions agreed to search for Grand Master Yoda on Kashyyyk. Giving Master Shryne her fallen master's lightsaber, the group headed out to meet their fate on the Wookiee homeworld.\nOnce there, Kashyyyk came under invasion by the Empire for housing Jedi. Led by Darth Vader, the Empire searched for the Jedi fugitives, eventually confronting them. Padawan Anno attacked the Sith Lord after he injured Jedi Knights Siadem Forte and Iwo Kulka, but the powerful cyborg merely sidestepped her, slashing her across the back with his lightsaber. Dragged away from the battle and taken offworld by the other surviving Jedi, Anno was able to recover and decided to sabotage the Empire in a less direct way. With the suggestions of her comrades, Anno planned to work on construction sites, or in an agricultural project, and intended to undo the Sith in more subtle ways than with a lightsaber.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chalacta/Legends",
  "/wiki/Chalactan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Klossi_Anno%27s_master",
  "/wiki/Padawan/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Death/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Dellalt/Legends",
  "/wiki/SX_troop_transport",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Aggressive_ReConnaissance-170_starfighter/Legends",
  "/wiki/Drunk_Dancer",
  "/wiki/Smuggler/Legends",
  "/wiki/Jula_Shryne",
  "/wiki/Roan_Shryne",
  "/wiki/Olee_Starstone",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Battle_of_Kashyyyk_(19_BBY)",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Siadem_Forte",
  "/wiki/Iwo_Kulka",
  "/wiki/Cyborg/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}