{
 "name": "Klysk",
 "display_name": "Klysk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Planet of the Red Nebula"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Red Nebula species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Red Nebula exiles"
     ]
    }
   ]
  }
 ],
 "content": "Klysk was a male spokesman who served a group of exiles from the Red Nebula. In 0 ABY, Klysk plotted to steal and destroy a pair of crimson jewels held in a temple in the Red Nebula. While the priests of the temple believed that the jewels protected their planet from destruction and thus held them in high regard, the exiles thought the jewels were abominations that prevented Cosmic Destiny from proceeding naturally and should be destroyed.\nThe exiles captured a number of smugglers and pirates, including Han Solo and Chewbacca, on the planet Terminus and forced them into service to steal the two crimson jewels from the temple in the Red Nebula. When the group arrived aboard the Nova Prince on the planet home to the temple, Solo and Chewbacca stole the jewels from the temple and brought them back to Klysk. Solo attempted to bargain with Klysk, but the exile had anticipated this and had persuaded the other mercenaries to turn on Solo, allowing Klysk to take the jewels and depart the planet, leaving Solo and his co-pilot seemingly stranded. However Solo had switched the jewels before he gave them to Klysk, keeping the genuine gems for himself. Thinking he had the originals, Klysk piloted the Nova Prince into the planet's sun, destroying all aboard.\nKlysk appeared in Star Wars  50, written by Archie Goodwin and released in 1981.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Planet_of_the_Red_Nebula",
  "/wiki/0_ABY/Legends",
  "/wiki/Red_Nebula_species",
  "/wiki/Gender/Legends",
  "/wiki/Red_Nebula_exiles",
  "/wiki/Red_Nebula/Legends",
  "/wiki/Great_Life_Jewels",
  "/wiki/Red_Nebula_temple",
  "/wiki/Priests_of_the_Red_Nebula",
  "/wiki/Cosmic_Destiny",
  "/wiki/Smuggler/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Terminus/Legends",
  "/wiki/Attack_on_the_Red_Nebula_temple",
  "/wiki/Nova_Prince",
  "/wiki/Mercenary/Legends",
  "/wiki/Sun_of_the_Planet_of_the_Red_Nebula",
  "/wiki/Star_Wars_(1977)_50",
  "/wiki/Archie_Goodwin",
  "/wiki/1981"
 ]
}