{
 "name": "Kneesaa",
 "display_name": "Kneesaa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree tribe",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kneesaa was an Ewok female who resided in Bright Tree Village on the Forest Moon of Endor. She was the daughter of the village chief, Chirpa, and she held the title of princess. In 4 ABY, Kneesaa participated in the Battle of Endor, helping the Rebel Alliance in their fight against the Galactic Empire. Kneesaa's bravery and leadership led to her succeed her father and become the village's first female chief.\nPrincess Kneesaa was a female Ewok warrior from the the forest moon of Endor. She was the daughter of Chirpa, chief of the Bright Tree Village tribe, and his wife Ra-Lee. Together with her friends Wicket W. Warrick, Teebo, Paploo, Weechee, and Widdle Warrick, she had an adventurous childhood.\nBy the year 4 ABY, the tyrannical Galactic Empire had set foot on Kneesaa's homeworld and established a shield generator complex to protect its newest weapon of mass destruction, the second Death Star, that was being built in orbit of the moon. Eventually, the Rebel Alliance against the Empire sent a strike team to Endor to destroy the shield generator, whose members befriended the Ewoks of Bright Tree Village and convinced them to join the fight so the Rebel Fleet could blow up the station and finally kill Emperor Palpatine while he was onboard. Princess Kneesaa participated in the ensuing Battle of Endor, helping rebel pathfinder Kes Dameron to coordinate complicated tactical maneuvers. They stayed with each other throughout the battle, communicating through verbal stresses and gestures. Instead of attending the post victory celebration, Kneesaa and Dameron toasted their success together with a bottle of sunberry wine.\nShortly after the victory, a gigantic, predatory Gorax ventured out into the grounds of the Bright tree tribe. The distressed princess Kneesaa and her friend Wicket enlisted the help of the Rebel heroes Jedi Knight and Commander Luke Skywalker and his sister who is also Wicket's friend General Leia Organa to reset the tribe's Gorax traps, ﻿which had been re-purposed for taking out the Imperial All Terrain Scout Transports during the Battle of Endor. Once they arrived at the location of the traps, the group immediately encountered the Gorax, and were forced to scatter. As the creature pushed Skywalker and Organa into a corner, Kneesaa and her friend managed to climb up a tree where one of the log traps was installed, and called Organa for help. Kneesaa threw the general her spear, which she used to cut a rope while Skywalker faced the giant, creating a diversion. Finally, Skywalker lured the Gorax right in front of the trap, and lend Organa his lightsaber. ﻿With the rope cut at last, the giant trunk swung into the predator, throwing it into a nearby swamp where it fell unsconscious. As Skywalker thanked Organa and retrieved his lightsaber, Princess Kneesaa and Wicket cheered, breaking into a happy dance.\n﻿In the immediate aftermath of the Battle of Endor, Kneesaa and Tokkat also befriended Chopper, an old astromech droid that belonged to the Skywalker twins' close friend Rebel general Hera Syndulla, and the Ewoks attempted to teach the droid how to use a spear. However, the training session was interrupted when Syndulla came to inform the droid that the comm/scan processor of her starship, the Ghost, had picked up a couple stray Imperial TIE fighters heading for the Ewoks' village. Because they did not have time to gather any more crew members, Syndulla thought that only she and Chopper would have to do. The droid, however, brought Princess Kneesaa and her Tokkat aboard without his owner's knowledge. Although the general was disatisfied at first, Kneesaa and the other Ewok did wonders handling the ship's turrets, despite their small stature. Having proved their mettle in Syndulla's eyes, Kneesaa and her friend chattered excitedly as the Ghost took them home.\nKneesaa's great bravery and leadership skills allowed her to succeed her father as chief of Bright Tree Village following the battle, becoming the tribe's first female chief.\nKneesaa first appeared in the 2015 non-canon video game Disney Infinity 3.0. She was later introduced in canon in the 2015 reference book Star Wars: Absolutely Everything You Need to Know. Kneesa made her first canon appearance in the second season of the animated micro-series Star Wars: Forces of Destiny, she was voiced by Shelby Young. Kneesaa was originally introduced in Star Wars Legends in the 1984 book How the Ewoks Saved the Trees: An Old Ewok Legend, written by James Howe.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kneesaa",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/R2-D2_is_LOST!",
  "/wiki/The_Kroolok",
  "/wiki/Endor",
  "/wiki/Ewok",
  "/wiki/Gender",
  "/wiki/Bright_Tree_tribe",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Bright_Tree_Village",
  "/wiki/Chief",
  "/wiki/Chirpa",
  "/wiki/Prince",
  "/wiki/4_ABY",
  "/wiki/Battle_of_Endor",
  "/wiki/Galactic_Empire",
  "/wiki/Forest",
  "/wiki/Moon",
  "/wiki/Marriage",
  "/wiki/Ra-Lee",
  "/wiki/Wicket_Wystri_Warrick",
  "/wiki/Teebo",
  "/wiki/Paploo",
  "/wiki/Weechee_(Ewok)",
  "/wiki/Widdle_Warrick",
  "/wiki/Youngling",
  "/wiki/Standard_year",
  "/wiki/Homeworld",
  "/wiki/Deflector_shield_generator",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Endor_strike_team",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/Kes_Dameron",
  "/wiki/Sign_language",
  "/wiki/Toast_(ritual)",
  "/wiki/Sunberry_wine",
  "/wiki/Gorax",
  "/wiki/Jedi_Knight",
  "/wiki/Commander",
  "/wiki/Luke_Skywalker",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Spear",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Swamp",
  "/wiki/Tokkat",
  "/wiki/C1-10P",
  "/wiki/Astromech_droid",
  "/wiki/Hera_Syndulla",
  "/wiki/Droid",
  "/wiki/Comm/scan_processor",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/2015",
  "/wiki/Video_game",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Forces_of_Destiny:_Season_Two",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Shelby_Young",
  "/wiki/Star_Wars_Legends",
  "/wiki/1984",
  "/wiki/How_the_Ewoks_Saved_the_Trees:_An_Old_Ewok_Legend",
  "/wiki/James_Howe",
  "/wiki/Life_Day_Treasury",
  "/wiki/Traps_and_Tribulations",
  "/wiki/Chopper_and_Friends",
  "/wiki/Star_Wars:_Hunters",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/Category:Images_of_Kneesaa_a_Jari_Kintaka",
  "/wiki/Star_Wars_Insider",
  "/wiki/Looking_for_Leia",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Chewbacca_and_Other_Aliens_of_the_Rebellion_and_the_Resistance",
  "/wiki/Princess_Leia_Organa",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/File:Shelby_young.png"
 ]
}