{
 "name": "Kni",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Teal"
     ]
    }
   ]
  }
 ],
 "content": "Kni was a Duros male who lived during the Jedi Civil War between the Galactic Republic and the Sith Empire. During the war, the Sith bombed Kni's homeworld. He was one of the few who escaped the destruction, and by 3956 BBY, Kni had taken up residence at the Jedi Enclave on the Outer Rim world of Dantooine.\nKni was a Duros male who lived during the Jedi Civil War between the Galactic Republic and the Sith Empire. During the conflict, the Sith bombed Kni's homeworld. The attack decimated the landmasses and boiled the oceans of the world, killing the population on its surface. Kni fled when the Sith fleet arrived and narrowly survived the attack, becoming a refugee. He eventually found his way to the agrarian Outer Rim planet of Dantooine, reaching a secret Jedi Enclave where the Jedi allowed him to take up residency.\nIn 3956 BBY, he was approached in the Enclave's courtyard by former Dark Lord of the Sith Revan, who had lost his memories and was retraining as a Jedi. While talking about his own past as a refugee, Kni recognized Revan as a Jedi and thanked him and the Enclave's Council for allowing him to stay. They spoke about the ongoing war, with Kni explaining how he felt about both sides in the conflict.\nKni was a Duros male who had red eyes and teal skin. He was grateful to the Jedi Order for allowing him the reside at the Enclave. Kni was capable of understanding Basic, but he spoke in Durese with peculiar grammar, ending many statements as if they were questions and appending \"yes\" to many of them.\nWhile living on Dantooine, Kni wore a white-and-mauve tunic, mauve pants, green-and-white boots, and a utility belt. Due to his time spent fleeing, he had very few material possessions.\nKni appeared as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic, developed by BioWare. Interactions with him are optional and have no affect on the plot, quests, or the player's alignment.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Sith/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/3956_BBY",
  "/wiki/Jedi_Enclave",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Temperature/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith_armada_(Jedi_Civil_War)",
  "/wiki/Refugee/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Amnesia/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Dantooine_Jedi_Enclave_Council",
  "/wiki/Eye/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Durese/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Time/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/The_Essential_Atlas"
 ]
}