{
 "name": "Knire Dark",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Syboona"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Violet"
     ]
    }
   ]
  }
 ],
 "content": "Knire Dark was a Syboona female smuggler and Podracer pilot. Dark was active during the final decades of the Galactic Republic, during which she used the sport of Podracing as a front for her illegal smuggling activities around 24 BBY. Although it was merely a ploy, she held enough racing skill with her Serabyss Howler 1165 to promote herself as the track favorite for the Ballast Complex racetrack on the watery planet of Mon Calamari, despite her lack of any actual speed records for the course. Her smuggling career was later uprooted by 22 BBY when Republic authorities raided a contraband storehouse of hers.\nA Syboona female, Knire Dark worked primarily as a smuggler during the year 24 BBY, during the final decades of the Galactic Republic. To avoid Republic authorities, Dark purchased a Serabyss Howler 1165 Podracer and entered the current Podracing season, using the sport as a front to transport her contraband. She entered herself into the Podracing Open tournament, a series of four courses on the Outer Rim. She also raced a few of the courses from the more aggressive Hutt Championships. However, even with her pilot disguise, Dark was commonly on edge when visiting any world that hosted Republic officials, and her nervousness was clear on the track: She did her best to avoid conflict with the other pilots and often stayed behind the pack, searching for the hidden paths that would allow her to escape notice. Yet if threatened, she would defend her position.\nAt some point, Dark managed to knock a competitor out of a race on the course known as the Ballast Complex, located on the water world of Mon Calamari. Dark eventually became the Ballast Complex's track favorite, even though she did not hold any official speed records for the course. She was third on the chart for total knockouts on the track, however, standing with one total knockout.\nEven though Podracing was only a front, Dark's abilities on the track were nonetheless improving, as she topped the best lap and best three lap race speed records on the course known as The Brightlands, located on the Twi'lek homeworld of Ryloth, with speed records of 00:52.65 and 02:59.38 minutes, respectively. She also became increasingly aggressive, achieving the third position for most knockouts on the track known as the Ruins of Carnuss Gorgull, located on the jungle planet Gamorr, and on the Mon Calamari course Grand Reefs, with a total of two knockouts and one knockout, respectively. She garnered further success on Gamorr during the Citadel course, reaching the second top position for best lap. Returning to Ryloth, she scored the second top positions for the course Nightlands for both best lap and best race, with a time of 01:17.38 and 03:47.78 minutes, respectively.\nDespite her collection of achievements, her blooming Podracing career was not to last. By 22 BBY, Republic authorities had finally caught up to her contraband trafficking and raided a storehouse that the Syboona owned. The authorities uncovered hundreds of kilos of contraband, and the bust was one of several Podrace-related scandals that put the sport's future in question.\nKnire Dark was a paranoid individual, on the constant lookout for anyone who wanted to end her smuggling operation. However, despite this fear of capture, she opted to hide herself in plain sight by entering the dangerous world of high-speed Podracing. She developed a nervous quirk on the track when she tried to avoid contact with other racers, although she defended her position when necessary. Her occasional aggressiveness compelled her to knock other pilots out of a race instead.\nDespite being new to the sport by 24 BBY, her career and abilities developed side-by-side, turning her into a formidable competitor. Dark had violet skin and orange eyes. Her arms had more of a blue skin tone than the rest of her body.\nAs a pilot, Knire Dark showed notable skill on the Podracing courses, racking up both speed and knockout records during her career thanks to her keen reflexes and agility, which allowed her to successfully traverse the hazardous obstacles and terrain that professional Podracing courses often presented. She was also able to maintain a smuggling operation for at least two years without being detected.\nKnire Dark favored a Serabyss Howler 1165 Podracer for her brief racing career. The large craft was rather durable and could sustain moderate damage. Upgrades would only make it hardier. Dark's Howler was uniformly green in color, though lighter, yellow-green symbols were emblazoned onto the engine housings. More symbols of the same color existed on the cockpit's fin, which jutted out from the bottom of the cockpit. The upholstery of the cockpit's chair was brown with a faint green hue. The rear of the engines displayed alternating green and white stripes. Her victory purses could have been used to purchase parts from the Toydarian junk dealer Watto, which would have upgraded her Podracer into a more formidable machine.\nKnire Dark first appeared in the PlayStation 2 video game Star Wars: Racer Revenge as one of twenty-three playable characters. The game was developed from a partnership between LucasArts and Rainbow Studios and was released in February 2002. Her voice was provided by Nick Jameson, who also voiced another racer, Aldar Beedo. Players could play as Dark after placing above her or knocking her out of the Ballast Complex track.\nThe character's species and some of her backstory were fleshed out in the game's companion guide, Star Wars: Racer Revenge: Prima's Official Strategy Guide, which was published alongside the game. In-game, the race announcer Dax Gazaway incorrectly refers to Knire Dark with masculine pronouns such as \"his.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Syboona_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:Knire_Dark_Introduction.ogg",
  "/wiki/Smuggler/Legends",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sports",
  "/wiki/Podracing/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Serabyss_Howler_1165",
  "/wiki/Ballast_Complex",
  "/wiki/Water/Legends",
  "/wiki/Dac",
  "/wiki/22_BBY/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Knire_Dark%27s_contraband_storehouse",
  "/wiki/Dax_Gazaway",
  "/wiki/File:Dax_Gaz_Ballast_Complex_City_Safety.ogg",
  "/wiki/Standard_year/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Podracing_Open",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Hutt_Championships",
  "/wiki/File:Knire_Dark_Goes_Down.ogg",
  "/wiki/The_Brightlands",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Ruins_of_Carnuss_Gorgull",
  "/wiki/Gamorr/Legends",
  "/wiki/Grand_Reefs",
  "/wiki/Citadel_(Gamorr)",
  "/wiki/Nightlands/Legends",
  "/wiki/Time/Legends",
  "/wiki/Kilogram/Legends",
  "/wiki/HoloNet_News_Vol._531_49",
  "/wiki/File:Knire_Dark_Winning.ogg",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Eye/Legends",
  "/wiki/Limb/Legends",
  "/wiki/File:Poor_Knire_Dark.ogg",
  "/wiki/File:Knire_Dark_Should_Repair.ogg",
  "/wiki/Toydarian/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Watto/Legends",
  "/wiki/File:Knire_Dark_Taking_Lumps.ogg",
  "/wiki/PlayStation_2",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Racer_Revenge",
  "/wiki/LucasArts",
  "/wiki/Rainbow_Studios",
  "/wiki/February",
  "/wiki/2002",
  "/wiki/Nick_Jameson",
  "/wiki/Aldar_Beedo/Legends",
  "/wiki/Species/Legends",
  "/wiki/Star_Wars:_Racer_Revenge:_Prima%27s_Official_Strategy_Guide",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Category:Audio_files_of_Knire_Dark",
  "/wiki/The_New_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/32_BBY/Legends",
  "/wiki/Great_ReSynchronization",
  "/wiki/Template:YearMathGRS"
 ]
}