{
 "name": "Knol_Ven%27nari",
 "display_name": "Knol Ven'nari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "21.7 BBY",
      "Queyta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Knol Ven'nari was a Bothan female Jedi Master who lived during the final decades of the Galactic Republic. During her time as a Jedi, Ven'nari saved all of Bothan space by repelling Wookiee bandits. She was nicknamed the Fire Eater by her fellow Bothans for her ability to manipulate fire with the Force. Ven'nari eventually was elevated to the rank of Master, although she refused to take a Padawan. Instead, she chose to wander the galaxy and go wherever the Force guided her, and rarely visited the Jedi Temple on the galactic capital Coruscant. Ven'nari grew to be regarded as a legend of the Jedi Order. Four months after the initiation of the Clone Wars, Ven'nari accompanied fellow Jedi Masters Jon Antilles, Nico Diath, Fay, and Jedi Knight Obi-Wan Kenobi on a mission to the planet Queyta.\nVen'nari and the team were assigned to infiltrate a mobile Separatist facility that rode on one of Queyta's lava streams, and acquire a sample of the antidote for swamp gas, which the Separatists planned to use against the Grand Army of the Republic's clone troopers. Shortly after Ven'nari and the other Jedi infiltrated the base, they confronted the Separatist agents Asajj Ventress and Durge. Durge shot two Skakoan sentries, which caused them to explode, and Ven'nari used the Force to draw the fire toward her. Ven'nari died shortly afterward due to the extensive burns on her body. Of all the Jedi, only Kenobi survived the mission, successfully recovering the antidote, and returning to the Jedi Temple. A holographic memorial was held at the Jedi Temple in honor of Ven'nari and the other Masters.\nKnol Ven'nari, a Bothan female, was born during the final decades of the Galactic Republic. She was taken in by the Jedi Order and trained in the ways of the Force, eventually achieving the rank of Jedi Master. Ven'nari refused to train a Padawan, however, choosing instead to roam the galaxy and go wherever the Force guided her. During her time as a Jedi, Ven'nari fought Wookiee bandits in order to save Bothan space. Her fellow Bothans nicknamed the Jedi Master \"Fire Eater\" for her ability to manipulate fire by using the Force. She rarely visited the Jedi Temple on the galactic capital of Coruscant. By the time of the initiation of the Clone Wars, which was the Galactic Republic's war with the Confederacy of Independent Systems, Ven'nari was regarded as one of the legends of the Jedi Order.\nFour months into the Clone Wars, Ven'nari traveled to the planet Queyta and met with Jedi Masters Jon Antilles, Nico Diath, and Fay in order to recover a sample of the antidote for the Separatists' chemical weapon known as swamp gas. The Separatists had successfully tested the airborne gas against the Gungan colony on Ohma-D'un, a moon of the planet Naboo. After this, the Separatists planned on using it against the clone troopers who served the Grand Army of the Republic. When Jedi Knight Obi-Wan Kenobi rendezvoused with the Jedi Masters, Ven'nari expressed her impatience to Kenobi regarding his arrival. She also questioned Antilles's involvement in the mission due to the fact that he was not assigned to their team. After conversing with Antilles, Ven'nari and the Masters successfully infiltrated the mobile Separatist base, which was located on a small island moving through the planet's lava stream. Once the Jedi were inside, both Ven'nari and Diath noted that the base was not guarded by battle droids. The Bothan remarked that the facility was manned and determined that the guards would be easy to deal with. However, Antilles noted that the guards were Skakoans—a species that breathed methane and was forced to wear pressurized armor—and that attacking them with a lightsaber would cause them to explode. Kenobi accessed the facility's schematics and located the laboratory housing the antidote.\nVen'nari and the Jedi confronted the Dark Jedi Asajj Ventress and the Gen'Dai bounty hunter Durge, who notified the team of Jedi that their spies had already informed them of the group's presence in the facility. As Durge shot two of the Skakoans, Ven'nari implored Antilles, Diath, Fay, and Kenobi to stand aside. When the Skakoans exploded, Ven'nari used her pyrokinetic abilities with the Force to pull the fire toward her. After the fire subsided, Diath and the team found Ven'nari with extensive burns, and she told Diath that she was about to die. Diath used the Force to ease Ven'nari's suffering as she passed away. After her death, Diath, Antilles, and Fay were also killed. However, Kenobi successfully recovered the antidote and returned to the Jedi Temple on Coruscant. Shortly after Kenobi recovered from his wounds, the Jedi held a holographic memorial service in honor of Ven'nari and the other deceased Jedi.\nThe Bothan female Knol Ven'nari wore a set of brown Jedi robes and owned a lightsaber containing a green crystal. She was regarded as one of the nomads of the Jedi Order, rarely visiting the Jedi Temple on Coruscant. Nevertheless, she still fought for peace and freedom in the galaxy. Even after being promoted to the rank of Master, Ven'nari refused to take a Padawan. She was resentful of Jedi stationed on Coruscant, and was eager to complete the mission on Queyta so that she could then attend to business elsewhere. She also openly questioned Jon Antilles's involvement in the mission, going so far as to call him a drifter. Ven'nari was willing to sacrifice herself to ensure the safety of her fellow Jedi.\nVen'nari was skilled enough to achieve the rank of Jedi Master. She was capable of using the Force to manipulate fire, which earned her the nickname \"Fire Eater.\" During the mission to Queyta, Ven'nari also demonstrated her ability with Force flight, using this to infiltrate the Separatist facility.\nKnol Ven'nari was created by W. Haden Blackman for the standalone comic Blast Radius, the fifty-third issue of the Star Wars: Republic comic series. She was drawn in the issue by Brian Ching. Ven'nari—along with Jon Antilles, Dace Diath, and Fay—was indirectly mentioned in The New Essential Chronology's entry on the mission to Queyta. She was also mentioned in The Official Star Wars Fact File 111 and later received an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/22_BBY/Legends",
  "/wiki/Queyta/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Jedi/Legends",
  "/wiki/Bothan_sector",
  "/wiki/Wookiee/Legends",
  "/wiki/Pyrokinesis",
  "/wiki/The_Force/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jon_Antilles",
  "/wiki/Nico_Diath",
  "/wiki/Fay",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Mission_to_Queyta",
  "/wiki/Planet/Legends",
  "/wiki/Separatist_Queyta_base",
  "/wiki/Magma/Legends",
  "/wiki/Swamp_gas",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Durge/Legends",
  "/wiki/Skakoan/Legends",
  "/wiki/Death/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Bioweapon/Legends",
  "/wiki/Battle_of_Ohma-D%27un",
  "/wiki/Gungan/Legends",
  "/wiki/Ohma-D%27un/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Species/Legends",
  "/wiki/Methane/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Laboratory/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Gen%27Dai",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Lightsaber_crystal",
  "/wiki/Telekinesis/Legends",
  "/wiki/W._Haden_Blackman",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Republic_53",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Brian_Ching",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Official_Star_Wars_Fact_File_111",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Category:Images_of_Knol_Ven%27nari",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_102",
  "/wiki/The_Official_Star_Wars_Fact_File_118",
  "/wiki/The_Official_Star_Wars_Fact_File_128",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Republic_51"
 ]
}