{
 "name": "Knox",
 "display_name": "Knox",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Devaron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red-black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple with green markings"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Halsey's unit",
      "Halsey's unit"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Halsey"
     ]
    }
   ]
  }
 ],
 "content": "Knox was a male Nautolan Jedi Padawan who was the apprentice of Jedi Master Halsey during the Clone Wars. Alongside his master, he partook in the Republic defense of the Temple of Eedit, on the planet of Devaron. The two were initially successful in defeating the Separatist battle droid forces, but were made quick work of when Savage Opress entered the battle. Knox and his master Halsey were both killed by Opress, ending the skirmish.\nAt least one year into the Clone Wars, Knox and his master Halsey, along with several clone troopers were stationed at the Temple of Eedit on the planet Devaron which at the time was being used as a Galactic Republic base. The Separatist Droid Army sought control of the base, and so the two Jedi were there to protect it. As the battle began, Knox and Halsey made short work of the incoming battle droids, however, the tide of the battle was turned when Savage Opress, Count Dooku's newly appointed apprentice was deployed in order to assist the failing droids in the battle. Halsey ordered Knox to stay back as he ran to engage Savage by himself, but he proved no match for the Zabrak and was subsequently killed. Knox, witnessing his master's death, charged towards Opress seeking revenge, but the much stronger warrior swiftly threw him headfirst into the door of the temple, ending his life.\nShortly after the massacre, hologram footage of the battle surfaced and Delta Squad, an elite squad of Clone commandos, were sent out in order to retrieve the two fallen Jedi's bodies. Their mission was a success and the group subsequently arrived back on Coruscant to return them. They were greeted by Obi-Wan Kenobi, Adi Gallia, Plo Koon, and Saesee Tiin who concluded that the massacre was a sign of a new major threat to the Republic.\nNear to the end of the Clone Wars, Grand Master Yoda traveled to the Wellspring of Life in order to seek the answers to immortality. Soon after he arrived, he was greeted by beings known as Force Priestesses who put him through difficult trials to test him. During the final trial on the Sith homeworld of Moraband, Yoda faced a vision of a peaceful Jedi Temple where the Clone Wars never occurred. Many fallen Jedi were present such as Knox, which lead Yoda to realize that it was a vision, causing him to wake up. Yoda was told by the Priestesses that he still had more test to overcome. Knox later appeared in a dream to Luke Skywalker during his mission to Devaron.\nKnox had brown eyes and purple purple skin.\nKnox wore classic Jedi apparel and boots and wielded a blue lightsaber.\nKnox's body re-used Bolla Ropal's geometry, but updated with newly textured finishes. Knox was voiced by Dee Bradley Baker in the Star Wars: The Clone Wars episode Monster.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Knox",
  "/wiki/Knox/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/20_BBY",
  "/wiki/Devaron",
  "/wiki/Nautolan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Halsey%27s_unit",
  "/wiki/Halsey",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Jedi_Master",
  "/wiki/Clone_Wars",
  "/wiki/Temple_of_Eedit",
  "/wiki/Planet",
  "/wiki/Battle_droid",
  "/wiki/Death",
  "/wiki/Savage_Opress",
  "/wiki/Standard_year",
  "/wiki/Clone_trooper",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Devaron_massacre",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Sith_apprentice",
  "/wiki/Droid",
  "/wiki/Zabrak",
  "/wiki/Jedi_temple",
  "/wiki/Hologram",
  "/wiki/Delta_Squad",
  "/wiki/Squad",
  "/wiki/Clone_commando",
  "/wiki/Coruscant",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Adi_Gallia",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Wellspring_of_Life",
  "/wiki/Immortality",
  "/wiki/Force_Priestesses",
  "/wiki/Sith",
  "/wiki/Homeworld",
  "/wiki/Moraband",
  "/wiki/Force_vision",
  "/wiki/Imperial_Palace",
  "/wiki/Dream",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi_apparel",
  "/wiki/Boot",
  "/wiki/Bolla_Ropal",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Monster",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Destiny_(episode)",
  "/wiki/Obi-Wan_4",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure_(audiobook)",
  "/wiki/The_Weapon_of_a_Jedi,_Part_2",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}