{
 "name": "Ko Solok",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 20 BBY",
      "Pleem's Nexus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ko Solok was a Gran male Jedi Master who served the Jedi Order and the Galactic Republic during the Clone Wars. Around the year 20 BBY, Solok was selected to be part of a Jedi task force sent to hunt down the Sith Lord brothers Darth Maul and Savage Opress. The team tracked its targets to the planet Yellowblade's Landing, where the Jedi fought the duo but failed to capture them, losing Master Grohto in the process. Solok then accompanied Masters Bruu Jun-Fan and Plo Koon to the planet Pleem's Nexus, where they engaged the Sith again. Maul killed both Solok and Jun-Fan in the resulting fight, after which both Sith escaped.\nA Force-sensitive Gran male, Ko Solok was trained in the ways of the Force by the Jedi Order during the final decades of the Galactic Republic. By approximately 20 BBY, during the Clone Wars—fought between the Republic and the Confederacy of Independent Systems—Solok had achieved the rank of Jedi Master. When the Dathomirian Zabrak Sith Lord Darth Maul resurfaced during the conflict, Solok was selected by Master Plo Koon to be part of a Jedi task force to hunt down Maul and his Sith brother, Savage Opress. Aside from Koon and Solok, the group included Masters Grohto, Obi-Wan Kenobi, and Bruu Jun-Fan, as well as the latter's Padawan, Tatsu, and a group of clone troopers led by Clone Captain Mojo.\nThe team first took a Consular-class cruiser to the planet Yellowblade's Landing based on data from several informants, who claimed the Sith were there. Solok and the others traveled to the planetary surface in a T-6 shuttle, and once there, they found the aftermath of the Sith's visit: the brothers' abandoned Turtle Tanker freighter and a cantina full of corpses. The bodies belonged to members of the Scourge criminal organization, and after sighting them, Koon ordered Solok and Grohto to organize a search of the surrounding settlement. The Jedi and clone troopers made their way to a cave that housed the local Scourge base, where they suspected Maul was hiding based on Jun-Fan's psychometric analysis of a blaster from the cantina massacre.\nOnce at the base, Kenobi ordered Solok, Grohto, and Tatsu to remain in a chamber near the entrance to prevent the Sith brothers from escaping. The trio waited there while Kenobi and the others headed deeper into the base, where they located Maul and Opress but were attacked by wampas that the Sith had released from cages within the base. Maul, having evaded the other Jedi while they were distracted by the wampas, attacked Solok and his two companions. The Zabrak entered the chamber by leaping through a window and kicking Solok, after which he killed Grohto and injured Tatsu and Kenobi. Incapacitating the Jedi allowed the Sith brothers to escape aboard one of the Scourge's ships with a hostage, whom they had found incarcerated in the base. Koon and Jun-Fan analyzed a piece of jewelry that the brothers' hostage had dropped and discovered that the Sith's destination was the planet Pleem's Nexus, where the hostage lived.\nLeaving their injured behind, Solok, Jun-Fan, and Koon flew to Pleem's Nexus. There they found Maul and Opress trying to load their vessel with a large haul of gold—which, unbeknownst to the Jedi, the brothers hoped to use to fund a criminal empire. The Jedi immediately engaged Maul and Opress in combat, and during the ensuing fight, Solok was killed when Maul threw his lightsaber through his chest. Jun-Fan and several clone troopers also perished, while Koon was incapacitated, allowing Maul and Opress to escape from the planet.\nSolok had red eyes and pink skin. He was skilled enough to reach the rank of Jedi Master, but he was outmatched in combat on two occasions by the Sith Darth Maul and died in the second case.\nSolok used a green-bladed lightsaber in combat. He wore green cold-weather gear on Yellowblade's Landing and green Jedi robes on Pleem's Nexus.\nKo Solok first appeared in The Clone Wars: The Sith Hunters, a 2012 comic book that was written by Henry Gilroy and Steven Melching and illustrated by Vicenç Villagrasa.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/20_BBY/Legends",
  "/wiki/Pleem%27s_Nexus",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Unidentified_task_force_(Plo_Koon)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Savage_Opress/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Yellowblade%27s_Landing",
  "/wiki/Jedi/Legends",
  "/wiki/Skirmish_on_Yellowblade%27s_Landing",
  "/wiki/Death/Legends",
  "/wiki/Grohto",
  "/wiki/Bruu_Jun-Fan",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Skirmish_on_Pleem%27s_Nexus",
  "/wiki/Sith/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Dathomirian/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Tatsu",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/Mojo",
  "/wiki/Consular-class_cruiser_(Charger_c70_retrofit)/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/T-6_shuttle/Legends",
  "/wiki/Unidentified_Turtle_Tanker",
  "/wiki/Freighter/Legends",
  "/wiki/Unidentified_cantina_(Yellowblade%27s_Landing)",
  "/wiki/The_Scourge",
  "/wiki/Unidentified_Yellowblade%27s_Landing_settlement",
  "/wiki/Cloning/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Cave/Legends",
  "/wiki/Unidentified_Scourge_base",
  "/wiki/Psychometry/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Massacre_on_Yellowblade%27s_Landing",
  "/wiki/Wampa/Legends",
  "/wiki/Window/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Esano%27s_sister",
  "/wiki/Prison/Legends",
  "/wiki/Gold/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Darth_Maul%27s_lightsaber",
  "/wiki/Troop/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/The_Clone_Wars:_The_Sith_Hunters",
  "/wiki/2012",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Henry_Gilroy",
  "/wiki/Steven_Melching",
  "/wiki/Vicen%C3%A7_Villagrasa",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_23",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Time/Legends",
  "/wiki/Darth_Maul%E2%80%94Death_Sentence_1"
 ]
}