{
 "name": "Ko_Vakier",
 "display_name": "Ko Vakier",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Kestavel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Blood Carver"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Uhumele"
     ]
    }
   ]
  }
 ],
 "content": "Ko Vakier was a male Blood Carver who served as a member of the crew of the Uhumele.\nIn 19 BBY, he aided Jedi General Dass Jennir escape from New Plympto during the Great Jedi Purge. While escaping New Plympto Ko Vakier used the Uhumele's turret to destroy one of two pursuing Aggressive ReConnaissance-170 starfighters, the remaining starfighter almost destroyed him if it were not for Dass Jennir in a stolen Alpha-3 Nimbus-class V-wing starfighter.\nKo Vakier accompanied his crewmates to Orvax IV, where he joined his fellow crew in pledging to help Bomo Greenbark in tracking down his enslaved family. After learning of the death of Greenbark's wife and the selling of his daughter to a buyer on Esseles, Jennir offered to finish their search alone with Greenbark. Ko Vakier insisted, however, that he be allowed to see their mission through and he would participate in the attack on Dezono Qua's estate.\nKo Vakier was later captured with the rest of the crew by Haka Hai and his people in a deal gone bad. Showing defiance to their captors, Ko Vakier shared a cell with Greenbark, Mezgraf, and Captain Schurk-Heren to be interrogated for information on the location of their cargo. However, Greenbark managed to escape before Hai's people could begin torturing Mezgraf or Ko Vakier and while Greenbark fought Haka Hai's people, Shurk-Heren, Mezgraf, and Ko Vakier were freed by Uhumele's engineer Ratty. They reached Greenbark just in time to see him slaughter Haka Hai and all of his men. In spite of the shock of seeing Bomo's rage, Ko Vakier and the rest of the crew were gratified to him for saving them all and accepted him as a part of the crew.\nKo Vakier and the crew were later captured by the Galactic Empire after another betrayed deal. They were able to use the duel between Darth Vader and Celeste Morne as a distraction to escape, though not before Crys Taanzer succumbed to the Rakghoul plague.\nAfter mourning the loss of Crys, Vakier and the surviving crew plan to find Dass Jennir that could give them hope. By chance, they were able to find Beyghor Sahdett, who was also looking for Jennir. Together, they crossed through Imperial territory and were able to rescue Jennir.\nSoon afterwards, Sahdett was uncovered as a traitor by Jennir and another Jedi, Kai Hudorra, both of whom attempted to subdue him in a lightsaber duel. Sahdett dragged the battle into Huddora's casino and, as a superior duelist, forced both Jedi to the ground. Vakier and Mezgraf attempted to intervene, but Sahdett sliced off Mezgraf's hand and halved Vakier's sword. He then plunged his lightsaber through Vakier's chest, killing him and gloating that he had \"carved\" his first Blood Carver.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Kestavel",
  "/wiki/Blood_Carver",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Uhumele",
  "/wiki/Star_Wars:_Dark_Times:_The_Path_to_Nowhere",
  "/wiki/Jedi_General/Legends",
  "/wiki/Dass_Jennir",
  "/wiki/New_Plympto/Legends",
  "/wiki/Aggressive_ReConnaissance-170_starfighter/Legends",
  "/wiki/Alpha-3_Nimbus-class_V-wing_starfighter/Legends",
  "/wiki/Orvax_IV",
  "/wiki/Bomo_Greenbark",
  "/wiki/Esseles/Legends",
  "/wiki/Assault_on_Dezono_Qua%27s_villa",
  "/wiki/Dezono_Qua",
  "/wiki/Qua_family%27s_villa",
  "/wiki/Haka_Hai",
  "/wiki/Mezgraf",
  "/wiki/Schurk-Heren",
  "/wiki/Meekerdin-maa",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/First_duel_on_unidentified_desert_moon",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Celeste_Morne",
  "/wiki/Crys_Taanzer",
  "/wiki/Rakghoul",
  "/wiki/Beyghor_Sahdett",
  "/wiki/Mission_to_Vondarc",
  "/wiki/Kai_Hudorra",
  "/wiki/Duel_on_Kestavel",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_Dark_Times:_Parallels",
  "/wiki/Star_Wars:_Dark_Times:_Vector",
  "/wiki/Dark_Times:_Blue_Harvest,_Part_1",
  "/wiki/Dark_Times_15",
  "/wiki/Dark_Times_17",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_1",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_2",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_3",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_1",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_2",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_3",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_4",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_95",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}