{
 "name": "Ko_Zatec-Cha",
 "display_name": "Ko Zatec-Cha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tammuz-an"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tammuz-an"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "Ko Zatec-Cha was a magic-user and royal vizier of the planet Tammuz-an. Unsatisfied with his station, he sought to become absolute ruler of the planet and went to great extremes to subvert the authority of the ruling monarch, Prince Mon Julpa.\nSeveral years before the Galactic Civil War, Ko Zatec-Cha embarked upon a scheme to do away with Prince Mon Julpa for good. He used his magic to transform the prince into an addle-brained amnesiac. Dressing him up as a broken-down android, he exiled him from Tammuz-an, forcing him to wander the galaxy as a simple-minded drifter. One of Mon Julpa's loyal followers, Sollag Den, stole the Tammuz-an Royal Scepter and fled his home world in the hopes of one day returning it to the prince. This greatly angered Zatec-Cha, for without the scepter, he could not legally assume the power of the throne. Zatec-Cha hired a bounty hunter named IG-88 and instructed him to recover Mon Julpa and the scepter.\nSome time later, Mon Julpa found himself at the auction block in a mining colony on Tyne's Horky. There, he met the miner, Jann Tosh and the droids, C-3PO and R2-D2. Together they helped reunite Mon Julpa with Sollag. Sollag used the magic of the royal scepter to disperse Zatec-Cha's magic giving the prince command of his faculties once again. Joining with a freighter pilot named Jessica Meade, they returned to Tammuz-an to retake the throne.\nIG-88 eventually tracked them back to the royal city and managed to acquire the royal scepter. With it, he was able to successfully capture Mon Julpa and bring him before Zatec-Cha, who had also managed to capture Jessica and Sollag. Zatec-Cha cast the prince into a dungeon pit in the hopes that he would be consumed by a monstrous Durkii. The only thing left to do was to assume the mantle of King of Tammuz-an.\nIn order to properly obtain the title, Zatec-Cha had to present the royal scepter to the Keeper of the Tower and place it inside of a special housing at the first sun of the equinox. However, Mon Julpa managed to escape from the Durkii pit with the help of his friends, and after a chase, intercepted Zatec-Cha at the tower. After a brief struggle between Mon Julpa, Zatec-Cha and their respective allies, the former took the scepter from the latter and placed it inside of the tower, securing his rightful position as king. Zatec-Cha was then imprisoned for his treason, his chances of becoming king forever lost.\nZatec-Cha was a male member of the Tammuz-an species with purple skin, a long black mustache, and a goatee. He had two triangle shaped markings below each eye. Zatec-Cha was always seen wearing the prestigious regal garments of his station.\nZatec-Cha was assisted by an incompetent Tammuz-anian sycophant named Vinga. Vinga's primary function was to speak Zatec-Cha's praises and execute every perfunctory job duty that Zatec-Cha handed down to him.\nJohn Stocker provided the voice talents for Ko Zatec-Cha in the Star Wars Droids animated series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tammuz-an/Legends",
  "/wiki/Tammuz-an_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Vinga",
  "/wiki/Magic",
  "/wiki/Vizier/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Mon_Julpa",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sollag_Den",
  "/wiki/Tammuz-an_Royal_Scepter",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/IG-88B/Legends",
  "/wiki/Tyne%27s_Horky",
  "/wiki/Jann_Tosh",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Jessica_Meade",
  "/wiki/Durkii",
  "/wiki/King/Legends",
  "/wiki/Keeper_of_the_Tower",
  "/wiki/Treason/Legends",
  "/wiki/John_Stocker",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/The_Pirates_and_the_Prince",
  "/wiki/The_Lost_Prince",
  "/wiki/The_New_King",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_Droids_(toy_line)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/The_Droids_Re-Animated"
 ]
}