{
 "name": "Kob_Mondray",
 "display_name": "Kob Mondray",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ochotl"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eriadu Patriots",
      "Kuat Artisans",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Kob Mondray was a male Human from the world Ochotl who lived during the last decades of the Galactic Republic. A promising shockball player, he abandoned the sport to join the Confederacy of Independent Systems during the Separatist Crisis over the mistreatment of his homeworld.\nMondray developed a talent for shockball, and after he helped to led his homeworld's shockball team in the Airam Sector Championships in 31 BBY, he attracted the attention of shockball talent scouts from the planet Eriadu. Mondray subsequently signed for the Eriadu Patriots shockball team and with them he competed in the elite Galactic League shockball competition. In 27 BBY, Mondray and his friend and rival Gettle Tebron of the Shad Furies team were signed for the rival Kuat Artisans team. The pair helped to guide the team to the Galactic League finals, but were defeated in the final bout of the tournament by the Commenor Diamonds. The following year, the Artisans recovered from the setback and Mondray and Tebron led the team to a Galactic League victory.\nThough his sporting success brought him fame and fortune, Mondray stayed in touch with his roots and became concerned about the plight of his homeworld Ochotl, which was blighted by a failure of its chak-root crop and attacks from pirates. The failure of the Republic Outland Regions Security Force, based on Eriadu, to respond to the incidents drove Ochotl and the rest of the Airam sector to secede from the Galactic Republic. Following his homeworld, Mondray abandoned shockball and his team to enter the service of the separatist Confederacy of Independent Systems.\nDuring the Clone Wars, Mondray went on to participate in fighting on the worlds Hypori and Shumavar, and later on he became a gifted speaker for the Confederacy of Independent Systems, appearing at events such as the Conclave of Chanosant. At the conclusion of the conflict spent a short time in prison, until he was eventually pardoned and released on the orders of Emperor Palpatine as part of the Outer Rim reconciliation efforts.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ochotl",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Eriadu_Patriots/Legends",
  "/wiki/Kuat_Artisans",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Shockball/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Airam_Sector_Championships",
  "/wiki/31_BBY/Legends",
  "/wiki/Eriadu/Legends",
  "/wiki/Galactic_League/Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Gettle_Tebron",
  "/wiki/Shad_Furies/Legends",
  "/wiki/Commenor_Diamonds",
  "/wiki/26_BBY/Legends",
  "/wiki/Chak-root/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Republic_Outland_Regions_Security_Force",
  "/wiki/Airam_sector",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Hypori/Legends",
  "/wiki/Battle_of_Shumavar_(Clone_Wars)",
  "/wiki/Hypori/Legends",
  "/wiki/Shumavar/Legends",
  "/wiki/Conclave_of_Chanosant",
  "/wiki/Time/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Outer_Rim_reconciliation_efforts",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/Sports_in_the_Star_Wars_Galaxy"
 ]
}