{
 "name": "Koffi Arana",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Turkana"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Kessel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Koffi Arana was a Human male Jedi Master who hailed from the planet Turkana. During the Clone Wars, he served as a General in the Grand Army of the Republic. In the final year of the crisis, Arana fought against Separatist forces in the Battle of Boz Pity. He eventually attended a meeting in the Jedi Temple on Coruscant regarding the Galactic Republic's sieges of the Outer Rim. Shortly afterwards, Arana survived the initial stages of Order 66, Supreme Chancellor Palpatine's command to all clone troopers to kill all Jedi. One month after the initiation of the Great Jedi Purge, Arana rendezvoused with Jedi Masters Tsui Choi, Roblio Darté, Jastus Farr, Ma'kis'shaalas, and Shadday Potkin, as well as Jedi Knights Bultar Swan and Sia-Lan Wezz, in an abandoned spice mine on the world of Kessel.\nHowever, Dark Lord of the Sith Darth Vader stormed the meeting, searching for Jedi Master Obi-Wan Kenobi. Arana and his fellow Jedi ambushed and attacked Vader, determined to kill the Sith Lord. After Vader defeated Wezz, Potkin, and Ma'kis'shaalas, he deactivated Arana's lightsaber using Potkin's cortosis blade. Choi and Swan managed to wound Vader by cutting off his sword arm, and the Sith Lord attempted to deceive the Jedi by feigning surrender. Arana, however, insisted that the Jedi kill the Dark Lord immediately. After an argument with Swan, Arana murdered her in order to take her still-working lightsaber and use it in an attempt to slay Vader. Before the Jedi Master could do so, Vader used the Force to throw his detached arm—still holding the cortosis blade—into Arana's chest, killing him. Shortly after Arana's death, Vader and the 501st Legion of Imperial stormtroopers murdered Choi, Farr, and Darté.\nKoffi Arana was born during the final decades of the Galactic Republic. Hailing from Turkana, Arana served the Jedi Order and the Republic as a Jedi Master as well as a General in the Grand Army of the Republic during the Clone Wars against the Confederacy of Independent Systems. At some point during the war, he visited the Outer Rim world Tatooine. In 19 BBY, during the final stages of the war, Arana fought against Separatist forces during the Battle of Boz Pity. He later attended a meeting in the briefing room of the Jedi Temple on the galactic capital of Coruscant. The assembly, concerning the Republic's sieges in the Outer Rim, was presented by Jedi Master Obi-Wan Kenobi. After the conference concluded, Arana left the briefing room, along with fellow Jedi Melik Galerha, Shadday Potkin, and Ma'kis'shaalas.\nArana survived the initial stages of Order 66, a contingency command issued by Supreme Chancellor Palpatine for all clone troopers to kill their Jedi commanders. Shortly after the order was given, Dark Lord of the Sith Darth Sidious—as his alter-ego, Palpatine—declared himself Emperor of the first Galactic Empire. The forces of the new Empire were aware that Arana had survived Order 66 and featured the Jedi Master's image in the final edition of HoloNet News. Arana eventually made his way back to Coruscant and joined the crowds at the base of the Jedi Temple. He watched as Imperial stormtroopers burned the bodies of deceased Jedi at the Temple entrance and witnessed a male Jedi attack the stormtroopers at the entrance. He and the other Jedi in the crowd—Shadday Potkin, Dass Jennir, Kai Hudorra, and the Padawan Noirah Na—did not join the Jedi in his attack on the stormtroopers and instead watched as the man was killed by their blaster fire.\nAfter hiding underground for one month, Arana traveled to the mining world Kessel. He secretly rendezvoused with Jedi Masters Tsui Choi, Roblio Darté, Jastus Farr, Ma'kis'shaalas, Shadday Potkin, and Jedi Knights Bultar Swan and Sia-Lan Wezz in an abandoned spice mine. The Jedi discussed the fall of the Republic and the rise of the Empire. During the meeting, Arana advocated taking the fight to the Sith, even if it meant falling to the dark side. Potkin revealed to Arana and the Jedi that she had leaked false intelligence that Obi-Wan Kenobi would be attending the meeting and added that the Sith Lord Darth Vader himself was coming to the meeting in hopes of finding Kenobi. As Arana and his fellow Jedi prepared for battle, Vader stormed the room and demanded to know where Kenobi was. Arana and the Jedi engaged Vader in combat. When Vader defeated Wezz, Arana tried to attack Vader from behind but was Force-pushed away by the Sith Lord. After Vader killed Ma'kis'shaalas and was injured by Farr, Arana attempted to attack him again, but the Sith evaded him.\nVader retreated and murdered Potkin, stealing her cortosis blade. The Sith Lord continued to fight the Jedi, using Potkin's blade to deactivate Arana's, Farr's, and Darté's lightsabers. However, Choi managed to slice off Vader's cybernetic sword arm. The Dark Lord feigned surrender, and Arana implored the Masters to end his life. Swan stopped Arana, however, reminding him that because they were Jedi, they did not murder unarmed enemies who had surrendered. Arana countered that Vader needed to die and ordered Swan to give her lightsaber to him. Swan pleaded with him to not give in to his anger, but Arana seized Swan's weapon, stabbing and murdering her in order to take the lightsaber. Choi was shocked that Arana had killed Swan, and Arana vowed to avenge the death of Swan and the other Jedi. Arana then leaped at Vader with the ignited lightsaber, but the Dark Lord used the Force to throw his severed arm, still holding the cortosis blade, at the Jedi's chest, which impaled and killed him. After Arana's death, Vader defeated Choi, Farr, and Darté with assistance from the 501st Legion of stormtroopers.\nThe details of Arana's death were filed in a report by Clone Commander Bow, a stormtrooper of the 501st Legion. The official records—which were modified by Imperial Advisor Sate Pestage from a compilation of various reports created by Moff Marcellin Wessel—stated that Arana was killed by his fellow Jedi in a desperate struggle for power.\nDuring the Clone Wars, Koffi Arana defended the Republic as a Jedi General. After Palpatine unleashed the clones on the Jedi and declared himself Emperor of the Galactic Empire, Arana came to believe that the Jedi teachings were weak if only two Sith could destroy the entire Jedi Order. He advocated killing the Sith Lords, feeling that any weapon should be used—even the dark side of the Force—if it meant saving the galaxy from the Sith. During the Jedi's ambush of Darth Vader on Kessel, the Sith Lord seemingly attempted to surrender himself to the group of Jedi, but Arana immediately demanded that the Jedi kill Vader, knowing the plea to be a trick. When Bultar Swan disagreed and refused to surrender her lightsaber so that he could eliminate Vader, Arana murdered Swan with her own lightsaber, stating that he would take whatever weapon he needed to kill Vader. He was determined to avenge Swan and the other dead Jedi but was slain by the Dark Lord.\nArana was a dark-skinned Human male with brown eyes and long black hair who grew a moustache and beard.\nDuring the final year of the Clone Wars, Arana wore a set of brown Jedi robes. After surviving the initial stages of Order 66, he wore a set of black armor. When Arana and the seven other Jedi confronted Vader on Kessel, he wore a set of red armor. He also owned and utilized a lightsaber containing a blue crystal.\nArana managed to escape the initial stages of the Great Jedi Purge and survived in the underworld for one month before he met with the seven other Jedi on Kessel. As a Jedi Master, Arana used a lightsaber during combat. However, he was unable to defeat Darth Vader when he and the seven other Jedi confronted the Dark Lord on Kessel. Arana was also capable of using the Force to leap across long distances; he demonstrated this ability during his attempt to murder Vader.\nKoffi Arana was introduced, albeit unnamed, as an illustrated character by Joe Corroney in the September 2005 Star Wars Insider 84 article Republic HoloNet News Special Inaugural Edition 16:5:241. While Corroney originally intended for the illustration to be a younger depiction of the Jedi Master Qu Rahn, another survivor of Order 66, the character was identified as Koffi Arana by Leland Chee and was retconned to be a character portrayed by Gervais Koffi in the May 2005 film Star Wars: Episode III Revenge of the Sith.\nIn 2007, Hasbro released a comic pack that included an action figure of Arana along with a reprint of Star Wars: Purge, in which Arana dies. Star Wars: Purge dates its events at one month after the events of Revenge of the Sith, which was established as taking place midway through 19 BBY in the October 2005 reference title The New Essential Chronology. However, in 2006, Leland Chee stated that Arana was killed in 18 BBY. Several other character death dates given in the blog entry are incorrect, and as such, this article treats the 19 BBY date as canonical.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Turkana/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Battle_of_Boz_Pity_(Clone_Wars)",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Outer_Rim_Sieges/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Conclave_on_Kessel",
  "/wiki/Tsui_Choi",
  "/wiki/Roblio_Dart%C3%A9",
  "/wiki/Jastus_Farr",
  "/wiki/Ma%27kis%27shaalas/Legends",
  "/wiki/Shadday_Potkin/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Sia-Lan_Wezz",
  "/wiki/Unidentified_Kessel_spice_mine",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Cortosis_blade",
  "/wiki/Cho_sun/Legends",
  "/wiki/Sword/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Lord/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Cortosis/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Time/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Jedi_Temple_communication_center/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Melik_Galerha/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Republic_HoloNet_News_Special_Inaugural_Edition_16:5:241",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Jedi_Temple_Public_Entrance",
  "/wiki/Unidentified_Human_Jedi_(Jedi_Temple)",
  "/wiki/Dass_Jennir",
  "/wiki/Kai_Hudorra",
  "/wiki/Padawan/Legends",
  "/wiki/Noirah_Na",
  "/wiki/Blaster/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Shiak",
  "/wiki/Force_Jump",
  "/wiki/Clone_trooper_commander",
  "/wiki/Bow_(clone_stormtrooper)",
  "/wiki/Imperial_Advisor",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Casualty_Report:_Order_66",
  "/wiki/Moff/Legends",
  "/wiki/Marcellin_Wessel",
  "/wiki/General/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Armor/Legends",
  "/wiki/Blue",
  "/wiki/Lightsaber_crystal",
  "/wiki/Joe_Corroney",
  "/wiki/September",
  "/wiki/2005",
  "/wiki/Star_Wars_Insider_84",
  "/wiki/Qu_Rahn/Legends",
  "/wiki/Leland_Chee",
  "/wiki/Retcon",
  "/wiki/Gervais_Koffi",
  "/wiki/May",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/2007",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_Purge",
  "/wiki/October",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/2006",
  "/wiki/18_BBY/Legends",
  "/wiki/Canon",
  "/wiki/Star_Wars_Insider",
  "/wiki/Republic_80",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_Chronicles:_The_Prequels",
  "/wiki/Order_66:_Destroy_All_Jedi",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_137",
  "/wiki/Star_Wars:_The_Ultimate_Action_Figure_Collection",
  "/wiki/Category:Images_of_Koffi_Arana"
 ]
}