{
 "name": "Koh_Helshar",
 "display_name": "Koh Helshar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arbooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sathari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Helshar clan"
     ]
    }
   ]
  }
 ],
 "content": "Koh Helshar was a female Sathari and the Matriarch of the Helshar clan, a powerful family in the city of Quolas on Arbooine.\nBorn into the Helshar clan in the city of Quolas on the planet Arbooine, Koh Helshar was present in the city when Jedi Knight Suljo Warde and Gel Marcolf arrived to settle a dispute between the Helshar clan and the Tumris clan. When Marcolf was installed as the interim magistrate of the city, Matriarch Helshar agreed to the posting but grew weary of Marcolf's interference in Quolas politics. As time passed, Helshar came to regret her part in the feud with the Tumris clan and hoped to ensure the survival of city by enduring the reign of their alien Reeve.\nHelshar's son, Pathran, was rumored to be involved with the resistance movement fomenting in the city; something that Helshar was somewhat aware of and disapproved of. Warning her son against attacking the reeve, she would discourage any acts of violence as she feared the risk that an attack would pose to the average citizen. Rejecting the idea of aiding the Tumris clan in any move against the Reeve, she would have gladly ended the feud on less violent terms.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arbooine/Legends",
  "/wiki/Sathari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Helshar_clan",
  "/wiki/Matriarch",
  "/wiki/City/Legends",
  "/wiki/Quolas",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Suljo_Warde",
  "/wiki/Gel_Marcolf",
  "/wiki/Tumris_clan",
  "/wiki/Pathran_Helshar",
  "/wiki/Quolas_resistance",
  "/wiki/Chronicles_of_the_Gatekeeper"
 ]
}