{
 "name": "Kolara",
 "display_name": "Kolara",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Carnelion IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Open"
     ]
    }
   ]
  }
 ],
 "content": "Kolara was a female human who lived on Carnelion IV.\nIn 29 BBY, Kolara and an individual known as Mother Pran flew an airship in a battle over Carnelion IV's surface. When the airship was critically damaged and began to crash, Jedi Knight Obi-Wan Kenobi and his Padawan, Anakin Skywalker, used the Force to pull the craft towards a cliff, allowing Kolara and Pran to escape. After Kolara introduced herself and Pran to the Jedi, Pran aimed a pair of guns at the two robed figures, telling Kolara to move away from them. Pran asked the Jedi if they were \"open or closed,\" to which Skywalker responded that they were Jedi responding to a distress signal. Confused, Kolara and Pran looked at each other, and Pran then asked what a Jedi was.\nKolara attempted to calm Pran down as she threatened the two Jedi, but was forced to run and hide when the group was attacked by a Closed airship. While taking cover, Kolara expressed hope that the Closed ship would leave them alone, but Pran doubted that. When Obi-Wan managed to disable the airship and rescued the pilot, Kolara watched as Mother Pran and Grecker fought until they were disarmed by Anakin and Obi-Wan. As the Jedi started to leave, Kolara agreed with Grecker, who stated they would all die if they were stranded on top of the mountain without weapons. She was reprimanded by Mother Pran for agreeing with a Closed. After Obi-Wan agreed to get them all to safety, Kolara asked Anakin what brought them to her planet. He explained that the were responding to a distress call on a special Jedi frequency and Kolara expressed disbelief and stated that the technology to make off-planet transmissions had been lost generations ago. She was surprised when Mother Pran and Grecker agreed to work together to rebuild an airship.\nWhile making their way to the location of the distress signal, the airship came upon a crate attached to a kite. Kolara was ordered by Mother Pran to stay away from the window as Grecker retrieved the box. During this time, Anakin asked her if the box might be a skygift but she explained what term meant. She guessed the box might contain a piece of art and showed him a round purple object that she had hidden in her jacket. Anakin inquired why she was hiding it and she told him that to have art was forbidden by Mother Pran.\nAs they continued on their journey, Kolara watched as Anakin made adjustments to his lightsaber and asked if his mission was to go to different places and fix things. Anakin gave her a brief explanation of the Jedi Order and their purpose. Kolara recognized Anakin's talents in repairing technology and pointed this out to Mother Pran. After Anakin repaired a central processor for Mother Pran, Kolara was taken aside by Pran and praised for recognizing Anakin's ability. Pran decided to kidnap Anakin and reminded Kolara to be alert and distract Anakin when the time came. When the airship was attacked by Fishers, Kolara pretended to be afraid and clung to Anakin, asking for protection. During her distraction, Kolara stole Anakin's lightsaber and tossed it out of a window. She apologized for the distraction before Mother Pran knocked the padawan unconscious. Kolara escaped with Pran and their prisoner on a small flyer and tried to dissuade Mother Pran from attacking the airship to prevent pursuit by Obi-Wan and Greacker to no avail.\nKolara returned with Mother Pran and their captive, Anakin Skywalker, to Fortress-Home of the Open where she was tasked to guard the prisoner while all the elders of the group went to locate the distress signal. After the adults left, Korlara and the youngsters argued about what they should do. She explained who the Scavenger was to Anakin, and he told the Open youths that the Scavenger was the one sending art up on kites in an attempt to show them that there was an alternative to war and destruction. He convinced Kolara to free him so he could build some transportation to get the young Open members to the location of the distress signal in an attempt to prevent the Open and Closed adults from destroying everything.\nWhen they reached the museum, Kolara introduced herself to Sera. The youth watched the battle from the roof with Sera, and was dismayed when Sera expressed hope that the Closed and Open would wipe each other out. Unable to allow the Open to be eliminated, Kolara and the other youths took the flyers and joined the battle.\nKolara first appeared in the 2016 comic Obi-Wan and Anakin 1, written by Charles Soule and illustrated by Marco Checchetto.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Carnelion_IV",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Open",
  "/wiki/29_BBY",
  "/wiki/Pran",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Force",
  "/wiki/Jedi",
  "/wiki/Slugthrower",
  "/wiki/Closed",
  "/wiki/Airship_(Carnelion_IV)",
  "/wiki/Grecker",
  "/wiki/Skygift",
  "/wiki/Lightsaber",
  "/wiki/Jedi_Order",
  "/wiki/Central_processor",
  "/wiki/Fisher_(Carnelion_IV)",
  "/wiki/Fortress-Home_of_the_Open",
  "/wiki/Sera%27s_fortress_museum",
  "/wiki/Sera",
  "/wiki/2016",
  "/wiki/Marvel_Comics",
  "/wiki/Obi-Wan_and_Anakin_1",
  "/wiki/Charles_Soule",
  "/wiki/Marco_Checchetto",
  "/wiki/Obi-Wan_and_Anakin_2",
  "/wiki/Obi-Wan_and_Anakin_3",
  "/wiki/Obi-Wan_and_Anakin_4",
  "/wiki/Obi-Wan_and_Anakin_5",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)"
 ]
}