{
 "name": "Kolaff",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Steel-grey"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Captain Kolaff was a male Human officer serving in the Imperial Navy of the Galactic Empire.\nKolaff was a Human male Imperial Navy captain, serving the Galactic Empire during the Galactic Civil War. A brilliant tactician and leader, Kolaff was considered to be one of the Imperial Navy's most competent and able combat commanders. However, Kolaff had a love of battle, and gained a reputation for stringing out assignments that should have been completed quickly in order to savor the thrill of battle. Eventually, his methods earned him a transfer to the Relgim sector, where he was assigned to command a fleet of Victory-class Star Destroyers, including his personal command, the Subjugator.\nDuring the Galactic Civil War, Kolaff was ordered to take the Subjugator to Kwenn Space Station with Lira Wessex, wife of Relgim sector's Governor Denn Wessex. Their mission was simple; to capture Lira Wessex's father, the Alliance to Restore the Republic engineer Walex Blissex. Blissex had been lured out of hiding by reports that his daughter was dying and wished to see him once more; reports that had been faked to capture him and interrogate him for engineering knowledge. Shortly after capturing Blissex and the Alliance agents escorting him, the Subjugator was attacked by the Alliance's Task Force Starfall, who had no idea Blissex was aboard. The Subjugator was heavily damaged in the confrontation, and Kolaff ordered the ship's self-destruct mechanism activated, intending to detonate the ship when the Alliance fleet re-engaged. Blissex and the Alliance agents escaped, however, and Kolaff eventually met them in combat using All Terrain Scout Transports in hangar bay G-12.\nKolaff was a tall man, standing 1.8 meters, and had square shoulders. Always immaculately dressed in his uniform, his hair was neatly cut and he had steel-grey eyes. Kolaff did not hate the Alliance, and actually admired their bravery and courage. He was intelligent and confident of his own abilities, with a smug and sarcastic attitude. His love of battle was an overriding obsession in his life, and he considered himself to be invincible.\nKolaff was trained in the use of a blaster, as well as unarmed combat. An able commander and tactician, Kolaff was also knowledgeable about bureaucratic procedure. He was able to fly starships, pilot All Terrain Scout Walkers, and override security systems.\nKolaff wore an Imperial uniform that was always clean, and carried a blaster and comlink. During the battle with Alliance agents on the Subjugator, he utilized an All Terrain Scout Transport.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Relgim_sector/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Subjugator_(Victory-class)",
  "/wiki/Kwenn_Space_Station/Legends",
  "/wiki/Lira_Wessex/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Denn_Wessex",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Walex_Blissex/Legends",
  "/wiki/Attack_on_the_Subjugator",
  "/wiki/Task_Force_Starfall",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Hangar_bay_G-12",
  "/wiki/Eye/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Starfall_(adventure)",
  "/wiki/West_End_Games",
  "/wiki/Classic_Adventures:_Volume_Five",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_121",
  "/wiki/The_Official_Star_Wars_Fact_File_130",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}