{
 "name": "Koley_Linn",
 "display_name": "Koley Linn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "230 BBY",
      "Starlight Beacon",
      "Eiram system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Byne Guild"
     ]
    }
   ]
  }
 ],
 "content": "Koley Linn was a human male pilot who owned the cargo ship Ace of Staves.\nIn 242 BBY, Linn and Leox Gyasi were employed by the Byne Guild. Linn was assigned as a tech to a ship shortly before Gyasi came aboard. He tried to intimidate Gyasi, and explained the ship's power cells were old and lost energy quicker than expected. Gyasi realized that Linn was draining the cells and selling the excess power on the black market. Gyasi didn't report him, but ignored Linn's suggested maintenance and performed the tasks correctly which led to the discovery of Linn's theft. He was transferred to another position on another ship which caused him to despise Gyasi and his crew.\nAfter heading off on his own, Linn worked with the Byne Guild and held a deep grudge against Affie Hollow for her role in breaking it up. The pilot often went out of his way to impede their operations as a way to get revenge. Linn bought up all the spare fuel on the tiny planet Todouhar which cost the crew of the Vessel an additional three days stuck in port and attempted to steal their cargo on Kennerla.\nLinn was present on Starlight Beacon during its destruction. As Stellan Gios implemented strict departure regulation, Linn complained to the Jedi. After the Vessel landed, Linn talked to Gyasi and offered to help with the repairs, for a price. Gyasi declined, and Linn went off to search for others in need that he could prey upon. When Linn thought the Vessel was unguarded, he went to examine it to see if there were any equipment he could steal. He was interrupted by Geode and left empty-handed.\nLinn noticed a group of maintenance workers who were often in restricted parts of Starlight Beacon. Assuming they were thieves, he made a deal with them to get a share of their loot, not realizing they were actually a group of Nihil saboteurs.\nAfter the bombs were detonated, Linn realized he was trapped on Starlight Beacon. He confronted the Republic crew members and demanded that they open the docking bay doors so he could depart. He drew his blaster and fired into the air, not realizing the bay was magnetically sealed. The blaster bolt ricocheted around until it was intercepted by Geode. After the situation was calmed down, he continued to plan on a way to escape. The Jedi enlisted the aid of the trapped spacers to assist them with sealing off parts of the station. Linn was scolded by Pikka Adren for not volunteering but he decided to stay behind and see if he could come up with a way to force the Starlight Beacon crew to let him leave the station. He watched as the top half of the station burned up in the atmosphere of Eiram. He gathered a crew and convinced them that the Jedi couldn't save the remaining part of the station and that they should blast a hole in the docking bay so they could fly out to safety. When Nan and Chancey Yarrow entered the docking bay, Linn overheard them talking about evading Republic authorities and persuaded them to join his plan.\nLinn constructed an explosive device to create a distraction so he and his cohorts could confiscate enough ships to blow a hole in the docking bay. However, the remaining spacers and Jedi Stellan Gios reacted quickly, preventing Linn and his crew from seizing any ships. Realizing this, Linn took a child hostage, threatening to shoot it if anyone interfered. Geode inserted himself between the child and Linn and the smuggler fired at him before remembering that Vintians could magnetically seal themselves. The blaster bolt reflected off of Geode and killed Linn.\nLinn flew a cargo ship named Ace of Staves. He owned a BlasTech B95 blaster.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/230_BBY",
  "/wiki/Starlight_Beacon",
  "/wiki/Eiram_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Byne_Guild",
  "/wiki/Pilot",
  "/wiki/Freighter",
  "/wiki/Ace_of_Staves",
  "/wiki/242_BBY",
  "/wiki/Leox_Gyasi",
  "/wiki/Affie_Hollow",
  "/wiki/Planet",
  "/wiki/Vessel",
  "/wiki/Kennerla",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Stellan_Gios",
  "/wiki/Jedi",
  "/wiki/Geode",
  "/wiki/Nihil",
  "/wiki/Saboteur",
  "/wiki/Blaster",
  "/wiki/Pikka_Adren",
  "/wiki/Eiram",
  "/wiki/Nan",
  "/wiki/Chancey_Yarrow",
  "/wiki/Vintian",
  "/wiki/BlasTech",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/StarWars.com"
 ]
}