{
 "name": "Komat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taloraan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wind Raiders",
      "Acolytes of the Beyond"
     ]
    }
   ]
  }
 ],
 "content": "Komat was a human female who was a former member of the Acolytes of the Beyond. During her time as an Acolyte, she used her ability to track when and where starships exited hyperspace to become one of the Acolytes best relic hunters, and she led raids on ships as they exited hyperspace. Komat was later present on Devaron, where the Acolytes attacked a New Republic outpost. At the time the Pantoran female Acolyte Kiza, who Komat considered a sister, was given the mask of Viceroy Exim Panshard by Yupe Tashu, the leader of the Acolytes. Though Komat stayed at Kiza's side, Kiza became lost to the mask and the sisterly bond between the two was lost. Komat also claimed that she attempted to take the mask from Kiza and the two engaged in a battle, which, according to Komat, ended with Tashu dead and caused Kiza to flee with the mask.\nBelieving that Kiza would remain a danger to the galaxy if she lived, Komat attempted to find the lightsaber of the Sith Lord Darth Noctyss. However, she instead encountered Luke Skywalker, who was also sought the lightsaber. Skywalker saved Komat's life and in return she renounced her life as an Acolyte and went to live in exile as a farmer on the planet Polaar with the Duelist Elite droid KB-68, a pet targon named Sekhmet, and the mouse droid M-1.\nIn 21 ABY, Skywalker traveled to Polaar with his friend Lando Calrissian as they sought the location of the Goldstone, a luxury yacht that was being used by a family who the pair hoped to find. Komat was able to track the ship's location, and agreed to accompany Calrissian to help save the family. The two traveled to an Imperial fuel dump on Taw Provode, where they were able to help the family escape from the Corporate Sector Authority and the Jedi hunter Ochi. Komat and Skywalker then dueled the Sith Lord Viceroy Exim Panshard, who had possessed Kiza's body. During the duel, Panshard became held by a serpent and tricked Komat into helping him escape by using Kiza's voice. Panshard was eventually defeated when Skywalker used Noctyss' lightsaber and his own to destroy Panshard's mask.\nAfter the duel, Komat traveled with Calrissian, Skywalker, and R2-D2 to Neftali to bury the bodies of a man and woman from the family they sought. After the burial, Komat returned to Polaar with Calrissian where she suggested he recover before he continued his search for Ochi. After a week of recovery, Komat gave Calrissian her armor, that of a Wind Raider of Taloraan, and allowed him to borrow her ship so he could continue looking for Ochi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Taloraan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Wind_Raiders",
  "/wiki/Acolytes_of_the_Beyond",
  "/wiki/Time",
  "/wiki/Starship",
  "/wiki/Hyperspace",
  "/wiki/Devaron",
  "/wiki/Attack_on_a_New_Republic_outpost",
  "/wiki/Devaron_New_Republic_outpost",
  "/wiki/Pantoran",
  "/wiki/Kiza",
  "/wiki/Mask_of_Viceroy_Exim_Panshard",
  "/wiki/Yupe_Tashu",
  "/wiki/Helmet",
  "/wiki/The_galaxy",
  "/wiki/Lightsaber_of_Darth_Noctyss",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Noctyss",
  "/wiki/Luke_Skywalker",
  "/wiki/Lightsaber",
  "/wiki/Exile_(punishment)",
  "/wiki/Farmer",
  "/wiki/Planet",
  "/wiki/Polaar",
  "/wiki/KB-68",
  "/wiki/Targon",
  "/wiki/Sekhmet",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/M-1",
  "/wiki/21_ABY",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Luxury_yacht",
  "/wiki/Palpatine_family",
  "/wiki/Taw_Provode",
  "/wiki/Skirmish_on_Taw_Provode",
  "/wiki/Corporate_Sector_Authority",
  "/wiki/Jedi_hunter",
  "/wiki/Ochi",
  "/wiki/Lightsaber_duel",
  "/wiki/Viceroy",
  "/wiki/Exim_Panshard",
  "/wiki/Snake",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/R2-D2",
  "/wiki/Neftali",
  "/wiki/Burial",
  "/wiki/Dathan",
  "/wiki/Miramir",
  "/wiki/Standard_week",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Komat",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}