{
 "name": "Kono_Nolan",
 "display_name": "Kono Nolan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kono Nolan was a Human male scientist who worked for the Galactic Republic on Manaan during the time of the Jedi Civil War.\nDuring his work for the Galactic Republic on Manaan, Nolan served as the chief scientist at the secret Hrakert Station on Manaan's ocean floor as of 3956 BBY. When it was overrun by insane Selkath he, along with Sami, was one of the few survivors that were saved by the amnesiac Revan during his search for the Star Map.\nDespite his position as a scientist for the Republic, Nolan was amoral, against believing the ethical consequences of his work. He advocated using an experimental poison to kill the Progenitor, and was furious when Revan, following Sami's advice, chose to destroy the facility instead.\nKono Nolan was voiced by Cam Clarke.\nIf the player takes the dark side path, he can have Revan poison the Progenitor and/or kill either or both of the scientists. The consequences of releasing the poison, however, are profound; Revan is then banned from returning to Manaan and the general price of medkits throughout the game goes up; alternately, if the dark-side player has enough skill in Persuade, Revan can revisit the planet, using his ability to convince the Selkath to keep the matter quiet.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Manaan/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Hrakert_Station",
  "/wiki/Ocean/Legends",
  "/wiki/3956_BBY",
  "/wiki/Selkath/Legends",
  "/wiki/Sami_(Human)",
  "/wiki/Star_Map",
  "/wiki/Progenitor",
  "/wiki/Cam_Clarke",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Medkit",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}