{
 "name": "Kootan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Sometime before the Battle of Yavin",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Xonti Brothers"
     ]
    }
   ]
  }
 ],
 "content": "Kootan was a male Trandoshan slaver who was part of an acquisition crew for the Xonti Brothers. Led by Noka, the five Trandoshans went to Kashyyyk where Krrsantan set a trap for them. Krrsantan gunned down the other three and Kootan and Noka found themselves being the sole two members. Kootan attempted to kill Krrsantan and was killed by the Wookiee.\nKootan was part of a group of Trandoshan slavers working for the Xonti Brothers. Led by Noka, they flew to Kashyyyk on a slave ship to capture Wookiees for the Xonti Brothers. Upon arrival, Kootan expressed his keenness to kill a Wookiee and Noka reminded him of the job at hand. Noka expressed his worries as two slaving teams had already been lost to Wookiees in the last month alone. Noka then used his scanner to locate a Wookiee and the five Trandoshans vectored towards the scanner's reading.\nThe team found the Wookiee as it was sleeping and Kootan and Noka snuck on the Wookiee. Kootan fired a stun blast at it, only to find it had been left to bleed to death. One of the slavers was suddenly shot and Kootan ordered the others to open fire as another slaver was quickly shot dead. The third slaver was quickly gunned down and only Kootan and Noka were left. After taking cover behind a tree, the pair realized that the dead Wookiee was bait and Kootan decided to open fire on the attacker. Kootan left his cover to be knocked out by the attacker, a black Wookiee named Krrsantan. Krrsantan then threw him into another tree which killed him on impact.\nKootan was a male Trandoshan slaver with orange eyes and skin. Despite being tasked with capturing a Wookiee, he was keen to hunt one for its skin. When pinned down alongside Noka, he gave up trying to stun Krrsantan and attempted to kill him.\nKootan wore green clothing with ammo patches along his torso. He had armor plates protecting his chest, back and shoulders which were mainly covered by the cape he wore. Kootan also had a head set with small screen for his left eye to assist in hunting. Kootan had a large blaster that could be used for sniping his enemy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Battle_of_Yavin",
  "/wiki/Kashyyyk",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Xonti_Brothers",
  "/wiki/Slaver",
  "/wiki/Noka",
  "/wiki/Krrsantan",
  "/wiki/Wookiee",
  "/wiki/Trandoshan_prisoner_ship",
  "/wiki/Death",
  "/wiki/Standard_month",
  "/wiki/Sleep",
  "/wiki/Stun",
  "/wiki/Blood",
  "/wiki/Fire",
  "/wiki/Tree",
  "/wiki/Eye",
  "/wiki/Hunting",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Cape",
  "/wiki/Blaster",
  "/wiki/Doctor_Aphra_Annual_1"
 ]
}