{
 "name": "Kopri",
 "display_name": "Kopri",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New RepublicPalace Guard",
      "Palace Guard"
     ]
    }
   ]
  }
 ],
 "content": "Kopri was a female Twi'lek who served under New Republic Chief of State Borsk Fey'lya as Captain of the Palace Guard at the Imperial Palace on Coruscant.\nWhile guarding the Imperial Palace Kopri encountered Finn Galfridian and his droid Prowl as they attempted to break into the residence of Chief Fey'lya. After Finn, already wanted as an escaped assassin, successfully entered the building and confronted the Chief of State, she gave chase to the Jedi using a flutterpack. Eventually she captured Finn, but released him when Prowl forced a stalemate. After Finn explained the situation, they sought out the Imperial ambassador, who Finn claimed was a Vong infiltrator and the real assassin.\nAt ambassador Yarmond's quarters, the pair confronted the masqued Vong. Zakar grabbed Kopri from behind, as Yarmond attempted to force Finn to go with him to Tsalok. Kopri was freed when Dray|Master Dray arrived and killed Zakar. As Dray made his move against Yarmond, Finn and Kopri fled.\nIn Invasion: Revelations 4, Kopri introduces herself as Captain Kirpo when calling on the Imperial ambassador. Randy Stradley indicated on the Dark Horse Comics message boards that this typo would be corrected in the trade paperback version.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Palace_Guard_(New_Republic)",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/Captain/Legends",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Finn_Galfridian",
  "/wiki/Prowl",
  "/wiki/Yarmond",
  "/wiki/Zakar_(Yuuzhan_Vong)",
  "/wiki/Tsalok",
  "/wiki/Dray_(Fallen_Jedi)",
  "/wiki/Invasion:_Revelations_4",
  "/wiki/Randy_Stradley",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Invasion:_Revelations_3",
  "/wiki/Invasion:_Revelations_5",
  "/wiki/Chief_of_Security/Legends",
  "/wiki/Mirith_Sinn",
  "/wiki/13_ABY/Legends",
  "/wiki/25_ABY/Legends"
 ]
}