{
 "name": "Kora_Ryo",
 "display_name": "Kora Ryo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shikaakwa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order",
      "Je'daii Council",
      "Je'daii Council"
     ]
    }
   ]
  }
 ],
 "content": "Kora Ryo was a female Twi'lek from the planet Shikaakwa who was a Je'daii Master in the Je'daii Order. Kora married fellow Shikaakwan Volnos Ryo and bore him a daughter named Tasha, but she ended their marriage when he became a crime baron during the Despot War that engulfed the Tython system in 25,805 BBY. As Temple Master of Kaleth, the Temple of Knowledge, Ryo oversaw Kaleth and served on the Je'daii Council.\nA Force-sensitive Twi'lek female from the planet Shikaakwa, Kora was found to be Force-sensitive and sent to the planet Tython where she was trained by the Je'daii Order and became a Je'daii Master. The Je'daii Ranger Hawk Ryo introduced Kora to his older brother Volnos Ryo, a member of Shikaakwa's Clan Ryo, one of the Nine Houses of Shikaakwa and the two fell in love and were married not long afterwards. Volnos lived a life of study and travel, and Kora bore him a daughter named Tasha. However, when Volnos became Baron of Clan Ryo after his father's death in 25,805 BBY during the Despot War between the Despot Queen Hadiya and the Je'daii, Kora dissolved their marriage according to Je'daii law and moved back to Tython with her daughter, as she was disgusted by her husband's new role as a crime lord. By the year 25,793 BBY, Kora Ryo had become the Temple Master of Kaleth, the Temple of Knowledge. Most nights, Ryo meditated before the setting sun Tythos.\nWhen an unknown ship crashed on Tython, Je'daii Rangers Rori Fenn and Hawk Ryo were dispatched with Temple Master Quan-Jang to investigate the crash, and Master Ryo analyzed their ships's readings as the three scouted the crash site. From the data, Ryo was able to determine that the ship was far larger than any of the Tythan sleeper ships, and both the crew and the ship were foreign to the Tython system. Analyzing reports from the other temples, Ryo also realized that a powerful Force Storm was growing across Tython. As the storm grew in strength, Temple Master Ketu summoned the other Temple Masters of the Je'daii Council in a holoconference across Tython, where Ryo informed the other Temple Masters that her research showed that the current storm was of the same strength as the one that had occurred on the day of the Tho Yor Arrival thousands of years earlier.\nWhen questioned by Master Ruhr, Ryo voiced her belief that the storm had been caused by the crash of the unknown ship. Kora was alarmed to learn that her daughter Tasha was one of three Je'daii Journeyers who were pursuing the lone survivor of the crash into the Rift, an enormous ravine on Tython. Shortly afterward, as the storm continued to grow in strength, Ryo joined with the other Temple Masters through the Force and aided Quan-Jang in shifting the balance of the Force on Tython, dissipating the storm's fury. After the threat of the storm had passed, the Council convened to judge the case of the survivor, a powerful dark side warrior named Xesh, and they decided to exile him to the moon of Bogan so he could regain his balance.\nSeveral weeks later, Kora was attempting to meditate at sunset at Kaleth, but her meditations were interrupted by a holocall from Volnos, who demanded that she forsake the Je'daii and return to Shikaakwa with their daughter as she was still his wife by Shikaakwan law. However, Kora refused, countering that she had dissolved their marriage according to Je'daii law, and she reminded Volnos that his status as a crime lord prevented their family from ever being together. Several days later, after the mad Je'daii Daegen Lok had been recaptured after his escape from Bogan, Ryo and the other Masters met in conference to sentence Lok. The insane Je'daii demanded that the Masters force his friend Hawk Ryo to confess what he had seen in the Chasm, a rift in Tython's surface that caused nightmarish hallucinations and was the cause of Lok's insanity.\nA blue-skinned Twi'lek with black eyes, Ryo wore dark blue coverings on her lekku, or head-tails, as well as flowing robes and a headdress with orange tassels. A scholar and a skilled analyst as the Temple Master of Kaleth, Ryo considered herself to be Je'daii and not Shikaakwan, and she was disgusted by her husband's involvement in crime as a corrupt crime baron. She cared deeply for her daughter, and strove to keep Tasha separate from the corrupt influence of her father.\nKora Ryo was first depicted in Star Wars: Dawn of the Jedi 0, a preview issue for the Star Wars: Dawn of the Jedi comic book series, and she appeared on a variant cover by Gonzalo Flores for the first issue. However, Flores's cover erroneously depicted Ryo with pink skin. Kora first appeared in the third issue, and she appeared again in the fourth, fifth, and seventh issues.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shikaakwa",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Je%27daii_Council",
  "/wiki/Planet/Legends",
  "/wiki/Je%27daii_Master",
  "/wiki/Marriage/Legends",
  "/wiki/Volnos_Ryo",
  "/wiki/Tasha_Ryo",
  "/wiki/Crime_lord/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Despot_War",
  "/wiki/Tython_system/Legends",
  "/wiki/25,805_BBY",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Kaleth",
  "/wiki/Je%27daii_Temples",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Hawk_Ryo",
  "/wiki/Clan_Ryo",
  "/wiki/Nine_Houses",
  "/wiki/Volnos_Ryo%27s_father",
  "/wiki/Death/Legends",
  "/wiki/Despot_Queen",
  "/wiki/Hadiya",
  "/wiki/Standard_year/Legends",
  "/wiki/25,793_BBY",
  "/wiki/Star/Legends",
  "/wiki/Tythos",
  "/wiki/Devourer_(Rakatan_ship)",
  "/wiki/Rori_Fenn",
  "/wiki/Quan-Jang",
  "/wiki/Tythan",
  "/wiki/Sleeper_ship/Legends",
  "/wiki/Force_storm_(weather)",
  "/wiki/Ketu",
  "/wiki/Hologram/Legends",
  "/wiki/Tho_Yor_Arrival",
  "/wiki/Ruhr",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Tau_(individual)",
  "/wiki/Rift",
  "/wiki/The_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Bogan",
  "/wiki/Standard_week/Legends",
  "/wiki/Daegen_Lok",
  "/wiki/Chasm",
  "/wiki/Eye/Legends",
  "/wiki/Lekku/Legends",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi_0",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Gonzalo_Flores",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_1",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_3",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_4",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_5",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_2",
  "/wiki/Category:Images_of_Kora_Ryo",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_2",
  "/wiki/Dawn_of_the_Jedi:_Force_War_3",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_5"
 ]
}