{
 "name": "Korbel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Korbel\" was the nickname of a medic-trained clone trooper captain serving in the Grand Army of the Republic during the Clone Wars. In 22 BBY, he and a squad of his men accompanied Senator Padmé Amidala to the Wild Space planet of Zigoola to rescue Jedi Master Obi-Wan Kenobi and Senator Bail Organa, who had been injured and stranded there during an investigation of the planet. After retrieving the two, the group returned to the galactic capital of Coruscant. During their flight, Korbel and his men treated Kenobi, and the Jedi was later able to make a full recovery.\nThe clone trooper nicknamed \"Korbel\" was cloned from the bounty hunter Jango Fett on Kamino to fight in the Grand Army of the Republic during the Clone Wars. Serving as a clone captain in the Republic army, Korbel was fully medic-trained. In 22 BBY, Jedi Grand Master Yoda assigned the captain and several of his troopers to help Senator Padmé Amidala retrieve Jedi Master Obi-Wan Kenobi and Senator Bail Organa from the Wild Space planet of Zigoola, where the two had been stranded during their investigation of a Sith-related threat to the Jedi Order and the Republic. Because Kenobi had been severely injured on Zigoola, Master Yoda hand-picked Korbel and his men for their medical abilities to participate in rescuing the Jedi Master.\nKorbel and five of his men met Amidala in her private Coruscant spaceport, where Korbel introduced himself and his men and became acquainted with Amidala. Once the troopers had made quarters in Amidala's H-type Nubian yacht, the group set out for the Wild Space world in the vessel using a pre-plotted hyperspace course that Yoda had provided. Arriving in orbit of the planet, Korbel commented that the Royal Yacht was the \"sweetest ship he had flown in his life\" while scanning the world for Kenobi's and Organa's lifesigns, which had also been provided by Yoda. Locating the stranded pair on the planet's night side, Korbel told Amidala that, as a safety measure, he and his men would reconnoiter the area before she disembarked, to which Amidala agreed. After Korbel and the clones had completed their inspection of the vicinity, Senator Amidala joined them on the surface of the planet. Both Organa and Kenobi had been injured, and the latter's leg was badly wounded. After briefly conferring with the two, Amidala allowed Korbel and one of his men to carry the Jedi onto the yacht. On the return trip to Coruscant, Korbel treated and administered a painkiller to Kenobi. After a week of healing in the Jedi Temple, Master Kenobi was able to make a full recovery.\nA Human male, Korbel stood 1.83 meters tall. Fully medic-trained, he was compassionate, even with his intense clone trooper training on Kamino. During the flight to Zigoola, he and his men kept a \"professional and polite\" distance from Senator Amidala and also took care of both her and themselves with efficiency. He was complimentary about the yacht's medbay and noted that the vessel was \"the sweetest ship had piloted in his life.\" After landing on Zigoola, Korbel and his men performed a reconnaissance on the nearby area for Senator Amidala's protection. Korbel and one of his men carried Kenobi onto the yacht \"with a careful tenderness\" that surprised Amidala.\nKorbel served as a minor character in the December 2008 novel The Clone Wars: Wild Space, written by Karen Miller as the second installment in The Clone Wars novel series. To date, the novel is Korbel's only appearance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Zigoola",
  "/wiki/Mission_to_Zigoola",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Army/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/H-type_Nubian_yacht/Legends",
  "/wiki/Yacht/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/December",
  "/wiki/2008",
  "/wiki/The_Clone_Wars:_Wild_Space",
  "/wiki/Karen_Miller",
  "/wiki/Star_Wars:_The_Clone_Wars_(novels)",
  "/wiki/The_Clone_Wars:_Wild_Space_(audiobook)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}