{
 "name": "Korelei",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "44 ABY",
      "Coruscant",
      "44 ABY",
      "Abeloth's planet"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark lilac"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith",
      "Abeloth"
     ]
    }
   ]
  }
 ],
 "content": "Korelei was a female Keshiri Lord of the Lost Tribe of Sith who became one of the final host bodies of Abeloth and was killed at the New Jedi Temple when Abeloth and the Lost Tribe of Sith were defeated.\nBy the time of the Lost Tribe of Sith emergence Korelei had ascended to the rank of Sith Lady. After Abeloth took over the Lost Tribe, and the Galactic Alliance, Korelei served Abeloth by torturing Wynn Dorvan for over a month.\nShortly after the Jedi began the Liberation of Coruscant, Korelei met with Abeloth to discuss the Lost Tribe's losses. When Abeloth learned that the Jedi had managed to kill about a thousand Sith she commanded Korelei to kill all the Jedi by the next dawn. Korelei explained that this wasn't possible as they had not captured any Jedi, and explained to Abeloth that Wynn Dorvan, who was now serving as her adviser, was hiding information about the Jedi. Korelei suggested revealing the Sith to the people of Coruscant, but Wynn disagreed as that would lead to open rebellion against the Sith. Korelei attempted to kill Wynn with her shikkar but Abeloth caught it and agreed with Wynn that civilian deaths were not in their interests. Wynn told Abeloth and Korelei that the best plan of attack would be to lure the Jedi to the Sith occupied Jedi Temple. After death of High Lord Ivaar Workan she was chosen as one of Abeloth's host bodies and became High Lord herself.\nKorelei was strong enough to ascend to the rank of Sith Lord within the Lost Tribe. Korelei was skilled in Force torture, which she used against Wynn Dorvan during his captivity. She was also capable of using the Force to probe an individual's mind. Later, as Abeloth's host, Korelei was strong enough to shield herself against a mine detonation. Korelei was also skilled in the use of Force lightning, which she used against Jedi during the Liberation of Coruscant.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kesh",
  "/wiki/44_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Abeloth%27s_planet",
  "/wiki/Abeloth",
  "/wiki/Keshiri",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Sith_Lord/Legends",
  "/wiki/New_Jedi_Temple",
  "/wiki/Wynn_Dorvan",
  "/wiki/Lost_Tribe_of_Sith_emergence",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Torture/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Liberation_of_Coruscant_(Lost_Tribe_of_Sith_emergence)",
  "/wiki/Duel_in_Kameron_Suldar%27s_office",
  "/wiki/High_Lord_(Circle_of_Lords)",
  "/wiki/Ivaar_Workan",
  "/wiki/Force_lightning/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Korelei",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)"
 ]
}