{
 "name": "Kori Ong",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "A planet"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "A tribe"
     ]
    }
   ]
  }
 ],
 "content": "Kori Ong was a human male native to a swamp planet. Between 32 ABY and 34 ABY, he met the pilot Poe Dameron and the droid BB-8 while he was undertaking \"The Walkabout,\" his tribe's rite of passage. Ong helped them fight against a humanoid native species and find Dameron's starship in order to make them leave the planet. In their time together, Dameron inspired him to follow his dreams to travel in the galaxy.\nKori Ong was a human male native to a swamp planet who lived with his tribe. Between 32 ABY and 34 ABY, Ong was subjected by his tribe to \"The Walkabout,\" a rite of passage that consisted in living alone in a swamp on the planet for some time.\nDuring the rite, Ong saved Resistance pilot Poe Dameron and his droid BB-8 that were being attacked by a swamp creature. After Ong kicked the creature and threw a rock at it, the creature fled. Ong claimed that he had seen the creature eat before and that Dameron and BB-8 had been lucky to survive the clash with it. The boy noticed that BB-8 had suffered damage and tried to fix him. Dameron, who had been previously knocked unconscious by the creature, woke up and thanked Ong for the rescue. Ong invited them to spend the night in his tent, where he told Dameron and BB-8 about \"The Walkabout\" and his dream of exploring the stars. Dameron answered that he was sure that Ong would achieve his goal.\nThe next day, Ong, Dameron, and BB-8 set out searching Dameron's starship, the Black One, with which Dameron had previously landed on the planet. While walking, they were captured in a net by a humanoid species native to the world. BB-8 used his torch to burn the net and free them. Ong climbed on a tree and targeted the natives with rocks. Dameron joined the fight and the indigenous, frightened by Dameron's blaster, fled. After reaching the starship, Dameron told Ong that he was brave and gave him a pin with the Resistance symbol on it. Dameron also claimed that maybe one day Ong would have joined it, an idea that excited the boy. Dameron and BB-8 left the planet, and Ong waved at them.\nA human male, Ong had light skin, brown hair, and brown eyes. After BB-8 was damaged, Ong was willing to repair him and later offered his help to Dameron and the droid. Although Ong could go back to his village, he planned to travel in the galaxy and to come back later to help his tribe.\nOng was able to climb trees and jump down from them. He also managed to defeat a creature bigger than him by using a weapon that hurled rocks. With the help of Dameron, he fought and beat several members of an indigenous species.\nOng wore a red coat along with a pink vest, a brown belt, and red shoes. He also owned a brown bag, a light-blue and brown weapon, and bands on his wrists.\nKori Ong appeared in the comic story \"An Unlikely Friendship\", published in the fifteenth issue of the comic book series Star Wars Adventures on October 31, 2018. The comic story was authored by James Gilarte and illustrated by Alain Mauricet.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_planet_(Neijaian)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Unidentified_tribe",
  "/wiki/Homeworld",
  "/wiki/Swamp",
  "/wiki/32_ABY",
  "/wiki/34_ABY",
  "/wiki/Pilot",
  "/wiki/Poe_Dameron",
  "/wiki/Droid",
  "/wiki/BB-8",
  "/wiki/The_Walkabout",
  "/wiki/Humanoid",
  "/wiki/Unidentified_species_(Neijaian)",
  "/wiki/Starship",
  "/wiki/Planet",
  "/wiki/Time",
  "/wiki/The_galaxy",
  "/wiki/Resistance",
  "/wiki/Unidentified_swamp_creature",
  "/wiki/Diet",
  "/wiki/Tent",
  "/wiki/Star",
  "/wiki/Standard_day",
  "/wiki/Black_One",
  "/wiki/Torch",
  "/wiki/Tree",
  "/wiki/Blaster",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Weapon",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Belt",
  "/wiki/Star_Wars_comic_books",
  "/wiki/An_Unlikely_Friendship",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/October_31",
  "/wiki/2018",
  "/wiki/James_Gilarte",
  "/wiki/Alain_Mauricet",
  "/wiki/Star_Wars_Adventures_(2017)_15",
  "/wiki/Category:Images_of_Kori_Ong",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Resistance_Revisited",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/Battle_of_Endor",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars_Resistance"
 ]
}