{
 "name": "Korin_Pers",
 "display_name": "Korin Pers",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "During the theft of the Imperialis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugnaught"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Left eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "University of Bar'leth"
     ]
    }
   ]
  }
 ],
 "content": "Korin Pers was a female Ugnaught scholar who held the position of sava at the University of Bar'leth in the Core Worlds during the reign of the Galactic Republic. As an expert on various types of antiquities, she wrote works published throughout the Republic, although she eventually left the university. At some stage she worked with the smuggler Lando Calrissian and lost her left eye in the process, forcing her to get a cybernetic replacement and causing her to greatly dislike Calrissian despite the smuggler promising he would someday make up for the Ugnaught's injury if he could.\nDespite her animosity towards Calrissian, she agreed to help him steal an Imperial pleasure craft potentially full of antiques for the crime lord Papa Toren. However, this heist attracted the attention of Emperor Palpatine, who was unwilling to let his yacht fall into the wrong hands. During the adventure, Korin and her companions discovered that the Imperialis housed Sith artifacts that were capable of corrupting sentient beings. After being corrupted by a Sith helmet belonging to Sith Lord Darth Momin, Korin decided to turn on Calrissian but was murdered by the corrupted alien warrior Aleksin, a renegade member of Lando's crew.\nDuring the reign of the Galactic Republic, Korin Pers served as a sava of the University of Bar'leth in the Core Worlds as an expert on many types of antiquities and ancient cultures including the Jedi. She wrote works published throughout the Republic. In her long studies, she found only scraps related to the Sith. Particularly, she came across stories involving the Sith and their relation to corruption, which she admits were actively suppressed by the Jedi and possibly anti-Sith propaganda.\nSometime after the Great Jedi Purge and the Galactic Empire's rise to power, Pers lost her position and fell into disgrace when the Jedi and their history was no longer a permissible study. She then found work with smugglers and other criminals.\nLater, before the theft of the Imperialis, Pers took a job with Lando Calrissian that resulted in the loss of her left eye, which was substituted with a cybernetic replacement. Although Calrissian promises to repay the Ugnaught, Pers still greatly disliked Calrissian.\nWhen Calrissian and his companion Lobot received a job from crime lord Papa Toren to steal the Imperialis, Calrissian enlisted the aid of Pers in order to identify antiquities on board. Despite pointing a blaster at Calrissian and claiming that almost nothing could make her want to work with Calrissian, Pers decided to join Calrissian once seeing the datapad with information about the job. Calrissian revealed that the job was stealing an Imperial pleasure craft full of potential rare and priceless antiquities. While Toren would receive the ship, the group could keep anything inside the starship. She then assisted Calrissian, Lobot, Aleksin, and Pavol in stealing the Imperialis. The group used stealth suits provided by Toren to successfully infiltrate Sienar Fleet Systems Orbital Shipyard CC-24, where the ship was being refitted, and steal it.\nIn the Castell system near Orbital Shipyard CC-24, the Imperialis was attacked by three Imperial Star Destroyers while Pers surveyed the ship. Upon feeling the Imperialis thrum as the ship's automatic defense system destroy the gravity-based mines deployed by the Star Destroyers, Pers, Aleksin, and Pavol entered the cockpit where Calrissian and Lobot were present. Outside the viewport, Pers spotted a Star Destroyer and reprimanded Calrissian for risking their lives. Calrissian navigated the Imperialis away from the Star Destroyers. Once safely in deep space, Pers claimed the ship was full of treasures, including a Gungan fertility totem. While guiding the group through the ship, Pers suggested the Imperialis was a work of art, custom created by Raith Sienar, who supposedly kept his unique technology for preferred clients. She then pointed out the central chamber, which was well secured. Using his implants, Lobot opened the chamber and was stabbed by an Imperial Royal Guard on the other end.\nWhile Aleskin and Pavol dealt with the two Royal Guards, Pers helped Calrissian take the injured Lobot to the medical bay and into a bacta tank that she had found earlier during her survey. Pers identified the ship belonging to Emperor Palpatine and reprimanded Calrissian for the impending doom that the smuggler had brought on them all. After a visit to the armory, Pers and Calrissian returned to help the twins but found that the twins had killed the Royal Guards. Pers proceeded to take the helmet of one of the dead guards, finding the corrupted face of the guard. Tossing the helmet aside, Pers continued into the central chamber to find the something that the guards were left to protect. In the central chamber, Pers identified the numerous antiquities as being priceless Sith artifacts.\nMeanwhile, a bounty hunter serving Emperor Palpatine named Chanath Cha boarded the Imperialis in hopes of recovering the starship for the Emperor. After identifying the artifacts as being created by the Sith sculptor, Darth Momin, Pers told Calrissian that the price of the artifacts could be worth enough credits for a moon or two to the correct buyer. However, the mask of Lord Momin corrupted Aleskin, who grabbed a red lightsaber and attacked Pavol. Calrissian and Pers escaped Aleskin and closed the central chamber. Reflecting on her past research into the Sith, Pers suggested that proximity to the Sith artifacts might have corrupted the Royal Guards and Aleksin. Pers decided to find an escape pod, recommending Calrissian and Lobot do the same.\nHowever, Chanath Cha had deactivated the escape pods. While heading to the bridge to reactivate the escape pods, Pers was captured at gunpoint by Cha and refused to disclose information about other members of her crew. Although Calrissian failed to rescue Pers, the bounty hunter recognized Calrissian and lowered her blasters. Cha told the two that she would help them escape and proceeded to self-destruct the ship despite the pleas of Pers and Calrissian for assistance in stealing the artifacts. Once Calrissian brought up Lobot, Cha stopped inputting the self-destruct codes. Suddenly, Aleksin and Pavol appeared and provided Pers the opportunity to join their side. After being handed the helmet artifact, Pers decided to join the twins and kill the others. Aleksin then stabbed Pers through the chest with a red lightsaber.\nKorin Pers was a female Ugnaught. She sustained a cybernetic eye while helping the smuggler Lando Calrissian on one of his jobs. Korin Pers was once the respected Sava at the University of Bar'leth who specialized in the study of ancient antiquities including Jedi and Sith relics. After losing her position, Pers took a job with Calrissian. She disliked Calrissian after losing her left eye during that job. Despite her hostility, she agreed to work with Calrissian after learning that he and his associates plan to steal a luxurious Imperial yacht.\nPers regarded Palpatine's luxury yacht, the Imperialis, as a work of art and believed that the ship's Sith relics would make them rich. After discovering that the Sith artifacts had corrupted the Royal Guards aboard and Aleksin and Pavol, she recommended fleeing the ship. When captured by the bounty hunter Chanath Cha, Pers refused to betray her fellow crew. Due to her academic interest in artifacts and history, Pers objected to Chanath's plan to destroy the ship. Pers was corrupted by the dark side influence inside the Sith helmet aboard the Imperialis and decided to join the twins and kill the others. However, Aleksin killed her with a red lightsaber.\nKorin Pers was the respected Sava who was a reputable expert on ancient antiquities during the last decades of the Galactic Republic. After research into Jedi artifacts fell out of favor, Pers was forced to ply her skills to helping smugglers like Lando Calrissian steal artifacts in order to survive.\nKorin Pers first appeared as a secondary character Star Wars: Lando, a comic book published in 2015 which was written by Charles Soule and illustrated by Alex Maleev.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Doctor_Aphra_(2016)_1",
  "/wiki/Crimson_Reign_3",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Special:Upload",
  "/wiki/Theft_of_the_Imperialis",
  "/wiki/Ugnaught",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/University_of_Bar%27leth",
  "/wiki/Scholar",
  "/wiki/Sava",
  "/wiki/Core_Worlds",
  "/wiki/Galactic_Republic",
  "/wiki/Smuggler",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Cybernetics",
  "/wiki/Optical_implant",
  "/wiki/Imperialis",
  "/wiki/Crime_lord",
  "/wiki/Parent",
  "/wiki/Toren",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_artifact",
  "/wiki/Mask_of_Lord_Momin",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Momin",
  "/wiki/Alien",
  "/wiki/Aleksin",
  "/wiki/Jedi",
  "/wiki/Sith",
  "/wiki/Propaganda",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Galactic_Empire",
  "/wiki/Lobot",
  "/wiki/Blaster",
  "/wiki/Datapad",
  "/wiki/Starship",
  "/wiki/Pavol",
  "/wiki/Stealth_suit",
  "/wiki/Sienar_Fleet_Systems",
  "/wiki/Orbital_Shipyard_CC-24",
  "/wiki/Castell_system",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Gravity_mine",
  "/wiki/Gungan_fertility_totem",
  "/wiki/Raith_Sienar",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Medical_bay",
  "/wiki/Bacta_tank",
  "/wiki/Bounty_hunter",
  "/wiki/Chanath_Cha",
  "/wiki/Sculptor",
  "/wiki/Credit",
  "/wiki/Moon",
  "/wiki/Lightsaber",
  "/wiki/Escape_pod",
  "/wiki/Bridge_(starship)",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Star_Wars:_Lando_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/2015",
  "/wiki/Charles_Soule",
  "/wiki/Alex_Maleev",
  "/wiki/Han_Solo_%26_Chewbacca_9",
  "/wiki/Lando_1",
  "/wiki/Lando_2",
  "/wiki/Lando%27s_Big_Score",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Lando_3",
  "/wiki/Lando_4",
  "/wiki/Lando_5",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_63",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith"
 ]
}