{
 "name": "Kornov",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Captain Kornov was a former starfighter pilot who served aboard the first Death Star as an assistant to Admiral Conan Antonio Motti.\nAfter graduating from the Academy with honors and commendations, Kornov served a brief tour of duty as a starfighter pilot before being transferred to command school, where he excelled in his studies. After graduating from command school, Kornov was given command of a Strike-class medium cruiser, which was later responsible for summarily crushing a Rebel attack on an Imperial installation. Because of this, he received commendations and was assigned to Admiral Motti and the Death Star Project\nKornov was an idealistic young man who took pride in his uniform, and held a belief that the Rebellion against the Galactic Empire was a shamelessly criminal act of unwarranted aggression. He inspired loyalty and hard work in his men and reflected this to his commanders. The epitome of an Imperial officer, Kornov was young, strong and handsome. He desired to serve the Empire to the best of his abilities, and he demanded the same of those who served under him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Conan_Antonio_Motti/Legends",
  "/wiki/Academy",
  "/wiki/Strike-class_medium_cruiser",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Death_Star_Technical_Companion",
  "/wiki/Death_Star_Technical_Companion_(Second_Edition)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}