{
 "name": "Korsin_Fenn",
 "display_name": "Korsin Fenn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Korsin Fenn was a male Bothan, who ran the The Spyder, a Sabacc parlor on Coruscant.\nFenn oversaw the day-to-day operations of The Spyder, resolving any dispute that might occur among the patrons. Fenn was a reserved individual and was very reluctant to divulge any information on his patronage. However, he warmed quickly to people that he found trustworthy and was particularly fond of fellow Bothans.\nAt some point Fenn became involved in Pyke Syndicate affairs, as a group of spacers, working for the latter entered his parlor in the search for Kaa'to Leeachos who had betrayed the Pykes for the Black Sun. Although in principle reluctant to share information about his patronage, Fenn felt a bond with one of the spacers - namely, a fellow Bothan and member of Fenn's clan, Jovel Nial. Jovel and her colleagues managed to persuade Fenn into providing information on Leaachos, who had been banned from The Spyder for owing the place around 20,000 credits. Because The Spyder was frequented by Black Sun operatives, Fenn could also point the spacers to Black Sun individuals that were useful to be in contact with. In exchange for this information, the spacers agreed to help Fenn get his money back.\nFenn appears in the Under a Black Sun scenario. Promising to help him get his money back is presented in the scenario as a negotiation strategy to get the information from Fenn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Spyder",
  "/wiki/Sabacc/Legends",
  "/wiki/Sabacc_parlor",
  "/wiki/Pyke_Syndicate/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Kaa%27to_Leeachos",
  "/wiki/Black_Sun/Legends",
  "/wiki/Jovel_Nial",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Under_a_Black_Sun"
 ]
}