{
 "name": "Kosa-Yin_Hadu",
 "display_name": "Kosa-Yin Hadu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Believers"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kin-Ya Dosun"
     ]
    }
   ]
  }
 ],
 "content": "Kosa-Yin Hadu was a Gungan male Sith cult member who lived during the waning years of the Galactic Republic. Originally a member of the Jedi Order, Hadu trained as the Padawan of Jedi Knight Kin-Ya Dosun, a fellow Gungan. In about 33 BBY, the pair was dispatched on a mission from the Jedi Temple on the planet Coruscant, but they subsequently disappeared. At some point, Hadu fell to the dark side of the Force and became a member of the Believers, a Sith cult that was based on the planet Almas. Circa 31 BBY, Hadu and the Mon Calamari Dark Jedi Gar Granga were sent by Garvin Delquist, the leader of the Believers, to poison Almas's kaluthin plants as part of a Believer plot to drive the Jedi—who operated a training facility on Almas—off the planet. However, the plot was uncovered by a group of freelance agents, who attacked and defeated Hadu and his Believer compatriots.\nThe Force-sensitive Kosa-Yin Hadu was a Gungan male who joined the Jedi Order during the waning years of the Galactic Republic. Hadu became a Jedi Padawan and studied under the tutelage of Jedi Knight Kin-Ya Dosun, a fellow Gungan. The Padawan constructed his own lightsaber, and he trained to become one of the Jedi Guardians, a branch of the Jedi Order that focused on developing their combat abilities. In about 33 BBY, Hadu and Dosun were dispatched on a mission from the Jedi Temple on the planet Coruscant, but the pair subsequently disappeared. Hadu fell to the dark side of the Force and became a Dark Jedi, and he eventually joined the Believers, a Sith cult that was based in a Sith fortress on the planet Almas, in the Cularin system. At some point, the Gungan infused the focusing crystals inside his lightsaber with the power of the dark side, causing the crystals to filter powerful dark side energy into anyone who wielded the weapon.\nCirca 31 BBY, Garvin Delquist—the leader of the Believers—tasked Hadu and the Mon Calamari Dark Jedi Gar Granga with killing Almas's kaluthin plants. The kaluthin had been created by the Sith Lord Darth Rivan thousands of years earlier to make Almas habitable, and Delquist believed that destroying the plants would help the Believers drive the Jedi Order away from Almas, where the Order operated a training facility. A group of Believers led by Hadu and Granga established a temporary camp on an Almas hilltop and erected a tent to serve as Hadu's field office and personal quarters. Using the camp as a base, the Believers attacked kaluthin farms across Almas over a period of three months, poisoning many of the planet's aquifers with a biological toxin and causing large swaths of kaluthin to die. Agitated by the attacks on their crops, some of Almas's kaluthin farmers blamed the Jedi Order for the death of their plants. In an attempt to further escalate tensions between the farmers and the Jedi, Hadu visited the cantina Building 49-A in the city of Forard and bad-mouthed the Jedi while in the presence of a number of farmers.\nThe scientists at a kaluthin research station on Almas started to investigate the areas of kaluthin extinction, and Hadu and Grangra feared that the station posed a risk to the Believers' operation, believing that the researchers might be able to identify the toxins that the Believers were using to poison the aquifers. In an attempt to mitigate the threat posed by the scientists, Hadu, Granga, and several other Believers traveled to the planet Cularin, where they plotted to stop a shipment of supplies from being transported to the research station, to prevent the scientists from performing their studies. The supplies were due to be taken to Almas by the Duros Welrin Maduk aboard the freighter Fool's Paradise, so the two Dark Jedi headed to the Fool's Paradise's landing bay in the city of Hedrett with some other Believers, planning to hijack the vessel. As a safeguard, Hadu and Granga parked a starship on a landing pad near the Fool's Paradise and then concealed their craft and an exit from the Fool's Paradise's landing bay using a Force illusion. The Dark Jedi duo then approached the Fool's Paradise while accompanied by a squad of battle droids and three other Believers, and the pair told Welrin Maduk that they had been sent by the port authority. Maduk protested and claimed that his ship had already been inspected, so Hadu and Granga ignited their lightsabers and prepared to attack the Duros. However, the Heroes of Cularin, a group of freelance agents who operated in the Cularin system, saw that Maduk was being threatened, and they came to his rescue. As the agents approached the Fool's Paradise, Hadu and Granga fled through the concealed hangar entrance, leaving the battle droids and the other Believers to face the agents alone.\nHadu returned to the Believers' hilltop camp on Almas, where he received a holographic message from Garvin Delquist, who warned him and Granga that the Jedi had learned of the Believers' presence on Almas and urged the two Dark Jedi to accelerate the timetable of their work to poison the kaluthin. The Heroes of Cularin investigated the poisoning of the aquifers, and they launched an assault on the Believers' encampment. After being alerted of the attack, Hadu emerged from his tent and engaged the agents in combat along with some of his guards, while the other Believers powered up their landspeeders in preparation to evacuate the camp. The agents eventually defeated Hadu and his Believer subordinates, thwarting the Gungan's attempts to wipe out the kaluthin. The Jedi learned Hadu's identity, and Jedi Master Seenlu Kir began to research the mission on which Hadu and Kin-Ya Dosun had disappeared, in an attempt to discover how the two Gungans had been lost. However, her research was unsuccessful, for she did not learn anything new about the two Gungans.\nKosa-Yin Hadu was an angry individual who was happy to persecute and torture other people in order to achieve his aims. He wore an All-Temperature Cloak and was equipped with both a lightsaber and a heavy blaster pistol. Although he originally studied as a Jedi Padawan, he later turned his allegiance to the Sith cult of the Believers.\nHadu mastered a number of Force powers, and he was able to use the Force to sense things, grip objects, heal himself, augment his fighting spirit, and boost his combat abilities. In addition, he was able to use the powers of Force hatred and Force rage when fighting against his opponents. Hadu was multi-lingual and could speak Gungan and Mon Calamarian in addition to Galactic Basic Standard.\nKosa-Yin Hadu was created by Adam Burns for The Kaluthin Are Always Greener, a 2002 role-playing supplement that formed part of the Almas, Sweet Almas trilogy of the Living Force campaign. In the supplement, the player characters role-play as the Heroes of Cularin, and when the agents confront Hadu at the Believers' encampment on Almas, the Gungan's level of combat prowess is dependent on the players' role-playing experience tier. If the players are in the lower role-playing tier, Hadu is weakened as a result of expending large amounts of Force energy to terrorize some farmers earlier in the day, and during combat, he does not use the Force to heal himself, because he does not believe that the agents are worth the effort. If the players are in the medium tier, Hadu has used up some of his Force energy to intimidate some innocent beings prior to the agents' assault, and during the attack, he considers using the Force to heal himself if the players pose a danger to him. If the player characters are in the higher role-playing tier, Hadu is at full strength when he engages the agents in combat. When the players' battle against Hadu comes to a conclusion, the Gungan can either be killed or escape. If the agents kill him, it is possible for one of the player characters to loot Hadu's lightsaber.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Believers",
  "/wiki/Kin-Ya_Dosun",
  "/wiki/Sith/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_cult/Legends",
  "/wiki/Almas",
  "/wiki/31_BBY/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gar_Granga",
  "/wiki/Garvin_Delquist",
  "/wiki/Poison/Legends",
  "/wiki/Kaluthin",
  "/wiki/Plant/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Cularin_system",
  "/wiki/Lightsaber_crystal",
  "/wiki/Crystal/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Rivan",
  "/wiki/Tent/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Aquifer",
  "/wiki/Cantina/Legends",
  "/wiki/Building_49-A",
  "/wiki/City/Legends",
  "/wiki/Forard",
  "/wiki/Scientist/Legends",
  "/wiki/Forard_research_station",
  "/wiki/Cularin/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Welrin_Maduk",
  "/wiki/Freighter/Legends",
  "/wiki/Fool%27s_Paradise",
  "/wiki/Hangar/Legends",
  "/wiki/Hedrett",
  "/wiki/Starship/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Time/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Seenlu_Kir",
  "/wiki/Torture/Legends",
  "/wiki/All-Temperature_Cloak",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Battlemind",
  "/wiki/Hatred",
  "/wiki/Force_rage",
  "/wiki/Language/Legends",
  "/wiki/Gungan_Basic",
  "/wiki/Mon_Calamarian",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Adam_Burns",
  "/wiki/The_Kaluthin_Are_Always_Greener",
  "/wiki/2002",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Almas,_Sweet_Almas_trilogy",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Roleplaying_game",
  "/wiki/A_Dark_Fortress",
  "/wiki/Star_Wars_Roleplaying_Game_Revised_Core_Rulebook",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Caaried_Away"
 ]
}