{
 "name": "Kosh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "68th Legion",
      "Imperial Officer Corps",
      "68th Legion",
      "Imperial Officer Corps",
      "Kosh's private smuggling operation"
     ]
    }
   ]
  }
 ],
 "content": "Kosh was a human male from Tatooine who served as an Imperial captain during the time of the Galactic Civil War. Shortly after the Battle of Yavin, Kosh was stationed on his homeworld as the commander of the 68th Legion of the Imperial Army, the local garrison. During his tenure, Kosh created a private smuggling operation, overseeing the conflict against Jennica Pierce's local Rebel Alliance cell.\nAt some point, a Rebel agent serving under Pierce managed to destroy Fort Sunfire, one of the main Imperial garrisons on Tatooine. In retaliation, Kosh attacked the agent's own base with an armored cavalry contingent comprising nine All Terrain Scout Transports, one Elite AT-AT, and two 2-M Hover Tanks. The Rebels, however, survived Kosh's mechanized assault. As a result, the Imperial captain decided to attack again, sending half the 68th Legion to the Rebel base, but that second assault failed as well. With the full brunt of his troops defeated, Kosh was forced to be on the defensive. Although he knew the location of the Rebel base, he simply could not attack it anymore. Those events effectively started a contained conflict between Kosh and the local Rebels.\nSome time later, Kosh was made a prefect. However, in the months that followed the Empire's major defeat at Endor, he was captured by a team of Imperial hunters led by pilot Norra Wexley. Kosh became a prisoner of the New Republic, the democratic government established by the Rebels.\nA light-skinned man with a straight nose and blue eyes, Kosh would often pull a contemptuous expression. By the time of the Galactic Civil War, his once-black hair had become gray. To achieve the goals of the Empire, Kosh manipulated both his allies and enemies as pawns. He also had an unusual interest in ancient artifacts.\nKosh wore the standard uniform of the Imperial Military, which consisted of a double-breasted tunic with matching trousers, black leather belt, black boots, and a hat. On the left side of the upper chest, he sported the insignia of an army captain, featuring three red tiles over three blue ones. Although Kosh did not have any code cylinders, his cap and belt were equipped with an identity disc.\nKosh is the character who assigns missions in Star Wars: Commander if the player chooses to align with the Empire. If the player chooses the Rebellion, they deal with Jennica Pierce.\nWhile Star Wars: Commander is his first canon appearance, Kosh originally appeared in the now-Legends book Heroes in Hiding.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kosh",
  "/wiki/Kosh/Legends",
  "/wiki/Galactic_Empire",
  "/wiki/Captain",
  "/wiki/Kosh_(tea)",
  "/wiki/Admiral/Legends",
  "/wiki/Kosh_Teradoc",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/68th_Legion",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Kosh%27s_private_smuggling_operation",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Yavin",
  "/wiki/Homeworld",
  "/wiki/Commander",
  "/wiki/Imperial_Army",
  "/wiki/Garrison",
  "/wiki/Operations_on_Tatooine",
  "/wiki/Jennica_Pierce",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Tatooine_rebel_cell",
  "/wiki/Saponza%27s_partner",
  "/wiki/Fort_Sunfire",
  "/wiki/Saponza%27s_homestead",
  "/wiki/Armored_cavalry",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Elite_AT-AT",
  "/wiki/2-M_Hover_Tank",
  "/wiki/Troop",
  "/wiki/Battle_for_Tatooine",
  "/wiki/Time",
  "/wiki/Prefect_(Galactic_Empire)",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Endor",
  "/wiki/Endor",
  "/wiki/Norra_Wexley%27s_team",
  "/wiki/Imperial_hunter",
  "/wiki/Pilot",
  "/wiki/Norra_Wexley",
  "/wiki/Prisoner",
  "/wiki/New_Republic",
  "/wiki/Democracy",
  "/wiki/Nose",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Imperial_Military",
  "/wiki/Leather",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Hat",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Code_cylinder",
  "/wiki/Officer%27s_disk",
  "/wiki/Star_Wars:_Commander",
  "/wiki/Star_Wars_Legends",
  "/wiki/Heroes_in_Hiding",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Kekit"
 ]
}