{
 "name": "Kouru",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "20 years after the Sith rebellion",
      "Genbara"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith demon"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Approx. 2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Medium skin tone"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith",
      "Unidentified bandit group"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kouru's master"
     ]
    }
   ]
  }
 ],
 "content": "Kouru was a female Sith and self-styled Dark Lord who led a gang of bandits twenty years after her participation in the failed Sith rebellion. Her gang attacked a village for loot and plunder.\nThe former Dark Lord known as the Ronin defended the village her gang had attacked, leading Kouru to duel him. Kouru wielded a lightsaber parasol against the Ronin's lightsaber. Her opponent bested and killed Kouru by stabbing her through the chest. Despite her death, Mirahi revived her as a Sith demon to seek revenge.\nKouru was a Force-sensitive female Sith who lived during the time of the Empire. When she was young and newly taken by the Jedi, she was constantly agitated and displaying her emotions through fighting, crying, and screaming. She would not later remember the name of a Jedi Master who would use the black current of the Force to calm her down, but the memory of that contributed to considering herself rescued by the Sith; as a Sith, she had been free to scream.\nHer training in the Force continued with her Sith master. Although the two would frequently quarrel, they still loved and served each other. While still young, she participated in the failed Sith rebellion that was led by a Dark Lord of the Sith, later known only as the Ronin, and by a Sith witch. Kouru was immediately enamored with the witch, but only knew her from a distance.\nAfter killing a Jedi on a battlefield, her master directed her to destroy the Jedi's lightsaber to take the kyber crystal from within and use it to build a Sith lightsaber. She had disliked the process herself, but she told Kouru that it was better to take a crystal and make it their own. Kouru's master supplied the holographic blueprints that had been created by the dark lord and were transmitted between Sith cells. Soon after Kouru finished constructing her blade, the dark lord sent lightsaber auxiliary plans for further customization. Kouru's master had reforged her own lightsaber into a shining red fan; Kouru in turn made a parasol auxiliary to create her lightsaber parasol.\nWhen the dark lord turned against his fellow Sith, he summoned them to his flagship. Kouru and her master were aboard when the Sith were betrayed by their own leader, who began tearing his starship apart while they were still aboard. Not realizing the cause, Kouru thought she would be facing intruders alongside her master. Instead, her master fooled her into boarding an escape pod and lied that she would follow after. Kouru could only witness through the viewport as the dark lord struck down her master. The traumatic experience gave her a fear of the black emptiness of space.\nTwo decades after the Sith rebellion ended, many Sith had been hunted down by the Jedi knights. Kouru continued to operate and lead a bandit gang of former Sith soldiers on the Outer Rim planet of Genbara, and believed herself the sole surviving Sith in that sector of the galaxy. Kouru styled herself as a Dark Lord, but she also inwardly regarded herself as a lord of the muck.\nKouru led her bandit gang to attack a village for plunder. She was challenged to a lightsaber duel by the Ronin, whose voice reminded her of someone she had once known; unbeknownst to Kouru at the time, the Ronin had once been the dark lord she had served. He killed her in combat, destroyed her lightsaber parasol, looted her kyber crystal, and gave the crystal to the child chief of the village to ward off evil.\nDespite her death, Kouru awoke in the temple without injury and heard a voice speaking into her mind, encouraging revenge against the Ronin. The voice was Mirahi, daughter of the Ronin and the Sith witch, who had resurrected Kouru as a Sith demon.\nKouru had a medium skin tone, white hair, and amber-colored eyes. She had a white marking in the center of her forehead. When she was not wearing a headdress, her voluminous hair billowed outward and upward in three sections. On either side of her face, she had a dark line from the inner corner of the eyes to the outer edge of her lower jaw. The tops of her ears came to points. She was approximately two meters tall.\nKouru relished killing those who lived by no creed and looked down on bounty hunters and mercenaries who lived for credits.\nAlthough Kouru could wield either aspect of the Force, she had a greater affinity for the white flare than the black current. She had a distaste for the black current in part because of how it resisted her control as well as because of the way it had been used on her.\nKouru wore black attire that included chest armor, a black cloak and veil, booted heels that were approximately ten centimeters tall, and a lacquered armor half-mask that depicted a long-toothed demonic grin. She wore dark trousers with a loose fit, gauntlets and gloves on both arms, and a wide belt tied in the back.\nUntil its destruction by the Ronin, she wielded her lightsaber parasol. It appeared to be a short staff when its auxiliary was not expanded outward like a parasol's canopy.\nKouru was created for \"The Duel,\" a short film in the Star Wars: Visions series produced by Kamikaze Douga and directed by Takanobu Mizuno. Her character design was created by Takashi Okazaki, who designed the Sith Bandit Leader as an homage to onna-musha, female samurai warriors in feudal Japan. In the Filmmaker Focus featurette, Kamikaze Douga founder and \"The Duel\" creative producer Jumpei Mizusaki described her as having both an elegant style and a sadistic aspect. The character was voiced by Akeno Watanabe in Japanese and by Lucy Liu in the English dub.\nKouru was initially identified as \"Sith Bandit Leader\" and \"Bandit Leader\" on StarWars.com, with the latter also appearing in the credits of \"The Duel;\" she was first identified by the name \"Kouru\" in Ronin: A Visions Novel, which was written by Emma Mieko Candon. On Tumblr, Candon shared that the character's name was derived from the Japanese phonemes \"ni-kou-ru\" that had been used to render her wife's name, \"Nichole,\" while working in Japan.\nA poster created for \"The Duel\" reimagines Kouru as a pop idol on a poster for a concert in the Genbara village. This depiction of Kouru has bright green hair, light pink skin, and large red eyes, and she wears purple and gold armor. Her armor is described as black in the episode guide and in Ronin: A Visions Novel, with the latter also describing her with white hair and \"fire and amber\" eyes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Standard_year",
  "/wiki/Sith_rebellion",
  "/wiki/Genbara",
  "/wiki/Sith_demon",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Sith",
  "/wiki/Unidentified_bandit_group",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Unidentified_village_(Genbara)",
  "/wiki/The_Ronin",
  "/wiki/Lightsaber_duel",
  "/wiki/Lightsaber_parasol",
  "/wiki/Lightsaber",
  "/wiki/Death",
  "/wiki/Mirahi",
  "/wiki/Force-sensitive",
  "/wiki/Empire_(feudal)",
  "/wiki/Youngling",
  "/wiki/Jedi",
  "/wiki/Jedi_Master",
  "/wiki/Black_current_of_the_Force",
  "/wiki/The_Force",
  "/wiki/Unidentified_witch",
  "/wiki/Kyber_crystal",
  "/wiki/Sith_lightsaber",
  "/wiki/Hologram",
  "/wiki/Lightsaber_auxiliary",
  "/wiki/Parasol_auxiliary",
  "/wiki/Flagship",
  "/wiki/Starship",
  "/wiki/Escape_pod",
  "/wiki/Viewport",
  "/wiki/Realspace",
  "/wiki/Standard_decade",
  "/wiki/Jedi_knight_(feudal)",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Sector",
  "/wiki/The_galaxy",
  "/wiki/Skirmish_of_unidentified_village_(Genbara)",
  "/wiki/Unidentified_child_village_chief",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Ear",
  "/wiki/Bounty_hunter",
  "/wiki/Mercenary",
  "/wiki/Credit",
  "/wiki/White_flare_of_the_Force",
  "/wiki/Armor",
  "/wiki/Cloak",
  "/wiki/Boot",
  "/wiki/Centimeter",
  "/wiki/Tooth",
  "/wiki/Demon",
  "/wiki/Gauntlet",
  "/wiki/Glove",
  "/wiki/Belt",
  "/wiki/Staff",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Kouru",
  "/wiki/The_Duel_(short_film)",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Kamikaze_Douga",
  "/wiki/Takanobu_Mizuno",
  "/wiki/Takashi_Okazaki",
  "/wiki/Star_Wars:_Visions_Filmmaker_Focus",
  "/wiki/Akeno_Watanabe",
  "/wiki/Lucy_Liu",
  "/wiki/StarWars.com",
  "/wiki/Ronin:_A_Visions_Novel",
  "/wiki/Emma_Mieko_Candon",
  "/wiki/File:The-duel-poster.jpg",
  "/wiki/Category:Images_of_Kouru",
  "/wiki/Ronin:_A_Visions_Novel_(audiobook)",
  "/wiki/Star_Wars"
 ]
}