{
 "name": "Kr%27saang",
 "display_name": "Kr'saang",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1032 BBY",
      "Darkknell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.5 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Emerald"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Specialist Unit Two Hundred Seven"
     ]
    }
   ]
  }
 ],
 "content": "Kr'saang, who insisted that others refer to him as Kr'saang the Togorian, was a male Togorian mercenary during the Republic Dark Age. He led the Specialist Unit Two Hundred Seven brigade of shock troopers and owned the vessel Dar'oosh. In 1032 BBY, he was invited along with several other mercenaries to the Sanctum Celestial on Darkknell by the Sith Lord Daiman. Daiman, planning a trap for his brother, Odion, hired the mercenaries to prepare an ambush at the planet Gazzari. However, when Kr'saang expressed anger at the Sith Lord, who preferred sabotage and ambushes over straight-up fights, Daiman swiftly cut the Togorian into four pieces with his lightsaber. Kr'saang's forces were then inducted into Daiman's slave army.\nDuring the Republic Dark Age, the male Togorian mercenary Kr'saang led a brigade of shock troopers known as the Specialist Unit Two Hundred Seven, operating from the transport vessel Dar'oosh. In 1032 BBY, the Sith Lord Daiman invited Kr'saang and several other mercenaries, including Jarrow Rusher and Mak Medagazy, to the Sanctum Celestial in Darkknell's capital city, Xakrea. Predicting that they had been invited because Daiman was too cowardly to fight his own battles, Kr'saang pushed brutishly ahead of his fellow mercenaries to be first in line to meet Daiman. His prediction was proven correct when Daiman informed them of his plan to ambush his brother, Odion, at the volcanic world Gazzari. While the other mercenaries remained silent, Kr'saang brashly denied Daiman his services, refusing to participate in anything other than a straight-up fight. However, before Kr'saang could leave, Daiman threw his cape on the ground in front of the Togorian and charged him with his lightsaber. Too slow to defend himself with his blade, Kr'saang was killed when Daiman cut him into four pieces. Daiman then ordered his aide, Uleeta, to send Correctors—Daiman's Sith police—to induct Kr'saang's shock troopers and the Dar'oosh into his slave army.\nAt two-and-a-half meters, the black-furred, emerald-eyed Kr'saang—who insisted on being referred to as \"Kr'saang the Togorian\"—was a fearsome sight, and he was well aware of it. Impatient, he was not afraid to use brute force to get what he wanted, as demonstrated when he pushed ahead of his fellow mercenaries on Darkknell to meet Daiman. Not intimidated by political power, Kr'saang brutishly defied the orders of Lord Daiman, insisting he would not participate in ambushes. His arrogance, however, proved to be his downfall when he angered the Sith Lord, as his impressive stature and the blade he carried hidden in his belt were no match for the power of a lightsaber.\nKr'saang was created by John Jackson Miller for use in his first professional novel, Knight Errant, which was released on January 25, 2011.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/1032_BBY/Legends",
  "/wiki/Darkknell/Legends",
  "/wiki/Togorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Specialist_Unit_Two_Hundred_Seven",
  "/wiki/Mercenary/Legends",
  "/wiki/Republic_Dark_Age",
  "/wiki/Brigade/Legends",
  "/wiki/Shock_trooper/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Dar%27oosh",
  "/wiki/Sanctum_Celestial",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Daiman",
  "/wiki/Odion",
  "/wiki/Battle_of_Gazzari",
  "/wiki/Planet/Legends",
  "/wiki/Gazzari",
  "/wiki/Sith/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Army/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Jarrow_Rusher",
  "/wiki/Mak_Medagazy",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Xakrea",
  "/wiki/Volcano/Legends",
  "/wiki/Cape/Legends",
  "/wiki/Death/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Uleeta",
  "/wiki/Corrector",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Politics/Legends",
  "/wiki/John_Jackson_Miller",
  "/wiki/Knight_Errant_(novel)",
  "/wiki/January_25",
  "/wiki/2011",
  "/wiki/StarWars.com",
  "/wiki/The_New_Essential_Chronology"
 ]
}