{
 "name": "Kragan_Gorr",
 "display_name": "Kragan Gorr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Left forearm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grox's pirate crew",
      "Warbird gang",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Kragan Gorr was a male Quarren pirate who operated during the New Republic Era. Gorr led the Warbird gang and secretly worked for the First Order. After raiding the Colossus refueling platform on behalf of the First Order, Gorr and his pirates turned against their First Order employers when the latter tricked them into kidnapping Torra Doza, the daughter of Captain Imanuel Doza, in order to gain a pretext for occupying the refueling platform.\nGorr and his pirates later helped Team Colossus led by Kazuda Xiono and Jarek Yeager to expel the First Order from the Colossus before fleeing into space with their former enemies.\nEarly in the Galactic Civil War, Kragan Gorr was part of a pirate crew led by the Lasat Grox. The gang was hired to steal ships for the Tech Masters inside the Kiax Nebula. One day, they were able to lure in the YT-1300 light freighter Millennium Falcon and siphon its power. Grox led a boarding party onto the freighter, consisting of him, Gorr, the Nephran Mirack, and the assassin droid PALLAS-Eleven. Grox told Gorr and Mirack to check for survivors while he went off with Eleven. They found no one on board the light freighter and impounded it on Trionak, intending to sell it.\nBy 34 ABY, Gorr had lost his left forearm and was a leader of his own pirate gang. Eventually, they were approached by the First Order. They wanted his gang to attack the refueling station Colossus for the them so its captain, Imanuel Doza, could give up power to the First Order for protection. The First Order gave them equipment to do this, and they began running \"Triple Dark\" attacks on the Colossus. Gorr and his Warbirds operated from a sail barge called the Galleon, which served as their base of operations.\nGorr sent a Neimoidian named Hallion Nark to serve as a spy and inside agent, who soon contacted Gorr back, giving him an all clear for an assault on the Colossus. Kragan soon led his pirates, under the cover of a \"Triple Dark\" storm, to attack the station. He ordered the other pilots to engage the power generators and target the fuel reserves. The Colossus defenses mobilized and Ace Squadron engaged the pirates. The pirates were able to take out at least two defense turrets regardless. However, a disturbance occurred through the comms and the pirates were stunned. Ace squadron was able to shoot one down, and Gorr ordered them to retreat after a communications overload caused by Kazuda Xiono was too distracting, preventing the pirates from communicating.\nAfter the battle, Gorr talked to Major Elrik Vonreg and Captain Phasma, who were displeased with the pirates. Gorr assured them that Nark would be dealt with for his tactical mistake of losing his comlink, and thus allowing Xiono to foil the pirates' attack.\nLater, several of Gorr's pirates, led by Synara San, raided a Darius G-class freighter in an asteroid field near Castilon. San was the sole survivor, as the rest of the pirates were killed by a Kowakian ape-lizard. She was rescued by Resistance members Poe Dameron, Kazuda Xiono and two astromech droids, who had picked up the freighter's distress signal and investigated. The Mirialan pirate was brought to the Colossus by Xiono and Jarek Yeager, as they thought she was a member of the freighter's crew.\nOnce on the platform, San contacted Gorr and told him of the situation, including the failure of the raid and that she had been handed an opportunity to spy on the platform. Gorr conceded that this situation was better than any profits they may have attained from the raid, and ordered San to blend in, and that he would contact her soon with an assignment, before signing off. San soon contacted Gorr again, informing him that the Colossus' defence turrets were temporarily out of operation. He told her to contact him again when Ace Squadron leave the station for one of their missions. When this happened, San told Gorr, and he prepared his pirates for another attack.\nGorr led his pirate gang in another attack the Colossus. While they wrecked havoc on the station, Gorr noticed Xiono and Yeager carrying a component for the turbolaser's targeting computer on a hoverlift. Gorr attacked them but they evaded him and flew up to the targeting computer. As they tried to install it, Gorr and two other pirates were dropped off to try and stop them. Gorr's two subordinates engaged the pair, but after Yeager knocked one of them off his hoverlift, he rammed it hoverlift into the other one, knocking them unconscious. Gorr shot at them, but Yeager shot back and disarmed him. Gorr then jumped onto the hoverlift and knocked Yeager's blaster out of his hand, before throwing Xiono off.\nWhile Yeager and Gorr wrestled, Xiono tried to push the component into the targeting computer. He shouted for Yeager to help him and Yeager shook his hoverlift so Gorr was left hanging off. Gorr, though, climbed back to Yeager and he reared the hoverlift away before it could ram the component. Yeager flew his hoverlift in for another attempt and Gorr tried to knock him off. However, the hoverlift was already flying towards the targeting computer at high speed. They both jumped off both it hit the component, slotting it into the targeting computer. The turbolasers began working again and fired on the pirates. Gorr ordered a retreat and returned to his shuttle to leave.\nGorr eventually discovered that the pilots who had rescued San from the derelict freighter were in fact members of the Resistance, and when he next made contact with her, during a delayed regular check-in call, he informed her about this. He showed her a security camera image from the freighter of Xiono, Dameron and their droids inside the ship, but due to smoke and poor lighting in the image, San was unable to recognize anyone in the picture after studying it for a brief time, before she was forced to end the transmission due to hearing Xiono approaching.\nSeeking a pretext to occupy the Colossus, Commander Pyre and Captain Phasma hired Gorr to kidnap Torra Doza, the daughter of Captain Doza. While Kragan was initially reluctant to launch more attacks on the Colossus due to losses sustained in the earlier raids, he agreed in return to Pyre and Phasma agreeing to triple the money.\nKragan then contacted his spy Synara, chastising her for not sending frequent reports and warning her not to get too close to the Colossus inhabitants. Uncertain of her loyalty, Gorr did not reveal the specifics of his plan but ordered Synara to expect fellow pirates Valik and Drell in a shipping container and pass them through security into Doza Tower. Kragan reassured her that they would get paid and that she would get to come home tonight.\nActing under Kragan's orders, a reluctant Synara socialized with Torra, Xiono, and Ryvora while gathering information on Doza Tower's layout. Later that night, she met Valik and Drell and helped them infiltrate Doza Tower. After realizing the true purpose of their mission, Synara experienced a change of heart and angrily confronted Gorr via holoprojector. Gorr dismissed Synara's concerns and chided her for becoming \"too soft\" and attached to the Colossus inhabitants. He also told her to rendezvous with Valik and Drell's skiff if she wanted to come home. Undaunted, Synara warned Xiono and Captain Doza, who dispatched the Aces after Valik and Drell, who had kidnapped Torra.\nValik, Drell, and the kidnapped Torra managed to rendezvous with Captain Gorr and the other Warbirds aboard the sail barge Galleon. Shortly later, Major Elrik Vonreg arrived aboard an Upsilon-class shuttle under the pretext of parleying with the Warbirds. However, Major Vonreg instead shot Drell and Skreek, and rescued Doza.\nFollowing the First Orders betrayal of the Warbird gang, Gorr contacted Synara the following day to warn her that the First Order had betrayed them and that the deal was over. Synara ended the transmission after hearing Kaz and BB-8 approaching her quarters. Due to the Warbirds' kidnapping attempt, the First Order was able to convince Captain Doza to accept a military occupation of the Colossus.\nThe First Order established a significant military garrison on the Colossus including TIE fighters and stormtroopers. This deterred the Warbirds from launching further attacks on the Colossus. While the First Order brought a sense of security to the station, this came at the cost of increased restrictions including identity checks.\nDuring the occupation, Synara San contacted Gorr in an attempted to seek help to escape the Colossus. However, Kragan was unable to assist her due to the First Order military presence and chided her for not escaping wen she had the chance. Synara was ultimately able to escape the station with the help of Kaz. Kragan and his Warbirds later rendezvoused with Synara's escape pod at sea.\nLater, Kragan and his pirates including Synara and Valik received a distress transmission from Kazuda Xiono calling the Resistance for help against the First Order. Kragan and his pirates answered Kaz's call for help and came to the aid of the Colossus. The pirates used the Galleon to drive away TIE fighters. They then boarded the Colossus and joined the residents as they fled into hyperspace.\nKragan Gorr was a male Quarren with blue eyes and orange skin. He had a cybernetic left forearm. Gorr was the leader of a pirate gang who was willing to work as a mercenary for the First Order. After the Warbirds incurred significant setbacks during two raids on the Colossus, Gorr demanded that his First Order employers triple their payments and supplies to cover his lost expenditure. Unlike Synara, Gorr had no scruples about kidnapping Doza and chided her for becoming \"soft\" and growing attached to the Colossus' inhabitants. Commander Pyre was able to exploit Gorr's pecuniary motivation by tricking him into kidnapping Torra Doza; giving the First Order a pretext to occupy the Colossus.\nKragan Gorr first appeared on October 2, 2018 in the canon junior novel Choose Your Destiny: A Luke \u0026 Leia Adventure, written by Cavan Scott, which allows readers to make choices as they read, with one official canon path. He was first pictured on October 14 in \"The Triple Dark,\" the second episode of the Star Wars Resistance animated series. There, he was voiced by Gary Anthony Williams, who previously voiced Riff Tamson in Star Wars: The Clone Wars and Gron in Star Wars Rebels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Special:Upload",
  "/wiki/Mon_Cala",
  "/wiki/Quarren",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Limb",
  "/wiki/Warbird_gang",
  "/wiki/First_Order",
  "/wiki/Pirate",
  "/wiki/New_Republic_Era",
  "/wiki/Privateer",
  "/wiki/Colossus",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Torra_Doza",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Team_Colossus",
  "/wiki/Kazuda_Xiono",
  "/wiki/Jarek_Yeager",
  "/wiki/Battle_of_Castilon",
  "/wiki/Galactic_Civil_War",
  "/wiki/Lasat",
  "/wiki/Grox",
  "/wiki/Tech_Masters",
  "/wiki/Kiax_Nebula",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Freighter",
  "/wiki/Nephran",
  "/wiki/Mirack",
  "/wiki/Assassin_droid",
  "/wiki/PALLAS-Eleven",
  "/wiki/Light_freighter",
  "/wiki/Trionak",
  "/wiki/34_ABY",
  "/wiki/Refueling_station",
  "/wiki/Triple_Dark",
  "/wiki/Sail_barge",
  "/wiki/Galleon",
  "/wiki/Neimoidian",
  "/wiki/Hallion_Nark",
  "/wiki/Spy",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Pilot",
  "/wiki/Power_generator",
  "/wiki/Fuel",
  "/wiki/Ace_Squadron",
  "/wiki/Turret",
  "/wiki/Major",
  "/wiki/Elrik_Vonreg",
  "/wiki/Phasma",
  "/wiki/Comlink",
  "/wiki/Synara_San",
  "/wiki/Darius_G-class_freighter",
  "/wiki/Castilon_asteroid_field",
  "/wiki/Asteroid_field",
  "/wiki/Castilon",
  "/wiki/Kowakian_ape-lizard",
  "/wiki/Resistance",
  "/wiki/Poe_Dameron",
  "/wiki/Astromech_droid",
  "/wiki/Investigation_of_a_G-class_freighter",
  "/wiki/Mirialan",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Turbolaser",
  "/wiki/Targeting_computer",
  "/wiki/Hoverlift",
  "/wiki/Valik",
  "/wiki/Drell",
  "/wiki/Doza_Tower",
  "/wiki/Holoprojector",
  "/wiki/Skiff",
  "/wiki/Upsilon-class_command_shuttle",
  "/wiki/Skreek",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Escape_from_the_Colossus",
  "/wiki/Escape_pod",
  "/wiki/October_2",
  "/wiki/2018",
  "/wiki/Choose_Your_Destiny:_A_Luke_%26_Leia_Adventure",
  "/wiki/Cavan_Scott",
  "/wiki/October_14",
  "/wiki/The_Triple_Dark",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Gary_Anthony_Williams",
  "/wiki/Riff_Tamson",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Gron",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Signal_from_Sector_Six",
  "/wiki/Synara%27s_Score",
  "/wiki/Bibo_(episode)",
  "/wiki/The_Doza_Dilemma",
  "/wiki/The_First_Order_Occupation",
  "/wiki/Descent_(episode)",
  "/wiki/No_Escape:_Part_2",
  "/wiki/Into_the_Unknown",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/The_Mutiny",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Covert_Missions",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Explosives,_Heavy_Weapons,_and_Power_Sources",
  "/wiki/The_First_Order",
  "/wiki/Chewbacca_and_Other_Aliens_of_the_Rebellion_and_the_Resistance",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Databank_(website)",
  "/wiki/Prisoners",
  "/wiki/Legends_of_the_Lasat"
 ]
}