{
 "name": "Kral Nevil",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic Starfighter Corps",
      "Galactic Federation of Free Alliances",
      "Alliance-in-exile",
      "Jedi Coalition"
     ]
    }
   ]
  }
 ],
 "content": "Kral Nevil was a male Quarren member of Rogue Squadron. From 25 ABY to 27 ABY, he flew as Rogue Two and Gavin Darklighter's wingman.\nA Quarren male, Kral Nevil joined the New Republic Starfighter Corps and eventually secured a place in Rogue Squadron, a legendary starfighter squadron. Nevil had a wife and a son, Turl. By 25 ABY, Nevil, who had attained the rank of captain, was flying as Rogue Two alongside Rogue Leader, Colonel Gavin Darklighter. Rogue Squadron had been assigned to the fleet of Bothan Admiral Traest Kre'fey, who wished to investigate reports of an alien incursion in the Outer Rim Territories in the early months of the year. Nevil, who had the nickname and call sign \"Deuce\", was stationed with his fellow pilots were stationed on Kre'fey's flagship, the Bothan Assault Cruiser Ralroost. Upon reports of pirate activity in an Outer Rim star system, Darklighter led the Rogues out into space to reconnoiter the situation.\nMajor Inyri Forge soon detected unknown signatures in the system's asteroid belt, which were soon confirmed to be Uglies, starfighters cobbled together out of various parts. As Nevil and his fellow pilots engaged the Uglies, it soon became clear that the starships were already heavily damaged. Darklighter made contact with an EF76 Nebulon-B escort frigate which served as the pirates' base of operations and called for Urias Xhaxin, the captain of the vessel, to order his forces to stand down. As Darklighter negotiated with Xhaxin, Nevil protected his wingmate from a TYE-wing. Xhaxin subsequently surrendered and Nevil observed that significant damage had been incurred by the Nebulon-B escort frigate in an engagement against an unknown foe.\nMaking use of Xhaxin's information, Kre'fey set up a reconnaissance mission to another star system where the pirate captain claimed his forces had been ambushed by the Yuuzhan Vong, an alien species reported to have launched an invasion of the galaxy. Rogue Squadron flew cover for a T-65R reconnaissance X-wing as it scouted the system. Nevil, Darklighter, and the rest of One flight trailed behind the recon starfighter while Majors Inyri Forge and Alinn Varth fanned out to cover a wider area. Soon, six coralskippers, as the organic Yuuzhan Vong starfighters had been termed, emerged and engaged Rogue Squadron. Against the asteroid-like starfighters, which utilized dovin basals to create miniature black holes to strip shields off New Republic starfighters and to suck in incoming laser beams, Nevil and his fellow pilots were forced to adopt new tactics. Nevil again aided Darklighter during the brief engagement, scoring several kills against the Yuuzhan Vong pilots while protecting his wingmate. Although Nevil and Darklighter were able to save the life of Rogue Seven, the Krish Ligg Panat, Major Alinn Varth reported following the end of the skirmish that two pilots from her flight, Dinger and Tik, had perished. Rogue Squadron remained in the system until Admiral Kre'fey arrived with the Ralroost.\nFollowing the minor engagement, Nevil and Rogue Squadron accompanied Kre'fey to Dubrillion, where the Yuuzhan Vong were threatening the world as it was evacuated by a convoy of starships from nearby Agamar. Upon the arrival of the Agamarian convoy, the Yuuzhan Vong forces lurking in the system's asteroid belt had sent half a dozen coralskippers to engage the relief vessels. Nevil and his fellow pilots fought off the Yuuzhan Vong, who over the next four days settled into a pattern of testing Roque Squadron's response time with minor incursions. When the time came for the Agamarian convoy to leave the Dubrillion system, Darklighter led Nevil and the other Rogue Squadron pilots out to form a small cordon between the departing starships and the Yuuzhan Vong. In the subsequent engagement, Rogue Squadron took the fight to a Yuuzhan Vong miid ro'ik cruiser and inflicted damage upon the capital ship. Eventually, however, the cruiser powered up its dovin basals and created an artificial gravity well which forced the Agamarian convoy to divert to Dantooine. Nevil and his fellow pilots traveled to Dantooine in order to protect the convoy against further Yuuzhan Vong attacks.\nKral participated in key engagements against the Yuuzhan Vong at Dantooine, Ithor, and Borleias.\nBy 40 ABY, Kral had transferred from starfighter operations to the naval forces. He became captain of the Anakin Solo and served as the chief aide of Darth Caedus aboard the command ship following the Battle of Kashyyyk.\nKral's son Turl was killed when the Corellians fired Centerpoint Station on their own fleet in hopes of killing Caedus, something that greatly affected Kral. Caedus tried to express his sympathies to him.\nLater, when Kral tried to intervene and keep Caedus from killing Lieutenant Patra Tebut after a Jedi led team was able to board and retrieve the Hapan Princess Allana, Caedus responded by throwing Kral against a bulkhead. After killing Tebut, Caedus was unable to determine if Kral's expression was one of fear, anger, or acceptance. Caedus decided that he no longer liked either the Mon Calamari or the Quarren.\nAfter Darth Caedus murdered Lieutenant Tebut, Nevil met with Admiral Cha Niathal regarding the Sith Lord's actions. Niathal was just as appalled over what had happened, and while she very much wanted to have Solo arrested and charged with murder, she knew that the Galactic Alliance Guard would not permit Solo to either be arrested or charged. Nevil remained as Captain of the Anakin Solo until the Second Battle of Fondor. When Solo refused an order to cease bombardment of Fondor, Niathal attempted to relieve him of his command, but most of the fleet remained loyal to Solo. Nevil then used an escape pod to leave the Anakin Solo, and defected to the faction of the Galactic Alliance loyal to Admiral Niathal.\nNevil was a capable starfighter pilot, who used Quarren idioms and was inquisitive. Nevil also had a good-natured relationship with Darklighter, his squadron leader.\nKral Nevil was confirmed to have fought during the First Battle of Coruscant during the Yuuzhan Vong War in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic_Starfighter_Corps/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Alliance-in-exile",
  "/wiki/Jedi_Coalition",
  "/wiki/Cha_Niathal",
  "/wiki/Turl_Nevil",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/27_ABY/Legends",
  "/wiki/Rogue_Two/Legends",
  "/wiki/Gavin_Darklighter",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Kral_Nevil%27s_wife",
  "/wiki/Captain/Legends",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/New_Republic_First_Fleet",
  "/wiki/Bothan/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Traest_Kre%27fey",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Call_sign",
  "/wiki/Pilot/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Bothan_Assault_Cruiser",
  "/wiki/Ralroost",
  "/wiki/Pirate/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Major/Legends",
  "/wiki/Inyri_Forge",
  "/wiki/Asteroid_belt",
  "/wiki/Ugly/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Urias_Xhaxin",
  "/wiki/TYE-wing",
  "/wiki/Free_Lance",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Species/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/T-65BR_X-wing_reconnaissance_starfighter",
  "/wiki/Alinn_Varth",
  "/wiki/Yorik-et",
  "/wiki/Dovin_basal",
  "/wiki/Black_hole/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Rogue_Seven/Legends",
  "/wiki/Krish_(species)/Legends",
  "/wiki/Ligg_Panat",
  "/wiki/Dinger",
  "/wiki/Tik",
  "/wiki/Dubrillion/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Agamar/Legends",
  "/wiki/Dubrillion_system",
  "/wiki/Lando%27s_Folly",
  "/wiki/Evacuation_of_Dubrillion",
  "/wiki/Miid_ro%27ik",
  "/wiki/Cruiser/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Rock-One",
  "/wiki/Dantooine/Legends",
  "/wiki/Ithor/Legends",
  "/wiki/Borleias/Legends",
  "/wiki/40_ABY",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Darth_Caedus",
  "/wiki/Battle_of_Kashyyyk_(Second_Galactic_Civil_War)",
  "/wiki/Centerpoint_Station",
  "/wiki/Lieutenant/Legends",
  "/wiki/Patra_Tebut",
  "/wiki/Jedi/Legends",
  "/wiki/Hapan",
  "/wiki/Prince/Legends",
  "/wiki/Allana_Solo",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Second_Battle_of_Fondor",
  "/wiki/Fondor/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Defection",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_II:_Rebel_Stand",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Twizzl",
  "/wiki/41_ABY",
  "/wiki/Inondrar",
  "/wiki/I,_Jedi"
 ]
}