{
 "name": "Krane",
 "display_name": "Krane",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "By 14 BBY",
      "Zeffo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Project Auger",
      "Imperial Officer Corps",
      "Project Auger"
     ]
    }
   ]
  }
 ],
 "content": "Krane was a humanoid female officer of the Galactic Empire who took charge of Project Auger, an Imperial mining operation to excavate the many ancient artifacts on the planet of Zeffo. Attempting to earn Emperor Palpatine's favor, she became reckless in an endeavor which eventually led to her death.\nIn charge of Project Auger on the planet Zeffo, the humanoid female known as Officer Krane believed that the officer formerly assigned to the project did not have proper leadership and motivation, taking over the project for herself. The stormtroopers under Krane often questioned her motives and felt pressured. Determined to prove herself, Krane wanted artifacts that she considered rare instead of what was considered useless. After a stormtrooper discovered a relic in the Ice Caves, she attempted to keep it for herself, believing that handing it over to Emperor Palpatine would win his favor. When questioned by a stormtrooper about the whereabouts of the artifact she stated that she would deal with it. However, this endeavor made her reckless. When hiding the relic in a cave she became trapped when it collapsed, dying.\nIn 14 BBY, as part of a secret mission to rebuild the Jedi Order, Jedi Padawan Cal Kestis traveled to Zeffo, hearing Krane's voice in multiple Force Echoes and learning about her pursuits and eventual death. He eventually found her corpse.\nKrane wielded an electro riot baton.\nKrane appeared as a skeleton in the 2019 video game Star Wars Jedi: Fallen Order, published by Respawn Entertainment. In the in-game Force Echoes, she is voiced by an unknown actor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Imperial_officer",
  "/wiki/Krane_(Rebel_Alliance)",
  "/wiki/14_BBY",
  "/wiki/Zeffo",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Project_Auger",
  "/wiki/Mining",
  "/wiki/Planet",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Officer",
  "/wiki/Stormtrooper",
  "/wiki/Ice_Caves",
  "/wiki/Cave",
  "/wiki/Death",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Secret_mission_to_rebuild_the_Jedi_Order",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Cal_Kestis",
  "/wiki/Psychometry",
  "/wiki/Electro_riot_baton",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Respawn_Entertainment",
  "/wiki/Template:JFODate",
  "/wiki/Standard_year"
 ]
}