{
 "name": "Krane  (Rebel Alliance)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Krane was a Human male who served in the Alliance to Restore the Republic during the Galactic Civil War and held the rank of admiral. An uncompromising officer with a fierce loathing of the Galactic Empire, Krane felt that the Alliance could only be successful in the war by deploying a skilled, capable fighting force. In 3 ABY, Krane personally instructed the Rebel pilot \"Rookie One\" in the operation of a captured Imperial TIE fighter, ahead of the young pilot's mission to steal one of the Empire's new TIE phantom starfighters. Krane escorted Rookie One on the first part of his journey to the planet Imdaar and helped to defeat a squadron of TIE interceptors, ensuring Rookie One's safe arrival.\nA Human male who lived during the time of the Galactic Empire, Krane became a member of the Alliance to Restore the Republic during the Galactic Civil War and, in 3 ABY, held the rank of admiral. In the months following the Empire's assault on the Rebel base on the planet Hoth, Alliance ships were subject to attacks from a new Imperial weapon, the TIE/ph phantom, a starfighter equipped with a cloaking device, which allowed it to attack unseen. Intelligence reports indicated a high level of Imperial naval activity near the planet Imdaar in the Dantus sector of the Outer Rim Territories, and that the Executor-class Star Dreadnought Terror was en route to deploy a full wing of the new starfighters.\nThe Alliance planned to send the pilot known as \"Rookie One\" to Imdaar, where he was to meet with Rebel agent Ru Murleen, infiltrate the Terror, and capture a TIE phantom for study. In preparation for the mission, Rookie One was sent for training on piloting TIE Series starfighters. Due to the importance of the mission, Krane elected to personally instruct the young pilot. Piloting two of the few functioning TIE/LN starfighters captured by the Alliance, Krane and Rookie One made their way to a narrow canyon shrouded in mist and filled with tight turns and rocky outcroppings. Krane was impressed when Rookie One successfully followed his lead though the canyon with minimal damage to the unshielded starfighter, even opting to take the more hazardous route when the canyon forked.\nFollowing the training, Krane, along with Darnell Reggs, escorted Rookie One on the first part of his journey to Imdaar in a three-ship flight group of Y-wing starfighters. Along the way, the trio was attacked by over a dozen Imperial TIE/IN interceptors. Despite being heavily outnumbered, the Rebel pilots were able to destroy the Imperial fighters and escape without loss. Since a lone starfighter stood a greater chance of slipping past Imperial defenses, Krane and Reggs broke off and returned to base, leaving Rookie One to proceed alone to the planet Ceti 597, and from there to Imdaar.\nRookie One and Murleen were successful in not only capturing a TIE phantom but destroying both the facility that was manufacturing the starfighters and the Terror itself. The pair arrived at the rendezvous point in the stolen starfighter, where they were met by Krane upon landing. The admiral thanked the pair for effectively ending the threat of the TIE phantoms and presented Rookie One with a medal. However, the capture of the TIE phantom proved short-lived, as it self-destructed soon after arriving at the Rebel facility.\nKrane was a seasoned Rebel officer who harbored an intense hatred toward the Galactic Empire. A capable pilot, he could operate both Rebel and Imperial starfighters and was involved in training other pilots in their use. In battle, Krane was quick to organize his wingmates and ensured that they worked as a team when facing superior numbers.\nBelieving that the Alliance could only be victorious with a well-trained and capable military, he kept those under his command on a tight rein and demanded the highest levels of performance. As a result, he was seen as a hard man lacking in interpersonal skills. Krane had dark eyes, light skin, and gray hair during the Galactic Civil War.\nWhen he greeted Rookie One and Ru Murleen following their successful mission to Imdaar, Krane wore a tan Alliance officer's uniform and cloak. In combat, he wore a flight suit and helmet.\nKrane was created for the 1995 LucasArts video game Star Wars: Rebel Assault II: The Hidden Empire, in which he was portrayed by Craig C. Lewis. During the level \"TIE Training,\" the player is given a choice of taking the easier route through the canyon or following Krane on the more difficult path. Krane's subsequent dialogue varies depending on the player's choice, remarking that he is surprised if Rookie One opts to take the difficult route. If Rookie One is killed during the level, the game-over cutscene shows Krane returning to base, telling the Rebels to stop bringing reckless kids to him, as they are running out of TIE fighters.\nThe way Krane congratulates Rookie One at the end of the game depends on the difficulty level chosen by the player. At \"beginner\" and \"novice\" levels, Krane offers Rookie One a handshake while remarking that he had undertaken more difficult assignments. At the \"standard\" difficulty level, he presents Rookie One with a medal, while at \"expert\" difficulty he presents a more elaborate medal. This article assumes the player takes the more difficult path during \"TIE Training\" and plays at \"expert\" level.\nProject leader Vincent Lee's storyboards and scripts document for Rebel Assault II, dated November 16, 1994, included a brief description of Krane, much of which was included in a short biography of the character on the LucasArts website. However, the character's age of \"late forties\" was not mentioned in the game, its manual, or online and was only reprinted in Rob Smith's 2008 book, Rogue Leaders: The Story of LucasArts. Lee also made notes on the people he thought symbolized each character in the game, selecting actor Tommy Lee Jones to represent Krane. Both Lee's notes and the LucasArts website biography refer to him as \"Commander Krane,\" though the character is called \"Admiral Krane\" in the game's dialogue and end credits.\nProps and costumes created for the original trilogy of Star Wars movies were used during the filming of Rebel Assault II. The flight helmet worn by Krane while piloting a Y-wing is the same design as that originally worn by Gold Leader Jon \"Dutch\" Vander in Star Wars: Episode IV A New Hope.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Krane",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:Krane1-RAII.ogg",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Alliance_Military/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Rookie_One",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Pilot",
  "/wiki/Mission_to_Imdaar",
  "/wiki/TIE/ph_phantom",
  "/wiki/Starfighter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Imdaar/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/File:Krane2-RAII.ogg",
  "/wiki/Imperial_Period",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Dantus_sector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Terror",
  "/wiki/Fighter_wing/Legends",
  "/wiki/Ru_Murleen",
  "/wiki/Pilot/Legends",
  "/wiki/TIE_Series",
  "/wiki/Deflector_shield/Legends",
  "/wiki/File:Krane3-RAII.ogg",
  "/wiki/Darnell_Reggs",
  "/wiki/Flight_group/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Ceti_597",
  "/wiki/Imdaar_Alpha_research_station",
  "/wiki/Medal/Legends",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/File:Krane4-RAII.ogg",
  "/wiki/Wingmate/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Alliance_military_uniform/Legends",
  "/wiki/Cloak",
  "/wiki/Flight_suit/Legends",
  "/wiki/Flight_helmet/Legends",
  "/wiki/File:Krane5-RAII.ogg",
  "/wiki/1995",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Craig_C._Lewis",
  "/wiki/Death/Legends",
  "/wiki/Vincent_Lee",
  "/wiki/November_16",
  "/wiki/1994",
  "/wiki/Rob_Smith",
  "/wiki/2008",
  "/wiki/Rogue_Leaders:_The_Story_of_LucasArts",
  "/wiki/Commander/Legends",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars",
  "/wiki/Gold_Leader/Legends",
  "/wiki/Jon_Vander/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Category:Audio_files_of_Krane",
  "/wiki/Category:Images_of_Krane",
  "/wiki/The_Adventurer",
  "/wiki/Rebel_Assault_II:_Lights,_Camera,_Action",
  "/wiki/The_Adventurer_10",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Game_Room",
  "/wiki/Star_Wars_Galaxy_Magazine_5",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Imdaar_system",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}