{
 "name": "Krass",
 "display_name": "Krass",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild",
      "Hutts"
     ]
    }
   ]
  }
 ],
 "content": "Krass was a male Trandoshan bounty hunter who worked for the Hutts of Hutt Space during the Rise of the Empire era and was a member of the Bounty Hunters' Guild.\nKrass was hired by the Hutts to track down the kidnapper of the Bothan Jennalyn Bontraar after they were framed for the crime by the true kidnapper the Cerean Zascha. He was sent to the Galactic Costume Extravaganza, an event held by Jennalyn's father Elwis Bontraar on his ship the Masquerade annually where the exchange for Jennalyn was arranged to take place. Before he attended the event however the Hutts surgically implanted a failsafe switch in the back of the Trandoshan's jaw which if he chose to activate it with his tongue or upon his death would signal the Hutt's forces to capture the Masquerade and everyone on board in an attempt to find their target. Krass wore an Ithorian costume to the event and was accompanied by two other thugs, however once at the event he was tricked by Zascha into believing that a group of spacers hired by Elwis to also look for his daughter were the kidnappers. Krass then gave the spacers a note asking them to meet him in docking bay 11 of the ship where he had setup an ambush for them. The spacers however proved more than a match for Krass and his goons and the trio were incapacitated and possibly killed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Bothan/Legends",
  "/wiki/Jennalyn_Bontraar",
  "/wiki/Cerean/Legends",
  "/wiki/Zascha",
  "/wiki/Galactic_Costume_Extravaganza",
  "/wiki/Elwis_Bontraar",
  "/wiki/Masquerade",
  "/wiki/Ithorian/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Docking_bay_11",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Krass",
  "/wiki/Wizards.com",
  "/wiki/Masquerade_(online_adventure)"
 ]
}