{
 "name": "Kratas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Derilyn"
     ]
    },
    {
     "name": "Died",
     "values": [
      "12 ABY",
      "Shockwave"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Zero Command"
     ]
    }
   ]
  }
 ],
 "content": "Kratas was a commander in the Imperial Navy serving as commanding officer of the Imperial I-class Star Destroyer Gorgon, which served under the command of Admiral Daala in the defense of the Maw Installation. Because of his position aboard Daala's flagship, he served as her second-in-command despite the fact two of the commanding officers of the other Star Destroyers—Captain Brusc of the Manticore and Captain Mullinore of the Basilisk—out-ranked him. Loyal, determined, resourceful and competent, Kratas was perhaps the only person in Admiral Daala's whole command that she considered as a friend instead of merely a subordinate.\nKratas would serve loyally throughout Daala's guerrilla campaign against the New Republic some seven years after the Battle of Endor. He participated in combat actions against a New Republic colony on Dantooine and in a raid against the shipyards over the Mon Calamari homeworld of Mon Calamari. He was Daala's strongest supporter in using the Basilisk for a suicide attack against the planet Coruscant, though the plans would be foiled by the Sun Crusher. Following the loss of the other Star Destroyers, the Gorgon would retreat to protect the Maw Installation, resulting in a battle against the New Republic. Ultimately, though the campaign was damaging, it would come to a halt when Daala ordered the Gorgon to retreat from battle, limping to the relative safety of the Deep Core where it was hoped they would find something resembling a stable Empire. They were sadly mistaken.\nUpon arrival in the Core, Kratas and Daala encountered an Empire divided by warlord factions fighting each other for resources and glory. To further their problems, the Gorgon was taken over and eventually cannibalized for parts, the crew spread among the warring factions. Unlike the others aboard the Gorgon, Kratas remained with Daala, serving as her aide while she engaged in negotiations between the factions in hopes of reunifying the Empire. One such diplomatic mission would prove fatal for Kratas. Following their negotiations with warlords High Admiral Treuten Teradoc and Superior General Delvardus, Daala and Kratas arrived at the fortress of Supreme Warlord Blitzer Harrsk. Kratas took the opportunity to overlook Harrsk's twelve newly-constructed Imperial II-class Star Destroyers, specifically Harrsk's flagship, the heavily-modified Star Destroyer Shockwave. During the observation, Teradoc's forces attacked with a fleet of seventy-three Victory-class Star Destroyers and Kratas was caught aboard the bridge of the Shockwave. Being the only flag officer present, Kratas immediately assumed command of the Shockwave, and as such the whole of Harrsk's fleet, ordering the ships on his side into a phalanx formation, and to concentrate their firepower instead of engaging targets on their own. But Teradoc's ships came on unrelentlessly and, completely oblivious to their own losses, swarmed Harrsk's flagship. Despite his inspired command , Kratas would meet his fate when a volley of combined fire from Teradoc's Star Destroyers resulted in the destruction of the Shockwave. This incident would weigh heavily on the mind of Admiral Daala as she planned the reunification of the Empire.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Derilyn",
  "/wiki/12_ABY/Legends",
  "/wiki/Shockwave_(Imperial-class)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Zero_Command",
  "/wiki/Admiral/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Commander/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Gorgon",
  "/wiki/Maw_Installation",
  "/wiki/Flagship/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Brusc",
  "/wiki/Manticore",
  "/wiki/Mullinore",
  "/wiki/Basilisk_(Star_Destroyer)",
  "/wiki/Daala_campaign",
  "/wiki/New_Republic/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Attack_on_Mon_Calamari",
  "/wiki/Shipyard/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Dac",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_the_Maw",
  "/wiki/Deep_Core/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/High_Admiral",
  "/wiki/Treuten_Teradoc",
  "/wiki/Superior_General",
  "/wiki/Sander_Delvardus",
  "/wiki/Supreme_Warlord",
  "/wiki/Blitzer_Harrsk",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Jedi_Search",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/Darksaber_(novel)",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}