{
 "name": "Kravas Drezzer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 BBY",
      "Morlana One"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Preox-Morlana",
      "Pre-Mor Security Inspection team",
      "Pre-Mor Security Inspection team"
     ]
    }
   ]
  }
 ],
 "content": "Kravas Drezzer was a human male who served in the law enforcement arm of Preox-Morlana on the astronomical object Morlana Four as a squad commander and then on the planet Morlana One as a Sentry Corporal. In 5 BBY, he and fellow sentry guard Verlo Skiff ignored their duties and attended a brothel, where they noticed the visitor Cassian Andor. They were annoyed when a hostess went to Andor first and taunted the patron while he was there.\nDrezzer and Skiff then followed Andor out of the brothel and confronted him. The pair attempted to plunder their quarry of his credits, only for Andor to attack and overpower the two sentry guards. Skiff was killed in the scuffle and Drezzer tried to negotiate with Andor, only to be shot dead himself. Afterwards, Deputy Inspector Syril Karn made a report on the incident to Chief Inspector Hyne, who wished for it to be mocked up as an accident as the two sentry guards were flouting rules.\nDuring the time of the Galactic Empire, the human male Kravas Drezzer served in the Preox-Morlana  corporate security force, which operated from the planet Morlana One, for many years. The corpo was once a squad commander on the astronomical object Morlana Four before eventually finding himself as a Sentry Corporal back on Morlana One.\nIn 5 BBY, Drezzer and fellow sentry guard Verlo Skiff were on shift when they decided to ignore their duties and go to an expensive brothel in Morlana One's Leisure Zone. There the pair drank Revnog at the bar, awaiting one of the brothel hostesses to approach them, when the human Cassian Andor entered the establishment, getting a drink of his own from the alien bartender. After the bartender informed Andor that he paid at the end of his stay there, Drezzer eyed the new visitor and warned him not to pursue the alien, joking that she would send him home crying. The Sentry Corporal turned back to speak with Skiff when a hostess entered the room and approached Andor.\nAnnoyed about still having to wait for a hostess, Drezzer interrupted the hostess and Andor, arguing that he and Skiff had been there first. The hostess assured the two that hostess Gani would go to them, but Drezzer insisted that he did not want that host. The hostess told the sentry guard to behave, and he sarcastically conceded. Gani spoke to Drezzer and Skiff for a short moment before the corpo turned his gaze back on Andor, who looked back when his hostess left. Drezzer chose to take offense in the other patron looking over at him, taunting him with Skiff's backing.\nAfter Andor finished his query with the hostess, he left the brothel. Drezzer and Skiff followed, intent on harassing their quarry and taking his credits. As Andor reached the plaza's edge, leading to a causeway, the pair called him to a stop and began reciting excuses to fine him. Drezzer pulled his blaster out, prompting his arrestee to raise his hands and declare he was carrying 300. The Sentry Corporal remarked that it was almost the exact amount he needed and asked Andor to bring it. Drezzer and Skiff's new acquaintance made the sentry guards search him themselves, Skiff rummaging his coat for the credits while Drezzer hit him with the blaster.\nAndor then headbutted Skiff and grabbed Drezzer's arm as he attempted to fire at his adversary. The sentry guard found himself thrown on the ground by Andor, who promptly bashed his gun arm to disarm him. Drezzer's opponent then aimed the blaster at him and ordered him to get Skiff up. The corpo consulted his colleague, only to find the fellow guard had been killed in the short scuffle. Although Andor first believed that the other sentry guard was faking, Drezzer insisted otherwise and sobbed at the death of his companion. The Sentry Corporal then tried to convince Andor to help him report him as an accident, only for his adversary to shoot him dead.\nWith Drezzer and Skiff killed, Deputy Inspector Syril Karn investigated the incident and made a report on the fight and what he knew of Andor. Karn presented the report to Chief Inspector Hyne of Pre-Mor, who recognized Drezzer's name and called him an unpleasant man, remarking that it was surprising that he had not died years ago. Acknowledging that Drezzer and Skiff were breaking multiple rules and had likely picked a fateful fight, Hyne ordered Karn to mark it up as an accident to brush over the rule flouting that the late corpos had been committing. However, the deputy inspector wished not to leave the case to rest, and tracked Andor to the planet Ferrix, leading a squad on an unsuccessful attempt to apprehend Drezzer's killer.\nA human male, Kravas Drezzer had light skin and dark, grey hair with a mustache. Although just a sentry guard, he liked acting like the law, attempting to intimidate Cassian Andor multiple times. The Sentry Corporal was repeatedly sarcastic to others like Andor and the hostess. When Verlo Skiff was killed, Drezzer sobbed and mourned his companion.\nDrezzer wore blue uniform and carried a blaster.\nKravas Drezzer first appeared in the first episode of the Tony Gilroy's live-action Disney+ series Andor, directed by Toby Haynes and released on September 21, 2022. The character was portrayed by Lee Boardman, with Erol Mehmet as his stunt double. His last name was not stated in the episode, but was mentioned in Aurebesh in Syril Karn's report, which Hyne reads on a datapad. \"Kravas\" was first showcased in promotional images released by The Walt Disney Company on Getty Images.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/5_BBY",
  "/wiki/Morlana_One",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Preox-Morlana",
  "/wiki/Pre-Mor_Security_Inspection_team",
  "/wiki/Morlana_Four",
  "/wiki/Squad",
  "/wiki/Commanding_officer",
  "/wiki/Planet",
  "/wiki/Sentry_Corporal",
  "/wiki/Verlo_Skiff",
  "/wiki/Leisure_Zone_brothel",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Unidentified_brothel_hostess",
  "/wiki/Credit",
  "/wiki/Death",
  "/wiki/Deputy_Inspector",
  "/wiki/Syril_Karn",
  "/wiki/Chief_Inspector",
  "/wiki/Hyne",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Law_enforcement_agency",
  "/wiki/Standard_year",
  "/wiki/Leisure_Zone",
  "/wiki/Revnog",
  "/wiki/Alien",
  "/wiki/Eye",
  "/wiki/Gani",
  "/wiki/Blaster",
  "/wiki/Limb",
  "/wiki/Ferrix",
  "/wiki/Color",
  "/wiki/Hair",
  "/wiki/Kassa_(episode)",
  "/wiki/Tony_Gilroy",
  "/wiki/Disney%2B",
  "/wiki/Andor_(television_series)",
  "/wiki/Toby_Haynes",
  "/wiki/September_21",
  "/wiki/2022",
  "/wiki/Lee_Boardman",
  "/wiki/Aurebesh",
  "/wiki/Datapad",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/That_Would_Be_Me",
  "/wiki/Reckoning_(episode)",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/September_26"
 ]
}