{
 "name": "Krayt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Krayt dragon"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark cyan"
     ]
    }
   ]
  }
 ],
 "content": "Krayt was a krayt dragon who, according to legend, terrorized a village of Tusken Raiders before being defeated by exiled Jedi Master Obi-Wan Kenobi.\nKrayt was a krayt dragon who, according to legend, nested in a self-declared domain among the dunes on the desert planet Tatooine. The dragon had a long lifespan and had encountered various kinds of deception, such as the practice of hiding in pits beneath the sand to hide from the dragon's sight. Between 19 BBY and 0 BBY, a tribe of Tusken Raiders established a village near Krayt's nest, unknowingly summoning the dragon's wrath. After months of tranquility, Krayt devised a plan to expel the Tusken Raiders, beginning by feasting on the Tuskens' livestock before moving on to the Tuskens themselves. The dragon made nightly visits to the village, snatching the beasts away to consume in its lair. For five nights, the villagers cowered in fear, but at the end of that period, ten of the tribe's strongest warriors gathered their weapons and stood guard at the creature's pens, hoping to scare Krayt away.\nKrayt arrived that night, but the Tuskens' projectile weapons were ineffective against the dragon's hide. It brushed the warriors aside with its wings and flew away with one of their animals. Eventually, Krayt had consumed all of the livestock, and Krayt was delighted to find the pens empty so that it could eat the Tuskens. It flapped its wings to knock down the village's tents, plucking a boy from his mother's arms to consume. Krayt continued making nightly visits and feasted on the Tuskens' children, leading the villagers to hide their young in pits under the sand. Krayt recognized the subterfuge and dug up one child each night. In response, the villagers elected a warrior to venture into the desert to attack Krayt at its nest. That night, Krayt did not fly to the village, leading the Tuskens to believe that their champion had been successful and was dragging the dragon's head across the dunes. However, Krayt had defeated and consumed the warrior, and when it returned the following night, the villagers realized that their quest had only meant Krayt had no need to travel for its sustenance, and that an alternate plan would be required.\nA small band of villagers raided the temporary camp of a nearby tribe, taking their livestock to their own pens to dissuade Krayt from consuming villagers. However, Krayt's hunger could no longer be satisfied by animals, and it instead chose another Tusken to devour. The villagers agreed to select people to offer to Krayt, though they would not sacrifice members of their own tribe. A party set out to capture other offerings, although their journey took two days and Krayt consumed two more villagers in that time. The party captured seven humans who were herded into the village's animal pens and tied to stakes to be offered to Krayt one by one. The dragon was suspicious of the Tuskens' intentions and wondered if they meant to poison it, but Krayt's sense of smell assured it that the offerings were fresh. The villagers were delighted when their ploy worked, as they were able to go about their normal lives while selecting captives to sacrifice while sending out raiding parties to a nearby town for more victims.\nThe disappearance of people from the town drew the attention of Obi-Wan Kenobi, a Jedi Knight living in exile on Tatooine. He altruistically chose to investigate the disappearances and learned of Krayt's campaign of terror. Kenobi allowed himself to be taken captive by the villagers and freed the others, ensuring that he would be offered to Krayt that night. When the dragon arrived, it laughed at its new victim, but Kenobi had slipped his bonds and revealed his lightsaber, and therefore his true nature as a Jedi. Krayt roared in frustration at the lack of a simple meal, but believing that it was strong enough to defeat Kenobi, began an elegant and ferocious duel that all the villagers emerged to witness. The dragon swept low to strike with its tail and talons, while Kenobi gracefully ducked and weaved out of the way. After an hour without either combatant striking the other, Kenobi feigned the appearance of tiring, leading Krayt to swoop down to strike. The Jedi lowered his lightsaber and raised his hand, using the Force to stop Krayt centimeters before colliding with Kenobi. As the villagers held their breaths, Kenobi deactivated his weapon, and Krayt sighed and lowered its head to the ground prostrate before Kenobi like a Loth-wolf kneeling before its mother.\nThe villagers cheered, perceiving that Kenobi had cast a spell on Krayt. Kenobi glared at the villagers with a visage more fearsome than Krayt's, before commanding the dragon to rise to full height. As Kenobi stepped forward, Krayt followed his every move. The Jedi announced that the dragon would no longer terrorize the village, causing the Tuskens to cheer, but Kenobi brought the crowd to silence and warned them that if they ever raided other settlements and abducted other people, he would return with Krayt and destroy their village. Underlining Kenobi's point, Krayt spread its wings, and was later led by Kenobi into the desert. The villagers heeded the Jedi's warning, becoming unique among Tatooine's tribes by never raiding other tribes or taking captives again.\nKrayt was a fearsome, arrogant being who was possessive of its own domain. When the Tusken Raiders inhabited its territory, Krayt's sly nature allowed it to plan to be rid of them through rationing out the Tusken Raiders for sustenance, knowing that the Tuskens would not be able to best Krayt in battle. Krayt's laziness and long lifespan as a krayt dragon meant that he saw no rush to consume the Tusken Raider tribe. He enjoyed the taste of the villagers, developing a particular taste for children, and looked forward to consuming all of the Tuskens' livestock so that he could eat the people. Krayt delighted in the suffering of its victims. The dragon had a horrifying appearance, with dark cyan scales, large wings, five horns on the back of its head, and a long, whiplike tail.\nThe flapping of Krayt's wings caused destructive sandstorms strong enough to knock down the Tusken Raider's tents. Krayt also had an excellent sense of smell, able to detect whether his meals had been poisoned. During their duel, Kenobi knew that the dragon was too strong for him to defeat, leading him to resort to trickery to bring Krayt under his domination.\nKrayt appeared in \"The Knight \u0026 the Dragon,\" a short story in the 2019 anthology collection Myths \u0026 Fables, written by George Mann, illustrated by Grant Griffin. Krayt was first mentioned and pictured in the book's announcement post on StarWars.com, published on January 31, 2019, prior to the book's publication on August 6, 2019.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Krayt_(disambiguation)",
  "/wiki/Tatooine",
  "/wiki/Krayt_dragon",
  "/wiki/Color",
  "/wiki/Unidentified_Tusken_Raider_village_(Krayt)",
  "/wiki/Tusken_Raider",
  "/wiki/Exile_(punishment)",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/19_BBY",
  "/wiki/0_BBY",
  "/wiki/Unidentified_Tusken_Raider_tribe_(Krayt)",
  "/wiki/Standard_month",
  "/wiki/Standard_day",
  "/wiki/Soldier",
  "/wiki/Weapon",
  "/wiki/Unidentified_Tusken_Raider_boy",
  "/wiki/Parent",
  "/wiki/Limb",
  "/wiki/Youngling",
  "/wiki/Unidentified_Tusken_Raider_warrior",
  "/wiki/Human",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Jedi",
  "/wiki/Standard_hour",
  "/wiki/Lightsaber",
  "/wiki/The_Force",
  "/wiki/Loth-wolf",
  "/wiki/Taming_beasts",
  "/wiki/The_Knight_%26_the_Dragon",
  "/wiki/2019",
  "/wiki/Myths_%26_Fables",
  "/wiki/George_Mann",
  "/wiki/Grant_Griffin",
  "/wiki/StarWars.com",
  "/wiki/January_31",
  "/wiki/August_6",
  "/wiki/Myths_%26_Fables_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}