{
 "name": "Krdys Mordi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 ABY",
      "New Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dark Empire",
      "Dark Side Elite",
      "Dark Side Squadron",
      "Dark Side Elite",
      "Dark Side Squadron"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Palpatine"
     ]
    }
   ]
  }
 ],
 "content": "Krdys Mordi was a Human male Dark Jedi who served the reborn Galactic Emperor Palpatine during the Galactic Civil War as part of his selected cadre of darksiders, the Dark Side Elite. In 10 ABY, after the Emperor's second death, Mordi participated in the Imperial offensive called Operation Shadow Hand. During that campaign, he accompanied the leader of the Dark Side Elite, Executor Sedriss QL, in the failed subjugation effort of the rebellious planet Balmorra.\nWhen the Emperor returned in a clone body once again and sought to capture Jedi Luke Skywalker and his sister Leia Organa Solo's twin children, Mordi participated in a mission to the planet New Alderaan with the goal of abducting the three targets. Alongside Palpatine's second-in-command, Tedryn-Sha, Mordi tried to poison Skywalker and capture him during his sleep, but the Jedi Master received assistance from his sister and the young Jedi trainee Jem Ysanna. During the confrontation that followed, Mordi was killed by Ysanna, who sliced his body in half with her lightsaber.\nKrdys Mordi was a Human male Dark Jedi in service to the Galactic Emperor Palpatine, who was reborn in a clone body after his death at the Battle of Endor. The reincarnated Emperor ruled his clandestine Dark Empire—the latest incarnation of the once-dominant Galactic Empire—from the Deep Core world of Byss. During this time, Mordi became a member of Palpatine's Dark Side Elite, a group of seven Dark Jedi empowered with the dark side of the Force by the Emperor himself.\nIn 10 ABY, Palpatine died again during a battle with the Jedi Luke Skywalker and his sister, Leia Organa Solo, near the New Republic's Pinnacle Base. In the aftermath of Palpatine's death, the leader of the Dark Side Elite, Executor Sedriss QL, took command of the Imperial forces and oversaw Operation Shadow Hand, a series of strikes intending to place neutral planets under firm Imperial rule.\nOne of the targets of Sedriss's campaign was the factory world of Balmorra. After the death of the Emperor, the ruler of the planet, Governor Hinch Beltane, had started supplying the New Republic with weapons, an arrangement that Sedriss was determined to put an end to. As one of Sedriss's sergeants at arms, Mordi, alongside fellow Dark Jedi Vill Goir, accompanied the Executor to Balmorra aboard the Star Destroyer Avenger, joining an Imperial fleet already assembled in orbit of the planet.\nUpon the group's arrival, Sedriss offered Beltane a chance to surrender his operations to the Empire and face execution, lest the Empire launch a full-scale invasion of the planet. Beltane did not heed Sedriss's threats, believing that Sedriss would not dare risk damaging Balmorran factories in a direct assault, as they still produced weaponry for the Empire as well. Mordi concurred with Beltane's point of view, reminding Sedriss that Balmorran factories were currently manufacturing the new SD-10 battle droid model, which were meant to replace the Empire's outdated SD-9 model.\nHowever, Sedriss had formulated a plan that would allow him to conquer the planet without damaging the factories. As such, he proceeded with the attack, launching ground troops under the command of Captain Maximilian Veers. When Balmorran droids fully engaged Sedriss's invasion troops and were drawn from the capital, Bin Prime, to the open plains surrounding it, the Executor ordered Mordi to pull back the Empire's forces and launched his secret weapon, the new highly advanced Shadow Droid starfighters.\nThe Shadow Droids temporarily turned the tide of the battle in favor of the Empire. However, Beltane had a trick of his own, deploying the newly developed X-1 Viper Automadon droids at the invasion force. Amazed at the firepower of Beltane's creation, Sedriss contacted the governor and acknowledged his victory. Mordi and Goir disagreed with that decision, believing that Sedriss should have simply ordered his fleet to initiate an orbital bombardment of the planet. However, Sedriss wanted to obtain the X-1 droids for himself before attempting any punishing actions against Beltane, and he negotiated a treaty with the governor, granting Balmorra freedom and purchasing a number of X-1 Vipers from him.\nShortly after the Battle of Balmorra, Palpatine was resurrected on Byss in his final available clone body. He took control of the Empire once again and successfully destroyed the New Republic's Pinnacle Base on the moon Da Soocha V with his new superweapon, the Galaxy Gun. The New Republic was forced to retreat to a secret sanctuary world, where Organa Solo was hiding her twin children, whom the Emperor wanted to capture and turn to the dark side.\nThe Emperor soon learned the name of the hidden planet, New Alderaan, as well as its coordinates, from the captured New Republic Major Ntthan. Palpatine then sent the Dark Side Elite there under the command of Xecr Nist, his newly appointed Executor. Nist was a replacement for Sedriss, who had recently been killed in battle with Skywalker. Mordi and the other darksiders boarded their I-7 Howlrunner starships and departed from their headquarters of Bast Castle on the planet Vjun as Dark Side Squadron. Upon arrival on New Alderaan, the Dark Side Elite split up. Nist took four Dark Jedi with him and went to abduct the Solo twins, Jacen and Jaina, while Mordi was dispatched alongside Palpatine's second-in-command, Tedryn-Sha, to confront Skywalker himself.\nMordi and Sha were instructed to incapacitate the Jedi Master with specialized scarab droids while he was asleep, so that he could be taken captive. Hiding their presence from the sleeping Jedi with the Force, the two darksiders reached his room and released the scarab droids upon Skywalker through a window. The droids administered a powerful poison into the Jedi's nervous system, and the two Dark Jedi entered the room to capture Skywalker.\nHowever, in his delirium, Skywalker let out a loud scream, which alerted Organa Solo and one of Skywalker's aspiring Jedi, Jem Ysanna. The two women rushed to Skywalker's help, and Ysanna immediately killed Mordi by slicing him across the torso with her lightsaber. Sha killed her in response with a blaster shot but was himself slain by Organa Solo with a lightsaber strike. Mordi and Sha's incursion was ultimately a failure, as Skywalker was healed from the effects of the poison by the elderly Jedi Vima-Da-Boda.\nKrdys Mordi was a Dark Jedi loyal to Palpatine and his Dark Empire. During the Battle of Balmorra, Mordi initially advised Sedriss QL against launching an invasion of the planet, afraid of damaging Balmorra's factories, which were producing the much-needed Imperial SD-10 droids. However, as Balmorra's Governor Beltane continued to show defiance, Mordi expressed an opinion that Sedriss needed to bombard the planet to show the governor the error of his ways.\nOn New Alderaan, Mordi was initially not impressed with Luke Skywalker after seeing him asleep, believing that the Jedi posed no threat in that state. He later underestimated Jem Ysanna and Leia Organa Solo as well, based on the single fact that they were women—a mistake that led to his demise. The Dark Jedi had light skin and eyes that glowed yellow.\nMordi was a Force-sensitive who was empowered with the dark side by Palpatine himself, becoming a Dark Jedi. He could hide his presence in the Force, which allowed him to sneak up on Luke Skywalker undetected on New Alderaan. Mordi flew an I-7 Howlrunner as part of Dark Side Squadron.\nDuring his service to Palpatine, Mordi was dressed in an outfit similar to his cohorts in the Dark Side Elite, wearing a dark robe with a long cape and a hood that covered his head, as well as massive boots and gauntlets. During the Battle of Balmorra, he also wore glasses and carried a staff.\nThe Dark Jedi Mordi first appeared in the Dark Horse comic book Dark Empire II 1, written by Tom Veitch, illustrated by Cam Kennedy, and published on December 20, 1994. The character returned in the final issue of the Star Wars: Dark Empire II comic series, in which he was provided with the first name \"Krdys\" and was killed off. Mordi was originally set to debut in Veitch's proposed short novel, Lightsider, which would have taken place before Dark Empire II and would have introduced the Dark Side Elite. However, Lightsider was never published.\nIn the Dark Empire II audio drama, Mordi is absent during the invasion of Balmorra scenes, with Vill Goir serving as Sedriss's sole advisor. Mordi does appear in the audio drama during the events on New Alderaan, and he has a brief exchange of dialogue with Jem Ysanna, challenging her to a fight. In the original comic, Mordi is killed immediately after the Jedi women rush to Skywalker's aid, with no dialogue spoken between them. The comic guide Star Wars Handbook 3: Dark Empire states that Mordi underwent the initiation into the Dark Side Elite alongside Xecr Nist. This contradicts the fourth issue of the Dark Empire II comic series, which features Tedryn-Sha as the other subject of the initiation beside Nist, while Mordi had already been a member of the group by that point.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/10_ABY/Legends",
  "/wiki/New_Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Dark_Side_Elite",
  "/wiki/Dark_Side_Squadron",
  "/wiki/Palpatine/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Transfer_essence",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Darksider",
  "/wiki/Emperor/Legends",
  "/wiki/Battle_of_Pinnacle_Base",
  "/wiki/Operation_Shadow_Hand",
  "/wiki/Executor_(Imperial_rank)",
  "/wiki/Sedriss_QL",
  "/wiki/Battle_of_Balmorra",
  "/wiki/Planet/Legends",
  "/wiki/Balmorra/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Solo_twins",
  "/wiki/Battle_of_New_Alderaan_(Operation_Shadow_Hand)",
  "/wiki/Tedryn-Sha",
  "/wiki/Poison/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jem_Ysanna",
  "/wiki/Death/Legends",
  "/wiki/Sai_tok/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Byss/Legends",
  "/wiki/Time/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Pinnacle_Base",
  "/wiki/Factory_world/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Hinch_Beltane",
  "/wiki/Sergeant/Legends",
  "/wiki/Vill_Goir",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Avenger/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Factory/Legends",
  "/wiki/SD-10_battle_droid",
  "/wiki/SD-9-series_battle_droid",
  "/wiki/Troop/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Bin_Prime",
  "/wiki/Shadow_Droid",
  "/wiki/Starfighter/Legends",
  "/wiki/X-1_Viper",
  "/wiki/Fleet/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Destruction_of_Da_Soocha_V",
  "/wiki/Moon/Legends",
  "/wiki/Da_Soocha_V",
  "/wiki/Superweapon/Legends",
  "/wiki/Galaxy_Gun",
  "/wiki/Safe_world",
  "/wiki/Major/Legends",
  "/wiki/Ntthan",
  "/wiki/Xecr_Nist",
  "/wiki/Skirmish_on_Ossus",
  "/wiki/I-7_Howlrunner",
  "/wiki/Starship/Legends",
  "/wiki/Bast_Castle",
  "/wiki/Vjun/Legends",
  "/wiki/Twin/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Scarab_Mark_VI_assassin_droid",
  "/wiki/Force_stealth",
  "/wiki/The_Force/Legends",
  "/wiki/Window/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Vima-Da-Boda",
  "/wiki/Eye/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Cape/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Gauntlet/Legends",
  "/wiki/Spectacles",
  "/wiki/Staff/Legends",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dark_Empire_II_1",
  "/wiki/Tom_Veitch",
  "/wiki/Cam_Kennedy",
  "/wiki/December_20",
  "/wiki/1994",
  "/wiki/Dark_Empire_II_6",
  "/wiki/Star_Wars:_Dark_Empire_II",
  "/wiki/Lightsider_(story)",
  "/wiki/Dark_Empire_II_(audio)",
  "/wiki/Star_Wars_Handbook_3:_Dark_Empire",
  "/wiki/Dark_Empire_II_4",
  "/wiki/Category:Images_of_Krdys_Mordi",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_4",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_85",
  "/wiki/The_Official_Star_Wars_Fact_File_98",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Databank_(original)",
  "/wiki/Dark_Empire_6",
  "/wiki/Dark_Empire_II_5",
  "/wiki/Dark_Empire_II_3",
  "/wiki/Marvel_Comics"
 ]
}