{
 "name": "Kressis",
 "display_name": "Kressis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Kressis was a male Trandoshan who lived on the planet Almas during the waning years of the Galactic Republic, working as the lead harvester on a kaluthin farm ran by the farmer Rashen Sotose. In circa 31 BBY, Kressis was operating a harvester vehicle when the farm fell under attack from the Believers, an Almas-based Sith cult. Following the attack, the farm was abandoned and Kressis made his way to Building 49-A, Almas' only cantina. The Heroes of Cularin—a group of freelance agents that were investigating a Believer plot to poison all of the kaluthin on Almas—traveled to the cantina during the course of their investigation, and encountered Kressis.\nKressis agreed to take the agents to the Sotose farm, and they traveled there in an airspeeder. On arrival, Kressis explained to agents about the farm's features and layout, and he remained inside the speeder, clutching a blaster rifle and nervously looking around. The agents were then contacted by the Ithorian scientist Gilloma via a comlink, who informed them of a sighting of the Believers at a nearby farm. They left to investigate and Kressis chose to remain behind, to guard Sotose's farm.\nKressis appeared in The Kaluthin Are Always Greener, a role-playing module that formed part of the Living Force campaign. During the scenario, the players—who role-play as the Heroes of Cularin—encounter Kressis and if they tell him that are working on the behalf of the Forard research station, he offers to take them to the Sotose farm.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Kaluthin",
  "/wiki/Farmer/Legends",
  "/wiki/Rashen_Sotose",
  "/wiki/31_BBY/Legends",
  "/wiki/Harvester",
  "/wiki/Believers",
  "/wiki/Sith_cult/Legends",
  "/wiki/Building_49-A",
  "/wiki/Cantina/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Agent/Legends",
  "/wiki/Canon",
  "/wiki/Airspeeder/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Gilloma",
  "/wiki/Comlink/Legends",
  "/wiki/The_Kaluthin_Are_Always_Greener",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Forard_research_station"
 ]
}