{
 "name": "Kreshan",
 "display_name": "Kreshan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Hammer Station"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Advozse"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Advozse Hegemony"
     ]
    }
   ]
  }
 ],
 "content": "Kreshan was a male Advozse who served the Advozse Hegemony as a warlord. During the Cold War between the Galactic Republic and the Sith Empire, he controlled the salvaged Republic space station known as Hammer Station. He was killed when a strike team attacked and destroyed the station.\nKreshan was male Advozse who served as a warlord of the Advozse Hegemony during the Cold War between the Galactic Republic and the Sith Empire. During the war, he commanded the Hegemony's forces on Hammer Station, a Republic space station equipped with a gravity cannon capable of firing asteroids, which the Hegemony had salvaged and taken control of. Under his command the station moved throughout the Outer Rim Territories conquering worlds, eventually entering the orbit of the planet Saleucami and demanded its surrender.\nWhile Hammer Station orbited Saleucami, an enemy strike team landed on board the station with the aim of destroying it. Kreshan issued orders to his men over the stations communication system as they fought the intruders, although none of the Hegemony's forces were successful in stopping the team and they eventually reached Kreshan's location in Section Zero of the station. There, next to the stations asteroid launching weaponry, Kreshan battled the team but was defeated and killed, after which his killers set Hammer Station to overload and destroy itself.\nKreshan was hairless, with purple eyes and pink skin. He believed the strike team was arrogant to attempt to take on him and his men, but upon his defeat declared his regret at having failed the Hegemony's Supreme Warmaster.\nKreshan wore Black armor and used a pair of blaster pistols in combat.\nKreshan first appeared in \"Bringing Down the Hammer\", a trailer for the MMORPG Star Wars: The Old Republic which was released on the games official website in 2011 and showcased the Hammer Station flashpoint from the game. He then appeared in the game itself, which was released by BioWare later in 2011. In the game he served as the final boss of the optional group flashpoint \"Hammer Station\", Which became available to players fairly early in the game. As any player's of either faction can take part in this mission, this article makes no assumption about which characters where included in the strike team or which faction sent the team; it does however assume that the flashpoint was completed as part of one hundred percent game completion. The flashpoint can be completed at any point after a player unlocks it, but this article assumes it was completed as soon as it became available, meaning the events happen during the Cold War and not the later Galactic War.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Hammer_Station",
  "/wiki/Advozse/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Advozse_Hegemony",
  "/wiki/Warlord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Space_station/Legends",
  "/wiki/Death/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Saleucami/Legends",
  "/wiki/Canon",
  "/wiki/Battle_for_the_Hammer",
  "/wiki/Eye/Legends",
  "/wiki/Supreme_Warmaster",
  "/wiki/Armor/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Galactic_War",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}