{
 "name": "Krin_Vel",
 "display_name": "Krin Vel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Krin Vel was a Twi'lek moisture farmer who lived on Tatooine during the Galactic Civil War.\nKrin Vel was a friend of Kitster Chanchani Banai. In 1 ABY, a slaver named Drik Bandrik became upset with Kitster Banai's persistent attempts to improve the lives of slaves on Tatooine. In order to ruin Kitster, Drik Bandrik framed him with the murder of Krin Vel. Drik paid Krin to leave Mos Espa long enough for local vigilante leader Sont Toipo to amass an angry mob to kill Kitster. At this point, Krin Vel ignored everything of the plot against her friend. This mob of moisture farmers believed Krin Vel to have been murdered.\nHowever, a spacer working for Kitster managed to kill Sont Toipo and frighten his mob. The spacer then proceeded to find Krin Vel, so that she could help Kitster clear his name. When the spacer found Krin, she insisted that she did not know she was being used in a frame. She pleaded with the spacer to be brought back to Mos Espa. The spacer brought her back to the city, and Kitster claimed that with the help of Krin, they would see to it that Drik Bandrik went to prison. Fortunately for Kitster, Krin Vel assisted him amassing enough evidence to clear him of all of Drik's fake charges. The spacer was then tasked with delivering the evidence to a Kitonak named Thermal Det, so that the information could be made public.\nKrin Vel was a Non-Player Character  in the MMORPG Star Wars Galaxies, prior to its closure on December 15, 2011. Players who performed a series of quests for Kitster in Mos Espa had to find and escort Krin Vel back to the city.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vel",
  "/wiki/Tatooine/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kitster_Chanchani_Banai",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Moisture_farmer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Drik_Bandrik",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Sont_Toipo",
  "/wiki/Spacer/Legends",
  "/wiki/City/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Kitonak/Legends",
  "/wiki/Thermal_Det",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance",
  "/wiki/Sony"
 ]
}