{
 "name": "Krrsantan",
 "display_name": "Krrsantan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Xonti Brothers",
      "Hutt Clan",
      "Jabba's criminal empire",
      "The Twins",
      "Jabba's criminal empire",
      "The Twins",
      "Galactic Empire",
      "Chelli Lona Aphra's crew",
      "Fett gotra"
     ]
    }
   ]
  }
 ],
 "content": "Krrsantan, also known as Black Krrsantan, and nicknamed \"Santy,\" \"BK,\" and \"Black K\" by Doctor Aphra and \"Santo\" by Garsa Fwip and Boba Fett, was a male Wookiee bounty hunter whose career spanned from during the rule of the Galactic Empire into the era of the New Republic. Originally escaping his homeworld Kashyyyk and trained by the infamous Xonti Brothers as a gladiator, Krrsantan later became a ferocious bounty hunter. He was regularly hired by the crime lord Jabba the Hutt and at one point fought Obi-Wan Kenobi, receiving a scar from the Jedi Master's lightsaber. During the Galactic Civil War, Darth Vader hired Krrsantan to track down and capture an agent of the Emperor.\nFollowing the death of Jabba and the end of the war, Krrsantan was employed by that late Hutt's cousins, brother and sister crime lords known as the Twins. Their cousin's criminal empire had been taken over by the former bounty hunter Boba Fett, and the Hutts sought Krrsantan's services in wresting control away from the self-appointed Daimyo. Krrsantan attempted to assassinate Fett, but was captured by his forces. Shortly after, the Twins promised to leave Tatooine, and Krrsantan was eventually employed by Boba Fett. A part of Fett's forces, he participated in a battle against the Pyke Syndicate, which resulted in the Fett gotra's victory.\nEarly in his life, Krrsantan was forced to flee his homeworld of Kashyyyk and subsequently disgraced his people. He sought out the pit fighting crime bosses, the Xonti Brothers, who used slavers to acquire new fighters, to learn from them in fighting. Krrsantan attacked four slaver groups, wiping out each of them when learning they did not work for the Xonti. Krrsantan set a trap for another group, leaving a Wookiee to bleed to death as bait. A group of five Trandoshans slavers arrived shortly thereafter, walking into the trap. Krrsantan opened fire on the slavers, quickly killing three of them. The remaining two, Noka and Kootan, took cover behind a tree until Kootan attempted to kill Krrsantan. The Wookiee incapacitated the Trandoshan and tossed him into a tree.\nKrrsantan stood over Noka and ordered the slaver to take him to the Xonti Brothers. Noka allowed the Wookiee aboard his ship, and brought him and four captured aliens—a Talz, a Herglic, a Gamorrean and a Dowutin—to the Xonti brothers. On the way, Noka asked what would have happened if he was not with the Xonti. Krrsantan cited the four other slaver groups he had wiped out, although Noka only knew of two disappearing in the past month, which made the Wookiee laugh.\nNoka took them to the Xonti Brothers, who were surprised to find a Wookiee had volunteered. The brothers approached Krrsantan, commending his ambition before stunning him and putting him in a cage. The brothers then put their five new fighters through harsh training, soon choosing to raise the level to pick off the weaker ones. The Talz fell first to a sarlacc. Then the Gamorrean was killed by a large monster. The Herglic fell later to a swarm of tiny robots. Thus only Krrsantan and the Dowutin survived. To make the Wookiee a valuable fighter to buyers, the Xonti Brothers, with the help of Cylo, altered the Wookiee's entire skeletal structure, particularly his knuckles by filling and plating them with metal to give him an edge in the fighter market. Now equipped with what one of the brothers called \"permanent knuckle dusters\" Krrsantan was able to beat the Dowutin and knocked it unconscious in one punch.\nKrrsantan and the Dowutin were put on show in front of buyers, where they were pitted against fighters with weapons. Faced by a Trandoshan, a Kajain'sa'Nikto and a Houk, Krrsantan dropped his blades and attacked the Trandoshan, destroying its head. The Wookiee then threw the fighter's body into the Nikto and threw the Houk into a fire. Taking the Nikto by the throat, Krrsantan had the fighter give tribute to \"Black Krrsantan\" before the audience before the Wookiee snapped the Nikto's neck. The display captivated buyers, who began inquiring on purchasing Krrsantan. The Wookiee became a heavyweight champion thereafter, but swore to affect the Xonti Brothers in the same way they had affected him.\nSometime later, Krrsantan became a bounty hunter for the crime lord Jabba the Hutt who resided on the desert planet Tatooine. In either 8 BBY or 7 BBY, Krrsantan was hired by Jabba to track down the man who stopped his water tax. He went to the location of the attack in the Dune Sea with Pagetti Rook and a Klatooinian guard. Krrsantan went to the moisture farm nearby and took Owen Lars hostage. Krrsantan then made Lars scream. He then saw the man who had stopped the water tax, \"Ben\" Kenobi, appear behind him. He was given a chance to leave by Kenobi. Before Kenobi could use a Jedi mind trick to make him leave, Krrsantan attacked him, choking him and trapping him with a stun net.\nLars fought back against Krrsantan but was easily knocked aside. Kenobi used the Force to cause rocks to hit Krrsantan and save Lars from falling. Krrsantan then tried to kill Kenobi with a rock. Krrsantan was briefly blinded and scarred by Kenobi's lightsaber. He tried to shoot Kenobi again with his electrified net gun, but it was destroyed. Krrsantan then punched and tried once more to kill Kenobi, as Kenobi attempted to rescue Lars. He continued trying to kill him with his bowcaster until he fell off the side of a cliff. Krrsantan then fled Tatooine, knowing that Jabba would be incensed at his failure.\nLater, Krrsantan was hired by Augustus Graves, Chief Executive Officer of the Corellian Engineering Corporation. Graves had learned that Jabba was planning to steal a verillix urn containing the ashes of one of his most hated rivals, Krestrel D'Naran. In turn, Graves hired Krrsantan to go to Antillion and ensure the urn's safety, as Graves had traded it to a Sava on the planet named Madelin Sun. Upon arriving at Sun's shop, he found notorious smuggler Han Solo and his father Ovan attempting to steal the urn. Krrsantan then stunned Ovan and knocked out Solo. After a brief firefight with Solo's Wookiee companion Chewbacca, Krrsantan brought Solo aboard his gunship and fled the planet, unaware that Chewbacca had placed a homing beacon on the ship's hull. Once he returned to Graves' palace on Mollo Tanka, Krrsantan stood guard while Graves interrogated Solo for the location of the urn. But they were soon interrupted by Chewbacca, who fought Krrsantan in a death duel and subdued him with a thermal detonator before leaving with Solo. Krrsantan pursued Solo and Chewbacca with Graves' guards. But once they had them at gunpoint, they were ambushed by Khel Tanna and her crew aboard their starship, at which point Krrsantan hastily retreated while the smuggler and Wookiee escaped.\nEventually, Black Krrsantan was able to return to Tatooine and Jabba's service. Shortly after the Battle of Yavin, Darth Vader traveled to Tatooine on a mission to negotiate on behalf of the Galactic Empire for supplies with Jabba. Vader also used the opportunity to take on a personal mission, and he requested two bounty hunters from Jabba. The Hutt provided his two best bounty hunters, Krrsantan and Boba Fett. While Fett was to track down Luke Skywalker, the Rebel Alliance pilot who destroyed the Death Star and who was secretly Vader's son, Krrsantan was hired to find and capture an agent of the Emperor. Vader wanted this agent, whose identity and purpose Darth Sidious did not reveal to the Dark Lord, in order to find out why he was working for the Emperor.\nKrrsantan successfully tracked down his mark and discovered that he was moving illegal alien parts to a secret base in the Outer Rim. The agent discovered Krrsantan was following him before he could find out where the base was or what he was doing for the Emperor. Krrsantan captured the agent and brought him to Vader aboard his Nubian starship, where he witnessed the agent, whose named was Cylo-IV, being killed by Vader's new torture droid, 0-0-0, but not before providing the information Krrsantan had previously failed to acquire.\nSometime after his contract for Vader expired, Krrsantan was summoned along with fellow bounty hunters Bossk, IG-90, and Beebox to a cantina on Son-tuul where, as he waited for his fellows, Krrsantan entered the cantina's fighting pits, where captured Wookiees fought each other for the entertainment of the customers. Krrsantan strangled a fighter and took his place to become a contestant, becoming one of the only Wookiees to enter the pits willingly. The Wookiee bounty hunter won the fight by beating his opponent to death.\nAfter the fight, Krrsantan joined Beebox, Bossk, and IG-90 in the cantina where they were approached by rogue archaeologist Aphra, who had issued the summons. She told the assembled bounty hunters about her plans for a heist: the Empire had just broken the criminal element known as the Son-tuul Pride, which dominated Son-tuul's underworld. The fortune they had hoarded was in transit to the Imperial vaults. Aphra told the bounty hunters that she had inside information which would allow them to locate the transport, circumvent the guards and get away, and that she was offering them a part in exchange for their services.\nKrrsantan then piloted his ship towards Anthan Prime. There, Krrsantan was able to use an asteroid to penetrate the Arquitens-class light cruiser's hull. He and the others gathered what remained of the credits aboard the cruiser before using the ship to collect the credits floating in space. After the heist, Krrsantan went with Aphra to Anthan 13, where they met with Lord Vader.\nKrrsantan went to Vrogas Vas, where he attacked the Millennium Falcon by colliding with the ship, grounding it. He attempted to capture Skywalker, only to be met by Chewbacca. Having been poisoned by Triple-Zero, he could not best Krrsantan. However, Chewbacca was shot with a needle by R2-D2, counteracting the poison. Krrsantan was then knocked down by Chewbacca. However, Krrsantan quickly knocked Chewbacca out with his brass knuckles before confronting Solo. A damaged C-3PO then told him to stop before accidentally electrocuting him after making contact with his brass knuckles.\nKrrsantan survived the battle. He and several other bounty hunters were secretly hired by Vader to find Aphra; dead or alive. He then met up with Vader on Anthan 13 with a squad of commando droids.\nKrrsantan, along with 0-0-0 and BT-1 then went to Cosmatanic Steppes to retrieve Aphra. He then took her to Lord Vader's new flagship, the Executor. Nonetheless, he then fought alongside Aphra and her droids against Cylo's forces, entirely because Aphra owed him money. After Vader retook the Executor and jettisoned Aphra into space, Krrsantan then rescued her from the vacuum of space.\nHe stayed in the doctor's crew until leaving her following the auction of Rur and ensuing skirmish aboard the Sorca Retreat, having captured the Xonti Brothers at long last. Nonetheless, he again joined with Aphra, who had taken on a protégé named Vulaada Klam, during the skirmish on Arbiflux, helping her take down the plot to assassinate Emperor Palpatine, which was being led by a rogue Imperial, Pitina Mar-Mas Voor, whose actions had led to the death of Aphra's mother Lona years prior. Following the Battle of Hoth and Aphra again escaping from Vader's service, Krrsantan again worked alongside her for a time. Later, he took a bounty of 20,000 credits offered for Aphra's capture by the Lady Domina Tagge of the Tagge Corporation. Focusing on the credits he could earn, he was more than willing to betray his former ally, though Aphra was able to stall him. Krrsantan was stunned by a fellow hunter, angering the Wookiee and giving Aphra an opening to escape.\nIn 4 ABY, Jabba was killed, creating a power vacuum on Tatooine. By 9 ABY, Krrsantan had been employed as a guard for the Twins, a Hutt brother and sister who spent their days involved in debauchery on the Hutt world of Nal Hutta. When the Twins traveled to Tatooine intending to reclaim the territory of their late cousin Jabba for the Hutts, Krrsantan accompanied them, acting as muscle.\nHowever, Jabba's empire had been claimed by former bounty hunter Boba Fett, who was unfazed by the gladiator's presence. Fett maintained that the territory was his, and that the Hutts should go back to Hutta. The Twins wanted to kill him, but the brother of the pair decided to defer the conflict until later, leaving Fett and bringing Krrsantan with them, the latter of whom glared at Fett before departing.\nFollowing the previous meeting with Tatooine's new Daimyo in Mos Espa, the Twins dispatched Krrsantan to kill their rival to Jabba's throne. The Wookiee infiltrated Boba Fett's Palace, and attacked an unsuspecting Fett, who was healing in his bacta tank. Throwing his target out of the tank and across the room, Krrsantan used his electrified brass knuckles to strike down the Daimyo. Fett then stabbed the Wookiee twice with a gaderffii stick, leaving the weapon in the bounty hunter's back. Krrsantan knocked his adversary across the room in response. Picking up Fett by the waist, the Wookiee began to squeeze around his target's spine with a bear hug. Fett tried to hit Krrsantan on the head, but his assassin bit his hand with his teeth.\nHowever, Fett's newly recruited street gang arrived and attacked Krrsantan, surrounding and engaging the Wookiee in melee combat. The bounty hunter knocked two to the floor and hit Fett into his bacta tank when he pulled the gaderffii stick out of his back. When Fett's two Gamorrean bodyguards came, Krrsantan tackled them both down the stairs to the throne room and used his strength to knock them around, biting one of them. The street gang returned to face the Wookiee when Fett's Master Assassin Fennec Shand intervened and activated a trap door below Krrsantan. The bounty hunter managed to grab onto the floor with one hand, but Shand threw a knife directly at Krrsantan's fingers which caused him to plummet down into Jabba's former rancor pit, where he found himself trapped.\nAfter the thwarted assassination attempt, the Twins met Fett by the palace door, with Krrsantan led in shackles by one of the Gamorrean guards. Fett offered to give him over to the Hutts. Once the Twins realized that their bounty hunter had failed, and that the planet was offered to another syndicate by mayor Mok Shaiz, they offered him as an extra gift to Fett alongside a rancor, before departing to Nal Hutta, uninterested in fighting over Tatooine with rival syndicates. Fett advised Krrsantan to not waste his time by working for the Hutts and freed him. Removed from his shackles, the Wookiee shared one last glace with Fett before running away.\nFollowing his departure from Fett's palace, Krrsantan found himself as a patron of Garsa Fwip's cantina, Sanctuary. While drinking at the cantina, he watched a group of Trandoshans gamble. Over time, he grew enraged, before eventually attacking the Trandoshans, causing havoc and destruction as the other patrons and Boba Fett, who had just arrived, watched. Garsa Fwip soon intervened, attempting to calm Krrsantan, stating that such violence was beneath an individual of his fame and notoriety—and pointing out the considerable bar tab he had accrued as a result of his destructive assault. Despite briefly pondering Fwip's words, he tore the arm off of one of his Trandoshan victims, then paid his tab and left the cantina.\nAs Krrsantan walked away from Sanctuary, Fett approached him. The Daimyo offered Krrsantan a job, which the Wookiee accepted. During an ensuing meeting—hosted by Fett—between the multiple families that ruled over Mos Espa's territory, Krrsantan stood present while under Fett's hire. He was also present during a meeting with the rest of Fett's associates, in preparation for war against the Pyke Syndicate.\nThe terrorist attack on the Sanctuary prompted the battle for Mos Espa and started open warfare between Boba Fett and the Pyke Syndicate. Commanded by Fett to patrol in the area of the City Hall, Krrsantan kept a keen eye on the streets of Mos Espa in the Trandoshan territorry. Observing the crowds of merchants and people wandering the streets, Krrsantan was suddenly ambushed by multiple Trandoshans that drew their weapons and advanced against the Wookiee. Nine Trandoshans made their way towards him and Krrsantan fired two rounds from his heavy blaster and killed two of his opponents. However, another Trandoshan impaled the Wookiee from behind. He roared in pain and bashed the attacker with his blaster. Retreating to the stairs of City Hall, the bounty hunter continued to battle against his Trandoshan aggressors even as they took away his blaster. He employed his enormous strength and brass knuckles to punch the Trandoshans. Though valiant in effort, Krrsantan was overwhelmed when the remaining seven Trandoshans restrained him and crawled all over him, pinning the Wookiee to the ground. In spite of this, the ex-gladiator managed to escape.\nWounded, Krrsantan made his way towards the rendezvous, the destroyed Sanctuary. Making his way through the Pykes, Krrsantan spotted Fett and his allies barricaded behind a landspeeder in front of Sanctuary. Carrying one Pyke on his shoulder and dragging another which held onto his blaster, Krrsantan dropped the one on his shoulder and then pushed the other Pyke hard enough to shoot him mid-air. More Pykes began to open fire on him, some hitting him, though some hit his gold armor. Picking up the Pyke he had dropped, the battle-worn Wookiee heaved him several meters at an advancing Pyke. Still under fire, Krrsantan began to limp his way towards Fett and the others while taking out the Pykes he could. By this point, Krrsantan had been cut, stabbed, and shot multiple times and was starting to succumb to his wounds.\nKrrsantan still tried to power his way through the pain, but after another shot to his already injured right leg, he collapsed. Fett and Djarin ran to Krrsantan's aid, taking most of the fire from the Pykes. Helping Krrsantan to the landspeder, Fett welcomed the Wookiee back and was impressed he was still alive, promising him a bacta tank soak after the whole ordeal was over. While resting and recuperating, the Fett gotra fought against the Pykes in a large shoot-out. Then the Pyke forces suddenly retreated and two large scorpenek droids approached, armed with two heavy turrets and a shield generator. Boba Fett and his allies failed to penetrate their shields. Blasting the landspeeder, Krrsantan followed the people of Freetown as they ran towards the Worker's District to seek shelter.\nDespite Fett and the Mandalorian distracting one of the droids, the second droid pursued the fleeing people. Taking cover behind a wall, Krrsantan waited until the droid was right in front of him and opened fire at close range. Using his hand, Krrsantan pressed against the shield and managed to pierce it with his fingertips. However, just as he had his hand through the shield, he was knocked back into the wall by one of the droid's legs. Falling down, the Wookiee was helped up by Drash and Skad, who supported him until three Pykes appeared, which they all fired upon. They then helped him escape with the others. Finding a shelter, Krrsantan and the Weequay Taanti kept firing at the droid's shield until the others were safe. Backed against a corner, Krrsantan and the others were forced to make their stand.\nTrying to distract the droid and the Pykes, Krrsantan allowed Drash and one of the people of Freetown to get to a roof to see if they could get through the shield, although the attempt failed. Suddenly, the nearby wall burst into rubble as Fett rode atop his rancor and let it smash the droid, eventually destroying it after a prolonged fight. Boba Fett was separated from the rancor by Cad Bane and the beast started to roam through Mos Espa and rampaged throughout the spaceport. Krrsantan joined the others and tried to quell the beast, however they only succeeded in angering it further. The rancor threw a landspeeder, which Krrsantan dodged.\nFollowing the aftermath and their subsequent victory against the Pyke Syndicate, Krrsantan healed his wounds and was given a meiloorun fruit from the locals by Boba Fett. Skad jokingly asked if the Wookiee would share, which Krrsantan merely roared at.\nDuring the First Order-Resistance War, Rey lied to another bounty hunter, Kief Varris that Krrsantan, along with other bounty hunters, at one point attempted to capture Moebin Faltus but failed to do so.\nBlack Krrsantan was a male Wookiee. He had black hair and brown eyes, with decorative gold material covering his chest, as well as gold ornaments in his hair. He had a scar across his left eye from Kenobi's lightsaber. He disgraced his people on Kashyyyk, prompting him to get off world. When he first heard of the Xonti Brothers, Krrsantan did not hesitate to try and get to them, going as far as killing most of a Trandoshan acquisition crew to get to them. The last Trandoshan, Noka, was surprised of Krrsantan's willingness to join.\nHowever, Krrsantan soon found out what he really signed up for and after harsh training as a gladiator, he swore a life debt on the Xonti Brothers, a pledge to affect them in the same way they had affected him. Krrsantan eventually saw the Xonti Brothers again during the auction of Rur, where he attempted to capture them. After the Auction ended in the deaths of many members, Krrsantan used it as his chance to capture the Xonti Brothers and he did, taking them back to their gladiatorial pits to fulfill the life debt. When Krrsantan greeted Doctor Aphra with a hug and a smile on Arbiflux, Vulaada Klam suspected it was because Krrsantan considered her a friend, but Aphra believed the Wookiee only saw her as a friend so long as she had a debt to him that she was alive to pay off. Indeed, for all their history together, Krrsantan was more than willing to turn on Aphra when a bounty was offered for her capture, showing no remorse for his betrayal when Aphra tried to bring up their past alliances.\nBlack Krrsantan underwent intense training under the Xonti Brothers to become a better pit fighter, although before he had managed to quickly overpower a Trandoshan slaver crew. According to Boba Fett, Black Krrsantan was one of Jabba's best bounty hunters. The Wookiee had the ability to wield a bowcaster. He was a good fighter even against his fellow Wookiees, such as Chewbacca. The ferocious Wookiee could fight against the exiled Jedi Master Obi-Wan Kenobi and even came close to killing Boba Fett himself. The Wookiee has also a high tolerance for pain most likely due to his gladiatorial training. Even after being at the mercy of blades, spears and several blaster bolts, Krrsantan proved himself capable of standing strong. Krrsantan could lift massive boulders, crush bones, and throw other creatures around with ease. He would also utilize his sharp teeth to bite on occasion. His knuckles had been injected with metal filling, granting the already-strong Wookiee enough power to knock a Dowutin unconscious. He could amplify the force of his blows even further through the use of his electrified, spiked knuckle-dusters.\nCreated by writer Kieron Gillen, illustrator Salvador Larroca, with editors Jordan D. White and Heather Antos, Black Krrsantan debuted in the first issue of Marvel Comics' Darth Vader comic book series on February 11, 2015. He made his live-action debut in the Disney+ series The Book of Boba Fett in which he appeared in \"Chapter 2: The Tribes of Tatooine,\" which aired on January 5, 2022, becoming one of the few Star Wars characters to originate in comics to later appear in live-action media. The credits of the episode did not attribute Black Krrsantan to anyone in the cast, however Pablo Hidalgo later revealed the character was indeed portrayed by Carey Jones, who was credited as a co-star in the episode, but with no character attributed to his name.\nIn January 2022, Kieron Gillen revealed on Twitter that Black Krrsantan's working name during his writing process was \"Newbacca.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Talk:Krrsantan",
  "/wiki/Kashyyyk",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Xonti_Brothers",
  "/wiki/Hutt_Clan",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/The_Twins_(Hutts)",
  "/wiki/Galactic_Empire",
  "/wiki/Chelli_Lona_Aphra%27s_crew",
  "/wiki/Fett_gotra",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Garsa_Fwip",
  "/wiki/Boba_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Imperial_Era",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Gladiator",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Galactic_Civil_War",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cylo",
  "/wiki/Galactic_Emperor",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Galactic_Concordance",
  "/wiki/Unidentified_Hutt_brother",
  "/wiki/Unidentified_Hutt_sister",
  "/wiki/Daimyo",
  "/wiki/Assassination_attempt_on_Boba_Fett",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/Pyke_Syndicate",
  "/wiki/Homeworld",
  "/wiki/Trandoshan",
  "/wiki/Noka",
  "/wiki/Kootan",
  "/wiki/Tree",
  "/wiki/Alien",
  "/wiki/Talz",
  "/wiki/Herglic",
  "/wiki/Gamorrean",
  "/wiki/Dowutin",
  "/wiki/Standard_month",
  "/wiki/Sarlacc",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Houk",
  "/wiki/Nikto",
  "/wiki/Fire",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/7_BBY",
  "/wiki/Water_tax",
  "/wiki/Dune_Sea",
  "/wiki/Pagetti_Rook",
  "/wiki/Klatooinian",
  "/wiki/Lars_Homestead",
  "/wiki/Owen_Lars",
  "/wiki/Jedi_mind_trick",
  "/wiki/Stun_net",
  "/wiki/The_Force",
  "/wiki/Death",
  "/wiki/Electrified_net_gun",
  "/wiki/Bowcaster",
  "/wiki/Augustus_Graves",
  "/wiki/Chief_Executive_Officer",
  "/wiki/Corellian_Engineering_Corporation",
  "/wiki/Krestrel_D%27Naran",
  "/wiki/Antillion",
  "/wiki/Sava",
  "/wiki/The_Archivist",
  "/wiki/Han_Solo",
  "/wiki/Ovan",
  "/wiki/Corbus_Tyra",
  "/wiki/Chewbacca",
  "/wiki/Black_Krrsantan%27s_Auzituck_anti-slaver_gunship",
  "/wiki/Homing_beacon",
  "/wiki/Mollo_Tanka",
  "/wiki/Thermal_detonator",
  "/wiki/Khel_Tanna",
  "/wiki/Khel_Tanna%27s_crew",
  "/wiki/Khel_Tanna%27s_starship",
  "/wiki/Battle_of_Yavin",
  "/wiki/Assault_on_Cymoon",
  "/wiki/Bounty",
  "/wiki/Luke_Skywalker",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_pilot",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Agent",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Cylo%27s_research_base",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Naboo_Royal_Starship",
  "/wiki/Starship",
  "/wiki/Torture",
  "/wiki/Droid",
  "/wiki/0-0-0",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/IG-90",
  "/wiki/Beebox",
  "/wiki/Cantina",
  "/wiki/Son-tuul",
  "/wiki/Fighting_pit",
  "/wiki/Archaeologist",
  "/wiki/Son-tuul_Pride_robbery",
  "/wiki/First_attack_on_the_Son-tuul_Pride",
  "/wiki/Son-tuul_Pride",
  "/wiki/Transport",
  "/wiki/Anthan_Prime",
  "/wiki/Arquitens-class_light_cruiser",
  "/wiki/Hull",
  "/wiki/Credit",
  "/wiki/Cruiser",
  "/wiki/Anthan_13",
  "/wiki/Lord",
  "/wiki/Vrogas_Vas",
  "/wiki/Battle_of_Vrogas_Vas",
  "/wiki/Millennium_Falcon",
  "/wiki/Needle",
  "/wiki/R2-D2",
  "/wiki/Brass_knuckles",
  "/wiki/C-3PO",
  "/wiki/BX-series_droid_commando",
  "/wiki/BT-1",
  "/wiki/Cosmatanic_Steppes",
  "/wiki/Capture_of_Chelli_Lona_Aphra",
  "/wiki/Executor",
  "/wiki/Hijacking_of_the_Executor",
  "/wiki/Auction_of_Rur",
  "/wiki/Skirmish_aboard_the_Sorca_Retreat",
  "/wiki/Vulaada_Klam",
  "/wiki/Skirmish_on_Arbiflux",
  "/wiki/Plot_to_assassinate_Emperor_Palpatine",
  "/wiki/Pitina_Mar-Mas_Voor",
  "/wiki/Lona_Aphra",
  "/wiki/Battle_of_Hoth",
  "/wiki/Domina_Tagge",
  "/wiki/Tagge_Corporation",
  "/wiki/4_ABY",
  "/wiki/9_ABY",
  "/wiki/Standard_day",
  "/wiki/Nal_Hutta",
  "/wiki/Mos_Espa",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Bacta_tank",
  "/wiki/Gaderffii_stick",
  "/wiki/Mods",
  "/wiki/Bacta",
  "/wiki/Master_Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Knife",
  "/wiki/Mayor",
  "/wiki/Mok_Shaiz",
  "/wiki/Boba_Fett%27s_rancor",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/Scorpenek_droid",
  "/wiki/Worker%27s_District",
  "/wiki/Drash",
  "/wiki/Skad",
  "/wiki/Weequay",
  "/wiki/Taanti",
  "/wiki/Cad_Bane",
  "/wiki/Meiloorun_fruit",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Rey_Skywalker",
  "/wiki/Kief_Varris",
  "/wiki/Moebin_Faltus",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Gold",
  "/wiki/Kieron_Gillen",
  "/wiki/Salvador_Larroca",
  "/wiki/Jordan_D._White",
  "/wiki/Heather_Antos",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_Darth_Vader_(2015)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/February_11",
  "/wiki/2015",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/January_5",
  "/wiki/2022",
  "/wiki/Star_Wars",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Carey_Jones",
  "/wiki/Category:Images_of_Krrsantan",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_(2015)_15",
  "/wiki/Star_Wars_(2015)_20",
  "/wiki/Han_Solo_%26_Chewbacca_3",
  "/wiki/Han_Solo_%26_Chewbacca_4",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/The_Long_Game_(Age_of_Rebellion)",
  "/wiki/Age_of_Rebellion_Special_1",
  "/wiki/Coda",
  "/wiki/Darth_Vader_(2015)_25",
  "/wiki/Star_Wars_(2015)_4",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Doctor_Aphra_(script)",
  "/wiki/Darth_Vader_(2015)_4",
  "/wiki/Darth_Vader_(2015)_5",
  "/wiki/Darth_Vader_(2015)_7",
  "/wiki/Darth_Vader_(2015)_8",
  "/wiki/Darth_Vader_(2015)_9",
  "/wiki/Darth_Vader_(2015)_13",
  "/wiki/Darth_Vader_(2015)_14",
  "/wiki/Star_Wars_(2015)_14",
  "/wiki/Darth_Vader_(2015)_15",
  "/wiki/Darth_Vader_(2015)_16",
  "/wiki/Darth_Vader_(2015)_20",
  "/wiki/Darth_Vader_(2015)_21",
  "/wiki/Darth_Vader_(2015)_22",
  "/wiki/Darth_Vader_(2015)_23",
  "/wiki/Doctor_Aphra_(2016)_1",
  "/wiki/Doctor_Aphra_(2016)_2",
  "/wiki/Doctor_Aphra_(2016)_3",
  "/wiki/Doctor_Aphra_(2016)_4",
  "/wiki/Doctor_Aphra_(2016)_5",
  "/wiki/Doctor_Aphra_(2016)_6",
  "/wiki/The_Screaming_Citadel_1",
  "/wiki/Star_Wars_(2015)_31",
  "/wiki/Doctor_Aphra_(2016)_7",
  "/wiki/Star_Wars_(2015)_32",
  "/wiki/Doctor_Aphra_(2016)_8",
  "/wiki/Doctor_Aphra_Annual_1",
  "/wiki/Doctor_Aphra_(2016)_9",
  "/wiki/Doctor_Aphra_(2016)_10",
  "/wiki/Doctor_Aphra_(2016)_11",
  "/wiki/Doctor_Aphra_(2016)_12",
  "/wiki/Doctor_Aphra_(2016)_13",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_34",
  "/wiki/Doctor_Aphra_(2016)_35",
  "/wiki/Doctor_Aphra_(2016)_36",
  "/wiki/Doctor_Aphra_Annual_3",
  "/wiki/Fake_It_Till_You_Make_It",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/Doctor_Aphra_(2020)_1",
  "/wiki/Doctor_Aphra_(2020)_2",
  "/wiki/Doctor_Aphra_(2020)_3",
  "/wiki/Doctor_Aphra_(2020)_4",
  "/wiki/Doctor_Aphra_(2020)_5",
  "/wiki/Doctor_Aphra_(2020)_6",
  "/wiki/Doctor_Aphra_(2020)_7",
  "/wiki/Doctor_Aphra_(2020)_8",
  "/wiki/Bounty_Hunters_1",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Repair_Stop,_Part_II",
  "/wiki/Star_Wars_Adventures_(2020)_14",
  "/wiki/Fortnite",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Aggressive_Negotiations",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Where%27s_the_Wookiee%3F_2",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_12",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Star_Wars:_Where%27s_the_Wookiee%3F_Deluxe",
  "/wiki/Star_Wars:_Outer_Rim",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Starships_and_Speeders",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_(2015)_7",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/19_BBY",
  "/wiki/9_BBY",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Aftermath_(novel)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian"
 ]
}