{
 "name": "Kryndal",
 "display_name": "Kryndal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Special Forces",
      "Rebel Alliance Special Forces"
     ]
    }
   ]
  }
 ],
 "content": "Kryndal was a human male who served in the Rebel Alliance's special forces, receiving four months of training for the role. In 3 ABY, he was stationed at the Alliance High Command's secret base on the planet Hoth. During his time there he worked with First Sergeant Hazram Namir of the Alliance's 61st Mobile Infantry. Kryndal praised his special forces training to the other soldier and recommended it to him.\nWhen the pair were later eating at the mess hall with some others, Namir challenged Kryndal's view on the outcome of the war, believing that infighting would happen. After the first sergeant insulted the belief Kryndal's friend had for the Alliance leaders, Kryndal swung at Namir, resulting in a short-lived fight where Namir was wrestled to the ground by the other personnel. Echo Base was attacked by the Empire soon after, and Namir thought he saw Kryndal dead among a pile of bodies during the battle.\nBy the time of the Galactic Civil War between the Rebel Alliance and Galactic Empire, Kryndal served as a soldier in the Alliance. At some point, he received four months of training for the Alliance Special Forces. In these months he learned how to use antique slugthrowers, disable proximity mines and rappel off a ray shield. Although he found the training miserable, looked back on it as the most important four months of his life.\nIn 3 ABY, Kryndal became stationed at Echo Base, the Alliance High Command's secret base on the ice planet Hoth. The High Command held a grand strategy conference there, inviting a number of guests including the Imperial defector Everi Chalis. While operating at Echo Base, Kryndal met First Sergeant Hazram Namir of the Alliance's 61st Mobile Infantry, who was visiting as escort for Chalis and his captain, Micha Evon, and was put to work while the conference took place. Namir helped Kryndal warm power converters with welding torchs. Kryndal told him that a third of the Echo Base personnel were former Imperial cadets as well as a third having received special forces training. After recounting his own training for the Alliance Special Forces, he recommended it to Namir, who stated that he had no interest in retraining.\nA little while later, Kryndal and Namir were sat at a table with several other Echo Base personnel eating protein cubes. Kryndal debated scenarios with two others, a woman and a snout-nosed alien, where the Alliance could take the Core Worlds, drawing them as circles on the table with his fingers. Listening to Kryndal's optimism about the war, Namir decided to intervene. He asked Kryndal what would happen when they took the city world Coruscant. Kryndal was confused at what he was trying to say and Namir began developing his own scenario for their fictional situation. In this scenario, Coruscant's population did not comply with the Alliance's occupation and the rebels were forced to use brutality to keep them in line. Although Kryndal and one of his companions tried to contradict it, Namir did not stop to listen to them.\nKryndal tried to explain the Alliance's transition plan but Namir dismissed it, believing that it was going to fall apart as soon as any real victory became visible. The first sergeant claimed that the war was just an attempted power grab from the unlucky senators who missed their chance after the Clone Wars. Kryndal's female companion denied this was true but Namir only pressed on his side of the argument and compared their passion for the Alliance to the blind passion of the Sith Lord Darth Vader's stormtroopers. Kryndal struck Namir in the chest and the sergeant caught his hand and threw him across the table. Namir then elbowed a soldier who came to help Kryndal and dug his knee into Kryndal's stomach. Before Kryndal could receive more grievous harm, the surrounding soldiers wrestled Namir to the ground and Kryndal's female companion punched the sergeant in the jaw.\nAs a result of the fight, Namir was put on load-lifting duty where he mentioned the event to a rebel freighter captain. A few days after the fight, the Empire discovered and attacked Echo Base. During the battle, Imperial forces entered the base and killed numerous soldiers, including Kryndal's alien companion from the mess hall. When scouting a safe route to the hangar Namir stumbled upon some of the bodies, including the alien's, and thought one of them resembled Kryndal, although he did not have time to check if it was him.\nKryndal looked back on his Alliance Special Forces training as the most important four months of his life and even recommended it to Hazram Namir, although the first sergeant declined. He was optimistic that the Rebel Alliance would be able to eventually take Coruscant, being convinced that the Empire was not fighting so hard for no reason and giving a smug expression when saying so. Despite Namir challenging his views on the Galactic Civil War, he was insistent to prove the first sergeant wrong, having a twisted expression on his face as he tried to argue that the Alliance had plans for when it won the war. After Namir claimed the Alliance was only a power grab, Kryndal silently scowled and flexed his hands. When the first sergeant then compared his passion to the blind loyalty of a stormtrooper, he attacked the other soldier as a result. Kryndal was a human male.\nKryndal received four months training for the Rebel Alliance Special Forces, learning how to use an antique slugthrower, rappel off a ray shield and disable a proximity mine.\nKryndal appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Standard_month",
  "/wiki/3_ABY",
  "/wiki/Alliance_High_Command",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/First_Sergeant",
  "/wiki/Hazram_Namir",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Soldier",
  "/wiki/Unidentified_female_rebel",
  "/wiki/Battle_of_Hoth",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Rebel_trooper",
  "/wiki/Slugthrower",
  "/wiki/Proximity_mine",
  "/wiki/Ray_shield",
  "/wiki/Water",
  "/wiki/Everi_Chalis",
  "/wiki/Captain",
  "/wiki/Micha_Evon",
  "/wiki/Power_converter",
  "/wiki/Welding_torch",
  "/wiki/Protein_cube",
  "/wiki/Unidentified_alien_rebel",
  "/wiki/Core_Worlds",
  "/wiki/City",
  "/wiki/Coruscant",
  "/wiki/Senator",
  "/wiki/Clone_Wars",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Stormtrooper",
  "/wiki/Unidentified_freighter_captain",
  "/wiki/Imperial_Army",
  "/wiki/Death",
  "/wiki/Alien",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}