{
 "name": "Kud'ar Mub'at",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Ghostling Nest"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Assembler"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Kud'ar Mub'at was the only known fully-developed member of the assembler species. He served as a go-between and middleman for many of the less legal activities of the galaxy.\nFrom what is known of his kind, Kud'ar Mub'at was once a subnode who gained its independence by consuming the assembler which created it. For a home, it created a web as large as a spaceship, which drifted in space. The web was made of neurofibers connected to Kud'ar Mub'at, so in essence, any being that visited the web was walking within his brain, and was constantly under surveillance. He also incorporated starship weapons and sublight engines into the web.\nMub'at created his own subnodes, each with a specific job within the web. They were all connected to the web, allowing Mub'at to track and communicate with them. Generally, subnodes had little intelligence, but one named Balancesheet developed an intelligence on par with its creator. Balancesheet kept most of its intelligence hidden, knowing Mub'at would probably eliminate him for fear that the subnode might gain its own independence. Mub'at found that he could negotiate with two parties by allowing Balancesheet to crawl into one of his shed carapaces and act as if it were Mub'at itself. He himself would see to one customer, while Balancesheet would attend to the other. During the negotiations, they could silently communicate with each other through the web.\nAmong the Kud'ar Mub'at's largest customers was the Bounty Hunters' Guild, who used his services to ensure prompt payments of bounties collected by its members. Kud'ar Mub'at was also involved in the plans of many powerful beings, such as Kuat of Kuat and Prince Xizor of Black Sun. Xizor and Mub'at orchestrated the destruction of the Bounty Hunters' Guild and plotted the death of Boba Fett. Kud'ar Mub'at convinced Boba Fett to join the Guild in order to bring about its destruction.\nWhile Mub'at was preoccupied with his plans, the subnode Balancesheet continued to gain intelligence and autonomy from its creator, eventually severing its connection to the web and Mub'at. Balancesheet formed its own alliance with Xizor, and together they overthrew Kud'ar Mub'at. The now powerless Mub'at pleaded with Boba Fett to take him away, but Fett declined. The pieces of his web drifted through space for several years before they were approached by Fett, along with Dengar and Neelah, looking for information about Kuat's plans. Due to the assembler's strange biology, they were able to bring it back to life, but its memory had been damaged, and it couldn't provide the information they needed. Balancesheet returned to its creator and destroyed it utterly by firing laser cannons into the web and incinerating it.\nKud'ar Mub'at was devious and self-centered, caring little for how others felt. He often spoke to other creatures in a patronizing and flattering way, much to their annoyance. He used this sarcastic mode of speech when dealing with those he deemed inferior to him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Ghostling_Nest_of_the_Assembler",
  "/wiki/Assembler",
  "/wiki/Gender/Legends",
  "/wiki/Species/Legends",
  "/wiki/Subnode",
  "/wiki/Balancesheet",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Kuat_(person)",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Dengar/Legends",
  "/wiki/Kateel_of_Kuhlvult",
  "/wiki/Laser_cannon/Legends",
  "/wiki/The_Mandalorian_Armor",
  "/wiki/Slave_Ship",
  "/wiki/Hard_Merchandise",
  "/wiki/Aurra_Sing:_Dawn_of_the_Bounty_Hunters",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_25",
  "/wiki/The_Official_Star_Wars_Fact_File_27",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}