{
 "name": "Kuhru",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "near the Patriim system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "Kuhru was a Human male major in the Imperial Army of the Galactic Empire and a distinguished AT-AT walker commander. In 3 ABY, Kuhru was serving on a backwater world when his forces confronted Rebel Commander Luke Skywalker, who was scouting the planet as a potential location for a Rebel base. Kuhru was tasked by the Dark Lord Darth Vader with capturing the intruder alive, but the young Rebel fled the world, leaving the Major to face Vader's wrath. Aboard the Super Star Destroyer Executor, Kuhru reported the outcome of the skirmish to Vader, who, displeased, convinced the Major to step out an airlock without a space suit. Kuhru's career ended when he was sucked out into the vacuum of space.\nKuhru was a Human male serving as a major in the Galactic Empire. A noted AT-AT commander of the Imperial Army, Kuhru was stationed on a backwater planet that housed both an Imperial base and a communications beacon. In 3 ABY, Rebel Alliance Commander Luke Skywalker, in his search for a suitable world on which to establish a Rebel base, was scouting the planet on which Kuhru served, only to discover—and be discovered by—the Imperial presence there. As an AT-ST walker moved to engage him, the scout walker's crew alerted the main base, which promptly dispatched a force of AT-ATs led by Kuhru to confront the intruder. The Dark Lord Darth Vader, unaware that the Rebel was Skywalker, ordered Kuhru to take the insurgent alive for interrogation.\nThe Major instructed the AT-ST to destroy Skywalker's X-wing starfighter and thereby trap the Rebel on the planet, but Kuhru quickly re-tasked the scout walker with defending the communications beacon when Skywalker moved to destroy it with proton grenades. The attack proved to be a feint, as Skywalker immobilized the AT-ST with his lightsaber before escaping the world in his starfighter. Kuhru's AT-ATs were unable to shoot down the craft as it fled, leaving the Major to report to Vader with news of the failure.\nKuhru traveled to the Super Star Destroyer Executor, Vader's flagship, to deliver his report in person, boarding the warship as it neared the Patriim system. The Major met with the Dark Lord aboard the Super Star Destroyer's bridge, where he attempted to defend his decision to protect the communications beacon to Vader. However, the Dark Lord disagreed with Kuhru's assessment of the situation. Rather than execute the officer on the spot for his failure to capture the Rebel, Vader used the Force to convince Kuhru to walk out of one of the Executor's airlocks without a space suit. The Major complied and was propelled into the vacuum of space, killing himself in the process.\nA distinguished Imperial Army commander, Major Kuhru was charged with leading AT-AT forces into combat on the planet on which he was stationed. When confronted by Luke Skywalker, the Major attempted to capture the Rebel officer per Darth Vader's orders. Kuhru's efforts failed when he deemed the protection of the planet's communications beacon to be of a higher priority, a judgment that provided Skywalker an opportunity to escape. A shaken Kuhru attempted to defend his decision to Vader on the Executor, but the Sith Lord disagreed with the situation and compelled the Major to get \"some fresh air\" by walking out of an airlock.\nMajor Kuhru appeared in Resurrection of Evil, the fifty-first issue in the Marvel Star Wars series of comics, written by David Michelinie and illustrated by Walter Simonson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3_ABY/Legends",
  "/wiki/Patriim_system",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Star_Wars_(1977)_51",
  "/wiki/Major/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Unidentified_overgrown_mudball",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Airlock/Legends",
  "/wiki/Enviro-suit",
  "/wiki/Vacuum/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Communications_beacon",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Proton_grenade/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Alliance_Military/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/David_Michelinie",
  "/wiki/Walter_Simonson",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Magazine_11",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}