{
 "name": "Kullan Velerinden",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Elrood"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "Captain Kullen Velerinden was an Imperial Army officer who commanded the Imperial garrison on Tasariq. Born on Elrood, Velerinden was a petty criminal until he tried to beat up an off-duty Imperial Army major. The major beat the young man and gave him a choice; take his chances in Elrood's legal system, or join the Imperial Army. Velerinden chose the latter.\nVelerinden excelled in the Army, impressing his drill sergeants and being recommended for officer training at the Academy. He rose through the ranks, and demonstrated his skills as an AT-ST commander. However, Velerinden's nature as a criminal did not disappear, and he began making thousands of credits on the side through a variety of illegal activities, including selling supplies to the black market. A love of high-stakes sabacc but little talent for the game ensured he had little to show for his schemes.\nOn the verge of being promoted to major, another officer uncovered Velerinden's illegal ventures and threatened to expose him. Velerinden used his connections to destroy the other officer's career, but at a cost. Rather than a promotion, Velerinden was posted to Tasariq, and given command of the garrison there. His authority was second only to the governor. On Tasariq, Velerinden established himself as a central figure in the underworld and finally began making more money than he lost at the sabacc table.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Elrood/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Tasariq",
  "/wiki/Major/Legends",
  "/wiki/Drill_sergeant",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Black_market/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Tasariq:_The_Crystal_Planet",
  "/wiki/Star_Wars_Adventure_Journal_15"
 ]
}