{
 "name": "Kumac",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire",
      "Desilijic clan"
     ]
    }
   ]
  }
 ],
 "content": "Kumac was a Hutt crime lord who emerged as joint leader of the Desilijic clan in the aftermath of Jabba Desilijic Tiure's death. Kumac worked as one of Jabba's most trusted operatives before his death, and was known for her efficiency and loyalty. She also acted as a liaison between Jabba and various high-ranking Imperial criminals.\nJabba's death during the skirmish at Carkoon threw the Hutts, and the Desilijic clan in particular, into disarray, and prompted the beginning of months of infighting between the Hutts. Kumac acted quickly, working alongside former mercenary Brasck to seize much of Jabba's holdings in the Expansion Region and calling in favors from her Imperial contacts to establish herself as one of the most powerful Hutts of the time.\nKumac eventually teamed up with an old rival, Jelasi, who had also profited greatly from Jabba's demise, to become the new joint leader of the Desilijic clan. However, in 5 ABY, Jabba's father Zorba returned to Hutt Space after his time in prison on Kip, and Kumac and Jelasi were deposed when Zorba produced a will of Jabba's, entitling him to his son's holdings throughout the galaxy.\nKumac was a female Hutt of the Desilijic clan. She was part of her clan's kajidic and criminal ventures, working with influential Hutt crime lord Jabba Desilijic Tiure in particular, during the Galactic Civil War.\nKumac was loyal to Jabba, and worked as one of his chief and most trusted underlings. She proved herself to be among his most efficient agents, and a specialist at performing \"special favors\" to sentients in positions of authority, making arrangements and compensating each party appropriately. Kumac also had contacts within the Galactic Empire, and by 4 ABY, she was one of Jabba's chief liaisons with various influential Imperial crime leaders. Kumac was frequently sent on clandestine missions around the galaxy, so spent little time by Jabba's side, but she was still a Hutt of considerable authority among the clans. One of her main rivals was Jelasi, who many believed was Jabba's \"heir apparent,\" even though he was of a different clan.\nIn 4 ABY, Jabba was killed by Rebel leader Leia Organa in the Battle of the Great Pit of Carkoon. His death was wholly unexpected, and threw Hutt Space, and the Desilijic clan in particular, into chaos. Jabba's influence had managed to keep the various Hutt clans from infighting, but his death and the disarray that followed meant that these feuds were renewed with even more vigor; the Hutts were embroiled in a what was essentially a messy, chaotic civil war.\nKumac was one of the quickest to act. While her fellow Hutts bickered and fought amongst themselves, she allied herself with Brasck, a Brubb mercenary formerly under the employ of Jabba, who had seized some of Jabba's smuggling and slaving operations in the Outer Rim Territories. With Brasck's aid, she had gained control of Jabba's leading syndicate operations in the Expansion Region within weeks of Jabba's death, with her peers still reeling from it. Kumac also called in favors from her Imperial contacts to set her up with sufficient power to fend off any major attack upon her, while Brasck set off his own.\nWith her own power base firmly cemented, Kumac was content to watch on as the other clans fought with each other, waiting for the right time to step in. She hoped that her previous authority and proven competence, couple with her newly acquired operations in the Expansion Region, would put her in a position to become clan mediator.\nAround this time, Kumac became aware of Brahle Logris, a highly efficient assassin with a penchant for poisoning his victims. Logis had been incarcerated on Tamazall, and Kumac hoped that if she helped rescue him, he would work for her. The Hutt traveled to Tamazall and hired a mercenary, Deshic Mall, to rescue Logris. Mall was successful, and Kumac sent another of her underlings to rendezvous with the two. Not wanting to pay Mall, Kumac had him killed instead, and invited Logris aboard the sail barge to discuss him potentially working for her.\nKumac's old rival, Jelasi, had also performed well in the aftermath of Jabba's demise, claiming for himself the Ig'zxyck Flare syndicate and attempting to \"legitimize\" much of Jabba's operations, assassinating those who opposed the new direction he was taking. Kumac and her clan were enraged by this, as they wished to carry on in the same vein as Jabba, using crime and intimidation to gain power. As it happened, though, the two emerged as the new joint leaders of the Desilijic clan—and, by extension, the leaders of Hutt Space, because of Desilijic's dominance—after a brutal round of infighting, because they had both claimed more of Jabba's holdings than anyone else.\nTheir reign was short. Within a year of Jabba's death, his father, Zorba, was released from prison on the planet Kip, to discover that his son had perished while he had been incarcerated. Zorba discovered Jabba's \"true will and testament\", which entitled the elder Desilijic to all of Jabba's holdings. Through the courts, Zorba was able to take control of the clan and wrest Kumac and Jelasi's criminal empires from their helpless hands. Under Zorba's leadership, Desilijic lost much prominence, and was overtaken as the leading Hutt clan by Durga's Besadii clan. Eventually, the Hutt courts declared Jabba's \"will\" a fake, and Zorba was deposed.\nKumac was predominantly known for two things: her efficiency, and her loyalty. She could always be relied upon to carry out a mission quickly and with little fuss. Kumac stayed loyal to Jabba until the day he died, like most of his underlings, who sought to kill him. However, rather than mourn his death, she acted quickly to make the most of the situation for her own gain. Kumac dealt well with other sentients: in her role as Jabba's operative, she often dealt with other individuals, providing services for them, and she acted as a liaison between Jabba and his Imperial contacts. She also struck up an alliance with Brasck after Jabba died, one that was mutually beneficial; and she worked alongside Jelasi so as to increase her power, despite the fact that the two were old competitors and Kumac disagreed with his modus operandi.\nKumac thought little of sentient life: she had one of her employees killed on Tamazall, purely so that she did not have to pay him. After claiming her own criminal empire, she operated with ruthlessness, and used intimidation as her main tool. As a Hutt, Kumac was very corpulent, and lay on a hover-sled after her rise to power. She was always surrounded by a retinue of Gamorrean guards and slaves.\nKumac was created by Rick D. Stuart for Galaxy Guide 11: Criminal Organizations, published in 1994.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Desilijic/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_the_Great_Pit_of_Carkoon",
  "/wiki/Great_Pit_of_Carkoon/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Brasck",
  "/wiki/Expansion_Region/Legends",
  "/wiki/Jelasi",
  "/wiki/5_ABY/Legends",
  "/wiki/Zorba_Desilijic_Tiure",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Kip",
  "/wiki/Jabba_the_Hutt%27s_Will",
  "/wiki/The_galaxy/Legends",
  "/wiki/Kajidic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Brubb",
  "/wiki/Smuggler/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Brahle_Logris",
  "/wiki/Assassin/Legends",
  "/wiki/Tamazall/Legends",
  "/wiki/Deshic_Mall",
  "/wiki/Sail_barge/Legends",
  "/wiki/Ig%27zxyck_Flare",
  "/wiki/Durga_Besadii_Tai",
  "/wiki/Besadii/Legends",
  "/wiki/Nimbus_Rider_2000",
  "/wiki/Gamorrean/Legends",
  "/wiki/Rick_D._Stuart",
  "/wiki/Galaxy_Guide_11:_Criminal_Organizations",
  "/wiki/1994",
  "/wiki/West_End_Games",
  "/wiki/Your_Qualifications_Have_Been_Considered",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Rebellion_Era_Campaign_Guide",
  "/wiki/Lords_of_Nal_Hutta",
  "/wiki/1_BBY/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Hutt!_Hutt!_Hutt!"
 ]
}