{
 "name": "Kutri O'a",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Kutri O'a was a male Bothan Jedi Master living during the Cold War and Galactic War.\nKutri O'a was a Bothan Jedi Master and a master of Holocron craft, who was known for his prophetic abilities. He fought in the First Battle of Bothawui, during the Great Galactic War between Galactic Republic and Sith Empire. He wanted to construct a Holocron for the third Barsen'thor, but was unable to meet his fellow Jedi on Tython. Eventually in 3637 BBY the Force called O'a to Rishi, where he was finally able to meet with the Barsen'thor and spoke of the visions he had received.\nAs the holocron was more than just a simple recording, being a reflection of the Barsen'thor's personality, O'a needed to scan their brain to establish a baseline for the holocron's matrix. However, in order to undertake the procedure, the Barsen'thor first needed to achieve a state of calm and serenity, referred to as the Susheer State. On Tython, achieving such a state could be done by using a meditation chamber, but such technology was unavailable on the relatively primitive world of Rishi. However, like most cultures, the native Rishii people possessed their own rituals for attaining a higher state of consciousness, which could be used for the Jedi's purposes. The Bothan Jedi directed the Barsen'thor and a companion to the jungles of Rishi, in order to gather plants called kishu reeds for the ritual. Guided by O'a via holocomm, the Barsen'thor meditated in the calming waters of a nearby waterfall and then burned the collected kishu reeds at a sacred Rishii location, meditating beside the fire. Doing those rituals helped the Barsen'thor achieve the Susheer State, and they returned to O'a, who had prepared an empty holocron for the procedure. In order for the device's crystal matrix to develop, it had to anchor itself to the Barsen'thor's knowledge and experiences. As such, O'a consulted the Force to receive glimpses of the future, asking the Barsen'thor what would they do in the situations presented. When the ritual was over, the Barsen'thor had successfully created a personal holocron, as requested by their fellow Jedi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Holocron/Legends",
  "/wiki/First_Battle_of_Bothawui",
  "/wiki/Great_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/The_Barsen%27thor",
  "/wiki/Tython/Legends",
  "/wiki/3637_BBY",
  "/wiki/Rishi/Legends",
  "/wiki/File:Third_Barsenthors_holocron.png",
  "/wiki/Susheer_State",
  "/wiki/Rishii/Legends",
  "/wiki/Kishu_reed",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan"
 ]
}