{
 "name": "Kutu",
 "display_name": "Kutu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ho'Din"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish violet"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Kutu was a Ho'Din. She traveled to Kirtania to study the plants there.\nKutu, a female Ho'Din medical researcher, traveled to the planet Kirtania during the Galactic Civil War to study the flora in the jungle close to Kinkosa City. She hoped to meet with the noted Araquian scientist Doctor T'Jaleq Kith'Araquia and combine her knowledge of medicinal plants with him. Upon arrival, she was horrified to see the rain forest being systematically destroyed by the Galactic Empire for use as a new supply station, and that Doctor Kith'Araquia was wanted for crimes of terrorism against the state of Kinkosa and the Empire. Afraid to venture into the jungle alone in search of Kith'Araquia, Kutu began searching for a group of individuals to accompany her. She found one such group, who appeared to be interested in the bounty placed on the doctor's head. She reasoned that if they were bounty hunters, she could lead them into some type of trap. Conversely, if their intentions were good, she would be able to ally with them Claiming to know the location of the doctor, she offered to guide the group—who were secretly Rebel agents looking to cure an outbreak of Direllian Plague at the their base—through the jungle.\nThe Rebels accepted Kutu as their guide, and she helped them trek through the rain forest. Along the way, they met Pierce Mantrell, a Human thief who had stolen the Amber Eye from local crime lord Schnil Hakoon. Eventually, the group found the Araquian camp, where Kith'Araquia agreed to help the Rebels after the tribe had attacked a nearby Imperial work camp. Despite the success of the attack, the Imperial forces started a fire in the forest in an attempt to kill the insurgents. Doctor Kith'Araquia led them to safety, and provided Shiarha Root to the Rebels to cure their outbreak, and asked them to take the Araquian non-combatants off planet. Kith'Araquia decided to stay to continue the insurgency, and Kutu decided to stay as well, reasoning that the Araquia would need medics.\nAn adventurous Ho'Din, Kutu was trained to use a blaster and carried a pistol with her, and was also adept at throwing weapons. She had knowledge of alien species, languages and planetary systems, and could use communications equipment. Kutu was trained in jungle survival and could swim. Her medical profession meant that she was skilled in the application of first aid, and she was well trained in the science of pharmacology. During her stay on Kirtania, she carried a canteen of water, 2 days supply of rations, netting, 2 medpacs, and 200 credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ho%27Din/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Kirtania",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Kinkosa_City",
  "/wiki/Araquia",
  "/wiki/Doctor/Legends",
  "/wiki/T%27Jaleq_Kith%27Araquia",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kinkosa",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Direllian_Plague",
  "/wiki/Tiragga_Alliance_outpost",
  "/wiki/Canon",
  "/wiki/Pierce_Mantrell",
  "/wiki/Human/Legends",
  "/wiki/Scoundrel",
  "/wiki/Amber_Eye",
  "/wiki/Crime_lord/Legends",
  "/wiki/Schnil_Hakoon",
  "/wiki/Imperial_work_camp",
  "/wiki/Shiarha_Root",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Quality_of_Mercy",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}