{
 "name": "Kuvuta_Pindi",
 "display_name": "Kuvuta Pindi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY Foless"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Kuvuta Pindi was a green-skinned Twi'lek woman. In 22 BBY, as part of a slavery operation, she abducted 10 war orphans from Abregado-rae and took them to the planet Fondor. There she posed as the younglings' blind handler, and she fooled the Jedi Nuru Kungurama and the swoop biker Gizz into taking them to the placement center on Foless. On the trip to the planet, Gizz flirted with Pindi. On Foless, Pindi directed the orphans to take a particular-colored airbus. This clued Gizz and the Jedi that she was faking her affliction, and gave chase. Once they caught up, she accosted her partner, the pirate Dool Pundar, to try to deceive the Jedi that she had been abducted. The airbus crashed, and Pindi continued to lie about her blindness. In a moment of distraction, she took the orphan Charky hostage with a hidden knife, although the young Trandoshan bit her and forced her to resort to running away. Gizz and the Jedi pursued her into a swamp, which was marked with a \"danger\" sign. Drawing a blaster, she was about to shoot Gizz for ruining her plans, when a creature rose up behind her and devoured her, although Kungurama tried to warn her. Pundar was subsequently taken into custody and the orphans were placed with new families.\nKuvuta Pindi appears in 2011's The Clone Wars: Strange Allies, a comic tie-in to the Star Wars: The Clone Wars: Secret Missions series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/The_Clone_Wars:_Strange_Allies",
  "/wiki/Slavery/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Abregado-rae/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Fondor/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/Swoop/Legends",
  "/wiki/Gizman",
  "/wiki/Foless/Legends",
  "/wiki/Airbus/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Dool_Pundar",
  "/wiki/Charky",
  "/wiki/Trandoshan/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Death/Legends",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Clone_Wars:_Secret_Missions",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Secret_Missions"
 ]
}