{
 "name": "Kvag_Gthull",
 "display_name": "Kvag Gthull",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 ABY",
      "New Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dark Empire",
      "Dark Side Elite",
      "Dark Side Squadron",
      "Dark Side Elite",
      "Dark Side Squadron"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Palpatine"
     ]
    }
   ]
  }
 ],
 "content": "Kvag Gthull was a male Human Dark Jedi and a member of Emperor Palpatine's Dark Side Elite. Chief interrogator at the Elite's stronghold, Bast Castle on the planet Vjun, he was responsible for gathering information from New Republic Major Ntthan after his capture in 10 ABY, in order to learn the name of the planet where the Solo twins were being hidden.\nFollowing the will of his Emperor, he later participated in an abduction attempt on that planet, named New Alderaan. Led by Executor Xecr Nist, the darksiders infiltrated the planet, and Gthull captured the children. However, the twins were saved by young Jedi Rayf Ysanna, while Gthull was killed by their mother, Leia Organa Solo.\nKvag Gthull was a Human male Dark Side Adept serving the Galactic Emperor Palpatine, during his rebirth in clone bodies. When Palpatine created an elite corps of Dark Jedi, the Dark Side Elite, Gthull was among the original seven Dark Jedi who were inducted into that order. The group, led by Executor Sedriss QL, made Bast Castle on the planet Vjun their base of operations, and Gthull became chief interrogator there.\nIn 10 ABY, Palpatine was killed yet again in battle with Jedi Luke Skywalker, but he did return once more, and he sought to capture the Force-sensitive children of Leia Organa Solo, Skywalker's sister, who were being hidden on a secret sanctuary world of the New Republic. When New Republic Major Ntthan was captured by the Empire in an uncharted region of space, he was brought to Bast Castle and delivered to Gthull, who was given the task of torturing out the information about Organa Solo's whereabouts from the man.\nGthull used interrogation droids on the man, who displayed remarkable resistance. Gthull had to spend twelve hours in interrogation sessions, but he was ultimately able to break Ntthan's defense, and the latter revealed the name of the planet, New Alderaan, as well as its coordinates, just as Palpatine arrived at Bast Castle to oversee the results of Gthull's handiwork. Palpatine also brought with him the new Executor, Xecr Nist, a replacement for the recently fallen Sedriss, to take command of the group. Gthull and the rest of the Dark Jedi were then ordered by Palpatine to go to New Alderaan on a covert mission to abduct Skywalker and the Solo twins, before launching an attack on the settlement using AT-ATs. Gthull piloted an I-7 Howlrunner as part of Dark Side Squadron on a journey to New Alderaan. Arriving on the planet undetected, Nist dispatched Elite members Tedryn-Sha and Krdys Mordi to deal with Skywalker. Gthull and three others went with Nist to kidnap the children.\nHowever, Gthull soon lost contact with Sha and Mordi and felt their life energy vanishing from the Force. He reported that to Nist, just as the darksiders arrived at the building where the children were being kept. Nist dispatched Gthull inside the building to grab the twins, while he and the other darksiders were confronted by Skywalker's Jedi recruits: Kam Solusar, Rayf Ysanna and Empatojayos Brand. However, having lost one Dark Jedi and having been bested in combat by Solusar, Nist told Gthull to signal the AT-ATs to attack at that moment. Emerging from the building while holding the twins, Gthull alerted the heavy armor. However, Rayf Ysanna used the Force to levitate the twins from Gthull into the arms of Winter, their caretaker. Running out from Skywalker's quarters, where she had just defeated Sha and Mordi, Organa Solo shot Gthull with a blaster, killing the Dark Jedi. With Gthull dead, Nist and the two remaining darksiders retreated from New Alderaan under covering fire from the advancing AT-ATs.\nKvag Gthull was a darksider loyal to Galactic Emperor Palpatine and was chosen to be the chief interrogator at Bast Castle. In that capacity, he subjected Major Ntthan to painful torture procedures to please his Master and discover the location of the Solo twins. Gthull considered Sha and Mordi fools for failing their mission on New Alderaan and was dismissive toward the Solo twins, calling them \"Jedi brats.\" Gthull was a towering figure, who wore the traditional garb of the Dark Side Elite: black hooded robes, gauntlets and boots.\nKvag Gthull was a Dark Jedi, empowered with the dark side by Palpatine, his eyes glowing yellow as a result of that. He was able to sense the deaths of Sha and Mordi through the Force. He could pilot an I-7 Howlrunner.\nKvag Gthull first appeared in the Dark Empire II 6 of the comic series, in which he was killed. The first issue of the Dark Empire II comic series includes a scenes of Sedriss returning to Byss alongside four other members of Dark Side Elite. Gthull was a member of the Elite at that point, alongside Krdys Mordi, Zasm Katth, Baddon Fass and Vill Goir. However, the comic does not explicitly identify which of the darksiders were depicted in that scene.\nIn the Dark Empire II audio drama, Gthull's role is almost completely filled by Xecr Nist. Nist serves as Ntthan's interrogator, using scarab droids filled with poison. After Gthull captures the Solo children on New Alderaan, Nist takes them from him and guards them, while the rest of the darksiders fight the Jedi. When all of the Dark Jedi have been slain, Nist tries to escape, but he is shot by Organa Solo. Gthull was originally set to appear in Veitch's proposed short novel Lightsider which would have taken place before Dark Empire II and would have introduced the Dark Side Elite. However, Lightsider was never published.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/New_Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Dark_Side_Elite",
  "/wiki/Dark_Side_Squadron",
  "/wiki/Palpatine/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Bast_Castle",
  "/wiki/Planet/Legends",
  "/wiki/Vjun/Legends",
  "/wiki/Torture/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Major/Legends",
  "/wiki/Ntthan",
  "/wiki/Solo_twins",
  "/wiki/Battle_of_New_Alderaan_(Operation_Shadow_Hand)",
  "/wiki/Executor_(Imperial_rank)",
  "/wiki/Xecr_Nist",
  "/wiki/Darksider",
  "/wiki/Jedi/Legends",
  "/wiki/Rayf_Ysanna",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Dark_Side_Adept",
  "/wiki/Transfer_essence",
  "/wiki/Cloning/Legends",
  "/wiki/Sedriss_QL",
  "/wiki/Battle_of_Pinnacle_Base",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Interrogation_droid",
  "/wiki/Skirmish_on_Ossus",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/I-7_Howlrunner",
  "/wiki/Tedryn-Sha",
  "/wiki/Krdys_Mordi",
  "/wiki/Force_sense/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Kam_Solusar",
  "/wiki/Empatojayos_Brand",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Winter_Celchu",
  "/wiki/Blaster/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Gauntlet",
  "/wiki/Boot/Legends",
  "/wiki/Dark_Empire_II_6",
  "/wiki/Dark_Empire_II_1",
  "/wiki/Zasm_Katth",
  "/wiki/Baddon_Fass",
  "/wiki/Vill_Goir",
  "/wiki/Dark_Empire_II_(audio)",
  "/wiki/Lightsider_(story)",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_4",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Dark_Empire_6",
  "/wiki/Dark_Empire_II_3"
 ]
}