{
 "name": "Kvarn_Mandel",
 "display_name": "Kvarn Mandel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thorgeld I"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fabritech"
     ]
    }
   ]
  }
 ],
 "content": "Kvarn Mandel was the head of Fabritech, Inc., an important manufacturer of sensors and control systems for starships. Mandel was an aristocrat who was a strong supporter of the Empire, as well as being a devoted family man.\nKvarn Mandel customarily dressed in fancy clothes, such as flowing capes, and wore his hair in a long pony tail. With his mustache and goatee, he had the appearance of a stately gentleman. While he possessed the ruthlessness required to run such a powerful corporation, Mandel was generally courteous when dealing with others.\nWhile he regularly traveled to the Fabritech headquarters for his work, Mandel made sure to spend some time each month at home with his family. For Kvarn Mandel, his wife, and his four children, home was the Mandel family mansion in the underground city of Fabrin on Thorgeld I.\nThe biggest tragedy in Mandel's life was the disappearance of his youngest daughter, Samire, at the age of sixteen. Although there was no proof, by the time eleven years had passed, Mandel had convinced himself that his daughter was dead. This was a source of conflict between Mandel and his youngest son, Simmin, who continued to search for his sister, even going so far as to hire the Skine Bounty Hunter College to try to find her.\nMandel opposed this continued search partly because of his belief that Samire had been killed, and partly because he worried that rather than being dead, she may have joined an organization affiliated with the Rebel Alliance. As Kvarn Mandel owed much of the success of Fabritech, as well as his own personal success, to the Empire, this possibility disturbed him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thorgeld_I",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fabritech/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Emlyn_Mandel",
  "/wiki/Mandel_family_mansion",
  "/wiki/City/Legends",
  "/wiki/Fabrin_(city)",
  "/wiki/Samire_Mandel",
  "/wiki/Simmin_Mandel",
  "/wiki/Skine_Bounty_Hunter_College",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim"
 ]
}