{
 "name": "Ky_Narec",
 "display_name": "Ky Narec",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cosmatanic Steppes"
     ]
    },
    {
     "name": "Died",
     "values": [
      "23 BBY",
      "Rattatak"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.92 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Heliost Clan",
      "Heliost Clan",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Mana"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Asajj Ventress"
     ]
    }
   ]
  }
 ],
 "content": "Ky Narec was a male human Jedi Knight who served as Asajj Ventress's Jedi Master before his death. He was killed during a battle with Weequay raiders, causing Ventress great distress and starting her on her path to the dark side.\nA human male, Ky Narec became a member of the Jedi Order some time before the galactic conflict known as the Clone Wars broke out. Soon after arriving at the Jedi Temple he was assigned to the Heliost Clan, and trained under Jedi Master Tera Sinube in lightsaber combat. He took the initiate trials around the same time as Qui-Gon Jinn, whom he was roughly the same age as, and was selected as a Padawan learner to Master Mana. Narec had originally hoped to be selected as the apprentice to Dooku. During his time in the Temple, Narec liked to feed the song sparrows and watch them soaring around the Great Tree at the training ground.\nAfter becoming a Jedi Knight, Narec became stranded on the planet Rattatak, in 44 BBY, and, during one encounter with Weequay raiders, witnessed a young Force-sensitive Dathomirian girl named Asajj Ventress use the Force to throw one of the raiders. Narec took the five-year-old Ventress under his wing, training the girl in the ways of the Jedi and raising her.\nThe two Jedi, now Master and apprentice, remained on Rattatak for the next twenty-one years, aiding its people and being regarded as heroes by most. However, when the Vollick warlord Osika Kirske decided to capture Narec's Padawan to make her a gladiator in his arena, he ordered Narec's death.\nIn 23 BBY, During another attack by Weequay raiders, Narec was defeated and killed by a single raider, shot in the back with a sniper rifle and subsequently died in Ventress's arms. Enraged by her Master's death, Ventress took Narec's lightsaber and struck down the sniper in a fit of rage, becoming the first step in her path to the dark side of the Force.\nFollowing his death, Ventress cremated his body and held a funeral.\nVentress' new master, Dooku, who had left the Jedi and become a Sith Lord, manipulated Ventress into believing that the Jedi Order was responsible for leaving Narec stranded on Rattatak, thereby deepening her hatred for the Jedi.\nVentress later learned, while in her early apprenticeship to Dooku before the Clone Wars, that Narec had been the one who killed Hal'Sted, Ventress' slave owner, just before beginning her Jedi training. Narec's voice remained with Ventress after his death, in an attempt to divert her from walking further down the path of the dark side of the Force. However, Ventress silenced his voice when she realized that Narec killed Hal'Sted, and not the Weequay pirates. Her master, Dooku, went on to tell Ventress that at her age at that point she was not perceptive enough to be able to differentiate differences in blaster bolts and lightsaber wounds caused by deflecting blaster shots.\nKy Narec's first appearance in canon was in a flashback in the twelfth episode of the third season of the Star Wars: The Clone Wars television series, \"Nightsisters.\" He was later mentioned with slightly more information given about him in the novel Dark Disciple, which was adapted from eight unaired episodes of Star Wars: The Clone Wars. Narec's first appearance in any piece of Star Wars media was in the Star Wars Legends comic Republic 60, in which he appeared in a flashback.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ky_Narec",
  "/wiki/Ky_Narec/Legends",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Cosmatanic_Steppes",
  "/wiki/23_BBY",
  "/wiki/Rattatak",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Heliost_Clan",
  "/wiki/Galactic_Republic",
  "/wiki/Mana",
  "/wiki/Asajj_Ventress",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_Master",
  "/wiki/Death",
  "/wiki/Weequay",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Time",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi_training",
  "/wiki/Tera_Sinube",
  "/wiki/Lightsaber_combat",
  "/wiki/Jedi_Initiate",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Dooku",
  "/wiki/Jedi_temple",
  "/wiki/Song_sparrow",
  "/wiki/Great_Tree_(Coruscant)",
  "/wiki/Jedi_Temple_training_ground",
  "/wiki/File:NarecBattle.png",
  "/wiki/Planet",
  "/wiki/44_BBY",
  "/wiki/Force-sensitive",
  "/wiki/Dathomirian",
  "/wiki/The_Force",
  "/wiki/Force_push",
  "/wiki/Standard_year",
  "/wiki/Jedi",
  "/wiki/Vollick",
  "/wiki/Warlord",
  "/wiki/Osika_Kirske",
  "/wiki/Gladiator",
  "/wiki/Sniper_rifle",
  "/wiki/Lightsaber",
  "/wiki/Sniper",
  "/wiki/Cremation",
  "/wiki/Funeral_of_Ky_Narec",
  "/wiki/Sith_Lord",
  "/wiki/Hal%27Sted",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Nightsisters_(episode)",
  "/wiki/Dark_Disciple",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Legends",
  "/wiki/Republic_60",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/The_Lost_Nightsister",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Star_Wars_Insider",
  "/wiki/Kindred_Spirits",
  "/wiki/Star_Wars_Insider_159",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Databank_A-Z",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY"
 ]
}