{
 "name": "Kylantha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Kylantha was a Human female from Naboo and the successor to Queen Apailana, formally styled Her Royal Highness, Queen Kylantha of Naboo. She was installed as a puppet ruler in 18 BBY after her predecessor was killed on the orders of the Galactic Empire for allegedly harboring Jedi survivors of Order 66. Unlike previous monarchs, Kylantha had exceeded her two terms of office by the time of the Battle of Yavin.\nKylantha succeeded Apailana to the throne of Naboo in 18 BBY, after the latter was executed by the Galactic Empire for treason.\nAlthough Queen Kylantha was outwardly loyal to the Empire, she refused to dissolve the Naboo Royal Advisory Council and, unlike other Imperial-held worlds, had only implemented a few changes to Naboo's democratic government. This led many Imperials, including Chief Inquisitor Loam Redge, to believe she was actually a Rebel Alliance sympathizer. Kylantha's personal view towards the Empire remained ambiguous.\nDuring her reign, Kylantha appointed Pooja Naberrie, the younger niece of the beloved Naboo politician Padmé Amidala, as Naboo's representative in the Imperial Senate, a position Naberrie held until Emperor Palpatine dissolved that governmental body in 0 BBY.\nDuring the Galactic Civil War, Emperor Palpatine came to believe that Queen Kylantha was secretly hiding a Rebel general named Jacen Nire. Knowing that trying to force the Queen to give up Nire and/or arresting her for treason would result in Naboo openly turning against the Empire in spite of it being his homeworld, Palpatine resorted to alternate means to get rid of the Rebel general: Instead of having her arrested for treason, Palpatine assigned an unidentified Imperial spacer to help him manipulate the Queen without any blame falling on the Empire.\nFirst, the spacer had to create, with the help of a mercenary leader named Vurrha Jantsk, a datadisk that implicated the Rebel Alliance in an alleged plot against the Queen. Afterwards, they had to discreetly assist Jantsk's mercenaries in the attack on Kylantha's chambers by ridding the Queen of her security guards. They subsequently had to go talk to the Queen, who was not yet convinced of the Rebel Alliance's guilt. As \"proof\" of this, the spacer gave Kylantha the falsified datadisk, which eventually led her to give up General Nire's location, who was hiding outside the city of Dee'ja Peak.\nThe Imperial spacer then proceeded to assassinate the Rebel general. Kylantha claimed to be shocked that the Rebels \"made\" a personal attack on her, the Queen of Naboo, and requested the Imperial to tell the Emperor that he had her full support.\nAt some point during her reign, Kylantha sent the Wookiees Orrekazzapirr, Drrlirm, and Imarrra to their homeworld of Kashyyyk to investigate whether the Imperial force stationed on the planet was assisting the Trandoshan slavers. When she didn't receive any news from the Wookiees, Kylantha grew worried. However, a spacer arrived in Theed that Kylantha had heard many stories about from some of her staff. The adventurer agreed to fly to Kashyyyk and investigate the whereabouts of the Wookiees. The Queen had chosen the right being: not only did the adventurer find Drrlirm in the Kashyyykian jungles and escort him to Kachirho, but tracked the other two Wookiees to the Imperial prison on Dathomir where they had been brought and helped them escape from the planet and through the Imperial blockade. As a token of her appreciation for his help, Kylantha presented the adventurer with an old, rehauled ARC-170 starfighter.\nShortly after, the Queen invited the Ewok Chief Chirpa and his tribe to come to Naboo during their Festival of Love.\nMikdanyell Guh'rantt, the mayor of Mos Eisley on Tatooine, once contacted Kylantha and several regional governors across the galaxy about the increasing commotion that plagued his city. It turned out that this problem did not concern only Mos Eisley. Kylantha, Guh'rantt, and the others eventually agreed to work together to put an end to that nuisance.\nAt one point it was also said that a young and wealthy suitor, in an attempt to win her heart in marriage, purchased a quadrant of the Naboo system. However, Kylantha politely refused his offer, saying that she had \"married\" her people and wished to serve them with all of her time. Heartbroken, the suitor renamed the quadrant \"Kylantha's Whim.\"\nKylantha was eventually replaced by Queen Mairayni.\nKylantha was a non-player character in the MMORPG Star Wars Galaxies prior to its closure on December 15, 2011. Rebel players could take a quest from her where they had to rescue Wookiee slaves. They received an ARC-170 starfighter as a reward.\nThe Queen's loyalties seem to be rather ambiguous. Outwardly, she was supportive of the Empire, but inwardly she appeared to be sympathetic to the Rebellion. Indeed, Emperor Palpatine saw to it that the Queen remained loyal to the Empire by making it appear as if the Rebellion were performing unethical acts.\nLike her predecessors Amidala and Jamillia, Queen Kylantha was served by handmaidens. According to the now-defunct StarWars.com Databank, Teckla Minnau, a loyal servant of the deceased Amidala, survived the Clone Wars and returned to Naboo, where she eventually served as a handmaiden to Kylantha. However, her fate was changed in 2014 by \"An Old Friend,\" an episode of Star Wars: The Clone Wars, which established that Minnau died around 20 BBY.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Royal_House_of_Naboo/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Queen/Legends",
  "/wiki/Apailana/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/Time/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Throne/Legends",
  "/wiki/Battle_of_Naboo_(Imperial_Period)",
  "/wiki/Treason/Legends",
  "/wiki/Naboo_Royal_Advisory_Council/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Democracy/Legends",
  "/wiki/Chief_Inquisitor",
  "/wiki/Loam_Redge",
  "/wiki/Pooja_Naberrie/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Dissolution_of_the_Imperial_Senate/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/General/Legends",
  "/wiki/Jacen_Nire",
  "/wiki/Spacer/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Vurrha_Jantsk",
  "/wiki/Datacard/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/City/Legends",
  "/wiki/Dee%27ja_Peak/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Orrekazzapirr",
  "/wiki/Drrlirm",
  "/wiki/Imarrra",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Kachirho/Legends",
  "/wiki/Dathomir_Imperial_Prison",
  "/wiki/Dathomir/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Aggressive_ReConnaissance-170_starfighter/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Chirpa/Legends",
  "/wiki/Festival_of_Love",
  "/wiki/Mikdanyell_Guh%27rantt",
  "/wiki/Mayor/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Governor/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Naboo_system/Legends",
  "/wiki/Kylantha%27s_Whim",
  "/wiki/Mairayni",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Jamillia/Legends",
  "/wiki/Handmaiden/Legends",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Teckla_Minnau/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/2014",
  "/wiki/An_Old_Friend",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/20_BBY/Legends",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Star_Wars_Galaxies:_The_Ruins_of_Dantooine",
  "/wiki/Star_Wars_Insider",
  "/wiki/Gamescape",
  "/wiki/Star_Wars_Insider_69",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed:_Prima_Official_Game_Guide",
  "/wiki/Sony",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_82",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Character_Encyclopedia",
  "/wiki/Star_Wars:_Battlefront_II",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/Template:SWGTCG"
 ]
}