{
 "name": "Kyoopid",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Kyoopid was an Ewok who represented his species during the Ewok Festival of Love.\nHe made pilgrimages to Kaadara, Tyrena and the Southern Ewok Lake Village. It was at those three locations that spacers attempted to honor him by giving him love cards or Chak hearts.\nKyoopid was just like any other Ewok, except that he dyed his fur and wore wings with magical properties. These wings kept him afloat, in a similar fashion to that of Toydarians. He marked his chest and back leg with painted hearts -- a universal symbol of love throughout the galaxy.\nKyoopid is a Non-Player Character  that makes appearance during the Ewok Festival of Love Celebrations in Star Wars Galaxies. He was introduced during the Festival of Love of 2009, and has since made appearances during each subsequent, yearly event. Players attempt to locate him and give him a bundled pack of love cards or Chak Hearts. In exchange, Kyoopid gives the player a badge.\nThe name Kyoopid appeared to be a reference to Cupid of Valentine's Day. This was further reinforced by the fact that one of the Festival of Love quests was titled, Playing Cupid.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Endor/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Species/Legends",
  "/wiki/Festival_of_Love",
  "/wiki/Kaadara",
  "/wiki/Tyrena/Legends",
  "/wiki/Southern_Ewok_Lake_Village",
  "/wiki/Spacer/Legends",
  "/wiki/Chak_heart",
  "/wiki/Magic",
  "/wiki/Toydarian/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/2009"
 ]
}