{
 "name": "Kyril_Lopaki",
 "display_name": "Kyril Lopaki",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Alashan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ensign Kyril Lopaki was a Human male and soldier in the Galactic Empire.\nFresh from the Imperial Academy, Lopaki was stationed on board an Star Destroyer that was assigned to track down the stolen starship known as the Staraker. However, just as the ship had tracked the Staraker to the Alashan system, a superlaser from the planet Alashan fired and struck the ship, critically damaging it.\nLopaki and five other Imperials including Major Wil'm Grau, Fleet Sergeant Anarine, and stormtroopers Voss, Éger Djambo, and Boaz were able to escape the ship in an escape pod. After landing on the planet, Major Grau succeeded in leading the group in capturing the crew members of the Staraker including Luke Skywalker, Mici Shabandar, and Leia Organa. Lopaki wished to capture Leia Organa and return her to the Emperor, but Grau had other ideas. Knowing that they were stranded on the planet, he agreed to a truce, to the chagrin of Lopaki.\nAs the team scoured the planet, Lopaki proved his cowardice, when he refused to save trooper Boaz from a landslide for fear of risking his own life. Eventually, the team came upon a great tunnel which led into an ancient underground city called Forever. Inside, the team began to be stalked by the Guardian of Forever who tried to destroy the intruders. However, Lopaki was more concerned about capturing the Rebels, and he tracked them to the Forever control center. Holding Luke Skywalker and Leia Organa at blaster point, Lopaki prepared to bring the two back to the Emperor. Unfortunately for the Ensign, the Guardian showed up at that point, determined to protect the complex. Lopaki fired at the beast with his blaster pistol, but the Guardian shrugged off the attack and struck the Ensign with a powerful blow, killing him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Alashan",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Staraker",
  "/wiki/Alashan_system",
  "/wiki/Superlaser/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Major/Legends",
  "/wiki/Wil%27m_Grau",
  "/wiki/Fleet_Sergeant",
  "/wiki/Anarine",
  "/wiki/Voss_(stormtrooper)",
  "/wiki/%C3%89ger_Djambo",
  "/wiki/Boaz",
  "/wiki/Escape_pod/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Mici_Shabandar",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Forever",
  "/wiki/Guardian_of_Forever",
  "/wiki/Forever_control_center",
  "/wiki/Palpatine/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/The_Word_for_World_is_Death!",
  "/wiki/The_Guardian_of_Forever!",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}