{
 "name": "Kyrsta Agate",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Jakku"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic right eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Kyrsta Agate was a female human who served as a commander in the New Republic Starfleet. She was a part of several meetings of New Republic officials who discussed the evolving mission on the planet Akiva. She was chosen by Fleet Admiral Ackbar to lead New Republic forces during the Rebellion on Akiva. By 5 ABY, Agate had been promoted to Commodore and commanded the New Republic forces at the Battle for Kuat Drive Yards. Later, she narrowly survived an assassination attempt during the attack on Chandrila.\nAgate was disfigured and lost an eye. Despite experiencing a spell of depression, Agate returned to her duty as a New Republic Commodore. She commanded the Starhawk-class battleship Concord during the Battle of Jakku. Agate played an important role in bringing down the Imperial Super Star Destroyer Ravager. Though Agate perished during the assault on the Ravager, her actions turned the tide of the battle in the New Republic's favor.\nKyrsta Agate was a commander in the New Republic Defense Fleet following the Battle of Endor. As a senior officer, she was privy to Admiral Gial Ackbar's secret contacts with the Imperial informant known as the Operator. Commander Agate trusted Ensign Deltura well enough to share this information with the young cadet. Later, she attended a hologram meeting with Admiral Ackbar, Captain Saff Melor, General Crix Madine, and the newly-appointed Chancellor Mon Mothma to discuss the reliability of the Operator and sending military forces to the planet Akiva.\nDuring the meeting, Agate opined that they could trust the Operator but Admiral Ackbar counseled that the Galactic Empire could be leading them into a trap. When Captain Melor advocated sending the fleet, Chancellor Mothma cautioned against a show of force in the Outer Rim Territories. Admiral Ackbar then managed to get the group to support sending a small scouting party of New Republic Special Forces soldiers to investigate the situation on Akiva.\nLater, Commander Agate along with General Madine, Chancellor Mothma, and Ensign Deltura were present when Admiral Ackbar received Captain Wedge Antilles' transmission from Akiva warning about a high-level Imperial summit on Akiva. She listened as Admiral Ackbar ordered her to lead a small fleet to aid the rebellion on Akiva. During the battle, Agate commanded her forces from the bridge of the Alderaanian frigate Sunspire.\nUpon entering the Akiva system, Agate managed to control her shaking and learned that a yacht was flying to one of the orbiting Imperial Star Destroyers. When the Klatooinian Ensign Targada asked whether they should shoot down the yacht, she ordered him not to shoot it down because it could carry intelligence vital to the New Republic's war effort. Instead, she ordered him to concentrate fire on the Star Destroyer in an effort to deny the ship an escape. This Star Destroyer turned out to be Admiral Rae Sloane's flagship Vigilance.\nAgate's fleet proceeded to decimate two of the orbiting Imperial Star Destroyers. When the Pantoran Ensign Uray informed her they were winning the engagement, Agate responded that winning did not mean won and ordered him to keep up the pressure. Uray then informed her that the New Republic starfighter pilot Norra Wexley had commandeered a TIE fighter and was claiming to be from Gold Squadron. Agate ordered her crew to provide Norra with support and to get her on the comm. With the defeat of Imperial forces, the New Republic gained control of Akiva which then joined the fledgling government.\nBy 5 ABY, Kyrsta Agate had attained the rank of Commodore in the New Republic Starfleet. She was given command of the Starhawk-class battleship Concord, which was one of the New Republic capital ships constructed at the Nadiri Dockyards inside the Bormea sector. As Commodore, Agate led a task force of two ships including the Concord and her old ship Sunspire to rescue Lieutenant Norra Wexley and Captain Antilles, who had come under attack from Imperial forces on the edge of Wild Space. She oversaw the destruction of the Imperial Star Destroyer Scythe.\nOnce Norra and Wedge were safely aboard the Concord, Agate lectured Norra about war and killing. Getting to the point, she reminded Norra that she did not want her soldiers to become unrepentant killers but that she wanted soldiers who hated killing. When Norra suggested that this could cause them the war, Agate responded that they would lose the war by keeping themselves. Agate then informed Norra that she had spoken to Captain Antilles, who had told her about Norra's mission to find the rebel hero Han Solo. Agate then told Norra that they had no orders to find Solo since he had resigned his commission as general.\nLater at the Chandrilan capital of Hanna City, Commodore Agate, Admiral Ackbar, and Captain Antilles met with Norra and her team; which included her son Temmin, his B1-series battle droid Mister Bones, the former Imperial loyalty officer Sinjir Rath Velus, the New Republic soldier Jom Barell, and the Zabrak bounty hunter Jas Emari. When Admiral Ackbar ordered Norra and her team to cease their search for Solo and to resume their hunt for Imperial war criminals, Norra resigned her commission in the New Republic military to search for Solo.\nCommodore Agate and Admiral Ackbar later commanded New Republic forces during the successful campaign to capture Kuat and the strategically important Kuat Drive Yards. Imperial casualties outnumbered New Republic losses during the battle. Following the battle, Princess Leia Organa contacted Admiral Ackbar and Commodore Agate via hologram to congratulate them for their victory. Agate regarded taking weapons out of the Empire's hands as a worthy goal and applauded the Galactic Senate for supporting them.\nShortly later, they were contacted by Chancellor Mon Mothma, who informed them that they had received contact from the Operator. Grand Admiral Rae Sloane, who was now the public face of the Empire, joined the conversation and claimed to be the Operator. Commodore Agate along with Admiral Ackbar and Princess Leia expressed skepticism at Sloane's claim. When Sloane asked who she was, Agate identified herself. The Grand Admiral then recognized her as the one who led the charge at Kuat and applauded her for her victory.\nWhen Agate pointed out that Sloane was part of the Imperial Future Council on Akiva and poured water on her claim to be the Operator, Sloane responded that she had given them targets in order to eliminate her rivals in the Empire. Agate and the others listened as Sloane offered to enter into bilateral peace talks with the New Republic. After some discussion, Chancellor Mothma accepted Sloane's offer on the condition that the Senate approved it. After Mothma exited the conversation, Leia told Agate and Ackbar that she wished that the Force would be with them.\nIn reality, Grand Admiral Sloane had been manipulated by Fleet Admiral Gallius Rax into opening diplomatic channels with the New Republic. Rax was the puppet master controlling the remnants of the Empire and was planning an attack on Chandrila. This attack would take the form of newly-liberated rebel prisoners from Ashmead's Lock who had been fitted with inorganic bio-chip implants which allowed Rax to control them from afar. Rax planned to used these unwilling drones to assassinate the New Republic leadership and to sow chaos in the fledgling Republic.\nA month later, Commodore Agate attended the Liberation Day celebrations held to celebrate the liberation of the Ashmead's Lock prisoners. The festivities were intended to precede the Imperial-Republic peace negotiations. After Rax transmitted an order via transponder, the prisoners involuntarily attacked the New Republic leaders and military officers. Agate was attacked by a Rodian man named Esdo who shot her in the face. Agate's life was saved by Norra but she sustained serious facial injuries that required extensive facial reconstruction.\nFollowing the Attack on Chandrila, Agate underwent extensive facial reconstruction. She was fitted with a mechanical eye while the burned half of her face was covered in nu-skin. Agate initially struggled to come to terms with her facial disfigurement. Feeling despondent, Agate relinquished her command of the Concord. However, Admiral Ackbar invited her back into the New Republic Starfleet shortly before the Battle of Jakku. After the Galactic Senate passed a resolution authorizing the deployment of military forces to Jakku, Agate reported for duty aboard the Concord.\nWhen Agate expressed her reservations, Admiral Ackbar reassured her that she was one of his best commanders. He also praised her for her willingness to recognize the burden of war and her refusal to embrace anger towards the Empire. When Agate told Ackbar that she had relinquished her command of the Concord, Ackbar replied that he had returned it to her and that Lieutenant Commander Spohn was ready to serve her. Agate responded she was not ready but the Admiral reassured her that nobody was ready for war.\nThe two military officers then discussed intelligence that the Empire was preparing for a fleet battle. When Agate asked if the battle was going to be the end of the Empire and the start of a new galaxy, Ackbar replied that it would still be an honor to fight alongside her regardless of the outcome. After struggling with doubt and fear, Agate bid Ackbar farewell before assuming her post.\nWhile at the helm of the Concord, Agate struggled to maintain her composure in the presence of her crew including Ensign Sirai and Lieutenant Commander Spohn. During the space battle, the Imperial fleet formed a tight defensive formation around the Super Star Destroyer Ravager, the Imperial command ship. The Imperial ships would repeatedly open formation during the battle to allow the Ravager to bombard the New Republic fleet. Commodore Agate led the Concord and her sister ships Unity and Amity in trying to breach the Imperial formation.\nAs the battle dragged on, Captain Groff of the Star Destroyer Punishment panicked and rammed his ship into the Amity, destroying both ships. This created a gap which left the Concord exposed to the Ravager's firepower. Admiral Ackbar ordered Agate and her crew to abandon ship. While her crew evacuated the ship, Agate decided to launch a frontal attack on the Ravager with all her ship's firepower and arsenal. When Admiral Ackbar ordered her to abandon her ship, Agate instead convince him to send starfighters and CR90 corvettes to take out the Ravager's rear engines.\nDespite his initial objections, Agate convinced Ackbar to trust her. The Concord was eventually crippled by the Ravager's turbolasers and began descending into Jakku's atmosphere. However, Agate then activated her starship's powerful tractor beams, which trapped the Super Star Destroyer. The Concord dragged the Ravager down onto Jakku's surface. With her engines disabled by New Republic ships, the Ravager was unable to break free. Both ships crashed onto Jakku's surface. Agate perished during the crash-landing but her actions incapacitated the Imperial flagship and turned the tide of the Battle of Jakku in the New Republic's favor. This marked the last major battle of the Galactic Civil War. Her friend Admiral Ackbar prayed for the Force to take her.\nAgate was a capable military officer and soldier, rising to the rank of commander. At the beginning of battle jangled war nerves and adrenaline would cause Agate's hands to violently shake. Though for years she attempted to hide during the first moments of battle or take medication to suppress the impulse, Agate came to realize that showing her shaking affliction and not caring showed more strength than covering it up. She was a competent commander who understood the importance of gathering intelligence.\nAs Commodore, Agate was determined that she and her subordinates adhere to the New Republic command structure. Agate disliked killing and wanted her subordinates not to become unrepentant killers. Her adherence to the command structure led her to reprimand Lieutenant Norra Wexley and Captain Wedge Antilles for embarking on an unauthorized mission to rescue Han Solo. Later, Agate expressed skepticism at Grand Admiral Rae Sloane's claim that she was the Operator and pointed out that Sloane had participated in the Imperial summit on Akiva. Nevertheless, she acceded to Chancellor Mon Mothma's decision to enter into peace talks with the Empire.\nDuring the Attack on Chandrila, half of Agate's face was destroyed by a blaster fired by an unwilling Rodian assassin. She also sustained a broken jaw and lost some teeth. Due to her injuries, the burned half of Agate's face was covered with synthetic nu-skin. She was also fitted with a mechanical eye. Agate initially struggled to come to terms with her disfigurement and her changed voice. Despite giving up her command of the Concord, Agate later returned at the insistence of her mentor Admiral Ackbar, who recognized her inner strength and leadership skills.\nLike Admiral Ackbar, Agate also believed in the Force. During the Battle of Jakku, Agate sacrificed her life to take down the Imperial flagship Ravager. Though Agate struggled with fear and doubt, she managed to find the courage and strength to continue her duties as Commodore even in the face of death. Agate's selfless actions helped turned the tide of the battle in the New Republic's favor.\nKyrsta Agate is a secondary character in Chuck Wendig's Star Wars: The Aftermath Trilogy novels, which were published between 2015 and 2017.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Jakku",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Eye",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Commander",
  "/wiki/Mission_to_Akiva",
  "/wiki/Planet",
  "/wiki/Akiva",
  "/wiki/Fleet_Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Commodore",
  "/wiki/Battle_for_Kuat_Drive_Yards",
  "/wiki/Attack_on_Chandrila",
  "/wiki/Chandrila",
  "/wiki/Starhawk-class_battleship",
  "/wiki/Concord",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galactic_Empire",
  "/wiki/Super_Star_Destroyer",
  "/wiki/Ravager",
  "/wiki/Battle_of_Endor",
  "/wiki/Admiral",
  "/wiki/Gallius_Rax",
  "/wiki/Ensign",
  "/wiki/Ardin_Deltura",
  "/wiki/Cadet",
  "/wiki/Hologram",
  "/wiki/Captain",
  "/wiki/Saff_Melor",
  "/wiki/General",
  "/wiki/Crix_Madine",
  "/wiki/Chancellor_(New_Republic)",
  "/wiki/Mon_Mothma",
  "/wiki/Outer_Rim_Territories",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/Wedge_Antilles",
  "/wiki/Emergency_summit_on_Akiva",
  "/wiki/Alderaanian",
  "/wiki/Frigate",
  "/wiki/Sunspire_(New_Republic)",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Klatooinian",
  "/wiki/Targada",
  "/wiki/Rae_Sloane",
  "/wiki/Vigilance_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Pantoran",
  "/wiki/Uray",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Norra_Wexley",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Nadiri_Dockyards",
  "/wiki/Bormea_sector",
  "/wiki/Lieutenant",
  "/wiki/Wild_Space",
  "/wiki/Scythe_(Star_Destroyer)",
  "/wiki/Han_Solo",
  "/wiki/Hanna_City",
  "/wiki/Temmin_Wexley",
  "/wiki/B1-series_battle_droid",
  "/wiki/Mister_Bones",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Jom_Barell",
  "/wiki/Zabrak",
  "/wiki/Bounty_hunter",
  "/wiki/Jas_Emari",
  "/wiki/Kuat",
  "/wiki/Kuat_Drive_Yards",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Grand_Admiral",
  "/wiki/Imperial_Future_Council",
  "/wiki/Imperial%E2%80%93Republic_peace_talks",
  "/wiki/Ashmead%27s_Lock",
  "/wiki/Liberation_Day_(New_Republic)",
  "/wiki/Rodian",
  "/wiki/Esdo",
  "/wiki/New_Republic_Senate",
  "/wiki/Lieutenant_Commander",
  "/wiki/Spohn",
  "/wiki/Sirai",
  "/wiki/Command_ship",
  "/wiki/Unity_(Starhawk-class)",
  "/wiki/Amity",
  "/wiki/Groff",
  "/wiki/Punishment",
  "/wiki/CR90_corvette",
  "/wiki/Turbolaser",
  "/wiki/Tractor_beam",
  "/wiki/The_Force",
  "/wiki/Officer",
  "/wiki/Standard_year",
  "/wiki/Death",
  "/wiki/Chuck_Wendig",
  "/wiki/Star_Wars:_The_Aftermath_Trilogy",
  "/wiki/2015",
  "/wiki/2017",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blade_Squadron:_Kuat",
  "/wiki/Star_Wars_Insider_168",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Lead_by_Example",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Nadiri_Starhawk_Expansion_Pack",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Endor_and_the_Fall_of_the_Empire",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}