{
 "name": "L'ulo L'ampar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Duro"
     ]
    },
    {
     "name": "Died",
     "values": [
      "By 34 ABY",
      "over a desert planet"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Starlight Squadron",
      "Green Squadron",
      "Starlight Squadron",
      "Green Squadron",
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet",
      "Civilian Defense Force",
      "Resistance",
      "Black Squadron",
      "Black Squadron"
     ]
    }
   ]
  }
 ],
 "content": "L'ulo L'ampar was a skilled Duros A-wing pilot in the Rebel Alliance and Resistance that was from the planet Duro. During the Galactic Civil War, he was a member of Starlight Squadron and Green Squadron alongside fellow pilot and friend Shara Bey. After the Alliance victory at the Battle of Endor in 4 ABY, L'ampar led Green Squadron in many campaigns including the liberation of Cawa City. In the following months, he convinced Bey to muster out of service and spend time with her husband, Kes Dameron, and their young son, Poe. In 5 ABY, the Dameron family settled on the moon Yavin 4, and L'ampar later joined the Yavin system's Civilian Defense Force.\nAlthough L'ampar traveled frequently, he often visited the Dameron homestead and maintained his friendship with the family. Following the death of Bey in 10 ABY, L'ampar became a mentor to Poe. In 18 ABY, when Poe fled from the moon with the criminal Spice Runners of Kijimi, L'ampar and Kes spent nearly a year searching the Outer Rim Territories for him. After consulting with the Osako pirates, they were able to locate the Spice Runners in 19 ABY. When L'ampar and Kes confronted Poe, he refused to return home with them.\nBy 32 ABY, L'ampar joined the Resistance against the First Order and was selected by Poe to become a member of Black Squadron. The elite squadron was tasked by General Leia Organa with finding Lor San Tekka, an explorer rumored to know the whereabouts of missing Jedi Master Luke Skywalker. Black Squadron's search led them to the planets Ovanis and Megalox Beta, where they faced off against Agent Terex of the First Order Security Bureau. By 34 ABY, during a fateful encounter with Terex over a desert planet, L'ampar sacrificed himself to protect innocent lives. The Resistance held a funeral for L'ampar, where Dameron and Organa praised the Duros' life and actions.\nL'ulo L'ampar was a Duros male who hailed from the planet Duro. He became an A-wing interceptor pilot in the Rebel Alliance during the Galactic Civil War, a galaxy-wide conflict between the Alliance and the Galactic Empire, and befriended fellow rebel pilot Shara Bey. Following the Alliance's defeat at the Battle of Hoth in 3 ABY, L'ampar held the rank of captain and was stationed with the Fourth Division as they began Operation Starlight, a plan to reunite the scattered Alliance Fleet.\nHe was selected for Starlight Squadron, a six-member team led by Bey and tasked with contacting the remaining rebel cells and delivering the newly-developed Trawak communication code. After a briefing by General Leia Organa, L'ampar and Starlight Squadron departed for the fleet rendezvous points. Starlight Squadron traveled to deep space near the planet Felucia and found a debris field. L'ampar, flying with the callsign Starlight Three, picked up lingering transponders and concluded that the Alliance Fleet's Sixth Division had been destroyed and that there were no survivors. L'ampar and fellow pilot Wedge Antilles received Imperial signals, and the Duros discovered the presence of Imperial probe droids, forcing the squadron to take evasive action.\nThe probe droids latched on to the astromech droids of Starlight Squadron's X-wing starfighter complement, attempting to extract the other rendezvous points. Antilles suggested shooting the probe droids, but L'ampar questioned the idea. Bey ordered the X-wing pilots to have their astromech droids ejected and detonated. As a result, the probe droids and the X-wings' navigational data were destroyed. L'ampar recommended that the squadron recuperate, but the Imperial-class Star Destroyer Tarkin's Will suddenly arrived and attacked. TIE fighters surrounded Starlight Squadron and jammed their long-range comm systems. With the X-wings unable to chart hyperspace courses, Bey planned for her and L'ampar's A-wings to share their jump data. L'ampar noticed that the TIE fighters' tactics did not follow the Imperial Tactical Manual which L'ampar had studied, and he deduced that Starlight Squadron was being herded.\nThe Tarkin's Will engaged its tractor beam, and it caught L'ampar and his wingmates. Unable to escape the beam, the pilots of Starlight Squadron decided to try a tactic that Antilles had thought of with Rogue Squadron. On Antilles' word, the squadron accelerated toward the Star Destroyer's hangar until its shields were lowered. Starlight Squadron fired concussion missiles and proton torpedoes to disable the tractor beam generator. Before more TIE fighters could launch, L'ampar, Bey, Antilles, and Freyta Smyth flew into the hangar bay and destroyed the grounded starfighters. As L'ampar provided cover, the other three pilots landed and began to slice Imperial astromech droids.\nL'ampar continued to provide cover as several All Terrain Scout Transports arrived in the hangar. Meanwhile, Antilles successfully reprogrammed one of the droids to complete the navigational calculations, so Bey and Smyth ran to their ships. However, one of the AT-ST walkers destroyed Bey's A-wing before she could reach it. L'ampar told Bey that they would fight the walkers and steal a ship for her, but Bey ordered them to leave. L'ampar hesitated, but Bey restated her order and added that L'ampar should relay her love to her husband, Kes Dameron, and son, Poe. L'ampar acknowledged the order, and Starlight Squadron escaped to hyperspace.\nWith Bey left behind, L'ampar assumed the callsign Starlight Two and was granted temporary command of Starlight Squadron until she could be rescued. In hyperspace, L'ampar reported in to the Fourth Division and informed them that the mission was unsuccessful and that the Sixth Division had been destroyed. He described the events of the mission and stated that Bey had sacrificed herself to save Starlight Squadron. L'ampar added that they had captured an Imperial astromech droid and that its memory banks were full of valuable information. L'ampar credited Bey for her idea and ended the transmission.\nL'ampar met with Dameron at the Afterburner, where they shared drinks and talked about losing Bey. The following day, Starlight Squadron prepared to embark on a rescue mission to the Outer Rim world of Ab Dalis. L'ampar and Starlight Squadron departed from the united Fourth and Seventh Divisions of the Alliance Fleet, and they were joined by rebel hero Luke Skywalker, who had decided to help in Bey's absence. As the squadron prepared to enter hyperspace, L'ampar expressed that his hopes were low, and that the Rebellion needed a win.\nWhen Starlight Squadron arrived above Ab Dalis, they received a distress call from the Eleventh Division, which was under siege by the Imperial Star Destroyer Ultima II. L'ampar and Starlight Squadron engaged Imperial TIE fighters, and he advised his wingmates to keep shooting. During the battle, L'ampar received a set of coordinates from the grounded rebel defense. Starlight Squadron analyzed the data and determined that the target was a small, natural formation located directly beneath the Ultima II.\nStarlight Commander Antilles was unable to contact the ground defense for clarification. L'ampar did not understand the directive, but with the Eleventh Division close to defeat, the squadron decided to continue. Starlight Squadron guarded Skywalker as he made an attack run on the target. Skywalker took a shot and missed, but a member of Starlight Squadron followed with a direct hit. The shot triggered a dormant volcano, which erupted and destroyed the Ultima II. The squadron was contacted by the Eleventh Division and was thanked for the timely rescue. To L'ampar's surprise, the speaker was Chancellor Mon Mothma, the leader of the Rebellion. Antilles asked L'ampar if that was \"enough of a win,\" and the Duros agreed that it was.\nNot long after, Dameron recieved a recorded message from Bey as she prepared to escape the Tarkin's Will, having been left behind on the Star Destroyer during a mission with L'ampar. Though Mothma was unwilling to mount a rescue effort for Bey, Dameron gathered a small group of rebel Pathfinders and members of Starlight Squadron to plead for their assistance in helping his wife escape the Imperial ship. After listening to Dameron's impassioned speech in the meeting, L'ampar pledged to help him. Shortly after, L'ampar and the rest of Starlight Squadron escorted Dameron and a troop transport of Pathfinders through hyperspace to the last known location of the Tarkin's Will in hopes of rescuing Bey.\nWhile in transit, Dameron briefed his companions about the mission and explained the squadron's role in distracting the Star Destroyer's TIE fighters during the rescue operation. Once out of hyperspace, he warned L'ampar to minimize risk taking while causing a flashy distraction, which the Duros agreed to. L'ampar and his squadmates engaged fighters in the space surrounding Tarkin's Will, though their efforts to prolong the battle were noticed by the vessel's commander, Ellian Zahra. During the skirmish, the Imperial Security Bureau forwarded intelligence to Zahra during the skirmish concerning the discovery of a rebel base on the planet Panisia. The commander decided to have the Tarkin's Will immeadiately jump to hyperspace and head to Panisia, leaving L'ampar and his squadron confused with the vessel's sudden departure. The TIE fighters continued to engage L'ampar and the rest of Starlight Squadron after the Destroyer's withdrawal.\nThe Tarkin's Will arrived at Panisia to destroy the Alliance's Second Division that was hiding there, only to be engaged by the three divisions led by Organa and Mothma. Although Zahra was able to destroy many rebel ships, her own vessel was crippled when members Dameron's strike team inside detonated the reactor chamber, allowing the Alliance fleet to destroy it. While his squadmates were unable to make it out alive, Dameron was able to rescue Bey and bring her back to the rebel fleet, Starlight Squadron rejoining them at Panisia as well.\nAlthough she had lost all of her forces, Zahra contacted Organa, challenging the general to hunt her on Panisia's surface. Once Organa was down there with a strike team led by Dameron, the Imperial commander set off a signal grenade to grab the rebels' attention. The general thus hailed Starlight Squadron to engage. The squadron responded quickly, Bey advising her comrades to hit Zahra with everything they had. L'ampar assured his fellow pilot that the commander would be nothing but smoke. However, as Starlight Squadron approached the smoke plume, Bey quickly realized that it was the entrance to a cave in which Zahra had entered, forcing Organa's strike team to enter it themselves. The commander attacked the strike team, but was ultimately trapped in a creature's mucus and left for dead by the rebels.\nSometime later, L'ampar participated in a rebel attack on Bar'leth, a Core Worlds planet where the Empire was holding and broadcasting an Imperial Unity Day parade. The rebel fighters laid waste to the parade of Imperial vehicles before escaping with no casualties. Following the attack, a group of rebel pilots and other personnel celebrated at the hangar of an EF76 Nebulon-B escort frigate. As the group toasted to the Alliance, L'ampar remarked that they had shown the Empire what they were made of. The pilots conversed with each other afterward.\nHolding the rank of lieutenant, L'ampar flew with Bey in Green Squadron, the Duros being the second-in-command of Green Leader Arvel Crynyd. In 4 ABY, after the Alliance discovered that Galactic Emperor Sheev Palpatine would be aboard the second Death Star to oversee its construction, Alliance High Command determined to launch an immediate assault on the space station.\nThe Alliance Fleet, with L'ampar in his A-wing as Green Two, exited hyperspace above the Forest Moon of Endor, approaching the superweapon. On the moon's surface, the Rebel Pathfinders were attempting to disable the Death Star's shield by destroying its shield generator, but when the Alliance Fleet arrived, the shield was still up. Previously unknown to the Rebellion, the superweapon was fully operational.\nRealizing that the battle was a trap set by the Empire but unable to escape, the Rebel starfighters engaged the Imperial forces to buy more time for the Pathfinders, Green Squadron being tasked with defending the rebel capital ships. After the rebel fleet advanced on the Star Destroyers, L'ampar's squadron took on a mixed role of engaging enemy fighters as well as making attacks on larger Imperial vessels. Along with Commander Crynyd and a portion of Green Squadron, L'ampar attacked the Executor, an Executor-class Star Dreadnought. The attack brought down the Executor's shields, and Crynyd sacrificed himself in a suicide run that destroyed the capital ship's bridge, critically disabling the vessel.\nIn light of Crynyd's death, the mantle of Green Leader immediately fell to L'ampar. Soon after, the rebels on Endor succeeded in lowering the Death Star's shield, giving Gold Leader Lando Calrissian and Red Leader Wedge Antilles an opportunity to destroy the superweapon. L'ampar led his remaining pilots to the Death Star's surface to mop up Imperials that were launching from the station. After the battle was won with the destruction of the Death Star, the Alliance Fleet began shuttling pilots to the Endor moon to celebrate with the Pathfinders and local Ewok population.\nDespite their victory, General Crix Madine was wary of an Imperial counter-attack, causing some pilots to remain with their starfighters on standby. In a hangar aboard an Alliance starship, L'ampar was approached by Bey, who had flown in the battle as Green Four. Concerned about her Pathfinder husband, Kes Dameron, Bey inquired if she could join the festivities on Endor's moon. L'ampar granted her permission to join the celebration, wishing for as many of his squadron to go and celebrate as possible while he remained on standby in case the Empire made a counterattack. The following morning, Rebel Signal Intelligence discovered transmissions from an Imperial holdout on the far side of the moon. L'ampar arrived in the Ewok Bright Tree Village and attended a briefing by General Han Solo, who discussed plans to remove the Imperial presence. The Rebels launched an assault on the outpost and discovered new Imperial communications confirming that the war was not yet over.\nSeventeen days after the Battle of Endor, L'ampar had been formally promoted to Green Leader. That day, the squadron was sent to help liberate Cawa City, the Imperial-held capital of Sterdic IV, alongside Feral Group. During the battle, Bey, flying as Green Two, assisted L'ampar by destroying a TIE fighter that was pursuing him. Shortly after, when Bey's A-wing became damaged, the Duros returned the favor and shot down her attacker. Once Bey was safe, L'ampar ordered Feral Leader to issue an attack run on an All Terrain Armored Transport. Y-wing bomber pilots Feral Two and Feral Three dropped clusters of explosives, which became magnetically attached to the walker and destroyed it, thus ending the conflict. After the battle, L'ampar spoke with Bey about how hard she had been working, and he encouraged her to spend time with Dameron and their son, Poe.\nDuring the next two months, L'ampar continued to serve the Alliance Fleet and received a promotion to captain. In 5 ABY, three months after the Battle of Endor, Admiral Gial Ackbar and General Madine informed the fleet that the war did not have a foreseeable end. Following this, L'ampar advised Bey to take less dangerous missions so that she could look after her family. After Bey's piloting escort mission with Organa to the planet Naboo turned violent due to the Empire's Operation: Cinder initiative to destroy worlds, L'ampar submitted resignation paperwork for Bey, telling her that she had done more than expected and should enjoy the freedom she fought for. Bey heeded L'ampar's advice, settling with her family into Wetyin's Colony on Yavin 4. Soon after, the Rebellion formally became the New Republic, and a year after the Battle of Endor, the Galactic Civil War ended with the Empire's defeat at the Battle of Jakku. For a short time, L'ampar joined the New Republic Defense Fleet as a captain following its creation under the New Republic.\nIn the following years, L'ampar also settled on Yavin 4 and worked with the Yavin system's Civilian Defense Force, although he still traveled frequently. L'ampar maintained his friendship with the Bey and Kes, also acting as an uncle figure for Poe by inspiring the child to pursue adventures throughout the galaxy as he grew up. Prior to Bey's death in 10 ABY, she told her son about the L'ulo Stand, a complex flight maneuver the Duros had given his name to which few pilots could pull off. After Bey's death, L'ampar helped Dameron raise Poe, and his visits to the Dameron homestead were celebrated by the Damerons. The Duros would share flying advice and stories with Poe, first explaining that in flying, only the pilot mattered, not the ship.\nIn 18 ABY, sixteen-year-old Poe took his mother's A-wing for a joyride and subsequently crashed. Poe was unharmed, but after a fight with his father, he ran from home. The Yavin 4 Defense Force station alerted L'ampar of the crash, and the Duros piloted a landspeeder to the colony's docks, where he found the young Dameron. L'ampar confronted him and asked to talk.\nPoe confided in L'ampar that he wished to leave Yavin 4, wanting to live a life of adventure as his parents had. Sympathetic, L'ampar exited the landspeeder and sat beside the boy. He told Poe about his parents and the Battle of Endor, explaining that they knew the risks of piloting and that their desire to be with him outweighed all else. Poe rejected L'ampar's words, saying that Bey had been a thrill seeker who took risks, and that she was a part of him. L'ampar responded with a nod, and Poe ran off. As L'ampar returned to his landspeeder, he thought about his words and feared that he had endangered the boy.\nStricken with guilt, L'ampar went to the Dameron farm to speak with Kes. The two scoured the settlement, searching near docks and surrounding areas. After a few hours, they looked in Gully's, a local bar. Kes approached the bartender, Fontis, and demanded to know where Poe had gone. Fontis belittled Kes and L'ampar, and when Kes threatened violence, Fontis said that Poe had left. Before L'ampar and Kes could press further, Sela Trune, an officer of the New Republic Security Bureau , entered the bar and approached the human. Trune stated that the criminal Spice Runners of Kijimi was sighted on Yavin 4 in search of a pilot, having killed their previous pilot, Beke Mon'z. L'ampar deduced that Mon'z was an informant for the NRSB, and Trune confirmed as much. Trune then informed the two men that Poe had supposedly been kidnapped and aided the Spice Runners in getting off-world.\nOver the next months, Kes used all of his connections to try and locate Poe, but he had no success. The NRSB also continued the search, but L'ampar and Kes eventually went rogue, chartering a ship to the fringes of the Outer Rim Territories. There, they made a deal with the Osako pirates, who were able to track the Spice Runners. In 19 ABY, more than eight months after Poe's disappearance, L'ampar and Kes accompanied the Osako pirates aboard a Moraysian cruiser, and they collectively chased the Spice Runners through the Llanic Spice Run, cornering them in the Torch Nebula. The Spice Runners were forced to land on the planet Judakann, and L'ampar and Kes followed their descent in a shuttle.\nThe pair exited the shuttle and found Poe with his partner Zorii Wynn and the droid EV-6B6. Kes hugged his son, and L'ampar introduced Kes to Wynn. Wynn questioned their decision to work with the notorious Osako pirates, and she argued with Kes about Poe's decision to leave Yavin 4. Another Spice Runner, Tomasso, arrived and stated that it was Poe's choice to make. L'ampar, having heard of Tomasso's feared reputation, drew a blaster and pointed it at the man. As Kes implored Poe to return home with them, Tomasso alerted everyone to the presence of lurkers—small, dangerous monsters—that had surrounded them.\nOne of the lurkers leaped at EV-6B6, and Kes shot at the predators as they attacked. L'ampar, Kes, and the Spice Runners fended off dozens of the lurkers, but Kes was severely injured by one of them. EV-6B6 and L'ampar tended to Kes' bleeding midsection, and Poe ran to his side. L'ampar reassured Poe that Kes would be fine, but they needed to depart for the Moraysian cruiser for medical help. Again, Kes tried to convince Poe to return with them, but Poe chose to stay, citing his need for independence. The Duros embraced Poe and told him to be true to himself.\nA massive Spice Runner ship arrived overhead, and Poe told L'ampar that he and Kes had to depart immediately. The Duros agreed, and Kes tried to resist but was too weak. Poe promised that he would eventually return to them, and L'ampar dragged Kes toward the shuttle. Before boarding, L'ampar told Poe to keep his word. L'ampar flew the shuttle off-planet as the Spice Runner ship landed.\nAround 28 ABY, Leia Organa organized the Resistance, a military group in opposition to the First Order, and L'ampar immediately after its formation. Poe Dameron also enlisted, to L'ampar's delight, and became recognized as the Resistance's best pilot. Around 32 ABY, Organa tasked Dameron with locating Lor San Tekka, an explorer who knew the whereabouts of Luke Skywalker—Organa's brother and the last Jedi. The First Order was also searching for Skywalker, and Organa authorized Dameron to select a squadron of four pilots and a technician. Choosing friends whom he could trust, Dameron recruited L'ampar, along with technician Oddy Muva and T-70 X-wing pilots Temmin Wexley, Karé Kun, and Jessika Pava, to form Black Squadron. Dameron informed them that they would be departing on a mission, but to L'ampar's disapproval, the purpose of the mission was to remain classified.\nBlack Squadron departed from the secret Resistance base on D'Qar, traveling to Ovanis, an uneven, mountainous world where Tekka was last seen. While Dameron scouted an artificial cavern with his X-wing, L'ampar and the other three pilots remained flying above the surface. Dameron reported his findings to Wexley, explaining that he had found a settlement and a large egg. Black Squadron then lost contact with Dameron, but just as L'ampar readied himself to enter the cavern, the transmission was restored. Dameron reported that he was fine, but that he had found a tracker on his ship and that the First Order was likely to arrive soon. Dameron's fears were already fulfilled, however, as Kun spotted a First Order platform loaded with two Troop Transports, eight TIE fighters, and numerous rocket troopers, above the cavern's entrance.\nAs the First Order stormtroopers entered the cave, Dameron contacted the squadron again, requesting aid. Since Black Squadron was not authorized to initiate a fight with the First Order, Pava suggested prompting the enemy pilots to shoot first. Aware that the First Order TIE fighters were more maneuverable than the X-wings, L'ampar volunteered to aggravate the enemy pilots with his A-wing. Flying low and cheering, the Duros flew past the enemy platform; however, the TIE pilots were unresponsive. L'ampar concluded that they, too, were under orders not to engage, so the Duros attempted another pass, although this time he strafed the platform with laser fire, casually claiming that his \"finger slipped\" on the trigger.\nThe TIE pilots quickly responded to the attack, allowing Black Squadron to engage. The TIE fighters were swiftly eliminated, but before L'ampar could land on the platform to refuel, it exploded, leading L'ampar to believe his volley had been too intense. The burning transport crashed over the cavern's entrance and sealed Dameron inside with the First Order troops, but Wexley was confident that Dameron would be fine. However, despite Black Squadron seemingly having the upper hand, dozens of TIE fighters arrived from orbit, continuing the fight.\nPava noted that Black Squadron was outnumbered five to one, and she suggested that they remove themselves from the fight. L'ampar agreed, also adding that Dameron might be able to assist if given more time. Black Squadron then split up, flying into the canyons and engaging the TIE fighters. However, when Pava's fighter received damage, the squadron regrouped in the open air. As the starfighters of Black Squadron began running dangerously low on fuel, Dameron contacted them again, warning them that something was heading their way. As Dameron spoke, two gigantic, winged entities—born from the egg Dameron had discovered—broke through the ground, locked in a fight. As the creatures fought, Wexley commanded Black Squadron to enter the newly formed hole and land at the outpost inside.\nGrounded inside the cavern and reunited with Dameron, the members of Black Squadron and the Crèche—the cavern's religious residents—rounded up the First Order troops and their leader, Agent Terex of the First Order Security Bureau. The agent remarked that taking him prisoner would provide the First Order justification to attack the New Republic, so Dameron consulted with L'ampar, Wexley, and the Crèche's religious elder on what to do. L'ampar suggested refueling, destroying Terex's cruiser, and leaving him with the Crèche, although Dameron turned down the idea, saying the First Order would send reinforcements to search for Terex. Stumped, Wexley scoffed that they should let the agent go, but the Crèche elder agreed, saying Terex could no longer hurt them, to which Dameron concurred. Once refueled and in the planet's orbit, Dameron told his team that the Crèche provided him with a lead on Tekka's whereabouts: prison.\nL'ampar and the rest of Black Squadron returned to the Resistance base on D'Qar, where they drank and celebrated their victory. The Duros enjoyed his drink, telling Dameron how much he had needed it and that fighting off the First Order was a proper cause for celebration. Dameron, who had reviewed the after-action reports and learned of L'ampar escalating the fight, told the Duros that he had broken the rules of engagement and gave the First Order a reason to attack. However, L'ampar held to his actions, telling Dameron that war was inevitable and that every fighter they destroyed was one less that would attack them when the fight truly began. Dameron argued L'ampar's statement, saying that while Black Squadron was stronger than enemy forces, the Resistance was not, and giving the First Order justification for an attack would set the Resistance against one-to-one-thousand odds. Dameron added that L'ampar was right—war was inevitable—but they were not yet ready, and they had to gather the needed resources before time ran out.\nAs the festivities settled, Black Squadron was addressed by Dameron, who told them of their next mission: visit a prison on Megalox Beta to speak with the Hutt Grakkus. A prisoner on Megalox Beta, Grakkus collected relics relating to the Force, and he was the individual whom Tekka had visited after staying with the Crèche. L'ampar and Black Squadron embarked on their trip and contacted Luta, the prison's warden, making arrangements to see the Hutt. Once in orbit around Megalox Beta, the squadron landed on a space station and met with Luta. The warden explained that the station projected a protective field upon a portion of Megalox Beta's surface, shielding the prison from the planet's heavy gravitational pull.\nL'ampar and the rest of Black Squadron boarded a transport to the surface, escorted by prison guards who would take them to the fortress of Grakkus. However, unknown to L'ampar and his comrades, Agent Terex of the First Order had previously arrived and bribed the guards to lock the Resistance pilots inside. In the prison, L'ampar and his fellow pilots were approached by a mob of prisoners, but before a fight could start, Pava activated canisters of gas. The Black Squadron pilots donned breath masks, using their blasters and more gas canisters to fend off the prisoners. L'ampar and his teammates ran toward Grakkus' home, and as they neared the fortress' outer wall, the prisoners gave up the attack and gathered outside of the building's perimeter. The Resistance pilots entered the walled courtyard, where they were surrounded by the Grakks, a group of cybernetically-enhanced Hutts who served Grakkus. The Grakks grabbed L'ampar and the other pilots while Grakkus escorted Dameron inside the fortress.\nAfter an extended wait under the Grakks' supervision, L'ampar and Black Squadron noticed the fortress doors opening and, to their surprise, Agent Terex stepped out. Terex exited the courtyard and walked through the criminal mob, which parted for him. Soon after, Dameron also exited the building to reunite with the squadron. L'ampar asked Dameron what the First Order was doing on Megalox Beta, and Dameron revealed that they too had come searching for Tekka. He further explained that Grakkus knew where Tekka was, and the Hutt would only give the information to whoever could break him out of prison first.\nDameron contacted his astromech droid, BB-8, and told the droid to begin \"Operation Upside,\" a plan which involved the four astromech droids of Black Squadron—BB-8, R2-HA, O-R10N, and R4—altering the controls aboard the Megalox space station and helping the Resistance members free Grakkus. However, hours passed without hearing from the droids, and the crowd of prisoners outside Grakkus' walls began to break into the fortress' courtyard. L'ampar and the rest of Black Squadron were quickly outnumbered, so Dameron told his squadron to retreat into Grakkus' fortress and wait out the attack. As Dameron spoke, he and L'ampar saw that Grakkus had already retreated there, closing the large, guarded doors behind him, trapping the pilots outside and forcing them to fight.\nFending off the attackers, L'ampar and the other pilots retreated to the front steps of Grakkus' fortress. Yelling through the doors, L'ampar called Grakkus a \"slug\" and demanded to be let inside, but Grakkus declined. As the prisoners overwhelmed the Resistance fighters, Dameron received a message from BB-8, informing him that Operation Upside was ready for execution. Upon Dameron's word, L'ampar and the others activated gravity belts, and the droids overrode the space station's controls, disabling the gravity shield. The belts kept Black Squadron from being crushed by the planet's full gravity, while the mob of prisoners, the Grakks, and Terex were all pinned to the ground. The success surprised L'ampar, and Dameron told the Duros to find guns.\nFully armed with L'ampar's collected weapons, Black Squadron destroyed the door to Grakkus' fortress. Inside, Dameron approached the Hutt and gave him a gravity belt. Accompanied by Grakkus, Black Squadron returned to the orbiting station, finding a shuttle for the Hutt there. Back in their starships, L'ampar and Black Squadron began escorting Grakkus' shuttle, but before they could enter hyperspace, the Megalox station was destroyed by Terex's ship, the Carrion Spike. The space station launched evacuation shuttles, and as the Carrion Spike began firing upon them, Black Squadron engaged the ship. L'ampar and the other Resistance pilots quickly overpowered Terex's ship, and it jumped to lightspeed. With Terex gone and the shuttles safe, Black Squadron departed the Megalox system. Freed from the prison, Grakkus kept his deal, giving the data about Tekka to Dameron.\nBack on D'Qar, Black Squadron's mission was paused while Organa reviewed the data. During this time, Dameron was assigned to a secret mission with the protocol droid C-3PO and the Resistance spy droid network, and Dameron selected Muva to join him. However, Agent Terex and the Ranc Gang—Terex's old criminal allies—set a trap for Dameron, and a battle began over a desert planet. Dameron's X-wing was shot down, forcing the commander to retreat into a cave. With Dameron cornered, Terex and his gang moved into the cave.\nL'ampar and the rest of Black Squadron discovered Dameron's plight, and they flew to the desert planet, fighting the Ranc Gang's Uglies in battle. Black Squadron was outnumbered, and Kun's X-wing was hit, barely able to maintain flight. When L'ampar asked Kun about her status, she stated that she had lost her steering and that there were three enemy fighters heading toward her. Before the enemy ships could destroy Kun's fighter, they were obliterated by the Carrion Spike, which had secretly been boarded and sabotaged by Muva, who had reprogrammed the ship's targeting computers.\nAs Muva and a group of Terex's slaves fled the flagship in escape pods, the pilot requested an escort to the planet's surface. L'ampar and Black Squadron moved in to protect the escape pods, but one was destroyed by a Ranc Gang ship. Appalled by the Ranc Gang's merciless killing, L'ampar swooped in behind the enemy starfighters, shooting down the ships and proclaiming victory over them.\nHowever, more enemy starships arrived behind L'ampar and shot down his A-wing, instantly killing the Duros veteran in a fiery explosion. Acknowledging L'ampar's sacrifice, Black Squadron continued to protect the escape pods. As the remaining pods reached the surface, a First Order cruiser arrived to apprehend Terex, who had become a renegade from them. To the surprise of Black Squadron, the cruiser finished off Terex's criminal forces, and the Resistance starfighters left. In the battle's aftermath, Terex was taken captive by First Order Commander Malarus, and Dameron, learning of L'ampar's death, began to process the loss of his friend.\nA funeral was held for L'ampar at the Resistance base, with his comrades mourning his death. General Organa began the funeral by remembering L'ampar as a fierce, dedicated warrior, and she invited Dameron to give the eulogy. Dameron began by speaking of the Force, and he told a story about Obi-Wan Kenobi. Dameron explained that Kenobi was one of the last Jedi, and he had perished fighting evil, just as L'ampar had. Continuing, Dameron stated that when Kenobi had died, his body had vanished, leaving behind only his lightsaber and robes. Dameron then spoke of Skywalker, and how the latter had learned that individuals were not just flesh and bone, but were \"luminous.\" Dameron finished his story, stating that when pilots died, they vanished just as the Jedi had, but they were not truly gone.\nDameron then discussed his past with L'ampar, explaining that the Duros had served as an uncle figure to him, and that L'ampar had been one of the best pilots he had ever met, never backing out of a fight. Stating that L'ampar was luminous, Dameron expressed how he could still feel L'ampar's presence. Dameron concluded the eulogy by saying \"may the Force be with you,\" addressing both L'ampar and the gathered Resistance members. In the time after the funeral, Black Squadron continued the search for Tekka, and the pilots eventually found the explorer in the Great Forveen Nebula. Following the First Order's ultimate defeat in the Battle of Exegol of 35 ABY, Dameron and his fellow Black Squadron pilots again remembered L'ampar, declaring him to be one of the three pilots from their squadron, alongside Muva and Wexley, who had given their lives in the fight for freedom.\nA male, green-skinned Duros, L'ampar had red eyes and—according to himself—a relatively short, handsome face. L'ampar believed that spending time with family was important, and he often confronted Bey, asking her to spend more time with her husband and son. Despite not recieving orders to do so, the Duros was willing to assist Kes Dameron in rescuing Bey when she was captured by Imperials. When Bey's husband had his resignation paperwork approved, L'ampar took the liberty of submitting hers, reassuring the pilot that she had done her share for the Rebellion, and that mustering out was not desertion. Following Bey's service, L'ampar kept in contact with her family, and he acted as an uncle to the young Dameron, helping to raise the child. Although L'ampar was concerned for Bey, the Duros had a lighthearted nature, frequently making jokes in serious situations.\nDuring L'ampar's time with the Resistance, he disapproved of classified information being withheld from him, and he perceived that Organa still did not trust him despite their shared history. When L'ampar voiced this complaint, Kun joked that the Duros was an \"old-timer\" and was lucky to still be flying. As a member of Black Squadron, L'ampar respected Dameron, praising the commander for trusting the squadron to improvise when needed, rather than giving them uninformed orders. The Duros saw that trait as the \"mark of a good commander,\" validating this opinion through his prior experiences under poor leadership. L'ampar believed that a war between the First Order and New Republic was inevitable, so during Black Squadron's first mission, he broke the rules of engagement and fired upon the enemy fighters. Following the mission, Dameron confronted L'ampar about his actions, but the Duros refused to apologize, arguing that a fighter destroyed then was one less to worry about later.\nIn his old age, L'ampar sometimes wished that he could slow down, and he reminisced about the ancient Duros pilots who explored space simply because they could. When Dameron suggested that L'ampar explore the galaxy's Unknown Regions after the war, the veteran admitted it was a good thought, but that the galaxy would decide his purpose.\nL'ampar was protective of his friends, and he gave his life in a mission to rescue Dameron from Terex and the Ranc Gang. In the battle, the gang's destruction of unarmed escape pods enraged L'ampar, and he vowed that no more would be destroyed, ultimately sacrificing himself in their defense. His actions saved the lives of several escaping slaves, as well as the life of Muva. The Resistance viewed L'ampar's death as a heroic sacrifice to defend those who could not do so for themselves. His comrades remembered him for having a cranky, kind, crazy, and strong demeanor. In the wake of L'ampar's death, his sacrifice became a rallying point for Black Squadron in their following missions.\nL'ampar was one of the best pilots in the Rebellion, and he flew an A-wing interceptor through numerous Alliance campaigns. He used the callsign \"Green Two\" in the Battle of Endor, and he was field-promoted to Green Leader following the death of Arvel Crynyd. During the battle in Cawa City, L'ampar saved fellow pilot Shara Bey from a TIE fighter when her A-wing was damaged, and he helped clear an approach for the Y-wing bombers of Feral Group.\nAn atmospheric flight maneuver called a L'ulo Stand was named after L'ampar, and Bey, having once witnessed it, described the maneuver to her son, Poe Dameron. Decades after the Battle of Endor, Dameron, who was recognized as the best pilot in the Resistance, completed an improvised version of a L'ulo Stand in the vacuum of space. Later, Dameron personally sought L'ampar's participation in Black Squadron, ranking the Duros among the best pilots of the Resistance. With Black Squadron, L'ampar contributed to numerous successful Resistance missions.\nAs a pilot of Starlight Squadron, L'ampar wore a green flight suit and helmet that were both marked with the squadron's insignia, and he operated a silver RZ-1 A-wing interceptor. During his time with Green Squadron and Black Squadron, L'ampar's flight outfit no longer bore the Starlight Squadron emblem, and he flew a red A-wing. Additionally, L'ampar flew his A-wing with the Yavin system's Civilian Defense Force, and he utilized a landspeeder for ground activities. While with the Resistance, he also flew an RZ-2 A-wing interceptor. L'ampar was the only member of Black Squadron who did not pilot an X-wing, and his diverse talents were effective against the First Order's TIE fighters.\nL'ampar also handled blasters, which he notably used in skirmishes on Judakann and Megalox Beta. During the mission on Megalox Beta, L'ampar donned a black combat uniform, a breath mask, and a gravity belt. When off-duty, L'ampar wore a Resistance fighter jacket, and he used a pipe.\nL'ulo L'ampar first appeared in Shattered Empire 1, a comic book written by Greg Rucka, illustrated by Marco Checchetto, and published by Marvel Comics on September 9, 2015. Rucka's novel Before the Awakening also references L'ampar through the L'ulo Stand, although the character's name is misspelled as \"L'ullo.\"\nWhen Star Wars: Poe Dameron writer Charles Soule was asked about the relationship between L'ampar and Dameron, Soule stated that L'ampar was like an uncle to Dameron, comparing the character to memorable relatives at Thanksgiving reunions. Soule felt that L'ampar's death in Poe Dameron 13 was tragic and heroic, and he used L'ampar's funeral as a tribute to the late Carrie Fisher. The funeral was depicted in Poe Dameron 14, and it provided the first instance of the surname \"L'ampar.\"\nL'ampar is a playable character in the 2020 mobile game Star Wars: Starfighter Missions, which recreates space battles from throughout the Star Wars saga. He can be unlocked by completing the game's introductory mission, which features Rebel pilot Biggs Darklighter in a battle over Tatooine.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Inquisitorius",
  "/wiki/Category:Wookieepedia_Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations",
  "/wiki/Wookieepedia:Featured_article_nominations/L%27ulo_L%27ampar_(Redux_review)",
  "/wiki/Wookieepedia:Inq/L%27ulo_L%27ampar",
  "/wiki/Duro",
  "/wiki/34_ABY",
  "/wiki/Unidentified_desert_planet",
  "/wiki/Duros",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Starlight_Squadron",
  "/wiki/Green_Squadron_(Rebel_Alliance)",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Civilian_Defense_Force",
  "/wiki/Resistance",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Pilot",
  "/wiki/Planet",
  "/wiki/Galactic_Civil_War",
  "/wiki/Rebel_pilot",
  "/wiki/Shara_Bey",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Battle_of_Cawa_City",
  "/wiki/Cawa_City",
  "/wiki/Standard_month",
  "/wiki/Marriage",
  "/wiki/Kes_Dameron",
  "/wiki/Poe_Dameron",
  "/wiki/5_ABY",
  "/wiki/Dameron_family",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Yavin_system",
  "/wiki/Dameron_homestead",
  "/wiki/Death",
  "/wiki/10_ABY",
  "/wiki/18_ABY",
  "/wiki/Spice_Runners_of_Kijimi",
  "/wiki/Standard_year",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Osako_pirates",
  "/wiki/19_ABY",
  "/wiki/32_ABY",
  "/wiki/First_Order",
  "/wiki/Squadron",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Lor_San_Tekka",
  "/wiki/Scout",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Hunt_for_Lor_San_Tekka",
  "/wiki/Ovanis",
  "/wiki/Megalox_Beta",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/First_Order_Security_Bureau",
  "/wiki/Battle_over_a_desert_planet",
  "/wiki/Funeral_of_L%27ulo_L%27ampar",
  "/wiki/Homeworld",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Hoth",
  "/wiki/3_ABY",
  "/wiki/Military_rank",
  "/wiki/Captain",
  "/wiki/Fourth_Division",
  "/wiki/Operation_Starlight",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Starlight_Leader",
  "/wiki/Trawak",
  "/wiki/Fleet",
  "/wiki/Realspace",
  "/wiki/Felucia",
  "/wiki/Callsign",
  "/wiki/Starlight_Three",
  "/wiki/Sixth_Division",
  "/wiki/Destruction_of_the_Sixth_Division",
  "/wiki/Wedge_Antilles",
  "/wiki/Ambush_near_Felucia",
  "/wiki/Viper_probe_droid",
  "/wiki/Probe_droid",
  "/wiki/Astromech_droid",
  "/wiki/X-wing_starfighter",
  "/wiki/Droid",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Tarkin%27s_Will",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Signal_jammer",
  "/wiki/Comm_unit",
  "/wiki/Hyperspace",
  "/wiki/Imperial_Tactical_Manual",
  "/wiki/Tractor_beam",
  "/wiki/Rogue_Squadron",
  "/wiki/Star_Destroyer",
  "/wiki/Hangar",
  "/wiki/Deflector_shield",
  "/wiki/Concussion_missile",
  "/wiki/Proton_torpedo",
  "/wiki/Tractor_beam_projector",
  "/wiki/Freyta_Smyth",
  "/wiki/Starfighter",
  "/wiki/Slicer",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Starship",
  "/wiki/Walker",
  "/wiki/Thief",
  "/wiki/Starlight_Two",
  "/wiki/Club_Afterburn",
  "/wiki/Alcohol",
  "/wiki/Standard_day",
  "/wiki/Battle_on_Ab_Dalis",
  "/wiki/Ab_Dalis",
  "/wiki/Seventh_Division",
  "/wiki/Eleventh_Division",
  "/wiki/Ultima_II",
  "/wiki/Volcano",
  "/wiki/Chancellor_(Rebel_Alliance)",
  "/wiki/Mon_Mothma",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/Troop_transport",
  "/wiki/Commander",
  "/wiki/Ellian_Zahra",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Temporary_rebel_cell_base",
  "/wiki/Panisia",
  "/wiki/Second_Division",
  "/wiki/Battle_of_Panisia",
  "/wiki/Signal_grenade",
  "/wiki/Unity_Day_attack",
  "/wiki/Bar%27leth",
  "/wiki/Core_Worlds",
  "/wiki/Imperial_Unity_Day",
  "/wiki/Parade",
  "/wiki/EF76_Nebulon-B_escort_frigate",
  "/wiki/Toast_(ritual)",
  "/wiki/Lieutenant",
  "/wiki/Green_Leader",
  "/wiki/Arvel_Crynyd",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Alliance_High_Command",
  "/wiki/Space_station",
  "/wiki/L%27ulo_L%27ampar%27s_A-wing",
  "/wiki/Green_Two",
  "/wiki/Endor",
  "/wiki/Superweapon",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Time",
  "/wiki/Capital_ship",
  "/wiki/Executor",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Suicide",
  "/wiki/Bridge_(starship)",
  "/wiki/Gold_Leader",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Red_Leader",
  "/wiki/Shuttle",
  "/wiki/Endor_(planet)",
  "/wiki/Ewok",
  "/wiki/Crix_Madine",
  "/wiki/Green_Four",
  "/wiki/Signal_Intelligence_(Rebel_Alliance)",
  "/wiki/Imperial_outpost_(Endor)",
  "/wiki/Bright_Tree_Village",
  "/wiki/Han_Solo",
  "/wiki/Assault_on_an_Imperial_outpost",
  "/wiki/Capital",
  "/wiki/Sterdic_IV",
  "/wiki/Feral_Group",
  "/wiki/Shara_Bey%27s_A-wing",
  "/wiki/Feral_Leader",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Feral_Two",
  "/wiki/Feral_Three",
  "/wiki/Magnet",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Naboo",
  "/wiki/Operation:_Cinder",
  "/wiki/Paper",
  "/wiki/Wetyin%27s_Colony",
  "/wiki/Declaration_of_a_New_Republic",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galaxy",
  "/wiki/L%27ulo_Stand",
  "/wiki/Yavin_4_Defense_Force_station",
  "/wiki/Landspeeder",
  "/wiki/Parent",
  "/wiki/Farm",
  "/wiki/Standard_hour",
  "/wiki/Gully%27s",
  "/wiki/Cantina",
  "/wiki/Bartender",
  "/wiki/Fontis",
  "/wiki/Sela_Trune",
  "/wiki/New_Republic_Security_Bureau",
  "/wiki/Beke_Mon%27z",
  "/wiki/Pirate",
  "/wiki/Unidentified_Moraysian_cruiser",
  "/wiki/Llanic_Spice_Run",
  "/wiki/Torch_Nebula",
  "/wiki/Judakann",
  "/wiki/Moraysian_shuttle",
  "/wiki/Zorii_Bliss",
  "/wiki/EV-6B6",
  "/wiki/Tomasso",
  "/wiki/Blaster",
  "/wiki/Lurker",
  "/wiki/Species",
  "/wiki/Blood",
  "/wiki/Moraysian_cruiser",
  "/wiki/28_ABY",
  "/wiki/Cold_War",
  "/wiki/Resistance_pilot",
  "/wiki/Jedi",
  "/wiki/Technician",
  "/wiki/Oddy_Muva",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Temmin_Wexley",
  "/wiki/Kar%C3%A9_Kun",
  "/wiki/Jessika_Pava",
  "/wiki/Mission_to_Ovanis",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Mountain",
  "/wiki/Cave_of_the_Cr%C3%A8che",
  "/wiki/Black_One",
  "/wiki/Cr%C3%A8che_egg",
  "/wiki/Cave",
  "/wiki/Homing_beacon",
  "/wiki/First_Order_landing_platform",
  "/wiki/AAL-1971/9.1_Troop_Transport",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/First_Order_jet_trooper",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/A-wing_starfighter",
  "/wiki/First_Order_TIE_Fighter_Pilot",
  "/wiki/Transport",
  "/wiki/Laser",
  "/wiki/Fire",
  "/wiki/Limb",
  "/wiki/Fuel",
  "/wiki/Troop",
  "/wiki/Orbit",
  "/wiki/Unidentified_Cr%C3%A8che_creature",
  "/wiki/Reproduction",
  "/wiki/Egg",
  "/wiki/Cr%C3%A8che",
  "/wiki/Prisoner",
  "/wiki/Unidentified_Cr%C3%A8che_elder",
  "/wiki/Maxima-A_class_heavy_cruiser",
  "/wiki/Prison",
  "/wiki/After-action_report",
  "/wiki/Mission_to_Megalox_Beta",
  "/wiki/Megalox",
  "/wiki/Hutt",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Collector",
  "/wiki/The_Force",
  "/wiki/Luta",
  "/wiki/Warden",
  "/wiki/Megalox_space_station",
  "/wiki/Gravity",
  "/wiki/Unidentified_transport_(Megalox)",
  "/wiki/Fortress_of_Grakkus_the_Hutt",
  "/wiki/Breath_mask",
  "/wiki/Fortress",
  "/wiki/Grakks",
  "/wiki/Cybernetics",
  "/wiki/BB-8",
  "/wiki/R2-HA",
  "/wiki/O-R10N",
  "/wiki/R4_(Black_Squadron)",
  "/wiki/Slug_(creature)",
  "/wiki/Gravity_belt",
  "/wiki/Belt",
  "/wiki/Carrion_Spike",
  "/wiki/Lightspeed",
  "/wiki/Megalox_system",
  "/wiki/Mission_to_Kaddak",
  "/wiki/Protocol_droid",
  "/wiki/Resistance_spy_droid_network",
  "/wiki/Ranc_Gang",
  "/wiki/Desert",
  "/wiki/Ugly",
  "/wiki/Saboteur",
  "/wiki/Programmer",
  "/wiki/Targeting_computer",
  "/wiki/Slavery",
  "/wiki/Flagship",
  "/wiki/Escape_pod",
  "/wiki/Heavy_cruiser",
  "/wiki/Cruiser",
  "/wiki/Malarus",
  "/wiki/Funeral",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Jedi_apparel",
  "/wiki/Bone",
  "/wiki/May_the_Force_be_with_you",
  "/wiki/Rescue_of_Lor_San_Tekka",
  "/wiki/Great_Forveen_Nebula",
  "/wiki/Battle_of_Exegol",
  "/wiki/35_ABY",
  "/wiki/Eye",
  "/wiki/Unknown_Regions",
  "/wiki/Atmosphere",
  "/wiki/Standard_decade",
  "/wiki/Skirmish_in_OR-Kappa-2722",
  "/wiki/Vacuum",
  "/wiki/Flight_suit",
  "/wiki/Flight_helmet",
  "/wiki/RZ-2_A-wing_interceptor",
  "/wiki/Resistance_fighter_jacket",
  "/wiki/Pipe",
  "/wiki/Shattered_Empire_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Greg_Rucka",
  "/wiki/Marco_Checchetto",
  "/wiki/Marvel_Comics",
  "/wiki/September_9",
  "/wiki/2015",
  "/wiki/Before_the_Awakening",
  "/wiki/Star_Wars:_Poe_Dameron",
  "/wiki/Charles_Soule",
  "/wiki/Poe_Dameron_13",
  "/wiki/Carrie_Fisher",
  "/wiki/Poe_Dameron_14",
  "/wiki/2020",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Naval_warfare",
  "/wiki/Star_Wars_saga",
  "/wiki/Biggs_Darklighter",
  "/wiki/Tatooine",
  "/wiki/Category:Images_of_L%27ulo_L%27ampar",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars_(2020)_12",
  "/wiki/Star_Wars_(2020)_15",
  "/wiki/Star_Wars_(2020)_21",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Star_Wars_(2020)_24",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Shattered_Empire_2",
  "/wiki/Shattered_Empire_4",
  "/wiki/Poe_Dameron:_Free_Fall",
  "/wiki/Poe_Dameron:_Free_Fall_(audiobook)",
  "/wiki/Poe_Dameron_1",
  "/wiki/Poe_Dameron_2",
  "/wiki/Poe_Dameron_3",
  "/wiki/Poe_Dameron_4",
  "/wiki/Poe_Dameron_5",
  "/wiki/Poe_Dameron_6",
  "/wiki/Poe_Dameron_7",
  "/wiki/Poe_Dameron_8",
  "/wiki/Poe_Dameron_12",
  "/wiki/Poe_Dameron_15",
  "/wiki/Poe_Dameron_16",
  "/wiki/Poe_Dameron_17",
  "/wiki/Poe_Dameron_18",
  "/wiki/Poe_Dameron_Annual_1",
  "/wiki/Poe_Dameron_Annual_2",
  "/wiki/Poe_Dameron_20",
  "/wiki/Poe_Dameron_31",
  "/wiki/A_Eulogy_for_Snap",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/RZ-2_A-Wing_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Resistance:_Complete_Season_One",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_26",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_32",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Poe_Dameron_11",
  "/wiki/Poe_Dameron_25",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/File:LulloStand.png",
  "/wiki/Bria_LaVorgna",
  "/wiki/April_19",
  "/wiki/2017",
  "/wiki/November_8"
 ]
}