{
 "name": "Laan_Tik",
 "display_name": "Laan Tik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Mimban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Laan Tik was a Kajain'sa'Nikto member of the Jedi Order who served as a Jedi General of the Grand Army of the Republic during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Tik participated in the Battle of Mimban in 22 BBY, along with Clone Captain Rex, the 501st Legion, and the Mud Jumpers of the 224th Division. The Jedi was killed during the battle, and Tik's lightsaber was later used by Junior Representative Jar Jar Binks to save Rex's life.\nLaan Tik was a member of the Kajain'sa'Nikto subspecies of the Nikto species and a part of the Jedi Order, holding the rank of Jedi General of the Grand Army of the Republic during the Clone Wars against the Confederacy of Independent Systems. In 22 BBY, Tik participated in the Battle of Mimban, where the Jedi served with Clone Captain CT-7567 \"Rex\" and members of his 501st Legion as well as the Mud Jumpers of the 224th Division.\nDuring the intense battle against the forces of the Separatist Droid Army, Rex ordered the 501st Legion to advance and the Mud Jumpers to reinforce Tik. The general, however, replied that help was not needed and Force pushed a number of B1-series battle droids. While the Clone Captain and fellow 501st Legion clone trooper Hardcase spoke on evacuating Junior Representative Jar Jar Binks out of the area, Tik was killed by a shot to the chest. Following the death of the general, Binks paid respects to Tik's body and took Tik's lightsaber so that it would not fall into enemy hands. Since Galactic Republic forces were being defeated, Rex ordered a retreat.\nFollowing Tik's death, Binks was the highest-ranking member of the Republic forces on Mimban, and thus the chain of command fell to him. Not wanting to lose more lives while destroying the Separatist shield generator, the Republic's target of the mission, Rex ordered that Republic High Command be contacted for extraction. However, he also planned to proceed to the shield generator alone and destroy it.\nAfter fighting through Separatist forces for hours, Rex was wounded. Before the Separatists' droids could kill him, however, Binks saved the clone using Tik's lightsaber. At first, Rex confused Binks for Tik, until the Representative revealed himself. He then took the lightsaber to prevent the Gungan from accidentally hurting himself, and they proceeded toward the shield generator together, destroying droid forces with blasters. During the fighting, Binks asked if he could use the lightsaber, a request the captain refused.\nAs a Jedi General, Laan Tik fought on the front lines of battle. When Captain Rex ordered that the Mud Jumpers assist the General, Tik refused the help, demonstrating confidence in his own fighting abilities. However, Tik died shortly after. Tik had purple skin and green eyes.\nLaan Tik, being Force-sensitive, was able to Force push during combat, as well as utilize a lightsaber.\nBeing a Jedi General, Tik wore Jedi Commander armor along with brown Jedi robes and white bandages around the arms. Tik utilized a blue lightsaber during combat.\nLaan Tik appeared in the comic story \"501 Plus One,\" written by Marc Guggenheim and illustrated by Caspar Wijngaard and Cris Peter. The story was published in the one-shot comic Age of Republic Special 1 by Marvel Comics on January 16, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/22_BBY",
  "/wiki/Mimban",
  "/wiki/Nikto",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_General",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Mimban",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/501st_Legion",
  "/wiki/Mud_Jumpers",
  "/wiki/224th_Imperial_Armored_Division",
  "/wiki/Jedi",
  "/wiki/Death",
  "/wiki/Laan_Tik%27s_lightsaber",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Subspecies",
  "/wiki/Species",
  "/wiki/Military_rank",
  "/wiki/Gender",
  "/wiki/Separatist_Droid_Army",
  "/wiki/General",
  "/wiki/Force_push",
  "/wiki/B1-series_battle_droid",
  "/wiki/Clone_trooper",
  "/wiki/Hardcase",
  "/wiki/Commanding_officer",
  "/wiki/Deflector_shield_generator",
  "/wiki/Republic_High_Command",
  "/wiki/Deflector_shield",
  "/wiki/Standard_hour",
  "/wiki/Battle_droid",
  "/wiki/Cloning",
  "/wiki/Lightsaber",
  "/wiki/Gungan",
  "/wiki/Droid",
  "/wiki/Blaster",
  "/wiki/Eye",
  "/wiki/Force-sensitive",
  "/wiki/The_Force",
  "/wiki/Jedi_Commander_armor",
  "/wiki/Jedi_robes",
  "/wiki/Limb",
  "/wiki/Star_Wars_comic_books",
  "/wiki/501_Plus_One",
  "/wiki/Marc_Guggenheim",
  "/wiki/Caspar_Wijngaard",
  "/wiki/Cris_Peter",
  "/wiki/Age_of_Republic_Special_1",
  "/wiki/Marvel_Comics",
  "/wiki/January_16",
  "/wiki/2019",
  "/wiki/Category:Images_of_Laan_Tik",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Rookies",
  "/wiki/Supply_Lines",
  "/wiki/Bombad_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide"
 ]
}