{
 "name": "Labansat",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brownish-gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Labansat was a well-known Weequay male mercenary active during the Galactic Civil War. Fierce, brutal, and a skilled fighter, Labansat operated out of the Lesser Plooriod Cluster and the Karstaxon Regions, plying the two areas of galactic space. He found employment in the services of whomever agreed to his asking price, including the Galactic Empire.\nAn infamous mercenary, Labansat was a Weequay male active during the war between the Galactic Empire and the Rebel Alliance. He frequently harassed two areas of galactic space, the Karstaxon Regions and the Lesser Plooriod Cluster, where he often found work, provided his price be met by his potential employer. Labansat was one of many mercenaries on the payroll of the Empire.\nLabansat was briefly mentioned as a notable Weequay in the first volume of The University of Sanbra Guide to Intelligent Life, a document on a variety of alien species compiled by Iyra sentientologist Tem Eliss of the University of Sanbra.\nLabansat was a notorious mercenary, known for his viciousness and plying of the Lesser Plooriod Cluster and the Karstaxon Regions. A skilled and deadly combatant, he required that any potential employer meet his asking price before he accepted a job opportunity.\nThe Weequay mercenary Labansat was first mentioned as a \"notable personalit\" of his species in the 1995 West End Games sourcebook Galaxy Guide 12: Aliens — Enemies and Allies. He later appeared in the 1998 PC game Star Wars: Rebellion as one of several Imperial-aligned characters available to the player. In the game, Labansat possesses advanced combat and espionage abilities, performing well on abduction, assassination, and sabotage missions; however, as a result, his leadership and diplomacy skills are lacking. His name was later mentioned as an example of a Weequay name in Ultimate Alien Anthology, published in 2003.\nStar Wars Galaxy Magazine 10 from January 1997 included an article written by Tom Byron previewing Star Wars: Rebellion prior to the game's release. The article mistakenly states that Labansat originated in author Timothy Zahn's Thrawn Trilogy novel series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Weequay/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lesser_Plooriod_Cluster/Legends",
  "/wiki/Karstaxon_Regions",
  "/wiki/The_galaxy/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Iyra",
  "/wiki/Sentientologist",
  "/wiki/Tem_Eliss",
  "/wiki/University_of_Sanbra",
  "/wiki/Star_cluster/Legends",
  "/wiki/Death/Legends",
  "/wiki/1995",
  "/wiki/West_End_Games",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies",
  "/wiki/1998",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebellion_(video_game)",
  "/wiki/Spy/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/2003",
  "/wiki/Star_Wars_Galaxy_Magazine_10",
  "/wiki/January",
  "/wiki/1997",
  "/wiki/Tom_Byron",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars:_The_Thrawn_Trilogy",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Game_Room",
  "/wiki/Star_Wars:_Rebellion:_Prima%27s_Official_Strategy_Guide"
 ]
}