{
 "name": "Lagret",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Captain Lagret was a human male who served in the Galactic Empire's Imperial Security Bureau as a supervisor. In 5 BBY, he reported at a meeting on the planet Coruscant that a conflict on Arvala-Six had diminished enough for mining to resume, but was chastised by Major Partagaz for ongoing storage issues with those displaced by the conflict and a unfinished memorandum that the supervisor was meant to have completed. Lagret made the excuse that he was waiting on Arvala-Six's ministerial director, but this prompted Partagaz to make a speech about the purpose of the bureau and then tell Lagret that the memorandum would be reassigned.\nLagret was a human male who held the role of ISB Supervisor and the rank of captain within the Imperial Security Bureau during the reign of the Galactic Empire. He was responsible for overseeing Arvala-Six, where a conflict was taking place. In 5 BBY, the conflict diminished enough that mining was able to resume on occupied land, which Lagret viewed as a positive development; however, there was still ongoing storage issue with those displaced by the conflict. The supervisor was required to write a memorandum of recommendations on how to deal with this issue, but it remained unfinished while his staff awaited an assessment from Arvala-Six's ministerial director.\nThe memorandum was still unfinished when Lagret attended a meeting of supervisors in a bureau building on the planet Coruscant. The resumption of mining on Arvala-Six came up as an item on the meeting's agenda, with Major Partagaz questioning Lagret on the development and pointing out that he still had not completed his recommendations. When Lagret attempted to explain that his staff were waiting for the director, Partagaz sarcastically commented on the excellent job they had done so far. When Lagret failed to respond, the major asked him what they did at the bureau, but the supervisor was confused by the question.\nPartagaz opened it up to the wider room, allowing Lieutenant Dedra Meero to provide a verbatim portion of the Imperial Security Bureau mission statement, but the major declared this incorrect, instead stating that the bureau's purpose was identifying symptoms and treating the \"sickness\" of disorder within the Empire. Lagret claimed to understand what Partagaz meant by this, but the major told him to no longer worry about the memorandum as it would be reassigned.\nLagret and the other supervisors were later summoned back to the meeting room alongside numerous other staff after the Imperial payroll for an entire sector was stolen from an Imperial installation on the planet Aldhani. Partagaz informed the room that they would not be going home and should let their staff and families know, ordering that every Star Sector and Planetary Emergency Retaliation plan in the building to be ready for presentation by midnight.\nLagret believed his item on the meeting agenda was a positive development, but was confused after Partagaz chastized him over the memorandum and then asked him the purpose of the bureau, mistaking the question as one about Arvala-Six. When the major told him that the memorandum would be reassigned, the supervisor looked in dismay to Supervisor Lonni Jung, who was sat next to him. Lagret had balding gray hair, blue eyes, and light skin.\nLagret wore a white Imperial officer's uniform with a code cylinder on each shoulder and a rank insignia plaque with four blue squares.\nLagret was portrayed by Michael Jenn in \"Aldhani,\" the fourth episode of the television series Andor, which aired on September 28, 2022. Prior to the episode's release, he was visually revealed in the teaser trailer for the show which aired on May 26, 2022.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Captain",
  "/wiki/ISB_Supervisor",
  "/wiki/5_BBY",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Arvala-Six_conflict",
  "/wiki/Arvala-Six",
  "/wiki/Mining",
  "/wiki/Major",
  "/wiki/Partagaz",
  "/wiki/Military_rank",
  "/wiki/Imperial_Era",
  "/wiki/ISB_Central_Office",
  "/wiki/Director",
  "/wiki/Lieutenant",
  "/wiki/Dedra_Meero",
  "/wiki/Sector",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_dam",
  "/wiki/Aldhani",
  "/wiki/Lonni_Jung",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Aldhani_(episode)",
  "/wiki/September_28",
  "/wiki/2022",
  "/wiki/May_26",
  "/wiki/The_Eye",
  "/wiki/Star_Wars",
  "/wiki/Category:Images_of_Lagret",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/June_4",
  "/wiki/File:Imperial_Forces_Rank_Chart_-_Rogue_One.png",
  "/wiki/Kassa_(episode)"
 ]
}