{
 "name": "Lah Zhima",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Juro"
     ]
    }
   ]
  }
 ],
 "content": "Lah Zhima was a Force-sensitive human male sabersmith who worked for Margrave Juro on the world of Hy Izlan, where he raised a daughter, Lah Kara. Juro had Zhima produce eight lightsabers for him as he intended to try and restart the Jedi Order, but the duo's attempts were discovered by Sith Jedi hunters. The hunters captured Zhima and took him to a distant star system but not before he managed to get the sabers to Kara, who brought them to Juro's Jedi recruits. After Kara helped Juro defeat the recruits that were disguised Sith, Juro promised that he would help save her father.\nLah Zhima was a legendary sabersmith who lived on the Outer Rim planet Hy Izlan, where he used kyber crystals to build lightsabers for the margrave, Juro. Zhima's daughter, Lah Kara, lived with him on the planet. Zhima built eight lightsabers for the margrave and finished them on time as he had promised, tempering each crystal so that the color and length would be controlled by which Jedi wielded it. Zhima explained this to Kara following the eighth saber being completed, noticing her talent and teaching her about the Force.\nHowever, that day, a starship of Sith Jedi hunters arrived, which prompted Zhima to give all of the lightsabers to Kara so that she could deliver them to the Aerial Temple that orbited the planet; Juro had recruited Jedi candidates to the temple in the hopes of restoring the Jedi Order, which was why he required the lightsabers. Kara was surprised that her father was not going to deliver them, but he claimed that he would be looking after the guests, despite the fact that they were not actually his guests. He embraced her, acting as though he would not see his daughter again—surprising her once more. Kara then ran away just as two hunters burst through the door and asked of his identity, which he confirmed. They then accused him of manufacturing illegal lightsabers, which he avoided denying.\nWhen Zhima was told that he would be taken away, he tried to refuse. He then checked the window to make sure that Kara was far enough away and deflected the hunters' shots into his oven, exploding his building along with the hunters. The explosion was too small, however, and all three individuals inside survived. Kara also noticed and turned around to find her father being dragged on the ground by the hunters. He begged her to run once he saw her, and she did, escaping on a speeder and being chased by one of the hunters. The remaining hunter took away Zhima.\nKara mentioned her father when meeting the Jedi recruits of the Aerial Temple, which intrigued them, for they were anticipating the lightsabers. Once Kara revealed them, they accepted the sabers eagerly. However, most of the recruits were Sith, not Jedi, their lightsabers turning red as an indication.\nDuring the subsequent lightsaber duel, one of the Sith told Kara that Lah Zhima had been taken to a star system far away and that she would never see him again. She also informed Kara that any rescue attempts would be unsuccessful. Despite the Sith's number, Juro, Kara, and the only two recruits who were indeed Jedi, Ethan and Homen, were able to win the duel. Juro explained to Kara that he had only recently learned that Sith were sent in place of several Jedi, which was how they had learned of Zhima's sabersmith abilities. He apologized for not being able to help when he was taken but promised that he would help Kara save him.\nZhima had a loving relationship with his daughter; she meant everything to him, and he meant everything to her. He was willing to sacrifice himself for her, begging her to run while he was captured. He was a human male with light skin, black hair, and gray eyes.\nA legendary lightsaber-smith, Zhima made all eight lightsabers on time and was able to make each lightsaber react to its user. Additionally, he was able to deflect blaster fire using the Force.\nWhen dealing with kyber crystals, Zhima used a hammer, and he had many other tools in his workspace. When he ignited one of his lightsabers, the blade turned blue. He wore simple, gray clothing with overalls along with a white bandana.\nLah Zhima was created for the Star Wars: Visions short film \"The Ninth Jedi,\" which was released on September 22, 2021. Prior to the film's release, Zhima was revealed in a September 13 StarWars.com article detailing the series' cast. He was voiced by Shin-ichiro Miki in the original Japanese audio and by Simu Liu in the English dub.\nExecutive producer Josh Rimes called Zhima's profession and lightsabers unique to \"The Ninth Jedi,\" \"different from anything  seen before in Star Wars.\" The film's writer and director, Kenji Kamiyama, wanted the lightsabers to feel new. The idea of including a blacksmith character was one of Kamiyama's first ideas for \"The Ninth Jedi,\" as he was interested in a non-Jedi individual that could make a lightsaber. Although canonically, Jedi usually created their own lightsabers, the presence of Zhima was part of the freedom that the creators of Visions had in telling the story that they wanted to.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Juro",
  "/wiki/Force-sensitive",
  "/wiki/Sabersmith",
  "/wiki/Margrave",
  "/wiki/Planet",
  "/wiki/Hy_Izlan",
  "/wiki/Lah_Kara",
  "/wiki/Lightsaber",
  "/wiki/Jedi_Order",
  "/wiki/Sith",
  "/wiki/Jedi_hunter",
  "/wiki/Star_system",
  "/wiki/Jedi",
  "/wiki/Parent",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Kyber_crystal",
  "/wiki/Time",
  "/wiki/Crystal",
  "/wiki/The_Force",
  "/wiki/Standard_day",
  "/wiki/Starship",
  "/wiki/Hy_Izlan_Aerial_Temple",
  "/wiki/Orbit",
  "/wiki/Speeder",
  "/wiki/Lightsaber_duel",
  "/wiki/Ethan",
  "/wiki/Homen",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Force_deflection",
  "/wiki/Hammer_(tool)",
  "/wiki/Clothing",
  "/wiki/Bandana",
  "/wiki/The_Ninth_Jedi",
  "/wiki/September_22",
  "/wiki/2021",
  "/wiki/September_13",
  "/wiki/StarWars.com",
  "/wiki/Shin-ichiro_Miki",
  "/wiki/Simu_Liu",
  "/wiki/Josh_Rimes",
  "/wiki/Kenji_Kamiyama",
  "/wiki/Category:Images_of_Lah_Zhima",
  "/wiki/The_Ninth_Jedi_(manga)",
  "/wiki/Gangan_Comics",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars:_Visions_Filmmaker_Focus",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210"
 ]
}