{
 "name": "Lahka_Khai",
 "display_name": "Lahka Khai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "44 ABY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Lahka Khai was a Human female from the planet of Kesh. She married the Sith Saber Gavar Khai, with whom she had one child, Vestara. Lahka, unlike her husband and daughter, was not Force-sensitive. In 41 ABY, Vestara was chosen to be the Sith apprentice of Lady Rhea, causing her to move away from her family and live in the Sith Temple. When Vestara was later sent on a mission to confront the Jedi Luke Skywalker, Lahka Khai remained in good health, although she missed her daughter. Lahka was present with Gavar when the dark side entity Abeloth arrived on Kesh in 44 ABY, after Abeloth proposed an alliance with the Sith to defeat the Jedi. However, that evening, Abeloth unleashed an attack on the city of Tahv, leaving it in ruins and killing many of its residents, Lahka included.\nLahka Khai was a female Human born on the Wild Space world of Kesh. Despite her lack of Force-sensitivity, she married a Sith Saber, Gavar Khai—a member of the Lost Tribe of Sith, descendants of a group of Sith whose starship, the Omen, crashed onto the planet in 5000 BBY, during the Great Hyperspace War. Together, the Khais lived in a private estate on Kesh.\nWith Gavar, Lahka gave birth to one daughter in 27.5 ABY, whom they named Vestara. Vestara began training in the ways of the Sith, and shortly after Ship, a Sith Meditation Sphere, arrived on the planet in 41 ABY, she was called to meet with the Circle of Lords in Kesh's Circle Chambers, in the capital city of Tahv. Gavar and Vestara were worried that she might have gotten in trouble, and, though Lahka could tell that something was wrong, she knew it was not her place to be concerned about Sith business. However, at the meeting, Vestara was chosen to become the apprentice of Lady Rhea. To begin her training, Vestara had to move away from her family and live in the Sith Temple located in the nearby Takara Mountains.\nIn 43.5 ABY, Vestara was chosen to be a member of the Sith strike team sent to confront the Jedi Luke and Ben Skywalker. She was the sole survivor of the mission, and went on to recruit a group of dark side Nightsisters on Dathomir to the Tribe's cause. Gavar, too, left on a mission to find Vestara and then make a feigned alliance with the Jedi to attack the dark side entity Abeloth. Throughout that time, Lahka Khai remained in good health. She missed her daughter's presence, but she was also very proud of Vestara's achievements.\nIn 44 ABY, Gavar returned to Kesh with Abeloth, who—after multiple battles between herself, the Sith, and the Jedi—had proposed an alliance with the Sith to defeat the Jedi. He was able to take some time to meet with Lahka and live with her at their estate for a few days. Lahka then joined Gavar and the majority of the Sith in the Tribe in attending Abeloth's arrival planetside at the Tahv spaceport. Later that evening Lahka returned to their estate while Gavar attended a masquerade for Abeloth to which Lahka had not been invited. Gavar spent the night on his ChaseMaster frigate, the Black Wave, rather than returning home; and in the night Abeloth unleashed a powerful attack on the city, leaving much of Tahv in ruins and destroying many of its inhabitants. Despite the fact that Lahka was among those who died, Gavar chose to betray the Tribe and ally with Abeloth.\nLahka was intelligent, patient, and adept at keeping secrets—and those reasons made up for her lack of Force-sensitivity in Gavar's eyes. She was also capable of reading some of Gavar's emotions. Lahka did not fully understand the matters of the Lost Tribe of Sith, but she knew that it was not her place to interfere in their affairs. As such, she did not ask questions of her husband and daughter when they became troubled by Vestara being called to the Circle Chambers. She missed her daughter when Vestara traveled off-planet on a mission to kill the Skywalkers, but she was proud of Vestara's accomplishments. When Gavar told her of Vestara's developing relationship with Ben Skywalker, Lahka suggested that Ben could prove a powerful asset to the Tribe and their family if Vestara swayed him, and when Gavar responded with his fear that Ben might sway her, Lahka stated her faith that Vestara would never betray her family, the Tribe, or the dark side.\nLahka was partial to the Sith Victory flower, and happily crushed them during Abeloth's celebration in order to enjoy their scent. She was exceptionally beautiful—as attractive as the native Keshiri women—and had a soft smile.\nLahka Khai was created by author Christie Golden for her first Star Wars novel, Fate of the Jedi: Omen, the second of nine novels in the Fate of the Jedi series, released July 23, 2009. She received brief mention in the fifth and sixth novels, Fate of the Jedi: Allies and Fate of the Jedi: Vortex, respectively, before making an appearance in 2011's Fate of the Jedi: Ascension, the eighth novel of the series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/44_ABY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Planet/Legends",
  "/wiki/Sith_Saber",
  "/wiki/Gavar_Khai",
  "/wiki/Vestara_Khai",
  "/wiki/Force-sensitive/Legends",
  "/wiki/41_ABY",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Olaris_Rhea",
  "/wiki/Kesh_Sith_Temple",
  "/wiki/43_ABY",
  "/wiki/Skirmish_at_Sinkhole_Station",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Abeloth",
  "/wiki/Destruction_of_Tahv",
  "/wiki/City/Legends",
  "/wiki/Tahv",
  "/wiki/Death/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Omen",
  "/wiki/5000_BBY/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Khai_estate",
  "/wiki/27_ABY/Legends",
  "/wiki/Sith_training",
  "/wiki/Ship_(Sith_Meditation_Sphere)",
  "/wiki/Sith_Meditation_Sphere",
  "/wiki/Circle_of_Lords",
  "/wiki/Circle_Chambers",
  "/wiki/Capital/Legends",
  "/wiki/Takara_Mountains",
  "/wiki/Lost_Tribe_of_Sith_strike_team",
  "/wiki/Ben_Skywalker",
  "/wiki/Nightsisters/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Mission_to_the_Maw",
  "/wiki/Tahv_spaceport",
  "/wiki/ChaseMaster",
  "/wiki/Frigate/Legends",
  "/wiki/Black_Wave",
  "/wiki/Eye/Legends",
  "/wiki/Sith_Victory",
  "/wiki/Keshiri",
  "/wiki/Christie_Golden",
  "/wiki/Star_Wars",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/July_23",
  "/wiki/2009",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/2011",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/Fate_of_the_Jedi:_Abyss"
 ]
}