{
 "name": "Lajaie",
 "display_name": "Lajaie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Lajaie's cruiser",
      "near the Mako-Ta Space Docks"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance High Command",
      "Beta Group",
      "Alliance High Command",
      "Beta Group"
     ]
    }
   ]
  }
 ],
 "content": "Lajaie was a human male who served in the Alliance Military during the Galactic Civil War against the Galactic Empire, first serving as a major within the Alliance to Restore the Republic's Massassi Group, and subsequently serving as a naval commander and commanding officer of Beta Group. Lajaie was killed in action during the Assault on the Mako-Ta Space Docks, when his cruiser was destroyed by the Executor, the flagship of Dark Lord of the Sith Darth Vader's Imperial Death Squadron.\nLajaie, a human male, served in the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. In 0 BBY, shortly before the Battle of Yavin, Lajaie was a rebel officer with the military rank of major, and was present at the Great Temple on Yavin 4 when the schematics of the Empire's planet-killing superweapon, the Death Star, were received by the Alliance. Major Lajaie accompanied General Jan Dodonna, Colonel Feyn Gospic, and others in immediately examining the information in order to devise a strategy to destroy the Death Star. After a weakness was discovered in the Death Star, Lajaie accompanied General Dodonna in his briefing to the rebel pilots on how to destroy the battle station.\nLajaie was present with other Alliance personnel monitoring the battle, which was eventually won when the Force-sensitive pilot Luke Skywalker managed to fire proton torpedos into the station's thermal exhaust port, which destroyed the main reactor and commenced a chain reaction which claimed the station, killing nearly every Imperial who was on board, save for Darth Vader. In the aftermath of the battle, Lajaie was present in a ceremony where Skywalker and Han Solo, captain of the Millennium Falcon, received the Medal of Bravery.\nAfter a failed meeting with Mon Calamari Regent Dors Urtya on Mon Cala in an attempt to recruit the Mon Cala Mercantile Fleet, Lajaie, serving as a naval commander, was present at the Mako-Ta Space Docks in a meeting of Alliance High Command when Chancellor Mon Mothma requested the report on Mon Cala by Leia Organa. As Organa pointed out that Urtya would not revolt against the Empire, Lajaie reacted by stating that it was a shame but also not a surprise that Mon Cala would not rebel, and continued by stating that if a full fleet was impossible to obtain, there were other strategic avenues that could be considered. Organa interrupted, and outlined her plan to rescue King Lee-Char, in order to secure an alliance with the Mon Calamari and add the fleet into their own naval forces.\nEventually, Organa and her team were able to breach a prison on Strokill Prime and find Lee-Char. Too injured to move, they recorded his final words before he was killed by Imperial stormtroopers. Although Urtya was able to recover the recordings from Organa, he sent the message to the Fleet Captains of the Mon Cala fleet, resulting in their mutiny and defection to the Rebel Alliance.\nAfter the successful rebellion, Commander Lajaie was given command of a cruiser that had been refitted for combat by the Kingdom of Shu-Torun, on order of Queen Trios. Lajaie used the cruiser as the flagship of Beta Group, and was present at the Mako-Ta Space Docks during a ceremony celebrating the new Alliance Fleet where rebel personnel and rebel allies where to witness the dispersal of the rebel naval forces.\nAs the ships were ready to launch into hyperspace, an error prevented the launch of the Willard's cruiser, as well as all the other ships that had been refitted with Shu-Torun technology. The fault resulted in the failure of all launches, lost communications, disabled armament, and the ships being unable to launch their starfighters. At the same time, Death Squadron, under the command of the Sith Lord Darth Vader, arrived and fired on the nearest cruiser, General Vanden Willard's flagship Yavin's Hope, destroying it.\nDuring the time since the attack had commenced on the rest of the fleet, Lajaie was almost able to isolate the problem, and found crucial information on restoring the systems of the fleet, although his cruiser was attacked before his starship's systems could return to operational status. After he was informed that the cruiser's shields were failing, he was aware that it was too soon to bring his vessel to operational status, he ordered the evacuation of his cruiser.\nAs he ordered the evacuation, the informed his crew that if anyone was able to survive, that they had to inform the other rebels that the problems were caused by circumvents in the hardware sourced to Shu-Torun systems, and it was still possible that some bypasses were still operational. As the crew evacuated on escape pods, the cruiser was annihilated and exploded into a fireball. Imperial starfighters and turbolasers then focused fire on the pods, destroying several.\nLajaie first appeared as an uncredited Rebel extra in the Yavin 4 scenes of the 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy. In Star Wars Legends, the character's first name was established as \"Evram.\"\nKieron Gillen, lead writer of the Star Wars Marvel Comics series, was the one who came up with killing off Lajaie, as he thought about how the heroes rose through the ranks so quickly.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lajaie",
  "/wiki/Evram_Lajaie",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/1_ABY",
  "/wiki/Lajaie%27s_cruiser",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alliance_High_Command",
  "/wiki/Beta_Group",
  "/wiki/Alliance_Military",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Major",
  "/wiki/Massassi_Group",
  "/wiki/Navy",
  "/wiki/Commander",
  "/wiki/Commanding_officer",
  "/wiki/Death",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Executor",
  "/wiki/Flagship",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Death_Squadron",
  "/wiki/0_BBY",
  "/wiki/Battle_of_Yavin",
  "/wiki/Alliance_officer",
  "/wiki/Military_rank",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Death_Star_plans",
  "/wiki/Planet",
  "/wiki/Superweapon",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Colonel",
  "/wiki/Feyn_Gospic",
  "/wiki/Rebel_pilot",
  "/wiki/Battle_station",
  "/wiki/Force-sensitive",
  "/wiki/Pilot",
  "/wiki/Luke_Skywalker",
  "/wiki/Proton_torpedo",
  "/wiki/Reactor",
  "/wiki/Han_Solo",
  "/wiki/Captain",
  "/wiki/Millennium_Falcon",
  "/wiki/Medal_of_Bravery",
  "/wiki/Mon_Calamari",
  "/wiki/Regent",
  "/wiki/Dors_Urtya",
  "/wiki/Mon_Cala",
  "/wiki/Mon_Cala_Mercantile_Fleet",
  "/wiki/Chancellor_(Rebel_Alliance)",
  "/wiki/Mon_Mothma",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/Fleet",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Heroes_of_Yavin",
  "/wiki/Unidentified_Imperial_base_(Strokill_Prime)",
  "/wiki/Strokill_Prime",
  "/wiki/Stormtrooper",
  "/wiki/Fleet_Captain",
  "/wiki/Mutiny_on_Mon_Cala",
  "/wiki/Kingdom_of_Shu-Torun",
  "/wiki/Queen",
  "/wiki/Trios",
  "/wiki/Unidentified_Mon_Calamari_cruiser_(Geist)",
  "/wiki/Hyperspace",
  "/wiki/Shu-Torun",
  "/wiki/Starfighter",
  "/wiki/Time",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Vanden_Willard",
  "/wiki/Yavin%27s_Hope",
  "/wiki/Cruiser",
  "/wiki/Starship",
  "/wiki/Deflector_shield",
  "/wiki/Escape_pod",
  "/wiki/Turbolaser",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars_Legends",
  "/wiki/Kieron_Gillen",
  "/wiki/Star_Wars_(Marvel_Comics_2015)",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_A_New_Hope_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Star_Wars_(2015)_52",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Rise_of_the_Rebellion_and_the_Battle_of_Yavin",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_ABY",
  "/wiki/Star_Wars_(2015)_48",
  "/wiki/Star_Wars_(2015)_49",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/A_New_Hope_Limited",
  "/wiki/File:KieronGillen-Death-January-10-2019.png"
 ]
}