{
 "name": "Lakwii_Varrscha",
 "display_name": "Lakwii Varrscha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Lakwii Varrscha was a female Human and an officer in the Imperial Navy—she was a tall, muscular woman who seemed diligent but was generally regarded by her superiors to be no more than ordinarily competent.\nEarly in her career, Varrscha had been assigned to Imperial Customs, where she served as the captain of a light corvette. Subsequently, she transferred to the line forces of the Navy, and for several years, she served aboard the Star Destroyer Virulence under the command of Joak Drysso, where she achieved the post of executive officer with the rank of Captain. When Drysso was transferred to command the Super Star Destroyer Lusankya, she was advanced to replace him, and she commanded the Virulence during the Bacta War, until Booster Terrik bluffed her into surrendering at Yag'Dhul Station.\nMost people who encountered Captain Varrscha were left with the impression that she was somewhat uninspired. Mirax Terrik, who had outrun her corvette once, recalled her tactics as completely conventional, while Captain Sair Yonka of the Star Destroyer Avarice noted that the performance of Virulence under her command was unimpressive: in particular, she had failed to improve her TIE fighters' performance when she knew that she would be faced with Rogue Squadron. Fliry Vorru thought that she had risen as far as she had simply by standing at Drysso's side, and was concerned that command of a Star Destroyer taxed her to the limits of her ability. But considering her willingness to surrender the Virulence at Yag'Dhul, another interpretation of her lack of zeal is also possible—Lakwii Varrscha was simply not fully committed to the Imperial service.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Ysanne_Isard",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Light_corvette/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Errant_Venture/Legends",
  "/wiki/Joak_Drysso",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Lusankya/Legends",
  "/wiki/Bacta_War",
  "/wiki/Booster_Terrik",
  "/wiki/Yag-prime",
  "/wiki/Mirax_Terrik_Horn",
  "/wiki/Sair_Yonka",
  "/wiki/Freedom",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Fliry_Vorru",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}