{
 "name": "Lalo Gunn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicBreakout Squad",
      "Breakout Squad"
     ]
    }
   ]
  }
 ],
 "content": "Lalo Gunn was a Human female who served as captain of a freighter known as the Hasty Harpy during the Clone Wars. Around 22 BBY, Gunn and her personal navigation droid Teejay were stranded on Kynachi. Teejay was destroyed by a stray blast and his head along with a wrecked Commando Droid's body was used to construct the only mechanical member of Breakout Squad, Cleaver. She later assisted the self-proclaimed Galactic Republic unit \"Breakout Squad\" led by Nuru Kungarama on a raid on the KynachTech factory prison. Then, Gunn repaid Kungarama by flying him to Chiss space for a negotiation mission.\nLalo was a smuggler and dealt with \"import and export\" as she called it. Around the time of the Battle of Naboo, the planet Kynachi was invaded by the Trade Federation. Lalo had acquired a personal droid called Teejay and a ship called the Hasty Harpy. Lalo had performed some business on Kynachi when she realized the droids had put flight restrictions on everyone, thereby stranding her on Kynachi. Gunn eventually adapted to the planet and opened a restaurant in her ship, the Hasty Harpy. Teejay served as the waiter and cook while Gunn provided the ingredients. During her stay she came to know the locals and surroundings.\nAround 22 BBY she witnessed two of the local Kynachis, Wevil and Namnats hassle with a young blue skinned boy and a dark haired man. The odd pair dismissed the Kynachians with ease which made an impression on Lalo, since she knew Wevil and Namnats were hard to deal with. She assumed it was the smell of the fertilizer bag the man was wearing as a poncho. Gunn seeming interested in the odd pair, took them and their two teammates that were skulking behind them to her ship. The boy introduced himself as Jedi Nuru Kungurama, and the three men were clone troopers of the Republic's clone army, Sharp, Chatterbox and Breaker. After some introductions aboard the Hasty Harpy, they were suddenly attacked by droid commandos. The Clones and Nuru disposed of them with ease, but Gunn's droid Teejay had been wrecked by the commandos. Two of the clones had captured a Duros outside the ship called Cad Bane. He apologized for attracting the droids on the ship, and pleaded for assistance in infiltrating the Kynach Tech factory. To infiltrate the factory they rebuilt on of the droid commandos and installed Teejay's brain system instead. They named the new droid \"Cleaver\". Now with a droid for cover, they entered the Kyncah Tech factory as prisoners. Inside they met the Skakoan, overseer Umbrag who were in charge of the factory. A battle ensued and Umbrag's droids were annihilated but the Skakoan himself escaped. With the factory down and the control tower as well, the clones could call for reinforcements from the Republic. Kynachi was freed from the separatists and Lalo was free to leave.\nGunn and the Breakout Squad traveled to Vaced Spaceport on an assignment to escort commissioner Langu Sommilor to Coruscant. Mandalorian Hudu Shiv was sent to Vaced by Dooku to assassinate Sommilor and just as Nuru Kungurama arrived to greet Sommilor, the assassin shot the commissioner and two pilots. Breaker had been sent to search the trees for an assassin by Nuru Kungurama and was subsequently knocked out and bound by Shiv. Nuru stole a swoop bike and went after the Mandalorian, however he had already fled on his own bike. Gizman, or Gizz, had pursued Nuru out of the spaceport and took control of the swoop. Gizman and Nuru Kungurama chased Hudu Shiv to Shattered Rock where Nuru battled Shiv. Gunn and Breakout Squad arrived in the Hasty Harpy to assist, however, Hudu Shiv escaped using his jetpack. Lalo Gunn destroyed Hudu Shiv's Pursuer-class enforcement ship, however, the Hasty Harpy was very badly damaged and in need of urgent repair, due to the Mandalorian's anti-vehicle missile. Hudu Shiv was not on board the pursuer-class ship as it exploded, and so escaped on a lifeboat.\nLalo Gunn appears in Ryder Windham's Star Wars: The Clone Wars: Secret Missions young readers series, with her picture appearing on the second book.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Breakout_Squad",
  "/wiki/Freighter/Legends",
  "/wiki/Hasty_Harpy",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/2JTJ_personal_navigation_droid",
  "/wiki/Cleaver",
  "/wiki/Kynachi",
  "/wiki/Squad/Legends",
  "/wiki/Mission_to_Kynachi",
  "/wiki/KynachTech_factory_prison",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Wevil",
  "/wiki/Namnats",
  "/wiki/Nuru_Kungurama",
  "/wiki/CT-4012",
  "/wiki/CT-5177",
  "/wiki/CT-8863",
  "/wiki/Cad_Bane/Legends",
  "/wiki/Umbrag",
  "/wiki/Vaced_Spaceport",
  "/wiki/Langu_Sommilor",
  "/wiki/Coruscant/Legends",
  "/wiki/Hudu_Shiv",
  "/wiki/Dooku",
  "/wiki/Mandalorian/Legends",
  "/wiki/Gizman",
  "/wiki/Shattered_Rock",
  "/wiki/Hudu_Shiv%27s_Pursuer-class_enforcement_ship",
  "/wiki/Ryder_Windham",
  "/wiki/Star_Wars:_The_Clone_Wars:_Secret_Missions",
  "/wiki/The_Clone_Wars:_Secret_Missions_1:_Breakout_Squad",
  "/wiki/The_Clone_Wars:_Secret_Missions_2:_Curse_of_the_Black_Hole_Pirates",
  "/wiki/The_Clone_Wars:_Secret_Missions_3:_Duel_at_Shattered_Rock",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/The_Clone_Wars:_Strange_Allies",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}