{
 "name": "Lama_Su",
 "display_name": "Lama Su",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaminoan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.29 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black with white irises"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ruling Council",
      "Galactic Republic",
      "Sith Order",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lama Su was a Kaminoan male statesman who hailed from Kamino—an extragalactic planet—during the last years of the Galactic Republic. Lama Su served as Prime Minister of Kamino and a member of the Kaminoan Ruling Council, where he was responsible for the growing of the clone troopers that formed the Grand Army of the Republic in the Clone Wars and worked with the Jedi Generals who commanded the clone army during the galaxy-wide conflict with the Confederacy of Independent Systems, although he was also unknowingly in league with the Sith Lords who conspired to destroy the Jedi Order through Order 66.\nLama Su would ultimately come to regret his association with the Sith and his involvement in the decimation of the Jedi and the Republic, as the nascent Galactic Empire that rose in their place saw little use for Kamino's cloned soldiers, instead placing more value and faith in the recruitment of non-clone soldiers loyal to the new regime and placing Kamino's economic and political future in jeopardy. Seeing how the situation was slipping away from the Kaminoans, Lama Su worked to maintain Kamino's importance to the New Order but also made plans to smuggle Kamino's most skilled and valued medical and scientific personnel to safety off-planet in case the Empire decided they were superfluous. However, his plans were uncovered by Imperial Admiral Rampart, who subsequently had the Prime Minister detained for treason.\nPrior to the Clone Wars, the Kaminoan government led by Prime Minister Lama Su was commissioned by Jedi Master Sifo-Dyas to create a clone army for the Galactic Republic. Sifo-Dyas was killed soon afterwards by members of the Pyke Syndicate, and Lama Su found himself in league with the Sith Lord Darth Tyranus. From Tyranus, who was posing as a Jedi, he received a genetic template for the clones: a bounty hunter named Jango Fett. He was also given an inhibitor chip from Tyranus that was to be implanted within each clone trooper as a safeguard against betrayal from rogue Jedi. However, the inhibitor chips were designed by the Sith, who programmed the clones to exterminate the Jedi under Order 66. Lama Su was unknowingly being deceived by the Sith.\nA decade after Sifo-Dyas' death, Lama Su was visited by the Jedi Knight Obi-Wan Kenobi, who had come to Kamino in pursuit of Jango Fett and had found his way in by identifying a Kaminoan poison dart. Taun We introduced him to Lama Su and they began chatting. The Prime Minister assumed Kenobi's purpose was to inspect the clone army, and he assured the Jedi it would be completed on schedule. He told Kenobi about Sifo-Dyas and learned of his death from Kenobi. Eager to impress his guest, Lama Su proceeded to show Obi-Wan the Kaminoan combat training and educational facilities of Tipoca City. He then told him about Jango Fett and said that the only thing he asked in return was for a son with no rapid aging.\nAt the start of the Clone Wars, Halle Burtoni bartered her planet's role as the source of the Republic soldiers into a seat in the Galactic Senate and joined the Republic However the death of Jango Fett at the hands of Mace Windu left Lama Su with a limited supply of genetic material to use in the production of new clones. As such, the Kaminoan prime minister was forced to find new ways of resupplying the Grand Army of the Republic, including stretching Fett's genetic template.\nLama Su was greatly disappointed in the troopers his alternative cloning methods produced. When Jedi Master Shaak Ti approached him to discuss with him the failure of Domino Squad in their final test, he suggested its members be terminated. He also talked about how they cloned troopers after Fett's death. Ti refused, saying that they were living beings, not objects. Lama Su expressed his opinion that the Jedi show too much compassion, but said that it was not his decision to make, as the Republic ordered them. Hoping to create more successful soldiers in the future, Lama Su requested a new genetic template be found for them.\nLama Su later went with Shaak Ti to welcome Obi-Wan Kenobi, Anakin Skywalker, and the 501st Legion to Tipoca City. The Prime Minister was surprised to learn that the Confederacy of Independent Systems intended to attack Kamino, despite the Republic Military blockade that surrounded his homeworld. In preparation for the coming battle, Lama Su positioned himself within Tipoca City's central command center.\nNear the end of the Clone Wars, Su was approached by Nala Se, who informed him that Protocol 66 had activated prematurely in the clone trooper CT-5385. Su contacted Darth Tyranus to share this news with him and was ordered to terminate the defective clone so an autopsy could be performed on his body. He was also instructed to remove the clone's bio-chip and send it to Tyranus before the Jedi Order could discover the true nature of the chip.\nIn 19 BBY, following a duel against Mace Windu in his office, Chancellor Sheev Palpatine—the public guise of the Sith Lord Darth Sidious—seduced Skywalker to the dark side of the Force and issued Order 66, leading to most of the Jedi being betrayed or murdered by their clone troopers. Su's clone army was ultimately a pivotal factor not only in the Sith plot for revenge against the Jedi Order, but also in Palpatine's rise to power as Emperor of the first Galactic Empire.\nSoon after, Su, accompanied by Taun We, hosted an inspection visit by Admiral Wilhuff Tarkin in Tipoca City. Tarkin's objective during the visit was to determine the Empire's need for clone troopers following the proclamation of the New Order by Emperor Palpatine at the end of the Clone Wars. When Su protested, arguing the Empire would need more clone troopers to maintain order across the galaxy, Tarkin countered that \"conscription soldiers\" could fulfill that service at half the cost of clones. Su insisted that no recruit could be as skilled or efficient at combat as clones, who were trained from birth to be effective, obedient soldiers. Unconvinced, Tarkin informed the Prime Minister that he would personally evaluate the clones' skillset to see if they were worth the added expenses.\nThroughout the visit, Su worked on convincing Tarkin of the merits of his trained clones versus conscripted soldiers, utilizing Clone Force 99 to demonstrate clone superiority. Tarkin instructed Su to use live fire on the clone squad for a training exercise and though he eventually complied, he expressed reservations over using live for out of concern for the clones' safety as well as the facilities. Ultimately, the squad 99 managed to survive the exercise through improvisation.\nLater, Su, accompanied by Se and her assistant Omega, spoke with Tarkin in one of the clone incubation chambers to discuss the Kaminoans' enhanced clones. Though the Prime Minister suggested that Clone Force 99 could be a potential asset to the Empire, Tarkin was more concerned with their tendency to disobey orders. Se explained that it was a side effect of their genetic mutation as Su asserted it had not impeded the success of their missions, leading Tarkin to question if they completed Order 66. Su assumed from their report that both Depa Billaba and Caleb Dume were reported dead on Kaller but Tarkin revealed that a counter-report from one of their own stated that the Padawan escaped.\nTarkin decided to test the unit's loyalty by sending them to eliminate Saw Gerrera and his people, and to dispatch a probe droid to surveil the operation and were inform they were being sent to eliminate a Separatist force. But the unit discovered they been sent after innocent civilians and did not carry out the mission. Clone Force 99 then defected from the Empire and returned to Kamino to retrieve Omega, Se assisted in their escape by remotely preventing the bay doors from closing. After Clone Force 99 successfully escaped, Se informed Su of their escape as well as the loss of Omega. Under Su's instruction, she agreed to refrain from informing the Empire of what had occurred due to his concerns over the Empire's intentions.\nSome time later after Clone Force 99's escape, Tarkin was still evaluating the proficiency of enlisted troops. Vice Admiral Rampart arrived on Kamino and brought in a new batch of regular troops to serve as a new elite squad. Tarkin wanted to see them in action, much to Lama Su's distaste, who argued that his clone troopers were superior due to their lifelong training as soldiers. Rampart argued that the same skills could be taught to loyal soldiers who willingly supported the Empire. Tarkin ordered Rampart to send the new squad and Crosshair to Onderon to wipe out Saw Gerrera's insurgents, which Clone Force 99 failed to accomplish. Unable to change their minds, Lama Su left the two officers alone.\nLater, Lama Su and Nala Se discussed how the conscription program would make the Kaminoans' operation obsolete, which was compounded by the continuing deterioration of Jango Fett's genetic samples. To ensure their survival and relationship with the Empire, Lama Su stated that they had to implement the next phase by making a superior clone. While Nala Se was concerned that the clones they required would not willingly return to Kamino, Lama Su retorted that they were Kaminoan property, and only one was needed for their experiment.\nAfter Crosshair reported that scrappers on Bracca had reported a sighting of the rogue group 99, Lama Su suggested that they would be brought back to not waste valuable, highly skilled assets. Rampart dismissed the Prime Minister's advice, stating that he had no interest in rogue clones. He ordered Crosshair to destroy the squad, once again to Lama Su's disapproval.\nMuch to Lama Su's alarm, he met with Nala Se to discuss how they could no longer afford to delay their plans to reacquire the subject who was vital to the Kaminoans' contingency plan. By then, he had secretly hired multiple bounty hunters in the hope that one of them would succeed in capturing Omega.\nLater, Cad Bane contacted Lama Su to inform him of Omega's capture. Bane demanded extra payment for bringing her alive, to which Lama Su warned that he should keep her that way.\nOn Kamino, Lama Su held a meeting with Nala Se and Taun We to discuss the retrieval of Omega. Nala Se offered to bring the payment to Bane, to which Lama Su disagreed due to Nala Se's personal interest in Omega and sent Taun We instead to the rendezvous on the Kaminoans' abandoned facility on Bora Vio. Lama Su instructed Taun We to give Bane the payment and bring back their property to a sublevel on Kamino. Once they had extracted the genetic material needed from Omega, she was to be terminated. However, his plan was thwarted by Nala Se who used Fennec Shand to prevent Omega from returning to Kamino. After Omega was rescued by Clone Force 99, Shand offered to continue tracking them, but Nala Se declined, believing that Omega was safe as long as Lama Su did not have her.\nWith their means to acquire Omega gone, the Kaminoans' contingency plan failed along with their hopes of continuing their relationship with the Empire, which terminated all of its contracts with Kamino. After observing the Empire's operation to remove all viable clones from the Kaminoan facility, Lama Su confided to Nala Se his fear that the Empire intended to destroy their people instead of allowing them to continue their work as cloners. He therefore planned to evacuate Kamino's key medical personnel in the hope of continuing their program elsewhere. He entrusted this task to Nala Se, but she was arrested by Rampart while carrying out the Prime Minister's instructions. Feigning ignorance of Nala Se's actions, Lama Su promised to have her punished, but Rampart instead saw value in the skills of a Kaminoan scientist, even if her clones did not impress him. While the Chief Medical Scientist was taken away by Rampart, the admiral stated he had no interest in a politician and had two of his Elite Squad Troopers stalk towards Lama Su in the Prime Minister's reception room.\nAs the overseer of the Grand Army's creation, Lama Su was very proud of his clone troopers and regarded them as one of the finest achievements in his people's history. He also took great pride in his planet's combat training and educational facilities, both of which were instrumental in the development of the clone army. Despite his relationship with the Jedi who commanded the army, Lama Su was mystified by their methods. He regarded the Jedi Order as a cult and also failed to understand why they felt compassion for the clone troopers under their command. Despite being an ally of the Republic, he was primarily focused on the governing of Kamino, but he was also unknowingly a secret ally to the Sith, who deceived him into implanting the biochips in the Clones, which allowed Sidious to defeat and nearly destroy the Jedi, and form the Galactic Empire. When the Galactic Empire was formed at the end of the Clone Wars, Lama Su wanted to do with business with the Empire and use clone troopers for the Empire, believing recruited soldiers were inferior to clone troopers.\nLama Su was a Kaminoan male who stood at 2.29 meters. He was a tall, lanky alien with white skin. His eyes were black and had white pupils. A unique crest topped the prime minister's head, and his nostrils were connected to his upper lip by a thin, \"U\"-shaped slit. Lama Su's hands had three fingers, and his feet were small and hoof-like.\nHe wore white armor that covered his chest and shoulders. A long collar protected his neck, as well as the back of his head. Lama Su's arms, legs, and torso were covered in black fabric, and a purple belt with an orange buckle that appeared around his waist. White, metallic cuffs shielded Lama Su's wrists, and long strips of black fabric with a silver lining and red interior hid his legs from view.\nLama Su first appeared in Star Wars: Episode II Attack of the Clones. Originally intended to be a female character before being changed to a male one at the last second, he was portrayed in the film through CGI and voiced by Anthony Phelan. In Star Wars: The Clone Wars, he is voiced by Bob Bergen who voiced Luke Skywalker in several Star Wars video games.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Lama_Su",
  "/wiki/Lama_Su/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kamino",
  "/wiki/Kaminoan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Ruling_Council_(Kamino)",
  "/wiki/Galactic_Republic",
  "/wiki/Sith",
  "/wiki/Galactic_Empire",
  "/wiki/Politics",
  "/wiki/Extragalactic",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/Prime_Minister",
  "/wiki/Cloning",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_General",
  "/wiki/Army",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Sith_Lord",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi_Order",
  "/wiki/Order_66",
  "/wiki/Stormtrooper",
  "/wiki/New_Order",
  "/wiki/Rampart",
  "/wiki/Jedi_Master",
  "/wiki/Sifo-Dyas",
  "/wiki/Death",
  "/wiki/Pyke_Syndicate",
  "/wiki/Dooku",
  "/wiki/DNA",
  "/wiki/Clone_template",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Jedi",
  "/wiki/Standard_decade",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Taun_We",
  "/wiki/Minister",
  "/wiki/Tipoca_City",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Halle_Burtoni",
  "/wiki/Senator",
  "/wiki/Galactic_Senate",
  "/wiki/Mace_Windu",
  "/wiki/Trooper",
  "/wiki/Shaak_Ti",
  "/wiki/Domino_Squad",
  "/wiki/Soldier",
  "/wiki/Anakin_Skywalker",
  "/wiki/501st_Legion",
  "/wiki/City",
  "/wiki/Battle_of_Kamino",
  "/wiki/Republic_Military",
  "/wiki/Kamino_blockade",
  "/wiki/Homeworld",
  "/wiki/Nala_Se",
  "/wiki/CT-5385",
  "/wiki/Darth",
  "/wiki/19_BBY",
  "/wiki/Duel_in_Palpatine%27s_office",
  "/wiki/Emperor%27s_office",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Galactic_Emperor",
  "/wiki/Admiral",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Emperor",
  "/wiki/Clone_Force_99",
  "/wiki/Omega",
  "/wiki/Depa_Billaba",
  "/wiki/Kanan_Jarrus",
  "/wiki/Kaller",
  "/wiki/Padawan",
  "/wiki/Saw_Gerrera",
  "/wiki/Probe_droid",
  "/wiki/Mission_to_Onderon_(Clone_Force_99)",
  "/wiki/Separatist_holdouts",
  "/wiki/Escape_from_Kamino",
  "/wiki/Bora_Vio",
  "/wiki/Alien",
  "/wiki/Eye",
  "/wiki/Armor",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Anthony_Phelan",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Bob_Bergen",
  "/wiki/Luke_Skywalker",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/Clone_Cadets",
  "/wiki/ARC_Troopers",
  "/wiki/Conspiracy",
  "/wiki/Fugitive",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Aftermath_(episode)",
  "/wiki/Replacements",
  "/wiki/Reunion",
  "/wiki/Bounty_Lost",
  "/wiki/War-Mantle",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/The_Lost_One",
  "/wiki/The_Unknown",
  "/wiki/Orders",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_Art_of_Star_Wars_Episode_II:_Attack_of_the_Clones"
 ]
}