{
 "name": "Lamalla Rann",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Lamalla Rann was a Human female journalist operating on Ord Mantell. She was gathering footage and reporting on the Separatist War at Mannett Point, along with her personal holorecorder, a Human named Waxx. Waxx, however, was persuaded to join the Separatist movement, leaving Lamalla without the holodiscs containing the footage she desired, which contained graphic images of the carnage inflicted by a Separatist attack, or as she described it, \"fantastic, gory stuff.\"\nLamalla, without her footage and without enough credits to bribe the Mantell Army to aid her in retrieving them, turned in desperation to a Republic-allied individual for assistance. She conveyed to the unknown operative that her priority was retrieving the holodiscs rather than rescuing Waxx. When the individual returned and informed her Waxx had joined the Separatists, she seemed unsurprised at the news, remarking that Waxx was easily influenced by what he perceived as noble causes. She later published a holobook based on her time on Ord Mantell, entitled \"Missing the Mannett Point: The Mantellian Civil War Revealed,\" and it became the top-selling nonfiction work of the year. A later release, \"The Soldier, the Scoundrel, and the Stars\", was included on many reviewers' annual must-read lists.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mannett_Point",
  "/wiki/Journalist/Legends",
  "/wiki/Separatist_War",
  "/wiki/Waxx",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Holodisc",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Holobook/Legends",
  "/wiki/Missing_the_Mannett_Point:_The_Mantellian_Civil_War_Revealed",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}