{
 "name": "Lan  (Human)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Lan was a Human male from the planet Alderaan. The day before Alderaan was destroyed by the Galactic Empire's first Death Star, Lan went to Alderaan's sister planet Delaya with his brothers, Mazi and Jez, to watch a smashball tournament. Following his homeworld's destruction, Lan and his brothers resorted to thievery in order to survive. They tried to rob Princess Leia Organa, who was visiting Delaya to help the Alderaanian refugee efforts, but were dissuaded by Ferus Olin, a former Jedi. When Organa was captured by a rogue Alderaanian faction that blamed her for their world's demise, it was Lan's brother Mazi who told Organa's companions where the faction's hideout was. After Organa was rescued, Lan and his friends decided to join the Rebel Alliance as soldiers.\nThe Human male Lan lived on the planet Alderaan during the time of the Galactic Civil War. In 0 BBY, the day before Alderaan was destroyed by the Galactic Empire's first Death Star, Lan went to see a smashball tournament on Delaya—Alderaan's sister planet—with his siblings Mazi and Jez. Despite Lan's young age, Mazi was able to convince their parents to allow them all to go. Their mother, who worried a lot, thought that the three of them were too young to go on their own. However, their father was easily convinced and the three of them made the trip.\nAfter Alderaan was destroyed, Lan and his brothers were left to fend for themselves, surviving on Delaya by becoming thieves. Ferus Olin, a former Jedi and another survivor of Alderaan, tried to dissuade them from turning to crime by giving them various small jobs to earn credits.\nWhen Princess Leia Organa made a visit to Delaya to assist the refugee effort and recruit new members on behalf of the Rebel Alliance, Lan, along with Mazi and Jez, attempted to rob Organa. Han Solo, who was one of the individuals accompanying Organa at that time, tried to placate the orphans but was unsuccessful. The standoff was broken when Olin arrived at the scene and disarmed Mazi—who was holding Organa at knife-point with a vibroblade—by shooting the vibroblade away with his blaster. After being told by Olin that he would stop giving them errands if they continued getting into trouble, Lan and his siblings ran away.\nThe next day, a memorial was held for the ones who died during Alderaan's destruction. Lan and his siblings went to the chamber where the event was held but could not get inside because of the large crowd. Solo, who was also in attendance, spotted the orphans and quickly grabbed Mazi into a hold, making Jez and Lan to come to their big brother's aid. Both boys showed their determination and demanded that Solo let Mazi go despite their obvious fear. Solo, impressed by their bravery, released Mazi and befriended the group, offering food and a chance to go inside the chamber. With their guard lowered, Lan and his siblings narrated the story of how they came to be orphans on Delaya to Solo.\nWhen Organa was captured by an Alderaanian faction that blamed her for the destruction of their world, Lan's brother Mazi provided Solo and Organa's other companions the location of the ringleader's hideout. The information eventually led Solo and the others to successfully rescue Organa from the Empire, to whom she was handed over by the faction for a reward. Olin surmised that the orphans, who were willing to do anything for credits and knew where the faction ringleaders were hiding, might have been hired by the faction to rob and capture Organa previously.\nAfter Organa's rescue, Lan and his siblings spoke with a Rebel recruiter and decided to join the Alliance as soldiers. They eagerly told Solo—whom they had grown quite fond of—the news, hoping to impress him. The orphans were scheduled to be shipped that night and Solo wished them luck, although he thought Lan and his brothers were too young to serve in the Alliance.\nDespite his young age, Lan displayed bravery and loyalty to his brothers. When Han Solo confronted Lan and his siblings on Deyala, Lan, along with Jez, refused to leave Mazi, who was in Solo's grasp, behind. It was Solo's observation that they were terrified of him and were putting on a brave front, which earned his grudging admiration. As a result of Alderaan being destroyed, Lan and his brothers became orphans overnight and had to look out for each other. Mazi became the unofficial leader due to his age, and Lan, being the youngest of the three, started looking up to Mazi with something close to hero worship. When Solo did not turn them in to the authorities for trying to rob Organa, the orphans began yearning to impress the smuggler.\nLan was a character created by author Alex Wheeler for the 2008 novel Rebel Force: Hostage, the second volume in the Star Wars: Rebel Force series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Lan_(disambiguation)",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Delaya/Legends",
  "/wiki/Mazi",
  "/wiki/Jez_(Human)",
  "/wiki/Smashball/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Mission_to_Delaya",
  "/wiki/Ferus_Olin",
  "/wiki/Jedi/Legends",
  "/wiki/Alderaanian_faction",
  "/wiki/Unidentified_school_(Delaya)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Lan%27s_mother",
  "/wiki/Lan%27s_father",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Han_Solo/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Memorial_service_on_Delaya",
  "/wiki/Unidentified_chamber_(Delaya)",
  "/wiki/Foodstuff/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Alex_Wheeler",
  "/wiki/2008",
  "/wiki/Rebel_Force:_Hostage",
  "/wiki/Star_Wars:_Rebel_Force",
  "/wiki/The_New_Essential_Chronology"
 ]
}