{
 "name": "Landonis_Balthazar_Calrissian",
 "display_name": "Landonis Balthazar Calrissian",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Socorro"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 43 BBY",
      "Socorro"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.77 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "79 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Calrissian family",
      "Crimson Dawn",
      "Alliance to Restore the Republic",
      "Gold Squadron",
      "Gold Squadron",
      "New Republic",
      "New Republic Defense Force",
      "New Republic Defense Force",
      "Uprising",
      "Calrissian Enterprises",
      "Resistance",
      "Citizens' Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Landonis Balthazar \"Lando\" Calrissian was a human male smuggler, gambler, and entrepreneur who became Baron Administrator of Cloud City and, later, a general in the Rebel Alliance. Born on Socorro, he was the owner of the Millennium Falcon before losing it to Han Solo in a game of sabacc on Numidian Prime. Afterward, Calrissian put an end to his days as a smuggler and became an entrepreneur, setting up a small mining operation on the planet Lothal before eventually becoming the leader of Cloud City in the skies of the planet Bespin.\nDuring the Galactic Civil War, Darth Vader arrived on Cloud City to lay a trap for his son, Luke Skywalker. As part of the trap, the Dark Lord of the Sith forced Calrissian into tricking a group of Rebels, including Solo and Princess Leia Organa, leading them to Vader himself. Though Vader promised to leave Cloud City without an Imperial presence, Calrissian felt the deal had been altered to the point where he could no longer tolerate it. Calrissian alerted his citizens to the Galactic Empire's presence and impending occupation and ordered an evacuation. He helped the Rebels try to rescue Solo, who had been frozen in carbonite, from Boba Fett, but the bounty hunter escaped.\nCalrissian joined the Rebel Alliance and set out to find Solo. After locating him in the palace of Jabba the Hutt on Tatooine, Calrissian aided in his rescue. The Rebels returned to the fleet, and Calrissian became a general, volunteering to lead the assault on the DS-2 Death Star II Mobile Battle Station during the Battle of Endor. During the battle, he piloted the Millennium Falcon into the battle station's core, firing the shot which destroyed it.\nIn the years of peace after the Empire's dissolution, Calrissian started a family and fathered a daughter named Kadara Calrissian. However, while she was only an infant, his daughter was kidnapped by the First Order. Six years later, he embarked on a quest to the desert planet of Pasaana with Luke Skywalker to find answers about the growing darkness in the Force, but failed to uncover anything. Seeking to bury the pain of those memories, Calrissian settled on Pasaana and led a solitary lifestyle where he was known as the \"Hermit\" to the Aki-Aki of the Lurch Canyon. He lived alone for some years while keeping contact with the Solo family and was later asked by Organa's Resistance for his aid in the war against the First Order.\nIn 35 ABY, Lando helped the Resistance and reunited with his old friend, Chewbacca. Calrissian played one more role in the fight for galactic freedom as he brought an assembled Citizens' Fleet to reinforce the Resistance at the battle at Exegol, from which the Resistance emerged victorious.\nA member of the Calrissian family, Landonis Balthazar Calrissian, otherwise known as \"Lando\" Calrissian, was born on the planet Socorro. During his youth, he became a smuggler and a gambler, excelling in a card game known as sabacc. He traveled throughout the galaxy and piloted a freighter called the Millennium Falcon, which saved his life on numerous occasions. Sometime before 10 BBY, Lando won a subtropical moon in the Oseon Belt during a game of sabacc. Lando also developed a partnership with L3-37, a custom self-made piloting droid.\nDuring his time with L3, Lando nearly lost her to a Hutt after making a bad bet in a game of sabacc on Gonda. At one point, Calrissian was involved in an incident with a Dawinian and their companion. He also came to meet the Tonnika sisters, even showing Brea Tonnika how to work the controls on the Falcon. At another point, Brea and Senni Tonnika made a mess of the room they were staying in on the city-world of Coruscant in order to get back at Calrissian.\nSometime prior to the Battle of Yavin, Lando and L3-37 were ambushed in the Halthor sector when an Imperial interdictor dropped out from hyperspace. As a result of the ambush, Calrissian lost a majority of his shipment of walkers that he acquired from an Er'Kit arms dealer in the Noonian sector. Lando also had dealings with Crimson Dawn on Felucia. He completed his debt to Crimson Dawn and its leader, Dryden Vos. At another point, Calrissian visited Pantora and successfully convinced Imperial Vice Grand Administrator Prita Sven to let him leave the planet with a freighter full of poached forlyn carcasses.\nCalrissian and L3-37 at some point was arrested for smuggling and was sent to the planet Hynestia. Lando and L3 was asked by Queen Forsythia Jin of Hynestia to deliver an artifact to the Galactic Empire for making up for a gherlian fur failed delivery. Princess Rinetta Gan knew about the real purpose of the artifact from her teacher Zel Gris. It was supposed to function as an energy source and make up for the lack of sunlight on the planet Livno III. Without it, Livno III would fall to ruin and destruction. Rinetta tried to force Calrissian and L3 to comply with her new orders after sneaking onto the Millennium Falcon as a stowaway. Her plan failed as Calrissian traveled to Neral's moon to settle a debt with Ne'eda Frip. When the exchange went wrong and escaped but he was captured by Queen Forsythia again. Queen Forsythia put Calrissian and L3 in jail. Rinetta freed Calrissian and L3 again. She wanted them to help her return the artifact to Livno III. They all escaped Hynestia and had to defeat Ne'eda's starships before making the jump to Livno III. After returning the artifact to Livno III, they put the princess Rinetta back to Hynestia. Queen Forsythia pardoned Calrissian and L3 afterwards.\nCalrissian later smuggled weapons to Petrusia after the Empire seized control of it. Following that operation, Calrissian considered turning the Falcon into a casino, despite L3's reservations about it. He also started to write the Calrissian Chronicles to show the galaxy his prodigiousness. Calrissian and L3 took the Falcon to Batuv where he tried to by a new cape from Borkus until he met the bartender Kristiss. She told Calrissian of her people's plight and status as slaves at the Imperial outpost on Kullgroon. Kristiss asked for his help in arming her people for 1,000 credits up front. Despite his reservations, Calrissian decided to speak with her and have a drink with her.\nCalrissian was confronted by Brushaun, who believed that he cheated him out of 2,000 credits in a card game on Canto Bight. Calrissian was saved by Kristiss, who offered him the credits to pay off Brushaun and more if Calrissian helped her people. Calrissian spoke with L3 about this mission and knowing he would be a dead man, Calrissian accepted Kristiss' mission. Enroute to Kulgroon, the Falcon came under attack by several TIE fighters. Calrissian and L3 were able to lead the TIEs to a moon, where he was able to pick them off before they arrived at Kullgroon.\nCalrissian powered the Falcon down in order to appear as space junk in order sneak past the Empire. As the Falcon descended into Kullgroon's atmosphere, he and L3 were able to pilot the ship in to the wastelands. Calrissian, Kristiss, and L3 made their way towards the camp. After Kristiss got herself captured by a pair of stormtroopers, Calrissian considered abandoning the mission but L3 convinced him to stay. He came under attack by some outlaws and starfighters. Calrissian was able to find a abandoned star fighter and attempted to evade them but he was shot down and taken prisoner by the outlaws.\nThe outlaws' leader, Batalla, remembered Calrissian from Calladus Festival, where he took the bulk of the Zakku Rain Cartel's credits. Calrissian said it was actually Batalla's prize Sharropon. He tried to convince Batalla that he was on vacation and was visiting a friend. Batalla considered handing Calrissian over to one of his enemies for a king's ransom and had Calrissian taken to a jail cell. When a droid came with food, Calrissian was able to trick the droid and disable it. As he made his escape, Calrissian contacted L3 for a pick up. However, L3 was busy looking for Kristiss. He ran into Batalla's outlaws who threw into a arena where he fought against several members of the Zakku Rain Cartel, Murkel Kev, Cantor Zain, Kawal Tane, and Siswan, until L3 and the Falcon arrived. However, L3 wanted to pick up Kristiss despite Calrissian's protests. The Falcon came under attack by an indigenous creature, but Calrissian and L3 was able to steer past them. He contacted Kristiss to arrange the weapons drop off before L3 picked up several TIEs closing in on the Falcon.\nCalrissian flew the Falcon low into the wastelands' canyon, hoping to fool the TIEs into believing that the Falcon had crashed. Calrissian was able to cause a explosion that sealed off the canyon from the TIEs. He took the Falcon to a sewage expulsion port. As he made his way through the port, Calrissian was confronted by several creatures and shot at them. He was later confronted by the creatures mother, but was able to kill it. Calrissian was able to reach a control station and told L3 to hack into the mainframe to find Kristiss and disable Level 7 to 9's security monitors. Calrissian met up with Kristiss and her father. After rallying the other Petrusians to take arms against the Empire, despite their resistance to warfare, Calrissian and the slave made their escape to the sewage port and met up with the Falcon. After the slaves armed themselves, Calrissian and Kristiss led them against the stormtroopers.\nCalrissian and the Petrusians fought the outpost's stormtroopers. When L3 told him that several TIEs were returning to the outpost, Calrissian believed it was time for him to retreat when the Petrusians were losing their battle. However, Kristis reactivated hundreds of derelict droids to help them win the battle. Calrissian and Rythus charged the stormtroopers and saved Kristiss from them. He and Kristiss used a cord to swing over the stormtroopers. He met up with L3 and saw the stormtroopers taking the Falcon. After the battle, Calrissian and L3 met up with Kristiss and the slaves as they boarded an Imperial shuttle. He accepted a ride from Kristiss and her father, who gave him his payment. Calrissian learned from L3 that the Falcon was taken and impounded on Vandor. A week later, Calrissian and L3 found the Falcon on Vandor. There, he decided to go into early retirement and play sabacc at the Lodge.\nDuring Lando's retirement on Vandor, Qi'ra, who was an old acquaintance of Lando, and her comrades, Tobias Beckett, Han Solo, and Chewbacca, needed a fast ship in order to steal unrefined coaxium from the Pykes on Kessel for Vos. Qi'ra suggested they search for Calrissian, and the group found him hustling several bar patrons at sabacc by hiding a card up his sleeve. Solo joined in the game, and the stakes soon became Lando's Falcon against Solo's VCX-100 light freighter. Solo produced an impressive hand that caused the other bar patrons to erupt in applause, but Calrissian produced a superior hand by cheating. Calrissian inquired where Solo's ship was, but Qi'ra intervened, explaining the situation. Calrissian agreed to pilot the Falcon for the heist, in exchange for a 25% cut, negotiated down to 20% by Beckett.\nAfter jumping to hyperspace, L3-37 plotted a course to Kessel that she implemented after admonishing Calrissian for flirting with Solo instead of flying. On Kessel, Calrissian remained aboard the Millennium Falcon during the heist and updated his autobiography. When Solo, Qi'ra, Chewbacca, Beckett, and L3 returned with the coaxium, Calrissian helped lay down covering fire against the Pykes until L3 was shot. Calrissian attempted to save L3, but was shot in the arm, and it took the efforts of Solo and Chewbacca to save him and L3. Aboard the Falcon, L3 died in a distraught Calrissian's arms. Due to his injury, Calrissian reluctantly allowed Solo to pilot the Falcon off Kessel.\nThe crew encountered an Imperial blockade when departing Kessel, causing Solo to divert his course into the dangerous maelstrom. Calrissian retrieved L3's central processor and plugged it into the Falcon's navicomputer in order to plot a course out of the maelstrom, in which navigation was otherwise impossible. The Falcon crew encountered a massive space creature, and the Maw, a powerful gravity well. Solo launched the Falcon's escape pod into the gravity well, causing the creature to follow it and become trapped. The Falcon became trapped in the gravity well, only escaping when Beckett used a drop of coaxium in order to give the Falcon the power to escape.\nWhen the crew arrived at the refinery on Savareen in order to refine the coaxium, Calrissian was furious with Solo for the damage sustained by his beloved ship despite their miraculous escape. He abandoned the others in the Falcon when Enfys Nest and her Cloud-Riders arrived on Savareen to confront Beckett.\nSolo and Chewbacca later tracked Calrissian to Numidian Prime, where he was once again hustling others at sabacc. Solo swiped Calrissian's spare card when he greeted him, and won the Falcon in a rematch, leaving with it. At some point later, Solo and Calrissian's lives again intertwined in an event that the Tonnika sisters recalled as the \"Lando ordeal.\" The ordeal was Solo's idea, but he blamed the sisters for the outcome. Calrissian's eventual business partner, Lobot, also became familiar with Solo and the way he flew.\nAt one point, Calrissian met Kaasha Bateen, who was serving within the Free Ryloth Movement during the Pasa Novo campaign, where the two developed romantic feelings for each other.\nAt Azmorigan's recommendation, Calrissian was hired by Vizago to assist him with recovering one of Maz Kanata's treasure troves that was hidden on Seylott. On the planet, they were confronted by Black Sun thugs who had it locked down. Calrissian was able to escape with the Smuggler's Guide by claiming he was just hired help and that Vizago and Azmorigan were the brains of the operation. Afterword, he went to the Spiran mineral spas to recover and read the book. The Smuggler's Guide was stolen from him by a Rybet thief nicknamed \"Sticky Fingers\" after he was beatean up by the Esoomian brawler Bumblethunk, and eventually came into the possession of Latts Razzi.\nAfter losing the Falcon, Calrissian put an end to his days as a smuggler. He fancied himself a respectable businessman, and referred to himself as a \"galactic entrepreneur.\" At some point Calrissian met a criminal known as Azmorigan, who introduced him to Cikatro Vizago, a Devaronian crime lord who operated on the Outer Rim planet of Lothal.\nLater, Calrissian purchased a plot of land from Vizago on Lothal, on which the former smuggler intended to begin mining precious minerals. In order to do so discreetly, without attracting the attention of the Empire due to Imperial mining regulations, Calrissian planned to acquire a puffer pig from Azmorigan; puffer pigs could smell valuable minerals and could do the same job as twelve mining scanners. He required a ship that could evade the Imperial blockade set up around the planet; Calrissian attempted to smuggle mining equipment onto Lothal but was stopped by the Empire.\nCalrissian found such a ship after playing a game of sabacc in Jhothal, a settlement on Lothal. He played the game in Old Jho's Pit Stop, competing against Tsoklo and Garazeb Orrelios, the latter of whom was a Lasat crew member aboard the Ghost, a ship operated by a band of rebels on Lothal. Orrelios believed he had the upper hand and bet his crew's astromech droid, C1-10P, but Calrissian beat his hand by using an Idiot's Array. The droid, nicknamed Chopper, therefore belonged to Calrissian, but he agreed to give the droid back and pay the rebels much-needed credits if they assisted him on an operation—which, unknown to them, was the acquisition of the puffer pig. The crew was reluctant to trust Calrissian, but they needed the credits and wanted Chopper returned to them, so they agreed; Calrissian spent much of the time using a divide and conquer strategy, trying to play the rebels against each other so he could accomplish his goals. During the trip to rendezvous with Azmorigan, Chopper gave Calrissian a tour of the ship, where he admired the artwork of Sabine Wren, a Mandalorian artist and member of the crew. Calrissian used this as part of his strategy, flattering the Mandalorian's work in order to make himself look good.\nOnce the Ghost arrived at the rendezvous, the ship docked with Azmorigan's vessel, Merchant One. Calrissian and the crew's leaders, Hera Syndulla and Kanan Jarrus, boarded Merchant One, and Calrissian told them to follow his lead. Calrissian also hinted that the ship had escape pods—a coded message to Syndulla, whom he intended to hand over to Azmorigan as payment for the puffer pig, and he knew that she would need a way to escape the vessel. Despite Jarrus' protests, Syndulla played along once Calrissian offered her to the crime lord, and Azmorigan gave Calrissian the puffer pig, which was locked in a crate. Calrissian and Jarrus returned to the Ghost, where Calrissian explained that he expected Syndulla to use an escape pod to leave Merchant One—which she did, returning to the Ghost and attracting the ire of the crime lord. Once Syndulla was aboard, and had given Calrissian a piece of her mind over the betrayal via a knee to the groin, the Ghost jumped back into hyperspace, leaving Azmorigan behind them.\nCalrissian showed the crew the puffer pig and warned them not to let it out of its cage, as it would expand into a larger creature if it was startled. Orrelios and fellow crew member Ezra Bridger ended up letting it out, and the pig ran throughout the Ghost before being so startled that its size increased and it became stuck in one of the ship's hallways. This proved potentially problematic once the Ghost returned to Lothal, where they needed to slip through the Imperial blockade; Syndulla, the ship's pilot, was stuck on the other side of the pig, so Jarrus would need to pilot the vessel himself. Calrissian asked Chopper, who only responded to Calrissian's commands, to fix the mechanism that would allow the Ghost to mask its signature and slip past the blockade. Chopper was able to do so and the ship nearly made it through the blockade, but the pig expanded again, knocking Orrelios into the controls that allowed the ship's signature to remain masked. The Empire detected the Ghost as a rebel vessel and sent a group of TIE fighters in pursuit, which the Ghost was able to destroy.\nThe crew made their way to the farm that Calrissian purchased from Vizago, where Calrissian explained that his plan was to use the puffer pig for mining. They were confronted by Azmorigan, however, who had anticipated that Calrissian would return to the land. This led to a shootout between the rebels and Azmorigan's forces, one that ended when Azmorigan threatened to kill Orrelios if they did not hand Calrissian over to him. Syndulla refused, and Chopper—who stole a crate of fuel for the Ghost and returned to the ship—fired the cannons on the Ghost at Azmorigan, giving Orrelios a chance to gain an upper hand and hold Azmorigan at gunpoint. Syndulla demanded that the crime lord leave, a demand that he acquiesced to. With Azmorigan gone, Calrissian claimed that he did not have the credits that he owed the rebels, but he did return Chopper to them. Nonetheless, Syndulla held Calrissian in her debt, though what he did not reveal was that he knew Chopper had stolen the fuel, which was why he did not give them any credits. He did, however, believe that he would one day meet the rebels again.\nCalrissian and Rikarda were traveling to the planet Klonoid, aboard the Stellar Sun. During the jounrey, his droid W1-LE, who he had left to watch over his puffer pig and the farm, said that the farm was attacked by raiders who stole Calrissian's pig. Calrissian found out it was the Varluk Organization and asked Rikarda to set course to their headquarters which was located on Zyzar.\nAfter arriving, Calrissian tried to enter the headquarters through a window but was seen by to patrol men. Calrissian paralyzed and shot the patrol men and changed into one their uniforms. After entering the complex, he discovered all the rooms were empty but eventually found his pig in a cage. When trying to free her, he was captured by more patrol men and was sent to the companies leader, Ango Croom.\nCroom explained to Calrissian that he was tired of waiting for him to return his debt, and decided to do it for him, by stealing his pig. Later Calrissian began to pull his pig out of the hands of the patrol men and the pig increased size, throwing the patrol men to the ground. As he was escaping, Calrissian threw a hologram of locations of raw materials in a room so which the Varluk Organization could find it, which meant Calrissian could pay his debt to the organization. Later beyond the complex, Rikarda picked him up on the Stellar Sun and they escaped.\nCalrissian later came into contact with the rebels again some time later. After the rebels destroyed the Sovereign, the personal Star Destroyer of Grand Moff Wilhuff Tarkin, the Imperials tightened security on Lothal. The rebels returned to Lothal after having been away from the planet, where they were pursued by numerous Imperial agents: including Darth Vader, the Dark Lord of the Sith. Vader ordered that no ship could leave Lothal, leading the rebels to contact Calrissian to ask for his assistance in smuggling them off-planet. He spoke to them via hologram, as he was not on Lothal, but nonetheless agreed to help them in exchange for three military-grade shield generators. With the deal having been made, Calrissian ordered his personal droid, W1-LE, to assist the rebels with the masking transponders that would trick the Empire into pursuing false signals from their stolen Imperial shuttle. The rebels successfully escaped Lothal.\nCalrissian later traveled to the planet Tyegin where he was part of a high-stake sabacc game taking place in the lead car of the Exas Jewell, a luxury train. During the time, Calrissian was posing as the train's designer, Shen Kanton. The other players of the game were D'Lina, Prince Baj, and Rakan. Calrissian eventually made a big win. Calrissian planned to leave the Exas Jewel before anyone figured out who he really was. However, the other players start to see through his scheme, because Kenton, as the designer of the train, was supposed to ride to the end of the line and host a grand reception. Calrissian attempted to smooth-talk his way out of the situation, but the conversation was interrupted by a sudden explosion at the front of the luxury train.\nA pirate gang which consisted of Zira, Grillo, and Shelvy blasted their way through the door. Grillo then destroyed the train's controls and the three pirates escaped the train on jetpacks with stolen riches. Right before they went, Zira offered Calrissian to come with them but he refused. When the pirates left, the people turned to Calrissian for leadership, still believing he designed the train. They decided to try and unhook the engine. The rest of the train stopped while the engine still went on\nLater, Calrissian ordered the people to grab whatever so they could carry it and take it all toward the train car's open front end in order to disrupt its magnetic field. Baj attempted to dump the train car's dealer droid out but was stopped by Calrissian told him otherwise. The considerable amount stuff up underneath the front of the train car ended up creating enough drag to slow it down. The big dining train car was still coming fast. It slammed into the back of the other cars. This sent the prince falling forward out of the train car. Calrissian then saving his life. When the Exas Jewel finally stopped, Tyegin's law enforcement landed close by and rescued them all.\nIn the time following the Battle of Yavin, which saw the Alliance to Restore the Republic destroy the DS-1 Death Star Mobile Battle Station, Calrissian was playing a game of klikklak with Jaff Basan in the illegal casino owned by Luck Luck Freidal. Before the game, which Calrissian was certain he was winning, could end, the Empire raided the casino and shut it down. Traveling to a cantina to reunite with Lobot, Calrissian learned about the Battle of Yavin, watching a DarkNet recording leaked by the Rebels.\nTo his surprise, he saw the Millennium Falcon enter the fight. Asking to watch it again, he was certain the ship was being piloted by Solo. Surprised that Solo was fighting for what he had written off as a lost cause, Calrissian toasted to Solo before asking Lobot to shoot him if he ever tried to do something similar. Calrissian then sat, drinking drinks he could not currently afford and pondering what had made Solo join the Rebels.\nSana Starros and Calrissian traveled to Coruscant to help Starros crank a scam with thirteen crates of Imperial weapons. Calrissian arranged for them to meet with an Imperial officer, where Sana told them that Krawg pirates had the crates. For more information, she took 20,000 credits, in addition to 5,000 that she received from the pirates for selling them one box.\nAfter leaving Coruscant, they went to the planet Tatooine, to the palace of Jabba Desilijic Tiure. There, Starros disowned from the common past with Calrissian and also reported for 20 thousand credits, who had the thirteenth box of weapons. She herself had stolen it from Jabba, but she stated that the Krawg had done it and successfully completion of their transaction.\nWhen leaving Tatooine, the smugglers were attacked by a ship of Krawg who found out that she had deceived them. Eventually the Empire arrested the pirates and Calrissian and Starros managed to escape. They later traveled to Nar Shaddaa where they had dinner before Calrissian left.\nPrior to becoming the administrator of Cloud City, Calrissian was a self-described opportunist trying to \"make his way\" through an uncaring universe. Calrissian was able to make a living by illegally acquiring and redistributing rare or valuable goods. However, due to Calrissian's penchant for gambling, he and his business partner Lobot were in deep with the wrong people. After convincing Moff Ssaria, also known as the \"fiend of Castell,\" into parting with a valuable and expensive trinket, Calrissian rendezvoused with Lobot at a cantina. After having had a few drinks, Calrissian was informed that Papa Toren, the individual who had loaned him money, was ready to see him. Calrissian sought to square away his debt by handing over the trinket to Toren, but the loan shark rejected to honor their prior arrangement. Instead of clearing the smuggler's debt, Toren offered to lower Calrissian's debt by ten percent.\nOutraged by the offer, Calrissian claimed this was not the deal they had agreed upon. Toren argued that if Calrissian had any qualms about the deal, he should take it up with the Imperials, who had taken his property from him in the first place. Toren argued that had Calrissian used the time he had been given to pay off the debt, Calrissian would not be in his current predicament of owing a vast sum of credits, with little-to-no time to pay it off. The loan shark suggested that if the smuggler was sincere and adamant about clearing his debt, he would do so, provided Calrissian agreed to do a job for him. After leaving the cantina, Calrissian and Lobot got into a heated exchange. Angry at the fact that Calrissian had accepted the deal, as well as Toren's gall, Lobot argued that Calrissian should have stood up to Toren. Calrissian countered by explaining that only people with no imagination use blasters. If they tried to harm Toren, a bounty would be placed on their heads, adding to their current troubles.\nInstead of using violence to accept the deal, Calrissian insisted that the job would be quick. It would not only clear their debt but would also put them ahead. Although Lobot was concerned about their chosen dangerous lifestyle, Calrissian promised his friend that they would no longer accept high stakes work after completing the job. Having acquired the services of Aleksin and Pavol, in case the plan required the use of force, Calrissian and Lobot went to speak to Sava Korin Pers, a former antiques dealer and professor. Calrissian attempted to make good on a promise to Korin, to pay her back for the loss of the woman's eye. Korin argued that she could not think of a reason why she would ever work with Calrissian again, until she saw Toren's plan and what they were going to steal. According to the plan, Calrissian and company were to steal a pleasure craft being refitted at Sienar Fleet Systems Orbital Shipyard CC-24.\nAdhering to Toren's plan, Calrissian and his crew donned stealth suits and infiltrated the shipyard. They managed to overpower the stormtrooper sentries and escape in the stolen ship. After taking off, Calrissian and Lobot discussed the fact that the ship that they had stolen seemed to be fairly advanced, specially modified. Lobot asked whether his friend could activate the hyperdrive. Calrissian, however, assured Lobot that he could do so only after the ship escaped the planet's gravity well. Unknown to Calrissian and his crew, they had stolen the Emperor Palpatine's personal luxury yacht, Imperialis.\nBefore they could jump into hyperspace, Calrissian and Lobot found their path blocked by three Imperial Star Destroyers. Calrissian was surprised that the Empire would dispatch such resources and realized that the ship was worth a lot. After the Imperial commander Commodore Idel destroyed Shipyard CC-24 for failing to respect the Emperor's property, he deployed a pair of gravity mines to disable the yacht. However, the Imperialis's advanced automated defenses incinerated the bombs. An amazed Calrissian then instructed Lobot to power up the hyperdrive.\nKorin then confronted Calrissian and asked what he had gotten them into. Based on the fact that the Imperials had deployed gravity mines, Calrissian deduced that the Empire wanted to capture them because there was something irreplaceable and priceless aboard the ship. When two of the Star Destroyers trapped the Imperialis in their tractor beams, Calrissian devised a trick escape maneuver. He got Lobot to feed the coordinates of the tractor beams into his piloting computer. Lobot and Aleksin were skeptical about Calrissian's plan to fly into the beams but Korin convinced the others to trust him. Flying the Imperialis, Calrissian locked Captain Conro's Star Destroyer's tractor beam onto Captain Shan's ship. This collision damaged the two Star Destroyers, allowing Calrissian and his crew to flee into deep space.\nAfter escaping the Star Destroyers, Lobot thanked Calrissian for his dangerous maneuver. Calrissian then proposed to Korin that they divide the Imperialis's treasures among themselves and give the ship to Toren. When Calrissian asked Korin what they stole, she replied that the ship was full of treasure. After touring the ship's hallways, they reached the Imperialis's central chamber. Lobot managed to access the chamber with his cybernetic headset but was impaled in the gut by a pair of Imperial Royal Guards.\nAs Lobot succumbed to his injuries, his implants began to take over his mind. With Korin's help, Calrissian brought the wounded Lobot to the ship's medical bay while Aleksin and Pavol fought the Royal Guards with knives. Meanwhile, the Emperor dispatched the bounty hunter Chanath Cha to recover his ship. He supplied her with the modified Star Courier Scimitar, which was capable of tracking the hyperspace signature of starships. While Lobot recuperated inside a bacta tank, Korin told Calrissian that they had encountered Imperial Royal Guards. Based on the ship's opulent treasures and the Royal Guard's presence, Korin deduced that the stolen ship belonged to the Emperor himself.\nCalrissian was unwilling to listen to Korin's admonition and told him they were going to help the twins. Calrissian and Korin found an armory and helped themselves to some blasters. When they returned to the central chamber, they discovered that Aleksin and Pavol had killed the Royal Guards. While Calrissian complimented the twins, Korin discovered that the guards had mysteriously been corrupted by something in the valuable chamber. Calrissian and his companions discovered that the central chamber stored several Sith artifacts including the ancient mask of Lord Momin. Not realizing the danger, Calrissian quipped that the treasures they found could make up for Korin's lost eye.\nWhen Calrissian asked how much the treasures in the central chamber were worth, Korin recognized that these artifacts belonged to the ancient Sith Lord Darth Momin, a Sith sculptor whose works were believed to be lost. While Calrissian and Korin discussed their plans to sell the merchandise, Aleksin gazed into the Sith helmet. He grabbed a double-bladed lightsaber and sliced off his twin Pavol's lower right arm. Taken by surprise, Calrissian and Korin managed to exit the central chamber and seal the door. However, Pavol was left inside with the corrupted Aleksin.\nIgnorant of the Sith and their history, Calrissian believed that Aleksin had double-crossed them. However, Korin speculated that Aleksin had been corrupted by the Sith artifacts, based on her research into Sith lore at the University of Bar'leth. She deduced that the Royal Guards had been corrupted by their proximity to the Sith objects in the central chamber. Calrissian complimented Korin for being a \"fascinating\" lady but dismissed the Jedi and Sith as superstition. All that he was concerned about was that one of his team members had gone nuts and chopped off the arm of his companion. Calrissian also wanted to get back into the chamber and help Pavol.\nKorin replied that she was leaving the ship in an escape pod and marveled that Calrissian cared for others for a change. Unknown to Calrissian and his companions, Cha had infiltrated the ship. She was a former romantic interest of Lobot. When Calrissian objected to leaving Pavol behind, Korin warned him not to underestimate the powers of the Sith. Calrissian refused to leave his friend Lobot behind. Before the argument could escalate, the two heard over the intercom that the Imperialis's escape pods had been disabled.\nDespite Calrissian's objections, Korin headed to the bridge to reactivate the escape pods. However, she was held at gunpoint by Cha, who had disabled the escape pods. Calrissian went to confront the intruder only to discover that it was Cha. After embracing, Cha chastised Calrissian for stealing the Emperor's yacht. She recounted that the Emperor had sent her to kill whoever took his ship. If she was unable to do that, he had instructed her to destroy the ship. Cha warned Calrissian that the only cargo that the Imperialis carried was death.\nRecalling the Emperor's orders to kill the intruders or to destroy the ship, Cha opted to follow the second option since she was unwilling to hurt her former friend. Calrissian tried to reason with her but she pulled out her blaster and warned him that plans get people killed. Calrissian then tried to enlist Cha's help in dealing with Aleksin. He also suggested letting Korin and him escape in a few escape pods with some choice items while she destroyed the ship. Cha rejected that offer on the grounds that Palpatine would notice any choice items turning up on the black market. Unwilling to risk trouble with the Empire, Cha insisted on proceeding with her plan. However, she agree to ferry Calrissian and Korin to anywhere they wanted with her ship.\nCalrissian then mentioned that he could not risk bringing his friend Lobot out of the bacta tank to avoid the danger of the implants taking over his mind. He reminded Cha that she once had a relationship with Lobot. Cha reluctantly agreed to help. However, they were then cornered by the corrupted Aleksin and Pavol, who were under the influence of Sith objects. Aleksin demanded that they leave \"his\" ship or he would kill them. Calrissian objected on the grounds that the heist had been his idea. Aleksin then appealed to Korin and offered to share their treasures with her. Korin stared into the Sith helmet and was corrupted. She volunteered to join forces with Aleksin and Pavol. However, Aleksin killed her with his double-bladed lightsaber.\nCha manged to shoot the door panel shut and initiate the self-destruct countdown. She then instructed Calrissian to retrieve Lobot from the medical bay while she docked her ship. Calrissian managed to helped Lobot out of the bacta tank. Before they could head to the airlock, they were cornered by a lightsaber-wielding Aleksin. Using his smooth talk, Calrissian managed to trick Aleksin into deactivating his lightsaber before shooting him dead. They then joined Cha at the airlock. Despite killing Pavol, the three encountered a new predicament. The Scimitar's droid steward O-66 had abandoned Cha after learning that she had activated the Imperialis's self-destruct mechanism.\nWhen all seemed lost, Lobot volunteered to connect his cyborg unit to an interface. Despite struggling and losing in his fight against the implants, Lobot managed to override the control codes. Calrissian and Lobot left in one escape pod while Cha left in the other. After escaping the Imperialis, Calrissian listened as Lobot advised Calrissian to use his charm and skills to find something bigger to believe in other than himself. He also counselled Calrissian to use his talents for good.\nSome time later, Calrissian scored a major victory in a card game and won control of Cloud City, a tibanna gas mining operation within the atmosphere of the planet Bespin. The \"legitimate pilot and businessman\" Gev Hessan smuggled goods to Calrissian to help him build the city. Calrissian became the Baron Administrator of Cloud City and turned to more reputable enterprises. As leader of the mining operation, he was able to keep the operation small enough to avoid being noticed by the Empire and the Mining Guild, which he considered advantageous as his customers did not want to attract attention.\nCalrissian met up with Tonee to have a toast about his new honest life. He was approached by an old friend, Clariah who asked him to help find and teach her son, Jiandy, how to be a legitimate business man. As payment, Clariah offered to return one of Calrissian's beloved capes. However, Calrissian refused and wanted to run his business. However, Calrissian agreed to take Jiany under his wing. Calrissian took Jiandy to see Askroh but were caught by his men.\nThe two of them made their escape on a speeder. When their speeder gave out, Calrissian spoke with Askroh about returning his brooch. Askroh decided to toss them over them, and realized that Jiandy had a secret compartment on his belt. He sold Jiandy out, but Calrissian was able to convince Askroh not to throw Jiandy over. As Jiandy ran, he told Calrissian that he never wanted to see him again. Calrissian returned to the bar and was thanked by Clariah for setting her son on a better path.\nIn 3 ABY, Darth Vader and the Imperial Navy tracked Solo and the Millennium Falcon after they escaped from the Battle of Hoth. Vader intended to use Solo—as well as fellow Rebel Alliance members Princess Leia Organa and Chewbacca, who were also aboard the Millennium Falcon—to lure Vader's son, Luke Skywalker, into a trap. Vader knew that if Skywalker thought his friends were in trouble, he would attempt to rescue them and fall into Vader's trap. In an effort to hide from the Empire, Solo suggested that they make their way to Cloud City and seek help from Calrissian. While en route to Bespin, the Falcon was tracked by bounty hunter Boba Fett, who had been employed by Vader to find the Falcon. Vader and Fett arrived on Cloud City before the Falcon, and the Dark Lord of the Sith told Calrissian to help trap the Rebels or Cloud City would face the wrath of the Empire. Knowing full well that Lord Vader would certainly carry out that threat if he refused, Calrissian agreed to Vader's demands, while bargaining for as lenient a treatment for Solo and company as possible, and awaited the Rebels' arrival.\nCalrissian then summoned for Cloud City's Executive Chef, Torro Sbazzle to her kitchen. Although it was the middle of the day and outside of her negotiated work hours, he pleaded with Sbazzle to cook for his new guests. Sbazzle, irritated, was ready to refuse until Calrissian and Gersolik, Sbazzle's sous-chef, explained that their \"guests\" were none other than the Empire and Lord Vader, and Calrissian elaborated that the meal was only for the sake of appearances. When Sbazzle asked how long she had to cook the meal, Calrissian informed her she had only an hour, prompting her to eject the Baron Administrator from the kitchen before beginning her work.\nThe Millennium Falcon arrived at Cloud City and was granted permission from the city authorities to land. Once it landed, Calrissian personally greeted Solo and the others on the landing platform with Lobot and a full complement of the Bespin Wing Guard in tow. When Calrissian first approached, he feigned anger for actions Solo committed in their previous encounters. He quickly dropped the facade, however, and greeted his old friend with affection, telling Solo it was very good to see him again. Calrissian asked what brought Solo to Cloud City and the smuggler told him that they needed to repair the Falcon. Calrissian briefly referred to it as his own ship, asking what Solo did to damage it, but Solo reminded him that he won it from Calrissian fair and square. Calrissian then noticed Organa and introduced himself, using his charms to personally welcome her to Cloud City.\nWhile the Rebels settled into an apartment on Cloud City, Calrissian ordered his workers to begin fixing the hyperdrive on the Millennium Falcon. He went with the workers and inspected the Falcon, making his way to the cockpit. Calrissian, missing L3-37, his former droid companion, saluted the copilot seat she once occupied. Now a part of the Millennium Collective, L3-37 projected a holographic image of the planet Kessel, the place of her death, to make Lando realize she was still a part of the ship. Calrissian was then summoned by Vader. At some point, the work was completed and Calrissian was informed that the vessel was fixed, but the Empire secretly disabled the vessel's hyperdrive without Calrissian's knowledge.\nCalrissian had a meeting with the Troglof Corovene Manakor, which was interrupted by the Lepi smuggler Jaxxon, whose appointment had mistakenly been scheduled an hour by his droid, ML-08. Jaxxon, looking to become legitimate like Calrissian, asked the latter for an investment. Calrissian angrily declined before leaving to go to the princess Leia's apartment, to gather her and her companions for a meeting with Darth Vader.\nOnce the Empire was ready to capture Solo, Organa, and Chewbacca, Calrissian greeted them in the apartment, where he admired Organa for her beauty. He also found that their protocol droid, C-3PO, had been mysteriously damaged and blown into several pieces, which piqued the suspicions of the Rebels. Nonetheless, after he asked them to join him for refreshments, they followed Calrissian throughout the facility, where he told them about the mining operations and how the Empire and the Mining Guild had no presence on Cloud City. Upon arrival at the Rinetta dining room, Calrissian told them that he had made a deal to keep the Empire off of Cloud City, and he opened the door to reveal Vader and Fett; Fett intended to take Solo to Jabba to claim a bounty on the smuggler's head. Vader quickly subdued Solo who attempted to shoot him, even as a squad of stormtroopers appeared behind the Rebels to prevent their escape. As a result, the Rebels were successfully captured by the Empire.\nThe Rebels were taken into custody, and Solo was tortured by the Empire; as intended by Vader, the torture was seen by Skywalker in a vision, who rushed to Cloud City to save his friends. Calrissian waited outside of the torture chamber where he heard Solo's screams, disgusted with the evil he has been forced to collaborate with, and spoke with the Dark Lord once Vader emerged from the chamber. Vader told him that Organa and Chewbacca could never leave Cloud City, to which Calrissian protested, as neither that nor helping Fett were part of their arrangement. Vader threatened to leave an Imperial garrison on Cloud City if Calrissian did not cooperate, which made Calrissian realize that the deal was getting worse and that Vader would not uphold his promises. After Solo's torture ended, Calrissian spoke to his old friend, Organa, and Chewbacca, and told them that the princess and Chewbacca would have to remain on Cloud City. He also told them that Vader was not interested in them, but rather he was using them to bait someone named Skywalker to Cloud City, for which he received a slug to the face from an enraged Solo.\nLater, Vader determined that he would use the Cloud City carbon-freezing chamber to freeze Skywalker in carbonite so he could be delivered to the Emperor. To ensure that Skywalker would not be damaged, Vader decided to test the carbon-freezing on Solo. Calrissian protested, believing that the carbon-freezing would kill Solo. Nonetheless, Vader moved forward with the test. When Solo and the other Rebels arrived, Calrissian informed Solo of what was about to happen to him. Calrissian monitored the freezing and, when it was completed, checked on Solo's lifesigns, where he found that Solo was alive and in perfect carbonite hibernation. Vader then ordered Calrissian to bring Organa and Chewbacca to the Dark Lord's vessel, once again altering the deal he had made with the Baron Administrator. Knowing now that Sith Lord has no intention of keeping to his bargain, Calrissian secretly signaled to Lobot to put his contingency plan into action.\nImperial forces led Calrissian and the Rebels towards the Dark Lord's ship. While en route, they encountered Skywalker, who exchanged fire with the Imperials before the stormtroopers led Calrissian and the Rebels away. The Imperials were soon surrounded by Cloud City security forces, led by Lobot, and disarmed. Calrissian freed the Rebels from their restraints while trying explain that he intended to leave the city while helping the Rebels escape as well, at which point Chewbacca attacked him, grabbing his neck and choking him for his betrayal. Struggling to stop the enraged Wookiee from crushing his windpipe, Calrissian gasped out that there was still time to save Solo from the bounty hunter, who was taking him to the East Platform. The Rebels let Calrissian go, and he followed them towards the platform. They arrived in time to watch Fett's ship, Slave I, take off. Though they attempted to fire at it with blasters, it had no impact and the bounty hunter escaped with Solo.\nStormtroopers soon arrived on the platform, forcing Calrissian and the Rebels to fight through them and escape. They made their way to the Millennium Falcon and arrived at its landing platform, only to find a locked door. R2-D2—Skywalker's astromech droid, who had rendezvoused with the Rebels—attempted and failed to open the door. While the droid was working, Calrissian issued a city-wide broadcast warning his citizens of the Imperial presence and impending occupation of Cloud City. He advised everyone to leave Cloud City before more Imperial forces could arrive. Calrissian's announcement created a frenzy of activity, as numerous people fled throughout the city. Calrissian led the Rebels through the commotion towards another doorway, which R2-D2 was able to open while Calrissian and the Rebels fought off more stormtroopers. The group ran towards the Falcon, where Calrissian provided cover fire as the others boarded the ship. Once aboard, the Falcon lifted off from the platform, pursued by TIE fighters.\nAs the Falcon was escaping, Skywalker—who had been injured in and escaped from a lightsaber duel with Vader—communicated to Organa through the Force, calling to her for help as he struggled to hang onto an antenna at the base of Cloud City. Organa asked Chewbacca, who piloted the Falcon, to turn the ship around so they could save their friend. Calrissian protested because of the TIE fighters, but the Rebels went back anyway to rescue their friend. They found Skywalker hanging from the city and positioned the ship underneath him. Once in position, Calrissian opened a hatch and took a lift to the top of the ship, where Skywalker fell into and Calrissian caught him. With Skywalker on board, the Falcon took off again from Cloud City, and Calrissian left Skywalker in Organa's care.\nCalrissian took the pilot's seat in the Falcon and prepared the ship for a jump into hyperspace. When he attempted to make the jump, however, the hyperdrive failed, much to Calrissian's frustration as he was unaware that the Empire had sabotaged the ship. The Executor, Vader's Super Star Destroyer, approached the vessel, where Vader would once again attempt to capture Skywalker. R2-D2, who learned of the sabotage while communicating with Cloud City's computer, made the necessary repairs to the hyperdrive and the ship was able to jump into hyperspace, successfully escaping from the Empire.\nThe Millennium Falcon united with the Alliance Fleet's Fourth Division at Rendezvous Point Delta-Three, but the rebel craft were under attack from Imperial Commander Ellian Zahra. After the Falcon and other rebel ships escaped to Backup Rendezvous Point Gamma-Nine, Calrissian did not stay long, as he and Chewbacca intended to set out in the Millennium Falcon to find Solo. Before leaving the fleet, he contacted Organa and Skywalker, promising the princess that he and Chewbacca would find Solo. The group agreed to meet at a rendezvous point on Tatooine, the location of Jabba's Palace. They said their goodbyes and the Falcon departed from the fleet.\nCalrissian was on the planet Arkanis. During his time there, bounty hunters were trying to capture Calrissian so Leia Organa disguised herself as Boushh to rescue Calrissian. While Calrissian was on the run from the bounty hunters, he fell off a hill falling into Leia. Eventually Leia revealed herself to Calrissian and they both escaped to Leia's escape point. Later, bounty hunters then captured Chewbacca and brought him to Bossk. Eventually Chewbacca was rescued.\nSome time later, Calrissian and Chewbacca had located Solo's still-frozen body at Jabba's palace on Tatooine. Skywalker put together a plan in which Calrissian, Organa, Chewbacca, the droids, and Skywalker himself would rescue their friend and, if necessary, destroy Jabba the Hutt. Calrissian infiltrated the palace and disguised himself as one of the Hutt's guards. He watched as each member of the Rebel team arrived; the droids arrived first, posing as gifts from Skywalker to Jabba, followed by Organa who posed as a bounty hunter collecting the bounty on Chewbacca, who she brought as her prisoner. Organa later released Solo from carbon-freeze, but they were discovered by Jabba and his court. Solo was placed into a prison cell with Chewbacca, while Organa became the Hutt's slave. Calrissian remained in disguise throughout the arrivals.\nSkywalker arrived last and, while declaring himself a Jedi Knight, demanded that Solo and the others be released to him. Jabba refused, and Skywalker was forced to fight and kill Jabba's rancor beast. When the rancor failed to kill Skywalker, Jabba sentenced Skywalker, Solo, and Chewbacca to be killed; the sentence was that they would be fed to the sarlacc creature in the Great Pit of Carkoon, where they would be slowly digested over the course of a millennium. Calrissian, still disguised as a guard, traveled with Jabba and his entourage to the Great Pit of Carkoon, and was stationed aboard the skiff on which the prisoners were kept.\nBefore the Rebels could be executed, R2-D2 revealed he had been concealing Skywalker's lightsaber. The Jedi Knight attacked Jabba's guards and Calrissian revealed himself, helping to free the prisoners and fight off the other guards. While doing so, he was knocked from the side of the skiff and fell towards the sarlacc, clinging onto the edge of the pit. Solo, who was partially though temporarily blind as a result of the carbon freezing, was lowered towards Calrissian by Chewbacca. Solo handed him a staff and Calrissian reached for it, but one of the sarlacc's tentacles grabbed his leg. Solo aimed a blaster at the tentacle and, despite Calrissian's concerns over Solo's ability to see his target, fired upon the creature. He hit the tentacle and the sarlacc released Calrissian, allowing Solo to pull him to safety.\nOnce they were aboard, Skywalker and Organa—who had killed Jabba aboard the Hutt's vessel—jumped from Jabba's ship to the skiff. Calrissian piloted the skiff away from Jabba's vessel as it exploded, and the group rescued the droids, who had fallen overboard earlier. With the rescue completed, the group returned to the Millennium Falcon and left Tatooine.\nCalrissian participated in the Battle of Taanab, helping defeat a pirate fleet. He then rendezvoused with the fleet to find that a battle was being prepared to strike a decisive blow against the Empire. The Empire was building a second Death Star, which orbited the forest moon of Endor, and the Emperor had personally arrived on the station to oversee the final stages of construction. Unknown to the Rebels was that the Emperor had allowed them to learn this information, as he was luring them into a trap in an attempt to destroy them. They believed that the station, which was fully operational, did not yet have use of its primary, planet-destroying weapon. As such, they put together a plan to destroy the Death Star and kill the Emperor. The plan would require a ground assault to destroy the generator that powered the shield protecting the Death Star, as well as a naval assault against the station itself. Calrissian volunteered to lead the starfighter attack and was commissioned as a general of the Rebel Alliance. He attended a Rebel briefing where the plan for the Battle of Endor was reviewed, and learned that Solo would lead the ground assault, with a team that included Organa, Chewbacca, and Skywalker. Solo congratulated Calrissian on his promotion, to which he responded it must have been because of a maneuver he pulled at Taanab. Solo told Calrissian he could fly the Millennium Falcon during the battle. Knowing how much the ship meant to his friend, Calrissian promised that he would return her without so much as a scratch.\nSolo and his team departed prior to the fleet, in order to give themselves time to destroy the shield. The Rebel fleet, meanwhile, prepared to leave. Once it was ready, Calrissian and his co-pilot, a Sullustan named Nien Nunb, flew the Falcon to the head of the fleet, where all fighter squadrons were accounted for. Admiral Gial Ackbar, who led the Alliance fleet, gave Calrissian the order to depart for Endor. Once they arrived at Endor, Nunb told Calrissian that the Falcon's scanners had been jammed, leading Calrissian to realize that the Empire knew they were coming and that the attack was a trap. As the squadrons approached the Death Star, Calrissian ordered his forces to break off the attack, as he knew that the shield was still operational.\nA hidden Imperial fleet revealed itself, and Calrissian and his fighter squadrons were forced to contend with incoming TIE fighters. He led his fighters towards the Imperial fleet in order to draw enemy fire away from the Rebel cruisers, and the Falcon shot a number of the TIE fighters down. He soon saw Imperial Star Destroyers positioned away from the main fighting and was unsure as to why they were hanging back. Calrissian soon found an answer once the Death Star, revealed as operational, fired its primary weapon and destroyed a Rebel cruiser with a single shot. Ackbar ordered a retreat, but Calrissian convinced him to keep the fleet in place, as he had faith that Solo would complete his mission on the surface. When another Star Cruiser was atomized by the superweapon, Calrissian told Ackbar to move the rest of the cruisers and engage the Star Destroyers at point-blank range, reasoning that they stood a far better chance against them than the Death Star and that the destroyers would be caught in the blast if the superlaser dared to fire again.\nOn the surface, Solo and his team successfully completed their mission and destroyed the shield generator. With the Death Star vulnerable, Ackbar ordered Calrissian and his forces to begin their assault on the battle station. The Falcon and the fighter squadrons entered an opening on the space station and headed for the reactor core, all while pursued by TIE fighters. While piloting towards their target, the Falcon hit a bulkhead on the interior of the Death Star, knocking its sensor dish off; Calrissian, as a result, had broken his promise to return the Falcon to Solo \"without a scratch.\" The Rebels reached the main reactor, where the Falcon fired the shot that started a chain reaction to destroy the station. Calrissian piloted the ship back through the same route that they entered, as a ball of fire followed close behind. Despite the minor damage, the Falcon escaped the Death Star just in time and flew back towards the Rebel fleet as the Death Star exploded behind it.\nCalrissian and his fellow Rebels made their way to the surface of Endor and regrouped in Bright Tree Village, the home of the Ewoks who helped Solo and his team destroy the shield generator, where they all celebrated the destruction of the Death Star and the death of the Emperor; during the battle, Skywalker redeemed Vader, who in turn killed the Emperor before succumbing to his own injuries. Calrissian reunited with Solo, Chewbacca, and the rest of his friends for the festivities.\nThough they had won the Battle of Endor, the Rebels would still face many challenges as they sought to restore the Galactic Republic. Shortly after Inferno Squad's surrender, Calrissian discussed matters with the squad leader Iden Versio. He offered to let them leave free on two X-Wing fighters as well as providing them the option of helping stop the Empire from implementing Operation: Cinder. Iden and Del Meeko took the second option, leading Lando to assign them to join his friend Shriv Suurgav in Danger Squadron.\nCalrissian commanded an Alliance Fleet including the cruiser Restoration, the Mellcrawler II and a small fleet of starfighters, including Danger Squadron and defected members of Inferno Squad during the Battle of Theed, aiding Queen Sosha Soruna, Organa and Lieutenant Shara Bey as they disrupted the Imperial operation to render Naboo inhospitable.\nThe rebels then reengaged the Imperial forces and destroyed the last satellites and engaged the Torment, however, before going down, the ship deployed its ground invasion force in an attempt to capture Theed and salvage the battle, after the ground battle ended, the New Republic began to form. Calrissian later joined Shriv Suurgav on a mission to Sullust.\nFollowing the events at Endor, Governor Ubrik Adelhard imposed the Iron Blockade on the Anoat sector. Adelhard also claimed that the Empire had won the Battle of Endor and that rumors of the Emperor's death were rebel propaganda. In response, a resistance movement known as the Uprising emerged in the sector. Calrissian kept in touch with his old friend Lobot, who relayed messages through the blockade and served as a liaison between Calrissian and members of the Uprising. Unable to intervene directly in the uprising on Cloud City, Calrissian instead transferred credits to the rebels through the auspices of Lobot. He was privy to a joint operation by Lobot and the pirate Kars Tal-Korla to breach Adelhard's personal quarters and capture him. Though Adelhard evaded capture, the Uprising managed to liberate Bespin as the Galactic Civil War drew to a close.\nCalrissian managed to starve Adelhard's Imperial remnant into submission. Around the time of the Battle of Jakku, he returned to Cloud City at the head of a ragtag force of Wing Guards and New Republic soldiers. With Lobot at his side, Calrissian led a mopping-up operation against an Imperial hold-out in the Casino Level's Bolo Tanga room. As they made their way there, Lobot reminded Calrissian to get Organa and Solo a nuptial gift for their expectant child. Calrissian joked about gifting the boy a little cape and mustache so that he could resemble Uncle Lando.\nUpon arriving at the Bolo Tanga room, Calrissian met with the Wing Guard Captain Gladstone, who informed him that the Imperials were holed up inside. While they had broken through to the beam outtake shaft, they were trapped by poisonous fumes. Calrissian then addressed the Imperials and offered to spare their lives if they surrendered. As a further incentive, he promised to give them a hot meal, a warm bed, and to send them away without fear of New Republic prosecution. After ending his address, Calrissian ordered his engineers to unseal the door.\nA dozen Imperials accepted Calrissian's offer and they were taken into custody by the Wing Guard. However, Gladstone then informed the Baron Administrator that an Imperial sergeant was refusing to surrender. Calrissian tried to reason with the sergeant but the man tried to shoot him. Calrissian was forced to kill the sergeant with his Rossmoyne Vitiator pistol. After subduing the Imperials, Calrissian chatted with Lobot about the matter of purchasing a nuptial gift. When Calrissian suggested a lamp and a blaster, Lobot opposed the ideas. Calrissian then proposed leaving his Vitiator in a save lock until Organa's son came of age. When Lobot vetoed that, Calrissian then proposed gifting the family a Vantillian catamaran. Lobot accepted that idea. When Calrissian toyed with the idea of starting his own family, Lobot vetoed that as well. Calrissian then invited Lobot out for a drink but Lobot responded that he did not drink. Calrissian then promised to find a win-win situation for both of them.\nCalrissian and Nunb at some point stopped at a space station to refuel the Falcon, but were unable to take off. The ship was boarded by the bounty hunter Embo, who was attempting to claim a bounty on Calrissian for the destruction of the second Death Star. Calrissian incapacitated Embo, and he and Nunb left him on the station when they departed.\nBy 7 ABY, Calrissian had taken over Calrissian Enterprises, formerly VylarTech, which manufactured droids for service on Cloud City. Impresario Calrissian entertained a Twi'lek diplomatic brigade that included his old acquaintance Kaasha Bateen. That night, he was attacked by his protocol droid DRX-7 and another droid, who had reprogrammed DRX-7. Calrissian was defended by Lobot, Bateen, and others, but he was still wounded in the shoulder. DRX-7 demanded Calrissian to return the Phylanx Redux Transmitter to his master, Fyzen Gor. When Calrissian admitted he had no idea what the Phylanx was, the droid told him the owner of the Millennium Falcon had stolen it around ten years ago. DRX-7 was eventually subdued, but the droid escaped, telling Calrissian that Gor would unleash a massacre upon Cloud City if he did not return the Phylanx within 72 hours.\nCalrissian then traveled to Chandrila in the Lady Luck to meet with Han, assuming it was a deed done during his time as owner of the Millennium Falcon that was causing the problem. He arrived at Han and Leia's apartment to discuss the matter, starting with punching Solo in the face when he opened the door. After calming down with some Corellian whiskey, Han admitted he knew of the Phylanx from a run he performed with Sana Starros a long time ago. Calrissian convinced Han that he needed to help him find the Phylanx to save Cloud City since it was mostly his fault and the city was in grave danger. That night, Calrissian ate in his their apartment and then smoked a Chandrilan monjav alongside Solo. Later, Calrissian and Bateen would walk down the Grand Promenade of the Rebellion in Hanna City, where Calrissian gave credits to a rebel veteran missing a leg due to an injury at the Battle of Hoth.\nThe next day, Calrissian and the group traveled to the New Republic Defense Fleet headquarters to meet with Conder Kyl, the chief of cyberware. Calrissian requested that Kyl recommend them a slicer to accompany them, and Kyl recommended the Ewok Peekpa. However, they had to promise Peekpa that Chewbacca would be amongst their crew to convince her to join. Solo contacted Chewbacca, who agreed to join them, and they arranged to pick him up from his home on Kashyyyk.\nRetiring from New Republic service, Calrissian settled down and started a family, but tragedy struck when his daughter Kadara Calrissian disappeared. Unknown to him, it was the nascent First Order that kidnapped her as part of Project Resurrection, ostensibly to build up their army but also targeting the leaders of the former Rebel Alliance. After receiving help from his friends during the initial period of his search, Calrissian eventually traveled alone across the galaxy in search of any sign for his daughter. In 21 ABY, years into his search, Calrissian found himself in the Sennifer's Beam and Balance cantina, unsure if he had come to search for leads on his long-missing daughter or to gamble. However, he then overheard a former Jedi hunter named Ochi drunkenly brag about being hired by the Sith Eternal. Fearful about the possible return of the Sith but realizing it could be a lead on Kadara, having heard Ochi say something about kidnapping a young girl, Calrissian reached out for information on the girl's family by contacting Shriv Suurgav before deciding to meet up with his old friend Skywalker.\nWith Skywalker having detected a growing darkness in the Force, the two joined forces to search for the Sith world of Exegol by locating Ochi and stopping the re-emerging Sith viceroy Exim Panshard, who had clung onto life within his mask. While Panshard was indeed destroyed, Ochi managed to elude them, dying in the Forbidden Valley of the planet Pasaana on a false lead left by the girl's parents. The child, Rey, was left on the planet Jakku to avoid detection from the Sith, while Calrissian, Skywalker, and Skywalker's old contact Komat buried her parents, Dathan and Miramir, on the cold world of Neftali. After Calrissian took a time to recover on Komat's planet Polaar, he and Skywalker traveled to Pasaana but found no trace of Ochi. They did find his ship, the Bestoon Legacy, and Calrissian found himself taken by the humble nature of the native Aki-Aki people. Having found himself changed after his time on Polaar and realizing Pasaana would make a good base to search the nearby quadrant for Kadara, Calrissian decided to remain behind to live as a hermit in the Forbidden Valley.\nHe also promised Skywalker he would keep an eye on the Bestoon Legacy. As Skywalker took a final look at the starship's computer logs, Calrissian began to record a new entry in the Calrissian Chronicles series he had made during his younger years. While still living on Pasaana in 28 ABY, he sent a message of support to his old friend Senator Organa following a political scandal arising from revelations about Darth Vader being her true father.\nThe very girl Calrissian had once hoped to save, Rey, eventually made her way into the Resistance during the First Order-Resistance War. In 35 ABY, Rey, Poe Dameron, Finn, Chewbacca and C-3PO arrived on Pasaana, also looking for Ochi. Calrissian saved them from arrest by a First Order stormtrooper and took them to the bluff on Lurch Canyon where he and Skywalker had discovered Ochi's starship. Calrissian declined to aid the Resistance further, but eventually changed his mind—assembling and leading the Citizens' Fleet, which engaged the Sith Eternal forces at the Battle of Exegol, where Calrissian flew the Millennium Falcon alongside Chewbacca. Following the battle, Calrissian saw something in former stormtrooper Jannah, and offered to help her find her homeworld and family.\nLando Calrissian was a human male with black hair, brown eyes, and dark skin. In his youth, Calrissian enjoyed playing sabacc, and Solo described him as having been a scoundrel. Even though he only took jobs where he could see \"the angle,\" Calrissian was willing to undertaking dangerous risks. On one occasion, he, Lobot, and some companions stole the Emperor's luxury yacht Imperialis. Calrissian hoped to profit from selling the ship's treasures. The heist undertook a dangerous turn when the Sith objects aboard corrupted his companions Aleksin, Pavol, and Korin Pers. Calrissian had little appreciation for the Sith and Jedi, regarding them as \"con-jobs.\"\nHe was also familiar with the bounty hunter Cha, which led her to spare his life. Calrissian cared deeply for his friend Lobot and was unwilling to abandon him. The two were close friends. Lobot recognized Calrissian's charm and ability to motivate people and counseled him to find a greater cause than himself and to do good for others.\nAfter Lobot lost his freewill, Calrissian sought to turn into a respectable businessman, and he turned Cloud City into a mostly-legitimate enterprise. He was protective of his people to the point that he was forced to betray Solo and the Rebels to save Cloud City from the wrath of the Empire, for whom Calrissian had no love. He turned against the Empire, however, in order to give his citizens a chance to escape and to save Solo. Although Solo had felt betrayed by Calrissian's actions, the two reconciled after Solo was rescued from Tatooine, and shared a warm embrace during the victory celebration on Endor. When speaking or referring to Solo by his first name, Calrissian invariably pronounced the name the same way one would pronounce the word \"hand,\" rather than rhyming with \"on\" as it was normally pronounced.\nThough he had once written the Rebel Alliance off as a lost cause, he came to join their fight against the Empire. Calrissian was known for his jocular and witty personality. Despite the wartime damage to Cloud City, Calrissian was undaunted and preferred to look on the bright side of things by hiring refugees to staff his facilities. Calrissian was also a smooth-talking negotiator who managed to convince several Imperial holdouts to surrender in return for being well-treated and allowed to leave Cloud City. Calrissian was also a man of honor who kept his promises. The only person that could exert an influence on Calrissian was his friend and employee Lobot. Calrissian welcomed the news that his friends Solo and Organa were expecting a child and looked forward to being an uncle.\nCalrissian was a skilled pilot. During the Battle of Taanab, Calrissian performed a piloting maneuver that impressed even himself. He later attributed that maneuver as being one of the reasons why the Rebel Alliance commissioned him as a general and placed him in a command position for the Battle of Endor. Calrissian was also skilled with a blaster, wielding an X-8 Night Sniper as his weapon of choice which he used against Azmorigan's thugs with enough proficiency to earn him a compliment from Wren, herself an accomplished markswoman.\nCalrissian once undertook a dangerous maneuver which involved latching onto a Star Destroyer's tractor beam and causing it to collide with another Star Destroyer. Calrissian boasted of doing this maneuver a thousand times. Calrissian was also a cunning combatant and once tricked the lightsaber-wielding Aleksin into deactivating his blade so that he could kill him. Calrissian also owned a Rossmoyne Vitiator pistol, which he won in a game of Six-Card Gizka Limit from a spice-drunk Aybarian diplomat. Calrissian used this pistol to kill an Imperial sergeant who refused to surrender.\nCalrissian had a flamboyant sense of style. He often wore ornate clothing that included a cape. While having a fateful rematch of sabacc with smuggler Han Solo, Calrissian wore a colorful outfit that consisted of a red tie, white pants with a beckon call transponder chit, a white and blue bespoke cape made from a tailor on a subtropical moon in the Oseon Belt, and a bright yellow shirt with it's sleeve hiding a green sylop card. On a mission to rescue Han Solo, he disguised himself as a Skiff Guard pretending to work for crime lord Jabba the Hutt in order to blend in with the crowd at Jabba's Palace. In the disguise he wore dark clothing which included a mask with bones on it.\nLando Calrissian was portrayed by Billy Dee Williams in Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi. Williams reprised the role in \"Idiot's Array,\" the eleventh episode of the first season of the animated television series Star Wars Rebels, and returned in the first episode of the second season, \"The Siege of Lothal.\" Williams also reprised the role for the game Star Wars Battlefront II.\nLawrence Kasdan, who co-wrote The Empire Strikes Back, Return of the Jedi and The Force Awakens, told Vanity Fair that Calrissian is not in The Force Awakens, but added that he believes that there is a future for the character and that Calrissian is not \"finished in any way, shape, or form.\" The Last Jedi director Rian Johnson briefly considered to bring back Lando in the film as the codebreaker that Finn and Rose Tico needed to find at Canto Bight, but Calrissian was ultimately written out from the film's script and replaced by DJ in the role.\nA young Lando Calrissian was portrayed by Donald Glover in the 2018 film Solo: A Star Wars Story. Since the production's beginning, Calrissian was always included in the script as he was necessary to the story. When asked about the character's depiction in the film, screenwriter Jon Kasdan confirmed that Lando is meant to be pansexual. \"There's a fluidity to Donald and Billy Dee's  sexuality,\" he said. \"I mean, I would have loved to have gotten a more explicitly LGBT character into this movie. I think it's time, certainly, for that, and I love the fluidity ― sort of the spectrum of sexuality that Donald appeals to and that droids are a part of.\" Kasdan's father and co-writer was more ambiguous about his thoughts on the character's sexuality, saying \"Maybe  means something, maybe it doesn't.\" Kasdan also revealed on Twitter that they had recorded a line that stated Lando's full name was \"Landonis Balthazar Calrissian III,\" but it did not make the final cut of the movie.\nBilly Dee Williams reprised the role of Lando Calrissian for 2019's Star Wars: Episode IX The Rise of Skywalker, the final installment of the Skywalker saga. Reggie Watts provided the voice of his disguised form in the film.\nOn March 18, 2021, StarWars.com announced that Star Wars comic books released by Marvel Comics in June will have Pride Month variant covers that feature gay and transgender artists paired with LGBTQ+ characters. The artwork was revealed on May 7, and includes Calrissian on the Star Wars  14 variant cover by Stephen Byrne.\nStar Wars Rebels: Visual Guide: Epic Battles states that Calrissian was twenty-six at the time of \"Idiot's Array,\" placing his birth in around 30 BBY. This conflicts with Star Wars: The Rise of Skywalker: The Visual Dictionary, which states that Calrissian was approximately 78 years old at the time of Star Wars: Episode IX The Rise of Skywalker, placing his birth in around 43 BBY. In the 2018 film Solo: A Star Wars Story, where the main events take place in 10 BBY, where Han Solo is 22 years old, Calrissian refers to Solo as \"this kid\"  and \"the boy\" , indicating that he is several years older than Han Solo and that the information in The Visual Dictionary is the correct version.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Tamtel_Skreej/Legends",
  "/wiki/Star_Wars_Legends",
  "/wiki/Template:Redlink",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Lando%27s_Luck",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Rebel_Bluff",
  "/wiki/Fifth_and_Final",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/The_Coin",
  "/wiki/Age_of_Rebellion_-_Lando_Calrissian_1",
  "/wiki/Choose_Your_Destiny:_A_Smuggler_Mission",
  "/wiki/Tales_from_Wild_Space:_Family_Affair,_Part_1",
  "/wiki/Tales_from_Wild_Space:_Family_Affair,_Part_2",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Vol._1:_The_Destiny_Path",
  "/wiki/Star_Wars_(2020)_8",
  "/wiki/Star_Wars:_Operation_Starlight",
  "/wiki/Star_Wars_Vol._3:_War_of_the_Bounty_Hunters",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters_(TPB)",
  "/wiki/Darth_Vader_(2020)_16",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Star_Wars_(2020)_27",
  "/wiki/Star_Wars_(2020)_29",
  "/wiki/Age_of_Rebellion_-_Princess_Leia_1",
  "/wiki/Shattered_Empire_1",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Last_Shot",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Flight_of_the_Falcon,_Part_3:_Home_Again",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/A_Race_for_Answers",
  "/wiki/Hare-Brained_Heist",
  "/wiki/Halcyon_Legacy_4",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Talk:Landonis_Balthazar_Calrissian",
  "/wiki/Socorro",
  "/wiki/43_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Calrissian_family",
  "/wiki/Crimson_Dawn",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Uprising",
  "/wiki/Calrissian_Enterprises",
  "/wiki/Resistance",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Smuggler",
  "/wiki/Gambler",
  "/wiki/Baron_Administrator",
  "/wiki/Cloud_City",
  "/wiki/General",
  "/wiki/Reproduction",
  "/wiki/Millennium_Falcon",
  "/wiki/Han_Solo",
  "/wiki/Sabacc",
  "/wiki/Numidian_Prime",
  "/wiki/Mining",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Bespin",
  "/wiki/Galactic_Civil_War",
  "/wiki/Anakin_Skywalker",
  "/wiki/Luke_Skywalker",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Galactic_Empire",
  "/wiki/Carbon-freezing",
  "/wiki/Carbonite",
  "/wiki/Boba_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Tatooine",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_of_Endor",
  "/wiki/Standard_year",
  "/wiki/Galactic_Concordance",
  "/wiki/Parent",
  "/wiki/Kadara_Calrissian",
  "/wiki/First_Order",
  "/wiki/Mission_to_Pasaana",
  "/wiki/Desert",
  "/wiki/Pasaana",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/The_Force",
  "/wiki/Aki-Aki",
  "/wiki/Lurch_Canyon",
  "/wiki/Solo_family",
  "/wiki/First_Order-Resistance_War",
  "/wiki/35_ABY",
  "/wiki/The_galaxy",
  "/wiki/Battle_of_Exegol",
  "/wiki/Exegol",
  "/wiki/File:LandoSolo-Fathead.png",
  "/wiki/Pilot",
  "/wiki/Freighter",
  "/wiki/10_BBY",
  "/wiki/Unidentified_subtropical_moon",
  "/wiki/Oseon_Belt",
  "/wiki/L3-37",
  "/wiki/Pilot_droid",
  "/wiki/Gonda",
  "/wiki/Dawinian",
  "/wiki/Tonnika_sisters",
  "/wiki/Brea_Tonnika",
  "/wiki/Senni_Tonnika",
  "/wiki/Ecumenopolis",
  "/wiki/Coruscant",
  "/wiki/Time",
  "/wiki/Yavin_Prime",
  "/wiki/Ambush_in_the_Halthor_sector",
  "/wiki/Halthor_sector",
  "/wiki/Interdictor_vessel",
  "/wiki/Hyperspace",
  "/wiki/Walker",
  "/wiki/Er%27Kit_(species)",
  "/wiki/Arms_dealer",
  "/wiki/Noonian_sector",
  "/wiki/Felucia",
  "/wiki/Dryden_Vos",
  "/wiki/Pantora",
  "/wiki/Vice_Grand_Administrator",
  "/wiki/Prita_Sven",
  "/wiki/Forlyn",
  "/wiki/File:Frozen_Kova.jpg",
  "/wiki/Hynestia_Prime",
  "/wiki/Queen",
  "/wiki/Forsythia_Jin",
  "/wiki/Gherlian_fur",
  "/wiki/Rinetta_Gan",
  "/wiki/Zel_Gris",
  "/wiki/Livno_III",
  "/wiki/Neral%27s_moon",
  "/wiki/Ne%27eda_Frip",
  "/wiki/Starship",
  "/wiki/File:Kristiss_and_Lando.png",
  "/wiki/Petrusia",
  "/wiki/Seizure_of_Petrusia",
  "/wiki/Casino",
  "/wiki/Calrissian_Chronicles",
  "/wiki/Galaxy",
  "/wiki/Batuv",
  "/wiki/Cape",
  "/wiki/Borkus_(Trandoshan)",
  "/wiki/Bartender",
  "/wiki/Kristiss",
  "/wiki/Petrusian",
  "/wiki/Imperial_outpost_of_Kullgroon",
  "/wiki/Kullgroon",
  "/wiki/Credit",
  "/wiki/Brushaun",
  "/wiki/Canto_Bight",
  "/wiki/Job_on_Kullgroon",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/File:KullgroonWastelands.jpg",
  "/wiki/Atmosphere",
  "/wiki/Wastelands_of_Kullgroon",
  "/wiki/File:Lando_fighting_in_arena.jpg",
  "/wiki/Batalla",
  "/wiki/Foodstuff",
  "/wiki/Murkel_Kev",
  "/wiki/Cantor_Zain",
  "/wiki/Kawal_Tane",
  "/wiki/Siswan",
  "/wiki/File:Lando_leads_Petrusians.jpg",
  "/wiki/File:L3_and_Lando.jpg",
  "/wiki/Rythus",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Vandor",
  "/wiki/The_Lodge",
  "/wiki/Qi%27ra",
  "/wiki/Tobias_Beckett",
  "/wiki/Chewbacca",
  "/wiki/Coaxium",
  "/wiki/Pyke_Syndicate",
  "/wiki/Kessel",
  "/wiki/Sylop",
  "/wiki/VCX-100_light_freighter",
  "/wiki/File:ElthreeHanLandoFalcon-Solo.jpg",
  "/wiki/Raid_on_Kessel",
  "/wiki/Pyke",
  "/wiki/Death",
  "/wiki/Blockade",
  "/wiki/Akkadese_Maelstrom",
  "/wiki/Processor",
  "/wiki/Navigation_computer",
  "/wiki/Summa-verminoth",
  "/wiki/The_Maw",
  "/wiki/Gravity_well",
  "/wiki/Gravity",
  "/wiki/File:SoloCalrissianSavareen-Solo.jpg",
  "/wiki/Savareen",
  "/wiki/Enfys_Nest",
  "/wiki/Cloud-Riders",
  "/wiki/File:Lando_on_Numidian_Prime.jpg",
  "/wiki/Lando_ordeal",
  "/wiki/Lobot",
  "/wiki/Kaasha_Bateen",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Pasa_Novo_campaign",
  "/wiki/Maz_Kanata",
  "/wiki/Seylott",
  "/wiki/Black_Sun",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Spiran_mineral_spas",
  "/wiki/Rybet",
  "/wiki/Thief",
  "/wiki/Sticky_Fingers",
  "/wiki/Esoomian",
  "/wiki/Bumblethunk",
  "/wiki/Latts_Razzi",
  "/wiki/Azmorigan",
  "/wiki/Cikatro_Vizago",
  "/wiki/Devaronian",
  "/wiki/Crime_lord",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Lando_Calrissian%27s_farm",
  "/wiki/Mineral",
  "/wiki/Lando_Calrissian%27s_puffer_pig",
  "/wiki/Puffer_pig",
  "/wiki/Pig",
  "/wiki/Jhothal",
  "/wiki/Old_Jho%27s_Pit_Stop",
  "/wiki/Tsoklo",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Lasat",
  "/wiki/Spectres",
  "/wiki/Ghost",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Idiot%27s_Array",
  "/wiki/Droid",
  "/wiki/Sabine_Wren",
  "/wiki/Mandalorian",
  "/wiki/Artist",
  "/wiki/File:Lando_on_the_Ghost.png",
  "/wiki/Merchant_One",
  "/wiki/Hera_Syndulla",
  "/wiki/Kanan_Jarrus",
  "/wiki/Escape_pod",
  "/wiki/Lord",
  "/wiki/Ezra_Bridger",
  "/wiki/Mission_to_Lando_Calrissian%27s_farm",
  "/wiki/File:Lando_bids_farewell.png",
  "/wiki/Fuel",
  "/wiki/Standard_day",
  "/wiki/File:LandosWillie-SWRM21.jpg",
  "/wiki/Rikarda",
  "/wiki/Klonoid",
  "/wiki/Stellar_Sun",
  "/wiki/W1-LE",
  "/wiki/Varluk_Organization",
  "/wiki/Rescue_of_Lando_Calrissian%27s_puffer_pig",
  "/wiki/Varluk_Organization_headquarters",
  "/wiki/Zyzar",
  "/wiki/Ango_Croom",
  "/wiki/File:Rescue_of_Landos_puffer_pig.png",
  "/wiki/Hologram",
  "/wiki/Action_at_Mustafar",
  "/wiki/Sovereign",
  "/wiki/Star_Destroyer",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Mission_to_Lothal_(4_BBY)",
  "/wiki/49-v99_Deflector",
  "/wiki/Deflector_shield_generator",
  "/wiki/Masking_transponder",
  "/wiki/Shuttle",
  "/wiki/File:LandoDLina-OffTheRails.jpg",
  "/wiki/Tyegin",
  "/wiki/Exas_Jewell",
  "/wiki/Luxury_train",
  "/wiki/Train",
  "/wiki/Shen_Kanton",
  "/wiki/D%27Lina",
  "/wiki/Baj",
  "/wiki/Rakan",
  "/wiki/File:Lando_aboard_the_Exas_Jewell.jpg",
  "/wiki/Pirate",
  "/wiki/Zira",
  "/wiki/Grillo",
  "/wiki/Dealer_droid",
  "/wiki/Tyegin%27s_law_enforcement",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Klikklak",
  "/wiki/Jaff_Basan",
  "/wiki/Luck_Luck_Freidal%27s_casino",
  "/wiki/Luck_Luck_Freidal",
  "/wiki/DarkNet",
  "/wiki/File:LandoandSana-SW34.png",
  "/wiki/Sana_Starros",
  "/wiki/Krawg",
  "/wiki/Krawg_pirates",
  "/wiki/Nar_Shaddaa",
  "/wiki/File:Orbital_shipyard_cc-24.jpg",
  "/wiki/Administrator",
  "/wiki/Universe",
  "/wiki/Moff",
  "/wiki/Ssaria",
  "/wiki/Castell",
  "/wiki/Cantina",
  "/wiki/Toren",
  "/wiki/Blaster",
  "/wiki/Bounty",
  "/wiki/Aleksin",
  "/wiki/Pavol",
  "/wiki/Sava",
  "/wiki/Korin_Pers",
  "/wiki/Antiques_dealer",
  "/wiki/Professor",
  "/wiki/Sienar_Fleet_Systems",
  "/wiki/Orbital_Shipyard_CC-24",
  "/wiki/Stealth_suit",
  "/wiki/Theft_of_the_Imperialis",
  "/wiki/Shipyard",
  "/wiki/Stormtrooper",
  "/wiki/Hyperdrive",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Yacht",
  "/wiki/Imperialis",
  "/wiki/File:Lando_and_Lobot_escape_Castell.png",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Commander",
  "/wiki/Commodore",
  "/wiki/Idel",
  "/wiki/Gravity_mine",
  "/wiki/Mine",
  "/wiki/Computer",
  "/wiki/Captain",
  "/wiki/Conro",
  "/wiki/Conro%27s_Star_Destroyer",
  "/wiki/Shan",
  "/wiki/Shan%27s_Star_Destroyer",
  "/wiki/AJ%5E6_cyborg_construct",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Cybernetics",
  "/wiki/Medical_bay",
  "/wiki/Knife",
  "/wiki/Chanath_Cha",
  "/wiki/Star_Courier",
  "/wiki/Scimitar",
  "/wiki/Bacta_tank",
  "/wiki/Twin",
  "/wiki/Sith_artifact",
  "/wiki/Mask_of_Lord_Momin",
  "/wiki/File:Chanath_Cha_face.png",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Momin",
  "/wiki/Sith",
  "/wiki/Sculptor",
  "/wiki/Double-bladed_lightsaber",
  "/wiki/Dismemberment",
  "/wiki/University_of_Bar%27leth",
  "/wiki/Jedi",
  "/wiki/File:Lobot_Lando_and_Chanath.png",
  "/wiki/Black_market",
  "/wiki/Bacta",
  "/wiki/Lightsaber",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Airlock",
  "/wiki/O-66",
  "/wiki/Cyborg",
  "/wiki/City",
  "/wiki/Tibanna",
  "/wiki/Gas",
  "/wiki/Gev_Hessan",
  "/wiki/Mining_Guild",
  "/wiki/Clariah",
  "/wiki/Jiandy",
  "/wiki/Askroh",
  "/wiki/File:Lando_and_Clariah_escaping_Askroh.jpg",
  "/wiki/3_ABY",
  "/wiki/Darth",
  "/wiki/Imperial_Navy",
  "/wiki/Battle_of_Hoth",
  "/wiki/Executive_Chef",
  "/wiki/Torro_Sbazzle",
  "/wiki/Gersolik",
  "/wiki/Sous-chef",
  "/wiki/File:Lando13.jpg",
  "/wiki/Platform_327",
  "/wiki/Bespin_Wing_Guard",
  "/wiki/Millennium_Collective",
  "/wiki/File:DiningWithADarth-TESB40.png",
  "/wiki/Troglof",
  "/wiki/Corovene_Manakor",
  "/wiki/Grand_Bespin_Hotel",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Rinetta_dining_room",
  "/wiki/File:BobaVaderLando.jpg",
  "/wiki/Torture",
  "/wiki/Force_vision",
  "/wiki/Imperial_Garrison_(Cloud_City)",
  "/wiki/Carbon-freezing_chamber",
  "/wiki/File:Brains_and_Brawn_SWL.png",
  "/wiki/Imperial_Military",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Stuncuffs",
  "/wiki/Wookiee",
  "/wiki/East_Platform",
  "/wiki/Slave_I",
  "/wiki/File:Lando_covering_fire.png",
  "/wiki/R2-D2",
  "/wiki/Duel_on_Cloud_City",
  "/wiki/Antenna",
  "/wiki/Executor",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/File:Galaxy1.png",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Fourth_Division",
  "/wiki/Rendezvous_Point_Delta-Three",
  "/wiki/Battle_at_Rendezvous_Point_Delta-Three",
  "/wiki/Ellian_Zahra",
  "/wiki/Backup_Rendezvous_Point_Gamma-Nine",
  "/wiki/Fleet",
  "/wiki/Arkanis",
  "/wiki/Boushh",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/File:All-In-SWL78.png",
  "/wiki/Prison",
  "/wiki/Slavery",
  "/wiki/Jedi_Knight",
  "/wiki/Pateesa",
  "/wiki/Rancor",
  "/wiki/Sarlacc",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Millennium",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/File:LandoSarlaccROTJ.png",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Khetanna",
  "/wiki/File:General_Lando.png",
  "/wiki/Battle_of_Taanab",
  "/wiki/Orbit",
  "/wiki/Forest",
  "/wiki/Moon",
  "/wiki/Endor",
  "/wiki/Space_station",
  "/wiki/Superweapon",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/Navy",
  "/wiki/Starfighter",
  "/wiki/Endor_strike_team",
  "/wiki/Taanab",
  "/wiki/File:Lando7.jpg",
  "/wiki/Sullustan",
  "/wiki/Nien_Nunb",
  "/wiki/Squadron",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Alliance_Military",
  "/wiki/Cruiser",
  "/wiki/Superlaser",
  "/wiki/Liberty",
  "/wiki/Nautilian",
  "/wiki/SLD-26_planetary_shield_generator",
  "/wiki/Reactor",
  "/wiki/Sensor",
  "/wiki/Rectenna",
  "/wiki/File:Celebration_on_Endor.png",
  "/wiki/Bright_Tree_Village",
  "/wiki/Ewok",
  "/wiki/File:Lando_meets_Iden_Versio.jpg",
  "/wiki/Galactic_Republic",
  "/wiki/Inferno_Squad",
  "/wiki/Iden_Versio",
  "/wiki/Operation:_Cinder",
  "/wiki/Del_Meeko",
  "/wiki/Shriv_Suurgav",
  "/wiki/Danger_Squadron",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/Restoration",
  "/wiki/Mellcrawler_II",
  "/wiki/Battle_of_Theed",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Sosha_Soruna",
  "/wiki/Lieutenant",
  "/wiki/Shara_Bey",
  "/wiki/Naboo",
  "/wiki/Satellite",
  "/wiki/Imperial_Army",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Iron_Blockade",
  "/wiki/Anoat_sector",
  "/wiki/Propaganda",
  "/wiki/Kars_Tal-Korla",
  "/wiki/Governor_Adelhard%27s_chamber",
  "/wiki/Liberation_of_Cloud_City",
  "/wiki/Ubrik_Adelhard%27s_Imperial_remnant",
  "/wiki/Battle_of_Jakku",
  "/wiki/New_Republic_soldier",
  "/wiki/Bolo_Tanga_room",
  "/wiki/Ben_Solo",
  "/wiki/Gladstone",
  "/wiki/Poison",
  "/wiki/Engineer",
  "/wiki/Unidentified_Imperial_sergeant",
  "/wiki/Sergeant",
  "/wiki/Rossmoyne_Vitiator_pistol",
  "/wiki/Vantillian_catamaran",
  "/wiki/File:Embo_and_Lando.jpg",
  "/wiki/Unidentified_space_station_(Lando_Calrissian)",
  "/wiki/Embo",
  "/wiki/7_ABY",
  "/wiki/Impresario",
  "/wiki/Twi%27lek",
  "/wiki/DRX-7",
  "/wiki/Phylanx_Redux_Transmitter",
  "/wiki/Fyzen_Gor",
  "/wiki/Chandrila",
  "/wiki/Lady_Luck",
  "/wiki/Han_and_Leia%27s_apartment",
  "/wiki/Corellian_whiskey",
  "/wiki/Chandrilan_monjav",
  "/wiki/Grand_Promenade_of_the_Rebellion",
  "/wiki/Hanna_City",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/New_Republic_Defense_Fleet_headquarters",
  "/wiki/Conder_Kyl",
  "/wiki/Slicer",
  "/wiki/Peekpa",
  "/wiki/Kashyyyk",
  "/wiki/Project_Resurrection",
  "/wiki/First_Order_Army",
  "/wiki/21_ABY",
  "/wiki/Sennifer%27s_Beam_and_Balance",
  "/wiki/Jedi_hunter",
  "/wiki/Ochi",
  "/wiki/Sith_Eternal",
  "/wiki/Quest_for_Exegol",
  "/wiki/Viceroy",
  "/wiki/Exim_Panshard",
  "/wiki/Mask_of_Viceroy_Exim_Panshard",
  "/wiki/Forbidden_Valley",
  "/wiki/Rey_Skywalker",
  "/wiki/Jakku",
  "/wiki/Komat",
  "/wiki/Dathan",
  "/wiki/Miramir",
  "/wiki/Neftali",
  "/wiki/Polaar",
  "/wiki/Bestoon_Legacy",
  "/wiki/28_ABY",
  "/wiki/Senator",
  "/wiki/Politics",
  "/wiki/Poe_Dameron",
  "/wiki/Finn",
  "/wiki/Mission_to_Pasaana_(Resistance)",
  "/wiki/Sith_Eternal_military",
  "/wiki/Jannah",
  "/wiki/File:LandosCrest.png",
  "/wiki/Hair",
  "/wiki/File:Landos_Millennium_Falcon_Fathead.png",
  "/wiki/File:X-8_Night_Sniper_EaW.png",
  "/wiki/Refugee",
  "/wiki/File:Lando_Calrissian_Charming_Gambler_TBG.png",
  "/wiki/Lando_Calrissian%27s_X-8_Night_Sniper",
  "/wiki/X-8_Night_Sniper",
  "/wiki/Pistol",
  "/wiki/Six-Card_Gizka_Limit",
  "/wiki/Spice",
  "/wiki/Aybarian",
  "/wiki/Unidentified_Aybarian_diplomat",
  "/wiki/File:LandoGambler-DK.png",
  "/wiki/Clothing",
  "/wiki/Beckon_call",
  "/wiki/Radio_transponder",
  "/wiki/Chit",
  "/wiki/Tailor",
  "/wiki/Skiff_Guard",
  "/wiki/Bone",
  "/wiki/Billy_Dee_Williams",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Idiot%27s_Array_(episode)",
  "/wiki/Star_Wars_Rebels_Season_One",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal",
  "/wiki/Lawrence_Kasdan",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Rian_Johnson",
  "/wiki/Rose_Tico",
  "/wiki/DJ",
  "/wiki/Donald_Glover",
  "/wiki/2018",
  "/wiki/Jon_Kasdan",
  "/wiki/2019",
  "/wiki/Star_Wars_saga",
  "/wiki/Reggie_Watts",
  "/wiki/March_18",
  "/wiki/2021",
  "/wiki/StarWars.com",
  "/wiki/June",
  "/wiki/May_7",
  "/wiki/Star_Wars_(2020)_14",
  "/wiki/File:PrideSW14SByrne.jpg",
  "/wiki/Stephen_Byrne",
  "/wiki/Star_Wars_Rebels:_Visual_Guide:_Epic_Battles",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/5-Minute_Star_Wars_Villain_Stories",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Lando%27s_Luck_(audiobook)",
  "/wiki/Lando_-_Double_or_Nothing_1",
  "/wiki/Lando_-_Double_or_Nothing_2",
  "/wiki/Lando_-_Double_or_Nothing_3",
  "/wiki/Lando_-_Double_or_Nothing_4",
  "/wiki/Lando_-_Double_or_Nothing_5",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_Meet_the_Crew",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_4",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_5",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Han_Solo_-_From_Smuggler_to_General",
  "/wiki/Choose_Your_Destiny:_A_Han_%26_Chewie_Adventure",
  "/wiki/Lost_Stars",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Always_Bet_on_Chopper",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_158",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Puffer_Problems",
  "/wiki/Star_Wars_Rebels_Magazine_21",
  "/wiki/Brothers_of_the_Broken_Horn",
  "/wiki/Forces_of_Destiny:_The_Leia_Chronicles",
  "/wiki/Off_the_Rails",
  "/wiki/Imperial_Supercommandos",
  "/wiki/The_Wynkahthu_Job",
  "/wiki/Trials_of_the_Darksaber",
  "/wiki/The_Occupation",
  "/wiki/Chewie_vs._Holochess_-_Let_the_Wookiee_Win",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/A_Leader_Named_Leia",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/You_Owe_Me_a_Ride",
  "/wiki/The_Angle",
  "/wiki/Star_Wars_(2015)_5",
  "/wiki/Star_Wars_(2015)_33",
  "/wiki/Star_Wars_(2015)_34",
  "/wiki/Star_Wars_(2015)_56",
  "/wiki/Star_Wars:_Commander",
  "/wiki/Lando_1",
  "/wiki/Lando_2",
  "/wiki/Lando%27s_Big_Score",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Lando_3",
  "/wiki/Lando_4",
  "/wiki/Lando_5",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_Adventures_Annual_2021",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Episode_V:_The_Empire_Strikes_Back_Read-Along_Storybook_and_CD",
  "/wiki/Faith_in_an_Old_Friend",
  "/wiki/Rendezvous_at_Bespin",
  "/wiki/Captured_on_Cloud_City",
  "/wiki/Fake_It_Till_You_Make_It",
  "/wiki/Into_the_Clouds",
  "/wiki/Due_on_Batuu",
  "/wiki/The_Witness",
  "/wiki/Clash_on_Cloud_City",
  "/wiki/The_Man_Who_Built_Cloud_City",
  "/wiki/Bespin_Escape",
  "/wiki/The_Backup_Backup_Plan",
  "/wiki/Star_Wars_(2020)_1",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/Right-Hand_Man",
  "/wiki/Star_Wars_(2020)_3",
  "/wiki/Star_Wars_(2020)_4",
  "/wiki/Star_Wars_(2020)_6",
  "/wiki/Star_Wars_(2020)_9",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars_(2020)_12",
  "/wiki/Star_Wars_(2020)_13",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/Star_Wars_(2020)_15",
  "/wiki/War_of_the_Bounty_Hunters_2",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/Star_Wars_(2020)_16",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/Star_Wars_(2020)_17",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Star_Wars_(2020)_18",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Star_Wars_(2020)_30",
  "/wiki/Star_Wars_(2020)_31",
  "/wiki/Revelations_1",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Rescue_from_Jabba%27s_Palace_(World_of_Reading)",
  "/wiki/Leia_and_Han_-_The_Han_Rescue",
  "/wiki/Blade_Squadron_(short_story)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_23",
  "/wiki/Shattered_Empire_3",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_2",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/The_Tree_of_Life",
  "/wiki/Life_Day_Treasury",
  "/wiki/Last_Shot_(audiobook)",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Join_the_Resistance",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/Star_Wars_Adventures_(2017)_10",
  "/wiki/Star_Wars_Adventures_(2017)_11",
  "/wiki/Star_Wars_Adventures_(2017)_16",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Star_Wars_Epic_Yarns:_The_Empire_Strikes_Back",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/Dealing_with_Lando/Han_and_Chewie_Strike_Back",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/The_Lost_Treasure_of_Cloud_City",
  "/wiki/Return_of_the_Kyber_Saber",
  "/wiki/A_New_Home",
  "/wiki/Beware,_the_Gamorrean_Flu!",
  "/wiki/Star_Wars_Epic_Yarns:_Return_of_the_Jedi",
  "/wiki/Return_of_the_Return_of_the_Jedi",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Exit_from_Endor",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/Flight_of_the_Falcon_(episode)",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/LEGO_Star_Wars:_The_Resistance_Rises",
  "/wiki/Hunting_for_Han",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/LEGO_Star_Wars_Summer_Vacation",
  "/wiki/A_Vader_Family_Sithmas",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Lando_Calrissian",
  "/wiki/Category:Images_of_Landonis_Balthazar_Calrissian",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/Classic_Moment",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Rebels_Recounted",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/The_Art_of_Star_Wars:_Uprising",
  "/wiki/Star_Wars:_Ships_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_63",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_ABC-3PO",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_X-Wing_Deluxe_Book_and_Model_Set",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_5",
  "/wiki/Droid_Directory",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Empire_at_War",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars_Helmet_Collection_43",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Solo",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Solo:_A_Star_Wars_Story:_Han_on_the_Run",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Lando%27s_Millennium_Falcon_Expansion_Pack",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/Millennium_Falcon_Expansion_Pack_(Second_Edition)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/YT-1300_Millennium_Falcon_Owners%27_Workshop_Manual",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Star_Wars:_Outer_Rim",
  "/wiki/LEGO_Star_Wars_Episode_IX:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Amazing_Sticker_Adventures",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/StarWarsKids.com",
  "/wiki/Gadgets_and_Gear",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_60",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_68",
  "/wiki/Starships_and_Speeders",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Millennium_Falcon_(Star_Wars_Encyclopedia)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_96",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/A_Galaxy_for_Everyone",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Star_Wars:_Legion",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2022",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Exploring_Tatooine",
  "/wiki/Databank_(website)",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/But_What_Does_He_Eat%3F",
  "/wiki/Del_Rey",
  "/wiki/File:New_Republic_Bloodline_Twitter_Post.jpg",
  "/wiki/Among_the_Clouds",
  "/wiki/May_18",
  "/wiki/2015",
  "/wiki/December_21",
  "/wiki/December_14",
  "/wiki/2017",
  "/wiki/March_29",
  "/wiki/May_17",
  "/wiki/June_25",
  "/wiki/File:JKasdan09252018.png",
  "/wiki/January_12",
  "/wiki/2020",
  "/wiki/File:ReggieWatts-LandoVoice-January-12-2020.png",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/32_BBY"
 ]
}