{
 "name": "Lanever_Villecham",
 "display_name": "Lanever Villecham",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tarsunt"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Hosnian Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarsunt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Lanever Villecham was a Tarsunt male politician who served as the Chancellor of the New Republic thirty years after the Battle of Endor. Villecham, a delegate to the Galactic Senate from the Mid Rim planet Tarsunt, was a believer in the peace initiatives that the New Republic carried out after the signing of the Galactic Concordance with the Galactic Empire at the end of the Galactic Civil War. As such, he focused his time in office on improved trade relations with neutral systems and, despite the insistence of General Leia Organa and the Resistance, did not consider the emerging First Order to be a threat. He perished on Hosnian Prime when the planet, then serving as the capital of the Republic, was destroyed by the First Order's Starkiller weapon.\nLanever Villecham served as a delegate to the Galactic Senate of the New Republic, hailing from the Mid Rim planet Tarsunt. Twenty-nine years after the Battle of Endor, Villecham was elected to serve as the Senate's chancellor. He focused his term in office on improving trade relations with neutral systems in the Trans-Hydian Borderlands, as they had been disaffected from the Republic for decades. His time in office also saw the rise of the First Order, a successor to the Galactic Empire. Villecham did not consider the First Order a threat so long as they abided by the dictates of the Galactic Concordance, a peace treaty marking the Empire's defeat to the Republic at the end of the Galactic Civil War. This was in contrast to the claims of General Leia Organa and the Resistance, who urged the Republic to consider military action against the resurgent Imperial power. Organa dispatched an envoy, Commander Korr Sella, to the Republic's then capital of Hosnian Prime to argue for a military build-up, but by then it was too late. Villecham, Sella, and the Senate were wiped out when the First Order targeted their superweapon, Starkiller Base, on Hosnian Prime and destroyed it, along with the Hosnian system.\nLanever Villecham was a Tarsunt male with white hair, black eyes, and yellow skin. He was a believer in the peace initiatives of the New Republic and would not consider a renewed conflict so long as the First Order did not violate the Galactic Concordance, which they ultimately did by destroying Hosnian Prime—costing Villecham his life.\nLanever Villecham first appeared in Star Wars: Episode VII The Force Awakens. While he was not identified onscreen, his name was revealed in Star Wars: The Force Awakens: The Visual Dictionary, a 2015 reference book by Lucasfilm Story Group member Pablo Hidalgo. He was portrayed by Derek Arnold, who did not receive any credit.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Tarsunt_(planet)",
  "/wiki/34_ABY",
  "/wiki/Hosnian_Prime",
  "/wiki/Tarsunt",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Senate",
  "/wiki/Politics",
  "/wiki/Chancellor_(New_Republic)",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Galactic_Concordance",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Civil_War",
  "/wiki/Time",
  "/wiki/Star_system",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Resistance",
  "/wiki/First_Order",
  "/wiki/Death",
  "/wiki/Capital",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Starkiller_Base",
  "/wiki/Superweapon",
  "/wiki/33_ABY",
  "/wiki/Trans-Hydian_Borderlands",
  "/wiki/Standard_decade",
  "/wiki/Commander",
  "/wiki/Korr_Sella",
  "/wiki/Hosnian_system",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/2015",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Derek_Arnold",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Mon_Mothma",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Aftermath_(novel)"
 ]
}