{
 "name": "Lane_Ferow",
 "display_name": "Lane Ferow",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Avesta Militia"
     ]
    }
   ]
  }
 ],
 "content": "Lane Ferow was a male Human who lived on the planet Makeb where he worked as an accountant. When the Hutt Cartel attempted to take over Makeb, Ferow joined up with the Avesta family's militia who had sided with the Galactic Republic in an attempt to drive the Hutts off Makeb. Despite his inexperience with combat, Ferow was amongst militia forces sent to retrieve Lemda Avesta, one the Avesta family who had been investigating connections between the Hutts and a series of groundquakes that had occurred since their arrival. The militia was unable to get to her though as InterStellar Regulators, a mercenary group working for the Hutts, pushed them back to the landing zone in the Western Camps of the Frinn Mesa. There they held out until a Republic hero arrived to help get Avesta, at which point Ferow and Prosk, another militia member, greeted the hero and asked for orders. Before the Hero had a chance to give any, a group of Regulators attacked the landing zone, but the Militia and regulators held them off. Ferow then gave the hero all the information they had on Lemda and her possible location so that she could be rescued.\nFerow had very little experience with a blaster but still joined up with the militia to take back his home from the Hutts. While holding out on the Frinn Mesa, he became scared and was relieved to see reinforcements but after seeing off a Regulator attack became more confident.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Avesta_Militia",
  "/wiki/Planet/Legends",
  "/wiki/Makeb",
  "/wiki/Accountant/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Conquest_of_Makeb",
  "/wiki/Avesta_family",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Lemda_Avesta",
  "/wiki/Groundquake/Legends",
  "/wiki/InterStellar_Regulators",
  "/wiki/Mercenary/Legends",
  "/wiki/Frinn_Mesa",
  "/wiki/Prosk",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}