{
 "name": "Langstyn Kraay",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Moff Kentor Sarne's forces"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Langstyn Kraay was a Human male, and administrator of the Q'Maere Research Facility.\nLangstyn Kraay was a medical student with family connections to COMPNOR. Considered to be generally lackluster, he discovered his true calling of \"personality reconstruction\" while interring at a COMPNOR hospital's psych ward. With this newfound talent, Kraay's grades improved, and he graduated in the top quarter of his class. Joining the ISB's Re-Education branch, he quickly moved up through the ranks.\nWith the collapse of the Galactic Empire and the fracturing of COMPNOR, Kraay was handpicked by Moff Kentor Sarne to head the penal colony on Q'Maere. Kraay accepted the challenge eagerly.\nKraay's tenure as the facility's director was indifferent; he preferred to leave the actual administration of the facility to the various department heads while he concentrated on \"curing\" the facility's dangerous patients. When Moff Sarne stripped the facility of most of its staff and marooned the rest, Kraay became desperate to leave the facility.\nSeveral weeks later, the New Republic corvette FarStar arrived at the facility, suffering from spoiling food stores caused by a bacteria mutation. Seeing a way to get off the planet, Kraay took the ship's landing party hostage. Contacting the FarStar, he demanded that the crew surrender the ship within twelve hours, or he would destroy the food stores on the planet. He also decreed that for every hour past the deadline that the crew delayed, a randomly selected hostage would be killed.\nHowever, Kraay was not a military man, and could not stop the FarStar hostage joining forces with the prison population to stage a jailbreak and take control of the facility. When the landing party stormed the operations center of the facility, he attempted to erase the formula of the antidote to the bacteria mutation, known as Variant Alpha, from the computer files and destroy the last sample. The FarStar crew managed to overpower him and take control of the facility.\nKraay was an eager and enthusiastic scientist, who strove to overcome challenges. He enjoyed his work as a \"personality engineer,\" curing patients and breaking strong minds. He often presented a cool exterior to mask his true feelings, but following his stranding at the facility, occasional flashes of panicked anger would show through.\nKraay was not a military man and, during his capture of the FarStar landing party, displayed his ineptitude by making certain tactical mistakes that allowed the crewmembers to escape and gain control of the facility.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Moff_Sarne%27s_forces",
  "/wiki/Doctor/Legends",
  "/wiki/Q%27Maere_Research_Facility",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Imperial_Security_Bureau/Legends#Re-Education",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Q%27Maere",
  "/wiki/New_Republic/Legends",
  "/wiki/FarStar",
  "/wiki/Bacteria_mutation",
  "/wiki/Variant_Alpha",
  "/wiki/Scientist/Legends",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/Harm%27s_Way",
  "/wiki/The_Kathol_Rift"
 ]
}