{
 "name": "Lanklyn",
 "display_name": "Lanklyn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3642 BBY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light-Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Facial implants"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lanklyn was a male Human Commander of the reconstituted Sith Empire during the Cold War.\nIn 3643 BBY Lanklyn was to deliver a frozen carbonite body of a Republic spy Grik Sonosan to Darth Baras on Dromund Kaas. When arriving at Docking Bay 12 of Kaas City spaceport, he was to wait for Baras's apprentice and help deliver it to him.\nHowever when the apprentice arrived, Lanklyn and his men were ambushed by two thugs, Slestack who was to capture the body and deliver it to his master; and TuMarr who wanted it for himself. However whilst Slestack, TuMarr and their men were distracted fighting each other; Lanklyn and his men were able to quickly deliver the body without getting harmed. The two thugs and their crew quickly killed each other and Baras's apprentice went to report about the successful mission.\nLanklyn and Baras's apprentice met again on Hoth where Lanklyn was tracking the Jedi Master Xerender for Darth Baras. Lanklyn went out to search for the Jedi with his men, but got himself captured and was only saved because Ensign Slinte provided the Sith with Lanklyn's last known location. Lanklyn reported that Xerender had a squad of Talz commandos at his disposal, which he used to cover his tracks as he approached his true objective: the Jedi Master Wyellett. Lanklyn, Slinte and the Sith later gathered to report Darth Baras on their progress, but during the holocall Xerender was able to tap into the message. Angered at the failure, Baras Force-chocked Lanklyn, despite being on the other side of the galaxy, and promoted Ensign Slinte to Commander of his operations on Hoth.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3642_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Darth_Baras",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Commander/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Carbonite/Legends",
  "/wiki/Grik_Sonosan",
  "/wiki/Dromund_Kaas",
  "/wiki/Dromund_Kaas_spaceport",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Slestack",
  "/wiki/TuMarr",
  "/wiki/Hunt_for_Xerender",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Xerender",
  "/wiki/Jedi/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/Slinte",
  "/wiki/Talz/Legends",
  "/wiki/Wyellett",
  "/wiki/The_galaxy/Legends"
 ]
}