{
 "name": "Lanoree Brock",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    },
    {
     "name": "Born",
     "values": [
      "25",
      "818 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Ter'cay",
      "Kin'ade",
      "Dam-Powl"
     ]
    }
   ]
  }
 ],
 "content": "Lanoree Brock was a Human female Je'daii Ranger that lived during the Force Wars; the sister of Dalien Brock.\nLanoree Brock was a Force-sensitive Human female and the daughter of two Je'daii Masters. Growing up around the Temple of Arts, called Bodhi, on Tython with her younger brother Dalien, Brock developed a protective bond with her brother and the two studied together at Padawan Kesh before setting out on their Great Journey together.\nBrock's Great Journey began when she was teenaged. With her brother Dalien, Brock traveled to Qigong Kesh, the Temple of Force Skills, surviving encounters with hook hawks and silik lizards along the way. There, they trained under Master Ter'cay, who took them to the Silent Desert, using Force telepathy to communicate with Brock. During this time, Brock found that Dalien was unable to hear Ter'cay in the Force. While at Qigong Kesh, Brock expanded her knowledge of the Force, learning suggestion, telepathy, and control.\nAfter studying at Qigong Kesh, Lanoree and Dalien traveled to Stav Kesh, the Temple of Martial Arts. En route, they were attacked by a flame tygah. Though Brock intended to let her brother defeat the creature himself to avoid showing him his inadequacy, she was forced to intervene when Dalien's blaster misfired, and she used the Force to drive off the beast. At Stav Kesh, the two trained with Master Tave, first learning about breathing and its importance to fighting. Throughout their training, Lanoree tried to keep Dalien from fleeing the Force, refusing to believe he had successfully landed a strike on Tave due to his own skill.\nIn one incident, when Master Kin'ade led a training session that required the Journeyers to fight while deprived of their physical senses against a Darrow sphere, Dalien ended up shooting wildly with his blaster, injuring Brock and possibly other Journeyers, before he was knocked unconscious by Kin'ade. After the incident, Kin'ade, Lanoree, and Dalien were all asked to give their accounts of the event to Temple Master Lha-Mi. On their last day at Stav Kesh, a group of Journeyers, including the Brocks, were asked to fight one other. Lanoree found herself holding back and not using the Force against Dalien, but ultimately knocked him back with a Force punch, ending the fight. Before their departure, Lha-Mi warned Lanoree to be wary of her brother, saying that Dalien was growing increasingly unstable and dangerous.\nLanoree and Dalien then traveled to Anil Kesh, the Temple of Science. Along the way, they crossed the Moon Channel unescorted, working together to survive attacks by a gelfish swarm and a sea serpent. Upon arrival, Lanoree felt sick due to the Force Storms caused by the Chasm, which lay beneath the temple. At Anil Kesh, she found her calling in science and alchemy, and learned from Master Dam-Powl, who said she had the opportunity to be her greatest pupil. In the process of immersing herself in her studies, Brock began to put herself before her brother, and she began to learn the alchemy of flesh from Dam-Powl.\nDuring their stay at Anil Kesh, Dalien and Lanoree were separated for four days, while Dalien went to the Riftlands with Master Quan-Jang. However, Dalien fled into the Abyss of Ruh. Master Quan-Jang and other Je'daii successfully captured Dalien and returned him to Anil Kesh, where he met Lanoree and another Journeyer, Skott Yun. Yun attempted to arrest Dalien, but Dalien killed Yun and escaped. Brock pursued her brother alone across the Red Desert and into the Old City, but heard her brother scream and found only his bloodied, shredded clothes, leading her and the Je'daii to believe Dalien had been killed.\nUltimately, Brock completed her Great Journey without Dalien, eventually ending her Journey at Mahara Kesh, where she learned about using the Force for healing.\nAt some point Brock was a negotiator on Ska Gora and before she was able to finish the negotiations there one of the parties were killed and forests were set on fire.\nAround 25,793 BBY Brock and fellow Je'daii Ranger Hawk Ryo were sent to Zerist by the Je'daii Council to prevent fighting between the Dessain Mining company and its miners, who were fighting over whether the miners would get a vote in how the company was run, and to find the kidnapped girl Oma Dessain. As Eomin Dessain, the leader of Dessain's management, refused to allow anyone who wasn't family to run the company, Oma was to marry Brom Santis, the leader of the miners Arko Santis' oldest son, as the marriage would allow Brom to be the voice of the miners. Brock acted as in intermediate to both parties while Ryo searched for Oma. Brock was later commed by Ryo who told her that it was possible that his crime lord brother, Baron Volnos Ryo, may have been involved in the girl's kidnapping and that he might have found where they were holding her.\nAfter discovering that both parties were at their breaking points Brock fired her slugthrower into the ceiling to gather everyone's attention and suggested that they restart their negotiations. After Ryo rescued Oma Betolo, Eomin's servant, poisoned Brock's drink, Vaisamond red wine, in an attempt to kill her. She used the Force to stop him as he attempted to escape, and Betolo revealed the reason he betrayed the Dressians' and stated that with any luck Oma was dead. Ryo later returned Oma to Eomin and Oma refused to marry Brom. As she sympathized with Oma, Brock suggested that both families participate in the practice called Fostering.\nThe practice would have both children live with the others family for six months, allowing Brom to be the voice of the miners and Oma would learn about the miners live's firsthand. After both parties agreed to the suggestion and the details were worked out Brock and Ryo later met at the local spaceport and went their separate ways. Brock was returning to Tython after being summoned back by the Je'daii Council for her next mission, and Ryo was heading out to Furies Gate to meditate.\nOn Tython, Brock had a covert meeting with six Masters from the Je'daii Council, where she was told that her long-lost brother Dalien, thought dead, was alive. Leading the Stargazers, he was now attempting to activate a hypergate in the ruins of the Old City using dark matter, which could potentially destroy the entire system. Shortly before departing Tython, Brock is handed a message pod with a recording from Master Dam-Powl, informing Brock about a Twi'lek named Tre Sana on Kalimahr, who was not a Je'daii but might be of assistance. Though she said Sana had served her well several times before, Dam-Powl warned Brock to be wary of him, calling him dangerous.\nTo meet with Sana, Brock traveled to Rhol Yan, a city-state on Kalimahr. During the meeting, Brock learned that what drove the hypergate might be of Gree origin. Brock subsequently survived an attempt on her life made by a Noghri assassin, who attempted to kill her with two blasters, then a suicide bomb. From Lorus, a Sith who was captain of the local militia, Brock learned that the Noghri had been a Stargazer, and learned about Kara, an individual who was not openly affiliated with the sect but rich and rumored to fund them.\nSana subsequently took Brock to meet with Kara. From Kara, Brock learned that the Stargazers use an old abandoned Dai Bendu temple owned by Kara, and when Kara insisted that her visitors leave, Sana incapacitated the woman with a stun tube, allowing Brock and Sana to search the room. Brock managed to find a thin book on the Gree by Osamael Or in Kara's library, escaping with Sana by jumping out the window and landing on her Peacemaker, which was piloted by her ship droid, Ironholgs.\nBrock and Sana traveled to the Dai Bendu temple, only to find that it had been quickly abandoned. Brock found signs that Dalien had been at the temple, but she and Sana were forced to flee when Sana discovered a timed bomb; the bomb destroyed the temple, but Brock and Sana escaped in the Peacemaker unharmed. From a comm unit recovered by Sana before the explosion, Ironholgs determined that the Stargazers had been communicating to individuals on the planet Nox.\nThe trail led Brock and Sana to Greenwood Station, where the most advanced military technology outside of Tython was made. From one of Sana's contacts, a Zabrak named Domm, Brock and Sana succeeded in extracting the whereabouts of Maxhagan, who they believed would be able to find Dalien's location. After searing Domm's memory, Brock traveled with Sana to District Six, where Maxhagan ran a stall selling imported water. They hired Maxhagan to find Dalien, and Maxhagan later reported that Dalien was in Pan Deep, a location in the base of Greenwood Station's central tower.\nBrock and Sana made their way into Pan Deep, only to be captured by Dalien and his Stargazers. There, they found that the device for activating the hypergate had been completed. Dalien was unwilling to kill his sister, so he left Pan Deep with the Stargazers, leaving one Cathar Stargazer behind to kill Brock once he had left. Though a distraction from Sana allowed Brock to blind the Cathar, the pair only narrowly survive the Cathar's suicide bomb.\nDespite being injured from their capture and the explosion, Brock and Sana managed to escape Pan Deep to Greenwood Station, where they found that Dalien had initiated a bloody conflict between Greenwood Station and Knool Tandoor to cover his escape. Unable to do anything about the violence, Brock and Sana were forced to simply escape Nox, shooting down their pursuers.\nUsing a tracker she had managed to plant on Dalien's boot in Pan Deep, Brock followed his ship to Ran Dan's Folly, a small mining output on Sunspot, where she believed he would charge the device in preparation for the hypergate. Alone, Brock entered the mine, but was distracted by the intense heat and knocked unconscious by the Stargazers. Though she awakened, she was unable to stop Dalien from charging his device with a marionium cube. Before departing again, Dalien shot her in the chest, leaving her for dead.\nFortunately for Brock, Sana came to her rescue, bringing her back to the Peacemaker, where Brock healed her blaster wound with her skills in the alchemy of flesh. Brock and Sana subsequently escaped Sunspot as Malterra passed close by, causing magnetic interference and space storms that destroyed Ironholgs but not the Peacemaker.\nBrock slept as the Peacemaker approached Tython, dreaming repeatedly of a cloaked figure during their approach. When she landed, she found a Force storm brewing, which had caused Dalien's craft to crash. Brock and Sana pursued Dalien and his remaining Stargazers into the Old City. Along the way, Sana was shot in the neck, and Brock continued on to meet Dalien alone, finding him as he was about to activate the hypergate.\nThere, Brock attempted to stop Dalien by pushing a memory of them together in their childhood into his mind, followed by images of the horrors she had witnessed from Nox, Sunspot, and Tython during her pursuit. Instead of fleeing, Dalien instead attacked Brock in a rage, throwing a blade into her palm and hitting her repeatedly. However, with the help of the Force, Brock was able to defeat her brother, using her sword to block his knife attacks. When Dalien leapt at the device, she was forced to kill him.\nAfter the fight, Brock brought the injured Sana back to Anil Kesh for treatment. Though she and Dam-Powl sensed that she was out of balance due to killing her brother, Brock believed she would not fall. Brock subsequently traveled alone to Kalimahr, only to find that Kara and other high-profile members of the Rhol Yan community had disappeared, leaving Brock suspecting that Dalien and his people had only been tools for Kara and others like her.\nLanoree Brock was a human female with auburn hair, gray eyes, and tan skin. Brock sometimes wore exotic accessories from the many planets she had visited during her travels as a Ranger, including scarves from Kalimahr, bangles with precious stones from Ska Gora, and a leather sword sheath made from the skin of a screech lizard, from one of Obri's moons. At six feet tall, Brock believed that she cut an imposing figure.\nAs a child, Brock was very protective of her younger brother Dalien, and proud when she was able to save her brother's life. She was pained that her brother rejected the Force, and constantly tried to bring him to embrace the Force as she had. During her Great Journey, Brock believed that her parents had made her brother her responsibility and felt a strong sense of obligation to her brother, chasing him alone to the Old City when he killed a fellow Journeyer and fled Anil Kesh.\nAs a Ranger, Brock enjoyed exerting herself physically, believing that strength in the Force was tied to strength in body. She also enjoyed challenging herself, choosing to manually calculate optimum flight paths as a way to test herself, rather than simply relying on her computer. She also felt possessive of her Peacemaker, viewing it as her home and heavily customizing both the ship and her ship droid, Ironholgs for functionality. Brock preferred to keep to herself; she was uncomfortable with having someone else aboard her ship, and enjoyed talking to herself or Ironholgs. She would sometimes record entries in her ship log about her thoughts regarding her latest missions.\nBrock was haunted by the result of the negotiations on Ska Gora. Brock believed that Oma Dessain didn't have to participate in the arranged marriage, in order for the miners to have a voice in how Dessain Mining would be run.\nLanoree Brock was comfortable with her strength and balance in the Force, and was quite powerful in the Force, able to shield herself from harm against an explosion at point-blank range.\nShe was also proficient in the use of telekinesis. However, her greatest talent lay in the alchemy of flesh. Master Dam-Powl recognized Brock's talents and took her in as a student, believing Brock had the potential to be her greatest pupil. This ability allowed Brock to sear Domm's memory, preventing him from remembering anything for some time, and to survive being shot in the chest with a blaster, leaving her skin rough and scarred but intact.\nBrock was able to understand the body language aspect of Twi'leki, seemingly surprising Tre Sana, though he claimed nothing about the Je'daii could surprise him.\nLanoree Brock first appeared in Tim Lebbon's blog on kindlepost.com in short story The Adventures of Lanoree Brock, Je'daii Ranger posted on website in April 24, 2013. A few days later she appeared in John Ostrander's short story Eruption which was published in Star Wars Insider 141 and released on April 30, 2013. Brock later appeared in Tim Lebbon's novel Dawn of the Jedi: Into the Void which was released on May 7.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Brock_(disambiguation)",
  "/wiki/Tython/Legends",
  "/wiki/25,818_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Ter%27cay",
  "/wiki/Kin%27ade",
  "/wiki/Dam-Powl",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Force_Wars",
  "/wiki/Dalien_Brock",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Lanoree_Brock%27s_mother",
  "/wiki/Lanoree_Brock%27s_father",
  "/wiki/Je%27daii_Master",
  "/wiki/Bodhi",
  "/wiki/Padawan_Kesh",
  "/wiki/Great_Journey",
  "/wiki/Qigong_Kesh",
  "/wiki/Hook_hawk",
  "/wiki/Silik_lizard",
  "/wiki/Silent_Desert",
  "/wiki/Telepathy/Legends",
  "/wiki/Stav_Kesh",
  "/wiki/Flame_tygah",
  "/wiki/Tave",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Lha-Mi",
  "/wiki/Force_punch",
  "/wiki/Anil_Kesh",
  "/wiki/Moon_Channel",
  "/wiki/Gelfish",
  "/wiki/Sea_serpent",
  "/wiki/Force_Storm_(Tython)",
  "/wiki/Chasm",
  "/wiki/Alchemy_of_flesh",
  "/wiki/Quan-Jang",
  "/wiki/Abyss_of_Ruh",
  "/wiki/Skott_Yun",
  "/wiki/Red_Desert",
  "/wiki/Old_City_(Tython)",
  "/wiki/Mahara_Kesh",
  "/wiki/File:Into_the_Void_second_sketch_revised.jpg",
  "/wiki/Ska_Gora",
  "/wiki/Death/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Fire/Legends",
  "/wiki/25,793_BBY",
  "/wiki/Hawk_Ryo",
  "/wiki/Zerist",
  "/wiki/Je%27daii_Council",
  "/wiki/Dessain_Mining",
  "/wiki/Miner/Legends",
  "/wiki/Oma_Dessain",
  "/wiki/Eomin_Dessain",
  "/wiki/Dessain_family",
  "/wiki/Marriage/Legends",
  "/wiki/Brom_Santis",
  "/wiki/Arko_Santis",
  "/wiki/Comlink/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Brother/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Volnos_Ryo",
  "/wiki/Slugthrower/Legends",
  "/wiki/Betolo",
  "/wiki/Servant",
  "/wiki/Poison/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Vaisamond_red_wine",
  "/wiki/The_Force/Legends",
  "/wiki/Fostering",
  "/wiki/Standard_month/Legends",
  "/wiki/Furies_Gate",
  "/wiki/Meditation/Legends",
  "/wiki/Stargazers",
  "/wiki/Hypergate",
  "/wiki/Dark_matter/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Tre_Sana",
  "/wiki/Kalimahr",
  "/wiki/Rhol_Yan",
  "/wiki/Noghri/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Lorus",
  "/wiki/Kara_(Je%27daii)",
  "/wiki/Order_of_Dai_Bendu",
  "/wiki/Gree/Legends",
  "/wiki/Osamael_Or",
  "/wiki/Peacemaker-class_cruiser",
  "/wiki/Ironholgs",
  "/wiki/Nox",
  "/wiki/Greenwood_Station",
  "/wiki/Zabrak/Legends",
  "/wiki/Maxhagan",
  "/wiki/Ran_Dan%27s_Folly",
  "/wiki/Sunspot/Legends",
  "/wiki/Marionium",
  "/wiki/Malterra",
  "/wiki/Tau_(individual)",
  "/wiki/Gray",
  "/wiki/Eye/Legends",
  "/wiki/Screech_lizard",
  "/wiki/Obri",
  "/wiki/Old_City",
  "/wiki/Telekinesis/Legends",
  "/wiki/Twi%27leki/Legends",
  "/wiki/Tim_Lebbon",
  "/wiki/The_Adventures_of_Lanoree_Brock,_Je%27daii_Ranger",
  "/wiki/April_24",
  "/wiki/John_Ostrander",
  "/wiki/Eruption",
  "/wiki/Star_Wars_Insider_141",
  "/wiki/April_30",
  "/wiki/2013",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/May_7",
  "/wiki/Star_Wars_Insider",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/April_29",
  "/wiki/2015"
 ]
}