{
 "name": "Lanoree Brock's father",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Xiang"
     ]
    }
   ]
  }
 ],
 "content": "Lanoree Brock's father was a male Human and a Je'daii Master who taught at Bodhi, the Temple of Arts, for the Je'daii Order on Tython at the height of the Infinite Empire's reign.\nTrained as a member of the Je'daii Order, Brock met his future wife met as Journeyers crossing the planet Tython on their Great Journey. Both of the young Je'daii were drawn to Bodhi Temple where the Force exposed their natural talents in the arts. A talented sculptor renowned across Masara continent, Brock was also skilled at cooking rumbat stew. Years after their Journey ended, Brock and his wife became the parents of Lanoree and Dalien Brock. Living in the Je'daii settlement surrounding the Temple of Arts, Brock taught at Bodhi, amusing his students and colleagues with his magic tricks. One of his students, Master Xiang, would later go on to teach under his watch. When his children were growing up, he would tell them tales and legends from Je'daii history, including a cautionary tale of Osamael Or and his fateful mission into the Old City.\nDuring the war between Tython and Despot Queen Hadiya and her army, Brock served some of his time on the planet Nox where the fighting was especially vicious. Following the war and the supposed death of his son, Brock rarely saw his daughter, who had become a Je'daii Ranger by the time of Dalien's reemergence during the Stargazer Uprising.\nBrock wore his hair long, usually tied up, but allowed it to fall across his shoulders when at home. Brock believed that his son's inquisitive nature was a sign that he would make a fine Je'daii in time; he always believed that Dalien would find his own way. When spending time with his children, Brock would often take them to the Edge Forest where his explorer's heart would yearn to venture into its vastness.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Brock_(disambiguation)",
  "/wiki/Tython/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Xiang",
  "/wiki/Je%27daii_Master",
  "/wiki/Bodhi",
  "/wiki/Infinite_Empire",
  "/wiki/Lanoree_Brock%27s_mother",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Planet/Legends",
  "/wiki/Great_Journey",
  "/wiki/The_Force/Legends",
  "/wiki/Sculptor/Legends",
  "/wiki/Masara",
  "/wiki/Rumbat",
  "/wiki/Lanoree_Brock",
  "/wiki/Dalien_Brock",
  "/wiki/Osamael_Or",
  "/wiki/Old_City_(Tython)",
  "/wiki/Despot_War",
  "/wiki/Despot_Queen",
  "/wiki/Hadiya",
  "/wiki/Despot_Army",
  "/wiki/Nox",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Stargazer_Uprising",
  "/wiki/Edge_Forest",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Lanoree_Brock%27s_father",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}