{
 "name": "Lanoree_Brock%27s_mother",
 "display_name": "Lanoree Brock's mother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    }
   ]
  }
 ],
 "content": "Lanoree Brock's mother was a female Human Je'daii Master who served as instructor at Bodhi, the Temple of Arts, for the Je'daii Order on Tython at the height of the Infinite Empire's reign.\nTrained as a member of the Je'daii Order, she met her future husband as Journeyers crossing the planet Tython on their Great Journey. Both of the young Je'daii were drawn to Bodhi Temple where the Force exposed their natural talents in the arts. A talented musician with a speciality for prose and poetry, she was on the track to become a Je'daii of some renown. Years after their Journey ended, she and her husband became the parents of Lanoree and Dalien Brock. Living in the Je'daii settlement surrounding the Temple of Arts, Brock taught at Bodhi, and in the evenings would read poetry to her children before they slept. When her children were growing up, she would teach them the basics of touching another's mind and the survival skills necessary to live on Tython.\nDuring the war between Tython and Despot Queen Hadiya and her army, Brock served some of his time on the planet Nox where the fighting was especially vicious. Following the war and the supposed death of her son, Brock comforted her daughter at Dalien's memorial ritual by assuring her that not everyone completed their Journey. Afterwards, she rarely saw her daughter, who had become a Je'daii Ranger by the time of Dalien's reemergence during the Stargazer Uprising. Following the Stargazer Uprising, Lanoree returned to Bodhi Temple and to her parents' house for her brother's second Remembrance Ceremony after she had killed him in service to the Order.\nBrock was a loving mother who expressed deep concern for her son. When her children were about to leave on their Great Journey, she pulled her daughter aside and asked her to look after Dalien, as she sensed his middling Force ability. Tearing up as she speaks of her fears that Dalien will be drawn away from Tython, she insisted to her daughter that her worry is genuine and that her son's interest in the distant past troubled her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Brock_(disambiguation)",
  "/wiki/Tython/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Je%27daii_Master",
  "/wiki/Bodhi",
  "/wiki/Infinite_Empire",
  "/wiki/Lanoree_Brock%27s_father",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Planet/Legends",
  "/wiki/Great_Journey",
  "/wiki/The_Force/Legends",
  "/wiki/Musician/Legends",
  "/wiki/Poet/Legends",
  "/wiki/Lanoree_Brock",
  "/wiki/Dalien_Brock",
  "/wiki/Mind_trick/Legends",
  "/wiki/Despot_War",
  "/wiki/Despot_Queen",
  "/wiki/Hadiya",
  "/wiki/Despot_Army",
  "/wiki/Nox",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Stargazer_Uprising",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}