{
 "name": "Lant_Davan",
 "display_name": "Lant Davan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Bothan-5"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Correctional Corps",
      "New Republic Correctional Corps"
     ]
    }
   ]
  }
 ],
 "content": "Lant Davan, designated \"DC1,\" was a human male soldier and corrections officer who held the rank of lieutenant within the New Republic Correctional Corps. He served as the sole organic crew member on the correctional transport Bothan-5. In 9 ABY, Davan was present in the transport's control room when a team of mercenaries infiltrated it to free a prisoner.\nDuring a heated confrontation, Davan pointed his blaster at the criminals and held up a tracking beacon, threatening to alert the New Republic of their infiltration. He was killed when the mercenary Xi'an threw a dagger at him, despite the Mandalorian Din Djarin's efforts to prevent any killing, but not before the soldier activated the beacon. Most of the mercenaries ended up trapped aboard Bothan-5 during their infiltration, with the team leader Migs Mayfeld receiving a fifty-year sentence at the Karthon Chop Fields for his involvement in the mission and Davan's death.\nIn 9 ABY, Lant Davan—using the designation \"DC1\"—served as a soldier and corrections officer in the New Republic Correctional Corps, holding the rank of lieutenant. He was the sole organic crew member and prison guard of Bothan-5, one of the New Republic's most secure correctional transports, which was additionally guarded by New Republic security droids. At some point, the transport was boarded near the Dilestri system by a team of mercenaries who sought to rescue the prisoner Qin. After defeating a number of New Republic N5 sentry droids, they arrived at the control room where Davan was based. The soldier sprang up from his seat and aimed his A-180 blaster at the four mercenaries. Despite telling the infiltrators to put down their blasters, Davan was slowly surrounded by them.\nDavan held up a homing beacon—which would call in New Republic reinforcements—in an attempt to threaten the mercenaries. The team leader, Migs Mayfeld, told the soldier to put the beacon down, calling him an \"egghead.\" While the leader and two of the other mercenaries wished to kill the soldier, the Mandalorian bounty hunter Din Djarin opposed the idea, attempting to negotiate with Davan. Mayfeld intervened, insisting on killing the soldier. Djarin argued with Mayfeld and the Devaronian Burg to keep Davan alive, igniting a tense standoff between the three while the corrections officer watched, slightly lowering his blaster. The remaining mercenary, the Twi'lek Xi'an, then threw a dagger at the soldier, killing him, but not before he activated the beacon. After Davan's murderer removed her dagger from his chest, the mercenaries realized that New Republic reinforcements were on the way.\nThe mercenaries left the control room and found Qin, and they turned on Djarin and lock him inside a cell. The Mandalorian, however, escaped and returned to the control room, where Davan's corpse still lay. Djarin took Davan's beacon and then trapped the other mercenaries on Bothan-5 before fleeing with Qin. The Mandalorian planted Davan's beacon on the prisoner and delivered him to the space station where his client waited, leading the New Republic reinforcements there.\nFor his association with Davan's death and Qin's escape, Mayfeld was sentenced to fifty years at the Karthon Chop Fields, a New Republic correction facility prison moon of Karthon. Djarin's attempt to preserve Davan's life was captured on the correctional transport's security logs. When two New Republic pilots intercepted the Mandalorian at the ice planet Maldo Kreis, the pair pulled up Bothan-5's security logs and chose to let Djarin go; one of them, Carson Teva, listed his actions involving Davan as one of the reasons.\nLant Davan was a human male with light skin, brown hair, and blue eyes. An anxious officer, he was frightened upon seeing Din Djarin and his team enter the control room, ordering them to drop their blasters in a stuttering manner to no avail. When the team surrounded him, Davan swiftly revealed a tracking beacon as a threat, breathing heavily as tensions rose. When Djarin attempted to reason with him, asking for his name, Davan stammered in his response.\nDavan wore a blue uniform with a New Republic insignia on the left shoulder. He wore white shoes that resembled those of an Imperial stormtrooper. Mayfeld sarcastically remarked that the shoes matched Davan's belt, which displayed an officer's disk upon the buckle. Davan also wore a white helmet with a black tinted visor—the same type as the ones used by the Alderaanian consular security. Davan's designation, \"DC1,\" was printed in Aurebesh on the right side of the helmet. He possessed both a holstered A-180 blaster and a tracking beacon.\nLant Davan first appeared in \"Chapter 6: The Prisoner,\" the sixth episode of the first season of the live-action television series The Mandalorian. The episode aired on December 13, 2019 on Disney+. Credited as \"New Republic soldier\" in the episode's end credits, the character was portrayed by Matt Lanter, who had previously voiced the character Anakin Skywalker in various Star Wars media such as Star Wars: The Clone Wars, as a small cameo for the episode. In the episode, when Djarin and Burg fight in the control room, Davan's body is positioned differently to how it had fallen in his death scene, having moved to the corner of the room. The 2021 reference book Star Wars: The Mandalorian Handbook by Matt Jones introduced Davan's first name, Lant, made up of the first four letters of Matt Lanter's last name.\nDavan was conceived by artists Brian Matyas and Doug Chiang, who intended to represent a \"cleaner and more romanticized\" version of the Alderaanian Fleet Trooper from the 1977 original trilogy film, Star Wars: Episode IV A New Hope, as a way of showing the progression of the troopers after a few years of the New Republic being in power. The art used was titled \"New Republic police version 2C.\"\nAccording to Lanter, he was asked to play Davan by former The Clone Wars director Dave Filoni, the executive producer of The Mandalorian, through the actor's agent. The filming for \"Chapter 6: The Prisoner,\" including Davan's scene, took place from January 25 to February 2 of 2019. Lanter expressed enjoyment in taking part in the series, comparing it to working on a Star Wars film. He also stated that the costume for Davan had to be remade after Filoni realized it was a \"slight wrong color\" and that because of the secretive nature of the episode's production, Lanter had to wear a cloak over his costume when leaving his trailer to go on set.\nLanter said that he had a body scan of himself as Davan in a trailer, where he had photos taken from numerous angles of him in a number of different poses using a large number of cameras. The scan came as a part of what he thought was protocol for all characters, and he speculated that it could be for an action figure. Lanter also explained that during the first take of Davan's death, he stumbled into a fake control panel, which he collided with in the scene, and broke it. This angered the set dresser, who advised Lanter to be more cautious with the set in the next few takes. Additionally, Lanter stated that the moment where Migs Mayfeld mocked Davan's shoes was entirely improvised by Mayfeld's actor, Bill Burr.\nIn Joe Schreiber's 2021 junior novelization of The Mandalorian, Davan is described to have been knocked out by Xi'an's knife throw. Contrary to the novel, the card \"An Unexpected Complication\" from the 2020 Topps Star Wars: The Mandalorian Season 1 trading card set states that Xi'an killed the corrections officer. Additionally, in \"Chapter 14: The Tragedy\" of The Mandalorian's second season, which aired on December 4, 2020, Davan's death is listed among the crimes of Migs Mayfeld. This article uses the information presented in the latter two sources.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Lant_(disambiguation)",
  "/wiki/Davan_(disambiguation)",
  "/wiki/9_ABY",
  "/wiki/Bothan-5",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Correctional_Corps",
  "/wiki/File:Davan-Put-Down-the-Blasters.ogg",
  "/wiki/New_Republic_soldier",
  "/wiki/Corrections_officer",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/New_Republic_Correctional_Transport",
  "/wiki/Transport",
  "/wiki/Ranzar_Malk%27s_crew",
  "/wiki/Mercenary",
  "/wiki/Rescue_of_Qin",
  "/wiki/Qin",
  "/wiki/A-180_blaster",
  "/wiki/Distress_beacon",
  "/wiki/Death",
  "/wiki/Xi%27an",
  "/wiki/Dagger",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Soldier",
  "/wiki/Migs_Mayfeld",
  "/wiki/Standard_year",
  "/wiki/Karthon_Chop_Fields",
  "/wiki/File:Davan-Stop.ogg",
  "/wiki/Prison",
  "/wiki/Security_droid",
  "/wiki/Dilestri_system",
  "/wiki/Prisoner",
  "/wiki/N5_sentry_droid",
  "/wiki/Blaster",
  "/wiki/Homing_beacon",
  "/wiki/Bounty_hunter",
  "/wiki/Devaronian",
  "/wiki/Burg",
  "/wiki/Twi%27lek",
  "/wiki/Roost",
  "/wiki/Ranzar_Malk",
  "/wiki/Unidentified_X-wing_squadron",
  "/wiki/Moon",
  "/wiki/Karthon",
  "/wiki/New_Republic_pilot",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Maldo_Kreis",
  "/wiki/Carson_Teva",
  "/wiki/File:Din-Whats-Your-Name.ogg",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/File:Mayfeld-Nice-Shoes.ogg",
  "/wiki/Clothing",
  "/wiki/Sigil_of_the_New_Republic",
  "/wiki/Stormtrooper_armor",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper",
  "/wiki/Belt",
  "/wiki/Officer%27s_disk",
  "/wiki/Helmet",
  "/wiki/Alderaanian_consular_security",
  "/wiki/Aurebesh",
  "/wiki/Holster",
  "/wiki/File:LanterDavan1.ogg",
  "/wiki/Chapter_6:_The_Prisoner",
  "/wiki/The_Mandalorian_Season_One",
  "/wiki/The_Mandalorian",
  "/wiki/December_13",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/Matt_Lanter",
  "/wiki/Anakin_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Matt_Jones",
  "/wiki/Brian_Matyas",
  "/wiki/Doug_Chiang",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/File:LanterDavan2.ogg",
  "/wiki/Dave_Filoni",
  "/wiki/January_25",
  "/wiki/February_2",
  "/wiki/Bill_Burr",
  "/wiki/Joe_Schreiber",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/2020_Topps_Star_Wars:_The_Mandalorian_Season_1",
  "/wiki/Chapter_14:_The_Tragedy",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/December_4",
  "/wiki/2020",
  "/wiki/Category:Audio_files_of_Lant_Davan",
  "/wiki/Category:Images_of_Lant_Davan",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Matt_Lanter:_The_Animated_Anakin",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ships_and_Vehicles:_Selection_(I)",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/March_7",
  "/wiki/May_1",
  "/wiki/May_20"
 ]
}