{
 "name": "Lapin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Non-binary"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Tagge",
      "Tagge Corporation",
      "Tagge Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Lapin was a non-binary human who was part of the powerful family the House of Tagge. They were the cousin, secretary and aide to Lady Domina Tagge, head of the family's Tagge Corporation. They reported to Tagge aboard her flagship, Acquisitor. According to Domina's older brother Ulric, Lapin was the only cousin who did not mind \"living under Domina's shadow\".\nThe human non-binary Lapin was born into the House of Tagge, one of the Galactic Empire's wealthiest families. They were a cousin of Lady Domina Tagge, who rose to become the leading member of the Tagge Dynasty and its company, the Tagge Corporation . Lapin worked as Domina's trusted secretary by the time of the Galactic Civil War and worked aboard her personal starship, the Acquisitor. Between 3 ABY and 4 ABY, they updated Domina on her company's affairs, including negotiations with the Arva Pars group, acquiring the rights to the moon Gortus 4, and a conflict with a D'Armin Syndicate.\nAfter Domina gave them orders for each matter, Lapin asked about the matter of her nephew, Ronen Tagge, who had nearly been killed when the rogue archaeologist Doctor Chelli Aphra destroyed his penthouse. the head of TaggeCo cut her secretary off, wishing not to speak to Ronen. After they apologized, Domina gave Lapin one more task, to put a 20,000 credit bounty on Aphra. The aide did so, consulting the bondsman Syphacc.\nWhile a number bounty hunters attempted to capture Aphra, it was the hunters \"Just Lucky\" and Kharrek who brought the doctor in. Lapin greeting the three as they disembarked aboard the Acquisitor and had visitors follow them. On the way to Domina's office, the secretary discussed the payment with Lucky. Arriving at the office, Lapin informed the TaggeCo head of her new arrivals. Domina thanked her aide and spoke with Aphra. Lapin and Lucky exchanged looks when hearing Aphra recall blowing up Ronen's penthouse.\nAphra then used one of Kharrek's neurotoxin darts on him and drew the bounty hunter's blaster. Lapin hid behind Lucky as they raised their hands in response. After the rogue archaeologist confirmed with Domina that she had a job for the doctor, the TaggeCo leader had her secretary see Lucky out. Lapin was concerned for Domina's safety, but was overruled by their superior. Seeing the bounty hunter, the aide informed him that his former contract with Ronen had been terminated due to the compromising of Domina's nephew. Lucky demanded Lapin to do something about it, but they confirmed that the forms had already been sent and thanked him for his service, leaving afterwards.\nDomina had employed Aphra to investigate the apparent discovery of path engines, which the rival De'Rruyet Industries was claiming to be replicating, and steal their new hyperdrive engine. Later on, she and Lapin watched an advertisement from the company about their revolutionary hyperdrive. The secretary then informed Domina of an incoming transmission from the Imperial Admiral Sheravin, on behalf of EmperorPalpatine. Thanking Lapin, the head of TaggeCo responded to the transmission, where the admiral threatened a reassessment of the Empire's relationship with the Tagges if De'Rruyet's new hyperdrive was successful. Lapin begun stating that losing contracts with the Empire would ruin the Tagges, Domina explaining to him that she would not let that happen.\nIn the meantime, Lapin had been given their own task by Domina, investigating a series of information leaks from the Tagge Corporation. In their work, the secretary discovered that a mole in the company was stealing TaggeCo secrets and slicing Domina's personal communications. They additionally found killed them four spies, suspecting there to be more. In reality, Domina's brother, Head of Tagge Corp Weapons Development Silas Tagge, had been conspiring with the Crimson Dawn syndicate, who had been using moles in all of TaggeCo's competitors too. Aphra and her partner, the mercenary Sana Starros, infiltrated the De'Rruyet Center on the planet Midarr during its event showing off the hyperdrive innovation. However, the event went awry when the Unbroken Clan syndicate tried to steal the engine, which Aphra resultantly blew up.\nReturning to the Acquisitor, Aphra and Starros brought the news to Domina that they had blown up the engine, Lapin being present for the meeting. Domina used a containment shield to try and suffocate the pair, catching Starros in an airless pocket until Aphra gave an original path engine crystal she had acquired to the TaggeCo leader. Releasing the mercenary, the TaggeCo leader gave Starros and Aphra a new job, to locate the arms smuggler Ebann Drake, another cousin of Domina's who had gone missing. Lapin later served Domina a drink, and their superior asked her secretary to sit with her, questioning the progress of their investigation. They confirmed to her that there was indeed a mole, mentioning the spies to her.\nAphra and Starros found Drake's luxury vessel, the Opal Empress above the Outer Rim astronomical object Kaderin, where the arms smuggler and the rest of the passengers had been massacred by cymotes, parasitic creatures. After dealing with the cymotes, Aphra and Starros reported to Domina, who was watering her garden on the Acquisitor with Lapin present. Aphra added that Drake had an invitation to an auction of the carbon-frozen smuggler Han Solo by the Crimson Dawn. After advising her secretary to log a vacancy in place of Drake's death, Domina tasked the rogue archaeologist and her partner with using Drake's invitation to investigate the Crimson Dawn's operations.\nLater on, Domina went to test the Tagge protoblade, a plasma weapon designed by Silas Tagge. She had Lapin report on the weapon's performance, the secretary stating that the energy consumption of the blade was twenty-three percent higher than expected. Domina told them to tell Silas that she expected the blade's next iteration to meet her standards. She also told the aide to note the fact the protoblade's energy cells were overheating. While watching the head of TaggeCo fight some of her Honor Guard as part of the testing, the young Tagge Forthe and another intenr complemented her skill, Lapin more calmly agreeing. After the fight was over, Domina and Forthe agreed that the protoblade was too cost-ineffective for mass deployment, Domina's secretary looking bluntly at the young Tagge as he was giddy at Domina knowing his name.\nDomina then headed to her quarters to prepare for a meeting with the executive of the Tagge Corporation, comprising of relatives of hers. She had Lapin report on the how many of the council had arrived as she walked to her room. While he aide consulted her wardrobe, she confirmed with them that Forthe was her relative Layla Tagge-Faulken's son, being a political advantage for her, and monologued about her her family was full of vipers wishing to eliminate each other. Domina then had the aide retrieve a yellow dress for her. Lapin asked if she wanted them to accompany her during her meeting incase of a danger, but the head of TaggeCo advised them to watch over Forthe and the other interns instead while she spoke with their parents.\nWhile Domina met with the Tagge Corp executive board, a crew of Ubese bounty hunters led by Boushh arrived, hired by Silas through Crimson Dawn to assassinate the board. The crew attacked the Acquisitor's bridge, disabling comms and locking down the rest of the systems. The hunters then went to find the executive board, the Ubese Hareck and Ilini running into Lapin and the interns. The secretary raised a blaster pistol at them, but Hareck assured them that the crew was not there for them.\nThat was when Domina intervened, using the protoblade and to incapacitate the two bounty hunters. She then proceeded to defeat the rest of Boushh's crew, discovering Silas to be the mole in TaggeCo when he had to stop Boushh from firing at him. With the fighting over, Domina had Lapin see the rest of the executive board off of the Acquisitor while she confronted Silas and the Ubese crew. She killed Silas and recruited the bounty hunters to turn on Crimson Dawn and help her.\nAs their internal investigation into the information leaks progressed, Lapin discovered multiple more spies in the Tagge Corporation and had them arrested. One was Sira Folsomn, an assistant packaging manager in the Tagge Corporation, who had been using company resources for personal communication without authorization and stealing company secrets. A decryption of Folsomn's messages revealed that she had been recruited by the Crimson Dawn. After being apprehended, Folsomn was sat down at a table, where Lapin recited her contract breaches within Tagge Corp as part of a \"performance review,\" although the traitor felt like it was being treated as a court session.\nAs Lapin then confronted Folsomn about her employment with Crimson Dawn, Domina arrived and offered to only turn the assistant packaging manager to Imperials if she gave the names of her handler and contacts in the syndicate. However, Folsomn drew a hidden knife and tried to kill the head of TaggeCo, only to be disarmed and fatally impaled with her knife by her target. Lapin asked if Domina was alright, his superior confirming she was fine and advising her secretary to get to interrogate the next spy.\nLapin was later present for Domina's next meeting with Aphra and Starros, who had returned from their mission to the Crimson Dawn auction, having stolen a necklace from a member of the Black Sun syndicate who was secretly working with Crimson Dawn. The necklace's crystal contained in-depth information about the Black Sun's inner workings. The data also confirmed Domina's suspicions that it was the Crimson Dawn which was infiltrating a number of organizations including her competitors. Domina then consulted Aphra on her encounter with a weapon called the thought dowser, created by a group of Force-sensitives known as the Ascendant, which had damaged the rogue archaeologist's arm.\nDomina wanted to study the damage to Aphra's arm, the rogue archaeologist asking for the electro-tattoos on it to be repaired in the process. Lapin was resultantly given the task, having Aphra sign a contract to have her arm studied and her tattoos repaired and upgraded. The secretary oversaw the process, after which the doctor remarked that her tattoos had felt the best in ages. Lapin reasoned it to the upgrade, but Aphra had not properly read the contract's part about upgrades and complained about permission before the aide corrected her. When Starros asked if the rogue archaeologist had been weaponized, Lapin affirmed that she was not.\nDomina sent Aphra and Starros to acquire an Ascendant artifact. During the mission, though, the head of TaggeCo required the rogue archaeologist to return to the Acquisitor and contacted her, Lapin being present as Aphra ignored the request. Ronen Tagge was also watching, and the secretary watched as Domina's nephew warned her about the doctor before leaving. Domina predicted that Aphra either had a lead on an Ascendant artifact or had found new loyalties, Lapin claiming they were equally likely. Their superior thus ordered Boushh and his crew to find the rogue archaeologist and bring her back to the Acquisitor.\nBoushh's crew apprehended Starros and Kho Phon Farrus, an alien who was also after Ascendant artifacts, and brought the two before Domina and Lapin. Starros informed them that Aphra had been merged with the Ascendant artifact known as the Spark Eternal, and the head of TaggeCo asked for Lapin to relay orders to her all vetted teams for Aphra and the artifact to be recovered intact.\nA non-binary human, Lapin was very loyal to Domina Tagge, and wished to accompany her to protect and assist her whenever possible. Despite being a secretary, Lapin was willing to wield a weapon to defend their colleagues and employer; facing off against Boushh's crew with a blaster when the Ubese iounty hunters boarded the Acquisitor.\nAs Lady Domina's secretary, Lapin carried a datapad to take notes and pull up data. They dressed in a dark gray uniform with a red arrow pointing upward on the front. Lapin was capable of wielding a blaster.\nLapin first appeared in flashbacks in the sixth issue of the 2020 Star Wars: Doctor Aphra comic series, written by Alyssa Wong and published by Marvel Comics on November 25 of that year. Their appearance in the issue was included in its preview on StarWars.com a week before.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_of_Tagge",
  "/wiki/Tagge_Corporation",
  "/wiki/Secretary",
  "/wiki/Aide",
  "/wiki/Lord",
  "/wiki/Domina_Tagge",
  "/wiki/Flagship",
  "/wiki/Acquisitor",
  "/wiki/Ulric_Tagge",
  "/wiki/Reproduction",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Civil_War",
  "/wiki/Starship",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Arva_Pars",
  "/wiki/Moon",
  "/wiki/Gortus_4",
  "/wiki/Attack_on_a_Tagge_Corporation_supply_ship",
  "/wiki/D%27Armin_Syndicate",
  "/wiki/Ronen_Tagge",
  "/wiki/Death",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Ronen_Tagge%27s_Private_Penthouse",
  "/wiki/Credit",
  "/wiki/Bounty",
  "/wiki/Syphacc",
  "/wiki/Bounty_hunter",
  "/wiki/Just_Lucky",
  "/wiki/Kharrek",
  "/wiki/Neurotoxin_dart",
  "/wiki/Blaster",
  "/wiki/Path_engine",
  "/wiki/De%27Rruyet_Industries",
  "/wiki/Hyperdrive",
  "/wiki/Engine",
  "/wiki/Admiral",
  "/wiki/Sheravin",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Slicer",
  "/wiki/Spy",
  "/wiki/Silas_Tagge",
  "/wiki/Crimson_Dawn",
  "/wiki/Mercenary",
  "/wiki/Sana_Starros",
  "/wiki/De%27Rruyet_Center",
  "/wiki/Planet",
  "/wiki/Midarr",
  "/wiki/De%27Rruyet_Industries_confluence",
  "/wiki/Unbroken_Clan",
  "/wiki/Smuggler",
  "/wiki/Ebann_Drake",
  "/wiki/Opal_Empress",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Kaderin",
  "/wiki/Cymote",
  "/wiki/Parasite",
  "/wiki/Species",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Carbon-freezing",
  "/wiki/Han_Solo",
  "/wiki/Tagge_protoblade",
  "/wiki/Plasma",
  "/wiki/Weapon",
  "/wiki/Energy_cell",
  "/wiki/Honor_Guard_(Domina_Tagge)",
  "/wiki/Forthe",
  "/wiki/Layla_Tagge-Faulken",
  "/wiki/Boushh%27s_crew",
  "/wiki/Ubese",
  "/wiki/Boushh",
  "/wiki/Bridge_(starship)",
  "/wiki/Hareck",
  "/wiki/Ilini",
  "/wiki/Blaster_pistol",
  "/wiki/Sira_Folsomn",
  "/wiki/Knife",
  "/wiki/Necklace",
  "/wiki/Black_Sun",
  "/wiki/Thought_dowser",
  "/wiki/Force-sensitive",
  "/wiki/Ascendant",
  "/wiki/Electro-tattoo",
  "/wiki/Kho_Phon_Farrus",
  "/wiki/Spark_Eternal",
  "/wiki/Datapad",
  "/wiki/Doctor_Aphra_(2020)_6",
  "/wiki/2020",
  "/wiki/Star_Wars:_Doctor_Aphra_(2020)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Alyssa_Wong",
  "/wiki/Marvel_Comics",
  "/wiki/November_25",
  "/wiki/StarWars.com",
  "/wiki/November_18",
  "/wiki/Category:Images_of_Lapin",
  "/wiki/Doctor_Aphra_(2020)_7",
  "/wiki/Doctor_Aphra_(2020)_9",
  "/wiki/Doctor_Aphra_(2020)_10",
  "/wiki/Doctor_Aphra_(2020)_11",
  "/wiki/Doctor_Aphra_(2020)_15",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Boushh_1",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Doctor_Aphra_(2020)_19",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Doctor_Aphra_(2020)_1",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Doctor_Aphra_(2020)_5",
  "/wiki/Doctor_Aphra_(2020)_8"
 ]
}