{
 "name": "Laranna Fain",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Duras Fain",
      "Vivicar"
     ]
    }
   ]
  }
 ],
 "content": "Laranna Fain was a female Human Jedi Knight of the Jedi Order and the daughter of Duras Fain.\nDuring the Cold War, Laranna's father Duras Fain, Yuon Par, Sidonie Garen, Eriz Vossan, Cin Tykan, and Parkanas Tark encountered the spirit of Terrak Morrhage, a restless Sith Lord who besieged them with its dark powers. They were able to escape, but Parkanas was the only one who was left behind to suffer the Sith Lord's wrath, causing him to turn to the dark side and formulate a dark plague. Duras and the rest of the Jedi that accompanied Parkanas, were infected by the dark plague, which caused them to go insane and corrupt.\nOnboard the Republic starship Carida, Laranna was going to see her father when the ship was ambushed by Imperial forces. She had been seriously injured in the fight and Lieutenant Bela Whinn put out a call for a medic. A Jedi Master soon arrived and healed Laranna, but later, she went insane and mercilessly attacked the crew. It was revealed that Lord Vivicar was the one who healed her, disguised as that mysterious Jedi Master, and turned her to the dark side, intending for her to become his apprentice. The Jedi Council sent the future Barsen'thor of the Order to board Carida and face Laranna. The Jedi Consular begged her to stop this, and promised that he would help her fight the darkness that corrupted her. Laranna engaged the Consular in a lightsaber duel, in which she lost. However, Laranna Force pushed the Jedi Consular, and ran to the airlock where she would be sucked into space. The Jedi Consular would heal Laranna from the darkness and told her to remember the Jedi Code and her father. Laranna answered the code, and part of herself was trying to fight its way back. The Jedi Consular was able to cure Laranna, as was her father before her, allowing Vivicar's voice to fade. She then locked herself in the brig for the remainder of the voyage.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Duras_Fain",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Parkanas_Tark",
  "/wiki/Sith_Master/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Yuon_Par",
  "/wiki/Sidonie_Garen",
  "/wiki/Eriz_Vossan",
  "/wiki/Cin_Tykan",
  "/wiki/Terrak_Morrhage",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Carida_(starship)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Lieutenant/Legends",
  "/wiki/Bela_Whinn",
  "/wiki/The_Barsen%27thor",
  "/wiki/Lightsaber/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}