{
 "name": "Larcoh",
 "display_name": "Larcoh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selkath"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mottled pink"
     ]
    }
   ]
  }
 ],
 "content": "Professor Larcoh was a male Selkath, who lived on the world Tatooine during the Cold War between the Galactic Republic and the resurgent Sith Empire. He studied the society and customs of Tusken Raiders near the Northern Jundland Plateau, and was able to dissuade the Tusken Raiders from attacking Outpost Largona with the help of a traveler from the Republic.\nProfessor Larcoh was a male Selkath and was one of the few of his species that lived away from their species' homeworld of Manaan after most of their species had been forced underwater in the bombings of the planet. Around the time of the Cold War between the Galactic Republic and the resurgent Sith Empire, the Professor traveled to the world of Tatooine, in order to study the society and customs of the Tusken Raiders, a native species of the planet. The Professor resided at Outpost Largona, which was subjected to frequent attacks from the Tusken Raiders. There he was able to study a tribe of Raiders that currently resided on the nearby Northern Jundland Plateau, and he braved the desert dangers in order to personally see the society and customs of the Tusken Raiders. Larcoh discovered that the desert dwellers were not mere savages but that instead of diplomacy, they favored strength. Upon one of his studies he witnessed how the tribes earned respect from each other. One Tusken Raider entered a rival village and placed an object into a totem base. Challengers would then appear and try to defeat this rival, and if the rival won the losers would respect the strength of the winning tribe and avoid them.\nUpon this realization, Larcoh deemed it necessary to inform the people of Outpost Largona of how they could stop the attacks from these \"Sand People\" as the Tusken Raiders were also known. No one, however, listened, and the Professor became more and more frustrated. A traveler from the Republic passed through the Outpost and delighted Larcoh by listening to the Selkath's solution. The traveler was eager to help with a diplomatic solution, but Larcoh informed that the raiders favored strength instead of diplomacy. The Professor gave the traveler the same object that the Tusken Raiders used to proclaim the challenge and instructed the person of how to perform the ritual challenge. The Professor told the visitor to go to the camp on the Northern Jundland Plateau and perform it there.\nAfter the traveler had left, Larcoh heard reports of how Tusken Raiders had started to carefully avoid the outpost instead of attacking it. When the traveler returned, Larcoh exclaimed how happy he was that he had been right. The Tusken Raiders were now respecting the outpost's strength, just as he had thought. Although the settlers would not appreciate it, Larcoh predicted that his research would soon make significant headway. He thanked the traveler and gave him a reward for his actions and stated he would include the traveler's name in his research documentation.\nLarcoh was proud of his academic title and spoke condescendingly of anyone who would not listen to him by calling them a fool or a rubat. He cared for his fellow sentient beings, however, as he went to lengths to inform the settlers of how they could make the Tusken Raiders leave them alone.\nLarcoh had a mottled pink skin color and black eyes. He spoke his species' language and wore standard traveling clothing while carrying a blaster.\nLarcoh was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. Larcoh could be found at Outpost Largona where he issued the mission \"Show of Force\" to any Republic player.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Selkath/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Professor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Northern_Jundland_Plateau",
  "/wiki/Outpost_Largona",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Devastation_of_Manaan",
  "/wiki/Desert/Legends",
  "/wiki/Rubat",
  "/wiki/Eye/Legends",
  "/wiki/Selkath_(language)",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011"
 ]
}