{
 "name": "Laret Soveral",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Golden-brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Orla Jareni"
     ]
    }
   ]
  }
 ],
 "content": "Laret Soveral was a female human Jedi Master of the Jedi Order during the High Republic Era. She was the Master of Jedi Padawan Orla Jareni. Laret and her Padawan, alongside Master Simmix and Padawan Cohmac Vitus, were involved in the crisis between Eiram and E'ronoh. She wielded a blue-bladed lightsaber.\nLaret Soveral was known to be tall for a Human woman, with striking features and a commanding presence. She had golden-brown eyes.\nWhen her Padawan Orla Jareni challenged the decisions of the Jedi Council by asking questions, Master Laret initially listened to Jareni and gently debated her. When her patience was tested by her Padawan's questions, Laret rebuked that to be a Jedi was to serve, and asked Jareni how she would intend to serve if she continued to question every command. To Jareni, Laret was generally warm and empathetic, but also always found something that her Padawan needed to work on.\nMaster Laret believed it to be a great honor for the planets Eiram and E'ronoh to call upon the Jedi for help. She understood that the Eiram-E'ronoh crisis was undoubtedly difficult for the twin planets, as they were willing to ask for help from within the Galactic Republic. Laret had hopes that, in rescuing Queen Thandeka of Eiram and Monarch Cassel of E'ronoh, the Jedi could prevent a war or even be able to open another part of the galaxy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Orla_Jareni",
  "/wiki/The_High_Republic_Free_Digital_Sampler",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Simmix",
  "/wiki/Cohmac_Vitus",
  "/wiki/Eiram%E2%80%93E%27ronoh_crisis",
  "/wiki/Eiram",
  "/wiki/E%27ronoh",
  "/wiki/Lightsaber",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Laret_Soveral",
  "/wiki/Jedi_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Queen",
  "/wiki/Thandeka",
  "/wiki/Monarchy",
  "/wiki/Cassel_(monarch)",
  "/wiki/The_galaxy",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)"
 ]
}