{
 "name": "Lareen_Dantara",
 "display_name": "Lareen Dantara",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Lareen Dantara was a female Human that lived on the planet Naboo at the time of the Galactic Civil War. She worked at the Lake Retreat, a private retreat in the mountains of Naboo that belonged to the Naberrie family.\nSometime following 0 BBY, a Corellian visitor brought his pet krahbu to the retreat. It got loose and started killing local wildlife and livestock. A visiting adventurer agreed to hunt the krahbu down and kill it for a small sum of credits. Soon after, Dantara had another job for the adventurer. The krahbu had infected a local mott with a Corellian virus. The disease drove the creature insane and it had to be put down before the epidemic could spread. As a reward for the adventurer's services, Dantara gave the adventurer access to the retreat to take a look around.\nLareen Dantara was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies prior to its closure on December 15, 2011. She could be found at the Lake Retreat on Naboo. Dantara offered two small quests to players, wherein the player had to kill two creatures and received a small sum of credits as a reward.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Planet/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Varykino/Legends",
  "/wiki/Mountain/Legends",
  "/wiki/House_Naberrie",
  "/wiki/0_BBY/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Krahbu",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Mott/Legends",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/2011"
 ]
}