{
 "name": "Largo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Largo was a Human male merchant living in the Upper City of Taris.\nDavik Kang posted a bounty on his head due to his failure to pay 200 credits of Davik's cut. Fearful for his life, Largo hid in the North Apartments, where he was found by Revan in 3956 BBY. Largo lied to Revan that he could not afford to pay Davik despite having 100 credits, an Energy Projector worth 150 credits, and a blaster on his person, plus some money and a couple of items in his footlocker.\nWhen he explained his predicament to Revan, the former Sith Lord gave Largo 200 credits so he could pay off the debt. Relieved, but also shocked that Revan would sacrifice money for a complete stranger, Largo expressed his gratitude and hurried to hand the sum off to Davik. Sure enough, the bounty was lifted promptly afterwards.\nWhen his life was endangered by a bounty on his head, Largo was reduced to abject paranoia as he hid in his apartment awaiting the moment bounty hunters discovered his location. He was a nervous wreck when Revan encountered him, pleading and groveling, and desperate enough to immediately offer money in exchange for his life. Despite this, if it became clear that a bounty hunter before him wanted him dead, he was capable of mustering the courage to fend for himself, believing that if he were to die, it would be better to do so in a fight than as a coward.\nLargo possessed a single blaster pistol which he carried at his side at all times when his life was threatened by bounty hunters.\nUpon meeting the player, Largo will immediately offer to give 50 credits to convince Revan not to reveal his location to Davik. Should the player accept, dark side points will be earned along with a reprimand by Carth Onasi if he is in the party at the time.\nSimilarly, if the player chooses the light side option and Carth is present, Carth will praise Revan's generosity while admitting that he hopes they wouldn't need those credits later.\nWhether or not the player accepts Largo's bribe, Largo can be killed and his bounty collected from Zax for dark side points.\nThe dark side points received for demanding credits from Largo only happen when first talking to him. Demanding credits in later conversations will not give the player dark side points, although Carth will still reprimand you. Because of this, it is possible to ask for the 50 credits, then give Largo the 200 credits to pay off Davik, essentially losing 150 credits.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Upper_City",
  "/wiki/Davik_Kang",
  "/wiki/Bounty/Legends",
  "/wiki/North_Apartments",
  "/wiki/Revan/Legends",
  "/wiki/3956_BBY",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Carth_Onasi",
  "/wiki/Zax"
 ]
}