{
 "name": "Larisselle_Chatrunis",
 "display_name": "Larisselle Chatrunis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "45 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pa'lowick"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Larisselle Chatrunis was a Pa'lowick female who was crowned Miss Coruscant in a beauty pageant held on the Republic homeworld shortly before the outbreak of the Clone Wars. She was a native of Coruscant's Jrade District at the time of her crowning.\nLarisselle Chatrunis stole the show at the Miss Coruscant beauty pageant with her incredible singing voice and her impressive awareness of galactic affairs despite the fact that her homeworld of Lowick was only recently introduced to the galactic stage. After winning the pageant Larisselle toured the galaxy as her music made her famous. Once Emperor Palpatine rose to power and instituted the Galactic Empire, new xenophobic policies cost non-humans such as Larisselle their livelihoods. Chatrunis subsequently joined the Rebel Alliance, determined to use her fame and talents in order to help end Palpatine's tyrannical reign and restore freedom to fellow discriminated aliens. Under the guise of a simple singing troupe, Larisselle served the Alliance undercover, stealing Empire secrets and passing them on to key members in the Rebellion. Fueling HoloNet rumors of a diva feud between herself and Sy Snootles—the \"other\" singing Pa'lowick star—Larisselle used the staged rivalry to distract the authorities from her true treasonous actions. Larisselle served the Rebellion throughout the Galactic Civil War and was able to see that her efforts paid off when the Empire fell and Palpatine was slain at the Battle of Endor. Following the restoration of peace to the galaxy, Larisselle retired to Lowick, returning to the peaceful Pa'lowick life, surrounded by loved ones, where she lived out the rest of her days.\nLarisselle's story may well be a reference to the original Star Wars Monopoly board game, as one of the cards depicts a Pa'lowick with the words \"Win beauty contest, collect $50\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/45_BBY/Legends",
  "/wiki/Pa%27lowick/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Miss_Coruscant",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jrade_District/Legends",
  "/wiki/Lowick/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Sy_Snootles/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_52",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}