{
 "name": "Larik",
 "display_name": "Larik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 68 BBY and 42 BBY",
      "Raxus Secundus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Larik was a human male senator of the planet Raxus Secundus. Due to his corrupt nature, he was caught in a coup by his own guards, who wished to use him for Raxus' benefit. He was killed by his guards after revealing their coup to Jedi Masters Dooku and Mace Windu.\nAt some point between 68 BBY and 42 BBY, Larik served as the Senator of the Outer Rim planet Raxus Secundus. During that time, he used his Senate seat to become rich at the expense of the planet by encouraging otherworldly companies to industrialize it. At some point, his corruption was discovered by a group of his guards led by a man named Semage, who killed Larik's Jedi protector, Master Katri, a member of the Jedi Council, by ambushing her. However, Semage and his followers spared Larik with the intent to force him to enact their own rules at the next Senate hearing meeting in order to repair the damage Larik had done to Raxus. \nWhen Jedi Masters Mace Windu and Count Dooku landed on Raxus Secundus to investigate the death of Master Katri, a Council member, an official was there to greet them. He took them to see the senator. Larik told the Jedi that Katri was ambushed and that he was there at the time of Katri's death. Due to his awkward way of talking, the two Jedi did not believe his story, but Mace Windu decided that he and Dooku should stick to the plan and just retrieve Katri's body, not start a full investigation. \nWhen they arrived at the place of Katri's death, the pair found out from the traces left that there were more than one attacker, and that there were no blast marks on the ship. When Dooku ignited his lightsaber and demanded the truth, a terrified Larik cried out that the guards killed Master Katri, and he was shot before he could reach Windu and Dooku.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Choices",
  "/wiki/68_BBY",
  "/wiki/42_BBY",
  "/wiki/Raxus_Secundus",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Senator",
  "/wiki/Dooku",
  "/wiki/Mace_Windu",
  "/wiki/Katri",
  "/wiki/Jedi_Council",
  "/wiki/Jedi_Master",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Larik",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Jedi_Order",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Standard_year",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY",
  "/wiki/40_BBY",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope"
 ]
}