{
 "name": "Larma_D%27Acy",
 "display_name": "Larma D'Acy",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Warlentta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.65 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance Army",
      "Resistance Army"
     ]
    }
   ]
  }
 ],
 "content": "Larma D'Acy was a human female who served as a commander in the ground forces of the Resistance, a paramilitary group founded by Leia Organa to monitor and oppose the actions of the First Order.\nA native of Warlentta, she was recruited personally by General Leia Organa, who greatly admired her homeworld's independent streak. D'Acy's father, despite Warlentta having declined to join the New Republic, was nonetheless a noted critic of the demilitarization efforts undertaken by the Senate. D'Acy herself came from a distinguished military background, with her family charged with protecting the Warlentta system, and joined the Resistance with her family's blessing.\nD'Acy attended the funeral of Han Solo and was stationed on the bridge of the Resistance flagship, the MC85 Star Cruiser Raddus, during the evacuation of D'Qar and the subsequent surprise attack on the fleet when the First Order somehow tracked them through lightspeed. During the attack, the bridge was destroyed by TIE fighters, but D'Acy survived as she had been on an errand. She then reported on the situation to the surviving Resistance members on the secondary command bridge, the only good news being that Leia was alive but unconscious. With a heavy heart, D'Acy revealed that the majority of the Resistance Command, including Admiral Gial Ackbar, had perished in the attack. Following the chain of command, leadership of the Resistance fell to Vice Admiral Amilyn Holdo, commanding officer of the cruiser Ninka.\nD'Acy followed her loyally, but this resulted in her being held at gunpoint with Holdo and several other officers when Captain Poe Dameron, at odds with Holdo over her strategies and lack of transparency, staged a mutiny. Holdo regained control of the ship with the help of the newly recovered Leia, who personally stunned Poe and had him loaded onto a U-55 orbital loadlifter which she and D'Acy used to evacuate while Holdo stayed behind to pilot the Raddus, with D'Acy expressing hope that the plan worked. When Poe regained consciousness, D'Acy explained that they were heading for an old rebel base on the mineral planet of Crait, where they could take refuge and send out a signal to their Outer Rim allies. When the transports came under fire, it was only Holdo's valiant sacrifice of ramming the First Order fleet at lightspeed that allowed the remainder to reach planetfall safely.\nOnce there, D'Acy reactivated the base's shields with an ancient computer monitor and observed the battle against the First Order. The signal that Lieutenant Kaydel Co Connix sent out asking for help was received at multiple points but went unanswered, with D'Acy realizing that their allies had heard them, but no one was coming. D'Acy then bore witness to the appearance of what appeared to be Luke Skywalker, who proceeded to face down the First Order while the Resistance fled through an underground tunnel, ultimately escaping aboard the Millennium Falcon. D'Acy was left as one of the few surviving Resistance members, telling C-3PO that when they got to the Outer Rim, she had a contact there who could help them.\nA human female with fair skin, blonde hair and a prominent nose, Larma D'Acy was a calm and collected individual who rarely lost her composure and maintained a cool head even under great stress. Loyal to the Resistance, D'Acy followed Vice Admiral Holdo without question and futilely attempted to intercede when Holdo and Poe Dameron butted heads over strategy. Though deeply affected by the loss of Admiral Ackbar and Leia's near-death, D'Acy nonetheless plowed on resolutely.\nD'Acy was married to fellow Resistance member, Lieutenant Wrobie Tyce. They kissed in the aftermath of the Battle of Exegol, which saw the end of the war between the First Order and the Resistance.\nLarma D'Acy wore the standard Resistance officer uniform with a rank plaque denoting her rank of Commander, boots and a belt in which she holstered a standard-issue Glie-44 blaster pistol.\nLarma D'Acy was portrayed by Amanda Lawrence in Star Wars: Episode VIII The Last Jedi and Star Wars: Episode IX The Rise of Skywalker. She was named for Dan and Stacy, two close friends of Rian Johnson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Larma_D%27Acy",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Warlentta",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_Army",
  "/wiki/Commander",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/General",
  "/wiki/Larma_D%27Acy%27s_father",
  "/wiki/Military_Disarmament_Act",
  "/wiki/New_Republic_Senate",
  "/wiki/MC85_Star_Cruiser",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Vice_Admiral",
  "/wiki/Amilyn_Holdo",
  "/wiki/Ninka",
  "/wiki/Captain",
  "/wiki/Poe_Dameron",
  "/wiki/Mineral",
  "/wiki/Crait",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Force_projection",
  "/wiki/Luke_Skywalker",
  "/wiki/Millennium_Falcon",
  "/wiki/Lieutenant",
  "/wiki/Wrobie_Tyce",
  "/wiki/Battle_of_Exegol",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Glie-44_blaster_pistol",
  "/wiki/Amanda_Lawrence",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Rian_Johnson",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Adaptation_2",
  "/wiki/The_Last_Jedi_Adaptation_4",
  "/wiki/The_Last_Jedi_Adaptation_5",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Resistance_Transport_Expansion_Pack",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary"
 ]
}