{
 "name": "Larm",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "13 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Remnant"
     ]
    }
   ]
  }
 ],
 "content": "Larm was an admiral in the Imperial Navy who was in charge of forces in the Antemeridian sector under Moff Getelles. Larm was a by-the-book sycophant who ingratiated himself with Moffs while never relaxing his warrior image.\nGetelles promoted Larm to admiral over the heads of several other officers shortly after his promotion to Moff of Antemeridian Sector. Larm was seen as a sternly efficient foil to Getelles's fair command style.\nIn 13 ABY, Getelles was contacted by Seti Ashgad who offered him an opportunity to take control of Meridian sector. Loronar Corporation would supply weapons to dissident groups throughout Meridian sector in an effort to promote uprisings which would divide the New Republic forces in the area. Meanwhile, Ashgad would release a plague which he promised would only affect New Republic personnel. Together, these events would weaken New Republic forces sufficiently for Admiral Larm's forces to take control of the sector.\nPart of the deal would allow Loronar Corporation to mine Spook crystals on Nam Chorios in Meridian sector to use as CCIR control crystals in synthdroids and CCIR Needles. Ashgad would get a share of the profits, while Getelles would get access to the Needles.\nLarm's fleet arrived at Nam Chorios to rendezvous with Ashgad and were engaged by a small New Republic force under the command of Han Solo. The battle was going the Imperials' way until Luke Skywalker was able to use the Force to persuade the sentient control crystals in Larm's Needles to turn on the Imperial forces. Ashgad's ship, Reliant was destroyed along with Larm's Carrack-class light cruiser which was docked with it at the time. Their commander dead, the rest of Larm's fleet retreated to Antemerdian sector.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/13_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Admiral/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Antemeridian_sector",
  "/wiki/Moff/Legends",
  "/wiki/Tol_Getelles",
  "/wiki/Seti_Ashgad/Legends",
  "/wiki/Meridian_sector/Legends",
  "/wiki/Loronar_Corporation/Legends",
  "/wiki/Death_Seed",
  "/wiki/Tsil",
  "/wiki/Nam_Chorios/Legends",
  "/wiki/Centrally_Controlled_Independent_Replicant",
  "/wiki/Synthdroid",
  "/wiki/Needle_fighter",
  "/wiki/Han_Solo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Reliant_(I-7_Howlrunner)",
  "/wiki/Carrack-class_light_cruiser/Legends",
  "/wiki/Planet_of_Twilight",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}