{
 "name": "Laryn_Kre%27fey",
 "display_name": "Laryn Kre'fey",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "6.5 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Laryn Kre'fey was a white Bothan who served as an officer in the Alliance and New Republic Armies. Although the most celebrated Bothan military leader of his time, he rose in large part due to Bothan politics rather than his abilities.\nKre'fey hoped to position himself as the leader of the liberation effort on Coruscant. However, his poor planning and intelligence during the First Battle of Borleias had disastrous results for the New Republic, and resulted in his own death.\nKre'fey's tactical and strategic prowess was feeble at best, but he was nevertheless revered as an Alliance and New Republic military officer. He held his position due to the political maneuvering of Bothans. He was rumored to be distantly related to Borsk Fey'lya, the influential Bothan who sat on the Provisional Council.\nThe Bothans hoped to use the momentum from their spies uncovering the plans for the Second Death Star to propel a Bothan to a high-level military position. For his own part, Laryn hoped to achieve a rank that would rival or surpass the Mon Calamari Admiral Ackbar in power and prestige.\nAfter the evacuation of Ciutric, General Laryn Kre'fey used the Emancipator as his flagship in a bid to retake Ciutric from Prince-Admiral Krennel.\nTwo years after the Battle of Endor, the Provisional Council of the New Republic decided it was time to focus on the goal of taking Coruscant. Kre'fey planned an invasion of the planet Borleias, codenamed Blackmoon, as a first step in the process, hoping a success would allow him to take command of the Coruscant operation.\nBorleias was close to the Galactic Core, and the Council decided to approve the plan. Several officers, including Commander Wedge Antilles, General Horton Salm and Admiral Ackbar expressed serious misgivings about the plan, especially the inadequate preparation time and the lack of intelligence about the planet. Wedge also felt the plan depended too heavily on bombardment from space, rather than the more effective ground attack option, like the Imperials used during the Battle of Hoth. Despite these misgivings, Kre'fey's plan was allowed to go ahead.\nThe first attempt to take Borleias turned out to be a disaster for New Republic. The planet's Imperial installation commander, General Evir Derricote, had hidden reserves on hand that he kept hidden from both the New Republic and his superiors in the Empire, and therefore he was able to easily fend off the attack.\nKre'fey made several additional tactical errors during the battle. He did not utilize the Star Destroyer Emancipator to fire upon TIE-launching facilities because he did not want to damage the base he hoped to capture. He also ordered Wedge's Rogue Squadron to escort assault shuttles carrying New Republic infantry troops to the planet instead of Salm's Defender Wing Y-wing bomber squadron, which was better equipped for the role, because he thought waiting for Defender Wing would cause an \"unnecessary delay.\"\nKre'fey accompanied his forces in one of those assault shuttles and was killed when it was hit by an ion beam and crashed into a shield, making him one of the first casualties of the ill-fated battle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Alliance_Army/Legends",
  "/wiki/New_Republic_Army",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/First_Battle_of_Borleias",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/New_Republic_Provisional_Council",
  "/wiki/Bothan_Spynet/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Evacuation_of_Ciutric",
  "/wiki/General/Legends",
  "/wiki/Emancipator",
  "/wiki/Flagship/Legends",
  "/wiki/Ciutric_IV",
  "/wiki/Prince-Admiral/Legends",
  "/wiki/Delak_Krennel",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Borleias/Legends",
  "/wiki/Blackmoon",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Horton_Salm/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Evir_Derricote",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/TIE_Series",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Assault_shuttle/Legends",
  "/wiki/Defender_Wing",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/X-Wing:_Rogue_Squadron",
  "/wiki/X-Wing:_Rogue_Squadron_(unabridged_audiobook)",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}