{
 "name": "Laskin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Laskin was a Human male lieutenant of the Galactic Republic during the Galactic War.\nStationed in Aurek Base on Hoth during 3642 BBY, he found himself the highest-ranking officer after his superiors were all killed in an Imperial attack. He managed to pull the base through the hard times, asking a Republic citizen to deal with many emergencies, such as personnel stranded outside the base without supplies, Talz forces being attacked by Imperials, and saboteurs attempting to blow the entire base from below.\nIn the aftermath of the attack on Aurek Base, he was promoted to the rank of captain by General Ando at the suggestion of the Republic citizen who assisted Laskin.\nUpon completion of the Aurek Base missions, players have two options: they can recommend to General Ando that Laskin be given a promotion for light alignment points, or that he be stripped of his rank for dark alignment points. If the light side option is taken, General Ando promotes him to the rank of captain. If the dark side option is taken, General Ando relieves Laskin of duty and orders him to leave Aurek Base on the next transport.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Galactic_War",
  "/wiki/Aurek_Base",
  "/wiki/Hoth/Legends",
  "/wiki/3642_BBY",
  "/wiki/Talz/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Captain/Legends",
  "/wiki/General/Legends",
  "/wiki/Ando_(general)",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}