{
 "name": "Lassicar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Begeren"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3642 BBY Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Guard",
      "Imperial Guard"
     ]
    }
   ]
  }
 ],
 "content": "Lassicar was a Human male who served as an Imperial Guard of the reconstituted Sith Empire during the Great Galactic War, Cold War, and Galactic War. Born on the planet Begeren, Lassicar killed his own parents when he discovered they were part of a terrorist cell, and he was recruited into the Imperial Guard not long afterward.\nA legendary Guardsman with a fearsome reputation, Lassicar was sent by the Sith Emperor himself to stop the Jedi Knight known as the Hero of Tython from retrieving the plans for the Emperor's Fortress on the planet Hoth. However, Lassicar's attempts to trap the Jedi failed, and he was killed along with his elite Imperial Guardsmen shock troopers in a battle with the Knight inside the wreck of the Star of Coruscant superdreadnaught.\nLassicar was born to slave parents on the planet Begeren, which the reconstituted Sith Empire conquered in 3678 BBY. When he realized that his parents were part of a terrorist cell on the planet, Lassicar personally killed them and exposed the cell to Moff Harvus of the Sith Empire. The young man was then recruited into the Imperial Guard, the ranks of which he rose through faster than any other Guardsman.\nDuring his career as a Guardsman amid the Great Galactic War and the Cold War with the Galactic Republic, Lassicar personally killed six Jedi as well as over two dozen Sith Lords who earned the Sith Emperor's disfavor. A team of agents from the Republic Strategic Information Service, the Republic's intelligence agency, was sent to eliminate the Guardsman, but Lassicar killed them and shipped their bodies back to the Republic capital of Coruscant in a series of small containers.\nAround 3642 BBY, the Emperor selected Lassicar to lead a mission to the ice planet of Hoth. Lassicar and a group of Imperial Guardsmen were tasked with the capture of two Jedi Knights: Leeha Narezz and the Hero of Tython, who were both on Hoth to recover the plans for the Emperor's personal space fortress—though Lassicar was not aware of the specifics of the Jedi's mission. Lassicar sent a number of Guardsmen shock troopers to lay a trap for Narezz in the Highmount Ridge, a geological feature on Hoth that was riddled with caves and also home to the wreck of the Deference, a Pythar-class Imperial shuttlecraft that supposedly contained the plans for the station.\nLassicar's men set up turrets in the caves and injured Narezz when she entered. Meanwhile, Lassicar had begun to negotiate the Jedi's surrender via hologram when the Hero of Tython arrived, destroying the turrets just before Lassicar's Guardsmen entered and leveled their blasters at the Jedi. However, Lassicar's attempts to force the Jedi to surrender failed when Narezz's reinforcements—a squad of Republic troopers under the command of Sergeant Fideltin Rusk—abseiled into the cave. With the squad's help, the Hero killed Lassicar's men and secured the Deference.\nDespite the setback, Lassicar remained committed to his mission. Upon learning that the Hero intended to storm the crashed superdreadnaught Star of Coruscant, Lassicar took a contingent of Guardsmen shock troopers into the vessel to head off the Knight. The Hero and a companion fought through many of Lassicar's men before encountering the Guardsman himself with a pair of subordinates, and Lassicar requested that the two surrender peacefully or suffer the consequences.\nHowever, the Knight revealed that the Jedi's mission was a distraction for Narezz to secure the station plans from the White Maw pirates, who had stolen them and stored them in their treasure cache in the Star of Coruscant. When the Knight refused to surrender, Lassicar and his men engaged the Jedi and the Hero's companion in battle, but the conflict ended with the death of the Guardsmen.\nLassicar was arrogant and supremely confident in the superiority of the Imperial Guard. He was also intensely loyal to both the Sith Empire and the Emperor, as he was willing to sacrifice his parents for the good of the Empire and his own life in the service of its ruler. Lassicar's loyalty was such that he did not question the Emperor's instructions or inquire as to his reasons for capturing the two Jedi on Hoth.\nA light-skinned Human, Lassicar had brown hair and green eyes. He also possessed a number of scars along his right jaw.\nAs an Imperial Guardsman, Lassicar was highly trained in many forms of combat, and he was considered an incredibly deadly opponent, having killed a number of Jedi and several dozen Sith Lords during his career.\nLassicar wore the crimson armor of the Imperial Guard. While on Hoth, he forewent the uniform's crested helmet and chose to wear his traditional armor instead of the white environmental gear that some of his subordinates used. In combat on Hoth, Lassicar favored a vibrostaff.\nLassicar appears in Star Wars: The Old Republic, a massively multiplayer online role-playing video game released by BioWare and LucasArts in 2011. A major antagonist of the Jedi Knight-class storyline on the planet Hoth, Lassicar appears in hologram form in mission \"Sub-Zero Showdown.\"\nThe final mission on Hoth has two possible paths: The first, \"The Imperial Guard,\" has the player fight Lassicar and his men in the aft section of the Star of Coruscant, while the second, \"The White Maw,\" has the Jedi fight the pirate Zeshatt in the fore section. Whichever mission the player chooses, Sergeant Rusk will complete the other, but his squadmates will be killed against the highly-trained Imperials, and the Knight only goes after the White Maw out of vengeance. Therefore, this article assumes that the Knight allowed Sergeant Rusk to choose and that his squad survived, meaning that the player fought Lassicar.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Begeren",
  "/wiki/3642_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Guard",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Lassicar%27s_parents",
  "/wiki/Begeren_terrorist_cell",
  "/wiki/Tenebrae",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Emperor%27s_Fortress",
  "/wiki/Jedi/Legends",
  "/wiki/Mission_to_Hoth_(Hunt_for_the_Sith_Emperor)",
  "/wiki/Shock_trooper/Legends",
  "/wiki/Star_of_Coruscant",
  "/wiki/Superdreadnaught",
  "/wiki/Slavery/Legends",
  "/wiki/Invasion_of_Begeren",
  "/wiki/3678_BBY",
  "/wiki/Parent/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Harvus",
  "/wiki/Sith/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Water/Legends",
  "/wiki/Leeha_Narezz",
  "/wiki/Highmount_Ridge",
  "/wiki/Deference",
  "/wiki/Pythar-class_Imperial_shuttlecraft",
  "/wiki/Space_station/Legends",
  "/wiki/Turret/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Fideltin_Rusk%27s_squad",
  "/wiki/Republic_trooper",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Fideltin_Rusk",
  "/wiki/Squad/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Trooper/Legends",
  "/wiki/Starship/Legends",
  "/wiki/White_Maw",
  "/wiki/Pirate/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Vibrostaff",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/2011",
  "/wiki/Zeshatt",
  "/wiki/Category:Images_of_Lassicar",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3643_BBY",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Battle_of_Ilum",
  "/wiki/3640_BBY",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/3641_BBY",
  "/wiki/The_Old_Republic,_Blood_of_the_Empire_Act_1:_Shades_of_the_Sith"
 ]
}