{
 "name": "Latara",
 "display_name": "Latara",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Tan"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree Village"
     ]
    }
   ]
  }
 ],
 "content": "Latara was a female Ewok, and Princess Kneesaa's best friend. The two spent the majority of their time together. She was the sister of Nippet and Wiley. She became a hoodmaker apprentice, and often played music from her flute, which her friends: Wicket Wystri Warrick and Teebo.\nLatara, who craved attention, sometimes acted like a princess. Later, she wanted to join the Travelling Jindas so badly that she left Bright Tree Village and went with them, although she soon returned to the village.\nAs per usual, the Tree of Light's started to dwindle, and Chief Chirpa dispatched a band of Ewoks to rejuvenate it with sacred Light Dust. Wicket was held back, due to age, and Kneesaa, who desperately wanted to join the group, was forbidden by her father, on grounds of gender. However, Wicket was able to steal away, and catch up with the group, and Kneesaa, with Latara in tow, followed close behind. Hoping to reach the group in the Arbo Maze, Latara and Kneesaa ventured into the treacherous caverns, and were set upon by the Dulok Umwak and his nephew. Using her smarts, Kneesaa was able to outsmart the shaman and cause the two of them to entrap each other in a net of Denga fat.\nThe group reluctantly allowed the two girls to join, and together, they escaped the maze. But at the Valley of Floating Trees, near the Mountain of Light, the group was intercepted by King Gorneesh's army, who had the Ewoks bound and stranded, while they moved on to destroy the tree. Wicket and Kneesaa were able to escape at the last moment, and stow away on the King's floating tree. The others, including Latara, eventually broke free of their restraints, and resumed their original course to the mountain. There, they charged at the Dulok force, so as to allow Wicket to sprinkle the dust on the tree, restoring it to its former glory. The Duloks fled, and upon the Ewoks return to Bright Tree Village, Latara, Wicket, and Kneesaa with decorated with the Silver Feather of Bravery.\nOne day, when Latara was raving with other Ewoks, such as Wiley, Paploo, Teebo, and Wicket, Kneesaa was stuck inside the Logray's Hut, practicing the Three Lessons. She accidentally spilt some of Master Logray's plant growth formula on a Stranglethorn. The plant began to take over all of Bright Tree, and apparently, Latara's dancing came to a halt. Though she was absent from the disaster, she came out safe and sound on the other end.\nWhile sunbathing down by a river , Latara was drenched with water due to the antics of Wicket. Teebo, embarrassed that he had caused such a fuss, attempted to summon a mighty wind to cleanse Latara of her moistness. Instead, the Snow King, miles away in the Snow Palace, coincidentally used the Season scepter to bring about a perpetual winter. Teebo, who believed that he had caused the devastating snow, went into a state of shock and denial, as he followed Latara, and their companions: Warrick and the Princess, back to Bright Tree.\nUpon reaching Bright Tree, the group found the village all but abandoned. Many of the Ewoks had been caught out in the blizzard, trapped, and unable to return. Others were snowed into their houses. Teebo, seeking to find a remedy for his \"mistake,\" sought out Logray in his hut, but the elderly shaman was nowhere to be found. As Teebo, Latara, Warrick, and Kneesaa were rummaging, the Sunstar began to glow, carrying a transmission from the Sun King's palace. It was the Leaf Queen, imploring Logray to journey to the Palace to help the Coalition of the Freezing stop Odra, Duchess of Sleet, who had seduced the Snow King, and convinced him to commence the blizzard. Accepting the message on behalf of the absent Logray, Teebo and his companions set off for the Sun Palace in a flying leaf.\nEn route to the Palace, however, the foursome was ambushed by the Snow King's Icehead Commandos, who were able to capture Kneesaa. Latara, Warrick, and Teebo were caught in an avalanche, which effectively brought them to the Sun Palace. Inside, they were met by the Coalition of the Freezing High Command: the Sun King, the Flower Queen, and the chairperson, the Leaf Queen. Explaining that the winter was not a result of Teebo's magic, the Leaf Queen and the Sun King related the tale of the Season scepter's robbery from the Sun Palace. Disappointed that Warrick had not brought the Sunstar with him to stop Sleet, the young Ewoks took it upon themselves to enter into espionage on behalf of the Coalition.\nUpon reaching the Snow Palace, the Ewoks found it surrounded with Iceheads, and were unable to penetrate the defenses. Warrick took action, fabricating Icehead disguises for the threesome, and they set off into the palace. When they reached the throne room, Warrick continued his charade by pretending to sell ice-on-a-stick, but his ruse was seen through by Sleet. She alerted the guards, and the Skirmish at the Snow Palace ensued. During the fighting, Latara was imprisoned, and was cut off from the rest of the battle. The Snow King was eventually freed from Sleet's grasp, and he returned Endor to its natural state.\nWhen the Bright Tree Fête came about, Latara was charged with minding woklings, much to her discontent. Coincidentally, Warrick and Teebo had suffered the same fate, and had been forced to view the entertainment stylings of the Tumble Bunny trainer. Upon seeing the show, Latara backed away in horror, bumping into her cohorts. She supported Warrick in his vocal and extended attack on the Tumble Bunny trainer's show, though this was met with disapproval from Princess Kneesaa. Warrick found alternate entertainment for the group in Horville's Hut of Horrors. Latara, against better judgment, escorted her wokling into the attraction, but soon regretted it. The wokling was thrown into a state of shock, but Warrick found a solution in which the four of them would avoid retribution from their parents: they would host a slumber party for the woklings.\nDespite constant servings of sunberry pie, the woklings' lust for tumble bunnies was not slaked. Eventually, Teebo utilized his elite shaman skills and created a dream sucking device, and the woklings slept a restful night without mishap. Her duties fulfilled, Latara attended Warrick's own rendition of the Tumble Bunny trainer's show, though it held no interest for her, and set her to sleep.\nWhile fishing one day, Kneesaa lost her anklet in the Endor Sea. Her mishap summoned King Elbo, a mighty monarch, who decided to help her. He offered her two golden, jewel-encrusted anklets, but Kneesaa declined, claiming that they were not her anklets. When Elbo recovered her real anklet, she accepted without inquiring about the other two, which touched Elbo. He gave her all three anklets in appreciation of her selflessness.\nWhen Latara heard Kneesaa's story, her eyes spun at the idea of a jewel encrusted, golden flute to replace the wooden one Teebo and Warrick had made for her. Her demands and aspirations, however, appalled Warrick and Kneesaa, and deeply offended Teebo. Disgruntled, Latara set out for the sea all on her lonesome. When she reached the sea, she \"dropped\" her flute into the water, summoning Elbo. When Elbo presented her with a golden, shining flute, Latara at first gawked, then accepted the flute, but quickly doubled back on her admission, believing that the elaborate instrument might not be hers. Elbo produced a second flute, as decorative as the first, which caused Latara to lose all semblance of control. Driven insane by the beauty of the instruments, Latara lusted after both, spelling out repetitive demands to Elbo. Needless to say, the great King was dismayed by the ewoks greed. Just as her friends, Warrick, Teebo, and Kneesaa came to check up on her, the King threw the aspiring entertainer into a hatch at the top of his shell and dragged the helpless Latara to the depths of the Endor Sea.\nIn Elbo's Castle, Latara was placed in a cage formed by a diligent squid who would stand still, using his tentacles as bars. Eventually, Teebo and company came to her aid, engaging in a short scuffle with the squid, and freeing her of his dedicated watch, but they were foiled in their escape by the coincidental placement of a booby-trap by Elbo. Kneesaa offered the three anklets in exchange for their freedom, and while Elbo did not let them go, he was once again touched by the Princess' kindness. He devised a test for Latara, in which she would venture through a cave filled with all manners of treasure, and bring back the item of the highest value back to Elbo. At first, she was besotted with all the items, truly believing that they were all as valuable as one another. She stumbled across her old, wooden flute, and at first dismissed it, before recalling the hurt looks on Wicket and Kneesaa before, and the devastated look of love lost on Teebo's face. She realized that the friendship was the most valuable gift of all, and returned to Elbo. Satisfied, the fangly King freed his captives, and, in turn, Latara planted a kiss on Teebo. The young shaman apprentice wandered off in a daze.\nUsing her veto power, Kneesaa commissioned Latara, Warrick, and Teebo to accompany her on an expedition to feed a nest of baby gubas. The foursome climbed a towering tree to reach the gubas, but the chicks were not as responsive as the Princess had hoped. The group were knocked out of the tree, sending them plummeting to the base. Though none of them were injured, the Princess was deterred from helping the gubas in the future.\nOn their way back to Bright Tree Village, the group heard the cry of a perkle. Venturing off the beaten track to investigate, they found the animal trapped in a foreign device; a trap that they could not breach, even after attempting to lift it. While Teebo was stretching in order to prepare for a second attempt at lifting the device, his buttocks made violent contact with Latara, pushing her in the way of the mouth of the trap. The foreign device activated, sucking the hapless child into the impervious bubble, trapping her with the perkle. Teebo, seeking to right his buttock-tapping wrongs, prepared a magic spell with a dust base. Unfortunately, the dust blew into the trap, but it was able to destroy it from the inside, freeing Latara.\nAlerted, an Imperial Reconnaissance Droid made its way into the clearing to investigate the ruckus. It apprehended Teebo, and at the same time, Dr. Raygar, of the Galactic Empire, made his entrance on his Battlefield Subjugation Floatie, stunned the Princess, and demanded the location of Bright Tree Village and the Sunstar from Warrick and Latara. Though the Princess urged them not to tell, Warrick caved, and gave Raygar accurate directions. Pleased, Raygar had his droids capture all four Ewoks, and have them taken back to his ship.\nLatara and the others were thrown into a holding cell on Raygar's ship, while Raygar set off with two of his recon droids to recover the Sunstar. When Raygar's pilot droid, PD-28 attempted to bring the children some victuals, the remaining recon droid barred his entrance, leaving Latara and her friends to starve. But PD was able to find an alternate route, and was able to nourish the captives. Warrick then convinced the diminutive droid to aid them in the escape, and PD led them to a shuttle pod. The young Ewoks accidentally activated the craft, rocketing them towards Bright Tree Village.\nUnfortunately, Latara and her companions arrived too late. Raygar's forces had decimated the Ewok resistance, and the Doctor himself had wrested control of the Sunstar from Logray. As Latara and her companions landed, Raygar took off in his shuttle, spiriting away the Sunstar to Admiral Kazz's Star Destroyer. The Ewoks, shattered by the defeat, were naturally curious about the pod that had returned the four children. Latara decided to impress the elders by demonstrating her technical aptitude with the device, in the process accidentally activating it and sending her and her companions into the Endor system.\nRaygar made it to the Star Destroyer without incident, but the Ewoks were hot on his heels. Upon landing, the Imperials captured PD, but the Ewoks were able to escape their grasp. Warrick resolved to help PD, and delegated the task of reclaiming the Sunstar to Latara and Teebo. The only flaw with Warrick's plan was the obvious physical discrepancy between the Ewoks and the other denizens of the ship, so Latara devised a plan. She cobbled together droid disguises for both her and her companions, and made their way towards Raygar's laboratory. During their journey, Teebo was accosted by an MSE-series mouse droid, but was saved by Latara and her abrasive attitude towards the foreign droid.\nThey eventually found their way to Raygar's lab, where the Doctor himself was ranting and raving to himself about how he would be able to use the Sunstar to assassinate Galactic Emperor Palpatine. When he had finished his musing, Latara and Teebo accidentally knocked over a stack of Raygar's equipment. They attempted to shrug off the disaster by declaring themselves Imperial droids, but Raygar bought none of it. Striking the duo with the Sunstar and incapacitating them, he then left them alone in order for them to watch him construct a brand new superweapon with the Sunstar's powers. He then placed them in an escape pod, fired them out into space, for him to use as target practice. But before he could target properly, Warrick, Kneesaa, and PD barged into his room, and retrieved the Sunstar. They then escaped in their shuttle pod, picking up Latara and Teebo's escape pod on the way.\nThe Sunstar returned, PD decided to return to his people in the hopes of finding his old master. As the diminutive droid jetted away from the Ewoks, Latara realized that she had learned a valuable lesson about helping those less fortunate.\nIn Ewoks, Latara was voiced by Taborah Johnson in the first season and Sue Murphy in the second. In the first season Latara's hat was brown with a blonde braid and she had darker fur. In the second season, she had a white and blue hat with a brown braid, and her fur was lighter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Princess_Latara",
  "/wiki/Star_Wars:_Ewoks%E2%80%94Shadows_of_Endor",
  "/wiki/Ewoks_2",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Endor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Time/Legends",
  "/wiki/Nippet/Legends",
  "/wiki/Wiley_(Ewok)",
  "/wiki/Music/Legends",
  "/wiki/Flute/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Teebo/Legends",
  "/wiki/Travelling_Jindas",
  "/wiki/Tree_of_Light",
  "/wiki/Light_Dust",
  "/wiki/Arbo_Maze",
  "/wiki/Umwak",
  "/wiki/Umwak%27s_nephew",
  "/wiki/Shaman/Legends",
  "/wiki/Valley_of_Floating_Trees",
  "/wiki/Mountain_of_Light",
  "/wiki/Gorneesh",
  "/wiki/Silver_Feather_of_Bravery",
  "/wiki/Logray/Legends",
  "/wiki/Three_Lessons",
  "/wiki/Plant_growth_formula",
  "/wiki/Stranglethorn",
  "/wiki/Yarlubb_River",
  "/wiki/Water/Legends",
  "/wiki/Snow_King",
  "/wiki/Snow_Palace",
  "/wiki/Season_scepter",
  "/wiki/Sun_King%27s_palace",
  "/wiki/Leaf_Queen",
  "/wiki/Odra",
  "/wiki/Flying_leaf",
  "/wiki/Icehead",
  "/wiki/Flower_Queen",
  "/wiki/Ice-on-a-stick",
  "/wiki/Skirmish_at_the_Snow_Palace",
  "/wiki/Bright_Tree_F%C3%AAte",
  "/wiki/Tumble_Bunny_trainer",
  "/wiki/Tumble_Bunny",
  "/wiki/Horville%27s_Hut_of_Horrors",
  "/wiki/Sunberry_pie",
  "/wiki/Dream_sucking_device",
  "/wiki/Anklet",
  "/wiki/Elbo",
  "/wiki/Coral_Castle",
  "/wiki/Squid_prison_guard",
  "/wiki/Guba",
  "/wiki/Perkle",
  "/wiki/Imperial_Reconnaissance_Droid",
  "/wiki/Raygar",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battlefield_Subjugation_Floatie",
  "/wiki/Raygar%27s_freighter",
  "/wiki/PD-28",
  "/wiki/Escape_pod/Legends",
  "/wiki/Battle_of_Bright_Tree_Village_(Imperial-Ewok_War)",
  "/wiki/Kazz",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Endor_system/Legends",
  "/wiki/MSE-series",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Starlog_(magazine)#Starlog_Yearbook_3",
  "/wiki/Taborah_Johnson",
  "/wiki/Sue_Murphy",
  "/wiki/Wicket_Finds_a_Way:_An_Ewok_Adventure",
  "/wiki/The_Cries_of_the_Trees",
  "/wiki/The_Haunted_Village",
  "/wiki/Rampage_of_the_Phlogs",
  "/wiki/The_Travelling_Jindas",
  "/wiki/The_Tree_of_Light",
  "/wiki/The_Curse_of_the_Jindas",
  "/wiki/Sunstar_vs._Shadowstone",
  "/wiki/Wicket%27s_Wagon",
  "/wiki/The_Three_Lessons",
  "/wiki/Blue_Harvest",
  "/wiki/The_Crystal_Cloak",
  "/wiki/The_Wish_Plant",
  "/wiki/Home_is_Where_the_Shrieks_Are",
  "/wiki/The_Raich",
  "/wiki/The_Totem_Master",
  "/wiki/A_Gift_for_Shodu",
  "/wiki/Night_of_the_Stranger",
  "/wiki/Gone_With_the_Mimphs",
  "/wiki/The_First_Apprentice",
  "/wiki/Hard_Sell",
  "/wiki/A_Warrior_and_a_Lurdo",
  "/wiki/The_Season_Scepter",
  "/wiki/Prow_Beaten",
  "/wiki/Baga%27s_Rival",
  "/wiki/Horville%27s_Hut_of_Horrors_(episode)",
  "/wiki/The_Tragic_Flute",
  "/wiki/Just_My_Luck",
  "/wiki/Bringing_Up_Norky",
  "/wiki/Party_Ewok",
  "/wiki/Malani_the_Warrior",
  "/wiki/Battle_for_the_Sunstar",
  "/wiki/George_Lucas:_The_Creative_Impulse",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Galactic_Bazaar",
  "/wiki/Star_Wars_Galaxy_Magazine_7",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Latara"
 ]
}