{
 "name": "Lathe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kajain'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Lathe was a Kajain'sa'Nikto male who worked in the criminal empire of the Hutt crime lord Jabba Desilijic Tiure. A guard who worked in Jabba's Palace on the planet Tatooine, he was part of a group that traveled on a Bantha-II cargo skiff to the Great Pit of Carkoon in order to watch the execution of three of the Hutt's prisoners.\nThe Jedi Luke Skywalker, one of the prisoners, managed to arm himself with a lightsaber and begun attacking his captors when they tried to push into the maw of the sarlacc that dwelt in the pit. After Skywalker defeated all of the guards on the skiff he had been traveling on, he boarded the skiff carrying Lathe as the guards onboard began shooting at the Jedi. Skywalker then killed the guards on the second skiff, including Lathe, either with his lightsaber or by knocking them overboard to be eaten by the sarlacc.\nLathe was a Kajain'sa'Nikto male slave who worked in the criminal empire of the Hutt crime lord Jabba Desilijic Tiure and served as a guard in Jabba's Palace on the planet Tatooine. In 4 ABY, Jabba ordered that three of his prisoners—the Jedi Luke Skywalker and the smugglers Han Solo and Chewbacca—be fed to the sarlacc in the Great Pit of Carkoon. Two Bantha-II cargo skiffs and Jabba's sail barge, Khetanna, then traveled to the pit, with one skiff carrying the prisoners, and the other carrying a group of guards that included Lathe. Upon reaching the pit, the prisoners' skiff stopped above the sarlacc, while the skiff carrying Lathe, which was piloted by the Skrilling Pote Snitkin, began joyriding around in circles over the desert.\nFrom onboard his sail barge, Jabba gave the prisoners one last chance to beg for their lives. Solo and Chewbacca refused, and Skywalker threatened Jabba before being selected as the first to be executed. After being pushed off the plank above the sarlacc, Skywalker leapt back onto the skiff and attacked the guards with his lightsaber, which had been launched to him by his astromech droid R2-D2. Skywalker and his allies dispatched all of the guards aboard the first skiff while Snitkin piloted his skiff closer. Lathe stood ready while other guards fired their blaster pistols at Skywalker, prompting the Jedi to leap onto the second skiff and begin attacking Lathe and the others on board.\nStood around the middle of the skiff's deck, Lathe leveled his weapon at Skywalker as the Jedi knocked first Brock Starsher and then a human guard overboard. The Nikto Yotts Oren rushed passed Lathe, but was also sent flying into the sarlacc's maw by a blow from Skywalker, who then kicked at Lathe, causing the guard to reel back. Lathe was then killed as Skywalker defeated the remaining guards on board. Ultimately, the Jedi and his allies also killed Jabba and destroyed the sail barge before escaping.\nLathe had red skin.\nWhile on the skiff, Lathe wore a light blue tunic over a white shirt with a gray pauldron, brown pants, and a brown helmet. He used a black spear-like weapon to try and attack Skywalker.\nLathe first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. In the new Star Wars canon, the character was first identified in \"The Battle of Hoth and the Second Death Star\", an issue of the Star Wars Encyclopedia series published by De Agostini on December 11, 2020. The issue erroneously describes him as being killed by Lando Calrissian, which is instead Vedain's fate in the film.\nThe name originated in the Star Wars Legends continuity on a card in the 2001 Tatooine Limited set of the Star Wars Customizable Card Game; however, the card incorrectly pictured the Kajain'sa'Nikto Nysad. Lathe was then confirmed to be the Nikto wearing blue in the \"Rogues Gallery\" feature of Star Wars Insider 143 on July 23, 2013.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lathe",
  "/wiki/Lathe/Legends",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Death",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Mouth",
  "/wiki/Skiff",
  "/wiki/Lightsaber",
  "/wiki/Slavery",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Sarlacc",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Skrilling",
  "/wiki/Pote_Snitkin",
  "/wiki/Desert",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Blaster_pistol",
  "/wiki/Brock_Starsher",
  "/wiki/Human",
  "/wiki/Nikto",
  "/wiki/Yotts_Oren",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Shirt",
  "/wiki/Pauldron",
  "/wiki/Helmet",
  "/wiki/Spear",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/De_Agostini",
  "/wiki/December_11",
  "/wiki/2020",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Vedain",
  "/wiki/Star_Wars_Legends",
  "/wiki/2001",
  "/wiki/Tatooine_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Nysad",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_143",
  "/wiki/July_23",
  "/wiki/2013",
  "/wiki/Star_Wars:_Complete_Vehicles",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Insider"
 ]
}