{
 "name": "Latts Razzi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Korbori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Theelin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.79 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Strawberry blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Lavender"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "Krayt's Claw",
      "Razzi Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "Latts Razzi was a female Theelin bounty hunter who operated during the Clone Wars. She occasionally worked as part of a syndicate of bounty hunters known as the Krayt's Claw that included Boba Fett, Bossk, Oked, C-21 Highsinger, and Dengar. During her career, she also worked with bounty hunters such as Sugi, Embo, and others. After meeting the former Sith assassin Asajj Ventress, Razzi and the Krayt's Claw worked two jobs with her, including a job on Quarzite, and later on Serenno when Ventress hired their crew to attack Count Dooku's palace. After the Clone Wars ended, Razzi left the group and formed the Razzi Syndicate.\nDuring the Clone Wars, Latts Razzi worked as a bounty hunter in a team of hunters known as the Krayt's Claw. At one point, the group was hired by Major Rigosso for a job on Quarzite that required six hunters. Before they made their way to Quarzite, Razzi her fellow partners Bossk and Oked were present at a cantina in Mos Eisley on Tatooine. Oked approached Asajj Ventress at the bar and began to flirt with her, which ultimately led to his death. After witnessing their partner die, the two hunters called Ventress over to their table to tell her that they owed them a favor after killing one of their crew. Razzi and Bossk blackmailed Ventress into joining their team, saying that they would turn her over to the authorities if she did not agree to fill in for Oked on their upcoming mission. The two bounty hunters took Ventress to meet their leader, Boba Fett. When Ventress insulted Fett's stature and experience as a leader, Razzi and Bossk advanced on her to remind her that they could settle her debt to them another way, causing Ventress to back off. Fett's team then traveled to Quarzite in Bossk's ship, Hound's Tooth.\nAt a station above Quarzite, Rigosso explained that their job was to protect a chest of unknown contents on a subtram to Belugan leader Otua Blank. While some of the other hunters were curious what was inside the chest, Razzi dismissively replied that she did not care as long as they got paid. While delivering the chest, Razzi was partnered with Highsinger to stay with the chest while Boba and Bossk guarded the engine room and Dengar and Ventress were positioned at the rear of the tram. Soon after their departure, she and her partners were attacked by numerous Kage Warriors. Razzi fought alongside C-21 Highsinger, fending off many Kage Warriors by matching their skill in martial arts and using her grappling boas to great effect. Soon, she and Highsinger were attacked by the Kage leader Krismo Sodi. After matching the skilled warrior in hand-to-hand combat, Razzi pulled out her grappling boas again, swinging them at Sodi. However, the Kage ducked, and Razzi accidentally snared her partner Highsinger. Sodi then shoved Highsinger backwards, causing the pair to fall off of the tram.\nThey later regrouped at the Hound's Tooth, where Ventress appeared to give them their share of the bounty. Razzi commented on the pivotal role she played as part of the team, to which Ventress replied that she was not part of the team at all. Nonetheless, Razzi, Ventress, and the crew made their way back to Mos Eisley, where Razzi and Ventress drank and talked. Razzi commented that Ventress seemed on edge as Ventress jumped when other patrons entered the cantina, and Ventress replied that she sensed a monster from her past.\nBy the second year of the Clone Wars, the Kyuzo Embo had joined the team. Razzi and the rest of the syndicate members were present in a bar on Coruscant's Level 1313 when the undercover Jedi Master Quinlan Vos visited asking for information on how to find Asajj Ventress, a bounty hunter who had once been Count Dooku's Sith apprentice. Vos had been assigned by the Jedi High Council to assassinate Count Dooku and had decided to enlist Ventress as his partner. When Fett claimed that Ventress had cheated him, Latts pointed out that she had not cheated them and that they had been paid, but not in a way that pleased Fett. Fett reluctantly revealed that Ventress was pursuing a Volpai fugitive named Moregi on Pantora.\nLater, Razzi and the rest of Fett's syndicate were frequenting the Mos Eisley Cantina when Ventress came in to enlist their help for a mission to rescue Vos, who had been captured by Dooku and imprisoned on Serenno. Latts and her fellow hunters accepted the job after Ventress offered to pay them 250,000 credits immediately. Razzi along with Fett, Ventress, Bossk, and Highsinger traveled to Serenno in Fett's ship, Slave I. While the bounty hunters created a distraction by attacking Separatist droids and shuttles, Ventress managed to infiltrate Dooku's palace and located Vos. However, he had turned against Ventress after learning that she had murdered his former Master Tholme. While Razzi and her colleagues managed to trap Dooku under a webbing, they were forced to escape off world with Ventress when Vos spurned their rescue effort and openly sided with Dooku.\nRazzi did not limit her bounty hunting career to sticking solely with Krayt's Claw, however. In 19 BBY, she was present on Nal Hutta acting as a bodyguard for the Grand Hutt Council, working alongside Sugi and fellow Krayt's Claw members Embo and Dengar, when the renegade Sith Lord Maul, his brother Savage Opress, and Pre Vizsla arrived to try and convince the Hutts to join their burgeoning criminal alliance. When negotiations turned sour, the Hutts summoned their bounty hunter protectors to kill the intruders. Despite her accuracy and skilled use of an X-8 Night Sniper blaster, Razzi was unable to land a shot on the trio and was briefly knocked down when Maul hurled a Twi'lek thug at her. The bounty hunters, backed by additional Hutt enforcers, managed to pursue the three out of the palace and onto the landing platform but the tide turned against them when a number of jetpack-equipped Mandalorian warriors arrived and fired missiles into their ranks. Razzi brought down one warrior with her grappling boa before advising a retreat back inside the palace. She and Dengar hung back as Sugi and Embo engaged the enemy, but when it was clear they were going to lose she had Dengar throw in smoke bombs and shouted for her companions to flee. Maul opted to let them go since they had no allegiance as bounty hunters.\nAt some point during the reign of the Galactic Empire, Razzi formed her own criminal syndicate called the Razzi Syndicate. They were in frequent competition with the Pyke Syndicate. Cynabar's InfoNet at one point predicted that the Pyke Syndicate would challenge the Razzi Syndicate, with the latter group being expected to fail in defending itself. At one point, Razzi's organization obtained a copy of the Smuggler's Guide when one of her operatives, a Rybet thief nicknamed \"Sticky Fingers\" stole it from Landonis Calrissian after the Esoomian brawler Bumblethunk beat him up.\nRazzi then had its contents verified by the Adarian Twirm who would confirm its authenticity. Among her notes in the Guide, Razzi vowed to kill everyone at Cynabar's InfoNet once her power grew to enough heights. Twirm would then make suggestions for the organization which enraged Razzi, prompting her to order Twirm's execution. Razzi's entire exchange with Twirm would then be recorded in the logbook until its seizure by Crimson Dawn when they conducted a raid on a Razzi Syndicate warehouse. Qi'ra, lieutenant to Crimson Dawn leader Dryden Vos, recorded details of the stolen cargo in the logbook shortly after it had been acquired in the raid.\nRazzi at one point became involved with the operations of Grakkus the Hutt, assigned to deliver a shipment of Mark X Executioner droids for use in his arena. The shipment however, never arrived despite her promises. When Han Solo came across the Smuggler's Guide for a second time, he speculated that Razzi might have come to a bad end. Years later, while meeting with other former Krayt's Claw members, Boba Fett noted that none of them had ever found out what exactly had become of Razzi.\nLatts Razzi was a Theelin female with strawberry blonde hair, blue eyes, and lavender skin. She stood at 1.79 meters tall. She immersed herself in first class comforts and expensive clothing, which she used her career to pay for.\nLatts was highly skilled in many types of weaponry. She was said to have pinpoint accuracy with a blaster pistol, as well as being an expert in several forms of exotic unarmed combat. During her job on Quarzite she displayed her self to be capable of going head-to-head in hand-to hand combat with the leader of the Kage Warriors, Krismo Sodi. Razzi was said to charge very high rates, yet had the skill to back it up.\nLatts weapon of choice was a grappling boa, which she used as a whip and a lariat against her many opponents. She saw the weapon as stylish and practical, when not in use the grappling boa was draped around her shoulders like a scarf. During her conflict with Maul and Death Watch on Nal Hutta, she utilized an X-8 Night Sniper.\nLatts Razzi first appeared in \"Bounty,\" the twentieth episode of the fourth season of the television series Star Wars: The Clone Wars. She was voiced by Clare Grant, whose face was used as the template for the character's facial features. The character was created as a wedding gift for Clare Grant, as she was a big fan of Star Wars and wanted to play a character in the series. The character would appear in two more episodes of the Clone Wars—\"Brothers\" and \"Eminence\"—in which she was once again voiced by Clare Grant.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Latts_Razzi",
  "/wiki/Latts_Razzi/Legends",
  "/wiki/Wait_for_It",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Korbori",
  "/wiki/Theelin",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/Krayt%27s_Claw",
  "/wiki/Razzi_Syndicate",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_Wars",
  "/wiki/Boba_Fett",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Oked",
  "/wiki/C-21_Highsinger",
  "/wiki/Dengar",
  "/wiki/Sugi_(bounty_hunter)",
  "/wiki/Embo",
  "/wiki/Sith",
  "/wiki/Assassin",
  "/wiki/Asajj_Ventress",
  "/wiki/Quarzite",
  "/wiki/Serenno",
  "/wiki/Count_of_Serenno",
  "/wiki/Dooku%27s_palace",
  "/wiki/Major",
  "/wiki/Rigosso",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Tatooine",
  "/wiki/Death",
  "/wiki/Starship",
  "/wiki/Hound%27s_Tooth",
  "/wiki/Safe_cargo_objective",
  "/wiki/Subtram",
  "/wiki/Belugan",
  "/wiki/Otua_Blank",
  "/wiki/Kage_Warriors",
  "/wiki/Kage",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Grappling_boa",
  "/wiki/Krismo_Sodi",
  "/wiki/Standard_year",
  "/wiki/Kyuzo",
  "/wiki/Unidentified_bar_(Level_1313)",
  "/wiki/Coruscant",
  "/wiki/Level_1313",
  "/wiki/Jedi_Master",
  "/wiki/Quinlan_Vos",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Sith_apprentice",
  "/wiki/Jedi_High_Council",
  "/wiki/Capture_of_Moregi",
  "/wiki/Volpai",
  "/wiki/Moregi",
  "/wiki/Pantora",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/Credit",
  "/wiki/Mission_to_Serenno_(Krayt%27s_Claw)",
  "/wiki/Slave_I",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Droid",
  "/wiki/Shuttle",
  "/wiki/Castle_Serenno",
  "/wiki/Battle_of_unidentified_planet_(Tholme_and_Ventress)",
  "/wiki/Tholme",
  "/wiki/19_BBY",
  "/wiki/Nal_Hutta",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Savage_Opress",
  "/wiki/Pre_Vizsla",
  "/wiki/Shadow_Collective",
  "/wiki/X-8_Night_Sniper",
  "/wiki/Twi%27lek",
  "/wiki/Jetpack",
  "/wiki/Mandalorian",
  "/wiki/Missile",
  "/wiki/Smoke_bomb",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Pyke_Syndicate",
  "/wiki/Cynabar%27s_InfoNet",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Rybet",
  "/wiki/Thief",
  "/wiki/Sticky_Fingers",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Esoomian",
  "/wiki/Bumblethunk",
  "/wiki/Adarian",
  "/wiki/Twirm",
  "/wiki/Crimson_Dawn",
  "/wiki/Razzi_warehouse_raid",
  "/wiki/Qi%27ra",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/Dryden_Vos",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Mark_X_Executioner_droid",
  "/wiki/Han_Solo",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Blaster_pistol",
  "/wiki/Scarf",
  "/wiki/Death_Watch",
  "/wiki/Bounty_(episode)",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Clare_Grant",
  "/wiki/Brothers",
  "/wiki/Eminence_(episode)",
  "/wiki/Category:Images_of_Latts_Razzi",
  "/wiki/The_Lost_Nightsister",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark_(audiobook)",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Databank_A-Z",
  "/wiki/No_Disintegrations_(Fantasy_Flight_Games)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Punishing_One_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Hound%27s_Tooth_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Databank_(website)",
  "/wiki/Revenge_(episode)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Four"
 ]
}