{
 "name": "Layahna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sylvia IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human/Sylphe hybrid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resolution"
     ]
    }
   ]
  }
 ],
 "content": "Layahna was a female Human/Sylphe hybrid who lived during the Old Republic era.\nLayahna was born after her father, Andrew Woolfson, married a Sylphe from the Azul brigade.\nToo young at the time, she didn't follow her parents to Arrakad when they performed a mission. When her mother died, Layahna sensed it through their psychic link, natural between Sylphe who were related.\nDuring the following years, she slowly prepared her vengeance and eventually discovered who was behind the disaster. Before 1098 BBY, she managed to become Karl Descemovitch's assistant after taking the identity of Shirley Wyn. During a diplomatic mission to the Ischim Empire, she introduced weapons to the Snow Queen. In the second day of the mission, she killed Karl Descemovitch's son Lemaï before leading the members of the mission into false tracks during their investigation. She also destroyed Z3PO, who recorded the murder, and hid the droid.\nOn the fourth day, the Resolution movement launched a false attack on the Snow Queen, just to introduce an assassin droid on board. The next day, the droid was activated and attacked the crew, as Layahna went to kill the elder Descemovitch.\nAfter the death of her parents, Layahna became full of hatred against the Galactic Republic and Karl Descemovitch, who was the indirect murderer of her mother, and thus responsible for her father's suicide.\nShe would do anything to fulfill her vengeance, even usurping an identity and using plastic surgery. She trained hard in Sholân Kha as well as standard and exotic weapons. She wore a Chameleon suit adapted to her martial art and willingly used weapons and objects which Karl Descemovitch would recognize as a Sylphe's. She didn't hesitate to kill Lemaï Descemovitch even if he wasn't a threat, just to make his father suffer.\nLayahna nonetheless managed to play a role during her time as Descemovitch's assistant, keeping a calm, cold and professional attitude. Still, even during the travel to the Ischim Empire, she would conserve a holo of her family.\nLayahna was created by Franck Vidal for an ambiguously Legends canon roleplaying scenario which appeared in the French magazine Avalon 2.\nFor gameplay purposes, her characteristics were those of Leia Organa Solo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Sylvia_IV",
  "/wiki/Human/Legends",
  "/wiki/Sylphe",
  "/wiki/Gender/Legends",
  "/wiki/Old_Republic_era",
  "/wiki/Andrew_Woolfson",
  "/wiki/Disaster_of_Arrakad",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Shol%C3%A2n_Kha",
  "/wiki/Hologram/Legends",
  "/wiki/Franck_Vidal",
  "/wiki/Roleplaying_game",
  "/wiki/Avalon_2",
  "/wiki/Leia_Organa_Solo",
  "/wiki/La_Veuve_Noire"
 ]
}