{
 "name": "Laynara",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Laynara was a member of Raze's criminal organization.\nBecause she was extremely clever, Raze was proud that Laynara was in his employ and made her his top lieutenant. For five years, Laynara worked alongside Wyl Tarson, another of Raze's lieutenants and the two of them became friends, though Laynara cared about him more than she let on.\nDespite their friendship, Tarson never told her that he was secretly spying on Raze's organization for the Alliance to Restore the Republic. After Raze discovered Tarson's espionage, Raze sent him on what he considered a suicide mission to Ahakista and had Laynara accompany Tarson.\nTarson stopped on a couple of planets before proceeding to Ahakista to gather members for the team that he would need for the mission. At their first stop, Tarson \"introduced\" Laynara to his first new \"recruit\": Baco Par. She looked on, perplexed as Tarson kidnapped the passed-out and drunk lock-breaker to their ship.\nAfter landing on another planet a few days later, Tarson, Laynara, and Par made their way through a rain storm to an opening in a defunct transport. When they entered, they were greeted by the sight of many carvings, all of them of either the same woman or boy. As Laynara took a closer look at one of the carvings of the woman, she and Par found themselves at the wrong end of a lightsaber, which was held by their unwilling host.\nLaynara and Par were saved by Tarson, who tried to disarm the their assailant. When Tarson found himself about to be killed by the other man, Laynara diverted the attacker's attention by breaking a bust of the woman. Correctly guessing that the statues and carvings meant something to him, Laynara threatened to break the others if he didn't agree to let Tarson talk to him.\nTarson then revealed that their attacker was a man named Darca Nyl. After an hour of talking, Tarson was unable to convince Nyl to join him on the mission and decided that it was time for them to leave. Before departing for the ship, Laynara asked Nyl if the woman who was depicted in the bust would have wanted him to live like he was now. Nyl would not answer the question and told her that it would be best if she left. However, Nyl decided to come along after all. Par asked Laynara how she convinced him, but Laynara said that she had nothing to do with it. She suspected that Nyl simply \"realized that he wanted to hurt someone again.\"\nFollowing her orders from Raze, Laynara delivered a package to an associate of Raze named Sardoth when they arrived on Ahakista. In spite of Raze's orders to return to Per Lupelo, and the fact that Tarson all but insulted her for her loyalty to Raze, Laynara remained on Ahakista to help him with his mission to destroy The Hub.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rebellion_9",
  "/wiki/Rebellion_10",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Raze_(criminal)",
  "/wiki/Wyl_Tarson",
  "/wiki/Spy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Mission_to_Ahakista",
  "/wiki/Ahakista/Legends",
  "/wiki/Baco_Par",
  "/wiki/Teril_Nyl",
  "/wiki/Neas_Nyl",
  "/wiki/Lightsaber/Legends",
  "/wiki/Darca_Nyl",
  "/wiki/Sardoth",
  "/wiki/Per_Lupelo",
  "/wiki/The_Hub_(computer)",
  "/wiki/Star_Wars:_Rebellion:_The_Ahakista_Gambit"
 ]
}