{
 "name": "Laze_Loneozner",
 "display_name": "Laze Loneozner",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Laze \"Fixer\" Loneozner was a male human who lived on the Outer Rim planet Tatooine during the Age of the Empire. He was a childhood friend of Luke Skywalker and the boyfriend of Camie Marstrap. Fixer constantly felt out-performed by Skywalker and their friend Biggs Darklighter, and would often put them down using nicknames. The circle of friends also included Deak and Windy. Loneozner ran Tosche Station, but spent most of his time talking and tinkering with Skywalker, Darklighter, and Marstrap.\nLaze Loneozner hailed from Tatooine, a sun-scorched desert planet located in the Outer Rim Territories of the galaxy. He was a childhood friend of Luke Skywalker and the boyfriend of Camie Marstrap. Fixer constantly felt out-performed by Skywalker and their friend Biggs Darklighter, and would often put them down using nicknames.\nSometime after Skywalker's rescue of Han Solo, Loneozner and Marstrap encountered several Nikto bikers at Tosche Station. They had several of their things and drinks taken from them. Loneozner verbally protested their actions, something Marstrap attempted to dissuade him from doing but failed to do so. The Niktos then began to rough him up. Marstrap attempted to intervene, shouting for them to stop, but she was restrained by one of the Niktos and was forced to watch the Niktos beat Loneozner with a stun baton. As he and Marstrap continued to struggle, the Niktos suddenly stopped their attack when Boba Fett entered the room. The Niktos then attacked Fett who proceeded to dispatch the Niktos one by one while Loneozner and Marstrap huddled in a corner and watched.\nIn the original production of Star Wars: Episode IV A New Hope  in 1976, there were several minutes of film involving Luke Skywalker spending time at Tosche power station with his friends. Fixer was played in that scene by Anthony Forrest. Although those scenes were not used in the final film release, they still appeared in the novelization of the film as well as the first issue of the Marvel Star Wars comics adaptation of A New Hope. They were also retained in the 1981 Star Wars Radio Drama broadcast by National Public Radio. In this dramatization, Fixer was voiced by Adam Arkin. Fixer made a few more appearances in various stories and sourcebooks. These sources are part of Star Wars Legends, previously known as the Expanded Universe, and are therefore not official canon. However, Fixer and his backstory were partially canonized by Topps's app Star Wars: Card Trader, which was released in 2015.\nIn \"Chapter 2: The Tribes of Tatooine,\" the second chapter of the series The Book of Boba Fett, he was portrayed by Skyler Bible.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Laze_Loneozner",
  "/wiki/Laze_Loneozner/Legends",
  "/wiki/Fixer",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Luke_Skywalker",
  "/wiki/Camie_Marstrap",
  "/wiki/Biggs_Darklighter",
  "/wiki/Deak_(Skywalker%27s_friend)",
  "/wiki/Windy",
  "/wiki/Tosche_Station",
  "/wiki/Time",
  "/wiki/Homeworld",
  "/wiki/Star",
  "/wiki/Desert",
  "/wiki/The_galaxy",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Han_Solo",
  "/wiki/Nikto",
  "/wiki/Stun_baton",
  "/wiki/Boba_Fett",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1976",
  "/wiki/Anthony_Forrest",
  "/wiki/Star_Wars_(1977)_1",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/1981",
  "/wiki/Star_Wars_(radio)",
  "/wiki/National_Public_Radio",
  "/wiki/Adam_Arkin",
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/2015",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Skyler_Bible",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_5",
  "/wiki/Building_the_Galaxy",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)"
 ]
}