{
 "name": "Ledina Chott",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "26 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Ledina Chott was a Human female who was a famous interplanetary pop singer who resided on Kuratooine. In 44 ABY, she had received various gifts from a mysterious man named Thadley Biolan, who was really known as corrupt Alliance General Stavin Thaal. Since Chott had physical similarities to all of Thaal's ex-wives, the General looked to Chott as a new mistress.\nDuring Wraith Squadron's investigation into Thaal's guilt regarding his involvement with the Lecersen Conspiracy, they deduced that, as Biolan, he would retire from the military service and probably pick Chott as a potential wife. In response, one of the Wraiths, Trey Courser, wore a double disguise of Biolan over Thaal and he and a few of the other Wraiths kidnapped her from her home and drugged her before Thaal himself could meet her.\nThe next day, Courser and fellow Wraith Drikall Bessarah smuggled Chott's unconscious form to the Kuratooine warehouse where Thaal performed some of his criminal operations. From there, after the two Wraiths dealt with security, they activated Chott's emergency transponder so that the local Kura City Guard could save her; this way, Thaal could be framed for kidnapping Chott, though they weren't counting on him actually being convicted for their crime.\nBy the time she was kidnapped, Ledina Chott had been a pop star for about two years, yet she wasn't jaded and used to the life of a celebrity yet. She was also annoyed that her home on Kuratooine would feature holos and stills of her works only and not of works of some of the celebrities she liked. Her facial resemblance to the template that General Stavin Thaal loves made her a potential wife to him, which was why he sent her gifts as Thadley Biolan.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/26_ABY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kuratooine",
  "/wiki/44_ABY",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/General/Legends",
  "/wiki/Stavin_Thaal",
  "/wiki/Wraith_Squadron",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/Trey_Courser",
  "/wiki/Drikall_Bessarah",
  "/wiki/Kura_City_Guard",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)"
 ]
}