{
 "name": "Lee-Char",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Strokill Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gold"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Calamari monarchy",
      "Galactic Republic",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lee-Char was a male Mon Calamari who served as the leader of Mon Cala during the Clone Wars. He was set to take the throne from his father, King Yos Kolina, but his father's assassination led to a civil war on the planet. In the final battle of the war, he personally killed Riff Tamson, the Separatist ambassador responsible for his father's assassination. At the end of the war, Lee-Char was crowned as the 83rd King of Mon Cala by the Quarren chieftain Nossor Ri.\nAfter the Clone Wars ended, Lee-Char continued to rule Mon Cala as the world witnessed the transition of the Galactic Republic into an Empire. Even as his health deteriorated, he remained opposed to the Empire's tyrannical regime and would eventually, with the help of Rebel Alliance leader Princess Leia Organa, recorded a message speaking out against the Empire. Although he was killed shortly afterwards by Imperial forces, his powerful words prompted a mutiny that saw the might of the Mon Cala Mercantile Fleet become a valuable asset to the Rebel cause.\nBorn years before the Clone Wars, Lee-Char was the son of Yos Kolina, King of Mon Cala. As Kolina's son, Lee-Char was next in line to become Mon Cala's king.\nHowever, in 20 BBY, Kolina was murdered by an unknown assailant. This forced Lee-Char to take his father's place as the new king.\nFollowing his father's assassination, a meeting was held between Lee-Char and his fellow Mon Calamari and Chieftain Nossor Ri's Quarren Isolation League. The Mon Calamari then asked Republic Senator Padmé Amidala and her protector Jedi Knight Anakin Skywalker to assist in the negotiations. The Quarren invited Separatist ambassador, Commander Riff Tamson, to assist them in demanding that a Quarren king be installed. Despite Lee-Char's assurances that he was dedicated to serving both the Quarren and Mon Cala people, Tamson believed that Lee-Char had not earned the right to speak. Tamson and the Quarren then left believing that the time for words were over. Ri then expressed his sympathies to Lee-Char about the loss of his father.\nLee-Char later met with Senator Meena Tills and Gial Ackbar, captain of the Mon Calamari Guard. Tills ordered Ackbar to be Lee-Char's bodyguard. Ackbar told the Senator that Lee-Char was not ready to command the Mon Cala planetary defense services. Despite agreeing with Ackbar, Lee-Char prepared for war. Lee-Char spoke to his people, assuring them he would lead them and that the Quarren would not attack. However, the Quarren and Separatist forces under Tamson attacked. Lee-Char along with Skywalker and Ackbar went to the battlefield to watch. Despite Skywalker's plea to get Lee-Char to safety, the prince chose stay with his people. During the battle Lee-Char helped Skywalker and Amidala take several troops through a tube to get behind the AQ-series battle droids. It was destroyed and Skywalker told Lee-Char that they would have to wait for Republic reinforcements.\nRepublic SCUBA troopers under Jedi Master Kit Fisto, Commander Monnk, and Skywalker's Padawan, Ahsoka Tano arrived. As the Mon Calamari cheered the Republic's arrival, Ackbar told Lee-Char to make them cheer for him and gave him a blaster spear. Lee-Char then came under attack by Tamson, but was saved by Tano. The two of them then took a OMS Devilfish through several tubes. Tamson tried to break through the tube, but he and his forces were forced to retreat. Tills told Lee-Char that he must demand a surrender from the Quarren. However, Tamson and his forces, aided by Hydroid Medusas from Karkaris attacked. Lee-Char and his forces attempted to hold their ground against both the aqua droids and Hydroid Medusas, but Ackbar urged the prince to retreat to the caves. After making their retreat to the caves, Lee-Char began to distress over his own incapability and inexperience as leader despite encouragement from Ackbar and Tano.\nLee-Char, the Jedi, and the Senators contacted the Jedi Council to request more reinforcements before communications were lost before deciding to attempt to rendezvous with the Republic cruiser that was at the surface. However, Tamson destroyed the cruiser as they neared the surface. Lee-Char and his group split up, with the prince going with Tano, Fisto, and the clones while Skywalker took Ackbar, Amidala, and Tills with him. As Lee-Char, the Jedi, and clones went into hiding, the prince saw how the Separatists and the Quarren had begun to take the Mon Calamari to labor camps. To inspire his people, Lee-Char took a conch shell and blew into it, making a loud sound to communicate to his people that he was still alive and would continue to fight for them. Lee-Char and his company were confronted by the aqua droids, but the droids cut down by the Jedi. The Republic were able to convince the Gungans to send their Grand Army as reinforcements to free the Mon Cala. However, Tamson deployed his reinforcements to counter the Republic's reinforcements. Tamson then deployed his Trident-class assault ships and used them to create a vortex that pulled in all the Mon Calamari and Republic forces. Lee-Char and Tano then came under attack by Tamson, but was saved when Fisto took him on in order for Lee-Char to escape.\nLee-Char and Tano came up with plan to free all the prisoners and convince Ri to join him. They made their way to one of the camps, where they met up with Ackbar, Tills, and Monnk. Despite his people's belief that the Quarren were behind Kolina's assassination, Lee-Char knew that Tamson was behind it. After allowing himself to be captured, the prince demanded an audience with Tamson, where he was able to convince Nossor Ri that the Karkarodon had gone back on his deal with the Quarren to seize the planet's throne. Realizing the error in the decision to aid the Separatists, Ri and the Quarren betrayed Tamson and helped Lee-Char and the Republic free Mon Cala, and the prince killed Tamson one-on-one after the latter confessed to killing Kolina, avenging his death. In the aftermath, Lee-Char was crowned by Lemcke as the 83rd king of Mon Calamari\nSometime after the proclamation of the New Order, Lee-Char came under the influence of a surviving Jedi named Ferren Barr. Barr told Lee-Char that he had foreseen the Mon Calamari saving the galaxy and began advising Lee-Char's negotiations. Barr did this from his cave refuge where he and his six disciples stayed in hiding. As Lee-Char started turning his back on the Galactic Empire's trade offers, Moff Wilhuff Tarkin came to Mon Cala on the Sovereign and sent down ambassador Telvar to negotiate with Lee-Char. He continued to deny these offers, saying that the Empire would take their resources away until they were in poverty. Despite Telvar telling the King that the Empire would protect them, his advisor, Raddus, told him that the ships they had proved otherwise with Lee-Char telling Raddus to be silent. After Telvar left, Raddus and the King began talking about the idea of seceding from the Empire.\nDarth Vader and three Inquisitors traveled to Mon Cala to search for Barr and Telvar's shuttle detonated killing Telvar and the rest of the crew. Lee-Char quickly ran to Barr for advice and the Jedi said he could deal with the Inquisitors. Lee-Char then told him an individual in black armor that accompanied them, to which Barr claimed he knew his name: Skywalker. Before long, Tarkin's forces invaded Mon Cala and battles erupted throughout the surface. A large battle broke out at Dac City where Lee-Char was and Vader and his group quickly took their landing pad and made for the palace. Lee-Char assigned Raddus to the southern end of Mon Cala and Ackbar to the northern. Lee-Char then attempted to negotiate terms with Tarkin about a cease-fire but the man only ordered that he do it first. Lee-Char then asked Barr what to do and the Jedi convinced him, through a mind trick, to take drastic action. Vader and the Inquisitors fought their way into the palace and the Inquisitor Ninth Sister interrogated him for the location of Barr. Lee-Char gave in shortly before a school of large fish-like creatures generated a tsunami of waves that swept Lee-Char, Vader and everyone in Dac City away.\nLee-Char was rescued by a Quarren submarine and put on life support until he awoke. Lee-Char realized that Barr's location was in peril and contacted him immediately. Barr was shocked at this and he evacuated his cave refuge as Vader arrived to hunt him down. Vader chased Barr and his disciple to Bel City and some of them attempted to slow him down, ending their lives in the process. As Vader and the Inquisitors marched through Bel City, Vader was contacted by Tarkin who convince him to capture Lee-Char and end the fighting on Mon Cala. Vader agreed and left the Inquisitors to hunt down Barr. The Inquisitors eventually managed to corner him and his last disciple, a Force-sensitive named Verla but Barr outsmarted them, using their Jedi past and the not yet activated inhibitor chips in the Inquisitor troopers to turn the clones on their masters. The skirmish allowed Barr and Verla to escape and the Inquisitor Tenth Brother was gunned down.\nLee-Char had relocated to his Royal Command Bunker where he continued to lead his people against the Empire. However Vader arrived and killed his guards before disarming him. Tarkin then had Vader take Lee-Char to a window where he was forced to watch the Star Destroyers bombard the northern hemisphere of Mon Cala. Lee-Char refused to surrender his forces and Barr arrived to confront Vader. The two fought and Barr revealed that he had assassinated Telvar in order to start the fighting on Mon Cala. Lee-Char was shocked at this and broadcasted an order for all Mon Calamari and Quarren forces to ceasefire. He then contacted Tarkin and told him of his surrender. Tarkin agreed to cease the bombardment once a shuttle arrived to take Lee-Char away. Barr laughed as he fought Vader and Lee-Char asked how he could do so. Barr told him it was part of his plan and that the Mon Calamari starships would eventually be at the forefront of a great rebellion. Lee-Char said billions were dying and Barr said it was billions that would inspire trillions. Vader then slew Barr and took Lee-Char away. Lee-Char was imprisoned on Strokill Prime.\nSometime after the Battle of Yavin, Princess Leia Organa of the Rebel Alliance planned to rescue Lee-Char with help from Shu-Torun's queen Trios. During this time, Lee-Char was put on life-support at Strokill Prime's Imperial base. Leia and her team broke into the prison using the captured Moff Tan Hubi and found Lee-Char in his cell. Their meeting was short-lived, as the base was put on silent alert after Hubi found an emergency button. As the king spoke his final speech to an interrogation recording droid, stormtroopers burst into the room and opened fire, killing him and Hubi.\nAfter his death, Leia attempted to broadcast Lee-Char's message to Mon Cala but the regent, Dors Urtya, intervened and took it away. Urtya decided to do it himself and it prompted a mass mutiny of the Mon Cala Mercantile Fleet. Twelve Mon Calamari Star Cruisers made it into the hands of the rebellion and were converted for war at the Mako-Ta Space Docks.\nDespite being an ally of the Republic, Lee-Char was primarily focused on the governing of Mon Cala. As the battle for Mon Cala began, Lee-Char was hesitant and scared of the consequences of the fighting. After he witnessed his people being rounded up, Lee-Char admitted to his only remaining companion, Ahsoka Tano, that he was not experienced or skilled enough to lead his people. However, after some encouragement from Tano, Lee-Char regained his composure and vowed to do everything he could to liberate his people. Lee-Char would sneak into a prison camp and inspire the prisoners to continue the fight, rallying his people to defeat the Separatists. His leadership impressed Nossor Ri, who eventually accepted his rule.\nDespite lacking confidence in himself at the beginning of the battle, Lee-Char grew more comfortable in his leadership role and by the battle's end, was a capable warrior and strong leader for his people.\nLee-Char first appeared in \"Water War,\" the season premiere for Season Four of the Star Wars: The Clone Wars television series. He was voiced by Adam McArthur. Lee-Char's name is a reference to Charlie the Tuna, the cartoon mascot of the real-world Starkist brand of tuna.\nLee-Char was originally supposed to return in an arc where he no longer trusts the Republic because of what happen to Ahsoka.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lee-Char",
  "/wiki/Lee-Char/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/Mon_Cala",
  "/wiki/1_ABY",
  "/wiki/Strokill_Prime",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Clone_Wars",
  "/wiki/King",
  "/wiki/Yos_Kolina",
  "/wiki/Assassin",
  "/wiki/Riff_Tamson",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Ambassador",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Quarren",
  "/wiki/Chief",
  "/wiki/Nossor_Ri",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mutiny_on_Mon_Cala",
  "/wiki/Mon_Cala_Mercantile_Fleet",
  "/wiki/Reproduction",
  "/wiki/Standard_year",
  "/wiki/20_BBY",
  "/wiki/Death",
  "/wiki/Parent",
  "/wiki/Quarren_Isolation_League",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Commander",
  "/wiki/Time",
  "/wiki/Meena_Tills",
  "/wiki/Gial_Ackbar",
  "/wiki/Captain",
  "/wiki/Mon_Calamari_Guard",
  "/wiki/Bodyguard",
  "/wiki/Mon_Cala_planetary_defense_services",
  "/wiki/Battle_of_Mon_Cala",
  "/wiki/Confederacy_military",
  "/wiki/Troop",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Republic_Military",
  "/wiki/Clone_SCUBA_trooper",
  "/wiki/Jedi_Master",
  "/wiki/Kit_Fisto",
  "/wiki/Clone_Commander",
  "/wiki/Monnk",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Blaster_spear",
  "/wiki/One_Man_Submersible_Devilfish",
  "/wiki/Hydroid_Medusa",
  "/wiki/Karkaris",
  "/wiki/Droid",
  "/wiki/Cave",
  "/wiki/Jedi",
  "/wiki/Jedi_High_Council",
  "/wiki/Consular-class_space_cruiser",
  "/wiki/Cruiser",
  "/wiki/Clone_trooper",
  "/wiki/Cloning",
  "/wiki/Labor_camp",
  "/wiki/Gungan",
  "/wiki/Gungan_Grand_Army",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Trident-class_assault_ship",
  "/wiki/Prisoner",
  "/wiki/Coronation_of_Lee-Char",
  "/wiki/Lemcke",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Ferren_Barr",
  "/wiki/Ferren_Barr%27s_cave_refuge",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Sovereign",
  "/wiki/Telvar",
  "/wiki/Advisor",
  "/wiki/Raddus",
  "/wiki/Darth",
  "/wiki/Inquisitorius",
  "/wiki/Shuttle",
  "/wiki/Vader%27s_armor",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/Battle_of_Dac_City",
  "/wiki/Dac_City",
  "/wiki/Dac_City_palace",
  "/wiki/Defense_of_the_southern_polar_regions",
  "/wiki/Mind_trick",
  "/wiki/Palace",
  "/wiki/Ninth_Sister",
  "/wiki/Unidentified_Mon_Cala_creature",
  "/wiki/Unidentified_Quarren_submarine",
  "/wiki/Bel_City",
  "/wiki/Force-sensitive",
  "/wiki/Verla",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Skirmish_in_Bel_City",
  "/wiki/Tenth_Brother",
  "/wiki/Royal_Command_Bunker",
  "/wiki/Starship",
  "/wiki/Prison",
  "/wiki/Battle_of_Yavin",
  "/wiki/Shu-Torun",
  "/wiki/Trios",
  "/wiki/Unidentified_Imperial_base_(Strokill_Prime)",
  "/wiki/Tan_Hubi",
  "/wiki/Stormtrooper",
  "/wiki/Regent",
  "/wiki/Dors_Urtya",
  "/wiki/MC-series_star_cruiser",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Water_War",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Adam_McArthur",
  "/wiki/Tuckerization",
  "/wiki/Category:Images_of_Lee-Char",
  "/wiki/Gungan_Attack",
  "/wiki/Prisoners",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Darth_Vader_(2017)_15",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Darth_Vader_(2017)_17",
  "/wiki/Star_Wars_(2015)_44",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_(2015)_46",
  "/wiki/Star_Wars_(2015)_47",
  "/wiki/Star_Wars_(2015)_48",
  "/wiki/Star_Wars_(2015)_49",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Star_Wars_(2015)_62",
  "/wiki/Allegiance_2",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Ships_of_the_First_Order_and_the_Resistance",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_12",
  "/wiki/Pilots_and_Crew",
  "/wiki/Databank_(website)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Ech-Char",
  "/wiki/34_ABY",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_The_Clone_Wars_%E2%80%93_The_Lost_Missions"
 ]
}