{
 "name": "Leeka Pali",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Olive"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Spine League"
     ]
    }
   ]
  }
 ],
 "content": "Leeka Pali was a Mirialan female member of the Trade Spine League during Imperial Governor Ubrik Adelhard's Iron Blockade of the Anoat sector. She served as an advisor to Shortpaw, the leader of the league.\nLeeka Pali was a Mirialan female who served in the Trade Spine League as an advisor to the league's leader, Shortpaw. She and the rest of the league were trapped within the Anoat sector during the Galactic Civil War when the Galactic Empire created the Iron Blockade around the sector following the death of Galactic Emperor Palpatine.\nDuring the blockade, Pali and two of Shortpaw's other advisor; Ndaya and Onn Iria, met with Shortpaw at his junk stall in Longstar Marketplace on the planet Burnin Konn. There, Shortpaw introduced them to a young smuggler who had been working for the crime lord Happy Dapp, an associate of the league. Shortpaw and Pali then explained the issues the league were facing with getting starships through the blockade and how they planned to try and bring a ship into the Mataou system.\nThe group's plan was to have the smuggler head to the planet Mataou and probe the Imperial sensor network there using old Hutt equipment on the world. Pali warned the smuggler that the equipment would be heavily guarded by old Hutt security droids and after Shortpaw promised to lend smuggler a hazmat scow for the mission, the mission began.\nThe smuggler successfully fought through the Hutt security droids in a graveyard on Mataou and activated the old scanning equipment three then contacted Shortpaw to report the success. Pali answered the comlink instead as let the smuggler know that the scanner had not gathered enough data on the blockade. After returning to Burnin Konn to meet with Shortpaw and Pali again in the market, the smuggler returned to Mataou and activated a second scanner.\nWith the data from the first two scanners Pali and the league were able to spot several potential weak points in the Iron Blockade, but sent the smuggler out again to activate a third scanner. Upon successfully reaching the equipment and turning it on, the smuggler contacted Pali to report in. Upon meeting again in person at the market, Shortpaw explained they would need one more scanner to be activated while Pali began making preparations for the next stage in the plan to have the starship breach the blockade.\nUpon activating the final scanner, the smuggler was told by Pali to return to Burnin Konn as they now had enough data to move onto the next stage of the plan. At the market once again, Shortpaw and Pali briefed the smuggler on the next step of the plan: creating a distraction on Mataou so that the ship could slip through undetected. They sent both the smuggler and Dapp to create the distraction, and after the pair successfully fought their way through an Imperial garrison, Pali contacted the smuggler to report that the ship had successfully entered the sector.\nPali and Shortpaw congratulated the smuggler once the three were reunited at LongStar Marketplace, but refused to reveal any further information about what the ship they had smuggled in had been carrying. With no further immediate work, Pali said the league would be in touch and told the smuggler that Riley was waiting with a task in the nearby spaceport.\nLeeka Pali had green skin and brown hair and eyes. She wore green Mirialan tattoos across her face. She was initially unhappy with hiring a smuggler with no ship, but was impressed by the criminal's work for the league. Pali did not trust the smuggler's sister Riley, and warned the smuggler to be careful around her.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mirialan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Trade_Spine_League",
  "/wiki/Galactic_Empire",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Iron_Blockade",
  "/wiki/Anoat_sector",
  "/wiki/Advisor",
  "/wiki/Shortpaw",
  "/wiki/Galactic_Civil_War",
  "/wiki/Sector",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Blockade",
  "/wiki/Ndaya",
  "/wiki/Onn_Iria",
  "/wiki/Longstar_Marketplace",
  "/wiki/Planet",
  "/wiki/Burnin_Konn",
  "/wiki/The_Smuggler",
  "/wiki/Crime_lord",
  "/wiki/Dapp",
  "/wiki/Starship",
  "/wiki/Mataou_system",
  "/wiki/Smuggler",
  "/wiki/Mataou",
  "/wiki/Sensor",
  "/wiki/Hutt",
  "/wiki/Hutt_security_droid",
  "/wiki/Hazmat_scow",
  "/wiki/Security_droid",
  "/wiki/Scanner",
  "/wiki/Comlink",
  "/wiki/Garrison",
  "/wiki/Riley",
  "/wiki/Spaceport",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/The_Art_of_Star_Wars:_Uprising"
 ]
}