{
 "name": "Leekz_Kleng",
 "display_name": "Leekz Kleng",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Malastare"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sebolto",
      "freelance Gran hitmen"
     ]
    }
   ]
  }
 ],
 "content": "Leekz Kleng was a male Gran who was affiliated with a number of freelance Gran hitmen by the year 22 BBY. By this time, a bounty had been placed on Kleng by an individual who considered the Gran a murderous thug. The individual, who wish to remain anonymous, offered  4000 for Kleng's capture, but was also willing to pay  2500 for his death. Also affiliated with the Dug king and crime lord Sebolto, Kleng spent time on the planet Malastare where Sebolto was based.\nIn 22 BBY, the Mandalorian Bounty hunter Jango Fett traveled to Malastare in order to capture Sebolto and learn of his contacts with the Bando Gora cult. While traveling through the planet's jungles in order to reach Sebolto's Palace, Fett encountered Kleng who attacked him with a blaster. The Mandalorian however, was able to defeat the Gran and capture him alive, claiming the bounty on him.\nLeekz Kleng first appeared in the LucasArts video game Star Wars: Bounty Hunter released in 2002. Shortly prior to the game's release he was also mentioned in Star Wars: Bounty Hunter: Prima's Official Strategy Guide, a strategy guide for the game released by Prima Games. Kleng's role in the game was that of an optional secondary bounty within the game's tenth mission, which was part of the fourth chapter. It is possible for players to claim the bounty on Kleng alive or dead, or not at all, however this article assumes that players captured the Gran alive, at this is the most profitable outcome and required for one hundred percent game completion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sebolto",
  "/wiki/Assassin/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Credit",
  "/wiki/Death/Legends",
  "/wiki/Dug/Legends",
  "/wiki/King/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Bando_Gora/Legends",
  "/wiki/Sebolto%27s_Palace",
  "/wiki/Blaster/Legends",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Bounty_Hunter",
  "/wiki/2002",
  "/wiki/Star_Wars:_Bounty_Hunter:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Prima_Games"
 ]
}