{
 "name": "Leeta_Poandeu",
 "display_name": "Leeta Poandeu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Talus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aggregate Civil Liberties Organization"
     ]
    }
   ]
  }
 ],
 "content": "Leeta Poandeu was a female Human slicer of the Aggregate Civil Liberties Organization who lived on Talus during the Galactic Civil War.\nLeeta Poandeu was a slicer and a member of the Aggregate Civil Liberties Organization, a pro-Rebel organization during the Galactic Civil War between the Rebel Alliance and the Galactic Empire. Leeta Poandeu was highly trained in combat situations and was working in the A.C.L.O. office, east of Dearic on Talus.\nDuring the same time, the A.C.L.O. was in conflict with the Nightstrike Soldier Hegemony, a mercenary organization affiliated with the Empire. In 1 ABY, the N.S.H. was negotiating its integration into the Imperial Military. However, the negotiations were disturbed when Leeta sliced the personal computer of Galiir Ac Yandar, the N.S.H. commander, and planted information that almost ruined his reputation with the Empire. By slicing Galiir's computer, Leeta planted incriminating evidence, which made it seem as though Galiir was putting the Empire in a bad light. Unfortunately for Poandeu, Galiir was cleared of any wrongdoings, but wanted revenge against the person who had sliced his computer.\nGaliir discussed his plight with a spacer who was working for Imperial Colonel Braedic Ekirk. He informed the spacer that he was certain the slicer was a member of the A.C.L.O. He did not, however, know which member was responsible for the slicing. Galiir sent the spacer to the A.C.L.O office. The spacer was tasked with finding out more information, so that the culprit could be determined. After killing a number of A.C.L.O members, the spacer discovered a datapad which indicated that Leeta Poandeu was the slicer. The spacer went to the second floor of the office, and entered the central computer control room. Immediately, the spacer began attacking Leeta, who in turn fired back. However, it was no use. Leeta was being outmatched by the spacer, and she soon feel to the ground lifeless.\nLeeta Poandeu appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Leeta Poandeu was added to the game as part of the \"Crisis of Allegiance\" arc with the release of \"Chapter 2: The Talus Incident,\" on August 1, 2006. In the game, players who partake in the so-called \"Legacy Quest,\" will eventually find themselves in the employ of Braedic Ekirk and Galiir Ac Yandar. While working for Galiir, players are sent to the A.C.L.O office to assassinate Leeta.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Green_(disambiguation)",
  "/wiki/Aggregate_Civil_Liberties_Organization",
  "/wiki/Galiir_Ac_Yandar",
  "/wiki/Slicer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/A.C.L.O._office",
  "/wiki/Dearic/Legends",
  "/wiki/Nightstrike_Soldier_Hegemony",
  "/wiki/Mercenary/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Braedic_Ekirk",
  "/wiki/Datapad/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_1",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}