{
 "name": "Leevan Tenza",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sabat"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Massassi Group",
      "Massassi Group",
      "Partisans"
     ]
    }
   ]
  }
 ],
 "content": "Leevan Tenza was a laconic Sabat male who served under General Jan Dodonna in the Alliance to Restore the Republic. In 5 BBY, he was arrested by the Alliance after disobeying an order and attacking an Imperial target too early, but rather than face court-martial he escaped custody and joined up with Saw Gerrera's Partisans.\nTenza prove better suited to life in the Partisans and proved an efficient member, especially when using his DH-447 sniper rifle. In 0 BBY, he was stationed in the the Partisans base on the moon Jedha, when a group of captive Alliance agents were imprisoned there. The Partisans were then forced to flee when their base was destroyed by a blast wave from the Destruction of Jedha City by the Empire's Death Star superweapon.\nIn 5 BBY, the Sabat warrior Leevan Tenza was serving in the Alliance to Restore the Republic as part of the team under General Jan Dodonna, which was known as the Massassi Group, when Tenza disobeyed orders to attack an Imperial target earlier than intended. The Sabat was then placed under arrest by the Alliance for the disobedience and, facing a court-martial, he escaped rebel custody to join up with the Partisans led by the freedom fighter Saw Gerrera. Tenza made a name for himself by aligning with the Partisans, and was not the only one who had defected from the Alliance, although his motive was different from most who had chosen to become more radical in their resistance against the Empire.\nIn 0 BBY, Tenza was amongst the Partisans stationed with Gerrera in the Catacombs of Cadera on the moon Jedha. Shortly after a group of Alliance agents were captured in Jedha City and imprisoned in the catacombs, Tenza was quietly playing a \"homemade\" variant of dejarik on a table near the cells where the prisoners were being kept. After one of the three human Partisans sat at the table with him rolled a set of dice, Tenza raised his hands in the air and cried out as the others cheered.\nHe then moved to another part of the catacombs and was stood at a terminal as the Alliance agent Jyn Erso was escorted through the room on her way to see Gerrera. The Partisans were then forced to evacuate the catacombs and flee when the structure was destroyed by the blast wave generated by the Empire's destruction of Jedha City using the Death Star superweapon. While some Partisans did escape with their lives, others, including Gerrera, perished in the blast. At some point an artist mentioned Tenza in his journal, including a depiction of the Partisan as an example of the Sabat species.\nLeevan Tenza was a defiant and laconic individual who embraced his guilt rather than declaring his innocence when he was arrested by the Alliance for disobeying an order. He was better suited to life amongst the more casually organization of the Partisans and proved to be a particularly efficient member, especially when using his DH-447 sniper rifle. His casual terseness was put to the test when he came to fully understand that the blast wave from the Death Star's attack was headed toward the catacombs. He had pink skin and gray hair.\nWhile in the catacombs, Tenza wore a light brown jacket over a dark brown shirt with a black and red kama and brown pants. He also wore black and red fingerless gloves, black boots and a series of brown bandoliers and belts full of ammunition. He chewed on a toothpick while playing dejarik and carried a DH-447 sniper rifle with a supercollimator barrel. Tenza also sometimes flew a T-65B X-wing starfighter for the Partisans which bore the colors of the Cavern Angels squadron.\nLeevan Tenza first appeared in the 2016 Anthology film, Rogue One: A Star Wars Story. The character was played by creature performer Dilu Miah. He was not named in the film, but received identification in the accompanying reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Guardians_of_the_Whills_(novel)",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Sabat",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Massassi_Group",
  "/wiki/Partisans",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/5_BBY",
  "/wiki/Galactic_Empire",
  "/wiki/Court-martial",
  "/wiki/Saw_Gerrera",
  "/wiki/DH-447_sniper_rifle",
  "/wiki/0_BBY",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Soldier",
  "/wiki/Jedha_City",
  "/wiki/Dejarik",
  "/wiki/Human",
  "/wiki/Jyn_Erso",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Death_Star",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Kama",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Bandolier",
  "/wiki/Belt",
  "/wiki/Sniper_rifle",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Cavern_Angels",
  "/wiki/Squadron",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Dilu_Miah",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Andor_(television_series)",
  "/wiki/Guardians_of_the_Whills:_The_Manga",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Saw%27s_Renegades_Expansion_Pack",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_(2015)_39",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/February_19",
  "/wiki/2017"
 ]
}