{
 "name": "Leger DeMain",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Erysthes"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 48 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Leger DeMain grew up on the planet Erysthes in the Corporate Sector. His parents worked as indentured harvesters on the chak-root farms, but the young Leger wanted to avoid their fate. He developed a plan to escape. When a Corporate Sector Authority ship landed Leger set several of the enormous agrirobots on a rampage across the farm compound. In the ensuing confusion Leger, his family and some other farmers managed to take over the ship and escape.\nThey traveled through the Core Worlds for many years. Afterwards Leger pursued his true passion: holofeatures. Starting with small tricks and escape acts his fame soon grew. But after an unfortunate accident during a performance on Cloud City his career came to a sudden halt.\nDeMain set forth on another path and started his own theatrical production company. The show's combination of song, dance, theater, and escape acts proved popular and the company performed for many highranking people. While they traveled through the galaxy, Leger witnessed many wrongdoings of the Empire and was reminded of his own youth on Erysthes. Leger offered his services to the Rebel Alliance. With his popular performances he often had easy access and could smuggle information to many Imperial-held worlds.\nLeger once helped general Airen Cracken escape an Imperial blockade on Boden by disguising Cracken as his Kloo horn player.\nLeger flew a Aavman Extravagance 11-S Space Yacht, the Siren III. The ship had undergone heavy modifications to double as a theater and was outfitted with secret compartments to smuggle for the Rebel Alliance.\nIn Cracken's Rebel Operatives DeMain is first called \"Leger,\" indicating this might be a false name.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Erysthes",
  "/wiki/48_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Chak-root/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Agrirobot/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Holodrama/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Boden",
  "/wiki/Kloo_horn/Legends",
  "/wiki/Aavman_Extravagance",
  "/wiki/11-S_Space_Yacht",
  "/wiki/Siren_III",
  "/wiki/Cracken%27s_Rebel_Operatives"
 ]
}