{
 "name": "Leida Mothma",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chandrila"
     ]
    },
    {
     "name": "Born",
     "values": [
      "18 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Mothma's family"
     ]
    }
   ]
  }
 ],
 "content": "Leida Mothma was a human female who was the daughter of Perrin Fertha and Senator Mon Mothma of Chandrila. Mothma resided on the Imperial capital of Coruscant during the Age of the Empire. She favored Chandrilan customs over the politics of her mother, a member of the Imperial Senate, with whom she had an estranged relationship.\nThe daughter of Perrin Fertha and Senator Mon Mothma, Leida Mothma was born around 18 BBY, and her homeworld was Chandrila. At a young age, she met the Chandrilan banker Tay Kolma, one of her mother's oldest friends, as well as his sisters, Adrine and Marsa. Mothma also met her mother's cousin, Vel Sartha, whom she called Aunt Vel. Mothma lived with her parents on the planet Coruscant, the capital of the Galactic Empire, during the Imperial Era. Despite spending most of her time on Coruscant, Mothma grew bitter about her mother's political career in the Imperial Senate and instead retreated into the simplicity of Chandrila's traditions. By the time she was thirteen, she was already nursing a rebellious streak.\nIn 5 BBY, Mothma joined her parents for breakfast at their apartment. She backed out of plans for her mother to take her to classes and asked her father to take her instead, as she believed Mon only did it to \"show off\" that she was involved. Mothma accused her mother of only thinking about herself, then contained her breakfast as Mon left, hurt by Leida's words and Fertha's lack of support.\nA few days later Mothma attended her parents' dinner party, wearing a white and silver dress. She was introduced to Tay Kolma, her mother's old school friend who she had met when she was younger. Mothma admitted that she could not remember. Mothma then asked her mother if she could be excused, as her father had said Mothma needed to ask her first. Mon said she could be excused, and Mothma told her mother to have fun before leaving.\nNot long after, Mothma attended another party hosted at her family apartment, this time dressed in a golden dress. Mothma approached her mother, who was again talking Kolma who Mothma commented was \"here all the time now,\" with Kolma responding that he was \"learning to love Coruscant.\" Mon told Mothma that her farther was looking for her and Mothma noted that her mother was drinking Chandrilan Squigs, which Mon denied stating that she'd lost her taste for it. Mothma agreed that the drink was disgusting, but Kolma stated that that was the point. Mothma then left to find her father, telling Kolma that it was nice to see him again. While her parents talked with some of the guests in the dinning room, Mothma ate some green coloured sweets.\nA few days later, Vel Sartha visited the Mothma family at the Chandrilan Embassy, claiming she had just returned from Tassio Moon, and gifted Leida with a golden colored dress. When Mon returned home following a disaster session with the Imperial Senate, Leida excitedly ran up to her to show her the dress. When Mon pointed out that Fertha may not let her daughter wear it, Leida snapped back that her father let her do whatever she wanted. Mon then told Leida to go try on the dress so that she could talk privately with Vel, and Mothma returned shortly after, wearing the dress and spinning around to show her mother and Vel.\nNot long after, Leida ate with her parents and Vel, during which Fertha mentioned Tay Kolma, who Leida referred to as Mon's old boyfriend. Mothma inquired if Fertha this was something that he had told Leida, but Perrin merely told Mon that the key word has been old. Mon then corrected her daughter, saying that Kolma was an old friend of hers from grade school.\nLeida Mothma was a human female with long brown hair and brown eyes. Mothma was weary of her mother's political endeavors and did not have the best relationship with her. She would enlist her father's support to get out of things her mother wanted for her. Although Mothma was well-rehearsed in the formalities of a dinner with many political guests, it did not stop her from making a snide remark at Mon Mothma's friend Tay Kolma.\nLeida Mothma made her debut in \"The Axe Forgets,\" the fifth episode of Andor. She was portrayed by Bronte Carmichael. In Star Wars Legends, Mon Mothma's daughter was first mentioned in the Dark Empire Sourcebook, written by Michael Allen Horne published in 1993 by West End Games for use with Star Wars: The Roleplaying Game. Her first name of Lieda was confirmed in the 2002 reference book The New Essential Guide to Characters by Daniel Wallace.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Leida_Mothma",
  "/wiki/Lieda_Mothma",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chandrila",
  "/wiki/18_BBY",
  "/wiki/Human",
  "/wiki/Chandrilan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mon_Mothma%27s_family",
  "/wiki/Perrin_Fertha",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/Galactic_Empire",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Imperial_Era",
  "/wiki/Politics",
  "/wiki/Parent",
  "/wiki/Imperial_Senate",
  "/wiki/Reproduction",
  "/wiki/Homeworld",
  "/wiki/Banker",
  "/wiki/Tay_Kolma",
  "/wiki/Adrine",
  "/wiki/Marsa",
  "/wiki/Vel_Sartha",
  "/wiki/Planet",
  "/wiki/Time",
  "/wiki/5_BBY",
  "/wiki/Foodstuff",
  "/wiki/Chandrilan_Embassy/Canon",
  "/wiki/Standard_day",
  "/wiki/Silver",
  "/wiki/Clothing",
  "/wiki/Gold",
  "/wiki/Chandrilan_Squig",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/The_Axe_Forgets",
  "/wiki/Bronte_Carmichael",
  "/wiki/Star_Wars_Legends",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Dark_Empire_Sourcebook",
  "/wiki/Michael_Allen_Horne",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/2002",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Daniel_Wallace",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Kassa_(episode)",
  "/wiki/Standard_year",
  "/wiki/September_27",
  "/wiki/2022",
  "/wiki/October_1",
  "/wiki/August_2"
 ]
}