{
 "name": "Lej_Carner",
 "display_name": "Lej Carner",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "6 ABY",
      "Garos IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Lej Carner was the son of an Imperial Army Major General on Garos IV. He was killed by Chanceller, a resistance fighter and contemporary of his romantic interest, Alexandra Winger.\nLej Carner was a Human male whose father was a Major General in the Imperial Army. When his father was assigned to run the Imperial mining center complex on the planet Garos IV in 6 ABY, Carner followed. He was enrolled in the University of Garos, and had several classes with Alexandra Winger, the Governor's daughter, and showed a level of romantic interest in her. Winger cultivated a friendship with Carner, but not to return his affection; she was a member of the Garosian Underground and hoped to learn about his father's operations. Unfortunately for her, he had no knowledge that was useful to her. He was due to attend the Imperial Academy at the end of his studies in 7 ABY.\nDuring a visit by the Imperial-class Star Destroyer Judicator to the planet, Carner witnessed Winger drive her landspeeder past the entrance to the Governor's mansion and decided to follow her. He found out that she was part of the underground when she participated in an attack on a convoy attempting to transport Hfredium ore to the Judicator. Carner attempted to apprehend her, but he was surprised by one of Winger's fellow rebels, a man named Chanceller. He shot and killed Carner before he could inform anyone of her loyalties. Chanceller disposed of the body by throwing it off the Tahika Cliffs while Winger hid his landspeeder in a cave.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Garos_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Major_General/Legends",
  "/wiki/Chanceller",
  "/wiki/Alexandra_Winger",
  "/wiki/Carner",
  "/wiki/Planet/Legends",
  "/wiki/University_of_Garos",
  "/wiki/Governor/Legends",
  "/wiki/Committee_of_Seven_for_Garosian_Unification",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Judicator/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Governor%27s_mansion_(Garos_IV)",
  "/wiki/Hfredium",
  "/wiki/Tahika_Cliffs",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/A_Glimmer_of_Hope",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/West_End_Games",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}