{
 "name": "Lek Svaal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "Lek Svaal was a male Trandoshan who was a young hunter during the time of the Cold War between the Galactic Republic and the reconstituted Sith Empire.\nLek Svaal met Qyzen Fess and Barsen'thor when he was hunting a creature called the Dusk Shadow on Tatooine. Svaal had laid a scent trail to the remains of Qyzen Fess's father and had planted a trap rigged with explosives, an act dishonorable of a hunter in Qyzen Fess's opinion. However, the Dusk Shadow attacked at that moment, making Svaal run away in horror. Afterwards, Fess spoke with Svaal, who was shocked that the creature could be killed without tricks and promised him to become more honorable hunter.\nLater Svaal informed Fess—who had at the time been undergoing the shko-yagu, a ritual signifying his transition over the halfway point of his life—regarding a potential prosperous hunt on Alderaan, and he asked the Scorekeeper's Herald to accompany him. Inside the Pallista Spaceport, the pair met Svaal, accompanied by several Wookiees who were led by the one named Gwarror. In revenge of the long history of enslavement of Wookiees by the Trandoshans, Gwarror had been hunting Trandoshans for years, killing those weakened by the shko-yagu. He had used Svaal to lure Fess to Alderaan, although Svaal had not told Gwarror that Fess would be accompanied by a Jedi. After dealing with the Wookiees, the Consular and Fess spoke to Svaal, who revealed that he had witnessed Gwarror receiving a list of targets to kill from a Trandoshan named Veneb Drassk. Infuriated that one of his own species was a traitor, Fess was determined to hunt down Drassk.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Lek_Svaal",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Qyzen_Fess",
  "/wiki/The_Barsen%27thor",
  "/wiki/Dusk_Shadow",
  "/wiki/Tatooine/Legends",
  "/wiki/Qyzen_Fess%27s_father",
  "/wiki/Shko-yagu",
  "/wiki/Alderaan/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gwarror",
  "/wiki/Veneb_Drassk",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}