{
 "name": "Lekek Poost",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Salmon"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Smuggler"
     ]
    }
   ]
  }
 ],
 "content": "Lekek Poost was a shifty, fast-talking Mon Calamari male who worked in the Anoat sector, acquiring items for a price. During the Imperial Iron Blockade of the sector, Poost joined the crew of the Smuggler and ran missions around the sector for them.\nLekek Poost was an Mon Calamari male who worked in item acquisition in the Anoat sector during the Iron Blockade, a lockdown of the sector by the Galactic Empire in order to prevent the sector's occupants from learning of the death of Galactic Emperor Sheev Palpatine during the Empire's crushing defeat at the Battle of Endor.\nSeveral months into the blockade, Lekek Poost became a member of the crew of the Smuggler, a young member of an Uprising forming against the Empire. The Mon Calamari was sent on a variety of missions across the sector by the smuggler.\nShifty and fast-talking, Poost was capable of acquiring anything for a price and would always deliver at the last moment, although never a moment sooner. A collector, Poost had a background in diplomacy and preferred acting defensively while on missions. He had salmon skin and yellow eyes.\nPoost wore a gray shirt, blue pants, a brown belt, and black boots. He used a black vibrosword.\nLekek Poost was created for the mobile game Star Wars: Uprising, which was developed by Kabam and released on September 10, 2015. The Mon Calamari served as a unique five-star crew member available through the Premium Crane, an in-game shop where the player, as the Smuggler, can spend chromium, an in-game currency, in exchange for randomized loot ranging from three stars or better in quality.\nAs such, acquiring Poost as a crew member is optional; however, this article assumes 100 percent game completion of Star Wars: Uprising, which means the Smuggler acquired Poost as a member of the crew and dispatched him on Crew Runs. On Crew Runs, Poost is strong on Gear Finder Runs.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/The_Smuggler",
  "/wiki/Anoat_sector",
  "/wiki/Galactic_Empire",
  "/wiki/Iron_Blockade",
  "/wiki/Sector",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Standard_month",
  "/wiki/Uprising",
  "/wiki/Smuggler",
  "/wiki/Diplomat",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Vibrosword",
  "/wiki/Video_game",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/Chromium",
  "/wiki/Category:Images_of_Lekek_Poost",
  "/wiki/StarWars.com"
 ]
}