{
 "name": "Lekket",
 "display_name": "Lekket",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Smugglers"
     ]
    }
   ]
  }
 ],
 "content": "Lekket was a female Quarren from the planet Mon Calamari during the last days of the Galactic Republic.\nLekket and her egg-mate, Tallet, used to run a smuggling operation on behalf of several Hutt gangsters. An ambitious Quarren named Tikkes learned of their illicit affairs and informed the Republic authorities. A Jedi Master known as the Dark Woman led a raid on the undersea cartel and devastated their operations. Lekket and Tallet's bodyguards opened fire on the Republic forces as the two of them dove into an access tube hoping to escape. The Dark Woman deflected some stray blaster fire which summarily struck a nearby fuel cell. The cell exploded leaking toxic acid into the escape tubes. Tallet was doused with the acid, and Lekket was barely able to pull him to safety.\nThe two Quarrens escaped from Calamari and fled to the planet of Balmorra. There, Colicoid scientists treated Tallet to a bacta chemical bath. They were able to save his life, but his face was permanently scarred. Leaving Balmorra, they both swore vengeance against Tikkes for betraying them.\nThe Quarren refugees established a new home for themselves on the dry, volcanic world known as Talas. As time passed, they established a small army of droideka destroyer droids. They sent a message requesting the service of the bounty hunter, Aurra Sing. Aurra arrived on Talas and the Quarrens sent their droidekas after her in order to test her ability. Aurra exceeded all of their expectations. Lekket explained their history to Aurra and asked her to assassinate Tikkes . Aurra had absolutely no interest in killing Tikkes, but she accepted the mission anyway, because she knew that this would create the opportunity for her to kill her old mentor, the Dark Woman.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Tallet",
  "/wiki/Hutt/Legends",
  "/wiki/Tikkes/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/An%27ya_Kuro",
  "/wiki/Balmorra/Legends",
  "/wiki/Colicoid/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Talas",
  "/wiki/Droideka/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Star_Wars_(1998)_29",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_132",
  "/wiki/The_Official_Star_Wars_Fact_File_134",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}