{
 "name": "Lema_Xandret",
 "display_name": "Lema Xandret",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Sebaddon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lema Xandret was a droid-maker affiliated with the reconsituted Sith Empire and the mother of Cinzia Xandret, a Sith apprentice. For many generations, the Xandret family had no Force-sensitive members until Cinzia Xandret was born. The Sith Empire was eager to take and train any potential Sith apprentice and demanded that Lema should hand over Cinzia, who later was renamed Eldon Ax. Not willing to give up her only child, Lema took Cinzia and the rest of her family into hiding. Eventually the Sith caught up to the family and took Cinzia. The penalty for resisting a Sith's 'request' for a Force-sensitive child was death, so in 3658 BBY Lema gathered up the rest of the family and fled to Sebaddon, a metal-rich world orbiting a black hole.\nDuring her self-imposed exile, Lema began to create the fastbreeders, which she nicknamed \"Hexes\". In order to make the droids unique and highly adaptive, she put her very essence into them in the form of red liquid. After cloning her long lost daughter, Lema was determined to keep her safe and programmed the hexes to protect the clone of Cinzia at all costs. As the years go by, Lema and the colony grew fearful of the hexes and tried to shut them down. The hexes killed her because in their logic, shutting them down would put Cinzia in danger. The hexes killed the rest of the colony when they tried to stop them from killing Lema. Lema still existed in the red liquid that filled the hexes bodies and a Force-dampening tank in which she kept the clone of Cinzia in all her life.\nDuring the attack on Sebaddon, Grand Master Satele Shan and Eldon Ax confronted the clone of Cinzia/Eldon Ax. Lema could still talk to her through the liquid and when the clone disobeyed her by talking to the two of them, Lema began to smother her. In a desperate attempt to save the drowning clone, Satele Shan broke the glass of her tank. Once exposed to air for the first time, the clone fell into shock and died. Out of grief of losing Cinzia twice, Lema commanded all the hexes to dig into the core of the world where they would be swallowed by the lava, destroying the last piece of herself.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/3643_BBY",
  "/wiki/Sebaddon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Droid/Legends",
  "/wiki/Eldon_Ax",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Cinzia_Xandret",
  "/wiki/Sith/Legends",
  "/wiki/Death/Legends",
  "/wiki/3658_BBY",
  "/wiki/Planet/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Black_hole/Legends",
  "/wiki/Fastbreeder",
  "/wiki/Cloning/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Lema_Xandret",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}