{
 "name": "Lemda_Avesta",
 "display_name": "Lemda Avesta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Makeb"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3662 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Avesta family"
     ]
    }
   ]
  }
 ],
 "content": "Lemda Avesta was a Human female geophysicist and niece of Shalim Avesta living on Makeb during the Galactic War.\nLemba Avesta earned her doctorate in geophysics at age 16.\nDuring the Conquest of Makeb in 3638 BBY, when the Hutt Cartel instigated a hostile takeover of the planet, she convinced her uncle to forgo their planet's independence and go to the Galactic Republic for aid. She then went to investigate the increasing number of groundquakes on Makeb's surface, and eventually discovered that they were caused by the Hutts' deep-core drilling of isotope-5. While on the Frinn Mesa, Lemda was captured by the InterStellar Regulators, Makeb's former protectors bought off by the Hutts.\nShe was moved to the Quake Shelter 14-K where she was guarded by Captain Kazac. Lemda was eventually rescued by a Republic strike team led by Prosk. After leaving the groundquake shelter, Lemda revealed that the seismic readings proved the Hutts had sealed Makeb's fate. The groundquakes would increase in severity and cause entire mesas to collapse, and eventually gravitational decay would destroy Makeb's atmosphere, killing all life on the surface. However, she did overhear the Regulator talking about a \"Project Failsafe\", which she presumed was a method to save the planet.\nThe strike team invaded the Hutt embassy in Talaos City and discovered that Project Failsafe was actually a giant ark being constructed so the Hutts could flee Makeb just before its destruction. Shalim knew that if they could capture the ark that it could be retrofitted to evacuate all of Makeb's inhabitants. Lemda was able to determine the ark's location, based on its size, to be inside the Giant's Spear. The ark was secured, but required Isotope-5 to function, all stores of which were held by Toborro. Lemda discovered that Doctor Juvard Illip Oggurobb was involved in processing Isotope-5 for Toborro and assisted the Republic in recruiting them to their cause. Oggurobb had no desire to remain on the doomed planet and willingly provided information that helped retrieve Isotope-5 fuel rods from Toborro's Palace while citizens from all over the planet were being gathered and loaded onto the ark. Lemda, her uncle, and Oggurobb, all safely departed the planet on the ark, after which the citizens of Makeb formally joined the Galactic Republic.\nLemda Avesta first appeared in Star Wars: The Old Republic: Rise of the Hutt Cartel, an expansion released for Star Wars: The Old Republic released in 2013. Lemda appears in several conversations during the course of the Republic Makeb storyline, and she is portrayed as bisexual through romance options for both male and female player characters. Because this article assumes 100% game completion, Lemda, if romanced, will give her holofrequency to the player after all business on Makeb is concluded, though she does not appear in any other storylines thereafter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Lemda_Avesta",
  "/wiki/Makeb",
  "/wiki/3662_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Avesta_family",
  "/wiki/Shalim_Avesta",
  "/wiki/Galactic_War",
  "/wiki/Conquest_of_Makeb",
  "/wiki/3638_BBY",
  "/wiki/Hutt_Cartel",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Isotope-5",
  "/wiki/Frinn_Mesa",
  "/wiki/InterStellar_Regulators",
  "/wiki/Quake_Shelter_14-K",
  "/wiki/Captain/Legends",
  "/wiki/Kazac",
  "/wiki/Prosk",
  "/wiki/Talaos_City",
  "/wiki/Giant%27s_Spear",
  "/wiki/Toborro",
  "/wiki/Juvard_Illip_Oggurobb",
  "/wiki/Toborro%27s_Palace",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2013",
  "/wiki/March_10",
  "/wiki/2016",
  "/wiki/September_24",
  "/wiki/2020"
 ]
}