{
 "name": "Lemo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arcan IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Ginger"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lemo and Sanda's gang"
     ]
    }
   ]
  }
 ],
 "content": "Lemo was a Human male who sported a thick beard and long, ginger hair that he tied back with a white headband.\nLemo, along with his partner Sanda, was the leader of a group of thugs on Arcan IV. They had apparently had some run-ins with Han Solo and were all glad that he had finally been captured. It was while celebrating this fact that Lando Calrissian—disguised as Barpotomous Drebble—and Chewbacca approached Lemo and his crew with a proposal.\nLemo was suspicious but played the dutiful host, plying Calrissian with Deltron spice wine until his guest drunkenly revealed his allegiance to Solo. Following a high-velocity airspeeder chase, Lemo's gang had the two rebels cornered when it was revealed that Calrissian was in possession of a precious statue that the gang had long sought. Dafi, a member of Lemo's gang, became crazed at the discovery and slaughtered Lemo's companions in order to keep the statue for herself, although Lemo and Sanda luckily escaped with their lives. They retrieved the statue and kept it in their hideout on Arcan IV.\nShortly after their encounter with Calrissian, Lemo and Sanda were captured by a bounty hunter in the Keyorin system and incarcerated in a prison asteroid in the same sector. After the Battle of Endor, Solo and Luke Skywalker traveled to the asteroid and questioned the prisoners about the Dancing Goddess statue. In exchange for the statue's location, the Rebels offered to pull the strings needed to get Lemo and his companion released, along with twenty thousand credits. The Rebels recovered the statue and presumably followed through with the deal.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arcan_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lemo_and_Sanda%27s_gang",
  "/wiki/Hair/Legends",
  "/wiki/Sanda",
  "/wiki/Han_Solo/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Barpotomous_Drebble/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Deltron_spice_wine",
  "/wiki/Airspeeder/Legends",
  "/wiki/Dafi_(criminal)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Keyorin_system",
  "/wiki/Belderone_sector_prison_asteroid",
  "/wiki/Belderone_sector/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars_(1977)_79",
  "/wiki/Star_Wars_(1977)_85",
  "/wiki/Star_Wars_(1977)_99",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}