{
 "name": "Lene_Kostana",
 "display_name": "Lene Kostana",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Altiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Sifo-Dyas"
     ]
    }
   ]
  }
 ],
 "content": "Lene Kostana was an Altiri female Jedi Master who served the Jedi Order prior to the Invasion of Naboo. Her mission for the Order involved finding and studying ancient Sith relics, in preparation for their eventual return. As she was rising through the ranks of the Jedi Order, the young Dooku found himself drawn to a strange fascination with Kostana and her mission.\nLene Kostana was an Altiri female who eventually rose to the rank of Jedi Master. At some stage during her life, she became fascinated with locating and analyzing Sith artifacts in order to prepare for the inevitable return of the Sith Order. Her fascination with finding and analyzing Sith artifacts stemmed from her belief that the Sith would return, and her views brought her into conflict with Grand Master Yoda and the rest of the Jedi High Council, who disagreed with her beliefs. Yoda, in particular, believed that finding relics was unnecessary and also disagreed with Kostana that younglings and Padawan apprentices needed to be prepared for a potential Sith return. At first, the young Jedi Dooku believed her to be Sith-oriented due to her fascination with their relics.\nKostana later took Sifo-Dyas as her Padawan learner , and the two once embarked on a mission to infiltrate a smuggler ring on Karazak. Kostana and her apprentice hoped to follow their supply runs in an effort to track down the location of any Sith relics on the black market. However, the pair were led into an ambush on Asusto, which the last remaining coven of the Presagers of Hakotei set up.\nLene Kostana also acted as a mentor to the young Dooku, and once used the fictional Darth Sakia as a lesson to test the young Jedi; later, she informed Dooku that Darth Sakia had used a curved-hilt lightsaber.\nShortly after Kostana taught Sifo-Dyas to open his mind to the Cosmic Force, the young Jedi began to suffer from Force visions. One of these visions, which involved a planet being engulfed in flames, turned out to be a warning about the coming Protobranch solar storm before the event had even occurred. Kostana encouraged Sifo-Dyas and Dooku to take the former's visions seriously, but also did what she could to hide her apprentice's talents from the Jedi Council, fearful that they would interpret his talent for foresight as being dangerous. Her fears increased even after Sifo-Dyas was knighted, when she learned the Jedi had opened a new correctional unit in the Citadel prison for Jedi with foresight.\nDuring his time as a Padawan, around 82 BBY, Kostana, Dooku, and Sifo-Dyas attended the funeral of Dooku's mother, Anya, on Serenno despite the Jedi High Council objecting to their attendance. Afterwards, the three Jedi went to Hakotei to locate a relic, meeting a dark-side sect, resulting in Dooku's brief capture so that he could be used for a ritual. Dooku experienced several visions of his future and unwittingly used Force lightning to free himself as well as his Jedi companions, leaving Kostana to console Dooku who was terrified of the visions he received.\nSome years after Dooku's second apprentice Qui-Gon Jinn was knighted, Kostana and Sifo-Dyas agreed to help Dooku free Serenno from Abyssin raiders. The mission was against the Jedi High Council's wishes, as they had chosen to comply with the Galactic Senate's decision not to aid Serenno due to them failing to pay the seasonal taxes. Ultimately, the three Jedi succeeded in driving the raiders away and Dooku managed to defeat his brother Ramil. However, in the aftermath, Dooku chose to reject Kostana's suggestion that they seek assistance from the Republic, instead choosing to help the Serennians rebuild as their new leader. Kostana was dismayed by Dooku's decision, but accepted it.\nLene Kostana appeared in the 2019 audio original novel Dooku: Jedi Lost, written by Cavan Scott, where she was voiced by Carol Monda. Scott based Kostana on Thame Cerulian, Dooku's second Jedi Master in the Star Wars Legends continuity. Intrigued by the idea of a Padawan having two Jedi mentors but not wanting necessarily recanonize Cerulian, Scott created Kostana to explore Dooku's backstory differently than in his Legends version and reasonated that Dooku should need another mentor due to Yoda's usual unavailability, one that could lead him down into taking a dark path.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Altiri",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Sifo-Dyas",
  "/wiki/Jedi_Master",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Sith",
  "/wiki/Sith_artifact",
  "/wiki/Dooku",
  "/wiki/Sith_Order",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Jedi_High_Council",
  "/wiki/Youngling",
  "/wiki/Padawan",
  "/wiki/Jedi",
  "/wiki/Smuggler",
  "/wiki/Karazak",
  "/wiki/Black_market",
  "/wiki/Mission_to_Asusto",
  "/wiki/Asusto",
  "/wiki/Presagers_of_Hakotei",
  "/wiki/Darth_Sakia",
  "/wiki/Curved-hilt_lightsaber",
  "/wiki/Cosmic_Force",
  "/wiki/Force_vision",
  "/wiki/Planet",
  "/wiki/Protobranch_solar_storm",
  "/wiki/Citadel",
  "/wiki/82_BBY",
  "/wiki/Anya_(Serenno)",
  "/wiki/Serenno",
  "/wiki/Hakotei",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Force_lightning",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Abyssin",
  "/wiki/Galactic_Senate",
  "/wiki/Ramil",
  "/wiki/Serennian",
  "/wiki/2019",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Cavan_Scott",
  "/wiki/Carol_Monda",
  "/wiki/Thame_Cerulian",
  "/wiki/Dooku/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Star_Wars_Legends",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Adventures_in_the_Audiosphere",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/June_27",
  "/wiki/August_21",
  "/wiki/2020"
 ]
}