{
 "name": "Lenn Teraan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House TeraanHouse of Organa",
      "House of Organa",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Lenn Teraan, known formally as Lord Lenn Teraan, Warden of the Eternal Flame, was a male Human noble who was a member of the House Teraan and the brother of Cedonia Teraan.\nDuring the time of the Great Galactic War between the Galactic Republic and the Sith Empire, Lenn and Cedonia were part of the House Teraan until it was devastated during a fight with House Baliss leading to them relocating to safety with House Organa. Their ancestral estate was taken over by House Baliss during this time.\nIn 3643 BBY, Lenn and Cedonia Teraan tasked a smuggler to infiltrate their former estate in order to recover data from their homes library on how to unlock the antique Gonk droid that held the key to restoring their family. Once unlocked, the droid revealed that numerous other families owed House Teraan credits and both the siblings departed to meet with the Royal Council in order to verify the data, but not before providing the smuggler with the design for a powerful anti-radiation shield that their associate Risha had previously arranged.\nThe Teraans later called the Voidhound for aid once more when House Baliss discovered the smuggler's intrusion and had sent Xin Baliss to challenge Lenn to a duel to the death. House Organa refused to intervene because they perceived the Teraans' initial actions as threatening the ongoing peace talks. Thankfully for the Teraans, the smuggler agreed to fight Xin and managed to kill the supposedly unbeatable duelist who won all his duels with just one shot. Though impressed by the smuggler's skill, the Teraans then chose to depart Alderaan before House Baliss attempted more attacks on their lives.\nLenn Teraan is a non-player character exclusive to the Smuggler Alderaan storyline in Star Wars: The Old Republic.\nFemale Smugglers can romance Lenn Teraan throughout their interactions in the Alderaan storyline.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Teraan",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Cedonia_Teraan",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/House_Baliss",
  "/wiki/3643_BBY",
  "/wiki/Voidhound",
  "/wiki/Droid/Legends",
  "/wiki/Risha_Drayen",
  "/wiki/Smuggler/Legends",
  "/wiki/Xin_Baliss",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}