{
 "name": "Lennox",
 "display_name": "Lennox",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Endor system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Death Squadron",
      "Imperial Officer Corps",
      "Death Squadron",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Lennox was a human male who served as a captain in the Imperial Navy of the Galactic Empire. During the Galactic Civil War against the Alliance to Restore the Republic, he commanded the Imperial II-class Star Destroyer Tyrant as part of the Sith Lord Darth Vader's personal fleet, Death Squadron.\nIn 3 ABY, Death Squadron located the Alliance's secret base on the planet Hoth, and subsequently launched an assault on the rebels, with Star Destroyers such as the Tyrant blockading the world. As such, Lennox attempted to intercept the first of the rebel GR-75 medium transports to evacuate from Hoth; however, the Star Destroyer was disabled by multiple shots from the rebels' v-150 ion cannon, leaving the ship to careen away helplessly as the transport escaped. Lennox avoided summary execution after the Empire claimed victory in the battle, but perished during the Battle of Endor in 4 ABY.\nLennox was a human male who served in the Galactic Empire's Imperial Navy and Imperial Officer Corps during the Galactic Civil War against the Alliance to Restore the Republic. In 3 ABY, he was the captain of the Imperial II-class Star Destroyer Tyrant, which was part of the Sith Lord Darth Vader's personal fleet, Death Squadron. As part of the Imperial operation known as Project Swarm, the fleet was tasked with locating the new secret headquarters of the Alliance. After a Viper probe droid that had been launched as part of the project discovered signs of life on the planet Hoth, Vader had the fleet travel to the Hoth system.\nAdmiral Kendal Ozzel, commander of Death Squadron, had the fleet drop out of hyperspace close to the Hoth system in order to gain the element of surprise. Instead, this alerted the rebels to the Imperial presence and gave them a chance to raise a shield over Echo Base, their secret headquarters. With the shield preventing Lennox and the other Death Squadron captains from carrying out an orbital bombardment, the Imperial Blizzard Force was deployed to the planet for a ground assault. Meanwhile, the Tyrant and the rest of Death Squadron blockaded the planet.\nAs the assault commenced, the rebels began their evacuation by launching the GR-75 medium transport Quantum Storm, defended by two T-65B X-wing starfighters. After the Tyrant was moved to block the path of the transports, Lieutenant Cabbel, a controller on the Tyrant's bridge, approached Lennox as the captain regarded Hoth through a viewport, and informed him that the three rebel vessels were approaching their sector, which pleased the captain.\nThe Tyrant's shields were then lowered so that the three enemy vessels could be pulled on board with a tractor beam; however, just as the Star Destroyer's tractor beam locked onto the transport, the Alliance hit the Tyrant with two blasts from a v-150 Planet Defender ion cannon located at Echo Base. With its shields down, the shots disabled Lennox's vessel, taking out its missile launchers and conning tower and causing it to veer, then career into deep space helplessly as Quantum Storm and its escort slipped past and escaped the system. The Empire ultimately claimed victory in the Battle of Hoth, but many rebels escaped through the blockade. Lennox evaded summary execution after the battle and survived to be part of the Imperial forces that fought in the Battle of Endor in 4 ABY, where the Alliance Fleet attacked the Death Star II in the Endor system above the moon Endor. Lennox was killed during the battle, and the Death Star was destroyed.\nLennox had fair skin, brown hair, and dark eyes. He was pleased to learn that his ship would be the first to capture rebels during the Battle of Hoth.\nLennox wore the standard uniform of an Imperial naval command officer, including an Imperial kepi and one code cylinder. He wore a rank insignia plaque on his left breast with three red bars above three blue.\nLennox was played by John Dicks in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. He was credited only as one of several \"other officers\" in the Imperial section of the film's credits and was first identified in the new Star Wars canon on a card in the 2015 2015 Topps Star Wars Force Attax The Force Awakens set of trading cards released by The Topps Company, Inc.\nIn the Star Wars Legends continuity, the character was first identified on a card in the 1998 Hoth Limited set of trading cards for the Star Wars Customizable Card Game. The Legends article \"The Empire's Finest: Who's Who in the Imperial Military,\" which was written by Abel G. Peña and Daniel Wallace for publication in Star Wars Insider 96 in October 2007, gave Lennox's first name as \"Xamuel.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Lennox",
  "/wiki/Xamuel_Lennox",
  "/wiki/Lennox_(disambiguation)",
  "/wiki/4_ABY",
  "/wiki/Endor_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Death_Squadron",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/File:Cabbel-Lennox.ogg",
  "/wiki/Captain",
  "/wiki/Imperial_Navy",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Commanding_officer",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Tyrant",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Fleet",
  "/wiki/3_ABY",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth",
  "/wiki/Star_Destroyer",
  "/wiki/Blockade",
  "/wiki/Quantum_Storm",
  "/wiki/GR-75_medium_transport",
  "/wiki/V-150_Planet_Defender",
  "/wiki/Ion_cannon",
  "/wiki/Starship",
  "/wiki/Transport",
  "/wiki/Death",
  "/wiki/Battle_of_Endor",
  "/wiki/Project_Swarm",
  "/wiki/XJ9-CS14",
  "/wiki/Hoth_system",
  "/wiki/Admiral",
  "/wiki/Kendal_Ozzel",
  "/wiki/Hyperspace",
  "/wiki/Star_system",
  "/wiki/Deflector_shield",
  "/wiki/Orbital_bombardment",
  "/wiki/Blizzard_Force",
  "/wiki/Surface_warfare",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Lieutenant",
  "/wiki/Cabbel",
  "/wiki/Controller",
  "/wiki/Bridge_(starship)",
  "/wiki/Viewport",
  "/wiki/Tractor_beam",
  "/wiki/Missile_launcher",
  "/wiki/Conning_tower",
  "/wiki/Realspace",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Moon",
  "/wiki/Endor",
  "/wiki/Death_Star",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_kepi",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Breast",
  "/wiki/John_Dicks",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars",
  "/wiki/2015",
  "/wiki/2015_Topps_Star_Wars_Force_Attax_The_Force_Awakens",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars_Legends",
  "/wiki/1998",
  "/wiki/Hoth_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/The_Empire%27s_Finest:_Who%27s_Who_in_the_Imperial_Military",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Daniel_Wallace",
  "/wiki/Star_Wars_Insider_96",
  "/wiki/October",
  "/wiki/2007",
  "/wiki/Category:Images_of_Xamuel_Lennox",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_4",
  "/wiki/Pilots_and_Crew",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Doctor_Aphra_(2016)_37",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/April_19",
  "/wiki/2020",
  "/wiki/Star_Wars_Insider"
 ]
}