{
 "name": "Lens_Reekeene",
 "display_name": "Lens Reekeene",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "54 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.5 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Reekeene's Roughnecks"
     ]
    }
   ]
  }
 ],
 "content": "Lens Reekeene, originally known as Lens before her marriage, was a Human female born in 54 BBY. She worked as a mercenary commander for a private corporation until the Galactic Empire imprisoned her on false charges in 14 BBY. While in prison, she married a fellow convict, the engineer Mikka Reekeene, who was later released. Mikka bought her release in 3 BBY, and the Reekeenes became members of the Rebel Alliance. Lens later rose to the rank of general and founded Reekeene's Roughnecks, a group of Rebel soldiers operating in the Fakir sector, and a part of a series of similar small military units in the Alliance called The Irregulars. General Reekeene was advised by both her husband and a friend of the family, Santhou Lazith'chika.\nUnder General Reekeene, the Roughnecks performed guerrilla raids against the Empire, while doing their best to attract new members to the Alliance. Circa 0 ABY, Reekeene also led the Roughnecks in \"Operation Retribution,\" a mission in which her unit ran little risk while damaging several Imperial assets. After the operation, she was captured and taken to an Imperial garrison base on the planet Flankers. The Roughnecks then set out to rescue her.\nLens, a female Human born in 54 BBY, served as the commander of a mercenary company performing garrison duties for Sartran Corporation, a private company. In 14 BBY, Sartran was disbanded by the Galactic Empire for treasonous activities, and the mercenaries employed by the company, as well as Lens, were imprisoned under false charges of conspiracy. While in prison, Lens met Mikka Reekeene, a former employer and engineer for Sartran also jailed on false charges, and they married in prison. She subsequently adopted his surname of Reekeene.\nThe prison staff made a management mistake, and as a consequence, Mikka Reekeene was released. He later earned enough credits to buy Lens's freedom in 3 BBY. Once free, Lens discovered that most of the mercenaries from her unit had died in prison. Desiring revenge against the Empire, Lens joined the Alliance to Restore the Republic. Her husband was not as interested in politics as she was, but he joined the Alliance too, in order to be with Lens.\nSoon, she became an officer of the Alliance, reaching the military rank of general, with her husband by her side as her advisor. At some point, Santhou Lazith'chika, a secretive alien, contacted the Reekeenes, gained their confidence, and became Mikka's main advisor, Lens's second advisor, and a personal friend to both Reekeenes.\nThe Reekeenes and Lazith'chika founded Reekeene's Roughnecks, a guerrilla organization of Rebel soldiers, to harass Imperial forces in the Fakir sector. As a part of a group of similar small military units known as The Irregulars of the Alliance, the Roughnecks tried to attract Imperial attention in order to divert the Empire's resources from other missions, such as the search for the Alliance main fleet. General Reekeene's constant attacks on government offices overwhelmed the local Moff, who asked the Empire to send him a fleet as a reinforcement. In addition to these guerrilla operations, the Roughnecks tried to recruit new members for the Alliance.\nIn 0 ABY, Lazith'chika and General Reekeene briefed the Roughnecks' Green squad on a diplomatic mission to Abonshee, a planet also known as Masterhome. Reekeene and Lazith'chika used holograms to confer with the squad. Reekeene informed the unit of their goals and motivation: Alliance High Command had ordered the Roughnecks to obtain new sources of food and, following that premise, Green squad was to negotiate with the Godking, the leader of the native Anointed People, on behalf of the Alliance. The squad was shuttled to Abonshee on board the Long Shot, a Lantillian GX1 Short Hauler that had been previously assigned to the Roughnecks; Reekeene commonly used the Long Shot for this kind of duty. Green squad later succeeded in their mission.\nAlso around this time, the Reekeenes joined Lazith'chika and Rebel Lieutenant Am Serro aboard their mobile headquarters, the Tsukkian water freighter Home. Special operative Tay \"Tiree\" Vanis, an agent of Alliance Intelligence, met with them in person. Vanis reported on the results his twentieth operation—he had failed to recruit new operatives and had also reached the limit of missions before mandatory retirement. Nevertheless, Vanis had vouched for several potential new recruits, and General Reekeene sent him to conscript them.\nReekeene planned \"Operation Retribution,\" a two-day offensive that spread the Roughnecks' resources thin by simultaneously raiding several Imperial targets. General Reekeene instructed her men to cause maximum damage at minimum risk in the given time, and then retreat. Her intelligence agents had reported on Repair Station M13, a newly built Imperial repair and refueling outpost on the planet Mycroft, protected by several TIE fighters. As a part of Retribution, Reekeene ordered some of the Roughnecks to attack a station in a nearby star system, attracting the starfighters stationed on M13, while another team sabotaged the undefended station.\nOnce Retribution was over, Reekeene sent an undercover Roughneck team to plant a listening device under a communication center on Iyuta. The building's plans had been intentionally leaked by Imperial agents, who intended to track a Rebel team to the Roughneck headquarters. General Reekeene instructed her men to contact Chilla, a local Rebel spy, once they reached Iyuta. Unbeknownst to Reekeene, the Empire had killed Chilla and replaced him with an impersonator, who was waiting for the Rebels. However, the undercover Rebels discovered the impersonator's sham and foiled the Imperial plot to discover the Roughnecks' base.\nSoon after, Reekeene piloted an X-wing starfighter with her R2 unit to a meeting with the Alliance commanding officers of the Fakir sector. Her ship was found by an Imperial scout vessel, which ambushed and attacked her. Reekeene's droid was destroyed during the fight and the X-wing was damaged. The Imperial Captain waited for Reekeene to surrender, but Reekeene instead shot at least three proton torpedoes at point-blank range, destroying the Imperial ship's fuel pod. The X-wing was wrecked in the explosion, and Reekeene was captured.\nThe scout took Reekeene to the nearest Imperial base, a garrison on the planet Flankers. The base had previously been abandoned because the system's star was going to go nova in a few days, but the Imperial captain was unaware of this. Once there, the Imperial contacted his allies and asked for a pick-up ship for him and his prisoner. Thanks to an intercepted message from an Imperial probe droid, the Long Shot discovered Reekeene's plight and hurried to rescue her. When they reached Flankers, they were identified as Rebels and were opposed by Imperial forces.\nA woman with piercing eyes and an imposing presence, General Reekeene commonly showed a cold demeanor, although she never did so to her husband, Mikka. Having been a mercenary, Lens Reekeene kept her aggressive and militaristic tendencies even after joining the Rebel Alliance. Her philosophy on warfare included providing her subordinates only with the information they needed, always harassing the enemy, and not keeping her assets in the same place for too long.\nReekeene commonly wore a blaster on her left hip and a vibroblade in her right boot, and she was adept in the use of both of these weapons. Most members of the Roughnecks wore colored armpatches identifying their squad, but General Reekeene, being a commanding officer, wore a white patch. Only she and the other two highest-ranking members of the Roughnecks briefed the squads and answered their questions. As a security measure, once a squad had been briefed for a mission, its members could only speak to the Reekeenes or Lazith'chika.\nThrough her life, General Reekeene proved her skill as a military commander, first as a mercenary officer and later as a Rebel General and leader of the Roughnecks. She knew how to plan and execute complex offensives, as showed during Operation Retribution. She was also a pilot, skilled in the art of starfighter combat, and she knew how to survive in hostile environments.\nLens Reekeene first appeared in \"The Long Shot Campaign,\" a chapter of the role-playing book Star Wars Campaign Pack, written by Paul Murphy and published by West End Games in 1988. \"The Long Shot Campaign\" was re-published in 1994 in Classic Campaigns, along with The Bissillirus Campaign. Lens was first graphically depicted in the web comic Rookies: Rendezvous  by Pablo Hidalgo, who based her on a personal acquaintance whose identity has not been revealed.\nLens Reekeene's eyes were described as blue in \"The Long Shot Campaign,\" but they appear to be darker in Rookies: Rendezvous.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Reekeene",
  "/wiki/54_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Reekeene%27s_Roughnecks",
  "/wiki/Marriage/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Sartran_Corporation/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/14_BBY/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Mikka_Reekeene",
  "/wiki/3_BBY/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/General/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Fakir_sector/Legends",
  "/wiki/The_Irregulars",
  "/wiki/Advisor/Legends",
  "/wiki/Santhou_Lazith%27chika",
  "/wiki/Recruitment_Agent",
  "/wiki/0_ABY/Legends",
  "/wiki/Operation_Retribution",
  "/wiki/Imperial_garrison_(Flankers)",
  "/wiki/Planet/Legends",
  "/wiki/Flankers",
  "/wiki/Company/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Death/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Unidentified_Moff_(Reekeene%27s_Roughnecks)",
  "/wiki/Fleet/Legends",
  "/wiki/Green_squad",
  "/wiki/Diplomat/Legends",
  "/wiki/Mission_to_Abonshee",
  "/wiki/Abonshee",
  "/wiki/Hologram/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Godking",
  "/wiki/Anointed_People",
  "/wiki/Long_Shot",
  "/wiki/Lantillian_ShipWrights/Legends",
  "/wiki/GX1_Short_Hauler",
  "/wiki/Time/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Am_Serro",
  "/wiki/Tsukkian_water_freighter",
  "/wiki/Home",
  "/wiki/Tay_Vanis",
  "/wiki/Alliance_Intelligence",
  "/wiki/Operation",
  "/wiki/Operative",
  "/wiki/23er",
  "/wiki/Repair_Station",
  "/wiki/M13",
  "/wiki/Fuel/Legends",
  "/wiki/Mycroft",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Star_system/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Listening_device/Legends",
  "/wiki/Imperial_Communications_Center_(Iyuta)",
  "/wiki/Iyuta",
  "/wiki/Chilla",
  "/wiki/Spy/Legends",
  "/wiki/Chilla_(impersonator)",
  "/wiki/Pilot/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Alliance_commanding_officer_meeting",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Scout_vessel",
  "/wiki/Droid/Legends",
  "/wiki/Unidentified_Imperial_scout_vessel_captain",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Pod",
  "/wiki/Scout/Legends",
  "/wiki/Star/Legends",
  "/wiki/Nova/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/The_Long_Shot_Campaign",
  "/wiki/Roleplaying_game",
  "/wiki/Star_Wars_Campaign_Pack",
  "/wiki/Paul_Murphy",
  "/wiki/West_End_Games",
  "/wiki/1988",
  "/wiki/1994",
  "/wiki/Classic_Campaigns",
  "/wiki/The_Bissillirus_Campaign",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Rookies:_Rendezvous",
  "/wiki/2006",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tests_of_the_Godking",
  "/wiki/Assault_on_Repair_Station_M13",
  "/wiki/The_Plant",
  "/wiki/Lens_Reekeene_Is_Missing",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com"
 ]
}