{
 "name": "Lensi",
 "display_name": "Lensi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Duro"
     ]
    },
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Corellian system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Combined Defense Forces of the New Republic",
      "Combined Defense Forces of the New Republic",
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Defense Force",
      "Galactic Alliance Defense Force",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A male Duros starfighter pilot, Lensi fought in both the Yuuzhan Vong War and the Second Galactic Civil War. Young when the galaxy was invaded by a race of extra-galactic aliens known as the Yuuzhan Vong, Lensi suffered the loss of his homeworld of Duro to the warfaring species. By 26.5 ABY, the Duros had secured a place in Rogue Squadron—one of the New Republic Starfighter Corps' most legendary starfighter units. Lensi flew as Rogue Twelve during an attack on what was thought to have been a Yuuzhan Vong superweapon undergoing construction in the Julevian system. Although Lensi later learned that he and his squadron had helped to destroy a Yuuzhan Vong worldship rather than a superweapon, due to deliberate misinformation from rogue Jedi Master Kyp Durron, the young Duros continued to serve with Rogue Squadron.\nLensi performed well in the squadron over the next few years of the war, although a second mission, during which the young pilot felt that he had been deceived, caused the Duros to doubt his role in the military. Ostensibly given the chance to help liberate his homeworld during an assault on the Duro system, Lensi was disgusted to learn—following the deaths of hundreds of his fellow Duros—that the attack was a feint. Furious that Duro had never been the intended target and feeling betrayed by his commanding officer, General Wedge Antilles, Lensi resigned his commission. He rejoined the elite starfighter unit over a decade later in the opening stages of the Second Galactic Civil War, during which a number of high-profile planets and systems seceded from the Galactic Federation of Free Alliances. Lensi rose to the position of Rogue Leader and led his squadron into battle during the Galactic Alliance's attempt to capture Centerpoint Station, one of the opposition's military assets. In the resulting engagement, Lensi's unit engaged Rakehell Squadron, only for the Duros to be shot down and killed by Rakehell Leader—who was none other than Wedge Antilles.\nA male Duros, Lensi was still young when the galaxy was stricken by total war. In 25 ABY, an extra-galactic alien race known as the Yuuzhan Vong invaded the galaxy, destroying whole worlds and bringing entire species to extinction. One year into the invasion, the Yuuzhan Vong fleets had reached Lensi's homeworld of Duro and captured the planet in a pitched battle. By 26.5 ABY, Lensi had secured a place as a starfighter pilot in one of the New Republic Defense Force's most celebrated units, Rogue Squadron. Flying under the call sign of Rogue Twelve in Three Flight, one of the squadron's three quartets, the Duros wished to exact vengeance on the Yuuzhan Vong and help to reclaim his lost homeworld.\nAlthough any attempt to recapture Duro was still several years away, Rogue Squadron was not wholly limited to defensive missions. In 26.5 ABY, the Bothan Admiral Traest Kre'fey coordinated an assault on the Julevian system, where a Yuuzhan Vong gravitic superweapon was reportedly under construction. The information had been brought to Kre'fey via Lensi's superior officer, Gavin Darklighter, who was in turn trusting the reconnaissance work of Jedi Master Kyp Durron. At that time, a shaky armistice with the Yuuzhan Vong was in effect, and Kre'fey's mission was therefore unsanctioned by the New Republic government. Nevertheless, Lensi and his fellow pilots were informed that they would enter the Julevian system and pave the way for Kre'fey's capital ships before taking the fight to the Yuuzhan Vong superweapon. The Duros pilot's wingmate, Rogue Eleven, was the Jedi Jaina Solo, whom Lensi met during the final mission briefing.\nRogue Squadron emerged out of hyperspace in an asteroid field made up of the ruins of the planet Sernpidal, which had been destroyed by the Yuuzhan Vong at the beginning of the war. Yorik-et starfighters, patrolling the asteroid field, engaged Lensi and his fellow pilots. While Rogue Leader Gavin Darklighter took One Flight to assault a Yuuzhan Vong warship, the rest of the squadron continued to dogfight with the yorik-et starfighters. Led into battle against eight of the Yuuzhan Vong starships by Three Flight leader Major Alinn Varth, Lensi was reprimanded for his cocky approach to battle before the engagement began. Lensi was able to protect his wingmate, Solo, during the subsequent combat, but was ordered to keep in close to the rest of his flight, rather than pursue damaged enemy craft, as more of the Yuuzhan Vong starfighters arrived.\nDarklighter and his flight managed to destroy the Yuuzhan Vong cruiser, enabling Rogue Squadron—which had lost two pilots by this time—to focus entirely on the enemy starfighters. Once the remaining yorik-et had been destroyed, Lensi and the surviving pilots in the squadron reformed. Admiral Kre'fey's task force arrived soon after, and Rogue Squadron trailed the Bothan Assault Cruiser Ralroost as it approached the Yuuzhan Vong superweapon housed in the cracked fragments of Sernpidal. The battle recommenced, but with mounting losses for Rogue Squadron as Kre'fey's forces punched through the well-defended Yuuzhan Vong perimeter. Rogue Ten, a Twi'lek pilot, was killed on approach, and Major Varth was soon forced to retreat. Lensi grew increasingly apprehensive, although the arrival of General Wedge Antilles in a starfighter cheered the squadron somewhat.\nFollowing Antilles, Solo, and Rogue Seven into combat, Lensi scored several kills against the Yuuzhan Vong starfighters, which began to fight in a noticeably more desperate fashion. Nevertheless, Kre'fey's task force continued to bear down on the gravitic superweapon. To the pilots' shock, the yorik-et suddenly employed ramming tactics against the New Republic forces, eliminating Rogue Seven and dealing heavy damage to the Ralroost and its escorts. The New Republic starfighters fanned out to counter the tactic and staved off the yorik-et while Kre'fey's warships opened fire on the Yuuzhan Vong superweapon. In short order, the gravitic superweapon detonated. Triumphant, Lensi and the rest of the task force retreated from the Julevian system.\nLensi and his surviving squadron mates returned jubilantly to the Ralroost, where they celebrated in the hangar bay. When Jaina Solo emerged from her starfighter and slapped Kyp Durron across the face, however, the surprised Duros pilot watched as a confrontation unfolded. Solo forced Durron to reveal that the \"gravitic superweapon\" had been nothing of the sort and that Lensi and his comrades had just fought to destroy a half-completed worldship, which would have been used to house civilian Yuuzhan Vong. Lensi was shocked to learn the truth, though Durron remained adamant that he had deceived the other pilots because potential squeamishness at destroying a civilian target would have obstructed the pragmatic objective. The Jedi Master appealed rhetorically to the sense of loss many in the hangar possessed and was cheered and lauded in return, although Lensi found the experience of fighting under false pretenses both disconcerting and unpleasant.\nOver the next few years of the Yuuzhan Vong War, Lensi performed well in Rogue Squadron. The starfighter unit fought at major battles throughout the conflict, participating in the unsuccessful defense of the New Republic capital world of Coruscant; fighting a rearguard action at Borleias; and routing several Yuuzhan Vong fleets at Ebaq 9. When the military began to reclaim strategic star systems around the Core Worlds in preparation for a recapture attempt on Coruscant, Lensi and Rogue Squadron continued to serve on the frontlines. Late in 28 ABY, Lensi was pleased to learn that a strike would be launched on his homeworld of Duro, conquered almost three years previously. Many Duros joined General Wedge Antilles' task force in the hope of reclaiming the planet. Led by Commander Yurf Col, a flotilla of warships known as Duro Squadron accompanied Antilles' fleet into battle.\nUpon commencement of the operation, Antilles' fleet made slow progress in the Duro system as its warships advanced toward Lensi's lost homeworld. The young Duros pilot and the rest of Rogue Squadron fought alongside Twin Suns Squadron, another elite unit led by Jaina Solo. Within a few hours, the Galactic Alliance forces had penetrated the Yuuzhan Vong's outer defenses. By the time the Yuuzhan Vong warships defending the inner system had mostly been destroyed, however, almost a day had passed, and Commander Col and Duro Squadron had suffered heavy losses during the battle. When Yuuzhan Vong reinforcements started to arrive, Antilles brought his force to a halt, powered up his flagship's gravity well projectors and trapped the enemy arrivals in an interdiction field. Rogue Squadron remained steady with Antilles' forces. Commander Col soon broke formation and drove Duro Squadron into the Yuuzhan Vong battle line, hoping to force Antilles to abandon his containment pattern and press on to Duro. Antilles ordered his forces to remain in position. Over the next hours, Duro Squadron was wiped out to the last starship; three hours later, Antilles ordered a withdrawal.\nIt was only after the operation had concluded that Lensi and the rest of Antilles' force learned the truth. The attack on Duro had been a feint all along, with the intention of drawing Yuuzhan Vong warships away from Fondor, another strategic world. Antilles had held his position and interdicted the Yuuzhan Vong warships once they had arrived, allowing General Garm Bel Iblis and his fleet to retake Fondor with minimal casualties. Believing that Duro could have been taken regardless, Lensi was appalled that the lives of hundreds of his fellow Duros had been lost due to Antilles' operational secrecy and the military's strategic goals. The young pilot felt that both he and Duro Squadron had fought under false pretenses and, deciding that he no longer wished to serve in a military which could be kept in the dark by its leaders, set off disgustedly to resign his commission.\nLensi made his way to the tapcafe where Jaina Solo and her squadron mates were drinking and threw his flight insignia on the table in front of the Human woman. To the shock and anger of Solo's fellow pilots, Lensi accused the woman, along with General Antilles, of betraying the Duros and leading them into battle to die for a cause that had always been futile. Lensi's words led to uproar among Solo's pilots, but the Duros remained forthright as Solo argued that if anyone other than Antilles had known that the strike had been a feint, the Yuuzhan Vong could have intercepted the information and responded accordingly. Despite Solo's arguments, Lensi persisted in his belief that he and his fellow Duros had been used. He likened the events over Duro to what had occurred at Sernpidal almost three years previously, when Kyp Durron had deceived the New Republic forces in order to obtain a controversial victory. Solo was unconvinced and advised Lensi to keep fighting, criticizing the depth of his personal involvement. Although the Duros left with his insignia, Lensi ultimately elected to resign his commission due to the betrayal he felt that he had experienced serving under Antilles.\nThe Yuuzhan Vong were defeated several months later, and Coruscant was recaptured as the galactic capital. Lensi remained apart from Rogue Squadron while the galaxy spent a decade recovering from the trauma of the Yuuzhan Vong War. By 40 ABY, however, conflict was brewing once again as the Corellian system threatened to secede from the Galactic Federation of Free Alliances. Battle lines were soon drawn, and many expatriated Corellians returned to their homeworld, including General Wedge Antilles. Lensi rejoined Rogue Squadron in the early months of the year, after Antilles made his return to Corellia. The Duros eventually became the elite starfighter unit's leader.\nThe Second Galactic Civil War saw Rogue Squadron flying under the leadership of co-Chief of States Jacen Solo and Cha Niathal against the forces of the Confederation, a collection of planets and systems which had seceded from the Galactic Alliance in response to its policies. One of the Confederation's most valued resources was Centerpoint Station, an ancient space station which possessed the power to induce supernovas in stars. The destruction of the Galactic Alliance Second Fleet following the firing of Centerpoint Station encouraged co-Chief of State Jacen Solo to launch a military strike on the space station with the hope of capturing the superweapon. Lensi was assigned to the fleet Solo assembled and the Duros pilot led Rogue Squadron into battle.\nRogue Squadron was tasked with spearheading the assault on Centerpoint Station along with a unit of elite troopers in assault shuttles. Once Lensi and his unit were prepared, his unit communicated its readiness to Captain Kral Nevil aboard Chief of State Solo's flagship, the Anakin Solo. After Lensi's unit was given the all-clear, Rogue Squadron made the jump to the Corellian system. The squadron was confronted by a defense screen of Confederation warships, positioned to protect Centerpoint Station. The Galactic Alliance forces made rapid progress against the Confederation blockade, and soon, Alliance troops were boarding Centerpoint Station, with Lensi and his unit flying cover for the shuttles.\nWhen a hostile squadron of starfighters approached Centerpoint Station, Lensi led Rogue Squadron forward to attack, coming in low over the curve of the massive space station. Upon engaging the enemy starfighter squadron in combat, Lensi and his fellow pilots found themselves relatively evenly matched. Soon the opposing squadrons had managed to inflict both damage and kills on one another, and Lensi found himself flying against Rakehell Leader, who was in fact Wedge Antilles, the man whose actions had caused Lensi to resign his commission over a decade prior. Unable to best the Corellian pilot, Lensi was shot down and killed by Antilles.\nAs a young starfighter pilot at the time of the Battle of Sernpidal, Lensi was brash and overconfident. He was reprimanded for his cockiness and desire to hunt down damaged Yuuzhan Vong starfighters rather than remain with the rest of his flight. By the time Rogue Ten had been lost and Major Varth had been forced to fall back, Lensi had lost much of his initial bravado. Following the successful strike on the Sernpidal shipwomb, Lensi remained with Rogue Squadron and performed well in the unit during the war. A skilled pilot, he earned multiple kills during the strike on Sernpidal, participated in the Third Battle of Duro, and later rose to the rank of Rogue Leader in the early stages of the Second Galactic Civil War. The Duros veteran was ultimately shot down by Wedge Antilles, one of the foremost pilots of the age.\nOutside of the cockpit, Lensi exhibited naivety and exuberance in the earlier stages of his life. Triumphant following the destruction of the \"superweapon,\" the Duros pilot had to question Durron and Solo several times before he fully understood how and why the Jedi Master had deceived the New Republic forces. The experience of fighting under false pretenses stayed with Lensi, and was relived in 28 ABY following the Third Battle of Duro. Lensi's pride in his Duros comrades and desire to liberate his homeworld were evident in his post-battle fury. Feeling betrayed by the New Republic military, Lensi made a gesture of resigning and confronted several of his fellow pilots before turning his back on the service entirely. The pilot showed no fear when he was rounded upon by Solo's squadron mates, including Jagged Fel and the Wookiee Lowbacca, and held fast to his beliefs throughout his encounter with Solo, although he grew less confident as she continued to rebut his claims. Despite Solo's counterarguments and criticisms, Lensi remained unconvinced by the Human woman's response. Holding the opinion that he had been duped by Antilles, resentful of being kept in the dark, and upset by the loss of Duro Squadron in the name of strategic goals, Lensi resigned his commission.\nLensi was introduced in Gregory Keyes' The New Jedi Order: Edge of Victory II: Rebirth, published in 2001 as part of the The New Jedi Order novel series. Although the 2003 novel The New Jedi Order: The Final Prophecy implies Lensi did not resign his commission following the Third Battle of Duro, the 2008 reference title The Complete Star Wars Encyclopedia states he had in fact left the service.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Duro/Legends",
  "/wiki/40_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Corellian_system",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Defense_Force",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Duro_(Yuuzhan_Vong_War)",
  "/wiki/Homeworld/Legends",
  "/wiki/Species/Legends",
  "/wiki/26_ABY",
  "/wiki/New_Republic_Starfighter_Corps/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Rogue_Twelve",
  "/wiki/Second_Battle_of_Sernpidal",
  "/wiki/Superweapon/Legends",
  "/wiki/Julevian_system",
  "/wiki/Koros-Strohna",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Battle_of_the_Duro_system",
  "/wiki/Duro_system",
  "/wiki/Death/Legends",
  "/wiki/General/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Battle_of_Centerpoint_Station_(Second_Galactic_Civil_War)",
  "/wiki/Centerpoint_Station",
  "/wiki/Rakehell_Squadron",
  "/wiki/25_ABY/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Call_sign",
  "/wiki/Bothan/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Traest_Kre%27fey",
  "/wiki/Gravitic_superweapon",
  "/wiki/Gavin_Darklighter",
  "/wiki/Capital_ship/Legends",
  "/wiki/Wingmate/Legends",
  "/wiki/Rogue_Eleven/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Hyperspace/Legends",
  "/wiki/Asteroid_belt",
  "/wiki/Sernpidal/Legends",
  "/wiki/Destruction_of_Sernpidal",
  "/wiki/Yorik-et",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Wampa_(Yuuzhan_Vong_warship)",
  "/wiki/Major/Legends",
  "/wiki/Alinn_Varth",
  "/wiki/Flight_group/Legends",
  "/wiki/Task_force/Legends",
  "/wiki/Bothan_Assault_Cruiser",
  "/wiki/Ralroost",
  "/wiki/Space_warfare",
  "/wiki/Rogue_Ten/Legends",
  "/wiki/Rogue_Ten_(Second_Battle_of_Sernpidal)",
  "/wiki/Rogue_Seven/Legends",
  "/wiki/Rogue_Seven_(Second_Battle_of_Sernpidal)",
  "/wiki/Warship/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Raf_Othrem",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Borleias_(Yuuzhan_Vong_War;_Second)",
  "/wiki/Borleias/Legends",
  "/wiki/Battle_of_Ebaq",
  "/wiki/Ebaq_9",
  "/wiki/Core_Worlds/Legends",
  "/wiki/28_ABY/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Yurf_Col",
  "/wiki/Flotilla/Legends",
  "/wiki/Duro_Squadron",
  "/wiki/Twin_Suns_Squadron",
  "/wiki/Mon_Mothma_(Imperial-class)",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Interdiction_field/Legends",
  "/wiki/Fondor/Legends",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/Battle_at_Fondor",
  "/wiki/Tapcafe/Legends",
  "/wiki/Human/Legends",
  "/wiki/Battle_of_Yuuzhan%27tar",
  "/wiki/Corellian/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Darth_Caedus",
  "/wiki/Cha_Niathal",
  "/wiki/Confederation_Fleet",
  "/wiki/Confederation",
  "/wiki/Space_station/Legends",
  "/wiki/Supernova/Legends",
  "/wiki/Star/Legends",
  "/wiki/Battle_of_the_rendezvous_point",
  "/wiki/Galactic_Alliance_Second_Fleet",
  "/wiki/Trooper/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Kral_Nevil",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Blockade/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Shipwomb",
  "/wiki/Cockpit/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/Wookiee/Legends",
  "/wiki/Lowbacca",
  "/wiki/Greg_Keyes",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/2001",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/2003",
  "/wiki/The_New_Jedi_Order:_The_Final_Prophecy",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Anni_Capstan",
  "/wiki/Jhoram_Bey",
  "/wiki/137_ABY",
  "/wiki/Galaxy_Guide_4:_Alien_Races_(Second_Edition)",
  "/wiki/The_New_Jedi_Order:_Vector_Prime",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Legacy_of_the_Force:_Betrayal",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Legacy_(2006)_20",
  "/wiki/Legacy_(2006)_21",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/18_ABY/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Corran_Horn",
  "/wiki/29_ABY/Legends",
  "/wiki/36_ABY",
  "/wiki/Anj_Dahl"
 ]
}