{
 "name": "Lercer Gaia",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown and black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Lercer Gaia was a male Bothan spy who was living during the Galactic Civil War.\nA Bothan spy, Lercer Gaia resided on board Tansarii Point Station, in the Bright Jewel system, after the Battle of Yavin. Beyond Tansarii Point Station, Lercer was part of a larger spy network involving Kaesii DuPree and Sarlis Beni on Tatooine.\nIn 1 ABY, Lercer Gaia undertook the training of a spacer who wished to become a spy and had just arrived on Tansarii Point Station with Han Solo. During that time, Gaia was interested in finding information about the war raging between the Car'das controlling Tansarii Point Station and the Rak'qua living in neighboring Station Gamma. For a first mission, Lercer tasked his spy trainee to slice the high security files from the Systems Data Control terminal of Tansarii Point Station. The spacer succeeded and found information that a local arms dealer had bribed people on both stations in an attempt to start a conflict and sell more weapons. Gaia later dispatched the spy to Station Gamma in order to find more evidences. The spacer therefore infiltrated the Rak'qua space station and was able to find data corroborating the information. The Bothan spy eventually sold the information to Officer Antom Moria who used it to prevent escalation of the conflict.\nAfter those events, the spacer left Tansarii Point Station and traveled to Tatooine. There, Lercer Gaia introduced the spacer to the spies Kaesii DuPree and Sarlis Beni. The spacer later achieved several missions for both of them.\nLercer Gaia appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Lercer Gaia was added to the game as part of the \"New Player Tutorial\", introduced with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Kaesii_DuPree",
  "/wiki/Sarlis_Beni",
  "/wiki/Tatooine/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Car%27das/Legends",
  "/wiki/Rak%27qua",
  "/wiki/Station_Gamma",
  "/wiki/Slicer/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Antom_Moria",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}