{
 "name": "Lerek Serrus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Balmorra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireSphere of Defense of the Empire",
      "Sphere of Defense of the Empire",
      "Balmorran government"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Lachris"
     ]
    }
   ]
  }
 ],
 "content": "Lerek Serrus was a male Human Sith apprentice to Darth Lachris and vice president of Balmorra during the Cold War between the Galactic Republic and the Sith Empire.\nLerek Serrus, a Force-sensitive, lived on Balmorra when the resurgent Sith Empire invaded the planet. Realizing that the Galactic Republic was always holding his homeworld back he decided to collaborate with the Imperial occupation authorities. Believing this choice would help his family and people and bring glory to Balmorra in the end he joined the Empire. After rising through its ranks and falling for the dark side he became an apprentice to Darth Lachris, the Sith Governor of Balmorra. As her protege he was given position of the vice president of Balmorra.\n\nDuring the Cold War, Lerek was present on Balmorra where he was ordered by his master to protect Chief Trabier who was responsible for enslaving the people of Balmorra. When the Barsen'thor arrived, Lerek stood in front of Trabier to protect him and warned the Jedi to stand back. He explained to the Consular about the protection of his family and the people that he cares about in order to bring hope and victory that his master was going to bring. Barsen'thor redeemed him to let go of the dark side and to protect his family and the people he cared about. Lerek defied his master and Trabier by defecting from the Sith.\nThe fate of Lerek is decided by the player, by choosing one of the three speech options that are given. The first option will result in Lerek telling the player about his family, and the player will be able to persuade him to return to his family and let go of the dark side. In the second option, the player tries to redeem him, but Lerek engages the Jedi nonetheless, and is killed in the fight. At last, the third option, which will be awarded with Dark side points if chosen, the player would just engage Lerek, killing him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Balmorra/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sphere_of_Defense_of_the_Empire",
  "/wiki/Darth_Lachris",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Chief/Legends",
  "/wiki/Trabier",
  "/wiki/The_Barsen%27thor",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}