{
 "name": "Letta_Turmond",
 "display_name": "Letta Turmond",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  }
 ],
 "content": "Letta Turmond was a human female inhabitant of the planet Coruscant. Married to Abyssin Jackar Bowmani, Turmond was an activist who protested against the Jedi Order's participation as military officers for the Galactic Republic during the Clone Wars, holding radical beliefs in their transformation into warmongers as a result. Later, as part of her protestations, she was one of several individuals responsible for a bombing of the Jedi Temple in 19 BBY.\nUnder instructions from the fallen Jedi Padawan, Barriss Offee, Turmond implanted explosive nano-droids within her husband to enact the bombing. As a result, while working in the Temple as a munitions foreman, Bowmani exploded and killed himself along with several Jedi and Republic clone troopers. Turmond was later imprisoned by the Republic after being arrested by Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, whom the woman desired to reveal the identity of the one behind the bombing to. However, as she came to reveal Offee as the culprit, the fallen Padawan secretly strangled Turmond to death in order to withhold her identity.\nTurmond was motivated to help bomb the Jedi Temple by the belief that the Jedi were warmongers. Her participation in the attack was to draw attention to what she felt was the hypocrisy of the Jedi Order during the war. She had no qualms about using murder and terrorism to make a statement on her views. It was for this reason that Barriss Offee used and manipulated Letta to her own ends. Yet, when Offee began to threaten Turmond's life, Turmond was willing to reveal to Ahsoka Tano of Offee's involvement in the bombing in exchange for her protection, which sadly cost Turmond her own life as she was choked to death by Offee.\nLetta was also a decent actor in that she faked distress and anger at the Jedi's accusations towards her husband Jackar. However, given that Letta murdered Jackar in such a horrendous and deceptive way and her later revealing it wasn't her idea to feed him nano-droids, it's unclear whether or not she ever truly loved him.\nTurmond had dark hair and tan skin. She had several tattoos on her face.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Letta_Turmond",
  "/wiki/Letta_Turmond/Legends",
  "/wiki/Coruscant",
  "/wiki/19_BBY",
  "/wiki/Human",
  "/wiki/Coruscanti",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Marriage",
  "/wiki/Abyssin",
  "/wiki/Jackar_Bowmani",
  "/wiki/Jedi_Order",
  "/wiki/Republic_Military",
  "/wiki/Officer",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Barriss_Offee",
  "/wiki/Nano-droid",
  "/wiki/Death",
  "/wiki/Clone_trooper",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ahsoka_Tano",
  "/wiki/Force_choke",
  "/wiki/NM-K_reconstitutor",
  "/wiki/Tattoo",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Letta_Turmond",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/Hologram",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Lawless",
  "/wiki/StarWars.com",
  "/wiki/Standard_year"
 ]
}