{
 "name": "Lew Brell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nem'ro's gang"
     ]
    }
   ]
  }
 ],
 "content": "Lew Brell was a Human male who lived on Nal Hutta during the Cold War between the Galactic Republic and the Sith Empire. Brell served in the gang of the Hutt crime lord Suudaa Nem'ro. He eventually quit the gang but was unable to make his way off-planet and ended up in the industrial town of Jiguuna. Sometime after Brell's resignation, his younger brother, Cam, decided to follow in his footsteps and began working for the Hutt. In 3643 BBY, Brell hired an Imperial-aligned individual to rescue his brother from a life of crime; however, Brell's efforts were in vain, as the individual returned without Cam.\nDuring the Cold War between the Galactic Republic and the Sith Empire, the Human male Lew Brell lived on the planet Nal Hutta, the adopted homeworld of the Hutt species. He came to work for a Hutt crime lord named Suudaa Nem'ro and became acquainted with another of Nem'ro's men named Rex Geer. Brell eventually left Nem'ro's gang, however, as he began to feel the work was too violent. He then spent ten years trying to leave Nal Hutta, unsuccessfully.\nIn the year 3643 BBY, Brell's younger brother, Cam, decided to follow in his brother's footsteps and joined Nem'ro's gang. Cam ended up fighting for Nem'ro against rival Hutt Voontara Fa'athra in an industrial town on Nal Hutta named Jiguuna, which Nem'ro ruled. When Brell learned of his brother's choice, he attempted to rescue him from work in the gang. Brell tried to contact Rex Geer, who was the captain of Nem'ro's street gang, and persuade him to release Cam from service. Due the gang war raging in Jiguuna between Fa'athra and Nem'ro, Brell could not reach his old acquaintance and so began searching for an individual who could.\nBrell found an Imperial-aligned individual in the Poison Pit cantina who was willing to help him save Cam. Brell offered the individual his knowledge of Nal Hutta's gang wars in return for help but was also willing to pay in credits. The individual successfully fought through Fa'athra's men and reached Geer's safe house in Jiguuna, where he and Cam were believed to be. The individual discovered that Rex had, in fact, imprisoned Cam within a cage, along with three other prisoners, as the younger Brell had attempted to flee from the battlefield during a gun fight and join Fa'athra's side. Rex intended to take him before Nem'ro for questioning, and when the individual requested Cam's release, the captain offered the Imperial credits to leave Cam in his custody instead of bringing him back to Brell.\nThe individual agreed, much to Cam's horror, and left Geer's house, returning to Brell at the cantina. Upon the individual's return, Brell became angry that his brother had not been rescued and refused to pay the individual.\nLew Brell left Nem'ro's gang, as he considered the life too bloody and violent, although he learned a great deal about Nal Hutta's gang warfare during his work for the Hutt. When his brother, Cam, joined the same gang, he cared enough about his sibling to find an individual to help save him and was willing to offer the individual both insight into Nal Hutta's gang warfare and credits. When he learned his brother had been left to be punished by Nem'ro, Brell became angry and refused to compensate the individual who had left his brother. Brell also appreciated honesty, even from those who had done something against his wishes. Brell was bald, with brown eyes and dark skin.\nBrell wore a dark shirt and light-colored pants while he was searching for help on Nal Hutta. He had a series of straps over the shirt and wore a backpack as well.\nLew Brell first appeared in the video game Star Wars: The Old Republic, released by BioWare in 2011. His location was also marked in the accompanying Star Wars: The Old Republic Explorer's Guide. Brell is involved in the quest \"Gang Warfare,\" in which he asks the player to rescue his brother, Cam. The player has a choice, upon finding Cam, to either leave him to his fate in exchange for credits  or to save him . This article assumes that players choose the dark-side option and leave Cam, as only Imperial Agents and Bounty Hunters may take this mission. If the player leaves Cam, the player, upon returning to Brell, may choose to tell him the truth about leaving Cam or claim he was already dead upon arrival. Neither of these options corresponds with a specific alignment, so this article makes no assumption about which was chosen.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nem%27ro%27s_gang",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Planet/Legends",
  "/wiki/City/Legends",
  "/wiki/Jiguuna",
  "/wiki/Cam_Brell",
  "/wiki/3643_BBY",
  "/wiki/Homeworld/Legends",
  "/wiki/Species/Legends",
  "/wiki/Rex_Geer",
  "/wiki/Standard_year/Legends",
  "/wiki/Voontara_Fa%27athra",
  "/wiki/Captain/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Poison_Pit",
  "/wiki/Cantina/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Prison/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Lightfight",
  "/wiki/Fa%27athra_gang",
  "/wiki/Blood/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Backpack/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Imperial_Agent",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}