{
 "name": "Lew_Organa",
 "display_name": "Lew Organa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Organa",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Lew Organa was a Human male who served as a member of House Organa during the Cold War and the civil war on his home planet.\nIn 3643 BBY, Jedi Master Sidonie Garen began organizing peace talks between the noble houses, but a madness plague struck her, causing a change in her behaviour. At the same time, a Jedi Consular arrived and met with Lew and his brother Hallam, asking to speak with Sidonie. The Organas raised her on the holo but Sidonie was quite dismissive of the Consular, claiming she was busy organizing the peace summit and that no one excluding the houses' assigned delegates were permitted to enter, and terminated the call. The Organas were confused, as that was uncharacteristic of Sidonie. As the Consular insisted that they had to get into the summit, the Organas recalled that House Teral was lacking a delegate, whom the Consular could fill in for.\nAs the Consular worked to ensure an alliance between Teral and Organa through the marriage of Lew and Fasha Teral. Lew was on his way to meet with the Terals when he was ambushed and captured by Rist. He was taken to a base in the northern Juran Mountains, where he was rescued by the Consular. As he explained how he was captured, he recalled the Rists mentioning Sidonie, but found the thought of her hiring the assassins to be absurd. However, upon discovering her holofrequency on the Rist computer, Sidonie quickly signed off upon being discovered. Though confused at the recent events, Lew managed to return home.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Alderaan_Civil_War",
  "/wiki/Planet/Legends",
  "/wiki/3643_BBY",
  "/wiki/Sidonie_Garen",
  "/wiki/The_Barsen%27thor",
  "/wiki/Hallam_Organa",
  "/wiki/House_Teral",
  "/wiki/Fasha_Teral-Organa",
  "/wiki/House_Rist",
  "/wiki/Juran_Mountains/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}