{
 "name": "Lex_(clone_trooper)",
 "display_name": "Lex  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Eighteenth Battalion",
      "Grand Army of the Republic",
      "Eighteenth Battalion",
      "Eighteenth Battalion"
     ]
    }
   ]
  }
 ],
 "content": "\"Lex\" was a clone commando sergeant who served in the Eighteenth Battalion, a unit of clone troopers led by Jedi Master Bant Eerin and Clone Captain Herc during the Clone Wars. In 21 BBY, the battalion participated in a battle on the Trandoshan moon Akoshissss. During the battle, Lex was sent to infiltrate Muun cyberneticist Bitt Panith's laboratory.\nLex was the nickname of a clone commando sergeant who served in the Grand Army of the Republic. Like all other clone troopers, Lex was a biological reproduction of Mandalorian bounty hunter Jango Fett, born on the Wild Space planet of Kamino. After his creation, he served the Eighteenth Battalion under the command of Jedi Master Bant Eerin and Clone Captain Herc. In 21 BBY, during the Clone Wars, Muun cyberneticist Bitt Panith created Krossen, a cyborg immune to the Force. In response, the Galactic Senate sent Lex and the Eighteenth battalion to the Trandoshan moon of Akoshissss, where Krossen was in the final stages of development.\nDuring the ensuing battle, Bant Eerin's Padawan, Jedi Initiate Jaylen Kos, the astromech droid R3-G0, and Lex infiltrated Bitt Panith's secret base in an attempt to destroy the scientist's starship and trap him inside the laboratory.\nLex was a cautious clone, knowing that as long as Doctor Panith's ship was destroyed, the Republic strike force would not have to worry about him escaping, even if the Doctor's battle droid forces were not defeated. Lex was trained in the use of heavy weapons, including explosives such as thermal detonators. Like his clone template Jango Fett, Lex stood 1.83 meters tall.\nLex's only appearance to date is in The Clone Wars: Decide Your Destiny: The Way of the Jedi, a novel based on the Star Wars: The Clone Wars television series. The novel was written by Jake Forbes and was released in 2008. Lex is also featured in the novel's online content on StarWars.com.\nBecause The Way of the Jedi is a Decide Your Destiny book, there are many different possible outcomes for the events within, which are dependent on choices made by the reader. After infiltrating Panith's base, Eerin's Padawan, Kos, R3-G0, and Lex have a choice as to whether to follow Panith into a laboratory or to follow a group of the Doctor's IG-100 MagnaGuards into a hangar. If the reader decides that the strike team should follow the droids, Lex volunteers to blow up Panith's starship, which is located within the hangar. R3-G0 then goes aboard the ship and, if the reader chooses for Eerin's Padawan to not to follow the droid aboard, Lex sets off some explosives and is subsequently killed when poison gas is released into the hangar bay. Later that night, the clone troopers on Akoshissss hold a wake to honor Lex and the other clones lost in the battle on the moon. If the reader does choose for Eerin's Padawan to follow R3-G0, the Padawan, Lex, and Kos are inside the ship when the gas is released, which protects them from the gas's effects. Lex then blows the ship up, and the team members subsequently capture Panith.\nIf the reader chooses to follow Panith rather than the MagnaGuards when the strike team enters the base, Eerin's Padawan and Kos leave Lex to stand guard while they go to deal with Panith. Soon afterward, Lex abandons his post and goes to assist the Jedi pair, and he shoots Krossen in the chest. The reader then has to chose between having Eerin's Padawan help Lex battle Krossen, or going after Panith instead. If the Padawan assists Lex, then Lex draws Krossen into a doorway, and R3-G0 shuts the doors on the creature, allowing Lex to kill Krossen. If the reader chooses to pursue Panith, Lex kills Krossen using an EMP bomb, which also disables R3-G0. Lex then carries the droid while he and the two Jedi return to Bant Eerin's command center.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Human/Legends",
  "/wiki/Miner/Legends",
  "/wiki/Lex",
  "/wiki/Kamino/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Eighteenth_Battalion",
  "/wiki/Clone_commando/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Battalion/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bant_Eerin/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/Herc",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Battle_of_Akoshissss",
  "/wiki/Trandosha/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Akoshissss",
  "/wiki/Muun/Legends",
  "/wiki/Cyberneticist/Legends",
  "/wiki/Bitt_Panith",
  "/wiki/Bitt_Panith%27s_secret_base",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Krossen",
  "/wiki/Cyborg/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Canon",
  "/wiki/Bant_Eerin%27s_Padawan",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jaylen_Kos",
  "/wiki/Astromech_droid/Legends",
  "/wiki/R3-G0",
  "/wiki/Scientist/Legends",
  "/wiki/Bitt_Panith%27s_starship",
  "/wiki/Laboratory/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/The_Clone_Wars:_Decide_Your_Destiny:_The_Way_of_the_Jedi",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Jake_Forbes",
  "/wiki/2008",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars:_Decide_Your_Destiny",
  "/wiki/IG-100_MagnaGuard/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Electromagnetic_pulse/Legends",
  "/wiki/Databank_(original)",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/Star_Wars_Annual_2011"
 ]
}