{
 "name": "Lexia_Ginorra",
 "display_name": "Lexia Ginorra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Lexia Ginorra's master"
     ]
    }
   ]
  }
 ],
 "content": "Lexia Ginorra was a female Human Jedi Padawan serving the Jedi Order and the Galactic Republic during the final decades of the Republic Classic era. Falling to the dark side of the Force after a ruinous run in with a crime lord, Ginnora abandoned the Order and formed a vigilante group in the Coruscant underworld.\nA Force-sensitive Human, Lexia Ginorra was inducted into the Jedi Order and received her training in the ways of the Force. After being selected as a Padawan, Ginorra was stationed on Kamparas's training center where she completed her own lightsaber. On the path to become a Jedi Guardian, Padawan Ginorra was abducted while on a mission by a crime syndicate and gave into her fears, slaughtering her captors.\nRealizing that she had violated the Jedi Code and fearful of retribution by the Jedi High Council and her master, Ginorra abandoned the Order and fled into jungles of Kamparas. Eventually Ginorra made her way back to Coruscant where she established herself as the leader of a gang of vigilantes that preyed upon the criminal leaders in the Coruscant underworld. As many crime lords placed bounties on her head, Ginorra wiped out several criminal organizations, slipping further and further into darkness. Despite the illegality of her actions, her reputation preceded her, becoming the protagonist in many a Coruscant Security Force officer's tales, gaining the name \"the Sith.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lexia_Ginorra%27s_master",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Kamparas",
  "/wiki/Kamparas_Jedi_Training_Center",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}