{
 "name": "Lexi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "White Worms"
     ]
    }
   ]
  }
 ],
 "content": "Lexi, also known as just Lex, was a human female who served as a scrumrat for the White Worms gang on the planet Corellia. In 13 BBY, she snatched a piece of stolen loot from one of the younger scrumrats to give to Lady Proxima, leader of the gang, herself.\nLexi was a human girl who lived on the planet Corellia and became a member of the criminal White Worms gang at a young age. She served the gang's leader, Lady Proxima, as a scrumrat and worked out of the Den of the White Worms along with the other members of the group.\nIn 13 BBY, she and three other scrumrats returned to the tunnels around the den together and emptied their backpacks to compare the loot they had stolen. A younger scrumrat showed her a a shiny piece of stolen material that he believed Proxima would give him and entire portion for; however, Lexi snatched it and claimed that she would be the one to get the portion. The boy complained and tried to grab the stolen property back, but Lexi escaped with it, so he gave chase. The older scrumrat Han Solo witnessed the cruel theft, but did not intervene as he believed the boy needed to learn to fend for himself.\nLexi was cruel enough to steal from another scrumrat and potentially deprive him of his dinner. She had fair skin, red hair, and brown eyes.\nLexi wore brown robes with a scarf and a satchel for carrying stolen goods.\nLexi was portrayed by Lily Newmark in the 2018 Anthology film, Solo: A Star Wars Story. Her dialogue is slightly abbreviated in the novelization of the film written by Mur Lafferty.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/White_Worms",
  "/wiki/Scrumrat",
  "/wiki/Planet",
  "/wiki/13_BBY",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Den_of_the_White_Worms",
  "/wiki/Backpack",
  "/wiki/Foodstuff",
  "/wiki/Han_Solo",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Scarf",
  "/wiki/Lily_Newmark",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Mur_Lafferty",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)"
 ]
}