{
 "name": "Leyli",
 "display_name": "Leyli",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selonian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Over 1.72 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Lady Leyli was a Selonian official and aide to the Queen of Tralus on the planet Tralus during the Galactic Civil War. Shortly after the Battle of Endor, she informed the Rebel Alliance's Rogue Squadron of the location of an Imperial base on Tralus, where General Weir was torturing their comrade, Ten Numb.\nDuring the Galactic Civil War, Lady Leyli was an official and the aide to the Queen of Tralus. Two weeks after the Battle of Endor in 4 ABY, the Galactic Empire's General Weir attacked the Core Worlds planet Corellia and abducted Rebel pilot Ten Numb, bringing him to a base on the nearby planet Tralus for interrogation. In pursuit of Nunb, the Rebel Alliance's Rogue Squadron traveled to Tralus, where they found themselves in a Selonian city. Shortly after, at a golden building in the city, Leyli met with Rogues Wedge Antilles and Luke Skywalker. Leyli informed them that her queen would be unwilling to help them for fear of Imperial reprisals, and expressed her fear of the Sith Lord Darth Vader and Galactic Emperor Palpatine. Although Leyli initially doubted Skywalker's reports of Vader's death and the Empire's defeat at Endor, she was convinced by his assurance that he had personally watched Vader die.\nLeyli decided to keep her queen uninformed of the situation until the Rebels had defeated Weir, and provided scouts to lead the Rebels to the base where the general was holding Numb. She added that Weir was notoriously cruel, and that if their comrade was still alive that he would surely be wishing for death by the time they found him. Numb was later found dead at the base by Rogue Squadron pilot Wes Janson. The Imperials evacuated the base amid the Rebel incursion, and Weir was captured by Antilles.\nLeyli was a cautious and pragmatic individual who was concerned with the protection of her community and queen on Tralus, with those tendencies motivated by her fear of Darth Vader and the Emperor. Despite her unease and mistrust of Skywalker's account of their deaths, she offered help to the heroes of the Rebellion and assisted in directing them to Weir's hidden base. A Selonian female with brown fur and green eyes framed in slightly paler fur, Leyli stood taller than Luke Skywalker, who measured 1.72 meters in height.\nWhile meeting with Rogue Squadron, Leyli wore a white dress with a long, high-necked blue cape flowing behind her and a golden tiara fitted with a green jewel atop her head.\nLeyli appeared in the X-Wing: Rogue Leader comic book series's third issue, which was written by W. Haden Blackman, illustrated by Tomás Giorello, and published by Dark Horse Comics on November 23, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Selonian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Queen_of_Tralus",
  "/wiki/Planet/Legends",
  "/wiki/Tralus/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Weir%27s_base",
  "/wiki/General/Legends",
  "/wiki/Weir/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Ten_Numb/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Raid_at_Coronet",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Leyli%27s_city",
  "/wiki/Gold/Legends",
  "/wiki/City/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Death/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Time/Legends",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Monarchy/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Cape/Legends",
  "/wiki/X-Wing:_Rogue_Leader",
  "/wiki/Star_Wars_comic_books",
  "/wiki/X-Wing:_Rogue_Leader_3",
  "/wiki/W._Haden_Blackman",
  "/wiki/Tom%C3%A1s_Giorello",
  "/wiki/Dark_Horse_Comics",
  "/wiki/November_23",
  "/wiki/2005",
  "/wiki/Category:Images_of_Leyli",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/X-Wing:_Rogue_Leader_1",
  "/wiki/The_Essential_Atlas",
  "/wiki/Marvel_Comics"
 ]
}