{
 "name": "Lhunu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rakata"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Infinite Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lhunu was a male Rakata who lived during the time of the galaxy-wide Rakata Esh-kha-conflict, in which the kingdom of the Esh-kha was extinguished. For nearly a millennium, Lhunu remained in the underground chambers of the prison world of Belsavis. During the Galactic War, Lhunu and the Esh-kha awakened from their slumber by an attack by the Sith Empire. He tried to build his new kingdom until he was taken prisoner and later freed by the Barsen'thor.\nAround 25,200 BBY, Lhunu was a member of the Infinite Empire during its downfall by the Esh-kha, a race which saw the Rakata as unworthy. Lhunu opposed some of the policies of the Infinite Empire and worked to atone for the Esh-kha's crimes. One of his goals was getting aid in freeing Hallow Voice and his followers, though he believed that they were too dangerous to be allowed for their freedom. While the galaxy-wide struggled to succeed, the Rakata transported Hallow Voice, along with thousands of the Esh-kha, to Belsavis. There, they were put into deep stasis in the underground chambers of the prison world for nearly a millennium.\nAround 3641 BBY, when the Sith Empire instigated large scale riots on the planet to free vital prisoner, the stasis chambers were damaged and all the Esh-kha were freed, which included Lhunu. When Commander S. Geland, who was revealed to be a Child of the Sith Emperor, convinced some of the Esh-kha to liberate against the Republic, Lhunu became encircled in the maximum security area, but he managed to depose before he received aid by the Barsen'thor, an apprentice of Jedi Master Yuon Par.\n\nAfter a successful liberation, Lhunu explained to the Jedi that he tried so much to make the arrest of the Esh-kha amends. Eventually, the Rakata handed the Jedi the coordinates to find the Hallow Voice and his loyal followers. When Geland was able to take control over the security systems and trap the Jedi, Lhunu was able to guide the Jedi to defeat the Child and free the Hallow Voice from his imprisonment. After making peace with the Esh'kha for all these years, Lhunu decided to start a new path for the future.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Infinite_Empire",
  "/wiki/The_galaxy/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Belsavis/Legends",
  "/wiki/Galactic_War",
  "/wiki/Invasion_of_Belsavis",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/The_Barsen%27thor",
  "/wiki/25,200_BBY",
  "/wiki/Esh-kha",
  "/wiki/Hallow_Voice",
  "/wiki/Suspended_animation/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3641_BBY",
  "/wiki/Commander/Legends",
  "/wiki/S._Geland",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Tenebrae",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Yuon_Par",
  "/wiki/Jedi/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}