{
 "name": "Li Preni",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nyemari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nyemarian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "South Anem Spaceport"
     ]
    }
   ]
  }
 ],
 "content": "Li Preni was a male Nyemarian who worked at the South Anem Spaceport. He knew Han Solo, and watched over Solo's vessel, the Millennium Falcon when Solo arrived on Nyemari on a mission for the Rebel Alliance in 1 ABY. Preni met a Glymphid who was looking for the Rebels, and told the alien the Rebels were in town. When Solo returned, Preni lied to him about the Glymphid, but told Solo the truth when the Wookiee Chewbacca threatened him. The Rebels then left to meet the Glymphid themselves.\nLi Preni was a male Nyemarian who had been fixing starships at the South Anem Spaceport for years. He had come to owe Han Solo a favor. In 1 ABY, Solo convinced Preni to allow the Millennium Falcon to dock at the South Anem Spaceport while Solo and his companions conducted a the mission for the Rebel Alliance. While Solo and companions were snooping around the Nyemari Royal Palace, Preni was met by a Glymphid who was tracking the Rebels; Preni told the alien the Rebels were in the city.\nAfter their mission was over, the Rebels returned to the Spaceport. Preni met them there but was surprised to see them there; he then told Solo someone was looking for the Rebels. Preni informed the Rebels he had not told the Glymphidanything, but a growl from Chewbacca convinced the Nyemarian to tell the whole truth. The Rebels then left to confront the Glymphid, who was carrying a message for Luke Skywalker from Rezi Soresh. Soresh \"invited\" Skywalker to come to his outpost, or Soresh would kill his hostages. Soresh then demonstrated his power when the Glymphid collapsed and died from a type of time-released poison. Following the incident, the Rebels left Nyemari to confront Soresh.\nAccording to Han Solo, Preni would sell his own mother for a bottle of lum, and may have sold out the Rebels to the Royal guards. When Preni met Solo after the mission, Preni's walk was shifty and up to no good, which did not surprise Solo. Preni lied to Solo about whether he had said anything about them. When threatened by Chewbacca, he revealed that he had in fact told the Glymphid that the Rebels were around.\nLi Preni appears in Alex Wheeler's 2010 book Rebel Force: Uprising.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nyemari",
  "/wiki/Nyemarian",
  "/wiki/Gender/Legends",
  "/wiki/South_Anem_Spaceport",
  "/wiki/Han_Solo/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Mission_to_Nyemari",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Unidentified_Glymphid_messenger",
  "/wiki/Glymphid/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Nyemari_Royal_Palace",
  "/wiki/City/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Rezi_Soresh",
  "/wiki/Unidentified_dead_red_moon",
  "/wiki/Death/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Battle_of_the_Sixela_system",
  "/wiki/Lum/Legends",
  "/wiki/Alex_Wheeler",
  "/wiki/2010",
  "/wiki/Rebel_Force:_Uprising"
 ]
}