{
 "name": "Liagri",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Army",
      "Republic Army"
     ]
    }
   ]
  }
 ],
 "content": "Liagri was a Twi'lek male who served as a sergeant in the Republic Army during the Cold War between the Galactic Republic and the reconstituted Sith Empire. During the war, he was stationed on the planet Alderaan, where he aided the Great House of Organa in the Alderaan Civil War, fought between the various Great Houses. In the year 3643 BBY, Duke Brant Organa contacted Liagri about a failed attempt to repair a set of sensor arrays that had been damaged by soldiers of the rival House of Thul. Liagri, however, informed Organa that no Republic troops were available to help immediately. A Republic-aligned individual then approached Liagri and offered to repair the sensors, which the individual successfully did.\nDuring the Cold War, the Twi'lek male Liagri served the Galactic Republic as part of the Republic Army, fighting against the resurgent Sith Empire. By the year 3643 BBY, he held the rank of sergeant and was stationed on the planet Alderaan aiding the House of Organa, one of the Great Houses of Alderaan, in the Alderaan Civil War, a power struggle between all of the Great Houses.\nDuring that year, while Liagri was in the area known as Foothill Paths, he was contacted via hologram by Duke Brant Organa of House Organa, who informed him that the fourth attempt to repair a number of coastal sensor arrays in areas nearby, including the Apalis Coast and Alsakan Lowlands, had failed. The sabotage of the arrays had been carried out by forces of the House of Thul, an Imperial-backed rival to House Organa, which had also prevented further repair attempts. Organa's men needed the arrays to track the Thul troops' advance, but Liagri told the duke that Republic forces were spread too thin to help and that the next attempt at repairs would only be completed in two weeks' time, which the duke concluded would not be quick enough to save himself or his troops.\nAs Liagri gave Organa the bad news, a Republic-aligned individual approached the sergeant and offered to help repair the arrays. Liagri and Organa gave the individual coordinates for the sensors and told the individual to fire a flare gun from a broken bridge on the Frostflower Path in the Alsakan Lowlands once the task was complete. The individual went on to successfully repair each of the arrays.\nLiagri had light brown skin and blue eyes. When informing the duke that the next set of repairs could not take place immediately, he was apologetic.\nWhile in the Foothill Paths, Liagri wore blue armor and made use of a large table capable of displaying holograms of both individuals and the surrounding area.\nLiagri first appeared in 2011's Star Wars: The Old Republic, an MMORPG video game released by BioWare. Liagri serves as the starting point for the Republic quest \"Coastal Safeguards.\" This quest is optional, and players may refuse to take it; however, this article assumes they finish it as part of 100 percent game completion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Army",
  "/wiki/Sergeant/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Planet/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Alderaan_Civil_War",
  "/wiki/Great_Houses_of_Alderaan",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Duke/Legends",
  "/wiki/Brant_Organa",
  "/wiki/Sensor_array/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/House_of_Thul",
  "/wiki/Republic_soldier",
  "/wiki/Sensor/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Foothill_Paths",
  "/wiki/Hologram/Legends",
  "/wiki/Apalis_Coast",
  "/wiki/Alsakan_Lowlands",
  "/wiki/Saboteur/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Time/Legends",
  "/wiki/Canon",
  "/wiki/Flare_gun",
  "/wiki/Frostflower_Path",
  "/wiki/Eye/Legends",
  "/wiki/Armor/Legends",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}