{
 "name": "Lidan Bleeker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Intarsa League"
     ]
    }
   ]
  }
 ],
 "content": "Lidan Bleeker was a Rodian male mercenary who lived during the last decades of the Galactic Republic.\nBleeker was a professional soldier and during his career he served with the armed forces of several planets as well as within a couple of mercenary bands. However, he later found himself within job and he was enlisted by the Force Adept Dersa Welles into joining the Intarsa League, a criminal faction that she led.\nCirca 31 BBY, Bleeker and the rest of the Intarsa League were attacked by a criminal rival while traveling in a shuttle close to the world Cularin and they crash-landed in the grounds of the Blue Star Centre, a philosophical research facility. In desperation, Bleeker and the other Intarsa League members seized control of the Blue Star Centre and held its' inhabitants hostage in return for a ransom, passage off Cularin and assurances that the local authorities would apprehend the criminals who had shot down their shuttle. However, the Heroes of Cularin–a band of freelance operatives that operated within the Cularin system–attacked the Intarsa League and defeated Bleeker and his companions.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Intarsa_League",
  "/wiki/Mercenary/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Force_Adept",
  "/wiki/Dersa_Welles",
  "/wiki/31_BBY/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Blue_Star_Centre",
  "/wiki/Philosopher/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Cularin_system",
  "/wiki/Skirmish_in_the_Blue_Star_Centre",
  "/wiki/Operation_Blue_Star"
 ]
}