{
 "name": "Liegeus_Vorn",
 "display_name": "Liegeus Vorn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 35 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Remnant"
     ]
    }
   ]
  }
 ],
 "content": "Liegeus Sarpaetius Vorn was a male Human from a wealthy family. He became a producer of fake holograms and entered into an arrangement with Seti Ashgad. He later helped the kidnapped Leia Organa Solo escape from Ashgad's clutches, and was in turn rescued from him by Luke Skywalker.\nThe black sheep of his family, Vorn became a holo faker, stealing people's ideas and passing them off as his own. He was quite talented, able to cobble together extremely realistic holovids from a database of holograms he kept. This database contained recordings of countless backgrounds, faces, animals, pieces of furniture, sounds, and motions.\nVorn once spent time on Gamorr ghost-writing love poems for Gamorrean bachelors for use while courting.\nEarly in his career, Vorn had an affair with a young Natasi Daala. This affair would end when Daala was transferred to the Maw Installation, though they would meet again years later after the battle of Endor.\nVorn eventually fell in with Seti Ashgad and the droch Dzym on Nam Chorios. After Ashgad kidnapped Leia Organa Solo, Vorn kept suspicion away via his holo forgeries, giving the rest of the galaxy the appearance that everything was normal. During this time, Vorn posed as Ashgad's personal pilot. Vorn also programmed the computer core of Dzym's flagship, the Reliant.\nWhile working for Seti Ashgad, Vorn was forced by Beldorion to edit the Hutt's collection of Huttese pornography.\nVorn befriended Leia, providing her with pure water in place of the drugged water Ashgad provided, and eventually helped her escape. Dzym and Ashgad were not pleased, and punished him. Vorn was later rescued by Luke Skywalker, and brought to a Newcomer camp.\nWhen Admiral Daala arrived on the planet along with New Republic personnel, Vorn was reunited with his former lover. He and Daala left for Pedducis Chorios. They spent some time at her residence there before departing for the Deep Core, where Daala planned to rebuild Imperial forces. The pair married, and had a son.\nVorn was killed in 35 ABY by a thermal detonator as part of a Moff Council plot to assassinate Daala.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/35_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Hologram/Legends",
  "/wiki/Seti_Ashgad/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Holo_faker",
  "/wiki/Holovid/Legends",
  "/wiki/Gamorr/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Maw_Installation",
  "/wiki/Droch",
  "/wiki/Dzym",
  "/wiki/Nam_Chorios/Legends",
  "/wiki/Reliant_(I-7_Howlrunner)",
  "/wiki/Beldorion",
  "/wiki/Hutt/Legends",
  "/wiki/Pornography",
  "/wiki/Newcomer",
  "/wiki/New_Republic/Legends",
  "/wiki/Pedducis_Chorios",
  "/wiki/Deep_Core/Legends",
  "/wiki/Natasi_Daala%27s_son",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Planet_of_Twilight",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_79",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_9",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}