{
 "name": "Lilas Dinhint",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lilas Dinhint was the curator of the Museum of Tatooine located in the capital, Bestine during the time of the Galactic Civil War.\nDuring his time as curator, Lilas Dinhint encountered a traveling spacer. Needing help, Lilas informed the spacer about a thief who had stolen a Tusken Raider robe from the museum. He tasked the spacer with finding the thief, a Jawa, and returning the robe to Lilas. The spacer succeeded, but had to kill the Jawa in the process. Lilas was nonetheless relieved, and expressed some hope that the Empire would listen to his petition for an increased theft-control budget.\nUnfortunately for him, the stealing apparently did not stop. The armor of Melnea Arnthout, one of the first miners on Tatooine, had been stolen. The spacer was sent out to find the thief, named Klinn Innala. The spacer succeeded in killing Klinn, and returning Arnthout's armor to Lilas. Unfortunately, yet another relic went missing from the museum. A mineral scanner that dated back to one of the original settlement's on Tatooine had been stolen. The spacer was tasked to find the thief, named Ting'ral Trin. According to Lilas, Ting'ral was close to the museum's management, just like the previous two individuals. The spacer killed Ting'ral and his associates, and returned the historic survey tool to Lilas. By now, Lilas seemed suspiciously preoccupied with pushing for an increased budget. In a slip of the tongue, Lilas revealed that another artifact was sold. Then he quickly corrected himself and said the artifact was in fact stolen from the museum. It now seemed obvious that Lilas was framing individuals as thieves to gain an increased budget, but the spacer did not seem to care either way. The spacer was tasked with recovering a dried piece of meat. According to Lilas, the meat was left over from the original feast when the Hutts first arrived on Tatooine. The Hutts, Lilas explained, had a mass slaughter, and then a subsequent feast. The meat was mummified, so it managed to remain intact for well over several centuries.\nThe spacer agreed to find the meat, which was in the possession of Sarvik Frey'nra. As the spacer approached Sarvik, he seemed to want to reveal something to the spacer. However, before he could complete his sentence, he was killed. The spacer recovered the dried chunk of bantha meat from Sarvik's corpse. After the meat was returned, Lilas explained that artifact theft could not be tolerated. He hoped that the Imperial budget committee would take his concerns into consideration during their next meeting. For now, Lilas had nothing else for the spacer to do. No more supposed thieves surfaced, and the museum continued to run smoothly.\nIt is not clear if the budget committee agreed to increase funding for the museum, though the museum did develop considerably shortly after the spacer's work. Lilas moved away from his shady activities, and focused on the museum's newfound emphasis on art. The rooms of the museum were redecorated with more artifacts, and seemed to show signs of economic development. From that point on, Lilas the curator met with many spacers who chose to vote on various forms of art. Artists Vanvi Hotne, Kahfr Oladi, Giaal Itotr, Kolka Zteht, Klepa Laeel, and Boulo Siesi all developed various painting for the museum. These various paintings were voted on by citizens on a regular basis, with the winning painting being put up for display in the museum. That very same painting would then be mass-produced and given to various individuals. The schematic for these paintings were sold by Lilas for a modest sum, with the credits being donated to the museum.\nThough Lilas used less than ethical means during his time as curator, the museum perhaps prospered as a result.\nLilas Dinhint was a non-player character  in the 2003 MMORPG Star Wars Galaxies. Originally, Lilas Dinhint gave players a short series of quests which involved recovering artifacts from supposed thieves. Throughout the quests, it became more and more apparent that Lilas sold the artifacts to various individuals, and then accused them of stealing to gain an increased budget for the museum.\nHowever, the quests were eventually removed from the game by the developers. The museum's interior was re-done somewhat, and Lila's role as curator was changed dramatically. Instead of offering the previous quest to players, Lilas now had players visit various artist's across Tatooine, and have them vote for their favorite. Whichever artist got the most votes would have one of their paintings put up in the museum. Players could then buy a schematic for the painting from Lilas, and mass-produce it for other players to buy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gray",
  "/wiki/Brown",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Museum_of_Tatooine/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Melnea_Arnthout",
  "/wiki/Miner/Legends",
  "/wiki/Klinn_Innala",
  "/wiki/Ting%27ral_Trin",
  "/wiki/Hutt/Legends",
  "/wiki/Sarvik_Frey%27nra",
  "/wiki/Bantha/Legends",
  "/wiki/Vanvi_Hotne",
  "/wiki/Kahfr_Oladi",
  "/wiki/Giaal_Itotr",
  "/wiki/Kolka_Zteht/Legends",
  "/wiki/Klepa_Laeel",
  "/wiki/Boulo_Siesi",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/2003",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide"
 ]
}