{
 "name": "Lilit Twoseas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "33 BBY",
      "Yinchorr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "K'Kruhk"
     ]
    }
   ]
  }
 ],
 "content": "Lilit Twoseas was a female Human Jedi Knight serving the Jedi Order during the waning years of the Galactic Republic. Most notably, Twoseas was the master of the famed Jedi K'Kruhk, one of the few Jedi to escape the Great Jedi Purge, Galactic Civil War, and the rise of the One Sith in 137 ABY.\nWhile Lilit Twoseas' early life is ambiguous, it is most likely that she was discovered to be Force-sensitive by doctors on her homeworld, who then would have notified the Jedi Temple of their discovery. Dispatching Jedi to bring her to Coruscant, she would have entered into the academy there as an Initiate. After graduating from the academy, Twoseas was chosen as a Padawan by a Jedi Master and, after years of one-on-one study, passed her Trials of Knighthood and elevated to the rank of Jedi Knight.\nA skilled swordsman and an adept in the Force, Twoseas undertook specialized study in the Force on her own time. Eventually Twoseas came across the young Whiphid Initiate K'Kruhk and selected him to be her own Padawan. Following many years of training the boy, Twoseas and her student volunteered to accompany the Master of the Order, Mace Windu, on a perilous journey to the Yinchorri system to quell the pan-galactic uprising plaguing the region. The Jedi separated into three teams, with Twoseas joining Jedi High Councilors Micah Giiett and Plo Koon to located the rumored command center on the planet Yibikkoror. When their ship came under fire, the Jedi crash-landed on a lone floating city and began to spread out in search of the command center. Deducing that it was not located on Yibikkoror, the Jedi called for Master Eeth Koth's team to rescue them, as they came under siege by Yinchorri warriors.\nSafely aboard Koth's shuttle, the Jedi team headed to Yinchorr to assist Master Windu's team. On the ground, Twoseas and her Padawan engaged the enemy, fighting their way to their besieged comrades. As they regrouped and headed back to their escape shuttle, K'Kruhk was surrounded by Yinchorri and would have soon been overwhelmed. Unable to standby and do nothing, Twoseas dove into the conflict and jumped in front of a blade meant for the Whiphid's heart. The blade pierced her shoulder, as a second impaled her chest. Picking up her blood-covered form, K'Kruhk and the other Jedi fled to the ship and departed the world.\nAfter the Republic Navy destroyed the control center and silenced the rebels, the Jedi returned with their fallen comrades to the Temple of Coruscant. Escorting Twoseas' body on a hover-gurney, K'Kruhk took his deceased Master into the Temple where it would lie in state until being cremated on the Temple's pyre.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/K%27Kruhk",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/One_Sith",
  "/wiki/137_ABY",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_recruiter",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Whiphid/Legends",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Yinchorri_system",
  "/wiki/Yinchorri_Uprising",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Micah_Giiett",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Yinchorri_command_center",
  "/wiki/Yibikkoror",
  "/wiki/Yibikkoror_floating_city",
  "/wiki/Eeth_Koth/Legends",
  "/wiki/Mission_to_Yibikkoror",
  "/wiki/Yinchorri",
  "/wiki/Battle_of_Yinchorr_(Yinchorri_Uprising)",
  "/wiki/Republic_Navy",
  "/wiki/Jedi_funeral/Legends",
  "/wiki/Jedi_Temple_Pyre_room",
  "/wiki/Jedi_Council:_Acts_of_War_1",
  "/wiki/Jedi_Council:_Acts_of_War_2",
  "/wiki/Jedi_Council:_Acts_of_War_3",
  "/wiki/Jedi_Council:_Acts_of_War_4",
  "/wiki/Star_Wars_(1998)_41",
  "/wiki/Jedi:_Mace_Windu",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_8",
  "/wiki/Jedi_Council:_Acts_of_War"
 ]
}