{
 "name": "Lilith Laughlin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Lilith Laughlin was a Human female small-time thug who lived on Corellia during the time of the Galactic Civil War between the Galactic Empire and the Rebel Alliance.\nBy the time following the Battle of Yavin, Lilith Laughlin was a small-time thug who resided in the city of Doaba Guerfel and served as an undercover agent for the Corellian Security Force.\nIn 1 ABY, the Corellian Security Force started an investigation against the Chirq Council, also known by the CorSec as the Red Circle Gang, following the increase of ryll traffic on Corellia. After it was discovered that the criminal organization was based in Doaba Guerfel, Captain Vitala Baize was designated to lead the investigation. Captain Baize decided to use the help of Lilith Laughlin to discover putative Chirq Council members in Doaba Guerfel. However, Laughlin was not able to help the CorSec at that moment because some Ragtag cudgels led by Ventil Tamplin and Lilea Norith harassed her because they suspected her true allegiance. Captain Baize thus dispatched a spacer who previously worked for CorSec to deal definitively with the Ragtags.\nLilith Laughlin immediately started to work for Captain Baize and she quickly found possible connections between the Red Circle Gang and a Drall terrorist organization known as the Drall Patriots. However, after a search in the Drall Patriot Warehouse in Doaba Guerfel, it appeared that there was no connection between the two groups. Laughlin later sent the spacer talk with Gwhirrye Baric, a thug who ran a spice racket out of a small hospital in Doaba Guerfel. After the spacer helped him to deal with Xyrias Undea and the Rogue CorSec miscreants who harassed his business, Baric accepted to reveal a name: Trins Evnar. The man was a spice dealer with a red circle tattoo on his arm. Thanks to this information, Captain Baize discovered the identity of several Chirq Council members and managed to infiltrate an agent within the organization.\nThe Chirq Council later discovered that an informant helped the CorSec in its investigation. The underboss Jzoro Quanera thus tasked Captain Baize's infiltrated agent to find and kill the informant. In order to protect Lilith Laughlin, the agent instead killed another woman, Ebela Puckett, a Grey Shroud terrorist and Captain Baize created evidences that the terrorist was working for CorSec. Having earn the trust of Jzoro Quaner, the agent was allowed to have full access to Quanera's database and obtained the identity of the nine elite councilors who ruled the Chirq Council and the locations of their secret headquarters. The CorSec operation eventually led to the destruction of the Chirq Council.\nLilith Laughlin was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Lilith Laughlin was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Purple",
  "/wiki/Brown",
  "/wiki/Captain/Legends",
  "/wiki/Vitala_Baize",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Corellia/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jzoro_Quanera",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Doaba_Guerfel/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/1_ABY/Legends",
  "/wiki/Chirq_Council",
  "/wiki/Ryll/Legends",
  "/wiki/Ragtags",
  "/wiki/Ventil_Tamplin",
  "/wiki/Lilea_Norith",
  "/wiki/Drall/Legends",
  "/wiki/Drall_Patriots",
  "/wiki/Drall_Patriot_Warehouse",
  "/wiki/Gwhirrye_Baric",
  "/wiki/Xyrias_Undea",
  "/wiki/Rogue_CorSec",
  "/wiki/Trins_Evnar",
  "/wiki/Ebela_Puckett",
  "/wiki/Grey_Shroud_terrorists",
  "/wiki/Elite_Council",
  "/wiki/First_Elite_Council_Bunker",
  "/wiki/Second_Elite_Council_Bunker",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/Template:SWGTCG",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}