{
 "name": "Lily_Tora-Asi",
 "display_name": "Lily Tora-Asi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Arkoff"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Keerin Fionn"
     ]
    }
   ]
  }
 ],
 "content": "Lily Tora-Asi was a human female Jedi Knight who lived during the High Republic Era. During her time as a Knight of the Jedi Order, she was stationed on the remote planet Banchii, where she trained Jedi younglings alongside Jedi Master Arkoff and her Padawan, Keerin Fionn. In the aftermath of the Great Hyperspace Disaster, Tora-Asi and her fellow Jedi worked to help displaced civilians relocate to Banchii.\nDuring the High Republic Era, Lily Tora-Asi served in the Jedi Order as a Jedi Knight and was stationed at the Jedi Temple on Banchii in the Inugg system, alongside her mentor, Jedi Master Arkoff, and her Padawan, Keerin Fionn, as well as Jedi archivist Ru-Ru and the Jedi younglings Nima and Viv'Nia Nia'Viv. After the events of the Great Hyperspace Disaster, she was assigned to help displaced civilians relocate to Banchii. In addition to this task and her responsibilities in training the younglings under her charge, Tora-Asi had to confront threats from the Drengir and the Nihil.\nLily Tora-Asi was dutiful in her responsibilities as a Jedi. When the younglings Nima and Viv'nia became excited by news of the Republic Fair during their assignment on Banchii, Tora-Asi, along with Master Arkoff, reminded them that there was an order to their responsibilities as Jedi, which, at that time, meant helping the people on Banchii first and foremost. Additionally, Tora-Asi was a quick thinker. Upon realizing that the Drengir could not be killed using lightsabers, she quickly devised a plan to burn them instead and was, thus, successful in defeating the creatures.\nAlthough she was committed to the Jedi Order and its cause, Tora-Asi occasionally harbored doubts about whether or not she was doing enough to help the people of the galaxy and if she was capable of handling unpredictable situations. As a result, her mentor, Arkoff, often encouraged her to change and broaden her perspective.\nTora-Asi was a human female with black hair, green eyes and pale skin.\nA full-fledged Jedi Knight, Tora-Asi was skilled in Jar'Kai, the practice of dual-wielding two lightsabers, and was equally talented in the usage of the Force, being capable of using telekinesis. When the Drengir was unleashed on Banchii, she used a combination of both her lightsaber skills and her Force abilities to battle the creatures.\nTora-Asi understood the Wookiee language Shyriiwook and was capable of communicating with Arkoff.\nTora-Asi wore a set of ornate Jedi robes that was similar to the style of clothing worn by other Jedi during the High Republic Era. While on missions, she also donned gauntlets and a dark-colored outer robe. In combat, Tora-Asi wielded a pair of identical green-bladed lightsabers which featured circular handguards.\nLily Tora-Asi debuted in the 2021 Japanese manga series Star Wars: The High Republic: The Edge of Balance, written by Justina Ireland and Shima Shinya, and illustrated by Mizuki Sakakibara. The character was first pictured on the cover of Star Wars: The High Republic: The Edge of Balance, Vol. 1 when it was showcased to the public during the launch livestream for Star Wars: The High Republic on January 4, 2021. She was later identified as Lily Tora-Asi in the debut episode of Star Wars: The High Republic Show on January 27.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lily_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Arkoff",
  "/wiki/Keerin_Fionn",
  "/wiki/Jedi_Knight",
  "/wiki/High_Republic_Era",
  "/wiki/Planet",
  "/wiki/Banchii",
  "/wiki/Jedi_Initiate",
  "/wiki/Jedi_Master",
  "/wiki/Padawan",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Jedi",
  "/wiki/Jedi_Temple_(Banchii)",
  "/wiki/Inugg_system",
  "/wiki/Jedi_archivist",
  "/wiki/Ru-Ru",
  "/wiki/Nima_Allets",
  "/wiki/Viv%27Nia_Nia%27Viv",
  "/wiki/Youngling",
  "/wiki/Drengir",
  "/wiki/Nihil",
  "/wiki/Republic_Fair",
  "/wiki/Death",
  "/wiki/Lightsaber",
  "/wiki/Fire",
  "/wiki/The_galaxy",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Jar%27Kai",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Force_power",
  "/wiki/Wookiee",
  "/wiki/Language",
  "/wiki/Shyriiwook",
  "/wiki/Jedi_robes",
  "/wiki/Clothing",
  "/wiki/Robe",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance",
  "/wiki/Justina_Ireland",
  "/wiki/Shima_Shinya",
  "/wiki/Mizuki_Sakakibara",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._1",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/January_4",
  "/wiki/Star_Wars:_The_High_Republic_Show",
  "/wiki/January_27",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Lily_Tora-Asi"
 ]
}