{
 "name": "Lin_Gaava",
 "display_name": "Lin Gaava",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jace Rucklin's racing team",
      "First Order",
      "First Order starfighter corps",
      "First Order starfighter corps"
     ]
    }
   ]
  }
 ],
 "content": "Lin Gaava was a human female who lived during the era of the New Republic. She worked as a mechanic on Jace Rucklin's team, on the Colossus platform on Castilon. Gaava had red hair, blue eyes and light skin. After the occupation of the Colossus, she eventually joined the First Order as a TIE pilot cadet.\nLin Gaava was a member of Jace Rucklin's racing team during the New Republic era, which included the male Sullustan Gorrak Wiles. They had a reputation as fun-loving troublemakers and idlers aboard the Colossus platform on the ocean world of Castilon. Gaava frequented the Colossus marketplace and docks.\nGaava and her associates Rucklin and Wiles encountered the undercover Resistance spy Kazuda Xiono, who worked as a mechanic at Jarek Yeager's repair station. Taking advantage of Xiono's dissatisfaction with his demanding employer, Rucklin and his associates befriended Xiono, appealing to his love for racing and having fun. Lin also claimed that they were free to take leave anytime.\nGaava and Wiles later watched on the platform as Rucklin and Xiono raced on speeder bikes over the sea. Under Rucklin's instructions, Gaava and Wiles had sabotaged Xiono's speeder bike so that Rucklin could rescue him and gain Xiono's trust. Rucklin's plan worked, and he thanked Gaava and Wiles for their work.\nLater, Xiono visited Jace Rucklin's hangar, where he found Gaava, Wiles, and Rucklin working on Rucklin's racer. Xiono had ignored his friend Neeku Vozo's advice that Rucklin and his associates were little more than idlers and troublemakers. Gaava was stripping Rucklin's racer of \"unnecessary\" systems to reduce the ship's weight.\nRucklin then convinced Xiono to allow him to visit Yeager's trophy room so that he could steal a canister of Corellian hyperfuel. When Rucklin returned, Gaava and Wiles praised Rucklin for executing his heist. Lin also warned Ruckling to be careful as he poured hyperfuel into his racer's tank.\nAfter Xiono discovered the theft, he returned to the hangar. Gaava and Wiles watched as Xiono remonstrated with Rucklin, who had already injected the hyperfuel into the racer's engines. Xiono managed to rescue an unwilling Rucklin, but his racer was destroyed. Lin and Wiles supported Rucklin when he chastised Xiono for destroying his ship. Xiono countered that Rucklin had stolen Yeager's hyperfuel, something which Rucklin denied.\nWhile the BB-series astromech droid BB-8 was searching for Xiono, Gaava was frequenting the Colossus marketplace. During Kragan Gorr's Warbirds' second raid on the Colossus, Gaava and Wiles took advantage of the chaos to salvage supplies from the marketplace.\nGaava also frequented the Colossus marketplace, which was a familiar stomping ground of other Colossus residents including Neeku Voz, Bucket, and Xiono.\nGaava continued frequenting the streets of the Colossus during the First Order's occupation of the platform. Later, the First Order took an interest in Gaava and her friend Rucklin. While walking through the corridors of Doza Tower, they crossed paths with First Order Security Bureau Agent Tierny and Tamara Ryvora, whom Tierny was trying to recruit into the First Order. After joining the First Order alongside Rucklin and Ryvora, Gaava became a TIE pilot cadet, and participated in training exercises with them under the command of Lieutenant Galek.\nLin Gaava was a female human with red hair, blue eyes, and fair skin. Gaava and her associates had a reputation for laziness, humor, and playing pranks among the citizens of the Colossus. Lin liked the fact that she and her colleagues could take days off and not work like droids. She and Wiles shared their leader Rucklin's willingness to steal and exploit his friendship with Xiono to advance Rucklin's racing ambitions. This included sabotaging Xiono's speeder bike so that Wiles could gain his trust.\nAs opportunists, Gaava and Wiles took advantage of a pirate raid on the Colossus to salvage supplies from the Colossus marketplace.\nLin Gaava was a mechanic who was familiar with starships and speeder bikes.\nLin Gaava is a character created and developed for Star Wars Resistance. She is voiced by Rachael MacFarlane.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jace_Rucklin%27s_racing_team",
  "/wiki/First_Order",
  "/wiki/First_Order_starfighter_corps",
  "/wiki/Kazuda_Xiono",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Mechanic",
  "/wiki/Jace_Rucklin",
  "/wiki/Colossus",
  "/wiki/Castilon",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/First_Order_TIE_Fighter_Pilot",
  "/wiki/Cadet",
  "/wiki/New_Republic_era",
  "/wiki/Sullustan",
  "/wiki/Gorrak_Wiles",
  "/wiki/Colossus_marketplace",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Jarek_Yeager",
  "/wiki/Jarek_Yeager%27s_Repair_Station",
  "/wiki/Speeder_bike",
  "/wiki/Jace_Rucklin%27s_hangar",
  "/wiki/Jace_Rucklin%27s_racer",
  "/wiki/Neeku_Vozo",
  "/wiki/Corellian",
  "/wiki/Hyperfuel",
  "/wiki/BB-series_astromech_droid",
  "/wiki/BB-8",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/R1-J5",
  "/wiki/Doza_Tower",
  "/wiki/First_Order_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Tierny",
  "/wiki/Tamara_Ryvora",
  "/wiki/Lieutenant",
  "/wiki/Galek",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Rachael_MacFarlane",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/The_Recruit",
  "/wiki/The_Triple_Dark",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_Search_for_Kaz",
  "/wiki/Synara%27s_Score",
  "/wiki/Neeku%27s_Reward",
  "/wiki/Bucket%27s_Quest",
  "/wiki/Dangerous_Business",
  "/wiki/The_New_Trooper",
  "/wiki/The_Disappeared",
  "/wiki/No_Escape:_Part_1",
  "/wiki/Live_Fire",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_X-Wing_Second_Edition"
 ]
}