{
 "name": "Lindon_Javes",
 "display_name": "Lindon Javes",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Todirium III"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Todirium militia",
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Helix Squadron",
      "Imperial Navy's officer corps",
      "Helix Squadron",
      "Alliance to Restore the Republic",
      "New Republic",
      "Temperance battle group",
      "Nadiri fleet",
      "Temperance battle group",
      "Nadiri fleet"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Terisa Kerrill"
     ]
    }
   ]
  }
 ],
 "content": "Lindon Javes was a human male member of the Rebel Alliance and later the New Republic Defense Force. Ascending the ranks of the Alliance by hunting Imperial starships, he found he excelled in commanding and led several successful missions, later being given command of Vanguard Squadron. When General Hera Syndulla reviewed a plan to attack the Imperial planet Pandem Nai, Javes agreed with the predictions made by the plan's developer.\nLindon Javes was born on Todirium III, where he served in the Todirium militia. He had a sister named Dela, who at some point died during what Javes' file referred to as \"hazardous maneuvers.\"\nJaves was recruited into the Galactic Empire's Imperial Starfighter Corps on Reega II and gained expertise in advanced hazardous flight training, going on to become a qualified flight instructor. He served as a captain in the Imperial Navy and commanding officer of Helix Squadron. Following the destruction of the planet Alderaan in 0 BBY, Darth Vader had given an order to hunt down any refugees who had escaped the planet's destruction. Javes was ultimately given the assignment, though Javes had no intentions of killing innocent civilians and instead planned to rescue them. After hunting down the freighter with the civilians, Javes double crossed his wingmen and disabled their fighters with an ion torpedo. When Alliance forces arrived to assist, Javes immediately defected. The Empire charged Javes with desertion and mutiny, punishable by execution; providing aid to the enemies of the Empire, also punishable by execution; and theft of Imperial property .\nAfter joining the rebels, he hunted Imperial capital ships which allowed him to rise through the ranks of the Alliance.\nBy the time after the Battle of Endor in 4 ABY, despite still being a combat pilot at heart, Javes had learned of his talent for command. Accordingly, he coordinated several successful missions behind the Empire's lines. As the Galactic Civil War entered a new phase, Javes was given command of Vanguard Squadron as well as a classified assignment for the New Republic. He also worked as a special consultant for General Hera Syndulla.\nSeveral weeks after the Battle of Endor, Javes attended a session with Syndulla about a plan to attack the Empire's 204th Imperial Fighter Wing at the planet Pandem Nai. When reviewing predictions made by Lieutenant Yrica Quell, the developer of the plan, Javes agreed with her. Around 5 ABY, he and Vanguard Squadron went on a mission in the Bormea sector to better the New Republic's starship supply.\nLindon Javes was a human male with dark skin, brown eyes, and black hair.\nJaves was an experienced pilot and qualified flight instructor, but later found that he worked well in positions of command. Javes had expertise in advanced hazardous flight training.\nLindon Javes was created for the 2020 video game Star Wars: Squadrons, portrayed by Phil Morris. Javes was first mentioned in the 2019 novel Alphabet Squadron, written by Alexander Freed, and was first pictured in the reveal trailer for Star Wars: Squadrons on June 15, 2020. The character pictured in the trailer was identified as being Javes in an entry on the StarWars.com Databank, released on June 18, 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Todirium_III",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Todirium_militia",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Helix_Squadron",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/Temperance_battle_group",
  "/wiki/Nadiri_fleet",
  "/wiki/Terisa_Kerrill",
  "/wiki/File:RememberWhyWeFly.ogg",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Military_rank",
  "/wiki/Hunting",
  "/wiki/Starship",
  "/wiki/Vanguard_Squadron",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Attack_on_Pandem_Nai",
  "/wiki/Planet",
  "/wiki/Pandem_Nai",
  "/wiki/Yrica_Quell",
  "/wiki/Reproduction",
  "/wiki/Dela",
  "/wiki/Death",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Reega_II",
  "/wiki/Flight_instructor",
  "/wiki/Captain",
  "/wiki/Imperial_Navy",
  "/wiki/Commanding_officer",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/0_BBY",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ion_torpedo",
  "/wiki/TIE_Advanced_v1",
  "/wiki/Capital_ship",
  "/wiki/Time",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Galactic_Civil_War",
  "/wiki/Standard_week",
  "/wiki/Endor",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Lieutenant",
  "/wiki/5_ABY",
  "/wiki/Bormea_sector",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/2020",
  "/wiki/Phil_Morris",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/June_15",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/June_18",
  "/wiki/Category:Images_of_Lindon_Javes",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/The_Light_You_Bring",
  "/wiki/Electronic_Arts",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/Standard_month"
 ]
}