{
 "name": "Lindo Peate",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Intarsa League"
     ]
    }
   ]
  }
 ],
 "content": "Lindo Peate was a Human male criminal lived during the waning years of the Galactic Republic.\nAs a young man, Lindo Peate spent a couple of years residing in in a place of contemplation and study. He later joined the Intarsa League, a criminal faction led by the Force Adept Dersa Welles, and around 31 BBY, Neeblo accompanied the League on a shuttle journey to the world Cularin. En-route, the shuttle was ambushed en-route by rivals of the Intarsa League and the vessel crash-landed in the grounds of the Blue Star Centre, a philosophical research facility located near to the city Gadrin. Soon afterward, Peate and the surviving members of the Intarsa League entered the Blue Star Centre and took the facility's inhabitants hostage in an attempt to gain passage off of Cularin. Peate felt uneasy about the League's seizure of the facility because it was similar to the place of contemplation that he visited while a young man and he was determined to ensure that the Blue Star Centre's inhabitants came to no harm, even if protecting them brought him into conflict with the other members of league. However, the Heroes of Cularin, a group of freelance agents who operated in and around the Cularin system, attacked the Intarsa League and defeated Peate and the other crash survivors to free the hostages.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Intarsa_League",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Force_Adept",
  "/wiki/Dersa_Welles",
  "/wiki/31_BBY/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Blue_Star_Centre",
  "/wiki/Philosopher/Legends",
  "/wiki/City/Legends",
  "/wiki/Gadrin",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Cularin_system",
  "/wiki/Skirmish_in_the_Blue_Star_Centre",
  "/wiki/Operation_Blue_Star"
 ]
}