{
 "name": "Linna Naltree",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Emperor Palpatine Surgical Reconstruction Center",
      "Emperor Palpatine Surgical Reconstruction Center"
     ]
    }
   ]
  }
 ],
 "content": "Linna Naltree was a Human scientist during the time of the Clone Wars. After being taken from her homeworld and sent to Despayre, Naltree was assigned to work at the Emperor Palpatine Surgical Reconstruction Center where she was noticed by Jenna Zan Arbor. Becoming Zan Arbor's personal assistant, Naltree worked with the scientist's memory serum and was set to be the first to test it. Before this could take place, Trever Flume broke into Jenna Zan Arbor's apartment, where he met the two scientists. Naltree acted quickly as she injected Zan Arbor with a vial of the mind wiping serum. After fleeing, Naltree was reunited with her husband and they went to planet Mila.\nAfter Order 66 was proclaimed by Emperor Palpatine, she and her husband Tobin Gantor hid Jedi Master Ry-Gaul into their home planet and gave him a new identity. They were later abducted by the Galactic Empire and were forced to work for its purposes while Ry-Gaul had been looking for them ever since. A year after the Empire replaced the Galactic Republic in the wake of the Clone Wars, Linna was in Ussa, the capital of the planet Bellassa, with many other scientists, most of whom worked against their will for the Empire because their families were being held as hostages as a way for them to be controlled. During a conference, they received instructions from Lord Darth Vader and Grand Moff Wilhuff Tarkin to work on a secret project, in which they did not even know what it was. A short time later, Ferus Olin, Roan Lands, Amie Antin, and the boy Trever Flume broke into an Imperial facility to find out more about this secret project that Tarkin had been in charge of. However, they were discovered, and Roan was killed by Darth Vader, and Ferus and Amie captured, leaving Trever the only one to escape and hide from the Sith Lord. That was when Linna discovered Flume and helped him escape with a plan that was supposed to be hers. That was when a few weeks later, she was assigned as an assistant to the barbaric doctor Jenna Zan Arbor and worked at the ImPal OpRek when Ferus Olin broke in and wanted to free Astri Oddo's son Lune. She asked Ferus to take her too, which he did. When it turned out that the three of them couldn't escape, she returned to allow Ferus and Lune to escape.\nA few days after the unsuccessful liberation operation, Trever went to Zan Arbor's apartment in the noble apartment tower 500 Republica, as she lived there with the doctor. He broke into the apartment to save her because she had enabled him to escape in Ussa and because Ferus asked him to look around there so that he could really free her this time. In the apartment Trever met Ry-Gaul, who also wanted to free her, thanking her and her husband Tobin for saving his life. Meanwhile, Tobin had escaped the Empire and contacted Master Ry-Gaul. That Zan Arbor would most likely be the first to test her memory-erasing drug on Linna, led Trever and Ry-Gaul to rescue her that same day. They lurked on the landing pad until Zan Arbor arrived with her. Then they lurked them in the turbolift and while Ry-Gaul fended off the blaster shots of Zan Arbor, Linna managed to give her the reminder drug so that she forgot all about her experiments. In the apartment she took all the notes for security. Later, after a long time, she met her husband Tobin again. Ry-Gaul had laid out new identity cards for them and after saying goodbye to him and Trever, she went to Mila with her husband in order to be able to live there undisturbed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Emperor_Palpatine_Surgical_Reconstruction_Center",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Despayre",
  "/wiki/Jenna_Zan_Arbor",
  "/wiki/Scientist/Legends",
  "/wiki/Trever_Flume",
  "/wiki/Jenna_Zan_Arbor%27s_apartment",
  "/wiki/Mila_(planet)",
  "/wiki/Order_66/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Tobin_Gantor",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ry-Gaul",
  "/wiki/18_BBY/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ussa",
  "/wiki/Bellassa/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Roan_Lands",
  "/wiki/Amie_Antin",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Astri_Oddo",
  "/wiki/Lune_Oddo_Divinian",
  "/wiki/500_Republica/Legends",
  "/wiki/The_Last_of_the_Jedi:_Against_the_Empire",
  "/wiki/The_Last_of_the_Jedi:_Master_of_Deception",
  "/wiki/The_Last_of_the_Jedi:_Reckoning",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}