{
 "name": "Linus Mosk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Preox-Morlana",
      "West Team",
      "West Team"
     ]
    }
   ]
  }
 ],
 "content": "Sergeant Linus Mosk was a human male who served in Preox-Morlana's Pre-Mor Enforcement. Following the murder of two Preox-Morlana employees in 5 BBY, Mosk was summoned to Corporate Security Headquarters on the planet Morlana One to meet with Deputy Inspector Syril Karn. The pair discussed the case, and agreed that they should both travel to the planet Ferrix with a squad of men to arrest their prime suspect, Cassian Andor.\nThe squad traveled to Ferrix aboard a personnel carrier, and en route, Mosk gave a briefing to the men on the plan, splitting them into three teams. The sergeant and Karn were both in West Team and, after deploying in Mobile Tac-Pod, proceeded to the Andor household to serve the warrant. They found their target's adopted mother, Maarva Andor, and the droid B2EMO at the house, but no Cassian; however, as they questioned the droid it was contacted by Cassian via comlink. Tracing the signal, they discovered Cassian's location, with Mosk sending East Team to surround him. Leaving two members of West Team at the house, Mosk and Karn then began heading toward their target's location.\nAs they traveled, Mosk received reports that East Team had been attacked and were taking casualties. He and West Team began rushing to reach them, but after learning that Cassian had escaped with a collaborator, Karn and Mosk decided to take positions on the Rix Road and wait for the pair of fugitives. After North Team arrived to join them, Mosk and his men opened fire on a landspeeder that they believed to be carrying Cassian and his partner, disabling the vehicle. However, the speeder had been a decoy, and took out several of Mosk's men in an explosion as Cassian and his partner escaped on a speeder bike. Following the incident, the Galactic Empire ended corporate independence in the Morlani system and Mosk and Karn were reprimanded by Imperial Security Bureau Lieutenant Supervisor Blevin and sent to a transfer center.\nLinus Mosk served as a sergeant in the Corporate Tactical Forces of Preox-Morlana, known as Pre-Mor Enforcement, during the reign of the Galactic Empire. In 5 BBY, he was summoned in the middle of the night to the Corporate Security Headquarters on the planet Morlana One to meet with Deputy Inspector Syril Karn, who was investigating the murder of two Preox-Morlana employees; Kravas Drezzer and Verlo Skiff.\nHaving been briefed on the case on the ride in, Mosk entered the headquarter's bullpen and gave Karn a crisp salute as the inspector approached. The pair agreed that they needed to act swiftly in apprehending the prime suspect in the case, Cassian Andor, with Mosk suggesting that they should take twelve men to arrest them and agreed that Karn should join them. The sergeant then complimented Karn on fully engaging with the case and then left after the deputy inspector said he would pass Mosk's kind words along to Chief Inspector Hyne.\nThe next day, Mosk, Karn, and twelve men boarded a personnel carrier in order to reach the planet Ferrix, where Andor was located. While the vessel was in hyperspace, Mosk showed the men an outdated hologram of Andor and warned that their target was more formidable then he appeared. Giving the holoprojector to one of his men, he then split the group into North Team, East Team, and West Team, explaining that West Team, which included Karn and himself, would serve the warrant and then attempt to expedite rapidly while the other two teams took position for a pincer movement if Andor tried to flee.\nMosk finished by noting that some of the residents of Ferrix might also not be pleased with the presence of the Tactical Forces, but told his men to simply remind them that they were welcome to make official complaints at the monthly Territorial Forum. Pivoting at a crisp ninety-degree angle, he then gave the floor to Karn and fell in line behind him with his hands folded behind his back. Despite Karn delivering an uninspiring speech, Mosk began a round of applause and complimented the deputy inspector.\nAfter the personnel carrier arrived above Ferrix, each of the three teams rode in a Mobile Tac-Pod down to the planet's surface, with Mosk traveling shoulder-to-shoulder with Karn. Banking away from the other two Tac-Pods, West Team's pod touched down among a number of refinery tanks and the squad disembarked via the rear drop ramp. As he led his men forward, Mosk reported the team's arrival over comlink, receiving sitreps from the other two groups. West Team then moved through the town toward the Andor residence, with Mosk ordering East Team to secure the position once they had landed.\nAt the residence, the team sounded the buzzer twice before Maarva Andor, Cassian's adopted mother, opened the door; however, when Karn announced their warrant she quickly tried to close it again. Forcing their way in before she could, the team began to search the property. Mosk eventually reported to Karn that the team had discovered the family's droid, B2EMO, and the group gathered round to interrogate it. Before the droid could provide any answers, Cassian contacted B2EMO over comlink, with his voice being audible to the Tactical Forces. Despite B2EMO being unable to respond, Cassian gave him a message for Maarva, speaking for long enough that Mosk was able to tract the location of the incoming call. As a crowd was gathering outside, Mosk left West-3 and West-4 to guard the house before setting out with Karn and the two remaining men from West Team.\nThe locals outside immediately crowded in on Mosk and his men demanding to know what was happening to Maarva, but Mosk pushed them back and stated that it was business as usual as they were serving a warrant. The group then started the ten minute walk to Cassian's location while East Team secured the exterior of the site. Spotting West Team, the local boy Wilmon Paak ran to tell his father, Salman Paak, who spread the word. Many locals then began loudly beating hanging pieces of metal outside their houses and businesses as the streets cleared. Karn questioned what the noise meant, but dismissing it as an intimidation attempt, Mosk carried on without stopping. East Team then reported that they had Cassian's position surrounded, but the sergeant ordered them to wait for West Team to arrive. However, as East Team waited, Luthen Rael, a contact with who Cassian was meeting, detonated slap charges on the doors of the building he and Andor was in, incapacitating two members of East Team. The remaining members of East Team reported this to Mosk, who began running to reach them as Cassian and Rael exchanged fire with East Team and downed another man.\nWith East Team not responding, Mosk contacted North Team and demanded to know their exact position, which they eventually reported as North Stairs Lane. The sergeant then ordered them to relocate Rix Road and get a Tac-Pod in the air immediately. North Team failed to immediately respond to the order as they were confronted by the local Timm Karlo, but after one of the team killed Karlo, the team's leader responded to Mosk in the affirmative and sent the man who had killed Karlo to go and launch the pod. The last remaining member of West Team then reported in and informed Mosk of the additional casualty and the fact that Cassian was not alone. With Rael and Cassian heading toward Mosk's location, the sergeant ordered the last member of East Team to keep the targets flanked. On Karn's suggestion, Mosk then ordered West Team to split up and take positions around the intersection on Rix Road that they were in to prepare for Cassian and Rael's arrival. Mosk took the team's blaster rifle and set up on a roof terrace overlooking the intersection, taking a long pull from a flask as he waited.\nAfter North Team reported to Mosk that they were also in position, the locals suddenly ceased beating on their metal, causing Mosk to ready his weapon in the sudden silence. The sergeant's attention was then drawn to an explosion high on the scavenging facilities behind them, although he was uncertain of its cause, questioning if it was their targets. The explosion had in fact been North Team's Tac-Pod colliding with the structure after being sabotaged. Concerned that the explosion behind them meant that they were surrounded, Mosk swore. A landspeeder then launched from one of the buildings nearby and across the intersection, with Mosk and his men opening fire on the vehicle. Sustaining heavy fire, the speeder flipped onto its front as it reached North Team's location.\nCertain that they had their quarry, Karn glanced up at Mosk, who smiled back at him; however, a speeder bike carrying Rael and Cassian then emerged from the same building as the speeder and darted away in the opposite direction. Rael activated a device that detonated slap charges that the pair had hidden inside the empty landspeeder, and the exploding vehicle wiped out North Team. Mosk desperately tried to contact the downed men over comms, then rushed down to street level when he got no response. With the two targets long gone, Mosk called for bacta for the wounded men and then, using the callsign Delta-One, he called in for an evacuation from Nova as he ran to North Team. After helping one man up, he approached Karn, who stood motionless among the chaos, and told him that they needed to leave, shouting in the man's face when the Deputy Inspector did not react and then dragging him away.\nFollowing the incident, a report of what had happened reached the Imperial Security Bureau, and the entire Morlani system was placed under permanent Imperial authority, ending corporate independence. Imperial personnel arrived at Corporate Security Headquarters and began clearing it out, with Mosk, Karn, and Hyne being summoned to Hyne's office to meet with Lieutenant Supervisor Blevin, who managed the bureau's operations in the sector. As the three stood at attention, Blevin ordered them to immediately relinquish any comlinks, weapons, or scandocs, informing them that they would escorted from the headquarters to a transfer center, and would not be permitted to return to their living quarters. Any personnel items that the Imperial inspectors had had time to inventory would then be returned to them at the center, with the trio being required to holo-certify receipt of the items.\nThey would also be required to holo-certify confirmation of the official ISB After Action Report that detailed their involvement and culpability in the Ferrix incident, although Blevin stated they would not waste Imperial time by reading the report itself. Hyne then complained that he had not been involved in the incident, causing the Lieutenant Supervisor to berate the three for the idiocy, ineptitude, and total disengagement that had lead to the incident taking place. Mosk then raised his hand, but lowered it when Blevin questioned the action with disdain, before informing the trio of the Imperial takeover.\nMosk considered it a privilege to be roused in the middle of the night to work on the Andor case and believed there was no worthy substitute for velocity in the service of inspiring leadership. He believed Karn joining them during the arrest was a show of force that would boost morale among the men. He considered the murder of two of his colleges in the line of duty outrageous and believed anything other then full engagement on the case would be unconscionable, having seen such half-measures taken before and seeing them as a plague on discipline. He believed that the Tactical Forces needed to apply a stronger hand when dealing with affiliated planets like Ferrix, as he believed there to be pockets of fomenting among the populations there. He saw the Tactical Forces as the first line of the Empire's defense and so believed they must be used so that they were kept sharp.\nDespite Mosks' strict adherence to discipline, he was shown to care greatly for his men, and was always distressed to learn about his men being injured. When he was informed two men from one of his teams was injured in a firefight with Andor and Rael, Mosk began jogging to get to their location and provide help. When Mosk saw the North Team injured by the explosive-speeder Andor and Rael rigged, he immediately ran to their aid and began calling for bacta.\nMosk had a stocky build, blue eyes, and blond-graying hair with sideburns.\nAlex Ferns portrayed Linus Mosk in the television series Andor, with the character first appearing in the second episode, which aired on September 21, 2022. Prior to the episode's release, Mosk was visually revealed in the teaser trailer for the show and was then identified for the first time in the subtitles of the first full trailer, which aired on May 26 and August 1 of 2022 respectively.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Preox-Morlana",
  "/wiki/West_Team",
  "/wiki/Sergeant",
  "/wiki/Pre-Mor_Enforcement",
  "/wiki/Death",
  "/wiki/5_BBY",
  "/wiki/Corporate_Security_Headquarters",
  "/wiki/Planet",
  "/wiki/Morlana_One",
  "/wiki/Deputy_Inspector",
  "/wiki/Syril_Karn",
  "/wiki/Ferrix",
  "/wiki/Squad",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Preox-Morlana_personnel_carrier",
  "/wiki/Mobile_Tac-Pod",
  "/wiki/Andor_household",
  "/wiki/Parent",
  "/wiki/Maarva_Andor",
  "/wiki/Droid",
  "/wiki/B2EMO",
  "/wiki/Comlink",
  "/wiki/East_Team",
  "/wiki/Luthen_Rael",
  "/wiki/Rix_Road",
  "/wiki/North_Team",
  "/wiki/Landspeeder",
  "/wiki/Speeder",
  "/wiki/Speeder_bike",
  "/wiki/Galactic_Empire",
  "/wiki/Morlani_system",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Blevin",
  "/wiki/Corporate_Tactical_Forces",
  "/wiki/Imperial_Era",
  "/wiki/Standard_day",
  "/wiki/Kravas_Drezzer",
  "/wiki/Verlo_Skiff",
  "/wiki/Inspector",
  "/wiki/Chief_Inspector",
  "/wiki/Hyne",
  "/wiki/Starship",
  "/wiki/Hyperspace",
  "/wiki/Hologram",
  "/wiki/Holoprojector",
  "/wiki/Standard_month",
  "/wiki/Transport",
  "/wiki/West-3",
  "/wiki/West-4",
  "/wiki/Standard_minute",
  "/wiki/Wilmon_Paak",
  "/wiki/Salman_Paak",
  "/wiki/Timm_Karlo",
  "/wiki/North-3",
  "/wiki/North-1",
  "/wiki/East-1",
  "/wiki/Blaster_rifle",
  "/wiki/Bacta",
  "/wiki/Callsign",
  "/wiki/Sector",
  "/wiki/Scandoc",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Alex_Ferns",
  "/wiki/Andor_(television_series)",
  "/wiki/That_Would_Be_Me",
  "/wiki/September_21",
  "/wiki/2022",
  "/wiki/May_26",
  "/wiki/August_1",
  "/wiki/Category:Images_of_Linus_Mosk",
  "/wiki/Reckoning_(episode)",
  "/wiki/Aldhani_(episode)",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Kassa_(episode)"
 ]
}