{
 "name": "Lita",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ketzalian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ana Tolla's crew"
     ]
    }
   ]
  }
 ],
 "content": "Lita was a Ketzalian female member of the smuggler Ana Tolla's crew during the time of the war between the First Order and the Resistance. She was known for carrying sweets to share with her colleagues on missions, including java cakes. Around 34 ABY, Lita and Tolla's crew traveled to a cantina on the Outer Rim planet Actlyon following a mission. After receiving refreshments, Lita and the crew hastily departed Actlyon, leaving their colleague Izal Garsea behind per their leader's orders.\nFor their next mission, Lita and her colleagues traveled to the Outer Rim planet Batuu. On the day of their arrival on Batuu, Lita and Tolla hired the pilot Delta Jeet to locate the farmer Julen Rakab. After Jeet found Rakab, Lita and her colleagues abducted the farmer from Batuu's ancient ruins at the edge of Black Spire Outpost with the intention of using him to help destroy Kat Saka's farm. Lita provided Rakab with pants to wear to replace those he had left behind when captured.\nDuring the operation at the farm, Tolla assigned Lita to load crates onto a ship with the crew's second-in-command, the human-Twi'lek hybrid Safwan, and their colleague Damar Olin. After being attacked in the farm's storehouse by Rakab, whom the crew had abducted to assist with their objective, Lita attempted to flee with Safwan in Tolla's ship. However, Jeet prevented their escape to hyperspace by injuring both with a blaster.\nThe Ketzalian Lita was a member of the smuggler Ana Tolla's crew by the time of the war between the First Order and the Resistance. Around 34 ABY, Lita went on a mission with the crew and traveled with them to the Outer Rim planet Actlyon afterward. During the mission, and while on Actlyon, Lita shared java cakes with her colleagues Damar Olin and Izal Garsea. Olin consumed the last cake and was grateful that it staved off his hunger.\nAs the smugglers prepared for their next endeavor, Lita traveled with the crew to a cantina in Actlyon City on Actlyon. The crew enjoyed orders of refreshments at the cantina but soon rushed to escape as bounty hunters raided it. Lita then followed her colleagues back to Tolla's ship, leaving their former associate Garsea behind per their leader's orders. After leaving Actlyon, Lita and the crew headed to the Outer Rim planet Batuu for their next operation under Tolla's direction.\nThe day the smuggling crew arrived on Batuu, Lita and Tolla presented the pilot Delta Jeet with an offer to join their mission by helping locate the farmer Julen Rakab and his friend Garsea, with whom he had been keeping company following her abandonment by Tolla's crew. Jeet accepted the task for a fee of 1,000 credits and proceeded to track the pair to the ancient ruins at the edge of Black Spire Outpost. Tolla's crew, including Lita, apprehended Rakab with the intention of using him to help destroy Kat Saka's farm and allowed Jeet to seize Garsea as insurance that he would comply. However, Jeet later failed to deliver her to the crew after being convinced by Garsea that Tolla and Lita's earlier veneer of inclusion into their operation was a facade.\nFollowing their arrival at the farm, per Tolla's orders, Lita provided Rakab with a pair of loose green pants to replace the garments he had been forced to leave behind at the ruins. After Rakab assisted Tolla in accessing the farm's seed storehouse, Lita helped the crew's second-in-command, the human-Twi'lek hybrid Safwan, with lifting crates onto the crew's ship. Their colleague Damar Olin was assigned to watch over Rakab as the farmer assisted Lita and Safwan with their assigned tasks. Lita and Safwan worked slowly, hampered by the Ketzalian's short arms and the human-Twi'lek's injuries from riots in Black Spire Outpost.\nLita, Safwan, and Olin began to argue, leading the human-Twi'lek to pull rank on Olin and send him to prepare their ship for departure instead of being a distraction. After Olin left, Rakab attacked Lita and Safwan, shoving a crate at the latter's hurt shoulder. Safwan screamed in pain, and the farmer took the opportunity to steal his blaster and stun Lita, leaving the Ketzalian temporarily immobilized.\nAfter recovering from Rakab's attack, Lita and Safwan exited the seed storehouse and attempted to use Tolla's ship to flee the scene. Rakab tracked the pair to the vessel but proved unable to capture either. Lita sent a stack of crates toppling toward the farmer to slow him down and boarded Tolla's ship while he maneuvered around them. As the vessel was prepared for takeoff, Olin made it on board but was captured by Rakab before the ship could ascend.\nRakab gave Jeet the blaster he had stolen from Safwan, and she boarded the smugglers' ship. Lita and Safwan's efforts to escape to hyperspace were thwarted by Jeet, who injured both of them with a blaster, impeding their flight. Their aborted takeoff resulted in Rakab's recently purchased ship sustaining damage, which he got repaired after the skirmish. Following the mission at the farm, Lita's colleagues Oksan and Tolla were captured by the thugs of Oga Garra, the local crime boss of Batuu.\nLita possessed a persistently nervous demeanor, and her voice often took on a shrill tone because of it. Though willing to follow Ana Tolla's orders in abducting Julen Rakab, she treated him relatively cordially compared to the rest of her crew. Lita often carried sweets with her on missions to share with her crewmates, which they enjoyed immensely. However, after being abandoned by Tolla's crew, Izal Garsea reflected that the Ketzalian's generosity may have been a pretense to court favor. Although Lita shared a workable affinity with the crew's second-in-command, Safwan, she quickly became annoyed with her colleague Damar Olin's antagonizing of Julen Rakab. Lita was willing to leave Tolla, Oksan, and Olin behind to escape Kat Saka's farm with Safwan when their mission on Batuu failed.\nLita was a Ketzalian female who had thick purple wings, which outwardly appeared filmy. Her head was shaped like a humanoid's, and she had waxy, plum-colored head feathers in lieu of hair. Lita was small in stature and possessed reptilian features similar to a lizard's, a tail, and short arms. She spoke Basic.\nLita's wings gave her the capability to fly, which was a skill she used to glide above the wall surrounding Saka's farm during her crew's mission on Batuu.\nLita appeared in A Crash of Fate, a 2019 young-adult novel written by Zoraida Córdova. Córdova had originally intended for Lita to be a bird-like species already in existence within the Star Wars universe. However, that species' appearance in the then-upcoming themed attraction Star Wars: Galaxy's Edge led Walt Disney Imagineering and Lucasfilm to decide that the presented overlap between it and A Crash of Fate could potentially prove confusing to park visitors. Córdova was permitted to create a new species specifically catering to the story's needs for Lita, which the author eventually called Ketzalians.\nCórdova felt Lita's endearing demeanor helped her fit within the dynamic of Ana Tolla's crew, while still possessing unusual qualities. She felt strongly that Ketzalians needed the ability to fly and gave Lita wings with that capability. Córdova's design of Lita was intended to represent a cross between a dinosaur and a bird.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Ketzalian",
  "/wiki/Gender",
  "/wiki/Ana_Tolla%27s_crew",
  "/wiki/File:SafwanLitaOlin.ogg",
  "/wiki/Smuggler",
  "/wiki/Ana_Tolla",
  "/wiki/Time",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Java_cake",
  "/wiki/34_ABY",
  "/wiki/Unidentified_cantina_(Actlyon)",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Actlyon",
  "/wiki/Izal_Garsea",
  "/wiki/Batuu",
  "/wiki/Standard_day",
  "/wiki/Pilot",
  "/wiki/Delta_Jeet",
  "/wiki/Farmer",
  "/wiki/Julen_Rakab",
  "/wiki/Black_Spire_Ruins",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Skirmish_at_Kat_Saka%27s_farm",
  "/wiki/Kat_Saka",
  "/wiki/Saka_Homestead",
  "/wiki/Farm",
  "/wiki/Starship",
  "/wiki/Human",
  "/wiki/Twi%27lek",
  "/wiki/Hybrid",
  "/wiki/Safwan",
  "/wiki/Damar_Olin",
  "/wiki/Ana_Tolla%27s_ship",
  "/wiki/Hyperspace",
  "/wiki/Blaster",
  "/wiki/File:Lita1.ogg",
  "/wiki/Cake",
  "/wiki/Actlyon_City",
  "/wiki/Cantina",
  "/wiki/Bounty_hunter",
  "/wiki/File:Lita2.ogg",
  "/wiki/Credit",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Seed",
  "/wiki/Limb",
  "/wiki/Stun",
  "/wiki/Julen_Rakab%27s_Avent100-series_light_freighter",
  "/wiki/Oksan",
  "/wiki/Oga_Garra",
  "/wiki/Crime_lord",
  "/wiki/File:Lita3.ogg",
  "/wiki/Humanoid",
  "/wiki/Hair",
  "/wiki/Reptile",
  "/wiki/Lizard",
  "/wiki/Language",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/File:Lita-BTS.ogg",
  "/wiki/A_Crash_of_Fate",
  "/wiki/2019",
  "/wiki/Zoraida_C%C3%B3rdova",
  "/wiki/Bird",
  "/wiki/Species",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Walt_Disney_Imagineering",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/A_Crash_of_Fate_(audiobook)",
  "/wiki/Category:Audio_files_of_Lita",
  "/wiki/Standard_month",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/November_29",
  "/wiki/February_18",
  "/wiki/2020"
 ]
}