{
 "name": "Livette",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hapes"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hapan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hapes Consortium",
      "Jedi Coalition"
     ]
    }
   ]
  }
 ],
 "content": "Livette was a stern-jawed Hapan who did not bother with the usual Hapan vanities. She made a principle of leaving her gray hair and an old blaster wound burn across her cheek unaltered. She was a General in charge of Her Majesty's Select Commandos, a Hapan Special forces unit that served the Queen Mother on Shedu Maad, a Hapan world. She was also suspected of helping Remnant troops by giving them the location of a secret hangar.\nIn 40 ABY, Trista Zel, an officer in Hapan Security, ordered Livette to open a comlink channel to the Hapan Battle Dragon in orbit, the Deserving Gem, and have the communications officer put her through to Ducha Requud, a Ducha third in line for the Hapan royal throne. Livette obeyed and opened the channel. What was heard on the other end was Requud begging for her life. Livette mentioned that she had heard reports of a female Jedi penetrating the Jedi Coalition's perimeter with a squad of Elite Guard stormtroopers.\nTrista and her twin sister Taryn Zel both suspected that Livette had given the Imperial Remnant the location of a hidden shaft that provided access to an underground hangar, where the Jedi starfighters were refueled and rearmed on Shedu Maad. They also suspected that Livette authorized the penetration of their perimeter.\nTrista stayed behind to protect Livette in the happenstance that Taryn and Ben Skywalker, Jedi Knight and son of Luke Skywalker, ran into problems with dealing with the Remnant's stormtroopers. She did not want a repeat of Ducha Requud's unfortunate \"accident\"—her death because of her betrayal to the Queen Mother.\nLivette subsequently proposed that Taryn and Ben take a squad of Her Majesty's Commandos.\nLivette was a lifelong soldier serving for her homeworld of Hapes. Her loyalties lay strictly with the legitimate successor to Her Majesty Tenel Ka Djo, assuming there was ever a need for a successor.\nEven though she was loyal to the title of Queen Mother, she had no qualms betraying Tenel Ka by authorizing the Imperial Remnant to penetrate the Coalition perimeter on Shedu Maad.\nIn an unusual trait for a Hapan, Livette did not bother enhancing or altering her looks. She left her hair gray instead of dying it red, which was the Hapan natural hair color, and left an old blaster wound scar across her cheek plainly visible as medals of honor.\nLivette's first and only appearance was in the 2008 novel Legacy of the Force: Invincible by author Troy Denning. Livette's character is one of the minor characters portrayed in the novel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hapes/Legends",
  "/wiki/Hapan",
  "/wiki/Gender/Legends",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Jedi_Coalition",
  "/wiki/General/Legends",
  "/wiki/Her_Majesty%27s_Select_Commandos",
  "/wiki/Special_forces/Legends",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Shedu_Maad",
  "/wiki/40_ABY",
  "/wiki/Trista_Zel",
  "/wiki/Hapan_Security",
  "/wiki/Comlink/Legends",
  "/wiki/Hapan_Battle_Dragon",
  "/wiki/Orbit/Legends",
  "/wiki/Deserving_Gem",
  "/wiki/Ducha",
  "/wiki/Requud",
  "/wiki/Tahiri_Veila",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Taryn_Zel",
  "/wiki/Imperial_Remnant",
  "/wiki/StealthX",
  "/wiki/Ben_Skywalker",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/2008",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/Troy_Denning",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}