{
 "name": "Liviani_Sarno",
 "display_name": "Liviani Sarno",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Euceron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Euceron"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Games Council on Euceron"
     ]
    }
   ]
  }
 ],
 "content": "Liviani Sarno was the head of the Galactic Games Council on Euceron in 26 BBY.\nSarno was a tall female Euceron, who enjoyed elaborate dress. During the Galactic Games, she was seen dressed in a brilliant scarlet veda cloth robe embroidered with orange and gold septsilk thread. Her hair was wound into a crown of braids, woven with bright, conspicuous jewels. The vain Sarno was often found in the company of fellow Council member Bog Divinian, Didi Oddo and Astri Oddo Divinian in Euceron's capital city, Eusebus.\nAssigned a mission to the planet with two other Jedi teams , Obi-Wan Kenobi and his Padawan Anakin Skywalker discovered that Sarno and celebrated former Games champion and Council member Maxo Vista were \"fixing\" the Galactic Games on behalf of the Commerce Guild to malign its opponents in the Galactic Senate. False bets were placed in the opposing Senators names to later disgrace them.\nAlso rigged by Sarno and Vista was the illegal Podrace at the Great Dordon Caves at the northern outskirts of Eusebus. While Vista sabotaged the podracer piloted by Skywalker to make its steering system fail through its nav computer, Sarno was positioned near the grandstands to activate a datapad \"backup system\" by hand, to ensure the success of a mass-spectator disaster should Vista's pod programming fail. Skywalker, however, guided by the Force, shut off his pod's nav computer in the race's final moments, using only the guiding Force and the power of his engines to win the race and prevent disaster.\nSarno and Vista, who denied all charges against their sinister complicity throughout the Games, were later set free, in the criminal hearing by the planet's Ruling Power, when Kenobi failed to produce key witnesses .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Euceron",
  "/wiki/Euceron_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Games_Council",
  "/wiki/26_BBY/Legends",
  "/wiki/Galactic_Games/Legends",
  "/wiki/Veda_cloth/Legends",
  "/wiki/Septsilk/Legends",
  "/wiki/Bog_Divinian",
  "/wiki/Didi_Oddo",
  "/wiki/Astri_Oddo_Divinian",
  "/wiki/Eusebus",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Maxo_Vista",
  "/wiki/Commerce_Guild/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Great_Dordon_Caves",
  "/wiki/Podracer/Legends",
  "/wiki/Nav_computer",
  "/wiki/Datapad/Legends",
  "/wiki/The_Force",
  "/wiki/Ruling_Power",
  "/wiki/Aarno_Dering",
  "/wiki/Fligh",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Liviani_Sarno",
  "/wiki/Jedi_Quest:_The_Dangerous_Games"
 ]
}