{
 "name": "Lliegis%27Nevz",
 "display_name": "Lliegis'Nevz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kian'thar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "HyperDive Cantina"
     ]
    }
   ]
  }
 ],
 "content": "Lliegis'Nevz was a male Kian'thar who worked as the bartender for the HyperDive Cantina. His natural Kian'thar abilities allowed him to better interact with customers.\nPeople found Lliegis'Nevz a wonderful listener and very easy to talk to. He had an elegantly soft voice that demanded attention. He was patient, kind, and comforting who never raised his voice or lost his temper. He had a penetrating gaze that many found mesmerizing. Like other Kian'thar he had large deep-set watery eyes that seemed very wise to viewers.\nLliegis'Nevz was very perceptive and combined with his species abilities to read emotions allowed him to be incredibly perceptive about his customers to the point that many thought he was a mind reader. In addition he was a fearsome combatant with his Kin'tya blade.\nHe carried a Kin'tya blade as well as a blaster pistol. He also had a medallion with his family crest on it.\nLliegis'Nevz appeared in Wretched Hives of Scum \u0026 Villainy, a supplement for Star Wars: The Roleplaying Game published by West End Games in 1997. The supplement was written by Paul Danner. He was illustrated by Joel Carroll.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kian%27thar",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fathoms",
  "/wiki/HyperDive_Cantina",
  "/wiki/Kin%27tya_blade",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Paul_Danner",
  "/wiki/Joel_Carroll",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}