{
 "name": "Lo_Bukk",
 "display_name": "Lo Bukk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Ni-Cada"
     ]
    }
   ]
  }
 ],
 "content": "Lo Bukk was a Zabrak male who served the Jedi Order as a Padawan during the final decades of the Galactic Republic. Around 67 BBY, he and his Jedi Master, Ni-Cada, were sent by the Order to the world of Abraxin to investigate the continuous killing of marsh haunts, which were being carried out by the Force-sensitive Nautolan Naat Lare. On the planet the Jedi unknowingly crossed paths with the Muun Sith Lord Darth Plagueis, who was also looking for Lare. After Plagueis managed to make contact with Lare, the Muun convinced him into taking the offense against the Jedi as proof of his worthiness to join the Sith; the resulting skirmish was short, in which Bukk's Master killed Lare.\nLo Bukk was a male Force-sensitive Zabrak Jedi Padawan of Master Ni-Cada who served the Jedi Order and the Galactic Republic forty-five years before the Clone Wars, a series of conflicts fought between the Republic and the Confederacy of Independent Systems. He and Ni-Cada were sent by the Order to the swampy planet Abraxin in the Tion Cluster, to investigate the continuous killing of non-sentient marsh haunts, who were red-eyed, gray-and-green-skinned creatures. The marsh haunt killings were committed by Naat Lare, a Force-sensitive Nautolan. Lare had been selected by Darth Venamis, a prospective male Bith Sith Lord of the lineage of Darth Bane, as a potential Sith apprentice.\nDuring their stay on Abraxin, the Muun Sith Lord Darth Plagueis passed by Bukk and Ni-Cada disguised while the Jedi were bargaining with a member of the Barabel species—cold-blooded reptilians from the world Barab I— for a water skimmer. Both of them felt Plagueis' presence, though neither identified him as a Sith, an order of Force-sensitives who utilized the dark side of the Force. Later, as Bukk and his master emerged from an eatery bearing flagons of liquid, they unknowingly crossed paths with Darth Plagueis once again, and later talked with the Muun, who was also looking for Lare, as they sat at a table and discussed with the Muun about the recent killing of marsh haunts. Plagueis managed to make contact with Lare and convinced him into striking against the Bukk and his master as proof of Lare's worthiness to join the Sith. The Jedi tracked Lare with the skimmer, and a short skirmish ensued after the Nautolan attacked the two near the water, during which Lare was killed by Bukk's master.\nLo Bukk had a more of a open attitude than his master, as he easily divulged the nature of the Jedi's mission to Plagueis, though his master tried to hide the reason of their mission. When the Muun Sith Lord Darth Plagueis passed by under disguise, both Ni-Cada and Lo Bukk felt Plagueis' presence, though neither of them identified him as a Sith, a sect of Force-sensitives who utilized the dark side of the Force.\nLo Bukk's first and currently only appearance to date is the 2012 novel Darth Plagueis, written by James Luceno. The novel tells the backstory of Darth Plagueis. Though not confirmed in the novel, Lo Bukk was possibly named after the Bukk animal, as many Zabrak families were named after them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Ni-Cada",
  "/wiki/Padawan/Legends",
  "/wiki/67_BBY",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Abraxin",
  "/wiki/Marsh_haunt",
  "/wiki/The_Force/Legends",
  "/wiki/Nautolan/Legends",
  "/wiki/Naat_Lare",
  "/wiki/Jedi/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Duel_on_Abraxin",
  "/wiki/Death/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Tion_Cluster/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Darth_Venamis",
  "/wiki/Bith/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Unidentified_Barabel_(Abraxin)",
  "/wiki/Barabel/Legends",
  "/wiki/Species/Legends",
  "/wiki/Barab_I/Legends",
  "/wiki/Water/Legends",
  "/wiki/Skimmer/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/2012",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/James_Luceno",
  "/wiki/Bukk",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galactic_Campaign_Guide"
 ]
}