{
 "name": "Lobax Resuun",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lobax Resuun was the sector governor of the Tamarin sector during the Galactic Civil War.\nGovernor Resuun was in charge of his sector when chaos erupted in the Tamarin sector following the Battle of Endor. Challenged by fledgling planetary governments, Governor Resuun was also forced to struggle against the demoralization of the remaining Imperial forces and the expending criminality. Organized crime had grown to a powerful economizing military force throughout the sector. The governor's headquarters and the sectorial government were eventually relocated to the Imperial-class Star Destroyer Retribution.\nUndaunted, Governor Resuun managed to maintained enough power and influence to avoid any open revolution against the Empire until the actions of Sard Nightbringer, the most powerful crime lord of the sector. She was determined to force the Empire out of the sector and take over the government. Nightbringer managed to invade the Imperial Research and Development Station T-1583 and steal experimental technology. Resuun hired a group of smugglers to infiltrate her organization but she was eventually killed by her second.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Tamarin_sector",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Retribution_(Imperial-class)",
  "/wiki/Sard_Nightbringer",
  "/wiki/Crime_lord/Legends",
  "/wiki/Imperial_Research_and_Development_Station_T-1583",
  "/wiki/Smuggler/Legends",
  "/wiki/Marg_Sonat",
  "/wiki/West_End_Games",
  "/wiki/The_Art_of_Betrayal",
  "/wiki/The_Politics_of_Contraband",
  "/wiki/Classic_Adventures"
 ]
}