{
 "name": "Lobarorr",
 "display_name": "Lobarorr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY–3 ABY",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "Lobarorr was a male Wookiee who lived on the planet Kashyyyk during the Galactic Civil War. Sometime after the Battle of Yavin, he and his friend Takook decided to take a trip to the Rryatt Trail. During their trip, Lobarorr became jealous of Takook's spear, a Kashyyyk bladestick that belonged to Takook's father, Chatook. In a fit of jealous rage, Lobarorr attacked Takook, taking the weapon and fleeing to the Rryatt Trail to hide. Sometime later, a spacer hired by a concerned Chatook found Takook's corpse and a message he had recorded just before his death. The spacer located Lobarorr at his hiding place and killed him, reclaiming the bladestick from his body.\nA Wookiee male, Lobarorr lived on his species' homeworld of Kashyyyk during the Galactic Civil War. Sometime after the Battle of Yavin, Lobarorr and his fellow Wookiee and friend Takook decided to take a trip to the Rryatt Trail, a local wilderness path. During their trip, Lobarorr became jealous of Takook's weapon, a Kashyyyk bladestick belonging to Takook's father, Chatook. Overcome by these feelings, Lobarorr attacked and mortally wounded Takook, taking the weapon and fleeing to a secret hiding spot in the Shadowlands of the Rryatt Trail.\nSometime afterward, Takook's father, Chatook, became worried that his son had not returned yet and feared the worst. The Wookiee hired a spacer visiting Kashyyyk to find his son and bring him home. He told the spacer all he knew, including that Lobarorr and Takook were headed toward the Rryatt Trail. During the search, the spacer found Takook's corpse less than halfway toward the Rryatt Trail, along with a recorded message. Takook had recorded it before his death, and, in it, he pleaded with whomever found it to find Lobarorr and retrieve his father's spear.\nThe spacer set off for the Rryatt Trail and searched the winding path in its entirety until arriving at the Shadowlands, where the individual found Lobarorr hiding. The Wookiee said nothing and attacked the spacer on sight. The spacer was forced to kill Lobarorr and retrieve the weapon from his corpse. The spacer returned to Chatook and told him what had happened. Overcome by grief, he gave the spacer 2,500 and told the being to keep the bladestick.\nLobarorr's jealousy of his friend Takook's bladestick led him to kill his fellow Wookiee. This action eventually led to his own death. He had dark brown fur and yellow eyes.\nLobarorr's singular appearance in canon is in Rage of the Wookiees, a 2005 expansion pack to the video game Star Wars Galaxies. His death is the final objective of the \"Find Missing Son\" quest within the game, and, while the player is not required to complete this quest, this article assumes 100 percent game completion. Lobarorr always spawns in the same spot at the bottom of the Rryatt Trail and may be attacked and killed by any player, even if the player is not on the related quest.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kashyyyk/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Takook",
  "/wiki/Rryatt_Trail",
  "/wiki/Spear/Legends",
  "/wiki/Kashyyyk_bladestick",
  "/wiki/Parent/Legends",
  "/wiki/Chatook",
  "/wiki/Spacer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Shadowlands/Legends",
  "/wiki/Canon",
  "/wiki/Credit",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/2005",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide"
 ]
}