{
 "name": "Lobar_Aybock",
 "display_name": "Lobar Aybock",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shiva IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Calian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Lobar \"Ion Fist\" Aybock was a male Calian from Shiva IV. During the Galactic Civil War, Aybock was captured by Imperial forces during the destruction of his hometown of K'avor. Deemed unworthy to be a stormtrooper, Aybock was put into the service of Zygerrian slavers. Shortly afterward, a Chevin by the name of Eedund Cus purchased Aybock's freedom and trained him in the art of shockboxing, hoping to make a successful investment after seeing the natural fighter in him. With the help of Cus, his trainer, and Stitchy, his medic, Aybock went on to become a champion shockboxer. During the time of the New Republic, Aybock helped New Republic Intelligence overthrow the Reuss Corporation's hold on the populace of Reuss VIII by fighting in a deadly match against the Barabel Tull Raine.\nLobar Aybock was a male Calian born in K'avor, a city on the Wild Space planet of Shiva IV. He grew up on the unstable, primitive world, which endured a constant state of war between the Calian Confederacy and the Twelve Tribes of T'Syriél, during which many Calians, Lobar Aybock's father included, fought in continuous engagements with the T'Syriél. The wars on Shiva IV lasted until Calian leader Aron Peacebringer and Demarch of the Twelve Tribes, Kéral Longknife, signed the Concordat of Peace circa 2 ABY.\nOne year later, Imperial General Bentilais san Sk'ar paid a visit to Shiva IV, on a mission dictated by Emperor Palpatine, to bring order to outlying worlds. The Empire conscripted many T'Syriél into its ranks, then made an example of the feral Calians by bombing K'avor. After the bombing of his hometown, the Imperials captured Aybock and other Calians in an attempt to convert members of their warrior race into soldiers for the Empire as well. Imperial agents performed a variety of tests on Aybock, until they judged the Calians unfit to be stormtroopers. He was then handed off to Zygerrian slavers. Eedund Cus, a Chevin, eventually purchased Aybock's freedom, whereupon he trained him in shockboxing and taught the Calian Aurebesh and Basic.\nWith the training of Eedund Cus, Aybock became a successful shockboxer, fighting in sixty-four bouts on a variety of worlds, in which he compiled a record of 58-6. As his medic, Aybock took on an accomplished Gungan named Stitchy, former court physician to Queen Apailana of Naboo. Traditionally, Aybock chose to stay at hotels relatively close to his shockboxing matches, so that he could run to the arena to get pumped up before the fight, regardless of the weather. At one point during his career, he faced the Esoomian Tontruk on the resort planet Vycinyth, where he defeated his opponent in the second phase. The shield on Tontruk's armor dropped, allowing Aybock to land a hit with an ion-charged shockmitt, ionizing Tontruk's armor and resulting in an ion-out.\nSome time after the formation of the New Republic in 5 ABY, Aybock agreed to a contract with the Reussi Torel Vorne and the Reuss Corporation over the biggest fight of his life, in which he would face off in a title match against the Barabel shockboxer Tull Raine on the planet Reuss VIII, in the Portmoak sector. Raine, although previously defeated in an amateur-level challenge, had since remained undefeated in title contests. Hidden within the discourse of Vorne's contract, a clause stated that if Aybock were to die in his fight, his body would become the property of the Reuss Corporation, and thereby the property of Torel Vorne. Prior to the duel, Vorne privately auctioned off Aybock's organs with the expectation that the boxer would die in the fight. Vorne sold off each piece of Aybock's body, with his lungs set to go to the sector's Imperial Moff, Ammar. In order to further ensure Aybock's death, Vorne set up a slicer who was to disable the shielding hub on Aybock's GolanGear armor during the middle of the shockboxing match.\nUpon learning of the cadaver clause in Aybock's contract from Resik, the bartender at the Broken Tusk where the fight was scheduled to take place, Eedund Cus insisted they leave the planet immediately. On their way out, Cus and Aybock planned to meet up with Stitchy, but the Gungan was, surprisingly, in a crowded speedervan with several other figures. Aybock and Cus boarded the speedervan, which was occupied by, amongst others, Major Bren Derlin of New Republic Intelligence. Derlin, who had been with the Rebels since the Battle of Nentan, presented Aybock and his companions with intelligence about Torel Vorne's organ racketeering operation. As further incentive, Derlin and one of his companions, Mygo Skinto, appealed to their sense of decency in helping the planet's desperate locals, often referred to as Rust Rats. Derlin pitched a plan to circumvent Vorne's slicing efforts by introducing their own slicer, Sergeant Dansra Beezer. Furthermore, it would allow the New Republic to suspend the operations of the Reuss Corporation, which had laid waste to the planet's citizens and environment over the last twenty years. Aybock agreed to help Derlin, but only on the condition that the fight with Raine be a fair one, and that he be given no advantage by Beezer.\nThe day of his match against Raine, Aybock ran to the Dool Arena at the Broken Tusk in his Aleemas, a breath mask, and an exposure suit, while Rust Rats cheered him on. He fought through nine brutal phases against Tull Raine, unsure if the New Republic slicer would be successful against the sabotage efforts of Vorne. Then, teetering on the edge of his strength, Aybock was overcome with the ryastraad—a battle madness famous of his people—when he heard the local Reussi chanting his name during the tenth and final phase. Buoyed by their support, Aybock sent Tull flying out of the shockboxing wedge with a crushing hub-buster to end the showdown. Afterward, Aybock donated the winner's purse to the Rust Rats to help with their relief effort.\nWhile originally born in the Shiva system, Aybock moved to Chandrila subsequent to his Imperial captivity and later enslavement at the hands of the Zygerrians. Aybock held Ponderweight Division Shockboxing sashes for both the Mid and Outer Rim. In 6 ABY, some time following his victory over Tull Raine at the Broken Tusk, Aybock published his autobiography, entitled Fists Of Ion: Memoirs Of A Champion Shockboxer. One year later, zZip Product Concepts Limited endorsed Aybock by putting his name on a luxury speeder, the 42-Aybock Ion. He continued to fight in shockboxing tournaments and was ranked the top contender in the Pangalactic Championship scheduled for 7 ABY. He finally retired in 9 ABY and finishing with a record of 72-8.\nGrowing up, Lobar Aybock was constantly surrounded by fighting and violence between the Calians and T'Syriél native to his homeworld, Shiva IV. At some point in his life, the Empire bombed his hometown, captured Aybock, and subjected him to a multitude of tests, before turning him over to Zygerrian slavers with the degrading comment that he was unfit to be a stormtrooper. As a result of the strife Aybock faced, he felt that there was only one way to deal with life and the challenges it threw at him: through violence. Although he never had the opportunity to strike back at his tormentors, including the T'Syriél, Imperials, and slavers, Aybock learned to take out his anger on fellow combatants in the sport of shockboxing. Members of the Calian race were known for their natural fighting skills, and Lobar Aybock's people had a word—ryastraad—for the extreme violence, or battle madness, that sometimes overcame them, such as during Aybock's fight against Raine.\nFurthermore, when presented with the information that Torel Vorne and Raine were planning to rig the title match on Reuss VIII, Aybock insisted on having a fair fight, both ways, instead of having the slicer Sergeant Dansra Beezer fix the fight so that he would win. He was willing to put his life on the line for this fight, with no guarantee of safety from Beezer, in order to help Major Derlin's plan to overthrow the Reuss Corporation and aid the Rust Rats.\nLobar Aybock was created by \"What's The Story?\" author Edward M. Erdelac for his official Star Wars authorial debut in the Hyperspace-exclusive short story Fists of Ion. The story of Aybock was inspired in part by Rocky Balboa, and his name is in fact a tuckerization of Sylvester Stallone's character from the 1976 boxing film Rocky. While most of the background story information for Aybock comes from 1990s Star Wars sources such as West End Games' Cracken's Rebel Operatives and Wayne Humfleet's original description of shockboxing in Heroes \u0026 Rogues, Erdelac derived underlying motifs from the societal impact of the June 22, 1938 rematch between African American Joe Louis and German Aryan Max Schmeling. In Fists of Ion, Erdelac places Lobar Aybock on the side of Joe Louis, whereas the Barabel Tull Raine takes Max Schmeling's role.\nDespite being described as a red-skinned Calian in the text, the story's illustrations incorrectly portray the character as a pale-skinned Human.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Shiva_IV",
  "/wiki/Calian",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Red",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Destruction_of_K%27avor",
  "/wiki/City/Legends",
  "/wiki/K%27avor",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Zygerrian/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Chevin/Legends",
  "/wiki/Eedund_Cus",
  "/wiki/Shockboxing/Legends",
  "/wiki/Stitchy",
  "/wiki/Medic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Reuss_Corporation",
  "/wiki/Reuss_VIII",
  "/wiki/Barabel/Legends",
  "/wiki/Tull_Raine",
  "/wiki/Wild_Space/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Calian_Confederacy",
  "/wiki/Twelve_Tribes_of_T%27Syri%C3%A9l",
  "/wiki/Lobar_Aybock%27s_father",
  "/wiki/T%27Syri%C3%A9l",
  "/wiki/Aron_Peacebringer",
  "/wiki/Demarch",
  "/wiki/K%C3%A9ral_Longknife",
  "/wiki/Concordat_of_Peace",
  "/wiki/2_ABY/Legends",
  "/wiki/General/Legends",
  "/wiki/Bentilais_san_Sk%27ar",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Anti-matter_bomb",
  "/wiki/Aurebesh/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Apailana/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Hotel/Legends",
  "/wiki/Esoomian/Legends",
  "/wiki/Tontruk",
  "/wiki/Vycinyth",
  "/wiki/Armor/Legends",
  "/wiki/Shockmitt",
  "/wiki/Declaration_of_a_New_Republic/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Reussi",
  "/wiki/Torel_Vorne",
  "/wiki/Portmoak_sector",
  "/wiki/Lung/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Ammar",
  "/wiki/Death/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Hub",
  "/wiki/GolanGear",
  "/wiki/Resik_(Jillsarian)",
  "/wiki/Bartender/Legends",
  "/wiki/The_Broken_Tusk_(Reuss_VIII)",
  "/wiki/Speedervan",
  "/wiki/Major/Legends",
  "/wiki/Bren_Derlin/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Nentan",
  "/wiki/Mygo_Skinto",
  "/wiki/Rust_Rats",
  "/wiki/Sergeant/Legends",
  "/wiki/Dansra_Beezer",
  "/wiki/Dool_Arena",
  "/wiki/Aleemas",
  "/wiki/Roamer-6_breath_mask",
  "/wiki/Exposure_suit",
  "/wiki/Ryastraad",
  "/wiki/Hub-buster",
  "/wiki/Shiva_system",
  "/wiki/Chandrila/Legends",
  "/wiki/Ponderweight_Division_Shockboxing_sash",
  "/wiki/Mid_Rim",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Fists_Of_Ion:_Memoirs_Of_A_Champion_Shockboxer",
  "/wiki/ZZip_Product_Concepts_Limited",
  "/wiki/Speeder_truck/Legends",
  "/wiki/42-Aybock_Ion",
  "/wiki/Pangalactic_Championship",
  "/wiki/7_ABY/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Edward_M._Erdelac",
  "/wiki/Star_Wars",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Fists_of_Ion",
  "/wiki/Tuckerization",
  "/wiki/1976",
  "/wiki/West_End_Games",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Wayne_Humfleet",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/June_22",
  "/wiki/1930s",
  "/wiki/Human/Legends",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Cat_Staggs",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Star_Wars_(1977)_53",
  "/wiki/Databank_(original)",
  "/wiki/Aliens_in_the_Empire",
  "/wiki/Lords_of_the_Expanse",
  "/wiki/Lobar_Aybock/interview",
  "/wiki/Wookieepedia:Interviews"
 ]
}