{
 "name": "Lobot",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bespin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "AJ^6 cyborg construct"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military",
      "Cloud City",
      "Alliance to Restore the Republic",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Lobot, also known by the nickname Lo, was a male human from the planet Bespin who, with the assistance of his AJ^6 cyborg construct, was paid to run battlefield calculations for the Galactic Empire. However, he eventually began working with the smuggler Lando Calrissian aboard the Millennium Falcon, running numerous criminal jobs. During one job, the theft of the Emperor's personal yacht, Lobot was gravely wounded by an Imperial Guard. In his injured state, Lobot's mind was lost and his cybernetic implants took over.\nIn the time to come, Calrissian became Baron Administrator of Cloud City on Lobot's homeworld of Bespin, and Lobot served as his aide and chef. As the city's computer-liaison officer, his implants enabled him to communicate with the city's central network. During the Empire's takeover of Cloud City, Lando ordered Lobot to gather their security forces to outflank the stormtroopers. Although they successfully helped evacuate the city by rounding up the stormtroopers, the city soon fell to the Empire and Lobot was captured.\nFollowing the Empire's defeat at the Battle of Endor, Imperial Governor Ubrik Adelhard tightened his grip on the Anoat sector, home to Bespin, forming the Iron Blockade. Receiving support from the New Republic, Lobot fought to liberate his homeworld.\nDuring the Galactic Civil War between the Galactic Empire and Alliance to Restore the Republic, Lobot, a male human from Bespin, was hired by the Empire to run battlefield calculations. In order to do so, he allowed the Imperials to implant an AJ^6 cyborg construct to his brain, exchanging some of his personality for increased productivity. Eventually leaving the Empire, Lobot became a smuggler and formed a friendship with fellow smuggler Lando Calrissian, owner of the Millennium Falcon, and Chanath Cha, a bounty hunter. They remained friends for years, and Lobot and Cha fell in love. Nonetheless, Calrissian and Cha went separate ways, and Lobot chose to remain with Lando. At some point during their underground operations, Lando lost the Millennium Falcon to another old friend of his, Han Solo, in a game of sabacc.\nSome time after the Battle of Yavin, Lobot and Calrissian found themselves in deep debt to Papa Toren, a crime boss who operated off of the Imperial world Castell in the Colonies region of the galaxy. Calrissian, in order to pay off the debt, went to steal a valuable object from the Imperial governor of the sector: Moff Ssaria, known as the \"Fiend of Castell\" and the \"Burning Moff.\" However, instead of just stealing the trinket and running, Calrissian suavely manipulated the Moff into giving it to him; Calrissian soon told the story to Lobot when they met in Toren's cantina. Lobot was shocked at the risks his partner took, adding that his implants gleaned that the odds of that working were about one in ten thousand. The gambler replied that he didn't like to know the odds, and explained that he had done what he did because he didn't want the Moff hunting them. Lobot was assured by his partner that they were debt free after he traded the trinket to Toren, and Lando then went to speak with the crime boss. He returned a few minutes later with news: ten percent of their debt had been wiped away, and he had a chance at one \"hell of a score.\" Lobot was appalled that only ten percent of their debt had been cleared and demanded to know what had gone wrong. Calrissian explained that things had not gone as planned, but still had gone well, given the new job. Lobot, however, did not share Calrissian's optimism and believed they should fight Toren. Calrissian did not, adding that Lobot had the cyborg construct implanted so he wouldn't have to fight, just analyze battlefront movements from afar. Lobot gave in, so they began preparations for the job.\nThe duo first recruited the cloned hand-to-hand combat experts Aleksin and Pavol in case they did need to fight, and next, the Ugnaught antiquities expert, Sava Korin Pers, whom they met in her office. Pers pulled a blaster on Calrissian when he entered; the last time they had worked together, Pers lost an eye. Pers eventually agreed to assist in the job after seeing the ease and the payoff. Soon, the team of five made their way to Sienar Fleet Systems Orbital Shipyard CC-24 in orbit over Castell, which the team infiltrated using stealth suits. They quickly secured a portion of the shipyard, hijacked an Imperial pleasure craft that they believed had belonged to an Imperial art collector, and blasted away from the station. Calrissian piloted the ship, the Imperialis, while Lobot acted as his co-pilot. Lobot was unsure of Calrissian's rejoicing in escaping so easily; Lobot believed there was still trouble to come.\nLobot was soon proven correct when a trio of Imperial-class Star Destroyers emerged from hyperspace near the Imperialis. Lobot grew frustrated as the \"easy score\" that Calrissian had promised began to disappear. Calrissian argued that it was a good thing that the Star Destroyers arrived; it meant the ship was incredibly valuable to its owner—who, unknown to Lobot and his fellows, was none other than Galactic Emperor Sheev Palpatine. The Star Destroyers dropped gravity-based mines to prevent the Imperialis from entering hyperspace, but the yacht's automated defenses destroyed the mines. When the Star Destroyers captained by Shan and Conro activated tractor beams to reclaim the vessel, Lando had Lobot upload the ships' coordinates to Lando's piloting computer. With the coordinates uploaded, Lando piloted the Imperialis between the two Star Destroyers, causing them to lock onto each other. Unable to disengage in time, the capital ships collided, giving the Imperialis the opportunity to jump to hyperspace. Free from the Castell system, Lando and Lobot were approached by Sava Korin, who said the yacht was filled with treasure. Touring the crew around, Korin explained that one area of the ship, the central chamber, was very well secured, so Lobot volunteered to open the sealed door with his implants. When he did, however, he was confronted by a pair of Imperial Guards, one of which immediately impaled him through the chest with their staff.\nThe Guards were quickly engaged by Pavol and Aleksin, while Lando rushed to Lobot's side. Lobot, struggling to maintain consciousness, fought against his implants from taking over his mind. Pers, informing Lando of a medical bay one deck from their location, helped Lando rush Lobot to a bacta tank. Not sure if the semi-conscious Lobot reached the bacta tank in time, Lando apologized to his friend. Pers, deducing the Imperialis belonged to Palpatine, told Lando that the entire crew would die. Lando, unable to withstand the recent events, went to check on the twins.\nAleksin and Pavol defeated the Guards, so the crew examined the central chambers artifacts. Pers, attributing the pieces to be works by the Sith Lord Darth Momin, an ancient Sith sculptor, estimating the artifacts to each be worth an entire moon or two. While Calrissian and Pers discussed the loot, Aleksin became possessed by a helmet imbued with the dark side of the Force, igniting a double-bladed lightsaber and attacking Pavol. Shocked, Calrissian and Pers fled the chamber, resealing the door behind them. Pers argued to enter the escape pods, but Lando refused to leave Lobot behind. Meanwhile, unknown to Lando and Pers, Chanath Cha, now working for the Emperor, had infiltrated the ship. Preventing the crew's escape, Cha disabled the pods, and the ship relayed the message over the intercom. Lando realized that someone else must be on the ship, and, soon after, Pers and Lando encountered the bounty hunter at gunpoint. However, Cha recognized Lando and lowered her weapons. Cha explained her presence, saying that she was sent to kill anyone aboard or destroy the vessel.\nWhile Chanath couldn't reactive the escape pods, she agreed to let Lando and Korin escape aboard her ship, the Scimitar, and destroy the Imperialis. However, when Calrissian told Cha that Lobot was aboard the Imperialis and was injured, Cha succumbed to Calrissian's plan of stopping Aleksin and Pavol and keeping the ship intact. Immediately after, Aleksin and Pavol confronted the group, saying that Pers was a victim, before killing her. Sealing the door between them and the twins, Cha went to dock the Scimitar while Calrissian went to retrieve Lobot. Despite Lobot needing more time, Calrissian removed him from the bacta as the ship announced it would self-destruct. Helping Lobot out of the medical bay, Calrissian encountered Aleksin, fatally shooting the alien. The two reunited with Cha, and Lobot told her that he'd missed her company. When Lando asked if the Scimitar was prepped, Cha explained that her ship's droid pilot, O-66, had fled, trapping them on the self-destructing Imperialis. Lobot then requested to be taken to a computer interface, where he attempted to disable the auto-destruct. Unable to do so, Lobot realized he could turn the escape pods back on, but he couldn't do so while fighting his implant from taking over. Deciding to save his longtime friends, he enabled the pods, allowing the implants to take over his mind. Moving to the escape pods, Lando invited Cha to come with them, saying that it might bring Lobot back, but Cha declined, saying that he'd made his choice and picked Lando. After Cha said goodbye, Lando and Lobot's pod ejected. As it departed, Lando told Lobot he'd find a cure to bring him back. Upon hearing the word \"cure,\" Lobot's cybernetic construct played a pre-recorded contingency message to his friend, saying that Lobot believed Lando could find a cure, but either way he wouldn't be upset, as he had lived by his choices. Lobot's message went on to tell Lando that people trust his leadership, and that he needed to do something good with that power. Lobot's recording then ended with, \"Lando. Old buddy. You're better than this.\"\nIn the time to come, Lobot and Calrissian returned to Bespin, where Calrissian was appointed to be Baron Administrator of Cloud City, a tibanna gas mining-colony located in the planet's atmosphere. In Cloud City, Lobot was given the responsibility of managing day-to-day affairs, serving as Calrissian's Chief Administrative Aide and the city's computer liaison officer.\nShortly after the Battle of Hoth, Calrissian was contacted by his old friend Han Solo, who requested shelter for his rebel companions Princess Leia Organa, the Wookiee Chewbacca, and the protocol droid C-3PO. Unknown to Solo and his companions, Calrissian had already made a secret agreement with Darth Vader to hand Solo over to the bounty hunter Boba Fett, who was working for the Hutt crime lord Jabba. While the Empire agreed not to arrest Solo's rebel companions, they would not be allowed to leave Cloud City.\nAround that time, Lobot oversaw the arrival of the smuggler Jaxxon on Cloud City. Jaxxon was tardy, a result of his droid mis-scheduling his appointment and, although Lobot failed to recognize him, claimed to be an old friend of Calrissian's. Lobot voiced his skepticism of Calrissian being able to fit Jaxxon into an already busy schedule, but the Lepi persisted, earning himself an audience with the Baron Administrator.\nLater, Lobot was present when Vader, Fett, and several Imperial stormtroopers apprehended Solo and his companions at a banquet hall. After the Imperials froze Solo in carbonite and handed him over to Fett, Darth Vader altered the terms of the deal by arresting Organa, Chewbacca, and C-3PO. Unhappy about Vader's unilateral changes and feeling guilty for his role in betraying Solo, Calrissian, via comlink, issued Code Force Seven, ordering Lobot and the Bespin Wing Guard to detain Vader's troops and free Solo's rebel associates. Lobot was successful, and he held the stormtroopers in the security tower as Calrissian fled the planet with the escaped prisoners. Although Lobot helped evacuate the city, it soon fell to the Empire, and Lobot was captured.\nAfter his capture, the Imperials wired Lobot directly into Cloud City's central processing core through his implant. When Lando Calrissian returned to Cloud City with Leia Organa, Luke Skywalker, and R2-D2 in order to help retrieve Luke's lightsaber, he found Lobot connected to the central processing core through numerous wires.\nUsing Lobot's access to the central control mainframe, Lando caused the city to vent the by-products of Tibanna gas processing into the atmosphere, which threatened to contaminate the entire Tibanna supply. This alarmed Captain Tanch, the Imperial officer in charge of the city, causing him to deploy stormtroopers to the mainframe.\nTrapped in the mainframe room by the stormtroopers and with no help coming, Lando asked Lobot if he had any ideas. In response, Lobot took control of Automaintenance Crew 28-G, a crew of MSE-6 series repair droids, and ordered them to attack the stormtroopers outside. The droids knocked out all of the stormtroopers moments before they could breach the mainframe door. Lando then freed Lobot from the wires.\nAs Lobot and Lando attempted to leave, they were cornered by three stormtroopers. However, Luke saved the two by Force pushing the troopers through a window. Eventually, Lobot, Calrissian, and Leia escaped in a stolen Sentinel-class landing craft while Luke and R2 followed in the recovered Red Five. Leia asked Lando if he only came back to free Lobot, to which Lando replied that it was part of the reason- he also intended to make Cloud City useless to the Empire by ruining its Tibanna supply.\nLobot was present for the Rebel Alliance meeting where Leia proposed Operation Starlight, a plan to rally the scattered Rebel Fleet. Later, he took part in the rebel mission to infiltrate the Imperial Museum on Coruscant and retrieve the Autonomous Translator Module, Mark II droid.\nIn 4 ABY, the rebellion against the Empire won a major victory at the Battle of Endor, in which Emperor Palpatine was killed. In the following months, the Rebel Alliance reorganized into a New Republic, which continued to fight against remaining Imperial forces. Bespin, still under Imperial control, was subjected to the Iron Blockade under the order of Governor Ubrik Adelhard of the Anoat sector. Lobot, still present on Bespin, relayed messages through the blockade to Calrissian, who had been promoted to a general in the Republic following his departure from Cloud City. At one point during the blockade, Lobot hired the pirate Kars Tal-Korla to capture Borgin Kaa, an Imperial collaborator, and extract a code needed to open an access panel connected to Adelhard's personal chamber; once the panel was opened, Lobot and an intrusion team would apprehend the Governor. Rather than being paid for the act, the pirate said to treat it as a favor. Despite their efforts, Adelhard eluded capture, although the planet was liberated by the Uprising soon after.\nAround the time of the Battle of Jakku, Lobot accompanied Lando as New Republic forces mopped up the remaining Imperial holdouts on Cloud City. When Lando remarked that the Empire had left Cloud City in a mess, Lando responded that he would look into rehiring staff immediately. Lando then told Lobot to make sure that they hired refugees since Cloud City was inundated with expats and evacuees who needed work. As Lando went to deal with Imperial holdouts in the Bolo Tanga room, Lobot informed Calrissian that his friend Princess Leia Organa was expected to give birth soon and that he had forgotten to send a nuptial gift. At Lobot's insistence, Calrissian agreed to think of a gift to send his friends.\nLobot followed Calrissian as they approached the Bolo Tanga room, which was surrounded by several Wing Guards and New Republic soldiers. Lobot stood by Calrissian as the Baron Administrator convinced the Imperial troops to surrender. However, an Imperial sergeant refused to surrender and tried to shoot Calrissian. However, Lando killed him with his Vitiator blaster. After neutralizing the Imperial, Lando toyed with the idea of sending Leia's child a lamp. Lobot disagreed.\nWhen Lando suggested giving the child a blaster, Lobot opposed the idea on the grounds that children should not play with blasters. Lando suggested keeping the blaster in a safe till Leia's son came of age. When Lobot vetoed the idea, Calrissian finally settled with giving Leia's family the Vantillian catamaran in the western skipdock. Lobot accepted the idea. When Calrissian toyed with the idea of starting his own family, Lobot vetoed the idea. When Lando suggested they should go and share some drinks, Lobot responded that he did not drink.\nLobot was a 1.75-meter-tall male human with blue eyes, light skin, and an AJ^6 cyborg construct attached to the back of his bald head. His implant detracted some of his personality, but it allowed him to make quick calculations, and he used this ability to help Lando determine the risks of missions they underwent. Prior to her departure, Lobot had a romantic relationship with Chanath Cha, and he missed her in her absence. Lobot placed trust in his friends, yet he held himself accountable for his actions, as demonstrated following his injuries acquired on the Imperialis, when his construct played a recorded message for Lando. The injuries he sustained weakened him, so he was forced to sacrifice his mind to save his friends, leaving him without a personality or ability to speak.\nLobot also displayed some introspection. Before losing his personality, he counseled Lando to use his charm and talents to find something bigger to believe in than himself and to use that power to do something good. Lobot opined that Lando was made for better things than being a scoundrel. His efficiency and near-silence made him the perfect match for Calrissian's flamboyant personality. Lobot was also known for his strict, no-nonsense personality. He was a teetotaler and opposed Calrissian's idea of gifting the young Ben Solo a blaster and lamp. He appeared to be the only person who could say no to Calrissian.\nDuring his time with the Galactic Empire, Lobot had an AJ^6 cyborg construct implanted into the back of his skull, allowing him to make battlefield calculations. The implants, which traded personality for productivity, would take over his mind if he lost focus. After sustaining severe injuries while aboard the Imperialis, Lobot was unable to prevent the implants from taking over, permanently making him a machine-like assistant. Years later, when Lobot worked on Cloud City, his implants allowed him to communicate directly to the city's central computer, positioning him to be the city's computer-liaison officer.\nLobot's clothing consisted of a belt projecting a clear-signal field and a Fineweave sherculién-cloth shirt. Lobot was incapable of speaking verbally and communicated using his cyborg construct, which could transmit messages to a communication device on his friend Lando's wrist.\nLobot first appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back, in which he was portrayed by John Hollis. A character serving as Lando Calrissian's assistant was present in most of the original screenplays of The Empire Strikes Back, and many production paintings depicted this character as a tall, regal, dark-skinned woman. One of the later drafts of the script established this character as a cyborg, and it was then that actor John Hollis was selected for the role by the filmmakers. The cybernetic implant prop Hollis wore on his head was completely battery-powered and was connected to a spring clip that was fit around the actor's head. However, the prop was quite heavy and uncomfortable to wear. Hollis was originally only hired for a week's worth of work, but, because of the film's extended shooting schedule, he remained on the Bespin set at Elstree Studios for ten weeks.\nThroughout most of the film's production, Lobot was only referred to as \"Lando's aide\" and is referred to as such in the credits. He was to have a great deal of dialogue, mostly with Calrissian. However, the filmmakers decided that the character had been lobotomized as a result of the installation of his cybernetic implant, causing him to become a mute. This decision reportedly did not concern Hollis. As a reference to this change, the character was named \"Lobot,\" a corruption of the word \"lobotomy.\" This idea was later reflected in The Empire Strikes Back when Lobot mouths a soundless reply to Lando before taking captured stormtroopers to the security tower. However, the French dub from the 2004 European release adds an audible answer.\nA scene cut from The Empire Strikes Back called \"Lobot's Capture\" depicted Lobot being detained by a pair of stormtroopers, while another showed a critically injured Lobot being carried away by several men wearing white masks. This was meant to serve as Lobot's death scene, but it was ultimately removed by the filmmakers because it was possible that the character would appear in the following film, Star Wars: Episode VI Return of the Jedi.\nSince his appearance in The Empire Strikes Back, Lobot has been featured in numerous Star Wars spoofs, including sketches in the comedy television shows Robot Chicken and Conan.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lobot",
  "/wiki/Lobot/Legends",
  "/wiki/Lo_(disambiguation)",
  "/wiki/The_Angle",
  "/wiki/The_Coin",
  "/wiki/Age_of_Rebellion_-_Lando_Calrissian_1",
  "/wiki/Choose_Your_Destiny:_A_Smuggler_Mission",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Last_Shot",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars_(Marvel_Comics_2020)",
  "/wiki/Bespin",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/AJ%5E6_cyborg_construct",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Cloud_City",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/Planet",
  "/wiki/Smuggler",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Millennium_Falcon",
  "/wiki/Theft_of_the_Imperialis",
  "/wiki/Darth_Sidious",
  "/wiki/Yacht",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Time",
  "/wiki/Baron_Administrator",
  "/wiki/Aide",
  "/wiki/City",
  "/wiki/Computer",
  "/wiki/Stormtrooper",
  "/wiki/Battle_of_Endor",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Anoat_sector",
  "/wiki/Iron_Blockade",
  "/wiki/Liberation_of_Cloud_City",
  "/wiki/Galactic_Civil_War",
  "/wiki/Brain",
  "/wiki/Chanath_Cha",
  "/wiki/Bounty_hunter",
  "/wiki/Standard_year",
  "/wiki/Han_Solo",
  "/wiki/Sabacc",
  "/wiki/Battle_of_Yavin",
  "/wiki/Toren",
  "/wiki/Crime_lord",
  "/wiki/Castell",
  "/wiki/Colonies",
  "/wiki/The_galaxy",
  "/wiki/Sector",
  "/wiki/Moff",
  "/wiki/Ssaria",
  "/wiki/Cloning",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Aleksin",
  "/wiki/Pavol",
  "/wiki/Ugnaught",
  "/wiki/Sava",
  "/wiki/Korin_Pers",
  "/wiki/Eye",
  "/wiki/Sienar_Fleet_Systems",
  "/wiki/Orbital_Shipyard_CC-24",
  "/wiki/Orbit",
  "/wiki/Stealth_suit",
  "/wiki/Shipyard",
  "/wiki/Pilot",
  "/wiki/Starship",
  "/wiki/Imperialis",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Hyperspace",
  "/wiki/Star_Destroyer",
  "/wiki/Galactic_Emperor",
  "/wiki/Gravity",
  "/wiki/Capital_ship",
  "/wiki/Castell_system",
  "/wiki/Force_pike",
  "/wiki/Bacta_tank",
  "/wiki/Bacta",
  "/wiki/Twin",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Momin",
  "/wiki/Sith",
  "/wiki/Moon",
  "/wiki/Armor",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Double-bladed_lightsaber",
  "/wiki/Escape_pod",
  "/wiki/Death",
  "/wiki/Scimitar",
  "/wiki/Alien",
  "/wiki/Droid",
  "/wiki/O-66",
  "/wiki/Tibanna",
  "/wiki/Mining",
  "/wiki/Atmosphere",
  "/wiki/Battle_of_Hoth",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Anakin_Skywalker",
  "/wiki/Boba_Fett",
  "/wiki/Hutt",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Jaxxon",
  "/wiki/Lepi",
  "/wiki/Carbonite",
  "/wiki/Comlink",
  "/wiki/Code_Force_Seven",
  "/wiki/Bespin_Wing_Guard",
  "/wiki/Luke_Skywalker",
  "/wiki/R2-D2",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Tanch",
  "/wiki/Automaintenance_Crew_28-G",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/Force_push",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Red_Five_(T-65B_X-wing_starfighter)",
  "/wiki/Operation_Starlight",
  "/wiki/Heist_at_the_Imperial_Museum",
  "/wiki/Imperial_Museum",
  "/wiki/Coruscant",
  "/wiki/Autonomous_Translator_Module,_Mark_II",
  "/wiki/4_ABY",
  "/wiki/General",
  "/wiki/Pirate",
  "/wiki/Kars_Tal-Korla",
  "/wiki/Borgin_Kaa",
  "/wiki/Uprising",
  "/wiki/Battle_of_Jakku",
  "/wiki/Bolo_Tanga_room",
  "/wiki/Rossmoyne_Vitiator_pistol",
  "/wiki/Ben_Solo",
  "/wiki/Vantillian_catamaran",
  "/wiki/Blaster",
  "/wiki/Clothing",
  "/wiki/Fineweave_sherculi%C3%A9n-cloth",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/John_Hollis",
  "/wiki/Elstree_Studios",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/5-Minute_Star_Wars_Stories_Strike_Back",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Lando_1",
  "/wiki/Lando_2",
  "/wiki/Lando%27s_Big_Score",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Lando_3",
  "/wiki/Lando_4",
  "/wiki/Lando_5",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_Adventures_Annual_2021",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Rendezvous_at_Bespin",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Captured_on_Cloud_City",
  "/wiki/Fake_It_Till_You_Make_It",
  "/wiki/The_Witness",
  "/wiki/Star_Wars_(2020)_3",
  "/wiki/Star_Wars_(2020)_4",
  "/wiki/Star_Wars_(2020)_9",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars_(2020)_14",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/Star_Wars_(2020)_17",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Star_Wars_(2020)_18",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Star_Wars_(2020)_27",
  "/wiki/Star_Wars_(2020)_29",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Last_Shot_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/The_Lost_Treasure_of_Cloud_City",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/LEGO_Star_Wars:_The_Resistance_Rises",
  "/wiki/The_Trouble_with_Rathtars",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_157",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/2015_Topps_Star_Wars_High_Tek",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_63",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Art_of_Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_60",
  "/wiki/Starfighter_Aces",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Lobot",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Star_Wars_Insider_33",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Databank_(original)",
  "/wiki/Robot_Chicken:_Star_Wars"
 ]
}