{
 "name": "Loche_Crestingsky",
 "display_name": "Loche Crestingsky",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tansarii Point Station"
     ]
    }
   ]
  }
 ],
 "content": "Loche Crestingsky was a Human male marksman who lived during the Galactic Civil War.\nFollowing the Battle of Yavin, Loche Crestingsky resided on Tansarii Point Station, a space station located above Ord Mantell in the Bright Jewel system. He worked out of the ranged combat training room as the combat instructor for Tansarii Point's guards.\nIn 1 ABY, Crestingsky was very concerned about malfunctioning droids on the lower level of Tansarii Point Station that were becoming violent and increasingly hostile towards the inhabitants of the station. The marksman therefore hired a spacer to deal with this problem. Crestingsky first tasked the spacer to disable a number of droids to recover their memory modules. The spacer later came back with the modules and Loche sent them to the Tansarii Point's engineers for study. The droid engineer who analyzed the memory modules discovered that the droids had been sliced but he was not able to find more clues. The engineer thus requested Crestingsky and the spacer to find an intact droid central processing core. The spacer therefore returned to the lower level and fought again some malfunctioning droids to recover a droid central chip. The engineer finally found evidences that the droids were sliced by Black Sun pirates. Loche then realized that the sabotage of the droids was just a diversion for a wider Black Sun operation. In the meantime, a group of Black Sun slicers had infiltrated Tansarii Point Station and were attempting to slice into the main databanks of the station. The spacer therefore rushed to the data storage room on the lower level of the station and indeed found a group of Black Sun pirates slicing into the main security system. In the ensuring firefight, the spacer was able to eliminate most the slicers and even killed their leader, the master slicer. The spacer eventually returned to Loche Crestingsky who rewarded him with credits and a weapon from his collection.\nLoche Crestingsky was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Loche Crestingsky was added to the game as part of the \"New Player Tutorial,\" introduced with the release of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Inaldra/Legends",
  "/wiki/Inaldra%27s_Lieutenant",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sniper/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Memory_module",
  "/wiki/Engineer/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Central_processor/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Databank/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}