{
 "name": "Lock_(clone_trooper)",
 "display_name": "Lock  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "over Kynachi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grand Army of the RepublicBreakout Squad",
      "Breakout Squad"
     ]
    }
   ]
  }
 ],
 "content": "\"Lock\" was the nickname of a clone trooper captain in the Grand Army of the Republic. A veteran of the Battle of Geonosis, he eventually led a clone trooper squad in the Mission to Kynachi, where he perished with the squad's freighter. The Republic unit would later become known as \"Breakout Squad.\" Lock was in charge of a clean-up crew on the planet where the ship Malevolence was destroyed. Lock came up with the nicknames Breaker, Sharp, and Chatterbox.\nLike all clone troopers, the clone trooper captain nicknamed Lock was born on the Wild Space planet Kamino to serve in the Grand Army of the Republic during the Clone Wars.\nIn 22 BBY, the conflict of the Clone Wars started with the First Battle of Geonosis, in which Lock participated.\nShortly after Anakin Skywalker led the successful mission to destroy the Malevolence, Captain Lock was assigned to search through the wreckage for any indications of which organization had built the separatist battleship. Lock arrived at the Kalida Nebula in the star destroyer Demolisher. He took the clone trooper shinies CT-8863, CT-4012 and CT-5177 down to the Malevolence crash site with a Nu-class attack shuttle. During the mission, Lock, feeling it inconvenient for the three troopers to call each other by their number, assigned them with nicknames based on one of their skills. CT-4012 received the nickname \"Sharp\" for spotting the insignia of the Free Dac Volunteers Engineering Corps in the wreckage. CT-8863 received \"Breaker\" which was short for \"circuit breaker\" after he had discovered a circuit board with an exotic design. As Captain Lock turned to give CT-5177 his nickname, a B1-Series battle droid rose from the wreckage and starting shooting at the clones. CT-5177 was hit and collapsed while the other clones returned fire. The droid was easily destroyed, but CT-5177 was badly injured. Lock deemed the mission over and they hurried with their wounded comrade to the shuttle and up to the star destroyer for medical aid. Lock demanded that his brother would live, and would not reveal his new nickname unless he did survive.\nThey were soon assigned to a new mission to the planet Kynachi where the exotic circuit board had been manufactured. Lock and his troopers along with a recovered CT-5177 assembled in the Jedi Temple's landing bay. He then revealed that the clone's nickname was Chatterbox, which was an irony on the clone's silent nature. For the mission he was put under the command of Jedi General Ring-Sol Ambase and received 11 clones plus two pilots. They were to travel to Kynachi in secret and was to use an unmarked freighter. Unbeknownst to Lock however was that the shuttle had been sabotaged. As soon as they had exited hyperspace the freighter was attacked by Separatist forces. Lock was in the cockpit of the freighter as the attack started and yelled that droid fighters were incoming. His voice vanished as an explosion rocked the ship. The troopers attempted to abandon ship as more explosions occurred, but the launch systems for the escape pods had been tampered with. As such they had to be launched manually from the freighter. As the first pod was launched, Breaker, Knuckles, Chatterbox and Nuru Kungurama jumped into the second one, but realized someone had to stay behind. Lock had then managed to limp his injured body to the pods. Breaker told the captain to get into the pod while he remained to launch it. After understanding the situation he pushed Breaker into the pod and launched it, with his final words that until he was dead, he was the one to give order. As the escape pod soared towards the planet, the freighter exploded, incinerating Lock and everything aboard.\nLock showed both concern and a wanting for his fellow clones to become more like individuals as he personally wanted to come up with nicknames for the clones. He showed a willing to sacrifice himself for his team, as well as making it clear that he was in charge when he shoved Breaker into the escape pod.\nCaptain Lock wore a standard clone armor that was \"scuffed and scratched\", with a battered helmet that was decorated with jagged blue markings.\nIn the Star Wars: Clone Wars Adventures mini-game, \"Card Commander\", CC-4142 is mistakenly credited with Lock's last words.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lock_(disambiguation)",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Kynachi",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Breakout_Squad",
  "/wiki/Clone_trooper_captain",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Mission_to_Kynachi",
  "/wiki/Death/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/CT-8863",
  "/wiki/CT-4012",
  "/wiki/CT-5177",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Lock_(clone_trooper)",
  "/wiki/Wild_Space/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY",
  "/wiki/Clone_Wars",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Demolisher_(Venator-class)",
  "/wiki/Shinie/Legends",
  "/wiki/Nu-class_attack_shuttle",
  "/wiki/Free_Dac_Volunteers_Engineering_Corps/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Ring-Sol_Ambase",
  "/wiki/Nuru_Kungurama",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(video_game)",
  "/wiki/CC-4142",
  "/wiki/The_Clone_Wars:_Secret_Missions_1:_Breakout_Squad",
  "/wiki/Databank_(original)"
 ]
}