{
 "name": "Lock_(Clone_Captain)",
 "display_name": "Lock  (Clone Captain)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Eeth Koth's unit",
      "Eeth Koth's unit"
     ]
    }
   ]
  }
 ],
 "content": "\"Lock\" was the nickname of a clone trooper who held the rank of Clone Captain in the Grand Army of the Galactic Republic during the Clone Wars. Commanded by Jedi General Eeth Koth, the Clone Captain led the Jedi Master's clone trooper unit by the time of 21 BBY. In that year, Lock was stationed aboard Koth's flagship, the Venator-class Star Destroyer Steadfast. While aboard the Star Destroyer, following the Republic's recapture of the planet Geonosis, Lock accompanied the Jedi Master in his search for the conspirator behind mysterious attacks on Outer Rim Territories hyperspace routes, traveling through the Saleucami system during their mission.\nHowever, as they passed through the Saleucami system, the Steadfast was ambushed by the Confederacy of Independent Systems fleet of General Grievous. There, Lock and his clone troopers were engaged by a contingent of Separatist battle droids, which boarded the Star Destroyer. During the firefight, though, Koth ordered the Clone Captain and his troopers to evacuate the Steadfast and leave the Separatist general to his responsibility, to the clone trooper's disagreement. Despite Koth's orders, the Jedi Master was soon defeated by Grievous during a brief duel aboard the command bridge.\nThe clone trooper who adopted the nickname \"Lock\" was a clone of the human male bounty hunter Jango Fett, born and raised on the planet Kamino. He was created to serve in the Grand Army of the Republic during the Clone Wars, a conflict between the Galactic Republic and the Confederacy of Independent Systems. He acquired the rank of Clone Captain and was assigned to a unit under the command of Jedi General and council-member Eeth Koth. In the year 21 BBY, Lock was stationed aboard the Venator-class Star Destroyer Steadfast, alongside Eeth Koth and the rest of his unit. Whilst the Steadfast was in the Saleucami system, a Separatist fleet attacked the ship. Led by Supreme Commander General Grievous aboard his Recusant-class Commerce Guild destroyer, Separatist forces boarded the Steadfast using docking tubes.\nThe ensuing battle saw Lock and his clone troopers forced to defend the ship's airlocks against oncoming B2-series super battle droids. Koth contacted Lock and requested an urgent report on the situation, to which the captain replied that the number of droids was too large to counter. Koth proceeded to order Lock and his troops to evacuate the vessel in escape pods, exclaiming that he would handle Grievous on the bridge. Lock protested, stressing that the droid general's forces included BX-series droid commandos, but Koth downplayed their importance and again ordered him to evacuate. Moments later, Koth and his troops were greeted by Grievous and a squad of commando droids on the bridge. The Jedi engaged Grievous in a desperate lightsaber duel, but the latter ordered his droid escort to assist and Koth was ultimately defeated and captured.\nSimilarly to the clones created from the bounty hunter Jango Fett, Lock stood at 1.83 meters in height. During the ambush on the Steadfast, the Clone Captain understood the overwhelming force that outnumbered his clone trooper unit when asked on the status of the engagement. When the Jedi Master ordered Lock and his troopers to retreat, the clone trooper expressed concern in the Jedi General's decision to combat Grievous.\nLock was equipped with Phase I clone trooper armor, which featured the green and yellow markings of Eeth Koth's unit. Additionally, his helmet sported a visor and an antenna was attached to his left shoulder plate. In combat, Lock wielded a DC-15A blaster carbine, a standard-issue weapon for clone troopers of the Galactic Republic.\nLock first appeared as an unidentified character in \"Grievous Intrigue,\" the ninth episode of the canon animated series Star Wars: The Clone Wars' second season, which aired on January 1, 2010, in which he was voiced by Dee Bradley Baker. Lock was identified by name in the episode's corresponding guide, released on StarWars.com.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lock_(Clone_Captain)",
  "/wiki/CC-4142",
  "/wiki/Lock_(disambiguation)",
  "/wiki/Special:Upload",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Eeth_Koth%27s_unit",
  "/wiki/Clone_trooper",
  "/wiki/Military_rank",
  "/wiki/Clone_Captain",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Commanding_officer",
  "/wiki/Jedi_General",
  "/wiki/Eeth_Koth",
  "/wiki/Captain",
  "/wiki/Jedi_Master",
  "/wiki/Trooper",
  "/wiki/Time",
  "/wiki/21_BBY",
  "/wiki/Standard_year",
  "/wiki/Flagship",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Steadfast_(Venator-class)",
  "/wiki/Star_Destroyer",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Planet",
  "/wiki/Geonosis",
  "/wiki/Attacks_on_hyperspace_routes",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hyperspace_route",
  "/wiki/Saleucami_system",
  "/wiki/Capture_of_Eeth_Koth",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Fleet",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Battle_droid",
  "/wiki/Lightsaber_duel",
  "/wiki/Bridge_(starship)",
  "/wiki/File:LockUnderAttack-GI.jpg",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Jedi_High_Council",
  "/wiki/Starship",
  "/wiki/Supreme_Martial_Commander_of_the_Separatist_Droid_Armies",
  "/wiki/Grievous%27s_Recusant-class_light_destroyer",
  "/wiki/Recusant-class_light_destroyer",
  "/wiki/Docking_tube",
  "/wiki/Airlock",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Droid",
  "/wiki/Escape_pod",
  "/wiki/BX-series_droid_commando",
  "/wiki/Jedi",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Grievous_Intrigue",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/January_1",
  "/wiki/2010",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/The_Clone_Wars_Episode_Guides",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Lock",
  "/wiki/Databank_(website)",
  "/wiki/Clone_template",
  "/wiki/Color",
  "/wiki/Ultimate_Star_Wars"
 ]
}