{
 "name": "Locus Geen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 86 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Locus Geen was a General in the Grand Army of the Republic, who fought with distinction in the Clone Wars. He later became an informant for the Rebel Alliance. Around 0 ABY he established himself in the upper echelons of society on the planet Salliche and passed along sensitive information to the Rebels.\nFollowing in the footsteps of his forefathers, Geen served during the Clone Wars as the commanding officer of Rom Mohc. After the war, Geen retired to the planet Salliche, where he became involved in the planet's bureaucracy. He cultivated contacts among Salliche's senators and bureaucrats, Imperial naval officers, and acquaintances from the Clone Wars. As a war hero he was invited to high-level receptions on Salliche where he would entertain by telling exaggerated stories from the Clone Wars.\nHe spent his time between his estate on Salliche and various plazas and forums in the capital city, Netassa where he would argue politics with legislators and entertain younger generations with his war stories.\nGeen was a Human male. By 0 ABY he was mostly bald but had a tidy beard and he was hunched over. He was known as an entertaining storyteller, often telling stories of the ancient wars whenever possible. He was also a good listener and gleaned information from his contacts, which he passed on to the Rebellion through encrypted communications to sympathizers. He was generally contacted through Imperial NetPost, and contacts seeking him would claim to be relatives of \"old war friends.\"\nIn his youth Geen was skilled at combat and was a solid commander. In his later years he became very involved with local government and bureaucracy and could move skillfully around upper echelons of society.\nBy 0 ABY Geen used a cane to help him walk. He also carried a datapad that was linked up to the Imperial NetPost so he could monitor requests from the Rebellion.\nLocus Geen was designed by Peter M. Schweighofer for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/86_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/General/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Salliche/Legends",
  "/wiki/Rom_Mohc",
  "/wiki/Netassa",
  "/wiki/Imperial_NetPost",
  "/wiki/Datapad/Legends",
  "/wiki/Peter_M._Schweighofer",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Vilardi",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Outlaw_Battle_Armor",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Wizards.com",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}