{
 "name": "Loden_Greatstorm",
 "display_name": "Loden Greatstorm",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 231 BBY",
      "Grizal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Bell Zettifar"
     ]
    }
   ]
  }
 ],
 "content": "Loden Greatstorm was a Twi'lek male Jedi Master who was part of the Jedi Order during the High Republic Era and was considered one of the best teachers of the Order. Greatstorm saw every moment as a learning experience and sought to better himself and those around him, especially Padawans. He was considered strong and wise and considered to have a great sense of humor. He wielded a yellow lightsaber.\nSome time prior to the Great Hyperspace Disaster, Jedi Master Loden Greatstorm and his Padawan, Bell Zettifar were stationed at the Elphrona Outpost when they were alerted to a cave-in at the local aurodium mine. After arriving to the mine in a Vanguard ground vehicle, Greatstorm was told by an Er'Kit Miner that their partner Freeno was trapped within the mine. Upon entering the mine, Greatstorm and his Padawan lifted the rocks off of Freeno using The Force. Upon being freed, Freeno's greed got the best of him and he proceeded to mine for a large crystal which could make himself rich. During this, the two Jedi struggled to hold up the roof of the cave, and Bell suggested that the two Jedi leave the greedy Er'kit. When Lodean heard his Padawan's concern, he used the force to push him out of the cave. Once Zettifar was removed from the cave, the cave appeared to fully collapse, seemingly trapping Loden and Freeno within the cave. Once the dust cleared however, Greatstorm emerged safely with the foolish Er'kit in tow. After scolding Freeno, Greatstorm used the opportunity to teach his Padawan that although it is the Jedi's responsibility to defend life, they cannot prevent them from making rash decisions.\nLoden Greatstorm and his Padawan were present during the rescue effort in Hetzal system when debris from the Legacy Run entered the system from hyperspace during the Great Disaster. After arriving in the system aboard the Third Horizon, Loden and Bell flew to the planet Hetzal Prime in the Jedi Vector Bell secretly nicknamed the \"Nova\". In keeping with his teaching philosophy that any task his student could accomplish would be done by the student and not him, Greatstorm tasked Bell with finding a place for the pair to help the citizens of Hetzal. Zettifar located an area of particularly heightened emotional turmoil through the Force and directed their flight to the site he had sensed. There, they discovered a private compound housing a large starship and a crowd of panicked Hetzalians trying to force their way in to flee the planet aboard the ship while compound guards looked on. Loden set their Vector to hold its position in the sky and leapt to the ground, instructing his Padawan to do the same. Though Greatstorm was able to slow his own descent with the Force and land smoothly on the planet, Zettifar had not managed to master the technique outside of training situations and Loden also had to catch his apprentice with the Force to keep him from being injured. Loden promised to practice the skill with Bell later, even suggesting that he throw his Padawan off towers on Coruscant to give Bell more time to gather his focus and catch himself.\nGreatstorm then approached the crowd of Hetzalians, who informed him that the wealthy family that owned the compound had refused to let others board their ship to evacuate despite the craft being large enough to hold many of them. Loden confronted the compound's armed guards, who eventually acquiesced to his pressure and agreed to let the crowd board the ship. However, a group of marauders arrived before the gates were opened, intent on seizing the vessel by force. As they opened fire with speeder-mounted cannons, the two Jedi deflected the barrage with their lightsabers and redirected the marauders own fire to destroy the cannons. The marauders scattered into the crowd as the Jedi leapt toward their speeders, and the compound guards tool the opportunity to open fire on the distracted Jedi. To bring the conflict to an end as quickly as possible, Greatstorm asked Bell to defend him while he located the marauders through the Force. Loden telekinetically lifted the marauders meters in the into the air and dropped them to incapacitate them without killing them. He then turned his attention to the guards, who had stopped firing as they watched the Jedi Master's display of power. Brandishing his saber at the guards, Loden knocked open the compound gates with the Force. The guards at last lowered their weapons and allowed the crowd to enter.\nIn the aftermath of the Great Disaster, Greatstorm and his Padawan went to Elphrona, where they were stationed at a Jedi outpost along with Indeera Stokes and Porter Engle. When the Jedi on Elphrona discovered that the Blythe family was kidnapped, they chased the Nihil raiders who kidnapped them. Greatstorm and Zettifar were able to save the mother and Loden protected her when the Nihil ship began firing at them. When Stokes showed up with two Vectors, they began pursuing the enemy. Greatstorm used the mind trick to force the Nihil pilot to slow her ship and open air lock, so they could get inside the ship and save the family. Stokes was able to save the son, but Loden's Vector was destroyed by incoming Nihil ships and he wasn't able to escape with the father.\nAfter being captured by the Nihil, Loden was locked in a cell on Gaze Electric, where Marchion Ro set up special cells to imprison Greatstorm.\nDuring his imprisonment, Greatstorm was repeatedly drugged, and at one point had his lekku amputated by Ro via Loden's own lightsaber.\nFollowing the Nihil attack on the Valo Republic Fair, the Jedi journeyed to the Nihil's main base on the planetoid Grizal for a counterattack. Greatstorm fell from the Gaze Electric and was saved by Zettifar's telekinesis. They fought side-by-side for a time, though Greatstorm was soon exhausted. The pair were attempting to prevent Lourna Dee from escaping when Ro unleashed the Great Leveler, a creature that could sever a being's connection to the Force. Zettifar and Elzar Mann were overcome by visions, but Greatstorm was killed. His body appeared to be petrified with his features frozen in a scream. When Stellan Gios touched the deceased's cheek, his body crumbled into dust.\nSometime before Greatstorm was lost, Reath Silas had met the great Jedi and seen how his rare ability to influence emotions with the Force could be beneficial when used correctly. After the Master's death, Silas thought of the example set by Greatstorm when the empathic Imri Cantaros smoothed out his upset feelings, and he was prepared to cite Greatstorm to defend Cantaros against Vernestra Rwoh's concerns about manipulating emotions.\nAs a Force-sensitive Jedi Master, Greatstorm had a strong ability to wield the Force.\nGreatstorm was skilled with telekinesis, exemplified when he saved his Padawan, Bell Zettifar, from a large fall by levitating him to safety. Additionally, he could also re-direct explosives, diverting a deadly splinter grenade into the air, to save civilians from marauders. Greatstorm was able to levitate and manipulate multiple enemies at once, lifting eight armed marauders high into the air, disarming them, then dropping them, severely injured. He was also capable of powerful Force pushes, blowing apart a large metal gate, ripping it from the hinges and breaking the locks.\nGreatstorm could also use the Force to influence minds. He demonstrated this by forcing the Nihil pilot Ultident Margrona to slow her ship and open the outer air lock.\nLoden Greatstorm wore cream-and-gold Jedi robes. He wielded a yellow-single-bladed lightsaber.\nLoden Greatstorm was created for the Star Wars: The High Republic multimedia project, and was first revealed in an article on StarWars.com, which showed concept art of the character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Set_For_Life",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_Trail_of_Shadows_1",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/231_BBY",
  "/wiki/Grizal",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Bell_Zettifar",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Padawan",
  "/wiki/Lightsaber",
  "/wiki/Time",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Elphrona_Outpost",
  "/wiki/Elphrona_aurodium_mine",
  "/wiki/Vanguard_(vehicle)",
  "/wiki/Freeno%27s_partner",
  "/wiki/Freeno",
  "/wiki/The_Force",
  "/wiki/Force_push",
  "/wiki/Hetzal_system",
  "/wiki/Legacy_Run",
  "/wiki/Hyperspace",
  "/wiki/Third_Horizon",
  "/wiki/Hetzal_Prime",
  "/wiki/Jedi_Vector",
  "/wiki/Nova_(Vector)",
  "/wiki/Elphrona",
  "/wiki/Indeera_Stokes",
  "/wiki/Porter_Engle",
  "/wiki/Blythe_family",
  "/wiki/Nihil",
  "/wiki/Mind_trick",
  "/wiki/Gaze_Electric",
  "/wiki/Marchion_Ro",
  "/wiki/Lekku",
  "/wiki/Loden_Greatstorm%27s_lightsaber",
  "/wiki/Attack_on_Valo",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Grizal_camp",
  "/wiki/Planetoid",
  "/wiki/Battle_of_Grizal",
  "/wiki/Telekinesis",
  "/wiki/Lourna_Dee",
  "/wiki/Great_Leveler",
  "/wiki/Elzar_Mann",
  "/wiki/Force_vision",
  "/wiki/Death",
  "/wiki/Stellan_Gios",
  "/wiki/Reath_Silas",
  "/wiki/Force_empathy",
  "/wiki/Imri_Cantaros",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Force-sensitive",
  "/wiki/Ultident_Margrona",
  "/wiki/Jedi_robes",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/StarWars.com",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_The_Great_Jedi_Rescue",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Trail_of_Shadows_2",
  "/wiki/The_High_Republic_Adventures_(2021)_7",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Soule_Man",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Inside_Intel:_Twi%27lek_Culture",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Geonosis_and_Other_Outer_Rim_Planets",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}