{
 "name": "Loegrib",
 "display_name": "Loegrib",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lenahra"
     ]
    },
    {
     "name": "Died",
     "values": [
      "41 BBY",
      "Lenahra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mikkian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue and red"
     ]
    }
   ]
  }
 ],
 "content": "Loegrib was a male Mikkian from the planet Lenahra. He was the uncle of Audj Seedol and Casul, being their father's brother. When the Lenahrans discovered the Power, a substance harvested from a cave within the planet, Loegrib became addicted to the substance. The theft of the Power caused Lenahra, which possessed a type of sentience, to turn on the residents in an attempt to prevent the theft, and many of the people residing on the planet decided to construct a starship to leave. A small group, including Loegrib's brother and his partner, refused, successfully hiding away with their children, but Loegrib was not among them, as he was forced to leave on the starship. Becoming obsessed with returning to his homeworld and claiming all of the Power for himself, Loegrib left the rest of the Lenahrans. He found a financier and persuaded him to fund his expedition for the energy source, hiding his intent to keep it all for himself. Loegrib was eventually able to return after Jedi Padawan Obi-Wan Kenobi discovered a distress beacon the Mikkian had planted and brought it with him to Lenahra, which he had travelled to investigate. However, in the ensuing skirmish, Loegrib was killed and Lenahra permanently sealed itself off.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lenahra",
  "/wiki/41_BBY",
  "/wiki/Mikkian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Audj_Seedol",
  "/wiki/Casul",
  "/wiki/Lenahran",
  "/wiki/The_Power",
  "/wiki/Sentience",
  "/wiki/Starship",
  "/wiki/Youngling",
  "/wiki/Homeworld",
  "/wiki/Mission_to_Lenahra",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Distress_beacon",
  "/wiki/Death",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Loegrib",
  "/wiki/Padawan_(novel)",
  "/wiki/Padawan_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Reproduction",
  "/wiki/57_BBY"
 ]
}