{
 "name": "Lofryyhn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red-brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "FarStar",
      "FarStar",
      "Moff Sarne's forces"
     ]
    }
   ]
  }
 ],
 "content": "Sergeant Lofryyhn was an old friend of Kaiya Adrimetrum, and a Rebel technician. He later oversaw the technicians assigned to the FarStar during the hunt for Moff Kentor Sarne.\nLofryyhn joined the Alliance to Restore the Republic during the Galactic Civil War, serving in a unit under the command of Kaiya Adrimetrum. The team performed several infiltration missions, and the Wookiee primarily served as the team's technician, although he was equally adept in combat situations. Lofryyhn was proficient in the Wookiee martial art, Wrruushi, but he avoided talking about the subject. Over the course of several missions, Lofryyhn and Adrimetrum developed a close friendship; the pair rarely speak of their past, but it was rumored that Lofryyhn had saved Adrimetrum's life on more than one occasion. Lofryyhn's service continued on with the New Republic, the successor state to the Alliance. Adrimetrum eventually transferred to the elite Page's Commandos, while Lofryyhn was assigned to the technical staff as a Sergeant on a Corellian Corvette that transported Special Operations teams throughout the Outer Rim Territories.\nSometime prior to 8 ABY, the ship was attacked and captured by pirates. The pirates sold Lofryyhn to the Sabiador Slavers, who branded him with their mark. He was subsequently sold on to Moff Kentor Sarne, the Imperial warlord who ruled the Kathol sector. Although the Moff generally pitted large and strong alien species against each other in gladiatorial combat for his own amusement, Sarne recognized that Lofryyhn's technical skills were more valuable to him. Taken to the Moff's capital, the planet Kal'Shebbol, Lofryyhn was put to work in Sarne's docking bays, repairing various capital ships. During this time, Lofryyhn worked on modifying the CR90 corvette Renegade at Sarne's secret Sorbiss Valley shipyard.\nWhen not working, Lofryyhn was confined to a cell in the detention block of Sarne's headquarters. In 8 ABY, Kal'Shebbol was attacked by New Republic forces. The New Republic was in the process of attempting to subdue the various Imperial warlord states that had sprung up when the Empire had fractured in the wake of Galactic Emperor Palpatine's death at the Battle of Endor four years previously. Sarne's holdings had come to the New Republic's attention due to a series of incursions the Moff's forces had made into the neighboring Minos Cluster, and persistent rumors that Sarne had access to a powerful new weapon. Elements of Page's Commandos—including Kaiya Adrimetrum, who was aware that Lofryyhn was a prisoner of Sarne's and had insisted on being part of any team sent to Kal'Shebbol—infiltrated the planet ahead of the main battle fleet with the intention of lowering the deflector shield protecting Kal'Shebbol's only continent. While one half of the team, led by Lieutenant Judder Page, went to deactivate the shield, Adrimetrum led the rest to the detention blocks. Lofryyhn was rescued from captivity by Adrimetrum's team, and he was reunited with his former commander. During the rescue, one of the other captives, Jessa Dajus, warned the commandos of danger. Lofryyhn inquired as to who she was, and she claimed to be a shuttle pilot who had served Sarne until he had imprisoned her during one of his \"loyalty purges\". In reality, she was an Imperial Intelligence officer who Sarne had incarcerated for accessing secret information. She also claimed to have \"hunches\"—the result of her own Force-sensitivity—and felt that all those in the detention block were in imminent danger that had not been present until the commandos had began shooting the locks off the cell doors. While Dajus discussed her feelings with Adrimetrum, Lofryyhn acted on his own hunch and began checking the remaining cell doors. He found that one of them had been rigged with a booby-trap designed to cave in the ceiling of the detention center and showed it to Adrimetrum. The commando reluctantly concluded that they could not check each cell door for further traps and decided to rescue the remaining prisoners later.\nAlthough Page's team succeeded in dropping the shields, allowing the New Republic force to liberate the planet, Sarne managed to escape aboard his personal Carrack-class light cruiser, Ambition. He also fled the system with the bulk of his military forces, retreating into the depths of the Kathol sector. Page wanted to send a mission after Sarne to track him down and neutralize any threat he still posed, but the admiral in charge of the task force couldn't spare any ships. Although the admiral could spare a vessel, he had promised to support Page if the commando could find a capital ship on his own. Lofryyhn had told Page about the corvette he had been forced to work on, but unfortunately he didn't know where the ship was located as he had always been taken to the vessel in a closed shuttle. Page wanted to use the ship for his mission, and was eventually supplied the location by Jessa Dajus. Lofryyhn was a member of a New Republic team that was immediately sent to the shipyard, and the Wookiee performed a preliminary analysis of the ship for Page, noting that the modifications to the sublight drive were incomplete, but the Imperials hadn't been able to sabotage anything before their evacuation.\nWith the mission approved, Lofryyhn was assigned to the ship, rechristened as the FarStar, as its chief mechanic due to his familiarity with the vessel's systems. The vessel was commanded by Captain Keleman Ciro, with Kaiya Adrimetrum serving as Executive officer. Working alongside Sergeant Brophar Tofarain—a civilian from Kal'Shebbol who had signed onto the FarStar mission due to a shortage of New Republic crewers—he pair were in charge of keeping the corvette operational and maintained. While Lofryyhn and his team of technicians were responsible for maintaining the FarStar, Tofarain was in charge of starfighter maintenance and technical support. The Wookiee slung a hammock in one of the engineer's stations, but he rarely spent time there as his skills were constantly needed to keep the FarStar in a state of repair, which he generally achieved by using wire and duratape to patch the aging corvette's systems. Since Page wanted the mission launched quickly, Lofryyhn and his engineers were forced to ready the ship for flight by jury-rigging systems and makeshift modifications. As a result, pragmatism took precedence over aesthetics as the Wookiee and his team strung wire across hallways, ran piping along corridors, and left critical components such as power couplings, jumpers, cables and interfaces exposed so that they could get to them in a hurry. Lofryhhn pushed his team of engineers and technicians tirelessly, and their main priority was preventative maintenance to counter the constant stresses placed on the engines. The Wookiee could generally be found on Deck Three, in the Engine Levels A-C Power Distribution area, overseeing the engineering section. As part of his efforts to keep the FarStar operational, Lofryhhn established a machine shop on Deck Four to manufacture larger parts that were needed to maintain the ion engines, repulsorlift vehicles and starfighters.\nWith the twenty-eight hour deadline up, Captain Ciro planned to take the FarStar on a shakedown cruise. However, his plans were derailed when the ship intercepted a distress signal from the governing body of the nearby planet of Kolatill, requesting assistance. After arresting their Imperial governor after hearing the New Republic had liberated Kal'Shebbol, the world had been attacked by forces loyal to Sarne. Ciro informed Lofryyhn that he was aborting the shakedown cruise, and told him to inform his engineers that the ship was on active duty. During the subsequent mission to Kolatill, Captain Ciro was captured by Imperial forces during a battle in the system, and Kaiya Adrimetrum was promoted to captain of the FarStar.\nContinuing on its mission, the FarStar visited the planet Gandle Ott, which was the terminus of the sector's Trition Trade Route. The FarStar found the planet in political upheaval, as Moff Sarne had visited Gandle Ott several days previously, removing the majority of its Imperial personnel, including the planetary governor. Several factions were in contention to take over the vacant governorship, and saw the practicality of possibly gaining allies within the New Republic. Since part of the FarStar's mission included making initial diplomatic contact with planets within the Kathol sector, Captain Adrimetrum agreed to meet with the planet's main politicians. Lofryyhn was part of a group of FarStar officers to meet Vice-Governor Marja Lang, General Herron Dade, and Colonel Olaver Lansel. He later attended a performance of Madra Teene at the Theatre Danske. During the performance, an assassin droid attacked the FarStar crewmembers. The droid—one of several traps Sarne had left on the world to slow New Republic pursuit of him—was quickly defeated by the corvette's personnel.\nAfter leaving Gandle Ott, the FarStar traveled to the planet Shintel, which was the location of Imperial Depot 4290-1, a military base controlled by Sarne's forces. Sarne had also visited Shintel, stripping the depot of supplies and personnel. In addition, he had left behind those personnel whom he felt were not sufficiently loyal to him, and destroyed all the drives on the base's hyperspace-capable ships. The commander of the base, Colonel Heget, welcomed the FarStar crew to the base, and Lofryhhn was part of the FarStar's delegation that met with the colonel and his senior staff. Heget agreed to supply the corvette with information regarding Sarne's plans in exchange for assistance in getting off-world to the shadowport Tanquilla Beach so that he could arrange for a rescue of his personnel. However, one of the officers at the base was an undercover spy working directly for Sarne. Lieutenant Palme arranged for a computer program to be uploaded to the FarStar that disabled its hyperdrive by burning out the hyperdrive coils when it prepared to jump to lightspeed. Crippled, the FarStar was subsequently attacked by the bounty hunter gang Qulok's Fist, but managed to repel the assault. Lofyrrhn and his team of technicians cannibalized the hyperdrives from the FarStar's X-wing complement and managed to get the hyperdrive working. However, the Wookiee stressed that the patch job was only temporary, and wouldn't last long enough to get the ship to Gandle Ott. With no choice, the FarStar limped to Tanquilla Beach.\nUpon reversion to realspace at Tanquilla Beach, the FarStar's hyperdrive engines finally failed as the remodulating buffer heatsink blew. Lofryhhn admitted that the problem was beyond his expertise—the corvette needed major repairs from a qualified hyperdrive specialist. Captain Adrimetrum employed the services of Spang, who operated the space station's premier starship repair bay. He allowed his nineteen-year old granddaughter Fia to replace the FarStar's engines upgraded them to Class One in the process. Lofryhhn was kept busy repairing the FarStar by Adrimetrum; Tanquilla Beach had a section devoted entirely to a slave market, and the captain feared that Lofryyhn would feel obligated to intervene. By keeping him busy and unaware of the market, she hoped to avoid a diplomatic incident. While the engines were being rebuilt, Fia detected the trapdoor circuitry that caused the engines to fail in the first place. Although confident that she could remove the ones in the engines, she admitted that she did not have the technical knowledge to sweep the ship and hunt for any others that may have been present. However, her grandfather recognized some of the characteristics as being similar to ones on Pembric II, and recommended that Adrimetrum seek out a man called Breslin Drake who could help them. Adrimetrum concurred, and during the trip to the Pembric system, Lofryyhn swept the ship five times, and found two booby-traps in the life support systems and in one of the communications system. Wary of what happened to the hyperdrive engines, Lofryyhn refused to tinker with the ship's systems for fear of setting off the booby-traps. A delegation from the FarStar traveled to Pembric II and located Gaelin, a slicer who had worked with the Keiffler Brothers, the original designers of the trapdoor systems on the FarStar. Under his supervision, the majority of the trapdoors were neutralized.\nSeveral weeks after leaving Kal'Shebbol, the FarStar crossed the Marcol Void, a thirty light-year area of space devoid of star systems, entering the Kathol Outback. In the Outback, the past of the FarStar's executive officer, Gorak Khzam, was revealed—he was a former slaver. Shortly after the revelation, he defected from the crew during a mission to the planet Uukaablis, stealing Tofarain's shuttle, the Muvon. Lofryyhn was furious that a slaver had been in their midst, and even more so that he had escaped. Several days later, the FarStar discovered the gaseous remains of a protostar, and detected a planetary system hidden within it. Captain Adrimetrum believed that there was a possibility that Sarne and his fleet were hiding within it, and ordered Lofryyhn and Tofarain to ready a probe droid for launch to investigate the system. Working together, the two mechanics loaded the droid into its launch pod. The droid encountered the world of Exocron, a planet that had remained isolated since it was founded. After helping to free the planet's population from the tyrannical rule of the Devisors, the FarStar continued on its mission. Shortly after, Lofryyhn was present on the bridge of the FarStar when it entered the Nah'Malis system. On the system's primary world, Danoor, the FarStar enlisted the aid of Makezh, a Human who could navigate the Kathol Rift, and area of intense volatile gases and lightstorms.\nAs the corvette entered the Rift, long-range communications with the New Republic forces based on Kal'Shebbol became impossible. To counter this, Lofryyhn and Tofarain proposed using the FarStar remaining probe droids to create a communications link within the Rift. Each probe droid would be modified to constantly scan the Rift and readjust their position to remain within the \"safe\" corridors of the Rift. The probes droids would act as a chain of comm relays, broadcasting signals back to Kal'Shebbol. Although the plan did not allow for Kal'Shebbol to contact the FarStar, Adrimetrum agreed to the plan, and Lofryhhn and Tofarain set about modifying the probe droids and dropping them at chosen locations within the Rift. They dubbed the system the \"Lifeline Project\". While traveling through the Rift, the FarStar located a facility on the planet Q'Maere that Sarne was using as prison. The crew managed to free a number of political prisoners, including their former commander, Captain Ciro—although he was in a catatonic state—and New Republic pilot Lowen Chase. They also salvaged a damaged YT-1300 light freighter that Brophar Tofarain claimed in compensation for the loss of the Muvon. Lofryyhn assisted Tofarain in repairing the vessel at the mechanic's request.\nA Wookiee with reddish-brown fur, Lofryhhn was a friendly individual, and enjoyed socializing with the crew and listening to their stories. During the FarStar mission, Lofryhhn enjoyed working with his new crewmates, although he admitted that the constant demands of keeping the vessel in operation condition wore him down.\nHe spoke Shyriiwook and understood Galactic Basic Standard, and the technicians under his command had some knowledge of his native language, enough for them to comprehend his orders. A tinkerer, Lofryhhn constructed gadgets in his spare time. However, due to lack of parts, they were often less than practical, such as the tracking device that was the size of his fist.\nLike many Wookiees, Lofryyhn had no tolerance for slavers. Along with his own experience as a slave, Lofryyhn was perfectly willing to ensure that any slavers he met would have no opportunity to practice their trade again.\nIn Shyriiwook, Lofryhhn's name was a combination of the prefix \"Lof\", meaning clever, cunning, or wily, and the suffix \"ryyhn\", which translated as danger, silk, or syren.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Red",
  "/wiki/Brown",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/FarStar",
  "/wiki/Moff_Sarne%27s_forces",
  "/wiki/Sergeant/Legends",
  "/wiki/Kaiya_Adrimetrum",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Martial_Arts",
  "/wiki/Wrruushi",
  "/wiki/Katarn_Commandos",
  "/wiki/Alliance_Special_Operations",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Sabiador_Slavers",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Kathol_sector",
  "/wiki/Alien/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Sorbiss_Valley",
  "/wiki/Detention_area",
  "/wiki/Imperial_Government_Complex",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/New_Republic_task_force_(Kal%27Shebbol)",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Minos_Cluster_incursions",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/DarkStryder_technology",
  "/wiki/Fleet/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Judder_Page/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Jessa_Dajus",
  "/wiki/Commando/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Carrack-class_light_cruiser/Legends",
  "/wiki/Ambition",
  "/wiki/Kal%27Shebbol_system",
  "/wiki/Sector/Legends",
  "/wiki/DarkStryder_Campaign",
  "/wiki/Unidentified_New_Republic_admiral",
  "/wiki/Task_force/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Sublight_drive",
  "/wiki/Technician/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Keleman_Ciro",
  "/wiki/Executive_officer/Legends",
  "/wiki/Brophar_Tofarain",
  "/wiki/Starfighter/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Duratape/Legends",
  "/wiki/Power_coupling/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Ion_drive",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Distress_signal/Legends",
  "/wiki/Kolatill_Council",
  "/wiki/Kolatill",
  "/wiki/Governor/Legends",
  "/wiki/Bombing_of_Domaz",
  "/wiki/Battle_of_Kolatill",
  "/wiki/Kolatill_system",
  "/wiki/Gandle_Ott",
  "/wiki/Trition_Trade_Route",
  "/wiki/Marja_Lang",
  "/wiki/General/Legends",
  "/wiki/Herron_Dade",
  "/wiki/Colonel/Legends",
  "/wiki/Olaver_Lansel",
  "/wiki/Madra_Teene",
  "/wiki/Theatre_Danske",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Shintel",
  "/wiki/Imperial_Depot_4290-1",
  "/wiki/Heget",
  "/wiki/Shadowport/Legends",
  "/wiki/Tanquilla_Beach/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Palme",
  "/wiki/Hyperdrive_coil",
  "/wiki/Lightspeed/Legends",
  "/wiki/Skirmish_at_Shintel",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Qulok%27s_Fist",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Remodulating_buffer_heatsink",
  "/wiki/Spang",
  "/wiki/Fia_(engineer)",
  "/wiki/Pembric_II",
  "/wiki/Breslin_Drake",
  "/wiki/Pembric_system",
  "/wiki/Life_support/Legends",
  "/wiki/Communications",
  "/wiki/Gaelin",
  "/wiki/Slicer/Legends",
  "/wiki/Keiffler_Brothers",
  "/wiki/Marcol_Void",
  "/wiki/Light-year/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Kathol_Outback",
  "/wiki/Gorak_Khzam",
  "/wiki/Uukaablis",
  "/wiki/Muvon",
  "/wiki/Protostar/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Exocron_system",
  "/wiki/Exocron",
  "/wiki/Devisors",
  "/wiki/Nah%27Malis_system",
  "/wiki/Danoor",
  "/wiki/Makezh",
  "/wiki/Human/Legends",
  "/wiki/Kathol_Rift/Legends",
  "/wiki/Lightstorm",
  "/wiki/Lifeline_Project",
  "/wiki/Q%27Maere_Research_Facility",
  "/wiki/Q%27Maere",
  "/wiki/Prison/Legends",
  "/wiki/Lowen_Chase",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/The_Saga_Begins",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/Omens",
  "/wiki/Death_Is_Remotely_Possible",
  "/wiki/Shintel_Downtime",
  "/wiki/Crisis_(RPG_adventure)",
  "/wiki/The_Masters_of_Exocron",
  "/wiki/The_Kathol_Outback",
  "/wiki/Galaxy%27s_Edge",
  "/wiki/Rogue_Elements",
  "/wiki/The_Kathol_Rift",
  "/wiki/Waystation",
  "/wiki/Home_(RPG_adventure)",
  "/wiki/Harm%27s_Way",
  "/wiki/The_Saga_Nears_Its_End",
  "/wiki/Endgame",
  "/wiki/Endgame_(RPG_adventure)",
  "/wiki/Star_Wars_Miniatures_Battles#Blister_Packs",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Iron_Man",
  "/wiki/Star_Wars_Galaxy_Magazine_6",
  "/wiki/The_DarkStryder_Campaign,_Deluxe",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Wildfire_(adventure)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Callsigns:_Names_of_Kashyyyk",
  "/wiki/Star_Wars_Gamer_10"
 ]
}