{
 "name": "Logray",
 "display_name": "Logray",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.0 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "with tan stripes"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree tribe",
      "Alliance to Restore the Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Makrit"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Teebo"
     ]
    }
   ]
  }
 ],
 "content": "Logray was a male Ewok from the forest moon of Endor who served as the chief shaman of Bright Tree tribe during the Galactic Civil War. At one point during the war, Luke Skywalker, Han Solo, Chewbacca, R2-D2, and C-3PO were brought to the tribe. Logray, believing Threepio a god, ordered Skywalker, Solo, and Chewbacca to be cooked as a sacrifice to their \"god.\" The three were freed after Skywalker used the Force to trick the Ewoks into believing that Threepio was using his \"magic\" in a display of powerful anger. When the Ewoks were debating on helping the Rebels in assaulting the shield generator, Logray was hesitant to get involved, concerned for the safety of the Ewoks and feeling that this conflict was bigger than them. Eventually he was swayed over by the others and was greatly moved by Teebo's messages sent out to the neighboring tribes. Eventually, he and the other Ewoks attacked the Imperial forces stationed on the moon during the Battle of Endor. He participated in the celebration that followed the destruction of the second Death Star. He helped officiate the wedding of Han Solo and Leia Organa at the Great Tree.\nLogray was an Ewok male who was born on the forest moon of Endor. On one occasion as a child, he and the Ewok Chirpa snuck out in the snow, but Chirpa's father, Chief Buzza, tricked them by creating a false trail of footprints that supposedly belonged to a fearsome Kroolok, terrifying the young Ewoks. Logray eventually became apprentice to Makrit, shaman of the tribe that lived in Bright Tree Village. During Logray's apprenticeship, sleeping Woklings began vanishing from their baskets in the village. Buzza and Makrit discussed the issue eith Chirpa and his partner Ra-Lee, with Ra-lee and Buzza agreeing that Duloks must be responsible; however, Makrit advised against attacking the Duloks and exerted a power over Buzza that caused the chief's eyes to go blank and made him agree with the shaman. After the chief and the shaman left, Logray approached Chirpa and Ra-lee, telling them he disagreed with his master and persuading them to accompany him to the Dulok camp that night to search for the Woklings.\nThe trio found the camp deserted, but after investigating a set of huge footprints, they were attacked by a lone Dulok who grabbed Ra-Lee and claimed the Ewoks must be sacrificed. Before the Dulok could harm Ra-Lee, its eyes turned blank as Buzza's had and Makrit revealed himself, having followed Logray and his companions from the village. The shaman explained that he had overpowered the Dulok's mind using the sunstar. Admitting he had been wrong about the Duloks, Makrit then questioned the Dulok about the sacrifices and the Ewoks were told that the Duloks were making sacrifices at the foot of Mount Krana to a great being that had destroyed their camp. Logray then traveled with Makrit, Chirpa, and Ra-Lee to the mountain, where they discovered a huge Ewok effigy with the woklings inside. As the woklings, whose eyes were blank, were not moving, Logray entered the effigy with Chirpa and Ra-Lee in order to rescue them; however, Makrit shut a cage door behind the trio, trapping them inside the effigy.\nThe shaman revealed that it had been he who kidnapped the woklings, but that he needed Chirpa as a more impressive sacrifice for the great being: the Gorax known as the Great Devourer. As he spoke, the Gorax arrived at the foot of the mountain, and Logray told Ra-Lee to quickly cut them free with her axe. Responding that there was no time for Logray's plan, Ra-Lee instead grabbed a burra horn that Chirpa was carrying and blew it. Realising Ra-Lee's plan, Logray covered his ears at the sound, but soon reassured her it had worked when he felt the vibrations in the ground of an approaching heard of boar-wolves. The boar-wolves charged through the effigy and destroyed it, allowing Logray and his allies to jump out onto the backs of the boar-wolves with the woklings and flee. Makrit yelled after the group to stop as they escaped, but then was killed by the Gorax in their place.\nLogray became shaman and medicine master of the Bright Tree Tribe, with Chirpa also ascending to become chief. During a bleak winter, the pair, now elders, approached the brothers Wicket Wystri Warrick and Weechee as the siblings argued while cleaning up the long table at the village's Great Hall after a meal. Warrick, who was too young to have yet been allowed on a hunt, was claiming that he would prove to Weechee that he could throw a spear when Logray interrupted, questioning the young Ewok. When Weechee told the elders that Warrick hoped to go hunting in the snow, Chirpa reminded him that he was too young, but when Warrick persisted and said he would form a hunting party, Logray pondered if Warrick and his friends would be able to take on a Kroolok, which the shaman described as a Ewok-eating beast to the curious younglings.\nThat night, Warrick and his friends Teebo and Kneesaa, Chirpa's daughter, left the village to hunt for a Kroolok. Weechee, having created a Kroolok costume, followed them in order to scare them; however, Logray and Chirpa also followed with their own trick planned for the four younger Ewoks. Using large snowshoes, Chirpa created a false trail of Kroolok prints as his father use to, and when Warrick and his companions found it they began to dig a pit trap into which they hoped to lure the Kroolok. Using Warrick as bait, they captured the disguised Weechee in the pit when he tried to scare them; however, when Warrick realised that Weechee's outfit could not have created the tracks they had found, Logray and Chirpa sprung their own surprise. The pair, who had been watching while hidden nearby, began to immidate the sounds of a Kroolok, with Logray blowing a horn to create the creature's loud bellow. Warrick, Weechee, Kneesaa, and Teebo all fled back to the village in terror, leaving Logray chuckling to himself. He praised Chirpa's false tracks, with the chief reminding the shaman of Buzza's similar trick in their youth. The pair then headed back to the village for the night, with Chirpa contemplating that they might have time to enjoy a goblet of spiced sunberry wine.\nBy 4 ABY, the Galactic Empire had established a presence on Endor, building a shield generator on the moon to protect the Death Star II superweapon in the Endor system above. The Alliance to Restore the Republic, opponents of the Empire in the Galactic Civil War, planned to launch an attack on the Death Star and so sent a strike team to Endor to destroy the generator; however, several members of this team were captured by a hunting party from Bright Tree Village led by Teebo, who was by then Logray's apprentice. The Ewoks mistook one of their captives, the protocol droid C-3PO, for the Ewok deity known as the Golden One, and so bore him on a throne back to the village, although the droid's companions were bound before being carried back. At the village, the leaders of the hunting party spoke excitedly to Logray and Chirpa about their discovery as Han Solo, one of the captive rebels, was lowered over a barbecue pit. Also chattering excitedly, Logray waved his stick around mystically before Chirpa stepped forward and announced that Solo, Luke Skywalker, and Chewbacca—C-3PO's organic companions, would be cooked and served as the main course of a feast in honor of the Golden One.\nLogray then pushed his way through a crowd of Ewoks to where C-3PO was seated on a throne in the village center, producing a lightsaber that had been taken from Skywalker and using it to gesture while talking to C-3PO. The droid then explained to his allies the predicament they were in. Princess Leia Organa, another member of the rebel strike team who had been brought to the village as a guest, then emerged and, recognizing her friends, attempted to stop the preparations for the feast. C-3PO translated her requests into Ewokese for Chirpa, who had also approached, but Logray and the chief ordered the Ewoks to continue. Upon Skywalker's request, C-3PO told the Ewoks that if they did not stop the droid would become angry and use his magic. Although this caused the Ewoks present to pause, Logray ordered for the cooking fires to be lit and preparations continued. Skywalker, a Jedi Knight, then used the Force to lift C-3PO and his throne and made the droid hover above the Ewoks. The shaman stumbled back from the floating droid, and the shaman and the chief cowered while clutching each other as the other Ewoks present fled from the village center. Logray eventually shouted orders for the captives to be released, and Skywalker lowered C-3PO back to the ground.\nWith the captives now considered guests, a feast of root stew was eaten instead, after which C-3PO told the Ewoks stories of the Empire and the Rebellion inside Chirpa's hut. The droid's tales finished with an explanation of the danger posed by the Death Star that the Ewoks could see in the sky above, prompting Chirpa to enter deep discussion with Teebo and the hunter Asha Fahn. When Logray attempted to interrupt, Fahn growled and bared her teeth due to a delicate political issue between the two, but Chirpa stopped her and asked that the shaman be allowed to speak his mind. Logray believed that they should put the safety of the tribe first and not get involved with issues much greater then themselves; however, Chirpa had been inspired to aid the rebels. Because of the support of Teebo and Fahn, the chief was able to overrule Logray, which the shaman did not take well, shaking his holy sticks and stones in frustration.\nDespite his protests, even Logray became caught up in the excitement when Chirpa announced to the village that they would join the rebels in their cause against the Empire, and he eventually helped to persuade the tribe to fight. With C-3PO translating, the Ewoks and the rebels agreed to strike the shield generator the following morning, after which the rebels retired for the night. The Ewoks held a war council instead of sleeping in which Romba, a refugee from a tribe of Ewoks wiped out by the Empire, suggested that not only their village, but all Ewoks, should have a chance to fight. In response, Logray mumbled about a sacred refuge where they could hide, but garnered no interest from the rest of the council. Teebo then composed a beautifully worded message explaining the situation and calling for aid, which Chirpa then had messangers deliver to the other Ewok tribes. Teebo's words were so moving that it gave even Logray hope and resolve.\nThe following morning, the rebels and Ewoks attacked the shield generator as planned, but discovered that the Empire had expected the rebels and set up a trap, allowing them to capture the rebel strike team. What the Empire had not counted on was the Ewoks, who managed to free their allies and ultimately overwhelmed the Imperial forces, allowing the rebels to destroy the shield generator. This in turn allowed the Alliance Fleet above to destroy the Death Star. As the battle station exploded in the sky above, Logray cheered at their victory alongside Warrick, Organa, Chewbacca, Solo, C-3PO, and the astromech droid R2-D2.\nWith the battle over, the Ewoks and the rebels held a celebration back at Bright Tree Village, which Logray participated in. Two days after the battle, Solo proposed to Organa, and Chief Chirpa agreed to host the wedding. The Ewoks prepared the temple built in the Great Tree on the northern edge of the village, and several days after the battle the ceremony took place with rebels and Ewoks in attendance. After Chirpa gave his blessing to the couple, Skywalker, who had been asked to officiate, rose from his seat, but Logray rushed past him and yelled out while banging his staff on the temple floor, causing petals around Solo and Organa to burst and spiral to the floor.\nThe Ewoks present mirrored Logray's cry of \"yub nub,\" and the shaman led them in a call-and-response chant. When Solo asked C-3PO what was going on, Logray stopped the chant as the droid spoke, and pointed his staff at C-3PO. He declared that he could not lead the marriage ceremony and would step back to allow the Golden One to officiate instead as the voice of the Great Tree. Delighted at the opportunity, C-3PO said he could perform the task, but Solo objected and Skywalker stepped forward again; however, the shaman swung his staff at the Jedi, declaring that he would defend his deity from the usurper. On Organa's suggestion, C-3PO then explained to Logray that as a deity he would not meddle in human affairs and would instead elect a human to perform the ceremony as the Great Tree willed it. Skywalker used the Force to make an orb of amber in the temple glow as C-3PO spoke, causing Logray to raise his staff and shout as the other Ewoks gasped. The droid then bowed toward Skywalker, who was finally allowed to take his place as officiant.\nAlthough the shaman allowed Skywalker to give his speech, Logray once again leapt up when it ended and beat his staff against the wooden floor, causing the petals in his headpiece to tremble. He then walked forward so intently that it was almost menacing, explaining to C-3PO that there was an Ewok wedding tradition that must be seen to and that he refused to cede this part of the ceremony. The shaman then grabbed Solo's hand and pulled it from Organa's, growling when Solo protested. The Ewok then mumbled under his breath as Chirpa brought up the shaman's staff; separating Solo's fingers, Logray pulled a vine from the staff and wrapped it around the groom's middle finger three times, chanting with a rhythmic melody to match the spiral of the vine as he did so. With half the vine wrapped around Solo's finger, Logray reached out to Organa, who offered him her hand so that the shaman could place her palm against Solo's and wrap the other half around her middle finger in a gentler manner then he had previously.\nWith the bride and groom's fingers bound, Logray took a moment to study his handiwork, and then stated in a solemn voice that the Great Tree bound the couple. Chirpa then handed the shaman back his staff, and Logray plucked a single flower-flier from it and tucked the insect into Organa's vine ring. Turning to the crowd, the shaman then banged his staff on the ground again and shouted out to the audience. After the Ewoks responded, Organa and Solo remained still, unsure of what to do, so Logray, sighing, turned to them and placed a paw on each of their wrists, repeating himself. Once Organa and then Solo copied the audience's response, the shaman gave a satisfied nod and pulled their hands apart, causing the vine to break and ooze nectar, which hardened the rings into amber. With the ceremony now over as far as they were concerned, Logray and Chirpa turned to the audience with their hands raised and once again repeated the chant, leading both rebels and Ewoks in another call-and-response chant. After Solo and Organa kissed, flower-fliers that had been perched all around the temple dropped down to float in the air, mesmerizing the human guests.\nLogray was portrayed by Mike Edmonds in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The character's name is not spoken in the film, but is listed in the credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Logray",
  "/wiki/Logray/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Logray",
  "/wiki/Endor",
  "/wiki/Ewok",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Bright_Tree_tribe",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Makrit",
  "/wiki/Teebo",
  "/wiki/Chief",
  "/wiki/Shaman",
  "/wiki/Galactic_Civil_War",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Deity",
  "/wiki/The_Force",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/Battle_of_Endor",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Wedding_of_Han_Solo_and_Leia_Organa",
  "/wiki/Forest",
  "/wiki/Moon",
  "/wiki/Youngling",
  "/wiki/Chirpa",
  "/wiki/Parent",
  "/wiki/Buzza",
  "/wiki/Kroolok",
  "/wiki/Apprentice",
  "/wiki/Bright_Tree_Village",
  "/wiki/Sleep",
  "/wiki/Wokling",
  "/wiki/Ra-Lee",
  "/wiki/Dulok",
  "/wiki/Eye",
  "/wiki/Dulok_camp",
  "/wiki/Unidentified_Dulok_(camp)",
  "/wiki/Sunstar",
  "/wiki/Mount_Krana",
  "/wiki/Mountain",
  "/wiki/Gorax",
  "/wiki/Great_Devourer",
  "/wiki/Axe",
  "/wiki/Ear",
  "/wiki/Boar-wolf",
  "/wiki/Death",
  "/wiki/Winter",
  "/wiki/Wicket_Wystri_Warrick",
  "/wiki/Weechee_(Ewok)",
  "/wiki/Great_Hall_(Endor)",
  "/wiki/Spear",
  "/wiki/Kneesaa",
  "/wiki/Sunberry_wine",
  "/wiki/4_ABY",
  "/wiki/Galactic_Empire",
  "/wiki/Superweapon",
  "/wiki/Endor_system",
  "/wiki/Death_Star",
  "/wiki/Endor_strike_team",
  "/wiki/Deflector_shield_generator",
  "/wiki/Protocol_droid",
  "/wiki/Golden_One",
  "/wiki/Droid",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Ewokese",
  "/wiki/Jedi_Knight",
  "/wiki/Root_stew",
  "/wiki/Hunting",
  "/wiki/Asha_Fahn",
  "/wiki/Tooth",
  "/wiki/Romba",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Astromech_droid",
  "/wiki/Amber",
  "/wiki/Plant",
  "/wiki/Insect",
  "/wiki/Mike_Edmonds",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_4",
  "/wiki/The_Kroolok",
  "/wiki/Life_Day_Treasury",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Ewoks_Join_the_Fight",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Return_of_the_Return_of_the_Jedi",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/A_Galaxy_for_Everyone",
  "/wiki/Databank_(website)"
 ]
}