{
 "name": "Loje Nella",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rior"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Riorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Loje Nella was a shadowy Riorian female who was a member of the Hutt crime lord Jabba Desilijic Tiure's court. In 4 ABY, she was present in the throne room booths of Jabba's Palace on the planet Tatooine during a performance by the Max Rebo Band, which ended in the death of the enslaved dancer Oola.\nNella later took part in a trap laid for Princess Leia Organa, who freed Jabba's prisoner Han Solo from carbonite while she thought the Hutt was sleeping. Jabba, who had been warned of Organa's disguise as the bounty hunter Boushh, had hidden behind a curtain with Nella and other favored members of his court. Once Solo was free, the Hutt revealed himself and had Solo and Organa captured while the Riorian laughed alongside other court members.\nLoje Nella was a Riorian female from the planet Rior. She served as a member of the Hutt crime lord Jabba Desilijic Tiure's court and spent time in his palace on the desert planet Tatooine. In 4 ABY, Nella sat behind a pillar in between two of the booths of Jabba's throne room during a performance by the Max Rebo Band. After the group finished one song, they began to play the song \"Jedi Rocks,\" but their second performance was interrupted when the enslaved dancer Oola was dropped into the pit below the throne room after she refused the Jabba's advances.\nAfter Oola was devoured by Jabba's pet rancor, Pateesa, Princess Leia Organa, disguised as the bounty hunter Boushh, arrived dramatically in the throne room with the Wookiee Chewbacca as her prisoner. After Organa threatened the court with a thermal detonator, Jabba agreed to pay her an increased bounty for Chewbacca, who was then taken away. Organa and Chewbacca's real purpose in the palace was rescuing their ally Han Solo, who Jabba kept frozen in carbonite and displayed on one of the throne room walls. Later that night, Organa snuck back into the throne room while she believed everyone was sleeping and freed Solo; however, Jabba had been warned by the bounty hunter Boba Fett that Boushh was not who they seemed and set a trap.\nHidden behind curtains, the Hutt and his court had lain in wait for the princess for an hour, with Nella hidden in a cramped alcove alongside Jabba as one of his favorite cronies. Once Solo was thawed and Organa had unmasked herself, Jabba revealed himself to the pair and as the curtains were drawn back while Nella rocked back and forth with laugher alongside the musicians Max Rebo and Droopy McCool. Solo and Organa were then taken captive, after which the court celebrated late into the night. However, the next day Jabba and many of his allies perished after the Jedi Luke Skywalker arrived and helped to free Solo, Organa, and Chewbacca.\nLoje Nella was a shadowy individual and laughed heartily at the capture of Organa and Solo. She had brown eyes and brown skin.\nLoje Nella appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, where she was a puppet controlled by puppeteer Mike Quinn from beneath the set. Concept artist Joe Johnston drew a concept sketch of Nella for the film and a maquette of the character with lighter skin and orange eyes was also created. The palace throne room scenes were filmed between January 25 and February 8, 1982 on Stage 8 at Elstree Studios.\nThe puppet's creators in the Industrial Light \u0026 Magic Monster Shop nicknamed the character \"Toadstool Terror,\" and in the current Star Wars canon, the she recieved the name Loje Nella in the 2017 reference book Star Wars: Geektionary: The Galaxy from A - Z. The name originated in the Star Wars Legends continuity, where it was first used on a card for the character in the 1998 Jabba's Palace Limited expansion set of the Star Wars Customizable Card Game published by Decipher, Inc. Despite a statement from Holocron continuity database manager Leland Chee saying that Nella was a Riorian, the character was ultimately established to be an intelligent cliffborer worm in the Legends continuity. In canon, the character has only been identified as Riorian, with no source yet mentioning cliffborer worms.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Loje_Nella",
  "/wiki/Loje_Nella/Legends",
  "/wiki/Rior",
  "/wiki/Riorian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/4_ABY",
  "/wiki/Throne",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Max_Rebo_Band",
  "/wiki/Death",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Sleep",
  "/wiki/Bounty_hunter",
  "/wiki/Boushh",
  "/wiki/File:LojeNella-MaxReboBand-ROTJ.png",
  "/wiki/Time",
  "/wiki/Desert",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Thermal_detonator",
  "/wiki/Bounty",
  "/wiki/Boba_Fett",
  "/wiki/File:HoorayForEvil.png",
  "/wiki/Standard_hour",
  "/wiki/Musician",
  "/wiki/Max_Rebo",
  "/wiki/Droopy_McCool",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Eye",
  "/wiki/File:LojeNella-Puppet-Maquette.png",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Mike_Quinn",
  "/wiki/Joe_Johnston",
  "/wiki/January_25",
  "/wiki/February_8",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Star_Wars",
  "/wiki/2017",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Legends",
  "/wiki/1998",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Decipher,_Inc.",
  "/wiki/Holocron_continuity_database",
  "/wiki/Leland_Chee",
  "/wiki/Riorian/Legends",
  "/wiki/Cliffborer_worm",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Jabba%27s_Palace",
  "/wiki/Star_Wars_Insider_60",
  "/wiki/January_24",
  "/wiki/2018",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/February_6",
  "/wiki/2007",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}