{
 "name": "Lomina_Argo",
 "display_name": "Lomina Argo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "A Human female, Lomina Argo was a Systems analyst on the planet Coruscant. In the year 22 BBY, she was interviewed by a journalist from HoloNet News about the \"Baby Ludi\" custody case, in which the Jedi Order refused to return the six-month-old Force-sensitive Ludi to her mother. Argo stated that she did not know how a six-month-old child could be a danger.\nLomina Argo was a Human female Systems analyst on the galactic capital planet, Coruscant, in the year 22 BBY. In that year, Argo was interviewed by a HoloNet News journalist about the \"Baby Ludi\" custody case, which concerned the Jedi Order refusing to return a six-month-old Force-sensitive Human, Ludi, to her mother, Jonava Billane. After hearing a statement by Jedi Master Coleman Trebor, in which Trebor said that the infant's mind had been opened to the Force and that returning the child to her mother might prove dangerous, Argo told the reporter that she did not understand how a six-month-old child could be dangerous.\nLomina Argo had black hair, brown eyes, and fair skin. On at least one occasion, she wore large earrings, a headband, and blue-and-white clothing. Although Jedi Master Coleman Trebor felt that returning Ludi to her mother would be dangerous, Argo did not think that Ludi could pose a threat.\nLomina Argo first appeared in 2002 in volume 531, issue 46 of the HoloNet News feed. She, along with the rest of the website, was created by Pablo Hidalgo and Paul Ens, and she was pictured and quoted in an article entitled \"Jedi Refuse to Hand Over Baby Ludi.\" The article included a picture of Argo, which was illustrated by artist Joe Corroney.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Systems_analyst",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Journalist/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/%22Baby_Ludi%22_custody_case",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Aris-Del_Wari",
  "/wiki/Jonava_Billane",
  "/wiki/Youngling/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Coleman_Trebor/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Piercing/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/2002",
  "/wiki/HoloNet_News_Vol._531_46",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Paul_Ens",
  "/wiki/Joe_Corroney",
  "/wiki/October_31",
  "/wiki/2006"
 ]
}