{
 "name": "Lomi Plo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "36 ABY",
      "Admiral Ackbar",
      "over Tenupe"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gorog",
      "Nightsisters",
      "One Sith"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Welk",
      "Alema Rar",
      "Morto"
     ]
    }
   ]
  }
 ],
 "content": "Lomi Plo was a Human female Nightsister and a Sith Master, active during the Yuuzhan Vong War.\nLomi may have once been affiliated with the Shadow Academy and the Second Imperium, but by the time she was captured by the Yuuzhan Vong, she was a member of Darth Krayt's One Sith. Rescued by the Myrkr strike team, she aided them in their mission against the voxyn, but she and fellow Sith Welk then stole the Tachyon Flier with Raynar Thul onboard. They escaped into the Unknown Regions and apparently created the Gorog, a Killik nest, unknown to the other nests. Lomi was responsible for the Dark Nest Crisis and the Swarm War.\nAt the conclusion of the Swarm War, Lomi was killed by Jedi Grand Master Luke Skywalker.\nLomi Plo was a Nightsister, possibly a member of the Great Canyon Clan under Tamith Kai. By the time of the Yuuzhan Vong War, she was a member of the new Sith order based on Korriban, acting as Sith Master to the Togorian Morto.\nAlong with an apprentice, she was sent to escort Lumiya to join their group at its base. However, they were cut off from their destination by the unexpected speed of the Yuuzhan Vong advance, and Lomi and her apprentice were captured by the invaders.\nLomi subsequently found herself enslaved alongside Welk and other Force-sensitives aboard the worldship Baanu Rass, as specimens for human experimentation, and especially as live prey for the voxyn. After being rescued by the Myrkr strike team, she took vengeance on her captors by creating a Force net and slowly contracting it, ultimately slicing a Yuuzhan Vong shaper into pieces. This act greatly unnerved Anakin Solo, but impressed Alema Rar, who was still mourning the death of her sister. The members of the strike team were less than pleased to discover that they had rescued two Dark Jedi — and would have been even less pleased if they had known at the time that they were Sith.\nUsing their knowledge of the worldship, Lomi and Welk guided the strike team, but were perturbed when they discovered the nature of the mission. In order to escape, they stole the Tachyon Flier, injuring Lowbacca and abducting Raynar Thul in the process. The ship eventually crashed in the Unknown Regions, severely burning all three aboard, leaving them scarred and deformed.\nLomi and Welk were incorporated into the Killik nest that rescued them and, through their knowledge of the Force, they appear to have created the Gorog nest. Lomi became known as the Unseen Queen of this Dark Nest. Because Lomi wanted nothing more than to hide, the nest had taken on that characteristic and hid from the other nests. Lomi also gained the ability to render herself invisible to someone who had doubt in their mind. Because of this, the extent of Lomi's injuries were unknown, but in later encounters Lomi was revealed to have had a pair of Killik arms above her Human ones, her eyes were replaced with Killik eyes, her lower jaw was replaced with a Killik mandible, and one of her legs was replaced by a Killik leg.\nIn 35 ABY, the Dark Queen was present with the Dark Nest in the Qoribu system, at Kr. She and the Night Herald Welk worked with Alema Rar to engage Luke Skywalker and Mara Jade Skywalker. Lomi fluttered around the edge of the battle, invisible to the combatants, draining the power cells of the Jedi whenever she was able to. Luke, wielding Alema Rar's lightsaber and his own, lost both weapons, but still killed Welk. Lomi thrashed out while trying to kill Luke by throwing him into Gorog larvae, but Luke survived, and Lomi chose to retreat as many more Jedi were on their way. Despite this, Luke and the other Jedi believed the Dark Nest to be destroyed.\nLomi Plo, however, survived, molding Alema Rar into the new Night Herald, and making increased efforts to undermine the Galactic Alliance, spending a year dispatching pirates to raid Alliance shipping between Reecee and Adumar, and flooding the populace of insectile worlds with black membrosia. This culminated in an accident that left Supreme Commander Sovv dead at the hands of membrosia-drunk insect pilots.\nThe Galactic Alliance dispatched the Fifth Fleet to blockade the Utegetu Nebula. Lomi Plo had also spent her time concocting a story to convince UnuThul that absorbing Chiss into their nests would not make the Colony rife with Dark Nests, and with the worlds that the Jedi had provided the Killiks all poisoned by a nano-tech environmental defense system, the Colony quickly responded by working with the Dark Nest to destabilize the Chiss and Galactic Alliance while constructing fifteen massive Nest ships - the spark was turned into a war when Jacen Solo attacked Supply Depot Thrago; the Chiss blamed the Colony and retaliated.\nWith the war against the Chiss under way, all Lomi had to do was maintain enough resources to distract the Jedi by attacking the Alliance further, and the Killiks would crush the Chiss. However, when Lomi Plo attempted to leave the Utegetu Nebula, she was engaged by the Jedi, who managed to focus long enough on her to disable eleven of the nest ships. However, the Alliance could not prove itself to the Chiss due to the fact that UnuThul stole the Admiral Ackbar, and started using it against the Chiss, who believed the Alliance had handed it to the Killiks.\nThus, in 36 ABY, Lomi Plo met Luke Skywalker three times in lightsaber combat. The first time, in the Utegetu Nebula, she was invisible to Luke, and he was only able to engage her by trusting the Force to direct his hand. Luke had tracked the Dark Nest to one of fifteen nest ships in the Utegetu Nebula, and crashed on the Dark Nest vessel to engage her. Even while assisted by Han Solo, Tarfang and Jae Juun on the outside of the nest ship, and with Mara supporting in a StealthX, Luke barely escaped with his life, with Lomi using her extra arms to drive Luke back.\nIn the second she carried two lightsabers . Lomi had been repairing the eleven nest ships left behind in the Utegetu Nebula, and made efforts to distract the Alliance by sponsoring coups on the numerous insect worlds of the Alliance. The Jedi united to defeat these uprisings, and headed to the Utegetu Nebula as the nest ship fleet was completed.\nAs the Jedi disabled the nest ships' hyperdrives and the Fifth Fleet arrived to engage and destroy them, Luke, Mara and Jacen led a team to track down and kill Lomi. The subsequent battle saw Lomi making use of Luke's fear to freeze him in his tracks, with her Gorog nest assisting her in very nearly killing Mara and Jacen - Mara was shot by a Gorog when Lomi misdirected an attack from Luke at her, and Jacen was impaled by Lomi's lightsaber. However, in the moment of victory, Mara shot Plo full in the chest. Wounded, Lomi fled, abandoning her nest ship and making for Tenupe to join UnuThul and the Moon Swarm armada.\nThe Jedi and Galactic Alliance quickly followed her, acting to capture and neutralize the Colony once and for all, even as it snapped shut a trap on two-thirds of the Chiss fleet. Lomi, aware that, if UnuThul was captured, the Dark Nest could be destroyed, intervened in the middle of the fight between Luke and UnuThul, and taunted Luke by using his own lightsaber that was confiscated by UnuThul on Woteba. The two Force users engaged Luke, disabling his sword arm. Luke wounded Plo and rendered UnuThul comatose.\nDetecting the location of the Fifth Fleet medical ship, Lomi redirected three Killik swarms to destroy the Fleet and kill Mara and Jacen. However, Luke revealed they were not aboard, and Lomi acted purely on instinct, knowing she could not flee on a broken knee, and could not hide behind Luke's doubts. Skywalker struck, destroying the defeated Lomi Plo. Luke found himself surprised that a woman of flesh and blood and chitin had nearly brought the galaxy to the edge of an eternal war, but he had triumphed.\nThe Sith received little news of Lomi after the Yuuzhan Vong War, and only discovered her fate from Alema Rar, who arrived on Korriban in 40 ABY. Morto in particular was shocked to learn from Alema that she had become the leader of the Dark Nest.\nLomi Plo was a skilled user of the dark side of the Force. It is unknown when Lomi started her training, as by the time Anakin Solo and the other Jedi met her in 27 ABY, she had possibly been a Dark Jedi of the Shadow Academy, a Nightsister, and was a member of the One Sith organization.\nBy this time she was able to create an energy web that could dice her opponents into pieces, including Yuuzhan Vong. Additionally, she was capable of using mind tricks, using one on Anakin Solo successfully.\nAfter being absorbed into the Killiks, her personality traits and desire to remain hidden from others resulted in the creation of the Gorog. Drawing off the power of the nest, Lomi Plo gained the ability to conceal herself behind a person's doubt, making her invisible to sight and sense unless they devoted their focus to her. She also gained the ability to drain energy from power cells - including lightsabers, droids, and StealthX floodlamps. These skills, along with her Killik soldiers, allowed her to engage Luke Skywalker and his Jedi several times.\nBeyond her skills with the Force, she was a skilled lightsaber duelist. She used Jar'Kai against Luke Skywalker in the last two of their fights, wielding two lightsabers - a white-bladed weapon, and a purple bladed shoto. She also previously made use of Luke Skywalker's own green bladed weapon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Lomi_Plo",
  "/wiki/Dathomir/Legends",
  "/wiki/36_ABY",
  "/wiki/Admiral_Ackbar_(Victory-class)",
  "/wiki/Tenupe",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Gorog",
  "/wiki/Nightsisters/Legends",
  "/wiki/One_Sith",
  "/wiki/Welk",
  "/wiki/Alema_Rar",
  "/wiki/Morto",
  "/wiki/Sith_Master/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Shadow_Academy",
  "/wiki/Second_Imperium",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Darth_Krayt",
  "/wiki/Myrkr_strike_team",
  "/wiki/Voxyn",
  "/wiki/Tachyon_Flier",
  "/wiki/Raynar_Thul",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Dark_Nest_Crisis",
  "/wiki/Swarm_War",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Great_Canyon_Clan",
  "/wiki/Tamith_Kai",
  "/wiki/Korriban",
  "/wiki/Togorian/Legends",
  "/wiki/Lumiya",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Koros-Strohna",
  "/wiki/Baanu_Rass",
  "/wiki/Force_net",
  "/wiki/Shaper_caste",
  "/wiki/Anakin_Solo",
  "/wiki/Numa_Rar",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Lowbacca",
  "/wiki/Killik/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/35_ABY/Legends",
  "/wiki/Qoribu",
  "/wiki/Kr",
  "/wiki/Night_Herald",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Reecee/Legends",
  "/wiki/Adumar/Legends",
  "/wiki/Membrosia",
  "/wiki/Sien_Sovv",
  "/wiki/Galactic_Alliance_Fifth_Fleet",
  "/wiki/Utegetu_Nebula/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/The_Colony",
  "/wiki/Nest_ship",
  "/wiki/Darth_Caedus",
  "/wiki/Supply_Depot_Thrago",
  "/wiki/Han_Solo/Legends",
  "/wiki/Tarfang",
  "/wiki/Jae_Juun",
  "/wiki/Moon_Swarm",
  "/wiki/Woteba",
  "/wiki/The_galaxy/Legends",
  "/wiki/40_ABY",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/27_ABY/Legends",
  "/wiki/Mind_tricks",
  "/wiki/Force_cloak",
  "/wiki/StealthX_wing",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Lightsaber_shoto",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/Legacy_of_the_Force:_Bloodlines",
  "/wiki/Legacy_of_the_Force:_Tempest",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Unknown_Regions"
 ]
}