{
 "name": "Lonay",
 "display_name": "Lonay",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Lonay was a male Twi'lek Vigo of Black Sun during the time of Prince Xizor's reign, and a cousin of smuggler Tru'eb Cholakk. He was described as sly, clever, and cowardly. He wore his lekku draped over his left shoulder, and was usually seen wearing garish jewelry. His cowardice prevented him from ever taking leadership of Black Sun.\nXizor placed Lonay in charge of silencing Kodo Finn, and he hired the Nashtah Gang to do so. Xizor took his anger out on Lonay when the gang failed. Later, he helped save Mako Spince's life from the NaQuoit Bandits and installed him as a traffic controller on Nar Shaddaa, and as eyes and ears for Black Sun on the Smuggler's Moon.\nOn the planet Talus Lonay, willing to play sabacc, visited the largest casino in the town of Nashal. He was playing against Kimmi Chyler, a famous swoop racer, who, when Lonay had wagered all his credits on a final showdown, beat him with a pure sabacc. The vigo went furious over his defeat and his guards had to hustle him out of the casino. However, they soon confronted Chyler and her bodyguard, once they left the casino, Lonay accused Chyler of cheating and stated that she had a skifter. Chyler and her companion immediately jumped on a nearby swoop, but Lonay and his thugs followed them in a XP-38 sport landspeeder. After a high-speed chase through the streets of Talus Chyler swung her swoop into a dead-end alley, with Lonay's speeder following just behind. At full speed she stood on the braking vanes and the swoop headed straight up out of the alley, while the speeder hit the wall hard. Chyler hovered for a second to appreciate the wreckage, but Lonay managed only to shake his fist at her, before she took the swoop into the night.\nThe next day Lonay was approached by an agent of the Imperial Security Bureau. His guards initially declined him the talk with the Vigo, but Lonay ordered them to let them in after the agent said that he was sent by Namman Cha. Embarrassed, with bumps and bruises on his face, head, and arms from the speeder crash, he told the Imperial about his setback and asked him to avenge his honor. The operative needed Lonay's cooperation for his investigation, so he accepted the job. He soon returned to the Vigo, telling him that while confronted in an alley, Chyler turned tail and ran, barely escaping with her life. Lonay was pleased with the result and explained that the Imperial would find help of Wrenga Jixton on Corellia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Mogra%27daal",
  "/wiki/Vigo/Legends",
  "/wiki/Time/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Tru%27eb_Cholakk",
  "/wiki/Lekku/Legends",
  "/wiki/Kodo_Finn",
  "/wiki/Nashtah_Gang",
  "/wiki/Mako_Spince",
  "/wiki/NaQuoit_Bandits",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Casino/Legends",
  "/wiki/City/Legends",
  "/wiki/Nashal",
  "/wiki/Kimmi_Chyler",
  "/wiki/Skifter/Legends",
  "/wiki/XP-38_sport_landspeeder",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Namman_Cha",
  "/wiki/Wrenga_Jixton",
  "/wiki/Corellia/Legends",
  "/wiki/Evasive_Action:_Prey",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/The_Shadow_Syndicate",
  "/wiki/West_End_Games",
  "/wiki/The_Regalia_of_Office",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/Shadows_of_the_Empire_(novel)",
  "/wiki/The_Obvious_Scapegoat",
  "/wiki/Out_of_the_Picture",
  "/wiki/Shadows_of_the_Empire:_Evolution",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Template:SWGTCG",
  "/wiki/Star_Wars:_Edge_of_the_Empire_Core_Rulebook"
 ]
}