{
 "name": "Longo_Two-Guns",
 "display_name": "Longo Two-Guns",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Clantaano III"
     ]
    },
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Clantaani"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Longo Two-Guns's gang",
      "Gardulla the Elder's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Longo Two-Guns, known as the \"fastest blaster on Tatooine,\" was a male Clantaani who was the leader of a criminal gang on Tatooine and worked for Gardulla the Hutt.\nThe gang was known throughout the planet due to their reputation; no one who set out after them came back. He could almost always be seen smoking t'bac. After a run-in with hired bounty hunter Jango Fett, Longo was captured and taken to Jabba Desilijic Tiure, who had earlier placed a large bounty on his head as punishment for the numerous raids he conducted against Jabba.\nLongo purportedly had the best aim of any blasterslinger on Tatooine. His skill as a marksman was complemented by good showmanship: he was very proficient at twirling the two guns in his fingers. Unfortunately for Longo, however, Jango Fett's Mandalorian body armor was able to deflect the weak blaster fire.\nIt was rumored he was hired by Gardulla the Elder to reclaim several towns owned by Jabba the Hutt. This resulted in the deaths of four of Jabba's personal assistants at the hands of Longo. Jabba then put out a 50,000-credit bounty on Longo's head, which Jango Fett set out to claim.\nFett tracked the criminal to his lair in the town of Mos Gamos, fighting his way through Longo's gang and confronting the gunslinger, who was holed up in a warehouse. Jango defeated Longo and laid claim to the bounty before Jabba.\nWhen finally captured by Jabba, Longo Two-Guns was then brought forward and put on the trap door, only to fall into the pit when the door opened beneath him. In the pit, Longo was axed to death by Lomrokk, one of Jabba's Gamorrean guards.\nKeenly aware of his own skills as a blast-fighter and buying into his own reputation, Longo Two-Guns was overconfident, coaxing Jango into challenging him and his \"boys.\" However, his confidence was misplaced, as the bounty hunter was able to overcome him and his gang in short order.\nLongo's weapons of choice were a pair of DL-18 blaster pistols, which he enjoyed twirling on his fingers.\nLongo Two-Guns was voiced by Tom Kane, the voice actor for Yoda in Star Wars: The Clone Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Clantaano_III",
  "/wiki/32_BBY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Clantaani",
  "/wiki/Gender/Legends",
  "/wiki/Blue",
  "/wiki/Orange",
  "/wiki/Longo_Two-Guns%27s_gang",
  "/wiki/Gardulla_the_Elder%27s_criminal_empire",
  "/wiki/Star_Wars:_Bounty_Hunter",
  "/wiki/Gardulla_Besadii_the_Elder/Legends",
  "/wiki/T%27bac",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Mos_Gamos",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars_Mythos",
  "/wiki/Lomrokk",
  "/wiki/Gamorrean/Legends",
  "/wiki/DL-18_Blaster_Pistol",
  "/wiki/Tom_Kane",
  "/wiki/Yoda/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_Bounty_Hunter:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars:_Bounty_Hunter_(article)",
  "/wiki/Star_Wars_Gamer_10",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/So_Uncivilized:_Great_Gunslingers_in_Star_Wars"
 ]
}