{
 "name": "Lonni",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Misanthrope"
     ]
    }
   ]
  }
 ],
 "content": "Lonni was a passenger aboard the ship Misanthrope which crash-landed on D'vouran. She was a friend of the pilot, Kevreb Bebo, and was marrooned on the planet with him and eighteen other survivors of the crash. The planet they landed on was not on the starcharts as it was \"created\" as part of Project Starscream.\nLonni and Bebo survived the crash with eighteen other people but many of them turned up missing over time. While they waited for help the rest discovered an old Imperial laboratory, in which they stayed. Lonni and Bebo were the last two survivors. The native Enzeen told them that the Imperials gave Bebo the blame for the crash and now he and Lonni had to stay on D'vouran. As other settlers came to the planet Bebo wanted to warn them of the disappearance of the people. Because he found a follower, which saved him for disappearing, he could warn the settlers but they thought he was mad.\nIn 0 ABY, Mammon Hoole, DV-9, Tash and Zak Arranda arrived on D'vouran and met Bebo. One day while Bebo and Lonni were walking through the Enzeen village, Lonni disappeared within a matter of seconds. All footprints indicating her steps had vanished. Moreover, Chood, one of the Enzeen leaders, portrayed to Hoole and his party that Lonni had never existed, as evidenced by the lack of footprints. Lonni had been consumed by the planet, but Chood passed the story off as Bebo's psychotic state.\nWhen Tash wanted to hear more of Bebo's story, she followed him to the laboratory, where he presented her his follower. There, she saw a hologram of Lonni.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Misanthrope",
  "/wiki/D%27vouran",
  "/wiki/Kevreb_Bebo",
  "/wiki/Planet/Legends",
  "/wiki/Starchart",
  "/wiki/Project_Starscream",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/D%27vouran_Imperial_laboratory",
  "/wiki/Enzeen",
  "/wiki/Mammon_Hoole",
  "/wiki/DV-9",
  "/wiki/Tash_Arranda/Legends",
  "/wiki/Zak_Arranda/Legends",
  "/wiki/Chood",
  "/wiki/Hologram/Legends",
  "/wiki/Galaxy_of_Fear:_Eaten_Alive"
 ]
}