{
 "name": "Lonni Jung",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau",
      "Luthen Rael's network"
     ]
    }
   ]
  }
 ],
 "content": "ISB Supervisor Lonni Jung was a human male who served as a mole for Luthen Rael in the Imperial Security Bureau of the Galactic Empire. In 5 BBY, he attended a meeting of supervisors on the planet Coruscant. During the meeting, the host, Major Partagaz, asked Jung about his requests for protection on traffic to the Abrion sector, to which the supervisor explained that there was increasing construction shipments going to the planet Scarif.\nDuring the time of the Galactic Empire, Lonni Jung served in the Imperial Security Bureau. Since 11 BBY, Jung had been working his way up the Bureau, reaching the position of ISB Supervisor and the rank of lieutenant by 5 BBY. Between 6 and 5 BBY, his daughter was born, and he became a father.\nIn 5 BBY, he attended a meeting of supervisors led by Major Partagaz in a bureau building on the planet Coruscant. When Partagaz asked the room at large what the purpose of the bureau was, Jung did not answer, and the major went on to claim its purpose was to cure the \"sickness\" of disorder within the Empire.\nPartagaz then reassigned an unfinished memorandum that Supervisor Lagret was working on, causing Lagret to turn in dismay to Jung, who was sat next to him. The major later asked Jung to elaborate on requests that had been made for additional protection for traffic to the Abrion sector. Jung explained that the requests were a proactive measure due to an increase in construction shipments going to Scarif, a planet located in the Abrion sector.\nThe Imperial payroll for an entire sector was later stolen from an Imperial installation on the planet Aldhani. Numerous bureau staff, including Jung and the other supervisors, were then summoned back to the meeting room, where they were informed by Partagaz that they should tell their staff and families that they were not be going home. He then told those assembled that he wanted every Star Sector and Planetary Emergency Retaliation plan in the building to be ready for presentation by midnight.\nAfterward, Jung attended a meeting attended by multiple other ISB officers, led by Colonel Wullf Yularen, in which the latter declared that the ISB should have no issue accessing Army or Naval resources, and announcing multiple consequences as a result of the Aldhani incident. At another point, Jung was in a meeting with fellow ISB officers, where he provided three theories to Partagaz explaining why he failed to keep pace with his neighboring sectors. After requesting guidance from Partagaz, the latter demanded a complete audit of hyperspace lanes leading to Ord Mantell by the same time the next day. He would later be present during another meeting which Colonel Yularen attended, in which fellow Supervisor Dedra Meero presented her thesis regarding a rebel effort specialising in the theft of Imperial equipment. \nDuring another meeting in which Meero expanded on her work against the rebel effort, Jung noted that Cassian Andor, one perpetrator of the Ferrix incident, was throughout the document. As Meero suggested a connection to Aldhani as Andor returned with money, he corrected Supervisor Lagret's theory regarding the money being from the sale of an Imperial N-S9 Starpath Unit found on Ferrix. Jung would later arrive to another meeting in a hurry regarding a captured pilot working with Anto Kreegyr, leader of a rebel cell. Once he learned that the pilot was enroute to Kafrene, he pointed out Kreegyr would count the pilot missing, and that he would be suspicious if the ship was destroyed as Lagret suggested; Supervisor Meero would then suggest the ship be fouled in a staging. Jung, alongside Lagret, was later told to meet with Military Intelligence regarding Kreegyr's cell probing the Spellhaus power station. \nKreegyr's men took the bait placed by Meero, and Jung was present when Major Partagaz learned of the results. He then suggested, contrary to Partagaz's original course of action, that the ISB investigate as they would normally, under the assumption that Kreegyr's men would still be watching. Jung would then make his way into the Coruscanti undercity, meeting with Luthen Rael regarding Anto Kreegyr. When Rael suggested Kreegyr's men continue ahead to reduce suspicion, Jung expressed discomfort. He then stated that he wished to forfeit his position, having become a parent. Rael refused, listing the sufferings he had lived through as a result of his dedication to the Rebellion. With the final comment that Luthen would need all the heroes he could get, Jung left.\nA human male, Lonni Jung had auburn hair, blue eyes, and light skin.\nJung wore a white Imperial officer's uniform with two code cylinders and a rank insignia plaque with three blue squares.\nLonni Jung was portrayed by Robert Emms in \"Aldhani,\" the fourth episode of the television series Andor, which aired on September 28, 2022. Prior to the episode's release, he was visually revealed in the teaser trailer for the show which aired on May 26, 2022.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jung_(disambiguation)",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Luthen_Rael%27s_network",
  "/wiki/ISB_Supervisor",
  "/wiki/Spy",
  "/wiki/Luthen_Rael",
  "/wiki/5_BBY",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Major",
  "/wiki/Partagaz",
  "/wiki/Abrion_sector",
  "/wiki/Scarif",
  "/wiki/Imperial_Era",
  "/wiki/11_BBY",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/6_BBY",
  "/wiki/Lonni_Jung%27s_daughter",
  "/wiki/ISB_Central_Office",
  "/wiki/Lagret",
  "/wiki/Sector",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_dam",
  "/wiki/Aldhani",
  "/wiki/Colonel",
  "/wiki/Wullf_Yularen",
  "/wiki/Dedra_Meero",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Imperial_N-S9_Starpath_Unit",
  "/wiki/Anto_Kreegyr",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Aldhani_(episode)",
  "/wiki/September_28",
  "/wiki/2022",
  "/wiki/May_26",
  "/wiki/The_Eye",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Lonni_Jung",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/June_4",
  "/wiki/File:Imperial_Forces_Rank_Chart_-_Rogue_One.png",
  "/wiki/Kassa_(episode)",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}