{
 "name": "Looie",
 "display_name": "Looie",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Psadan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' GuildCrimson Nova",
      "Crimson Nova"
     ]
    }
   ]
  }
 ],
 "content": "Looie was a Psadan and a member of the Crimson Nova chapter of the Bounty Hunters' Guild. He ran the Redemption Center prison on the Rig.\nIn 22 BBY, Looie was stationed with many other bounty hunters on the Rig space station, where Mika raised high bounty on every Jedi. However, when the Jedi decided to prove to the Crimson Nova that no catch bonuses should be suspended on Jedi, Mace Windu traveled to the rig to capture the client there along with Kit Fisto, Agen Kolar, and Saesee Tiin that accompanied him to the space station under covert identity. When Agen Kolar, who claimed to be the bounty hunter Argent Kole, wanted to deliver his prey, Looie replied that Argent Kole was not listed as a bounty hunter in his records. Nevertheless, he had Kit delivered to the cell block below. After Kit overpowered the guards and rioted among the rest of the detainees, Looie said that he was not paying Argent Kole a premium. In this way, Kole was able to instigate another uprising among the bounty hunters in order to fight for the promised payment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Psadan",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Crimson_Nova",
  "/wiki/Redemption_Center",
  "/wiki/The_Rig",
  "/wiki/22_BBY/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Mika",
  "/wiki/Jedi/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Agen_Kolar/Legends",
  "/wiki/Saesee_Tiin/Legends",
  "/wiki/Argent_Kole",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Looie",
  "/wiki/Republic_65",
  "/wiki/Jedi_Council_Forums",
  "/wiki/July_21",
  "/wiki/2014"
 ]
}