{
 "name": "Lop",
 "display_name": "Lop",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tao"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lepi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yasaburō clan"
     ]
    }
   ]
  }
 ],
 "content": "Lop was a Force-sensitive Lepi female resident of the planet Tao during the Imperial Era. An orphan who was not originally from Tao, Lop was an enslaved laborer for the Galactic Empire, which had occupied the planet. After escaping the Empire, Lop was adopted by Boss Yasaburō of the powerful Yasaburō clan at the insistence of his daughter, Ochō.\nYears after Lop's adoption into the Yasaburō clan, Yasaburō and Ochō took opposite sides of a rebellion against the Empire. With her father supporting the insurgency and her sister opposed, Lop found herself trying to mediate between her family members. Ultimately, Ochō joined the Empire and Yasaburō trained Lop to use their family's lightsaber to confront Ochō.\nLop was a Lepi female born on a different planet than Tao. At some point in her early life, she was brought to Tao to work as a slave for the Galactic Empire. Lop eventually lost her parents, leaving her as an orphan. At some point, Lop gained a droid companion, TD-4.\nDuring the Imperial Era, Lop and TD-4 fled to escape from slavery. She met a human father Yasaburō and his young daughter Ochō at a market. Yasaburō had a scar that had rendered one of his eyes blind. The humans saw the young Lepi attempting to steal fruit, and asked about Lop's origins and parents. After hearing Lop's stomach rumble from hunger, Ochō invited Lop to join their family, insisting that she could tell by looking at the Lepi that Lop was a good kid. Ochō enthusiastically took Lop in hand to play on the beach, guilting her father into adopting Lop. Yasaburō promised to clean Lop up and get her well-fed. TD-4 cut off Lop's shock collar, then recorded a hologram of the trio smiling on the beach.\nLop and Ochō came to regard each other as sisters. Yasaburō welcomed Lop as his daughter, and she referred to him as her father.\nSeven years after joining the Yasaburō clan, an Imperial base on Tao was attacked. An explosion rocked the local town, and Lop woke up among smoke and debris from the destruction. Coming to, the Lepi donned her side glasses to view the wreckage in the infrared spectrum, before hearing Ochō confront Yasaburō over what had happened. Ochō asked their father what he had done, crying out that the town had been destroyed. After hearing Ochō's words, Lop expressed disbelief aloud that the explosion was her father's doing. She rushed over to a scene where Yasaburō and Ochō were fighting, surrounded by a crowd of affiliates of their clan.\nOchō expressed indignation that her father attacked the Imperial base, while Yasaburō justified his supported for the insurgency against the Empire on the grounds of the Empire polluting and pillaging their planet. Yasaburō clan members attempted to separate the quarreling father and daughter, saying they needed to flee before Imperial troops arrived. Upon seeing Lop approach, one clan member implored the Lepi to intervene. Lop begged her family members to stop, saying there was no reason for them to fight each other. Yasaburō silenced Lop, saying this was a problem for the head of the family. Ochō exhorted her father, claiming a right as the next head of family to assert her opinion. Ochō denounced her father's anti-Imperial views as \"stubborn opposition to development\" and wrong. The father and daughter continued to argue as Lop stood on. Imperial stormtroopers approached on speeder bikes, causing the crowd to flee.\nLop drove in a landspeeder with Ochō, telling her sister she ought to consider how Father felt about the Empire and their homeworld. Ochō doubted that Yasaburō would understand her opinion, but Lop said she wanted their family to stop fighting because they were family. Despite her origins offworld, Lop had come to feel at home on Tao and could relate to Yasaburō's animus for the Empire's degradation of their world's ecology. Ochō said she could relate as well, expressing her love for Tao and her father, and claiming that was exactly why she must support the Empire: \"for the sake of our future.\"\nLop and Ochō were stopped at an Imperial roadblock on a bridge, where an Imperial officer stopped the sisters. The officer said he had been waiting for Ochō, leading Lop to question whether her sister knew the officer. The officer said he and Ochō knew each other well and that Ochō was \"sensible enough\" to see the many benefits the Empire could offer. He said Ochō had promised to stop the insurrection before it escalated, but she had failed. Lop, distraught, asked Ochō whether she had indeed tried to stop Yasaburō without even talking to him first. Ochō confirmed that, saying she couldn't \"leave it up to\" their father anymore. The officer then said the Empire would have to make life even more difficult for the Yasaburō clan. The officer asked Ochō to join the Empire's \"redevelopment initiative,\" saying they could together put an end to the bloodshed. Ochō joined the officer, cutting her hair and leaving the long braid in Lop's hands.\nAfter Ochō joined the Imperial troops, Lop jumped off the bridge with TD-4, sobbing and running away until she landed in the marketplace where she had met Ochō seven years prior. The Lepi kept running back to her mountain home at the Yasaburō household, where she found nearly all the clan employees gone. When she arrived home she asked about the whereabouts of her clan, Yasaburō replied that almost all the employees had fled, but first asked for paid time off. Lop's father asked where Ochō was. In response, the Lepi handed Yasaburō Ochō's hair braid and solemnly told her father that Ochō had joined the Empire. The family boss was saddened and angered to learn this. Lop explained that the Empire asked Ochō to try to talk him out of what they called his \"terrorist plans,\" and that if Ochō failed, they would crack down on the Yasaburō clan.\nLop poured out her feelings to her father, expressing her desire to repel the Empire from Tao and rebuild their family. In response, her father escorted Lop to a candle-lit chamber deep within their home. Yasaburō apologized for seeming to favor Ochō over Lop. Yasaburō then began teaching Lop their family's history and performing a ritual of inheritance, naming Lop as his heir.\nHundreds of years ago, a Jedi had come to Tao, settling on the planet and eventually dying there. Before he died, the Jedi encountered an ancestor of the Yasaburō clan to whom he entrusted his lightsaber and trained in lightsaber combat. Thereafter, the lightsaber became a Yasaburō family heirloom, being passed down through the generations of the Yasaburō family. Each family leader taught their successor lightsaber combat and passed the blade on as inheritance, representing the bond between parent and child. Yasaburō entrusted the saber to Lop, declaring her his successor as clan leader. Lop was humbled but respectfully accepted the honor. Yasaburō told his daughter that this might be the end of their family, but he was glad she was a part of it. He told Lop to wait at home while he tried to retrieve Ochō and repatriate her to the family. Before he left, Lop told her dad that Ochō still loved him, which consoled him.\nAfter some time waiting, Lop heard an explosion at the Imperial base. Lop mounted a speeder and rushed to the base. Eventually, Lop jumped off a bridge to avoid stormtroopers. After the speeder was destroyed, she and TD glided to the base's interior via umbrella. Once inside, her presence distracted her dad, who got blinded by Ochō. Lop ran to Yasaburō's side, where he asked Lop to save her sister, and admitted his failure as Ochō's father. Ochō then angrily leapt to finish her father off, but was blocked by Lop wielding the heirloom lightsaber, surprising Ochō. Yasaburō explained to her that he passed it to his other daughter because of his belief that, when it comes to inheritance, there are more important things than blood. Angered even further, Ochō attacked Lop, who pleaded with her sister to return home. TD-14 projected the original hologram of their family taken just after Lop was adopted, but was cut down by Ochō. Saddened, but made more determined by the destruction of her droid, Lop awakened her force and vowed to bring her sister's real self back while clashing with her. Lop used the Force to summon one of her father's sai and destroyed Ochō's electric staff, before slashing at her sister, scarring Ocho's chest and knocking her off of the edge of the base. Ochō survived the blow and landed on an Imperial ship about to leave Tao. The sisters gave each other one last stare before the ship fled. Afterwards, Lop picked up TD-4's head which again projected the family hologram. As she watched the recording, she repeated the younger Ochō's hopes that one day they would be a proper family.\nLop was highly empathetic. When Ochō and Yasaburō found themselves on opposite sides of the rebellion on Tao, affiliates of Yasaburō clan called on her to mediate between her adopted sister and father. Lop asked Ochō to consider Yasaburō's feelings about the Empire and their homeworld, hoping to end the tensions within their family. Despite being born on another planet, Lop came to feel at home on Tao.\nEven as a runaway slave, Lop was very nimble and agile, able to leap between walls of buildings to ascend and to jump down from great heights without getting hurt. She was skilled enough to escape Imperial slavery and avoid being caught by Imperial forces.\nAs a Force-sensitive, Lop was capable of using telekinesis. She did so when she called her father's dagger to her side while fighting Ochō. She became skilled with a lightsaber, as shown when she used the Yasaburō family heirloom lightsaber in her duel against Ochō.\nLop was given the Yasaburō clan lightsaber as her inheritance by her father Yasaburō, as part of the Yasaburō clan's tradition of passing the saber and lightsaber swordsmanship down through the generations. She also wore a set of side glasses which could pull up information or show her surroundings in the infrared spectrum, and wielded an umbrella that she could use to glide a short distance with.\nLop appeared in \"Lop \u0026 Ochō,\" a short film in the Star Wars: Visions series written by Sayawaka and directed by Yuki Igarashi. The short, produced by Geno Studio, released on Disney+ on September 22, 2021. Igarashi wished to create a character that was symbolic and who was also a non-human being. In the behind-the-scenes featurettes, it's explained that the creators wanted Lop to be based on a pre-existing rabbit alien species; they were told about Jaxxon and his species, the Lepi, from Coachelle Prime, so they had the idea of making Lop being from a short subspecies.\nIn the behind the scenes of Star Wars: Visions, the \"Lop \u0026 Ochō\" filmmakers revealed that they are hoping that the audiences will see Lop go after Ochō and become sisters again.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Tao",
  "/wiki/Lepi",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Yasabur%C5%8D_clan",
  "/wiki/Force-sensitive",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Slavery",
  "/wiki/Galactic_Empire",
  "/wiki/Boss",
  "/wiki/Yasabur%C5%8D",
  "/wiki/Och%C5%8D",
  "/wiki/Rebellion_on_Tao",
  "/wiki/Yasabur%C5%8D_family_heirloom_lightsaber",
  "/wiki/TD-4",
  "/wiki/Human",
  "/wiki/Parent",
  "/wiki/Youngling",
  "/wiki/Shopping_district",
  "/wiki/Eye",
  "/wiki/Thief",
  "/wiki/Fruit",
  "/wiki/Shock_collar",
  "/wiki/Standard_year",
  "/wiki/Attack_on_Tao%27s_Imperial_base",
  "/wiki/Side_glasses",
  "/wiki/Imperial_Military",
  "/wiki/Stormtrooper",
  "/wiki/Speeder_bike",
  "/wiki/SLA-93",
  "/wiki/Landspeeder",
  "/wiki/Homeworld",
  "/wiki/Unidentified_Imperial_officer_(Tao)",
  "/wiki/Standard_century",
  "/wiki/Unidentified_Jedi_(Tao)",
  "/wiki/Jedi",
  "/wiki/Unidentified_Yasabur%C5%8D_clan_ancestor",
  "/wiki/Lightsaber",
  "/wiki/Lightsaber_combat",
  "/wiki/Telekinesis",
  "/wiki/Jacqui_Lopez",
  "/wiki/Lop_%26_Och%C5%8D",
  "/wiki/Sayawaka",
  "/wiki/Yuki_Igarashi",
  "/wiki/Geno_Studio",
  "/wiki/Disney%2B",
  "/wiki/September_22",
  "/wiki/2021",
  "/wiki/Jaxxon_T._Tumperakki",
  "/wiki/Coachelle_Prime",
  "/wiki/Star_Wars:_Visions_Filmmaker_Focus",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Category:Images_of_Lop",
  "/wiki/Lop_%26_Och%C5%8D_(manga)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/July_3",
  "/wiki/July_15",
  "/wiki/July_16"
 ]
}