{
 "name": "Lor San Tekka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 45 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Tuanul",
      "Jakku"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.85 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Church of the Force",
      "New Republic",
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Lor San Tekka was a human male explorer and parishioner of the Church of the Force who was born in the waning years of the Galactic Republic. He became a believer in the ideals of the Jedi Order during the Clone Wars, despite not being force-sensitive, and followed the underground faith of his church during the dark times of the Galactic Empire's rule over the galaxy. San Tekka found Jedi lore that the Empire attempted to suppress, and his knowledge of the galaxy and its history was useful to the New Republic after it prevailed over the Empire during the Battle of Endor and began a period of galactic reconstruction. Lor San Tekka also helped Luke Skywalker, the last known Jedi Knight at the time, seek out Jedi lore that the Empire had attempted to destroy. At some point, San Tekka lived with the Crèche and learned about their spiritual culture.\nAfter Skywalker's new generation of Jedi was destroyed by his nephew and apprentice, Kylo Ren, Skywalker went into exile and sought out the first Jedi Temple on Ahch-To. San Tekka, who retired to a spiritual village on the planet Jakku, discovered a fragment of a map that could lead to Ahch-To. He was sought by the Resistance, led by Skywalker's sister, General Leia Organa, as well as the First Order, a resurgent fascist power from the Unknown Regions. San Tekka gave the map fragment to Resistance Commander Poe Dameron and was soon captured by Kylo Ren, who demanded to know where the map was. When San Tekka refused to comply, Ren killed him. San Tekka's sacrifice was not in vain; the map was given to the Resistance, and a young Force-user named Rey followed it to Ahch-To and found the exiled Jedi Master.\nLor San Tekka was born in the waning years of the Galactic Republic. As a young man, he came to have a high regard for the Jedi Order and knew about the actions of the Jedi Knights during the Clone Wars. After the rise of the Galactic Empire and the destruction of the Jedi, San Tekka never believed the Emperor when he branded the Jedi traitors. San Tekka was a member of the Church of the Force during Imperial rule, following the underground faith that believed in the Jedi ideals despite not being Force-sensitive himself. He uncovered much of the history of the Jedi Knights that the Empire attempted to bury, leading many individuals to seek him out for his knowledge of Jedi lore.\nSan Tekka was a seasoned traveler and explorer on the remote fringes of the galaxy. Following the defeat of the Empire at the Battle of Endor, San Tekka aided the fledgling New Republic by providing bureaucrats with information regarding worlds across the galaxy. This helped the New Republic greatly, as the Empire destroyed many documents that would have been useful for galactic reconstruction.\nAs an ally of Jedi Knight Luke Skywalker and his sister, Princess Leia Organa, San Tekka helped the last Jedi recover secret Jedi lore that the Empire had tried to erase. Luke Skywalker made use of the Jedi star compass he had discovered in the Emperor's storehouse on Pillio. With a plasma-encased supraluminite lodestone at its center, the compass functioned much like the ancient wayfinders and was attuned to specific points in hyperspace. Through studying the compass, he uncovered a path to Ahch-To, the site of Temple island and the first Jedi Temple. With the help of Lor San Tekka, he finally put together the many clues and learned the location of the temple, a discovery that Skywalker kept to himself. San Tekka also came to know Ben Solo, the son of Organa and the smuggler Han Solo.\nOn one occasion, Skywalker and the boy accompanied San Tekka on a mission to the planet Elphrona, having received information on an ancient Jedi outpost. Amid the ruins, the trio was confronted by the Knights of Ren, who attempted to persuade young Solo to join them, but were ultimately defeated by Luke and fled.\nYears later, San Tekka found out that Solo did indeed turn to the dark side of the Force and joined the Knights, becoming Kylo Ren after the destruction of Skywalker's new generation of Jedi. Skywalker vanished into exile after his Jedi were destroyed and went to the first Jedi Temple on the planet Ahch-To. San Tekka, who discovered with Luke years ago the first Jedi Temple, owned a partial map that revealed the location of the Jedi Master.\nAt some point, San Tekka lived with the Crèche on Ovanis, where they guarded a sacred egg that they believed would hatch a savior who would bring salvation to the galaxy. San Tekka lived there for two years to learn about the Crèche, who were a very protective people. He gained their trust because of how much time he spent there learning their ways, and they referred to him as \"the explorer.\"\nThe Resistance, a private pro-New Republic paramilitary force led by now-General Organa, and the First Order, a resurgent fascist power led by the mysterious Supreme Leader Snoke, both learned that San Tekka had the map to Skywalker in his possession. Hoping that her brother could help defeat the First Order, Organa sent Commander Poe Dameron, a pilot in the Resistance, to search for San Tekka.\nFollowing San Tekka's trail, Poe and Black Squadron traveled to Ovanis. There, Dameron met with the Crèche, whom the explorer had met a long time ago. Dameron was followed by the First Order Agent Terex, who had learned of his presence through a spy. After the skirmish on Ovanis, Black Squadron traveled to the prison world of Megalox Beta to question Grakkus the Hutt about his encounter with San Tekka. Despite facing opposition from Terex, Black Squadron managed to rescue Grakkus, who gave him information on the places that San Tekka had visited.\nLater, San Tekka traveled to Cato Neimoidia, where he disguised himself and went on a guided tour in the Palace of Baron Paw Maccon. He broke off from the group and headed into the vaults. Using a special cloak he managed to walk through laser barriers and enter one of the vaults with a golden box inside. San Tekka opened it and found an ancient object crafted by using both the light side and dark side of the Force. His break-in hadn't gone unnoticed, though, and guards appeared, arresting San Tekka.\nHe was put in golden chains inside a prison cell. San Tekka claimed that they had no right to hold him and that he had only looked at the object, never intending to steal it. His pleas were ignored by Maccon but at the very same time, a significant ship landed at Baron Reya's platform. Maccon asked furiously what tricks Reya has used to get such a significant client. When the occupant took a few steps out of the ship, Maccon didn't recognize her but San Tekka informed him that it was Leia Organa.\nDuring his trial, San Tekka explained to Maccon why he had acted as he did, but Maccon didn't listen and instead stated that San Tekka would be executed. He was shocked but he was taken away.\nWhen San Tekka was in his cell, Dameron suddenly broke in. He had hidden in Organa's gowns which she wanted to store in Maccon's vaults. It was all a big plan to save San Tekka. They both hid inside the same gowns, which were now being taken back to Organa's ship due to her not feeling her gowns were safe. Dameron then got out to help Black Squadron in the sky, fighting old vulture droids. Unknown to them, Commander Malarus and Terex had snuck aboard the ship and now took off with San Tekka on board.\nMalarus left the ship to engage in the dogfight in the sky while leaving Terex in charge of the ship. Terex left Cato Neimoidia and headed off into hyperspace with San Tekka on board. Terex then opened the door to Organa's gowns and let the old man out. San Tekka, not knowing who Terex was, asked if he was in Dameron's company. Terex answered that he knew him all too well. When Terex was charging an Z6 riot control baton into his own head, San Tekka suggested that it might be dangerous to the First Order agent. Terex then called Captain Phasma, offering her San Tekka in exchange removing the implants on his head.\nTerex got rid of Organa's gowns, flushing them out in hyperspace, believing that they might host explosives, poison or trackers. When Terex continued to charge the baton into his head, San Tekka advised him to stop or otherwise he would die. They shared a friendly conversation, and Terex said that he liked San Tekka and that it would almost be a pity to give him to the First Order. When Terex showed up to Phasma he didn't have San Tekka with him, saying that he would not give her the old man until the First Order removed his implants. When he had gotten his implants removed he headed off into space, giving the First Order the location of San Tekka. At the same time, however, he also called the Resistance and gave them the location of San Tekka, since he didn't care whether the First Order or the Resistance got to San Tekka first, and either scenario would be a win for him. He then sent coordinates revealing that San Tekka was floating around in a spacesuit in the Great Forveen Nebula. He was rescued by Black Squadron, who brought him to their secret base on D'Qar. San Tekka told Leia that although he didn't know where Skywalker was, he had his suspicions, and asked for a starship so he could investigate a bit. Once he had Skywalker's location, San Tekka would send word of where they could meet up with him and get the information. Shortly after San Tekka's departure, Organa reunited with Dameron, informing him of his mission and that San Tekka had the map to her brother. She told him that San Tekka and the map were on Jakku, remarking that the Empire had ended there and now the end of the First Order would come from the same place.\nWhen Dameron arrived on Jakku, he met with San Tekka at a village. Knowing that the return of the Jedi was essential for the balance of the Force, San Tekka gave the map to Dameron just before the First Order arrived. Dameron fled as Ren arrived with his forces and assaulted the village, during which San Tekka was captured by stormtroopers and brought before Ren. The dark warrior demanded the map to Skywalker while San Tekka lamented what the young man had become. When San Tekka did not comply and alluded to Ren's heritage as a Skywalker, Ren, while sarcastically agreeing with San Tekka's claim that the dark knight couldn't escape the truth regarding his family, killed him with his lightsaber and ordered the destruction of the village.\nThe map that San Tekka gave his life to protect ultimately made its way to the Resistance. Dameron, who managed to escape from Jakku, reported to Organa, telling her that he lost the map and that San Tekka was killed, but Organa assured him that BB-8 was at Takodana, leading them to go there and rescue the droid. Later, Rey, a young Force user who had also hailed from Jakku and helped bring the map to the Resistance, was sent by Organa to Ahch-To. There, she discovered the exiled Jedi Master and offered him the lightsaber that had once belonged to him and his father, a sign of the only hope that the galaxy had left.\nLor San Tekka was a human male. He stood at 1.85 meters and had white hair, blue eyes, and light skin. A seasoned explorer, San Tekka had knowledge and wisdom from across the galaxy, including the hidden lore of the Jedi Order that the Galactic Empire tried to suppress in the wake of the Clone Wars. San Tekka was a member of the Church of the Force and a believer in the ideals of the Jedi Knights. He believed that the Jedi were essential to the balance of the Force and helped the Resistance find the vanished Jedi Master Luke Skywalker, unable to stand idly by as despair and darkness grew in the galaxy.\nSan Tekka traveled lightly in his later years and showed wisdom with the few artifacts he continued to carry from place to place. He often wore a homespun fantabu-wool coat, along with a tuanulberry-dyed linen tunic and gundark-hide survival belt. Around his neck he wore what was dubbed the Chain of Wisdom, while his most cherished artifact was the antiquated data storage unit in a plain leather sack that held the map to Luke Skywalker.\nLor San Tekka is a character created for the 2015 film Star Wars: Episode VII The Force Awakens, directed by J.J. Abrams and co-written by Abrams and Lawrence Kasdan. The character was portrayed by Max von Sydow.\nLucasfilm Story Group member and author of Star Wars: The Force Awakens: The Visual Dictionary, Pablo Hidalgo, revealed in an interview that they were considering making San Tekka a priest in the Church of the Force. He also revealed that the Church was originally conceived by George Lucas for a Star Wars live-action TV series. It was held behind the scenes before the backstory was added to Star Wars: Episode VII The Force Awakens.\nSan Tekka was also featured in the 2016 video game LEGO Star Wars: The Force Awakens. His role in the game is largely the same as in the film, but instead of Ren killing him with his lightsaber, Ren's lightsaber malfunctions and San Tekka laughs at him, causing the enraged Ren to launch him into space. The next level shows that San Tekka is still alive floating in space. The game also features a bonus mission titled \"Lor San Tekka's Return,\" which details San Tekka's arrival on Jakku shortly before the meeting with Dameron. The level portrays San Tekka as a close friend of bounty hunter Athgar Heece, who first helps him get to the Tuanul village but is then implied to be the one to betray San Tekka's location to the First Order.\nThe announcement of the postponement of the Star Wars: The High Republic multimedia project included a mention of a San Tekka clan. Author Charles Soule later affirmed the connection between the clan and the character, although this has yet to be revealed in official story materials.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/The_Rise_of_Kylo_Ren_2",
  "/wiki/Star_Wars:_Poe_Dameron",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Talk:Lor_San_Tekka",
  "/wiki/Star_Wars:_Poe_Dameron_Book_VI:_Legend_Found",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/45_BBY",
  "/wiki/34_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Tuanul",
  "/wiki/Jakku",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Church_of_the_Force",
  "/wiki/New_Republic",
  "/wiki/Resistance",
  "/wiki/Reproduction",
  "/wiki/Standard_year",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Order",
  "/wiki/Clone_Wars",
  "/wiki/Force-sensitive",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/The_galaxy",
  "/wiki/Jedi",
  "/wiki/Galaxy",
  "/wiki/Timeline_of_galactic_history",
  "/wiki/Battle_of_Endor",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi_Knight",
  "/wiki/Time",
  "/wiki/Cr%C3%A8che",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Ben_Solo",
  "/wiki/First_Jedi_Temple",
  "/wiki/Ahch-To",
  "/wiki/Planet",
  "/wiki/Map_to_Skywalker",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/First_Order",
  "/wiki/Fascism",
  "/wiki/Unknown_Regions",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Attack_on_Tuanul",
  "/wiki/Death",
  "/wiki/Rey_Skywalker",
  "/wiki/Jedi_Master",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Emperor",
  "/wiki/Bureaucrat",
  "/wiki/Prince",
  "/wiki/Pillio",
  "/wiki/Supraluminite",
  "/wiki/Lodestone",
  "/wiki/Wayfinder",
  "/wiki/Hyperspace",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Mission_to_Elphrona",
  "/wiki/Elphrona",
  "/wiki/Elphrona_Outpost",
  "/wiki/Knights_of_Ren",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Exile_(punishment)",
  "/wiki/Ovanis",
  "/wiki/Cr%C3%A8che_egg",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Pilot",
  "/wiki/Hunt_for_Lor_San_Tekka",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/Spy",
  "/wiki/Mission_to_Ovanis",
  "/wiki/Squadron",
  "/wiki/Mission_to_Megalox_Beta",
  "/wiki/Prison",
  "/wiki/Megalox_Beta",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Hutt",
  "/wiki/Cato_Neimoidia",
  "/wiki/Great_Vaults_of_Cato_Neimoidia",
  "/wiki/Baron",
  "/wiki/Paw_Maccon",
  "/wiki/Cloak",
  "/wiki/Laser",
  "/wiki/Gold",
  "/wiki/Kazerath",
  "/wiki/Light_side_of_the_Force",
  "/wiki/The_Force",
  "/wiki/Neimoidian_Royal_Guard",
  "/wiki/Leia_Organa%27s_ship",
  "/wiki/Reya",
  "/wiki/Starship",
  "/wiki/Clothing",
  "/wiki/Mission_to_Cato_Neimoidia_(Resistance)",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Malarus",
  "/wiki/Z6_riot_control_baton",
  "/wiki/Captain",
  "/wiki/Phasma",
  "/wiki/Poison",
  "/wiki/Baton",
  "/wiki/Realspace",
  "/wiki/Galactic_coordinates",
  "/wiki/EVA_suit",
  "/wiki/Great_Forveen_Nebula",
  "/wiki/Rescue_of_Lor_San_Tekka",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Battle_of_Jakku",
  "/wiki/First_Order_military",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Skywalker_family",
  "/wiki/Kylo_Ren%27s_lightsaber",
  "/wiki/Sacred_Villages",
  "/wiki/BB-8",
  "/wiki/Takodana",
  "/wiki/Battle_of_Takodana",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Anakin_Skywalker",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Fantabu",
  "/wiki/Tuanulberry",
  "/wiki/Gundark",
  "/wiki/Belt",
  "/wiki/Chain_of_Wisdom",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/J.J._Abrams",
  "/wiki/Lawrence_Kasdan",
  "/wiki/Max_von_Sydow",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Underworld",
  "/wiki/2016",
  "/wiki/Video_game",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Athgar_Heece",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/San_Tekka_clan",
  "/wiki/Before_the_Awakening",
  "/wiki/Poe_Dameron_1",
  "/wiki/Poe_Dameron_2",
  "/wiki/Poe_Dameron_3",
  "/wiki/Poe_Dameron_4",
  "/wiki/Poe_Dameron_5",
  "/wiki/Poe_Dameron_6",
  "/wiki/Poe_Dameron_8",
  "/wiki/Poe_Dameron_9",
  "/wiki/Poe_Dameron_11",
  "/wiki/Poe_Dameron_14",
  "/wiki/Poe_Dameron_20",
  "/wiki/Poe_Dameron_21",
  "/wiki/Poe_Dameron_22",
  "/wiki/Poe_Dameron_23",
  "/wiki/Poe_Dameron_24",
  "/wiki/Poe_Dameron_25",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Leia_Organa_-_A_Princess,_A_General,_A_Mentor",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens_Read-Along_Storybook_and_CD",
  "/wiki/The_Force_Awakens_(Golden_Book)",
  "/wiki/Finn_%26_the_First_Order",
  "/wiki/Finn_and_Poe_Team_Up!",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_1",
  "/wiki/Poe_Dameron_26",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Force_Awakens:_New_Adventures",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_VII:_The_Force_Awakens",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_43",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_26",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_32",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_59",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_4",
  "/wiki/Star_Wars_Universe",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/The_First_Order",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/Beaumont_Kin",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/5_BBY",
  "/wiki/January_12",
  "/wiki/2021",
  "/wiki/January_13"
 ]
}