{
 "name": "Lorana_Jinzler",
 "display_name": "Lorana Jinzler",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "49 BBY",
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "27 BBY",
      "Outbound Flight"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jorus C'baoth"
     ]
    }
   ]
  }
 ],
 "content": "Lorana Jinzler was a Human female Jedi Knight of the Jedi Order and served as a former Padawan of Jedi Master Jorus C'baoth. She had dark hair and gray eyes, and was of medium height.\nLorana's parents were both employees at the Jedi Temple on Coruscant. When she was born and taken in by the Jedi Order, her parents were dismissed in accordance with the Jedi Code regarding emotional attachments and relationships. Her parents kept track of her Jedi training via a friend who still worked at the Temple. The third of four Jinzler children, Lorana was accepted for Jedi training at the age of 10 months, and was taken to the Temple, only meeting her jealous, hurt brother Dean at the initiation of Outbound Flight.\nOften surprised by her master's gruff tone and high expectations, Jorus C'baoth and Lorana weren't as close as other Padawans and their Jedi Masters. Lorana was often unsure of the Jedi's role, unlike her master, who believed Jedi had the power and inherent role to rule others who were not Force-sensitive, and watch over them.\nShortly before she became a Jedi Knight, Lorana and C'baoth were sent on a mission to the planet of Barlok. They met with Obi-Wan Kenobi and his Padawan, Anakin Skywalker. C'baoth sent them away while he attended a meeting. Later, Lorana was captured by terrorists, but was rescued by Kenobi and Skywalker. The next day she attempted to stop the missile that was sent to destroy the negotiators, but failed. Her master, however, destroyed it.\nAt age 22, Lorana was promoted to the level of Jedi Knight shortly before the launch of Outbound Flight, although this was because Master C'boath wanted her to come with him on Outbound Flight.\nLorana was selected for the Outbound Flight exploration mission by her master. She was far more reasonable and humble than C'baoth, and during the initial stages of the flight, she could usually be found trying to appease the disgruntled passengers.\nWhen Outbound Flight was attacked in warning by Commander Thrawn, many lives unintentionally perished, and Lorana felt C'baoth's fall to the dark side. She tried to reach her former master in time to help him, but she sensed his death by the second wave of assault droids. When the outer ships were mostly destroyed by Kinman Doriana, the only survivors were Lorana and the fifty-seven passengers C'baoth had imprisoned in the central storage core.\nWhile attempting to save the ship, Lorana met Syndic Thrass, who was Thrawn's brother, and Jorj Car'das on the bridge of D-One. She and Thrass had planned to land the ship on a planetoid in The Redoubt, with D-Three on the top, allowing them to use the small ship there to get aid. But the surviving passengers had moved to D-Four. With no other choice but to land D-One on the bottom to save the colonists, Lorana and Thrass chose to sacrifice their lives for the survivors in D-Four.\nNearly fifty years after her death, her brother traveled to the wreckage of Outbound Flight with the Jedi Luke and Mara Jade Skywalker when it was rediscovered by the Chiss. Her skeletal remains were found next to Thrass's remains in one of the cockpits of the Outbound Flight Project.\nLorana Jinzler was also remembered by one of the Survivors of Outbound Flight, Jorad Pressor, who had known her as Jedi Lorana back when he was a child. For this reason, Dean Jinzler was released from a trap that was set by the Survivors to try resolving the problem diplomatically.\nLorana wielded a green-bladed lightsaber, with an amethyst gem in the place of the activation stud . This lightsaber was recovered by Luke Skywalker, but was later destroyed.\nLorana was humble and good-natured. However, she lacked self-confidence, something which was not helped by working with Jorus C'baoth, who was very sure of himself, and expected any Padawan of his to feel the same. Obi-Wan Kenobi recognized this, and attempted to make her feel that she belonged and should not feel so unsure when the two worked together briefly. Lorana was caring, evidenced by the way she sacrificed herself to save the survivors of Outbound Flight. She was sorry her brother disliked her, telling him to let go of his anger. Decades later, Dean came to peace with her death, revealing to himself that he really loved her.\nLorana Jinzler first appeared as her skeletal remains in the 2004 novel Survivor's Quest by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_human_female_(Lesser_Space)",
  "/wiki/Lorana_Jinzler",
  "/wiki/Coruscant/Legends",
  "/wiki/49_BBY/Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Outbound_Flight",
  "/wiki/Human/Legends",
  "/wiki/Coruscanti/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jorus_C%27baoth",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Jinzler_family",
  "/wiki/Jedi_training/Legends",
  "/wiki/Dean_Jinzler",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Barlok",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Kinman_Doriana",
  "/wiki/Syndic/Legends",
  "/wiki/Mitth%27ras%27safis/Legends",
  "/wiki/Jorj_Car%27das",
  "/wiki/Dreadnaught-One",
  "/wiki/The_Redoubt/Legends",
  "/wiki/Dreadnaught-Three",
  "/wiki/Dreadnaught-Four",
  "/wiki/Expedition_to_Outbound_Flight",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Chiss/Legends",
  "/wiki/Jorad_Pressor",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lorana%27s_lightsaber",
  "/wiki/2004",
  "/wiki/Survivor%27s_Quest",
  "/wiki/Timothy_Zahn",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}