{
 "name": "Lord Mirdalan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Strill"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorian"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Walon Vau",
      "Jaing Skirata"
     ]
    }
   ]
  }
 ],
 "content": "Lord Mirdalan, affectionately called Mird or Mird'ika, was a pet strill belonging to Walon Vau. Since strills were hermaphrodites, being of both genders, Mird was often referred to as \"it\" in conversation and in writings, which was considered acceptable given its sexual structure. Mird was despised by Kal Skirata and his Null troopers after the strill attack on a young Ordo and because of the horrible smell that strills had. At some point in its life on Kamino, it killed a lower caste blue-eyed Kaminoan during the training of the Grand Army of the Republic on Kamino. During the Clone Wars, Mird accompanied Vau to Coruscant and accompanied Kal Skirata as part of his civilian disguise in dealing with Separatist terrorists, even aiding on a couple of missions along the way.\nAfter Walon Vau's bank heist on Mygeeto of his family's secured holdings, Mirdalan stayed behind with him when he became trapped in an ice worm hole, helping lead Kal Skirata to his location, aid in rescuing him and rewarming him by blanketing Vau's body with its own.\nLater, he would accompany Vau and Skirata in the ship Aay'han on the search for former chief geneticist Ko Sai, and then to Mandalore, where Etain Tur-Mukan concealed herself prior to the birth of her son, Venku. The evening before the birth, Mirdalan built a nest and brought a freshly-killed shatual to honor the occasion, both stunning and touching those present, most notably Rav Bralor.\nLord Mirdalan was very fond of Etain's child, Venku Skirata and would build nests for the baby, to the disgust of Ordo Skirata, as they were usually made out of his bed sheets and clothes.\nLord Mirdalan later came into the possession of Jaing Skirata when he followed through on his promise to Walon Vau that he would take care of it when Vau died.\nWhen Boba Fett and his granddaughter Mirta Gev were searching for him to reverse the clone degeneration slowly killing Fett, Skirata and Mird ambushed the two in Slave I. Skirata told them that Ko Sai's data, which they had been seeking, was gone.\nAt the marriage of Mirta and Ghes Orade, Jaing and Mird were present.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Strill",
  "/wiki/Mandalorian/Legends",
  "/wiki/Walon_Vau",
  "/wiki/Jaing_Skirata",
  "/wiki/RC-1207/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Null-class_Advanced_Recon_Commando",
  "/wiki/Ordo_Skirata",
  "/wiki/Eye/Legends",
  "/wiki/Kaminoan/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Mygeeto/Legends",
  "/wiki/Aay%27han",
  "/wiki/Ko_Sai/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Etain_Tur-Mukan",
  "/wiki/Venku_Skirata",
  "/wiki/Shatual",
  "/wiki/Rav_Bralor",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Mirta_Gev",
  "/wiki/Slave_I/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Ghes_Orade",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}