{
 "name": "Lorth Needa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Executor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Home Fleet Strike Group Five",
      "Home Fleet Strike Group Five",
      "Galactic Empire",
      "Death Squadron",
      "Imperial Officer Corps",
      "Death Squadron",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Lorth Needa was a human male who served as a lieutenant commander of a Carrack-class light cruiser, and later captain of the Imperial Star Destroyer Avenger, a ship assigned to the Sith Lord Darth Vader's Death Squadron, during the Battle of Hoth. In the midst of the battle, Needa successfully engaged several fleeing Rebel transports, but it was his pursuit of one—Captain Han Solo's Millennium Falcon—that sealed his fate. After a lengthy chase, the Avenger had the Falcon in its sights before Solo suddenly changed course and charged the Star Destroyer's bridge, only to disappear from its sensors. Not knowing how the Falcon could have eluded him, Needa decided to take responsibility for the situation and personally apologize to Vader, who killed him as punishment for losing the ship.\nA human male hailing from Coruscant, Lorth Needa served in the navy of the Galactic Republic during the Clone Wars, as the lieutenant commander of Strike Group Five of the Coruscant Home Defense Fleet, where he commanded the Carrack-class light cruiser Integrity. In 19 BBY, Needa, alongside Strike Group Five, took part in the Battle of Coruscant, in which Separatist General Grievous attacked the planet with a massive armada and kidnapped Supreme Chancellor Sheev Palpatine.\nDuring the battle, Needa and his massed ships surrounded Grievous's flagship, the Providence-class Dreadnought Invisible Hand, where he demanded the Kaleesh to surrender himself, but was met with resistance as the general explained that Palpatine was aboard the dreadnought. In disbelief, Needa gave Grievous ten minutes to prove himself before the Invisible Hand was to be fired upon by Strike Group Five. The Chancellor was later rescued by Jedi Knights Obi-Wan Kenobi and Anakin Skywalker, who boarded Grievous' flagship, the Invisible Hand.\nAfter the Clone Wars came to an end and the Galactic Empire was proclaimed, Needa served in the Imperial Navy as an officer, serving as a lieutenant commander aboard a Carrack-class light cruiser.\nLater, he was in command of the Star Destroyer Avenger in Death Squadron, a task force of the Imperial Navy under the command of the Sith Lord Darth Vader. In the aftermath of the Battle of Yavin, Death Squadron was responsible for tracking down the hidden headquarters of the Rebel Alliance, an insurgent faction at war with the Galactic Empire for control of the galaxy. After discovering a Rebel base on the planet Hoth, Death Squadron launched an assault on the Rebel forces gathered there. During the fighting, which culminated in a resounding victory for the Empire, Needa and the Avenger engaged several Rebel ships in battle as they attempted to flee from the Imperial forces.\nAmong the Rebel vessels that found itself in Needa's sights was the Millennium Falcon, a freighter owned by Rebel sympathizer Han Solo. Solo, along with his co-pilot Chewbacca and the Rebel leader Princess Leia Organa, had fled from Imperial forces on Hoth. However, with the Falcon's hyperdrive non-operational, they were unable to make the jump to hyperspace and escape from the Star Destroyers in orbit. Needa and the Avenger closed in on the Falcon, but Solo outmaneuvered his pursuers, causing the Avenger to nearly collide with two other Star Destroyers. Solo and company took refuge in a nearby asteroid field, whereupon the Empire lost track of them for a time. Via hologram, Needa informed Darth Vader that the Falcon had likely been destroyed in the asteroid field, but the Sith Lord suspected otherwise and ordered the search to continue. Needa then contacted Lieutenant Obrax and Theta Squadron, deploying a group of fighters to patrol the area and threatening to execute any pilot who returned from the patrol prematurely.\nSure enough, the Falcon had not been destroyed; after the freighter emerged from the asteroid field, the Avenger resumed its pursuit. With Vader informed of this development, Needa prepared to capture the elusive freighter, but Solo abruptly altered course and flew directly toward the Avenger's bridge; a move Needa interpreted to be an attack run. He ordered the Star Destroyer to raise its shields, but the Falcon merely skimmed the surface of the command tower before disappearing from the warship's sensors. An incredulous Needa could not comprehend how the Falcon could have disappeared, since it was too small to have a functional cloaking device—unbeknownst to the Imperials, Solo had merely attached his freighter to the rear of the Avenger's bridge tower.\nNevertheless, when Vader demanded an update on the Avenger's progress, Needa decided to travel to the Super Star Destroyer Executor to personally apologize to the Sith Lord for losing track of his quarry. Needa did just that, whereupon the Sith Lord telekinetically strangled the captain to death as punishment for his failure. Vader mockingly accepted Needa's apology before a pair of Imperial Navy Troopers dragged his lifeless body away. Meanwhile, the TIEs of Theta Squadron that disobeyed Needa's orders and broke off from their patrol to enter the asteroid field returned and avoided discipline from their late commanding officer.\nStanding 1.75 meters tall, Captain Lorth Needa was a ruthless and capable Star Destroyer commander within Darth Vader's fleet. Though he feared the Sith Lord, Needa decided to personally apologize to Vader after failing to capture the Millennium Falcon in the aftermath of the Hoth campaign. Vader \"accepted\" his apology, but Needa did not live to hear it. Needa had an accent reflective of his upbringing in the Core Worlds. After being assigned a patrol and threatened by Needa, TIE pilot \"Howlrunner\", who flew as Theta Seven, mocked his accent when complaining to fellow pilot \"Shadow.\"\nCaptain Needa was portrayed by Michael Culver in the 1980 film Star Wars: Episode V The Empire Strikes Back, the second installment of the Star Wars original trilogy.\nStar Wars: Force Collection says that Needa once was \"only a Lieutenant Commander,\" and The Empire Strikes Back tells us that Needa was a Captain, despite Thrawn stating that a Captain is lower than Lieutenant Commander. This could hint, however, that perhaps Needa was demoted at some point before the events of Empire. This could also be a reference to a tradition in at least some navies to refer to the commander of a ship as \"captain\" regardless of rank.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lorth_Needa",
  "/wiki/Lorth_Needa/Legends",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Darth_Vader_(2020)_6",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_52",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Coruscant",
  "/wiki/3_ABY",
  "/wiki/Executor",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Home_Fleet_Strike_Group_Five",
  "/wiki/Galactic_Empire",
  "/wiki/Death_Squadron",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/File:SarcasmAcceptedLordVader-ESB.ogg",
  "/wiki/Lieutenant_Commander",
  "/wiki/Carrack-class_light_cruiser",
  "/wiki/Captain",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Avenger",
  "/wiki/Starship",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Battle_of_Hoth",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Han_Solo",
  "/wiki/Millennium_Falcon",
  "/wiki/Sensor",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Clone_Wars",
  "/wiki/Coruscant_Home_Defense_Fleet",
  "/wiki/Commanding_officer",
  "/wiki/Integrity_(Carrack-class)",
  "/wiki/19_BBY",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Planet",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Flagship",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Invisible_Hand",
  "/wiki/Dreadnought",
  "/wiki/Standard_minute",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/File:Needa-ShieldsUp.ogg",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_officer",
  "/wiki/Darth",
  "/wiki/Battle_of_Yavin",
  "/wiki/Yavin_Prime",
  "/wiki/Squadron",
  "/wiki/Echo_Base",
  "/wiki/Galactic_Civil_War",
  "/wiki/The_galaxy",
  "/wiki/Hoth",
  "/wiki/Imperial_Military",
  "/wiki/Freighter",
  "/wiki/Pilot",
  "/wiki/Chewbacca",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Hyperdrive",
  "/wiki/Hyperspace",
  "/wiki/Star_Destroyer",
  "/wiki/Orbit",
  "/wiki/Asteroid",
  "/wiki/Hoth_asteroid_belt",
  "/wiki/Time",
  "/wiki/Hologram",
  "/wiki/Sith",
  "/wiki/Lieutenant",
  "/wiki/Obrax",
  "/wiki/Theta_Squadron_(Galactic_Empire)",
  "/wiki/Bridge_(starship)",
  "/wiki/Deflector_shield",
  "/wiki/Warship",
  "/wiki/Cloaking_device",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Force_choke",
  "/wiki/Death",
  "/wiki/Imperial_Navy_Trooper",
  "/wiki/Core_Worlds",
  "/wiki/TIE_pilot",
  "/wiki/Howlrunner_(Theta_Squadron)",
  "/wiki/Theta_Seven",
  "/wiki/Amara_Kel",
  "/wiki/Michael_Culver",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Thrawn_(novel)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Amara_Kel%27s_Rules_for_TIE_Pilot_Survival_(Probably)",
  "/wiki/Wait_for_It",
  "/wiki/Standard_Imperial_Procedure",
  "/wiki/Category:Audio_files_of_Lorth_Needa",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Huge_Ship_Conversion_Kit",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back:_Special_40th_Anniversary_Collector%27s_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith"
 ]
}