{
 "name": "Lortha Peel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Lortha Peel was a human male water-monger that owned a water shop in the Worker's District of the city Mos Espa on the planet Tatooine. After the ex-bounty hunter Boba Fett established himself as the new Daimyo of Tatooine, a street gang began stealing from Peel, prompting him to seek help from Fett. Explaining his situation to the Daimyo, he offered him extra tribute for getting rid of the gang. However, after learning that the street gang was unemployed and could not afford Peel's high water prices, Fett chose to employ them instead, forcing the water-monger to consider the situation resolved for a smaller payoff.\nLortha Peel worked as a water-monger, owning his own water shop in the Worker's District of the city Mos Espa on the desert planet Tatooine. He kept an inventory of water harvested by moisture farmers on Tatooine to and sold it at his shop. Around 9 ABY, the former bounty hunter Boba Fett seized the palace of the late Jabba the Hutt and killed the Hutt's successor, Lord Bib Fortuna, taking Fortuna's position as the new Daimyo of Tatooine. With the new change in power came unrest within the streets of Mos Espa, many residents having no respect for Fett's leadership, especially after an assassination attempt on the Daimyo took place in the city. A street gang of cybernetically enhanced and unemployed youths began stealing from Peel's inventory, having been dissatisfied with the water-monger's high prices.\nIn hopes of getting rid of the street gang, Peel went to Fett's palace for help. After being allowed to enter the throne room, the water-monger introduced himself to Fett and began by explaining that no one respected the Daimyo and described the Mos Espa streets as being in chaos. He hesitated to mention the assassination attempt but did so anyway after Fett requested clarification. Master Assassin Fennec Shand attempted to end the meeting, but Peel requested to continue his petition, being approved so by Fett. The water-monger described the street gang that was stealing from him and clarified about his job when Fett was curious for further details. Peel offered to double his tribute if Fett got rid of the gang.\nFett went and confronted the street gang while they lingered near Peel's water shop. Learning of the water-monger's high prices and the lack of work for the gang members, he chose to employ the youths himself. Hearing the exchange, Peel protested the decision, arguing that the gang had stolen from him. When the Daimyo asked what was owed to him, the water-monger claimed it was 1,300 credits, although Fett was skeptical of the value since it was water that had been stolen. Thus the Daimyo chose to pay Peel 500 credits. Peel was dissatisfied by the incomplete payoff, but Fett threatened to end his business in Mos Espa if he did not considered the matter resolved. The water-monger gave in to the demands, and the Daimyo told the man to cut the water prices before returning to his palace with the youths.\nLortha Peel was a human male with light skin, brown, graying hair, and blue eyes. He repeatedly claim that he was insulted on the Daimyo's behalf to imply that he shared the Daimyo's displeasure. When Fett decided to hire the street gang instead of getting rid of them, the water-monger believed it was injustice. However, he conceded his protesting when faced by a threat from the Daimyo on his business in Mos Espa.\nPeel wore beige and brown clothing with a satchel and brown boots.\nLortha Peel appeared in \"Chapter 3: The Streets of Mos Espa,\" the third episode of the television series The Book of Boba Fett, which was released on Disney+ on January 12, 2022. He was played by Stephen Root.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Water-monger",
  "/wiki/Worker%27s_District",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Daimyo",
  "/wiki/Mods",
  "/wiki/Water",
  "/wiki/Desert",
  "/wiki/Moisture_farm",
  "/wiki/Moisture_farmer",
  "/wiki/9_ABY",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Lord",
  "/wiki/Bib_Fortuna",
  "/wiki/Ambush_outside_of_the_Sanctuary",
  "/wiki/Cybernetics",
  "/wiki/Master_Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Credit",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Disney%2B",
  "/wiki/January_12",
  "/wiki/2022",
  "/wiki/Stephen_Root",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/The_Mandalorian",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land"
 ]
}