{
 "name": "Lorus",
 "display_name": "Lorus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kalimahr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Tall"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kalimahr Militia"
     ]
    }
   ]
  }
 ],
 "content": "Lorus was a Sith male police captain of the Kalimahr Militia that was casually involved in the plans of the Stargazers.\nEarly in Lorus' career as a constable he had met Je'daii Ranger Vulk and two attending Journeyers. The Je'daii had come to negotiate a dispute over mining rights and when Lorus attempted to ask Vulk questions about the case, the man used the Force to lift the constable into the air and set him out of his path.\nRising to the rank of Captain in the Kalimahr Militia, Lorus held Ranger Lanoree Brock in custody after an incident near a spaceport resulted in three civilian casualties, two militia members, and a dead terrorist. Attempting to get information out of her regarding the nature of her mission, he eventually roped her in on what little intelligence he had on the Stargazer cult. The Noghri terrorist was a preacher in the cult, a small group of people who resented that the Tho Yor had brought their ancestors to Tython millennia ago. Pointing Brock in the direction of Kara, a wealthy industrialist who lived at the penthouse at Gazz Spire in Rhol Yan, Lorus believed she was bankrolling the cult secretly. Shortly after Brock visited Kara's penthouse, she and several other members of Rhol Yan high society disappeared without a trace. Lorus reported this intel to the Je'daii and was pleased when his involvement in her investigation came to an end.\nLorus was a tall and powerfully built individual that was accustomed to leadership and being obeyed. He was somewhat of a bully, and his staff worked in fear of discipline or a verbal lashing. As a captain of the Kalimahr Militia, he was at ease around Je'daii, as he knew that maintaining diplomatic ties would prevent any unwanted violence or trickery. Despite his disdain for Je'daii arrogance, when he learned of the valiant death of Ranger Vulk, Lorus showed his honor nature through the bit of admiration for the sacrifice for the greater good.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kalimahr",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Stargazers",
  "/wiki/Constable/Legends",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Vulk",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/The_Force/Legends",
  "/wiki/Lanoree_Brock",
  "/wiki/Spaceport/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Tho_Yor",
  "/wiki/Tython/Legends",
  "/wiki/Kara_(Je%27daii)",
  "/wiki/Gazz_Spire",
  "/wiki/Rhol_Yan",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}