{
 "name": "Lorz Geptun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Haruun Kal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Short"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent SystemsBalawai",
      "Balawai",
      "Galactic RepublicRepublic Intelligence",
      "Republic Intelligence",
      "Galactic EmpireImperial Intelligence",
      "Imperial Intelligence",
      "Alliance to Restore the Republic",
      "New RepublicJudicial Service",
      "Judicial Service"
     ]
    }
   ]
  }
 ],
 "content": "Lorz Geptun was a Balawai Human colonel during the Clone Wars in the Pelek Baw militia, and, by extension, the army of the Confederacy of Independent Systems, with which his homeworld of Haruun Kal was aligned. He then joined the Republic Intelligence and left it shortly after it became the Imperial Intelligence. Later, he joined the Alliance to Restore the Republic which later became the New Republic.\n\"Geptun\" was a Korunnai name. His paternal grandfather had been a Korun who moved out of the jungle to the city. Geptun blamed that part of him for making him too proud to change the name; however, it granted him a degree of Force-sensitivity, and he was able to both sense the emotions of others and mask his from other Force-sensitives. Geptun commented to Mace Windu at being an expert in dejarik.\nWhen Mace Windu arrived on the planet six months after the First Battle of Geonosis, the Jedi Master was brought before Geptun after he was shot and captured by the militia while trying to save the life of Phloremirlla Tenk. Geptun questioned Windu but released him when Windu told him that his mission was to extract the rogue Master Depa Billaba, who as a new leader of the Korunnai Upland Liberation Front had been causing trouble for Geptun and the militia. Even so, Geptun evidently declined to call off the regular gunship patrols that battered Korunnai across the breadth of the jungle. Two of his gunships were lost and one damaged at Windu's hands when they attacked the party he was journeying with.\nSoon after, a series of violent atrocities in quick succession touched off a new wave of aggression between Geptun's militia and the natives, and Billaba and Windu led a large group of Korunnai to Lorshan Pass. Geptun, in turn, dispatched a number of squadrons of droid starfighters to attack the natives when Windu refused to surrender. His plans were thwarted, however, after Windu ingeniously tricked the droid fighters into dogfighting each other. Windu then led the Korunnai rebels into the capital of Pelek Baw itself, and moved against Geptun's base. Geptun was forced to surrender to Windu and shut down the remaining droid starfighters, effectively handing the planet over to the Galactic Republic.\nFollowing the battle, he joined the Republic Army. Without his knowledge, Windu put in a request to transfer him to Republic Intelligence.\nGeptun stayed in Republic Intelligence for a brief time after it became Imperial Intelligence, just long enough to uncover some of the realities of the \"Jedi Rebellion.\" He made a living as a freelance information broker for some time, staying under the Empire's radar until he recognized the potential value of the freedom offered by the Rebel Alliance and offered his services to them. This was much more out of a desire for profit than out of any political or altruistic motivation.\nThe former officer eventually became Inspector Lorz Geptun of the New Republic Judicial Service. Just after the Battle of Mindor, then-General Luke Skywalker requested  Geptun's service in investigating whether Skywalker had done any wrong in the campaign against Lord Shadowspawn.\nRather than build an indictment as Skywalker requested, however, Geptun came up with a script for a holothriller based on the events. By the time he reported back to Luke Skywalker, he had already sold the rights to the holo and two sequels to producers. Although he initially met with Luke's frustration, Geptun was able to enlist his support and Luke suggested some edits for a rewrite of the script with less made-up action and a little more verisimilitude.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Haruun_Kal/Legends",
  "/wiki/Human/Legends",
  "/wiki/Korun/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Balawai",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Judicial_Service",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Pelek_Baw",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Dejarik/Legends",
  "/wiki/Planet/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Phloremirlla_Tenk",
  "/wiki/Depa_Billaba/Legends",
  "/wiki/Upland_Liberation_Front",
  "/wiki/Lorshan_Pass",
  "/wiki/Droid_starfighter/Legends",
  "/wiki/Battle_of_Lorshan_Pass",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Battle_of_Mindor",
  "/wiki/General/Legends",
  "/wiki/Nick_Rostu",
  "/wiki/Cronal",
  "/wiki/Shatterpoint_(novel)",
  "/wiki/The_Clone_Wars:_The_Dark_Side",
  "/wiki/Luke_Skywalker_and_the_Shadows_of_Mindor",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}