{
 "name": "Lotho Pelhane",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Lotho Pelhane was a Human male who resided on the planet Tatooine during the final years of the Galactic Republic and the rise of the Galactic Empire.\nPelhane worked as a farmhand at Orrin Gault's moisture farm for twenty years before starting his own farm. He had a daughter, Tyla, who later married Tellico Bezzard, another local moisture farmer. As a result of frequent attacks by Tusken Raiders, Gault set up the Settlers' Call, a fund into which members paid and which provided weapons and vehicles for its members' mutual defense. Pelhane was among those who chose not to join the fund. By 19 BBY, Gault was struggling financially and was using the Settlers' Call Fund to pay off his personal debts. In order to increase membership, Gault and his children took to attacking those who had not joined, disguised as Tuskens. One such attack left Pelhane beaten and forced him to move in with his daughter and her husband while he recovered. As a result of the attack on Pelhane, the Bezzards joined the Settlers' Call. However, weeks later, their farm came under attack; although they alerted the other settlers, Pelhane was killed by the Tusken A'Yark before help could arrive.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Moisture_farmer/Legends",
  "/wiki/Orrin_Gault",
  "/wiki/Standard_year/Legends",
  "/wiki/Moisture_farm/Legends",
  "/wiki/Tyla_Bezzard",
  "/wiki/Marriage/Legends",
  "/wiki/Tellico_Bezzard",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Settlers%27_Call_Fund",
  "/wiki/Bezzard_farm",
  "/wiki/A%27Yark/Legends",
  "/wiki/Kenobi_(novel)",
  "/wiki/Kenobi_(audiobook)"
 ]
}