{
 "name": "Lott Dod",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Neimoidia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation",
      "Sith",
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Lott Dod was a Neimoidian male politician who represented the Trade Federation in the Republic Senate during the final decades of the Galactic Republic. Dod rose to prominence after the ill-fated Eriadu Conference left a power vacuum in the leadership of the Trade Federation, and he and Nute Gunray assumed control with backing from the Sith Lord Darth Sidious. As the conglomerate's senator, Dod protected the Federation's corrupt leadership and interests by furthering the deterioration of the Republic's long-standing democratic norms.\nIn his early tenure, Dod helped manufacture the Trade Federation's invasion of the planet Naboo in opposition to Supreme Chancellor Valorum's taxation policies. At the height of his power, Dod could sway entire voting blocs to strike down any motion he disagreed with. Despite numerous legal and electoral challenges, Dod retained his seat in the Senate during the Clone Wars, a pan-galactic war between the Republic and its splinter state, the Confederacy of Independent Systems. During the conflict, Dod defended the Federation from accusations of treason, helping them profiteer from the war by secretly aiding the Confederacy. Among his efforts, he attempted to stall Republic relief to the embattled world Ryloth and helped coordinate a Federation blockade of Pantora, but failed to achieve his goals in both cases.\nThough his Separatist ties were no secret, Dod evaded legal repercussions from his actions by claiming neutrality and distancing himself from his old ally, Nute Gunray. Dod's openly treasonous activities, including an investment in a Confederate droid foundry on Geonosis, were eventually discovered, but he still faced no reprimand from the Senate. Dod and his allies went to great lengths to derail a Confederate-Republic peace initiative, staging a massive bombing on the Republic capital of Coruscant, which successfully pushed the Senate to de-regulate of the InterGalactic Banking Clan and the redirection of vast sums of money into military expansion. Dod ultimately lost his life to the Clone Wars, and the Trade Federation and its assets were dissolved by the Galactic Empire.\nLott Dod was born on Neimoidia, the homeworld of the Neimoidian species. Dod was a member of an ambitious group of Neimoidians in the Trade Federation, including Nute Gunray, who represented the Federation in the Galactic Republic Senate. The group sought to take control of the trade and shipping conglomerate, which was headquartered on Cato Neimoidia. Dod and Gunray got their chance to usurp the Trade Federation's board of directors in 33 BBY following the disastrous Eriadu Conference. The conference was a diplomatic meeting set up to solve the centuries-long power struggle between the Federation and the Republic, a democratic union that governed much of the galaxy. The conference turned to disaster when it was attacked by the Nebula Front, a group opposed to vast corporate conglomerates, who assassinated the Federation's directorate.\nConspiring with the mysterious Darth Sidious, Dod and Gunray stepped in to fill the Trade Federation's vacant leadership following the incident on Eriadu. While Gunray rose to the position of Viceroy, Dod snaked his way into Gunray's old seat in the Republic Senate on Coruscant Once in power, they filled prominent positions with like-minded allies. As the Trade Federation's representative in the Senate, Senator Dod used his office to defend the Federation's actions and used his political influence to disrupt Senate attempts to hold the Federation accountable. He was aided by diplomat Lufa Danak and a financial officer. He also employed the use of Neimoidian drones in his offices, and they conducted much of his delegation's work. Because of his high-paying and influential position, Dod also came to own a beautiful palace on Cato Neimoidia.\nIn 32 BBY, after decades of protest against the Trade Federation's dominance over Republic-designated Free Trade Zones in the Mid and Outer Rim, the Senate moved to break the Federation's monopolistic stranglehold over the region. For centuries, the Federation had extorted and centralized the \"free\" trade systems, and a budget crisis in the Republic exacerbated calls to strip the Free Trade Zones of Federation authority, thus removing the outlying trade routes from Federation control while increasing funding to the ballooning Republic budget. Prop 31-814D was introduced in the Senate to do as much, and Dod quickly began an attempt to prevent the legislation from passing. Despite his efforts, Dod failed to gather enough support to stall the bill.\nOutraged over the passing of Prop 31-814D, Sidious and Gunray had Dod introduce a new taxation bill to the Senate in favor of the Trade Federation, but a bypass amendment suggested by Senator Sheev Palpatine of Naboo cost Dod key support from the Delcontrian faction, and the motion failed. Gunray and Sidious debated having Dod submit another bill, but decided that it was too obvious and entertained having another Federation-aligned faction introduce it. In the Senate, Dod continued to argue his support for the bills despite their repeated failures. Supreme Chancellor Finis Valorum organized committee meetings with Dod and several Mid Rim senators in order to help alleviate tensions, but Dod maintained his stances. In the fourth of these hearings, Senator Palpatine tried to appeal to Dod that planets in the Mid Rim would not be able to financially handle shifted tax reforms, but Dod fired back that the Trade Federation was happy to offer aid to any planet that would need it, only to get refuted by Senator Yarua of Kashyyk.\nTired of continuing to fight for tax bills destined to fail in the Senate, Sidious, Viceroy Gunray, and Dod organized a blockade of the Mid Rim planet Naboo in retaliation to what they saw as a violation of the Trade Federation's centuries-old authority. Two warships converted from Lucrehulk-class LH-3210 cargo freighters blockaded the world, which had a long-running dispute with the Federation over plasma exports, depriving its citizens of necessary supplies, medicines, and food. During intense sessions in the Senate, Dod maintained that the Federation had not broken any laws or committed any acts of aggression against Naboo. Gunray sent a treaty to the recently-elected Queen of Naboo, Padmé Amidala, that would, in effect, give the Trade Federation control over the planet, but she refused to sign it. Chancellor Valorum sent two ambassadors from the Jedi Order, Master Qui-Gon Jinn and his padawan, Obi-Wan Kenobi, to negotiate with Gunray, who instead tried to have them killed, but they escaped to Naboo and fled with Queen Amidala and her entourage when Gunray had his forces invade the planet.\nWith help from the Jedi, Queen Amidala was brought to Coruscant to testify before a special session of congress about the Trade Federation blockade. Senator Palpatine was given the floor by Valorum, and he told the Senate that the Naboo system was engulfed in the oppression of the Trade Federation. Dod immediately floated his repulsorpod to the Chancellor's podium and objected to Palpatine's statements. Valorum informed Dod that the chair had not recognized him to speak, and Palpatine continued and introduced Queen Amidala to speak on Naboo's behalf. Amidala began stating that the armies of the Trade Federation had invaded Naboo, but Dod interjected and objected once more and insinuated that there was no proof of her claims.\nDod recommended to Valorum that a commission be sent to Naboo to ascertain the truth, and he was backed by Senator Aks Moe of the Congress of Malastare. Valorum briefly spoke with his Vice Chair, Mas Amedda, then announced that he conceded Dod's point and asked Queen Amidala if she would defer her motion to allow a commission to investigate the validity of her claims. Amidala refused and denounced the Senate and, in a surprising turn, moved for a Vote of No Confidence in Chancellor Valorum's leadership. Amidala's call for a Vote of No Confidence in Valorum triggered a special election for a new Supreme Chancellor. The frontrunner was Senator Palpatine, who won the chancellery while Queen Amidala led a revolt against the Trade Federation forces on Naboo. The subsequent battle saw Gunray arrested and sent to Coruscant to face trial for his crimes. As had been his ultimate plan, Sidious had manufactured a crisis using Dod and Gunray as pawns and assumed control of the Republic as his secret alter ego, Senator Palpatine.\nDespite Gunray's arrest, Dod remained in his Senate seat and continued to advance the Trade Federation's interests. By 28 BBY, Gunray and other Neimoidians arrested at Naboo had been tried by the Republic Supreme Court three times, but the Federation's legal team managed to help Gunray evade prosecution. However, Gunray's third trial ended in a hung jury, and Republic lawyers were quick to regroup and plan their next move. The actions taken by Queen Amidala had cost the Federation an immense amount of money, with Gunray's legal fees adding to their depleting funds.\nIn that same year, Amidala's tenure as queen ended, but she returned to public service as the senator of the Chommell sector, taking the place of the retiring Oshadam. At the first session of the Senate attended by Senator Amidala, Dod focused on solving an issue the Federation was having with the representatives from Ithor and Urce. Both the Trade Federation and the Ithorians asserted that they separately owned the rights to the distribution of maps of the hyperspace lane through the Lesser Plooriod Cluster, which they each claimed to have constructed, while the people of Urce claimed ownership of part of the route because it passed through their space. The combined opposition to the Ithorians' motion from the Trade Federation and the Urce representatives sunk their bill, and the Federation was allowed to retain ownership of the lane maps.\nJust over eight months later, following a short recess period, a disaster on the Mid Rim planet Bromlarch forced the Senate to convene in an emergency session. The failure of the planet's aqueduct system threatened to collapse its agriculture and force its citizens into starvation. An audit team was sent to survey the disaster and appropriate Republic response, led by Senators Mina Bonteri of Onderon, Rush Clovis of the InterGalactic Banking Clan, and Senator Amidala. When they returned to Coruscant, Bonteri and Bromlarch representative Caelor Gaans introduced a measure that would fund necessary supplies and repairs. When Bonteri finished speaking, Dod immediately requested to speak and Chancellor Palpatine recognized him.\nDod criticized the motion, saying that Bonteri and Gaans were asking for too much and, because the disaster was an internal matter, it was Bromlarch's responsibility to pay for repairs. Gaans addressed Dod and argued that he didn't understand the full scale of the destruction, but Dod cut him off and offered to broker a private deal between Bromlarch and the Trade Federation instead of Republic intervention, as long as he was willing to consider it. Chancellor Palpatine brought Bonteri's motion to a vote, but Dod's counterarguments against it convinced Federation allies to vote it down. As Gaans despaired over the bill's failure, Dod floated his pod back to its dock.\nBecause of the failure of their first relief bill, Amidala and Clovis workshopped the motion into a larger economic stimulus, the Mid Rim Cooperation Motion, which would create a network of trade and supply deals between Mid Rim worlds, including Malastare, Kashyyyk, and Naboo, which would rescue Bromlarch's aqueduct. Meanwhile, Dod and the Trade Federation drafted a treaty for Senator Gaans, who briefly considered signing as he mulled the possibility of the new motion failing too. Just three days after the first bill's failure, Amidala introduced the Mid Rim Cooperation Motion and laid out how it would benefit key voting blocs, as well as Bromlarch. When Amidala finished speaking, Dod frantically tried to get Chancellor Palpatine to recognize him, but the Chancellor recognized Senator Aks Moe of the Congress of Malastare instead. Moe, whose world benefitted from the motion, seconded the legislation, and he was followed by the Kashyyyk delegation. Their key support drowned Dod's opposition, and the bill swiftly passed. Shortly after, it was announced that Gunray's fourth trial ended in his acquittal, and the Viceroy retained his titles and assets in the Trade Federation.\nIn the years following Dod's failure to halt the Mid Rim Cooperation Motion, the Republic faced a severe internal crisis as dissatisfied worlds entertained the notion of leaving the government. Emboldened by the firebrand Count Dooku of Serenno, entire star systems left the Republic and joined the nascent Confederacy of Independent Systems, a new galactic government headed by Dooku. In truth, Dooku, also known as Darth Tyranus, was the Sith apprentice of Darth Sidious, and the Confederacy was part of Sidious' plan to achieve full galactic domination. Viceroy Gunray was among Dooku and Sidious' key allies in the early years of the Confederacy, and the Trade Federation employed a neutral stance to maintain ties to both the Confederacy and Republic. In 22 BBY, Gunray and several other corporate entities signed a treaty for Dooku, formally establishing the Confederacy and earning a militarized response from the Republic. War broke out between the two on the planet Geonosis, and the galaxy became quickly engulfed in the Clone Wars.\nFollowing the battle on Geonosis, Dod became the sole conduit between the Trade Federation and the Republic. Because of the Trade Federation's economic ties to the Confederacy, Dod adopted a number of strategies to maintain his seat in the Senate and the Trade Federation's legitimacy. Dod publicly claimed that Gunray had no control over the Federation and was instead the leader of an extremist splinter group which did not reflect the true intent of the Federation. Because of the Confederacy's open use of Federation starships and technology, Dod enforced the notion that the Separatists had purchased the equipment on the open market. Despite Dod's success in distancing himself and the Trade Federation from Gunray, he was secretly aligned with the Separatists and worked to undermine the Republic when he could. He secretly had ties to several Separatist leaders, including Dooku and Tikkes, who had been one of Dod's allies in the Republic before he defected.\nEarly in the war, Dod faced an electoral challenge from a Trade Federation faction led by Oje N'deeb, who sought to replace Dod with someone who would truly represent the Neimoidian people. Bolstered by a Senate caucus that included Senator Amidala, N'deeb and his allies wanted to wrestle power away from Dod and Gunray in order to reform the corporation and undo the damage they had afflicted on it since the Eriadu Conference. Sidious and Dooku were aware of N'deeb's fight, but, at Sidious' will, they refused Gunray's requests for them to interfere and decided to allow N'deeb to continue with his calls for change in the Federation before they ultimately crushed him.\nShortly after the First Battle of Geonosis, the Cadesura district of the capital city of Cato Neimoidia, Zarra, was bombed. The disaster took the lives of many Neimoidians, and Dod was informed of the incident by the Republic. Count Dooku issued a statement that claimed the bombing was a Republic attempt to assassinate Gunray, who he claimed had been present on Cato Neimoidia around the same time. Dooku called for Chancellor Palpatine to travel to Cato Neimoidia and discuss the incident civilly on the grounds of transparency. Because Cato Neimoidia was officially neutral, Dod and the larger Trade Federation decided to abscond from any discussions or investigations between the Republic and Confederacy over the matter. The Republic sent Jedi Master Obi-Wan Kenobi to investigate the attack, but his efforts went awry when the local leaders of Cato Neimoidia blamed him and, by proxy, the Republic. Dod kept to his word by staying out of the proceedings and joined other Trade Federation officials in orbit over Cato Neimoidia while Kenobi was on trial.\nThe people of Cato Neimoidia were adamant in blaming Kenobi and gathered in crowds to call for the Neimoidian court to find him guilty. Dod issued a brief, calm speech to the Cato Neimoidians from orbit, reassuring them of his neutrality and urging them to trust the leadership of Cato Neimoidia. Both Dod and the Cato Neimoidian Minister of Defense, Alluv Eyam, knew of the publicity and power Kenobi's trial gave the Neimoidians before the entire galaxy and used their platform to advocate for neutrality for the Neimoidians and the Trade Federation. The Jedi, in turn, presented the findings of his initial investigation, that the bombing of Zarra was an action taken to provoke the escalation of the war. Kenobi blamed the Separatists and argued that the Trade Federation had to break neutrality and join the Republic.\nKenobi's trial, however, was hijacked by Ketar Nor, a Neimoidian extremist, and Asajj Ventress, an envoy of Dooku's, who attempted to assassinate him. Several of Kenobi's allies undercover on Cato Neimoidia managed to help him escape and, in the aftermath of the crisis, Chancellor Palpatine officially integrated the Jedi Order into the Grand Army of the Republic to act as military officers. Kenobi's inability to sway the Trade Federation into joining the Republic allowed Senator Dod to continue with his machinations unperturbed. Dod continued using the tenuous claim of neutrality in defense of the Federation's increased deals with the Confederacy. The Trade Federation upset several of the Republic's military efforts by secretly assisting Dooku, but Dod kept his seat in the Senate despite legal challenges following these actions. Despite his best efforts, Dod's Separatist ties were no secret as he used his knowledge of Senate precedents and procedures to protect other Confederate allies serving alongside him in the Republic.\nAs it spread its war effort across the galaxy, the Confederacy of Independent Systems spearheaded an invasion of the planet Ryloth. Republic and local Twi'lek resistance forces struggled to hold back the Separatist armies, and Ryloth faced a supply shortage and starvation. The Jedi High Council sent Senator Bail Organa of Alderaan and Representative Jar Jar Binks of Naboo to the neutral world of Toydaria to negotiate using the planet as a staging ground for supply runs to Ryloth with King Katuunko. Learning of Organa's mission, Count Dooku contacted Dod and had him travel to Toydaria to intervene and convince Katuunko to refuse the Republic's proposal.\nDod arrived at Toydaria before Organa and Binks and interrupted their talks with King Katuunko and the Toydarian council. As Organa explained the humanitarian crisis on Ryloth, Dod urged Katuunko not to make his decision in haste before stating that there were other factors at play. As Dod stepped onto a floating platform before the Toydarian council, Katuunko introduced Dod to Organa, though they had met before. Binks asked Katuunko what Dod was doing on Toydaria, and the king replied that, since his planet had a contract with the Trade Federation, there was no reason he shouldn't be. Organa remarked that the Federation was \"chummy\" with the Separatists, which Dod quickly refuted. Dod immediately objected to Organa's claim and denounced Nute Gunray as an extremist.\nDod turned to Katuunko and assured the king that he was only there to ensure nothing jeopardized the deal between Toydaria and the Trade Federation. Organa appealed to Katuunko by mentioning that Alderaan and Naboo had rich histories of humanitarian aid, then assured him that there would be no conflict with the Federation. Katuunko agreed and pointed out to his ministers that helping Ryloth would align with the sacred Toydarian value of compassion. Dod took the moment to mention that honesty was also a Toydarian value, then informed the king that there was a Separatist blockade around Ryloth, which Organa had not told him about. Katuunko asked Organa about the validity of Dod's statement, which he confirmed. Organa attempted to convince Katuunko that the blockade changed nothing, but the king and his ministers challenged the notion because helping the Republic against the Confederacy would break Toydaria's neutrality. Katuunko told his visitors that he had to speak with his ministers in private, and they would hear arguments from Dod and Organa when they reconvened.\nA short time later, Dod, Organa, and Binks returned to the throne room to make their formal arguments before Katuunko and the ministry. Katuunko invited Organa to speak first, and the Alderaanian told the court that the proposed operation was purely humanitarian. Organa then told the king that he had a message for him from the senator of Ryloth, Orn Free Taa. A hologram of Taa played before the court, and Taa told Katuunko of the dire situation his people were in. Once the recording finished, one minister declared that the Toydarians were obliged to help, but another warned that they could not allow their compassion to drive them into the war, after which Katuunko gave Dod the floor. Dod asserted to the king that Organa was deceiving him, then told the court that the inconvenient truth was that Ryloth was a battlefield. Dod displayed images of the Battle of Ryloth and argued that Toydaria, by acting as a staging ground for Republic aid, would not be a humanitarian base but a military one. Dod theorized that if Toydaria worked with the Republic, the Separatist Senate would see it as a violation of their neutrality and attack, which would force the Trade Federation to cease commerce with Toydaria.\nSenator Organa interjected and told Katuunko that the people of Ryloth didn't ask to be invaded and asked him not to let them suffer just because the war came to them. Dod stated that he sympathized with the Twi'leks but declared that the matter went beyond their supply shortage. Katuunko thanked Dod and Organa for their arguments and told them that he would summon them once he and the ministry made their decision. Once they were brought back before the king, Katuunko informed Organa that he would not allow Toydaria to risk its neutrality and its relationship with the Trade Federation. Dod told the king that it was a wise ruling, then gave a sly look to Organa. Though Dod believed he had won, Katuunko privately met with Organa and Binks and told them that he would let a limited Republic humanitarian force use Toydaria as a staging ground in secret, as long as Dod and the Federation did not find out. Later in the day, Dod and his aide met with Katuunko and the Toydarian ministers for a formal dinner. They arrived at the dining room to find Organa and Binks. Organa thanked Dod for joining them, but the Neimoidian grumpily remarked that he found formal dinners tedious.\nOrgana told the group that he had to speak with Alderaanian officials about a pressing matter, then left Dod and the others with Representative Binks. While they sat down to begin dinner, Organa went to the palace dockyards to oversee the transfer of supplies. When he informed Binks through an earpiece that the ships were ready to launch, Binks suddenly stood on the table to distract Dod from looking out the windows. Binks told everyone gathered that he wanted to create a conceptual work of art celebrating Dod, then began gathering plates and glasses from around the table. As Binks attempted to balance the dishes, a ship flew away from the palace, causing Dod to turn his head when he heard the engines. Binks started stacking the dishes on top of each other. Once Binks finished the improvised art piece, Katuunko and his ministers clapped, along with Dod's aide, who Dod gave a look of disapproval. Another ship flew past, and Dod again turned around when he heard its engines.\nDod noticed Binks glance out the window and asked what he was looking at, then turned and stared out the window as Binks frantically tried to get him not to. As Dod looked out the window, however, the final ship departed the palace from the opposite side. When Dod found out what had happened the following day, he furiously confronted Organa, Katuunko, and Binks. Dod told them that he had received information that a Republic fleet had penetrated the Ryloth blockade. Organa deceptively replied to Dod that he could present his case before the full Senate if he had any proof of his claim. Angered, Dod frustratedly exclaimed that it took years for the Senate to decide anything, then threw his hands into the air as Organa, Binks, and Katuunko didn't react. His machinations foiled, Dod began walking away, but stopped briefly and warned Organa that he was playing a dangerous game.\nIn 21 BBY, Dod conspired with Geonosian Archduke Poggle the Lesser, one of the Confederacy's founders, and Senator Rush Clovis, who had fallen in with corporate groups in the Senate since the Bromlarch crisis, to invest in a new Confederate droid foundry on Geonosis. Despite their personal disliking of Clovis, Dod and Poggle struck a deal with him to secure the Banking Clan's crucial funding. In return, Dod signed over his holdings to the Banking Clan, effectively handing his personal fortune and properties to the banks. However, Dod and Poggle felt that the deal unfairly favored the profits of the Banking Clan, and Dod invited Clovis to visit them at his palace on Cato Neimoidia to push alterations to the contract. Dod also believed that they were taking a considerable risk and feared that the Republic would discover their treachery. His fears were proven justified when the Jedi High Council began suspecting Clovis of aiding the Separatists. The Jedi Council enlisted Senator Amidala, an old friend of Clovis's, to discreetly spy on him and uncover the truth behind the rumors.\nWhen Dod and two BD-3000 luxury droids prepared to meet with Clovis at his palace's landing pads, he was met with the surprise that Clovis had brought Senator Amidala along with him. Though her appearance was problematic, Dod warmly welcomed her unexpected visit, and when she apologized for it, he dismissed her apology outright and told her that he hoped they could make a fresh start. As the group entered the palace, Dod informed Amidala that his servants would see her to her room and that he and Clovis had business to discuss elsewhere. After splitting from Amidala, Dod and Clovis went to the palace library, where they viewed a hologram of the droid foundry and discussed the future of their deal. When Clovis spoke of the new war profits the Banking Clan would receive from the factory, Dod retorted that he would profit as long as the Republic didn't find out and chastised him for bringing a member of the Republic Senate to Cato Neimoidia. Poggle stepped out from another room and told Clovis that he and Dod were taking a huge risk for little reward, and Dod agreed. Clovis angrily asked if they were suggesting that they change the terms of their agreement, then told Dod that he would not accept any alterations.\nClovis threatened to have Dod killed if there were any changes to their deal, but Dod simply replied that Clovis couldn't threaten him on his own world. Clovis struck back that Cato Neimoidia was hardly Dod's world after he signed over his holdings to the banks. Dod suddenly noticed Senator Amidala walking towards the room and warned Clovis and Poggle. Clovis quickly shut off the hologram while Poggle hid behind a pillar. Clovis asked what she was doing there, and she told him that she was lonely and came looking for him. Clovis told her that he would give her a tour of the palace later, then bid Dod farewell so he could take Amidala back to her room to dress for dinner. As Clovis and Amidala left, Poggle stepped out and spoke to Dod in Geonosian. Dod told Poggle that he hated having to answer to Clovis, then realized a new opportunity to use Amidala's presence to their benefit. Knowing that Clovis harbored feelings for her, Dod devised a scheme to poison her and use her as leverage against Clovis in their deal. By withholding the antidote, Dod and Poggle could force Clovis to agree to their terms. Poggle enthusiastically supported Dod's idea, and the Neimoidian made necessary preparations.\nDod chose to use the slow-acting manax root to poison Senator Amidala and planned to do so with a toast. He found Clovis in the palace's foyer and awaited Amidala to join them for dinner. As Amidala descended the staircase, Dod took a glass from a BD droid and invited her to share a drink with him as his honored guest. After taking a sip, Dod applied the poison onto the rim of the glass using his thumb, then offered it to Amidala as a toast to their new friendship. She accepted the glass and took a sip, unknowingly ingesting the poison. Once she finished drinking, Dod, Clovis, and Amidala went to dinner with a trio of Dod's Neimoidian colleagues. After dinner, Dod left Amidala and Clovis alone, where she began showing symptoms of the poison. However, as Clovis attempted to care for her, she escaped his watch to download the plans for the droid foundry from the palace library. Though she was able to hand the evidence of Clovis and Dod's treason over to her pilot, secretly the Jedi Knight Anakin Skywalker, she succumbed to the poison and fell unconscious.\nOnce he realized what had happened, Clovis frantically confronted Dod about Amidala's situation. Dod told Clovis to get a hold of himself and informed him that she was a Republic spy, which he immediately denied. Clovis left Dod and discovered that Amidala had stolen the hologram of the droid foundry and, fearing for his life if Dod found out, decided to help Skywalker retrieve the antidote in return for the stolen information. However, as they escorted the unconscious Amidala out of the palace, Dod, accompanied by a small entourage, intercepted them and asked what Clovis was doing. Clovis told Dod that Amidala was ill and they were taking her to her ship, but Dod suggested that she should not be taken from the palace if she was. Clovis hit back that he had contacted the authorities on Naboo, and they had urged him to return her to Coruscant. Dod yelled at Clovis, hoping to force him to stay, but Clovis aimed his blaster at Dod and ordered him to hand over the antidote. Dod growled that Clovis would pay and had one of his aides give him what he wanted. As Skywalker left the building with Amidala, Dod asked Clovis if he had lost his mind, but Clovis ignored him and followed the others.\nNo longer held at blasterpoint, Dod was joined by Poggle and a small detachment of B1-series battle droids to confront Clovis. Clovis's attempt to retrieve the data Amidala had stolen had failed as well, and Skywalker abandoned him on Cato Neimoidia after Clovis had given him the antidote. Dod, Poggle, and the battle droids ventured out onto the palace landing grounds, where Dod calmly told the stranded senator that they needed to \"talk.\" As Clovis began walking towards them, Dod ordered the battle droids to aim their blasters at him. However, Dod was unable to unleash his wrath on Clovis, and the senator's high rank in the Banking Clan saved his life. Amidala, meanwhile, recovered from Dod's poisoning, and the plans for the droid foundry she stole from the palace led to the Second Battle of Geonosis, during which Republic forces successfully destroyed the factory and took Poggle prisoner. Despite being implicated in investing in the droid foundry and poisoning Senator Amidala, Dod faced no repercussions and remained in the Senate, unlike Clovis, who was disgraced and removed from the body for his crimes.\nWith the war dragging on, the Trade Federation joined with the Confederacy in an attempt to drive the moon Pantora away from the Republic. A Federation blockade led by Sib Canay was set on the moon, ostensibly as a means to collect unpaid debts from the Pantoran government. The blockade isolated the Pantorans and generated anti-Republic sympathies among the populace, and as the situation grew worse, Dooku offered Confederate aid on the condition that Pantora left the Republic. Dod, meanwhile, worked in the Senate to legitimize the blockade and ensure its legality. The newly-elected Supreme Chairman of Pantora, Baron Notluwiski Papanoida, dispatched Senator Riyo Chuchi to Coruscant to combat Dod's efforts. Before the Senate, Dod stated that the Trade Federation was still neutral and that the blockade had been enacted purely to collect Pantora's debts. Senator Chuchi, however, strongly disagreed and denounced the Federation as an ally of the Separatists.\nDod dismissed Chuchi's statements as slander but admitted that the Federation did conduct business with the Confederacy. However, Dod was quick to state that the conglomerate's economic ties to the Separatists did not mean they were allied in any way and invoked the Commerce Treaty of 1647, which assured that the Federation was neutral in wartime. Before the session ended, Chuchi begged the Senate to listen to her pleas and ignore Dod's attempts to paint the blockade as a domestic financial issue, to strong applause. Later that day, Chairman Papanoida's daughters, Chi Eekway and Che Amanwe, were kidnapped from their apartment. Believing that the Senate and the Coruscant Security Force were too slow to react, Papanoida surmised that the Federation had taken his daughters hostage as leverage. Papanoida and Chuchi led an extralegal effort to recover them and, in the process, proved that they had been kidnapped under the orders of Sib Canay.\nWith the Pantoran's proof that Canay had been part of the conspiracy, Dod and the Federation had to quickly remove the blockade over Pantora and reopen commerce with the system. In the Senate, Dod conceded that the Separatists had allies in the Trade Federation, Canay among them, but stated that the officer had been acting alone when plotting the Papanoida kidnappings. Dod publicly denounced Canay and informed the Senate that the Federation had returned Papanoida's daughters to him in good faith. In what he called a \"gesture of friendship,\" Dod also announced that the blockade would be dissolved and that trade between the Trade Federation and Pantora would resume.\nAs a result of high Republic military casualties and financial instability due to the Clone Wars, the Senate convened in an emergency session to deliberate the future of the Republic's war efforts. Hoping to reap huge profits from an increase in war spending, Dod collaborated with Nix Card, who had succeeded Clovis as the Banking Clan representative, and Senator Gume Saam of the Techno Union. The three drafted a bill to be introduced by Saam that called for the deregulation of the Banking Clan, allowing the Republic to facilitate further loans with the banks and open more lines of credit for military funding.\nSaam introduced the motion during the emergency session, but the bill faced immediate scrutiny from Senator Organa's faction, which included Senators Amidala, Onaconda Farr of Rodia, and Mon Mothma of Chandrila. As Saam argued that an increase in clone production was needed to win the war, Organa protested that any increase in war spending was irresponsible, given that the Republic was already near bankruptcy. Dod entered the fray and offered his support for Saam's resolution, saying that opening new lines of credit would offer the Republic its much-needed funds. Mothma spoke up and questioned if the bill was asking for the deregulation of the banks, but Senator Halle Burtoni of Kamino responded that it was a small price to pay for winning the war.\nAs discord erupted in the Senate chamber between anti-war and pro-war groups, Senator Amidala floated her pod into the gallery and tried to placate support for the escalation of the war. Amidala tried to reason that it was morally and fiscally irresponsible to escalate the fighting, and Saam asked if she was asking that the Republic surrender to the Confederacy. Though she denied it and instead pushed for negotiations, Saam's question succeeded in instigating members of the Senate to chant in support of an immediate vote on his bill. Despite this, Organa requested that Vice Chair Amedda table Saam's bill until it was determined that deregulation was the right course of action. Amedda and Chancellor Palpatine conceded, much to Dod and Saam's anger.\nDod joined Saam and Card in the latter's office following the session, where Card complained that losing the legislation would cost them billions. Saam stated that he tried his best to push the bill through, and Dod blamed their failure on Senator Amidala. Card stated that he thought age would temper he idealism, prompting Saam to mention that he had connections to people who would take her out of play. Dod immediately dismissed Saam's offer because he had firsthand knowledge of how hard it was to kill her. Card interjected and told the two that the Banking Clan and Trade Federation were about business, not violence, but Dod instead remarked that, in this case, their business was violence. Card agreed and told his colleagues that the Senate was unlikely to pass deregulation until the war hit home. Dod asked what he was proposing, and Card suggested that some unexpected bloodshed on Coruscant would help them. Dod noted that Coruscant had not been attacked in over one thousand years, to which Card replied that it then had a false sense of security. The Muun informed Dod and Saam that he had powerful allies in the Confederacy who would help them pass their bill.\nDod, Card, and Saam reached out to Count Dooku, who, in turn, ordered Confederate General Grievous to send a team of infiltrator droids to Coruscant to bomb the planet's central power distribution grid. In the meantime, Senator Amidala embarked on her own mission to begin negotiations with Mina Bonteri, who had joined the Confederacy before the war. The two conceived a peace initiative that Bonteri first introduced to the Separatist Senate, which swiftly accepted the proposal. Dod and his allies became troubled when Dooku informed them of this development. Dooku told them that their worries were exaggerated, but Dod fretted that the groundswell of peace would continue and demanded to know when the attack on Coruscant would happen. Dooku promised that the bombing would end all peace talks and that the Trade Federation, Banking Clan, and Techno Union would all get their fair share, which eased them.\nIn a later session of the Republic Senate where Saam's bill was debated once again, Amidala, Organa, and Farr introduced the peace initiative and argued that there was no need for deregulation if they followed a path of negotiation. When Amedda brought Saam's bill to a vote, Dod worried that Dooku had abandoned his promise, but before the voting was completed the attack on Coruscant took place. The destruction of the power grid caused mass blackouts and fires across the planet, and the vote on the bill was brought to a halt. Once it was confirmed that the bombing was the Confederacy's fault, Saam used it to his benefit. Saam passionately argued that the Senate had to expand military funding to make the Separatists pay and, despite Amidala's pleas, the Senate quickly abandoned her peace initiative. Vice Chair Amedda took aim at the initiative's legitimacy and blamed it for lowering their defenses, and Senators Burtoni and Mot-Not Rab, among others, called for immediate deregulation.\nIn the final death knell for negotiations with the Separatists, Chancellor Palpatine voiced his support for deregulation, and Dod smiled gleefully as the Senate voted to pass Saam's bill. The deregulation of the Banking Clan opened the Senate to a vote on a separate bill from Senator Burtoni that moved for the Republic to purchase an additional five million clone troopers from the Kaminoan government. Burtoni's bill eventually went through despite opposition from Organa, Amidala, Farr, and Mothma, who later attempted to counteract both Saam's bill and Burtoni's by introducing legislation that would reduce military spending but failed to gather enough votes to pass it.\nIn 19 BBY, Dod was present in the Senate during a vote to confirm Baron Clovis as the new head of the InterGalactic Banking Clan. Despite his earlier dealings with the Separatists, Clovis had brought word to the Republic that the Muun leaders of the Banking Clan were embezzling credits, an act that threatened the Republic's financial system. Though many remained suspicious of him, Clovis was nominated to assume control of the Banking Clan following the arrest of the Muun leadership, and he pledged before the Senate that he would be neutral in all financial matters. When it was noted that Clovis had the support of both the Separatist government and the Muun people, Dod demanded to hear the Chancellor's views on the matter, and Palpatine obliged him by stating that Clovis was the best candidate, given the circumstances. In the subsequent vote, the Senate confirmed Clovis as the new leader of the Banking Clan.\nClovis's rise to power had been manufactured by Darth Sidious and Dooku, however, in a plot to drive control of the banks into the Office of the Supreme Chancellor. A Confederacy invasion of Scipio prompted to a Republic counterattack, and Clovis committed suicide during the battle. The event was enough to convince the Muuns to cede control of the banks over to Chancellor Palpatine, an event Dod was present in the Senate to witness.\nLott Dod eventually lost his life to the Clone Wars. Following his death, the Trade Federation lost much of it's external influence but would not regain any power as the war drew to a close. Count Dooku and General Grievous were both killed by Republic forces during the battles of Coruscant and Utapau, respectively, and the Separatist Council went into hiding on Mustafar. Having no more use for the Separatists or the Trade Federation, Darth Sidious had his new apprentice, Darth Vader, execute the Separatist leaders, Viceroy Gunray among them. With their deaths and the subsequent shutdown of the Confederate droid armies, the Clone Wars effectively ended. With his plan finally coming to fulfillment, Sidious as Palpatine announced that the Republic would be reorganized into the first Galactic Empire. The Empire absorbed the Trade Federation's assets, including Dod's personal fortune, which was considerable. To those unaware of his death, Dod himself had simply vanished at the war's end.\nIn the decades after the end of the Clone Wars, the Trade Federation managed to rebound from its decline. By adapting to the changing circumstances, the Federation maintained some of its stability despite never regaining its lost wealth. Dod's palace and other facilities on Cato Neimoidia remained under Federation control, and they became key to the Federation's transition into a security provider. By the time of the Cold War between the Resistance and the First Order, long after the Empire's end, Dod's palace had fallen into the possession of Baron Paw Maccon of House Maccon, who transformed the luxurious grounds into the extensive Great Vaults of Cato Neimoidia. Utilizing the abandoned palace vaults once used to store Dod and others' personal wealth, Maccon began renting the spaces out to moneyed clientele for safekeeping. The former palace became a tourist attraction, and the late Dod was memorialized by tour guides as an example of the Trade Federation's primary power brokers before the end of the Clone Wars.\nLott Dod was a male Neimoidian who stood 1.9 meters, or 6 feet and 3 inches, tall. Dod's skin, like most Neimoidians, was green, and his eyes were a shade of red. Dod was materialistic and used his position of authority to establish his income through corruption and power brokering, often bribing his fellow senators for loyalty to the Trade Federation. Because of his network of influence, Dod could spin even the evilest of acts committed by the super-rich corporation, knowing he could whip support behind him. Dod knew to target bills damaging to his and the Federation's finances by attacking them economically, holding the Federation's lucrative deals and contracts with key worlds over the heads of their senators. Because of his corrupt ways and the trajectory he and Viceroy Gunray had taken the Trade Federation, Dod was unpopular with idealistic members of the Trade Federation, who sought to oust him from office. He was regarded with mixed reception, however, by the people of Cato Neimoidia, many of whom were anti-Republic and embraced his claims of neutrality during the Clone Wars.\nDod's corrupt and self-serving tactics were no secret to those in the Senate, but he avoided serious challenges to his seat through lies and his connections to the Sith. Though Dod was allied with the Sith Lords Darth Sidious and Darth Tyrannus, who were known publicly as Chancellor Palpatine and Count Dooku, he was primarily in league with them for his own personal gain. Sidious played a key role in Dod's ascent to the Trade Federation leadership after the Eriadu Conference, and Dod aided Sidious's plans for the Federation to invade Naboo in kind. Following Sidious' success in using the crisis to become the Republic Chancellor as Palpatine, Dod supported him and advocated for his chancellory, knowing that aiding him would continue to be mutually beneficial.\nLikewise, Dod was supportive of Dooku's Confederacy of Independent Systems. Dod used a strategy of denial and gaslighting to maintain the tenuous claims that he and the Federation were neutral in the Clone Wars despite evidence to the contrary. He also made many attempts to distance himself from the Separatists and Nute Gunray publicly and used legal precedence to defend his actions. During the war, Dod made several attempts to sabotage Republic legislation scaling back the war effort, hoping to capitalize on the conflict by instead pushing the overwhelmingly pro-war Senate to pass funding that would increase military production. In return, Dod received a healthy income from both the Republic and Confederacy to ensure both sides stayed well-equipped. Dod knowingly abused the Republic's long-standing democratic norms and bureaucracy to the benefit of himself and his allies in the Senate and did so with glee.\nThough Dod's tactics to obstruct Republic relief and peace initiatives were often through legal, if dubious, means, he had a dark side and was willing to use harsher and more violent strategies to achieve his goals. Dod had been an opponent to Padmé Amidala since the Invasion of Naboo, but he outwardly adopted a cordial manner of addressing her in private. After realizing that Rush Clovis had feelings for her, Dod plotted to poison her to alter his deal with Clovis into the way he wanted it to be, though his scheme failed. Dod worked with Nix Card and Gume Saam to push expansive military funding through the Senate, but when the motion was tabled, they decided to turn to Dooku and ask him to create \" unexpected bloodshed\" on Coruscant, willing to attack innocent people with the only goal of collecting more money for themselves.\nAn influential and commanding politician, Lott Dod held much power during his tenure as senator for the Trade Federation. Using his proficiency in manipulation and his ability to navigate and control the vast bureaucracy of the Republic, Dod could seemingly strike down any bill or motion he wanted to. Dod peddled his and the Trade Federation's economic influence over various systems and could force entire voting blocs allied with the Trade Federation to side with him.\nA strategist, Dod had deep political knowledge and wielded his power as softly or not as he pleased. When arguing against the precursor to the Mid Rim Cooperation Motion and presenting his case against Toydaria sending aid to Ryloth, Dod targeted his opponents with logical tactics, using political and economic reason as the tool for his obstruction. However, he was not above scheming or even killing to get what he wanted in other cases.\nAs the senator for the Trade Federation, Lott Dod wore clothing appropriate to his high status. On his head, Dod often wore a senatorial miter, a tall hat with an arrow-shaped point at its apex. Dod's miter was colored a deep blue, and he wore it to represent his position. He also wore darkly-hued fancy robes with the mantle of the supreme representative resting around his neck and down his body. The senatorial mantle was a long purple cloth with a small swirling pattern repeated over its length and a diamond-shaped emblem adorning each side near Dod's shoulders. Both Dod's miter and mantle were of Neimoidian origin, and the senator wore both proudly to display his influence as one of the Trade Federation's wealthy power brokers.\nBecause of his considerable personal fortune, Dod was also the owner of a luxurious and sprawling palace on Cato Neimoidia. He additionally owned a number of gold-plated BD-3000 droids, a servant droid manufactured by LeisureMech Enterprises.\nLott Dod first appeared in the novelization of the 1999 film Star Wars: Episode I The Phantom Menace by Terry Brooks, and then in the film itself. He was played by Silas Carson and voiced by Toby Longworth in the film. Dod later appeared in the television series Star Wars: The Clone Wars, where he was voiced by Gideon Emery.\nLott Dod was named after then-GOP Senate leader in 1997 Trent Lott, in an attempt to directly connect the Trade Federation's characterization and motives with that of the Republican Revolution that occurred in 1994. Originally, for his appearance, Dod and the Neimoidians were designed as organic versions of the Federation's B1-series battle droids to suggest that the Neimoidians had modeled the battle droids after their own image. For this to work, the Neimoidians would have had to been produced by computer-generated imagery. During production, Lucasfilm Ltd.'s Art Department opted to use animatronic masks to bring the Neimoidians to life. Consequently, the Neimoidians' appearances changed dramatically and Dod's senatorial miter, which first appeared in rough sketches of the Neimoidian, later took the shape of fellow Separatist Rune Haako.\nIn the 2002 film Star Wars: Episode II Attack of the Clones, a Neimoidian wearing clothing similar to that of Dod appears alongside Nute Gunray on Geonosis, spawning a debate as to who the Neimoidian was. The end credits for the film identify the Neimoidian as Lott Dod , but the Neimoidian does not resemble Dod. The 2016 reference book Star Wars: Complete Locations identifies that Neimoidian as Dod.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lott_Dod",
  "/wiki/Lott_Dod/Legends",
  "/wiki/Neimoidia",
  "/wiki/19_BBY",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Trade_Federation",
  "/wiki/Sith",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Politics",
  "/wiki/Standard_decade",
  "/wiki/Eriadu_Conference",
  "/wiki/Nute_Gunray",
  "/wiki/Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Senator",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Supreme_Chancellor",
  "/wiki/Finis_Valorum",
  "/wiki/Prop_31-814D",
  "/wiki/Clone_Wars",
  "/wiki/The_galaxy",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Ryloth",
  "/wiki/Blockade_of_Pantora",
  "/wiki/Pantora",
  "/wiki/Geonosis_primary_droid_foundry",
  "/wiki/Geonosis",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Republic_financial_reform_bill",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Death",
  "/wiki/Galactic_Empire",
  "/wiki/Reproduction",
  "/wiki/Homeworld",
  "/wiki/Cato_Neimoidia",
  "/wiki/33_BBY",
  "/wiki/Nebula_Front",
  "/wiki/File:LottDodPalace-SS.png",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Diplomat",
  "/wiki/Lufa_Danak",
  "/wiki/Financial_officer",
  "/wiki/Neimoidian_drone",
  "/wiki/Great_Vaults_of_Cato_Neimoidia",
  "/wiki/32_BBY",
  "/wiki/Free_Trade_Zone",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Outer_Rim_Territories",
  "/wiki/File:IObject-TPM.ogg",
  "/wiki/File:DroidControlShip-TPM.png",
  "/wiki/Delcontrian",
  "/wiki/Yarua",
  "/wiki/Kashyyk",
  "/wiki/Lucrehulk-class_LH-3210_cargo_freighter",
  "/wiki/Plasma",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Ambassador",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/File:TF_Senate.png",
  "/wiki/Repulsorpod",
  "/wiki/Chancellor%27s_podium",
  "/wiki/Aks_Moe",
  "/wiki/Congress_of_Malastare",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Vote_of_No_Confidence",
  "/wiki/28_BBY",
  "/wiki/Supreme_Court",
  "/wiki/Chommell_sector",
  "/wiki/Oshadam",
  "/wiki/Ithor",
  "/wiki/Urce",
  "/wiki/Ithorian",
  "/wiki/Hyperspace_route",
  "/wiki/Lesser_Plooriod_Cluster",
  "/wiki/Urce_sector",
  "/wiki/File:LottDod-SupplyLines.png",
  "/wiki/Bromlarch",
  "/wiki/Bromlarch_planetary_aqueduct_system",
  "/wiki/Mina_Bonteri",
  "/wiki/Onderon",
  "/wiki/Rush_Clovis",
  "/wiki/Caelor_Gaans",
  "/wiki/Mid_Rim_Cooperation_Motion",
  "/wiki/Malastare",
  "/wiki/File:PoggleLottDod-SS.jpg",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Serenno",
  "/wiki/22_BBY",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Tikkes",
  "/wiki/Oje_N%27deeb",
  "/wiki/File:CNCityBridges-SS.png",
  "/wiki/Cadesura_district",
  "/wiki/Zarra",
  "/wiki/Cadesura_disaster",
  "/wiki/Alluv_Eyam",
  "/wiki/Ketar_Nor",
  "/wiki/Asajj_Ventress",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/File:DodOrganaPresenting.png",
  "/wiki/Twi%27lek",
  "/wiki/Twi%27lek_Resistance",
  "/wiki/Jedi_High_Council",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaan",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Toydaria",
  "/wiki/King",
  "/wiki/Katuunko",
  "/wiki/Toydarian_Ministry_Council",
  "/wiki/Ryloth_blockade",
  "/wiki/File:MissionToToydaria-SL.png",
  "/wiki/The_Matter_of_Using_Toydarian_Territory_to_Aid_the_Shipment_of_Relief_Supplies_to_the_Citizens_of_Ryloth",
  "/wiki/Orn_Free_Taa",
  "/wiki/File:BinksImprovSculpture-SL.png",
  "/wiki/Alderaanian",
  "/wiki/21_BBY",
  "/wiki/Geonosian",
  "/wiki/Archduke",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Mission_to_Cato_Neimoidia",
  "/wiki/File:SenateSpy_main.jpg",
  "/wiki/BD-3000_luxury_droid",
  "/wiki/Geonosian_hive-mind",
  "/wiki/Poison",
  "/wiki/Manax_root",
  "/wiki/Toast_(ritual)",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/File:RushDemandsAntidote-SS.jpg",
  "/wiki/B1-series_battle_droid",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/File:PantoraBlockade-SoI.png",
  "/wiki/Moon",
  "/wiki/Sib_Canay",
  "/wiki/Supreme_Chairman",
  "/wiki/Baron",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Riyo_Chuchi",
  "/wiki/Commerce_Treaty_of_1647",
  "/wiki/Chi_Eekway_Papanoida",
  "/wiki/Che_Amanwe_Papanoida",
  "/wiki/Kidnapping_of_the_Papanoida_daughters",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Rescue_in_Chalmun%27s_Cantina",
  "/wiki/Rescue_on_the_Pantora_Droid_Control_Ship",
  "/wiki/File:Military_enhancement_bill.png",
  "/wiki/Nix_Card",
  "/wiki/Gume_Saam",
  "/wiki/Techno_Union",
  "/wiki/Onaconda_Farr",
  "/wiki/Rodia",
  "/wiki/Mon_Mothma",
  "/wiki/Chandrila",
  "/wiki/Halle_Burtoni",
  "/wiki/Kamino",
  "/wiki/Muun",
  "/wiki/File:SaamCardDoddAndHoloDooku-TCWS03E10.jpg",
  "/wiki/Grievous",
  "/wiki/Infiltrator_demolition_droid",
  "/wiki/Central_power_distribution_grid",
  "/wiki/Separatist_Senate",
  "/wiki/Mot-Not_Rab",
  "/wiki/File:EpGuide606.png",
  "/wiki/Office_of_the_Supreme_Chancellor",
  "/wiki/Invasion_of_Scipio",
  "/wiki/File:Paw_Maccon.jpg",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Battle_of_Utapau",
  "/wiki/Mustafar",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Cold_War",
  "/wiki/Resistance",
  "/wiki/First_Order",
  "/wiki/Galactic_Concordance",
  "/wiki/Paw_Maccon",
  "/wiki/House_Maccon",
  "/wiki/File:ThePoisonousToast.png",
  "/wiki/Senatorial_miter",
  "/wiki/Mantle_of_the_supreme_representative",
  "/wiki/LeisureMech_Enterprises",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Terry_Brooks",
  "/wiki/Silas_Carson",
  "/wiki/Toby_Longworth",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Gideon_Emery",
  "/wiki/File:76981-25524.jpg",
  "/wiki/1997",
  "/wiki/1994",
  "/wiki/Battle_droid",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Rune_Haako",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Alan_Ruscoe",
  "/wiki/2016",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Queen%27s_Hope",
  "/wiki/Brotherhood",
  "/wiki/Supply_Lines",
  "/wiki/Senate_Spy",
  "/wiki/Sphere_of_Influence",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/Poe_Dameron_20",
  "/wiki/Category:Audio_files_of_Lott_Dod",
  "/wiki/Category:Images_of_Lott_Dod",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_90",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/The_Separatists",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Children_of_the_Force",
  "/wiki/The_Zillo_Beast",
  "/wiki/Legacy_of_Terror",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Senate_Murders",
  "/wiki/June_29",
  "/wiki/2017",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Protocol_and_Service_Droids",
  "/wiki/Databank_(original)"
 ]
}