{
 "name": "Lourna Dee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aaloth"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 272 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Ice-blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lourna Dee's family",
      "Zygerrian Alliance",
      "Galactic Republic",
      "Carida Academy",
      "Prisoner rehabilitation program",
      "Carida Academy",
      "Prisoner rehabilitation program",
      "Nihil",
      "Lourna Dee's Storm",
      "Lourna Dee's Tempest",
      "Lourna Dee's Storm",
      "Lourna Dee's Tempest"
     ]
    }
   ]
  }
 ],
 "content": "Lourna Dee, known by the code Unit 4978/7179 and the pseudonyms Inun and Sal Krost, was a Twi'lek female who held the rank of Tempest Runner in the marauder organization known as the Nihil. One of three Tempest Runners, Dee led a Tempest and commanded a cruiser, which she named Lourna Dee after herself. Prior to joining the Nihil, Lourna had been royalty, enslaved, and a Galactic Republic cadet. She was around forty years old when the Great Hyperspace Disaster occured, which led the way for the Eye of the Nihil, Marchion Ro, to take control of the organization.\nAfter Lourna Dee led the Nihil attack on Valo's Republic Fair, the Republic mistakenly believed her to be the Eye of the Nihil. Following the Battle of Galov, Dee was taken into Republic custody and sentenced to ten years aboard the prison ship Restitution. After some time aboard as a prisoner, Lourna commandeered the Restitution and renamed it the Lourna Dee.\nBorn around 272 BBY, Lourna Dee was a female Twi'lek. Her family was the First family of Aaloth, a Twi'lek colony planet of that species' homeworld of Ryloth. Lourna's father, Yudiah Dee, ruled the planet as Keeper. Yudiah and Lourna's sister Haleena opposed the common practice of Twi'lek colony planets basing their economies on spice mining and the slave trade. Aaloth was stricken by famines, leading to much of its population starving. Lourna believed the populace had to be brought \"under control,\" and that mining for the ore ryll used in spice production could provide a viable economic baseline to feed Aaloth's people.\nAt some point in her early life, Lourna became trapped under a blurrg. She called her brother Inun useless for failing to lift the blurrg off her. Soon thereafter, her boyfriend Bala Waleen staged a coup d'état against Lourna's family who ruled the planet and had them all executed. He then sold Lourna into slavery and usurped her father's role as Keeper of Aaloth.\nBala sold Lourna into slavery, selling her to the Zygerrian slave overseer Vardem Kroleyic of the Zygerrian Alliance. Lourna was fitted with a shock collar and designated \"Unit 4978/7179.\" Dee tried to look after the well-being of her fellow slaves including a Gamorrean sow and a human slave, each of whom contracted a disease. Lourna's slavedrivers routinely punished her for voicing opinions and advocating for other slaves. The human slave advised Lourna to keep her head down and stay quiet so as not to attract their enslavers' attention and wrath.\nKroleyic nearly murdered the sick human slave when the Zygerrian slave camp they had been held at was attacked by Jedi forces. Jedi Master Oppo Rancisis and his Padawan Dal Azim rescued many enslaved people including Lourna from captivity. Lourna insisted that the attack was the slaves' \"chance\" to overpower their captors, urging them to run. After being freed by the Jedi, Lourna vowed she would never be locked up again.\nOppo Rancisis commended Lourna for her bravery leading the slave revolt and asked where she would like to go after her rescue. Lourna insisted she had nowhere to go, refusing the Jedi Master's offer to return her to the Twi'lek homeworld of Ryloth. He sensed much anger in Dee, and asked Dal to remove Lourna's shock collar using the Force. Rancisis then asked Dee her name, and she supplied him with her unit number as a slave. When the Jedi asked her real name, she insisted it didn't matter as she couldn't return to her past. Rancisis said, in that case, that they should go forwards.\nMaster Rancisis delivered Lourna to the Carida Military Academy, which he declared the finest military academy in the Galactic Republic. Dee told the Jedi Master that \"handing her over\" to the military did not seem very \"Jedi-like.\" Rancisis said he could not see her thriving in a temple outpost or a foster system. Lourna interrupted her Jedi companion saying she did not want another family. Rancisis sensed great anger in Lourna that went deeper than her experience with the Zygerrian slavers, but refused to share her reasons for it. After the Jedi's encouragement, Lourna enrolled in the academy under her deceased brother Inun's name.\nDuring her time as a cadet, Lourna remained in contact with Master Rancisis. Rancisis had been overseeing the construction of the Jedi outpost on Volostun, which was the furthest from Coruscant at the time. As a result of the poor relay network and the great distances, communications became very low quality. Nevertheless, Captain Reese kept Master Rancisis apprised of Dee's grades, and the Jedi commended her for excelling in nearly \"every aspect\" of her training. Although Dee was not sure of herself, Rancisis assured the cadet that she had a natural affinity for flight. However, Reese reported that Dee sometimes struggled with respecting the chain of command. Lourna expressed regret for agreeing to enroll, but Rancisis assured her that he would be thinking of her and willing her on. He told her she must strive and persevere and bade the Force to be with her when the call broke off. Lourna tried in vain to fix the connection and entered a bout of rage, asking what if she did not want to strive or persevere and referring to the Thisspiasian Jedi Master as a \"slithering hairball.\" Dee destroyed the communication device when Captain Reese appeared behind her and scolded her for destroying Academy property. He punished her by making her run 50 laps at the Academy square wearing a gravity pack, after which she had to rebuild the destroyed equipment by hand.\nAn instructor at the Academy required the cadets to train in starfighter maintenance to know every millimeter of their vessels. Lourna had an excellent aptitude for mechanical work, but other cadets such as Wilson and the Selkath Lalutin were annoyed at the work of repairing starfighters. Lalutin attempted to take Lourna's servo driver which she was using, and she challenged him to a fight. Wilson demanded that a first-year cadet such as Lourna obey commands from senior cadets such as Lalutin lest they face serious trouble. Lourna defied the two cadets' attempt to pull rank on her, pointing to her assessment scores which were higher than theirs. The senior cadets threatened to report Dee to Captain Reese for insubordination. Lourna then ranted that the Carida Academy was a sham, and its graduates would either end up in unimportant administrative office roles or at an Academy teaching the next generation of \"deluded, self-important gasbags\" who were foolish enough to enroll.\nShe acquiesced to allowing the older cadets to take her servo driver, now covered in grease. However, they ordered her to clean it on her uniform. She then cursed and assaulted Lalutin with the device, getting blood on it as well. Wilson said that Lalutin was no longer breathing before Lourna attacked him as well. At that point, Reese came by and ordered Wilson and \"Inun\" to stand down. Lourna then confessed that Inun was never her name, and said that he was better than her. Dee said Inun would never have done what she was about to do: hijack a starfighter.\nCaptain Reese ordered all cadets to board their starfighters to pursue Dee, reasoning that she would not get far without a hyperdrive. However, none of the other cadets were as talented at starfighter maintenance as Lourna. All other fighters were grounded by loose fuel injectors, which caused safety protocols to prevent launch in a way that could not be overridden. A servo driver could fix the loose injectors, but Lourna took it with her. Carida Control informed Dee that, as she had stolen her fighter, her engine would shut down and a recovery beacon would activate. However, she managed to override Carida Control's override signal. She sarcastically remarked that she could not have done any of this without the Academy's skilled training staff, and to send her compliments to them while sending kissing noises.\nHaving shed her pseudonym of Inun, Lourna pondered what she and her stolen fighter should do next. She decided returning to Aaloth would be pointless, and that if she chased down Master Rancisis, that he would send her to \"another Carida on another planet.\" She then resolved to live how she chose, making it up as she went along. Dee exclaimed to the universe that no-one would ever tell her what to do again.\nDee became a regular patron at a bar near a spaceport on Nurasenti, where she engaged in fights with other patrons much to the chagrin of the bartender Karter. She wore battle-damaged Mandalorian iron armor in barfights. Upon hearing that a patron had bet on her, she took the patron's winnings and chased off some customers before retreating into a booth. She was then joined by Bala Waleen, who did not recognize her under her Mandalorian armor. The usurper Keeper who had executed her family told Dee her voice was familiar, and she responded denying any connection. Waleen informed Lourna that Aaloth's \"supply lines\" had been disrupted by a group of pirates known as the Nihil, and sought to hire her to protect the planet's ships. Dee asked for 300 ingots for the job and a starship, to which Bala agreed.\nDee joined the crew of the cargo cruiser Tycoon Trader and lie in wait for the Nihil to incapacitate the ship with war cloud gas torpedoes. Lourna had emptied the Trader of glitterstim and set up automated defenses aboard the ship for the ambush, including mining the cargo hold with thermal detonators. The Nihil pulled the Trader out of hyperspace with a gravity mine in the Abrion sector and raided the ship. The Colicoid Storm Jinnix sent a boarding party to Dee's cruiser from his stormship, including Towl, Blackwing, and the droid H7-09. Dee killed all the organic marauders and damaged H7. Eventually Jinnix boarded the Trader, engaging Dee in combat. Jinnix licked Dee's beskar helmet, giving Dee the opportunity to rip out one of his fangs. Dee killed Jinnix by stabbing him with his own tusk. Lourna took some of Jinnix's stims, enabling her to get back on her feet.\nHaving killed all the Nihil, Dee felt confident she could enter the second stage of her planned revenge on Bala. However, she was confronted by the Dowutin Tempest Runner Pan Eyta and some of his underlings. The Dowutin ordered her to surrender and took her prisoner. Much later, Dee asked Eyta why he didn't kill her then and there. He told her he wanted to know who could take down a Colicoid and wipe out an entire Storm single-handedly.\nDee defected to the Nihil, helping lead a raid on Aaloth. Pan Eyta preferred to have the entire world of origin of the spice over merely hijacking shipments. Dee was eager to exact revenge on her former boyfriend who destroyed her life. By that point, she had become ruthless and intrepid. Waleen tried to escape to his starship, but Eyta cornered him. Lourna revealed herself to her traitorous ex, who still believed the mercenary he hired a Mandalorian. Bala asked the Lourna how she could betray her own planet and home, to which she scoffed. She requisitioned Jinix's ship, the Tooth Spike, and rechristened it the Lourna Dee as she shot Bala with Pan's blaster.\nLourna climbed the ranks of the organization, eventually becoming a Storm and leading a Storm group and running the mines on her homeworld of Aaloth. In addition to the Lourna Dee stormship, she appropriated a now-repaired H7-09 from the deceased Jinix. Dee trusted H7 more than any other member of her Storm, enough to perform a teeth-sharpening ritual typically performed by Twi'lek males. A Strike interrupted H7's sharpening of Dee's teeth to deliver a summons from the Tempest Runners to attend a party at the Great Hall of the Nihil in No-Space, which would be a chance to be seen by the Eye of the Nihil Asgar Ro. Dee told the Strike to inform No-Space that the Lourna Dee would be there, and then struck her Strike for interrupting her dental rite.\nAfter arriving at the Great Hall, H7 complimented Dee on her intimidating appearance, which made her fit right in. Lourna was impressed by the Hall, a repulsor disk hanging in the cosmic dust of No-Space and accessible only through Asgar's Paths. Dee asked H7 whether Ro had built the Hall, but the droid did not know the answer. Pan Eyta approached Lourna after she threatened a highly intoxicated Nihil who bumped into her. She greeted her Tempest Runner formally, and the Dowutin told her all were equal at a revel. Nevertheless, he said he would break a person's legs for bumping into him like that. Eyta offered to introduce Lourna, his \"finest Storm,\" to the Eye.\nPan took Lourna to meet Eye of the Nihil Asgar Ro, who was conversing with the Weequay Tempest Runner Kassav Milliko. Kassav bragged about using a proton bomb to destroy the holy Chamber of the Unknown Spirits in the sacred Relic Reap. The Weequay joked that the Relic Reap was now very \"hole-y\" as his bomb had created a lot of holes. Eyta warned Dee to be cautious around Milliko, whose hands had a habit of wandering when he indulged in his spice habit. Pan suggested Lourna use her new \"fangs\" to snap Kassav's hands off if he touched her. Asgar Ro complimented Lourna for her bright and rising reputation.\nThe Eye asked the Twi'lek Storm her opinion of the Great Hall. Lourna replied it was impressive, when Asgar's son Marchion Ro interrupted to say it was defenseless. The younger Ro pointed out that the Hall was merely a durasteel platform protected only by vacuum shields. Marchion pointed out that the Great Hall would be highly vulnerable in event of an attack, but his father replied that no-one knew of the Great Hall and the many Nihil ships gathered outside could defend it from an invasion. Marchion's father said his son worried incessantly about everything, and the son opined that the presence of all Nihil vessels concentrated at one place and time weakened the organization in event of a surprise attack.\nAsgar asked Kassav to signal the crowd to attention, causing the Weequay pirate to shoot several shots with his blaster. Marchion fretted, worrying that Milliko could puncture the energy shields and open the Great Hall to vacuum. Eyta insisted that would not happen. Asgar beckoned the crowd to attention, declaring it had been far too long since the Nihil had assembled. The Eye declared that the Nihil were feared and unstoppable. However, not everyone had payed their dues per the Rule of Three: the spoils of Nihil raids were to go three ways. One-third of the spoils was to go to the Storms, Clouds, and Strikes who performed the raid; a third to the Tempest Runner; and, if the raiders made use of the Paths, a third would go to the Eye of the Nihil. Asgar brought out Xanaven, a Frong Tempest Runner who had not paid his fair dues to the Eye, in shackles. The Eye announced his purpose for the summons: the public execution of Xanaven and his replacement with a new Tempest Runner.\nZan attempted to break free and attack Asgar, but Lourna Dee sprang up to protect Ro from the Frong. Dee killed Avan with her sharpened teeth, leading Asgar to commend her bravery for risking her own life to protect her Eye. At that moment, Asgar promoted Lourna to the rank of Tempest Runner, much to the chagrin of both Pan and Kassav. Lourna had not expected the promotion, but quickly embraced the promotion as the Eye commanded the crowd to chant her name in praise. Xanaven's Tempest was abolished with Lourna Dee's rising in its place. Dee's Tempest came to inherit her sadism, and in time developed the reputation of only striking when they absolutely knew they would win.\nUnknown to Asgar or Lourna; Eyta, Milliko, and Avan had conspired against the Eye. The Tempest Runners were displeased with Asgar taking one third of all profits and had planned for the Frong to kill the Eye in front of the assembled crowd. Marchion had hesitated to give his father his sword during the execution, which nearly allowed Zan to kill Asgar until Lourna intervened. At some point after becoming a Tempest Runner, Dee, her fellow Tempest Runners, and Asgar led a Nihil rally on an astronomical object as the young Marchion watched on beside them.\nWhile serving as a Tempest Runner, Lourna Dee visited Kassav's flagship, the New Elite, where an arm wrestling match between Kassav Milliko and his Gungan lieutenant Wet Bub was underway. Bub was capable of speaking in Galactic Basic Standard, but at that time talked in the Gungan patois dialect to throw off his Tempest Runner. Dee challenged Kassav to a wrestling match, insisting that wrestling the Gungan Storm would be a waste of energy when she could take the Tempest. Dellex bet fifty credits on Dee's victory. The Weequay Tempest Runner was known to be strong, but Dee proved herself stronger. Lourna insisted all the smash Kassav consumed eroded his strength. The New Elite's captain yielded, claiming that the Tempest Runners were equal in every way. Dellex retorted that she'd like to see Kassav wrestle Pan, a large Dowutin, but then demurred under pressure.\nKassav and Lourna took a call from Pan Eyta in Kassav's cabin. Dee tried to soothe Kassav, who was out of breath, in case he was embarrassed. The Tempest Runners had convened a meeting to deal with Eye of the Nihil Asgar Ro. Dee did not see the problem, to which Kassav replied she was his favorite. Kassav wished Zan Avan was still their fellow Tempest Runner; confusing Dee, who believed he had been a traitor. The Dowutin and Weequay Tempest Runners informed Lourna of their conspiracy she had inadvertently foiled. Dee believed Asgar had united the Nihil, but the other Tempests told her not to believe everything he said. Kassav admitted the Nihil needed his Paths, but resented Asgar telling them what to do and when.\nThe Weequay bemoaned that they had been \"neutered\" by Asgar, who, in his tellings, had altered the deal. Eyta and Milliko planned to kill Asgar so he could not alter it further. Eyta explained that they would still have access to the Paths from Asgar's son Marchion, whom Milliko described as the \"runt\" of the litter cowering under his father's shadow. Kassav and Eyta would still give Marchion a reduced cut, but believed him to be far more pliable and manipulable by the Tempest Runners. Milliko decried Asgar, recounting that they had never signed up for a leader. He then threatened Lourna to either join their conspiracy against Asgar or die.\nDee nominally agreed to the other Runner's conspiracy but immediately informed Asgar Ro of the plot. The Eye told Lourna she owed him more than she owed her fellow runners. She told Ro that the galaxy was full of Pans, but there was only one of Asgar. The planned coup was to take place aboard Pan Eyta's Elegencia, where Eyta would invite Asgar on the pretext of worrying about Kassav's addictions. The Tempest runners had drawn lots, and Kassav was selected to be the one to execute Ro. Lourna was to gather the Nihil to inform them of Asgar's death and comfort his son Marchion. Lourna pointed out that the Eye could kill both Pan and Kassav with a thermite bomb placed near the Elegencia's core, which would leave Lourna and Asgar together in command of the Nihil. Ro liked the way Lourna thought, but insisted the Paths were not hers in any part, but his alone. He promised to reward her loyalty, but would not share power or money equally with the Twi'lek. He would suggest a raid on Shili by the combined Tempests of Kassav and Pan, where they would be decimated by the Togruta Royal Fleet.\nAsgar asked Lourna to submit an anonymous tip to Togruta intelligence so Kassav and Pan's forces would be destroyed. Lourna chafed at the thought of selling out her fellow Tempest Runners, but Asgar pointed out that she was currently doing so to him. The Eye further explained that Eyta and Milliko would escape, but their Tempests would not; thereby jeopardizing Kassav and Pan's position within the Nihil. To earn back their prestige and the respect of their people, they would need quick and easy victories, which would require Paths from Asgar. Ro knew Pan and Kassav were treacherous but not foolish. Dee then asked what would happen if she told her fellow Runners about Asgar's plot; the Eye responded that he was willing to take that risk just as she had risked informing him about their planned coup. Asgar asked Lourna who she could trust more: him or Pan and Kassav.\nIn a fit of anger, Lourna Dee reflected that she could trust Asgar to stab her in the back. She then attacked her communications equipment, when H7-09 came in to ask if all was as it should be. She asked the droid to transfer a Path to the Great Hall to her smallest Strike ship, because the Eye was not expecting her. H7 threatened to blackmail Dee over the information, but she remotely overrode his behavior and wiped his memory. She then proceded to transfer the path herself.\nDee found Asgar alone in the Great Hall and stabbed him, leaving him to bleed out in his personal quarters. Marchion found his father, who was unsure of who had attacked him, bleeding out but kicked him viciously to make his death more painful. Thereafter, at the Great Hall, Marchion approached Kassav and Dee, telling them of how someone had murdered his father as he held the dead man's helmet. When Dee questioned if his father had gotten him ready to be the Eye, the young Ro responded that he had and prepared to leave back to the Gaze Electric, only for Kassav to confide in Dee his fear about whether Marchion would really live up to the hole his father's death left. Overhearing them, Ro confirmed to them both that he was not his father, leading to two Tempest Runners to reach for their blasters as Kassav asked him to settle down. Dee was silent as Kassav claimed they had all respected Asgar before asking the boy if he had vision like his father, to which Marchion replied by saying he believed he had vision as well, puttig his father's bloodied helmet on.\nAfterward, the Nihil's Tempest Runners met back at the Great Hall for a funeral pyre, believing Marchion needed time to mourn his father. Kassav and Pan were angry with Lourna for failing to comply with their agreed-upon plan; meaning, in Kassav's words, that they could not trust her. Lourna insisted that one aspect of the plan had changed, but they should procede as planned as they had met their objective. She began to threaten the others by saying if any of them should go down for the death of Asgar, they would all go down for it. However, Pan smoothed the tensions by insisting none of the Runners would go down, and agreed with Lourna to procede as planned thenceforth. Pan said they would allow Marchion to mourn his father and then tell him how the Nihil would work from then on, which would be reducing the Eye's cut of loot from one-third. However, at that moment, Marchion joined the Tempest Runners and cut Pan off. Pan told the younger Ro he was sorry for his loss, as Asgar had given them so much. Marchion reacted icily, saying the Paths had not been given by Asgar but rather by their family. Unknown to the Tempest Runners, the Paths had come from the Force-sensitive navigator Mari San Tekka.\nMarchion, holding Asgar's helmet, told the Tempest Runners that his father was only a link in a chain; a chain that led to him. The younger Ro told the Runners to never refer to him by his first name again and proceded to the podium. Marchion refered to his father as \"dead wood\" to dispose of. Ro addressed the crowd to honor his father, telling the assembled Nihil that Asgar knew his time had come. Marchion spoke of renewal and endurance for the Nihil, claiming his \"birthright\" as the Eye of the Storm. Together, the would ride the Storm; Ro said, calling the Tempest Runners \"his.\" The crowd began to chant \"Ro\" in support of Marchion, beginning his consolidation of power. Lourna understated, saying there could be a slight possibility that the Tempest Runners had miscalculated in their coup against Ro. Additionally, Marchion came to suspect one of the Tempest Runners had been the one to kill his father.\nIn approximately 236 BBY, Lourna Dee raised the thirteen-year-old Sylvestri Yarrow, daughter of the fugitive hyperspace physicist and Nihil affiliate Chancey Yarrow, for a year. Dee, whom Sylvestri called \"auntie Lourna,\" taught the girl how to fight. During that time, Sylvestri was often injured by Dee, including being knocked unconscious, breaking her arm twice, and possibly breaking her jaw several times. However, Yarrow learned to defend herself in tough situations during her time with Lourna. Sylvestri was unaware that her auntie Lourna was in fact Lourna Dee, Tempest Runner of the Nihil, at the time. Dee told Sylvestri that no one would pull their punches with her in life and that she was lucky to be alive. The girl understood that life as a cargo hauler was dangerous, and believed that was the only reason she was being taught so much about self-defense and security.\nAround 232 BBY, when Dee was about forty years old, hers and Milliko's Tempests helped Eyta's in a raid on Ab Dalis soon after the Great Hyperspace Disaster, and were successful for the most part. A celebration was hosted by Eyta at the Great Hall in No-Space. Zagyar, a Storm of hers who partially ruined the raid, was questioned with Dee's permission but it is unknown if he punished for this. The Eye of the Nihil, Marchion Ro, called for a meeting between him and the Runners. Ro explained that usage of the Paths would be restricted until the heat died down after the Disaster. The Runners reluctantly agreed except for Dee, who convinced Ro to give her one Path for a quick and easy raid on Elphrona, with the goal of kidnapping the Blythe family of Alderaan and ransoming the off to their wealthy relatives.\nKassav Milliko had attempted to extort Eriadu Governor Mural Veen for credits and would in exchange save Eriadu's inhabited moon from the Emergences, but failed to hold up his end of the bargain. The moon was destroyed and the ire from Eriadu and the Galactic Republic made extreme public outcry and attention fall on the Nihil. The Runners and the Eye met at the Great Hall where Ro, in a display of domInunce, brutalized Milliko and made the Runners fall in line. Dee was ordered to continue her raid and get the flight recorder of the Legacy Run.\nLourna Dee had a brief run in with Republic forces while trying to capture the flight recorder of the Legacy Run. She managed to escape and eventually even captured Jedi Master Loden Greatstorm and Ottoh Blythe after the raid began to fail and the other Blythes were left behind. She brought them to Ro's ship, the Gaze Electric, where Ro revealed he only allowed the raid to happen because he knew he would manage to capture a Jedi as they tried to save the Blythes. Dee became terrified when Ro explained this as he practiced with his new weapon, Loden Greatstorm's lightsaber, and pointed it at her face. He also revealed that the reason Milliko and his Tempest was destroyed is because he sabotaged the entire Tempest's Path engines which caused them to collide with the Republic forces. She was subsequently intimidated into secrecy by Ro.\nA short time later, Ro convened the remaining Nihil in the Great Hall where he showed footage of the battle of Kur that presented Milliko and his Tempest as martyrs of the Nihil way of life who opposed the restrictions of the Republic zealously until the end. Ro convinced the gathered warriors that, with a unified front under his leadership, the Nihil could resist the Republic and the Jedi. Ro removed his mask, exposing his face to the crowd, an action that was mimicked by everyone gathered except Dee and Pan Eyta.\nThe Eye quietly ordered the two Tempest Runners to also remove their masks, which they reluctantly did. Ro changed the footage of Kur into a star map as bowls filled with liquid were sent around the hall that each raider applied to their faces as a symbol of the lost Tempest's spilt blood. The Eye of the Nihil then announced that they would begin galaxy-wide operations and crush the Galactic Republic for opposing them.\nLourna Dee participated in the attack on Valo, the Nihil's attack on the Republic Fair held on the Outer Rim planet Valo. There, she dueled Ugor Jedi archivist OrbaLin, who bored her with lectures on Jedi artifacts during their fight.\nIn the aftermath of the attack on Valo, the Republic came to believe Dee was the Eye of the Nihil. Dee fought at the Battle of Galov, ordered by Marchion Ro to take Relay Post Epsilon One. After Jedi and Republic forces showed up, hoping to capture Dee due to her perceived rank in the Nihil, and Ro refused to send backup, Dee realized the Nihil would be unable to take the station. So she fired turbolasers from her cruiser the Lourna Dee at the station, and later sent Salvage droids to the station to complete its destruction. When it became clear that there was no hope for the cruiser to survive the battle, Dee promoted Andrik Keller, who had helped her on the bridge of the cruiser during the battle, to the rank of Storm. She then sent him and Cathar Storm Tasia out of the bridge and told them to escape, but told them that she was staying. However, she instead devised a plan to fake her death. She dressed the droid H7-09 in her mask and armor, so that when Jedi Nib Assek and Padawan Burryaga Agaburry arrived with some of Firebird Squadron and its Skyhawk pilots, they would believe it was her. The droid was rigged to explode, and did after Skyhawk pilot Jano Brayson shot it, successfully faking Dee's death.\nLater, while attempting to escape the Lourna Dee, Dee charged up behind Trandoshan Jedi Master Sskeer, who was attempting to subdue Andrick Keller, who was attempting to reach escape pods on the other side of a collapsed hallway. She was wearing no armor and no mask, having put them on H7-09, and so Sskeer did not realize that she was Lourna Dee. She attacked him, hitting him with a vibro-ax and drawing blood, prompting Sskeer to push her back into the wall with the force. However, she retaliated by throwing a flash grenade at him, knocking him down. Lourna pushed Keller through the gap in the collapsed hallway that he was stuck in. Keller believed that Dee was trying to help him, but she was really only trying to push him through so that she could reach the escape pods and escape. Once he was through, she ordered him to prime an escape pod so they could both escape. But before Dee could get through, Sskeer pulled Dee out through the wreckage, and knocked her to the ground, therefore incapacitating her. Sskeer held his lightsaber towards her and ordered her to stay down as Jedi Knight Keeve Trennis arrived to the scene. Dee was defeated, and she would be taken to Starlight Beacon, to be arrested and treated for her injuries, but the Jedi and Republic still had no idea of her true identity. At the end of the battle, Dee's cruiser the Lourna Dee was destroyed.\nDee was taken aboard the Starlight Beacon along with Tasia. They were sent to one of the Station's medical bays and kept there with many other Nihil. There, Skyhawk pilot Brayson, who believed he had shot Dee  confronted Tasia and expressed that he wanted to kill all of the Nihil in the room as revenge for his friend Teff's death in the explosion set off by the Lourna Dee decoy. He threatened to kill an unconscious Dee so that Tasia would see her friend die too. Tasia told him to stop, but when he refused, she attacked him, and he fought back, hurting her and telling her she deserved it for what the Nihil had done to the galaxy. Dee awoke to the fighting and hit Brayson with her ventilator, knocking him out. Assek, Agaburry, and Trennis, who had realized Brayson's plan to kill the Nihil, broke through the glass door to the medbay, and after seeing the scene, Trennis told Assek that Dee had been the one who had attacked Sskeer.\nHowever, they still did not know that she was Lourna Dee. Now without a ventilator, Dee started to pass out. Assek steadied her and sent Trennis to get the doctor while she and Agaburry watched over Dee and Tasia. After Dee was settled again, Assek asked her what her name was. Dee told her that her name was Sal Croft. Later, Dee was questioned by the space station's Chief of Security Ghal Tarpfen. Dee recounted some details of her childhood and early life to the Mon Calamari security chief. Tarpfen sentenced Dee to ten years aboard the correctional vessel Restitution as part of the Republic's Prisoner rehabilitation program.\nDee was brought aboard the Restitution alongside Tasia and her Cloud Quin, a Bivall slicer who had never met Dee personally. The women heard an orientation speech from Councilors Jon Wittick and Fry, explaining that the prisoners would be trained in medicine, construction, and engineering and perform labor for three credits a day. Tasia and Quin expressed a willingness to become romantically involved with Wittick, as a \"man in uniform,\" if it would benefit their position while aboard. Lourna reacted with aversion to the thought.\nDee was housed in K block and designated \"Prisoner 134.\" She shared a cell with Tasia, and Quin was held nearby. Tasia knew of \"Sal Krost\"'s true identity as Lourna Dee and blackmailed Dee into serving her and Quin under threat of telling the other prisoners and guard, who would surely seek retribution against the notorious Tempest Runner. As insurance, Tasia told Quin of Dee's identity and arranged for the survivor to immediately spread the word if anything happened to either Tasia or Quin. Nevertheless, Dee bonded with fellow Twi'lek Sestin Blin, with whom she shared stories of her time as a slave of the Zygerrians and the aftermath.\nThe Ottegan criminal Ola Hest had strong influence on the Restitution, having bribed many guards and effectively becoming a boss among the inmates. Hest had as henchwomen an Aqualish named Parr and a Gloovan named Muglan. Not long after Dee was admitted to the ship; Hest, Parr, and Muglan cornered Tasia in the commissary, believing the Cathar had stolen Hest's illicit comlink. Unbeknownst to Dee, Tasia had indeed stolen it and used it to contact Pan Eyta, who sought revenge on the Twi'lek for betraying him by leading him to the Battle of Cyclor.\nLourna reluctantly defended Tasia from the attackers by claiming to have stolen and destroyed Hest's comlink herself and starting a fight. Eventually, the alarm was sounded and guards were called, leading to Lourna being put in the sickbay with Councilor Wittick. Dee shared her disenchantment with the Republic and the Restitution with Wittick. Wittick scolded Dee for fighting, but commended her for defending her friend when no one else would. Dee then recalled her time at the academy on Carida.\nLeela from block D sang the song \"Shrii ka rai ka rai\" for two days straight, annoying the bedridden Lourna while she remained in the sickbay, when Sestin was assigned sickbay duty. Sestin told Dee that she would be heading back to block K that day, as she was nearly recovered. Lourna was unhappy because Wittick had told her not to fight with Muglan anymore. Sestin insinuated that Wittick was romantically interested in Dee and warned her to be cautious. Sestin explained that Wittick was not \"in Hest's pocket,\" and that if Hest believed Dee was in bed with a guard she had not bribed, Dee would be subject to reprisals.\nAfter Dee's return to K block, Sestin informed the Tempest Runner that the Restitution would be making a planet drop soon. While planetside for work stops, prisoners would earn 5 credits a day instead of 3. Lourna asked Sestin where they would be going, but was told that prisoners were never even told what star system they would stop in as a safety precaution. Lourna told her friend she wished to hole up in her cell so not to draw attention to herself, and Sestin responded with joy that her friend was learning. As Dee approached her cell, she was again confronted by Muglan and Hest. Hest asserted that Dee's supposed destruction of the Oteggan's property was forgiven and forgotten, insisting Dee had learned her lesson. Ola referred to Lourna as a \"worm head.\" Lourna commanded Hest not to call her that, and Hest apologized for the remark, saying she hated to be disrespectful.\nSoon thereafter, Lourna returned to her cell where Tasia and Quin were playing a card game. The Twi'lek threatened to kill each of them before asking whether Tasia had in fact stolen Hest's comlink. Tasia replied equivocally, referring to Lourna by her name rather than \"Sal\" and stating Dee had \"done her job.\" Tasia said she would have loved to visit Dee in the sickbay but she could not acquire a pass. Lourna replied by pointing out that the Cathar could have used her new accord with Ola to gain visitor access, at which point Quin interjected that Lourna was a hypocrite because of the allegations that Lourna became involved with \"handsome Councilor Wittick.\" Tasia laughed, expressing that she had wondered who would first \"sink their teeth\" into the Councilor but had never expected Lourna to do so. At that time, Wittick summoned all prisoners from K block to the common area to announce their first work stop.\nCouncilor Fry explained that the Restitution would stop at a forested planet, Arbra, where pirates had recently attacked and burned the main settlement. Three parties of prisoners were to build prefabricated shelters the Republic had provided to assist in rebuilding efforts, while the rest would clear the remaining buildings and the local logging station. Tasia asked why droids were not assigned to the reconstruction, to which Wittick explained that droids frequently break down and further, a workforce \"dedicated to repaying their debts to society\" would finish twice as fast. As Wittick and Fry gave orders, Quin and Tasia made sly insinuations about Wittick attending to \"Sal\"  personally. The Councilors then dismissed the prisoners back to their cells, when Ola Hest objected that lockdown was not for another hour. Wittick repeated that meant \"everyone,\" to which Ola insisted that Dee get \"her man\" under control. Dee insisted Wittick was not her \"anything\" before being summoned by the Councilor to talk one-on-one. Wittick warned the Twi'lek that aboard the Restitution, rumors had a way of turning nasty for everyone involved.\nUpon the planet, Sestin expressed her love of planetary visits and experiencing nature. Ola interjected that people had to take what they could get in life, unknowingly echoing the Nihil slogan of taking what one wanted and burning what one didn't. Dee asked Ola sarcastically whether the Ottegan would known all about taking what she could get. Ola asked Sestin what she would do once released from prison, and Sestin replied that she'd be happy to no longer have to watch out for Lourna \"Sal.\" After Ola and her entourage departed, Sestin showed Dee a hologram of her sons Ita and Silus when they were children. She told Lourna how she longed to hug her children if they wanted to see her.\nLourna and Sestin caught up to Tasia, who pointed out signature lightning bolts burnt into a tree trunk signifying the raid had been conducted by the Nihil. Wittick explained that the work party would be on the planet for 5 days and would sleep aboard the Restitution. Tasia, who had conducted similar raids with Lourna, whispered \"ride the storm\" to Dee. Wittick then introduced the prisoners to the local Republic emissary: Lalutin, the senior cadet Lourna had nearly killed with a servo spanner before escaping from Carida. Lalutin briefed the prisoners, telling them the settlers on Arbra had had their lives turned upside down by \"scum,\" leading Tasia to wonder aloud how he would react if he learned such Nihil \"scum\" were among his prison labor force. Dee replied that the Administrator knew well of their presence. Lalutin continued, saying he resented having to rely on prison labor for this reconstruction effort. However, Supreme Chancellor Lina Soh insisted the Prisoner Rehabilitation Program was the first in a long list of reforms to the Republic's Carceral System; demonstrating beyond doubt that \"we are all one Republic.\" Lalutin then threatened the prisoners if they should cause any trouble to the settlers on Arbra. Regretting her circumstance of meeting Lalutin once again, Dee murmured aloud \"I knew I should've hit him harder.\"\nAfter some time working with load lifters to clear the logging station, Dee became angry that Ola Hest and her crew were given much better power rigs. Sestin then insisted that Hest was a \"special case,\" explaining Hest's history: Ola had killed more people than most had ever met. Sestin implored Lourna to stay out of Hest's way as she was dangerous. Lourna retorted \"maybe I am too,\" though Sestin expressed doubt that her friend was a murderer. Hest had once massacred a children's hospital on Novor run by the Sisters of the Ninth Plane for refusing the Hutt Clan's racketeering demands before being tracked down by the \"Blade of Bardotta\" Porter Engle. Lourna said she had survived worse than having a building dropped on her but refused to explain. Sestin expressed frustration at the \"walls\" Lourna was putting up, telling Lourna she could tell when someone was hurting. Lourna, lying, said the only reason she was hurting was the pain from working with the faulty load lifter. Sestin reacted by calling Dee out on her nonstop dishonesty and equivocation. Dee, frustrated, asked why Sestin continued to talk to her, to which her friend replied that if she did not speak with Lourna, no-one else would. Sestin then analyzed Dee's behaviors as purposely alienating anyone who wished to help her. At that point, the load lifter fell on Lourna's leg similarly to how a blurrg had in her youth. Sestin called for help from Wittick and Lalutin, but Lourna implored her friend not to call the Selkath for help. Sestin left the area to fetch others because there was no comm reception at the logging station.\nJust after Sestin left, Lalutin appeared. The Selkath remembered Dee clearly from their time at the academy, telling her he had thought about little else than her attack on him for years. He stood by idly expressing his desire for retribution as Lourna was crushed under the machine. Lalutin, who had known Lourna as \"Inun,\" talked to Wittick about her. The Selkath administrator revealed he knew Lourna's true identity, pulling up a holo wanted poster showing a five-thousand credit reward for information that would lead to her capture. Lalutin recognized Dee even under her mask, remembering her head tails vividly. Lalutin said he would only have to call Starlight Beacon to inform them of Lourna's location and then he could have any job he wanted. He tried to call Starlight Beacon, but the reception was poor and the Beacon asked him to repeat his message. In the meanwhile, Dee tried to cut a deal with Lalutin until the Selkath was shot by Tasia. Tasia remarked snidely that Lourna had a penchant for making enemies.\nLourna told the Cathar that she could barely breathe. At that moment, Pan Eyta appeared and commented that he could hardly breathe either. He said he had been looking forward to his revenge against her. Tasia revealed that she had been an agent for the Dowutin Tempest Runner since they came aboard the Restitution several weeks ago and promised to lead him to Lourna. Tasia implied that she killed Sestin, angering Lourna at the death of her friend. Lourna denounced Tasia for the murder, calling Sestin a \"good person,\" to which Tasia retorted by asking if that was why she ended up imprisoned. Tasia attempted to call Marchion Ro on an old Nihil frequency, which Pan picked up whilst already hunting Dee.\nPan wished to kill Dee, who was still being crushed under the load lifter. However, he believed they had time to converse, and the pair reminisced over the circumstances under which they met. They reflected on the raids in the Abrion sector and on Aaloth, when Lourna first joined the Nihil and finally got revenge on Bala. Lourna stopped breathing, sending Pan into a fit of rage as he wanted to kill her himself. Tasia, bemused, thought the point was for Dee to die, but Eyta got angry and choked the Cathar nearly to death. The Dowutin furiously tossed machinery around and mused on how he wanted to deliver Lourna Dee to Marchion Ro himself, see the fear in the Eye's eyes and slit his throat. Pan said over comm to his underlings that he had once believed he and Lourna would rule the galaxy together, before the \"upstart\" Ro interfered.\nPan believed Lourna dead, and carried her limp body towards an extraction point he arranged with an underling. He told his underlying she was dead when Lourna attacked him and commented on the similar way she killed his Colicoid Storm Jinix when they first met. She then destroyed his comlink and attacked his ventilator. As Dee taunted Eyta, his Tempest arrived overhead. Pan then counterattacked Dee, saying it felt \"right\" for the two of them to die together. As Eyta put it, perhaps they would haunt Marchion Ro together.\nSestin appeared at the downed load lifter having awoken from unconsciousness resulting from a blunt strike on her head by Tasia. Sestin told her friend she couldn't find Wittick, then inquired about the presence of a Dowutin at her feet. Dee asked Sestin, who by now drove a power lifter of her own, to push Eyta into the logging pit. Sestin complied, though she mused that it would likely add time to her prison sentence.\nLourna awoke to Councilor Wittick looking over her in the Restitution's sickbay. She was questioned by Wittick and a cam droid about what had happened, including the death of Administrator Lalutin at Eyta's hands. Dee lied, saying she believed Lalutin was going to find help when he was shot in the back by Pan Eyta. When asked the whereabouts of \"Prisoner 135\" , Dee lied again, saying Tasia had tried to stop the Dowutin from killing her. Tasia had not died from Eyta's chokehold, but was in a coma and might not make it. Wittick informed Dee that Tasia might be transferred to Starlight Beacon for medical care, and Eyta's body had gone missing. The Nihil raiders Lourna had heard overhead had killed eight prisoners and three more had gone missing.\nThe Restitution was on its way to its next work stop. Lourna, who had been treated with synthskin, was to return to K block. Lourna asked if the three escaped prisoners were Ola Hest and her cohort, but Wittick assured her the security droids had stopped their escape attempt. Councilor Fry believed Hest and her cohort orchestrated the raider attack, perhaps to escape. Dee lied that the raiders were not Nihil, and further denied that Eyta had singled her out. Wittick told Dee he could sense something amiss about her, and that in his experience, prisoners were often kept imprisoned more by their own thoughts and secrets than the cells and walls of the physical correctional vessel. Lourna confessed that, for the first time in her life, she had welcomed death in the forest clearing at the logging site. Wittick offered to connect Dee to a whole wing of therapists who could help her if she felt suicidal.\nWittick told her she could trust him and tell him the truth, assuring her that the recorder was off and no-one was listening. Lourna expressed doubt that he would help her if he knew her past, but Wittick said that cut both ways. Wittick believed in Chancellor Lina Soh's Great Works, but had come to doubt that things were getting better. Wittick told Dee he was going to attend the Republic Fair on Valo to see his sister and her kids. His nephew was so excited to see the Innovator, but now that was all gone. Dee told him it was because of people like her. Unbeknownst to the man Lourna's fellow prisoners thought she was involved with, she had led the terrorist attack on Valo that claimed hundreds of thousands of lives. Wittick knew the Nihil had attacked the Valo Republic Fair, but felt he had to believe in redemption for the Nihil prisoners.\nDee expressed disdain at the bevy of individuals around her who believed in hope and redemption, as she did not believe herself capable of it. First Ghal Tarpfen, then Sestin, and now Wittick; each wanted to believe in people. Lourna denied that she was the person for people to put their trust in, but her purported boyfriend insisted that she could be. The Councilor pointed to Lourna's self-sacrifice taking the blame for something she had not done to save Sestin. Dee said Sestin was worth it as she was \"one of the few people—\" when Wittick cut her off to suggest Dee meant one of few people she could trust. Lourna said she would not go that far, as she never trusted anyone. Wittick drew a connection between Lourna's trust issues and her inability to look others in the eye. Dee demurred, referring to her habit of wearing a mask. Wittick let on that he knew Sal was not her true name. Under pressure from Wittick and amid flashbacks from her past, Lourna confessed her identity as the nefarious Tempest Runner Lourna Dee and her need for Wittick's help.\nAfter trusting Wittick enough to confess her true identity, Lourna continued to act abrasively. Wittick called her into his office to talk about her bad attitude, pointing out he had \"put his neck on the line\" for her and that she had not been marched off the ship by Jedi. Dee asked Wittick whether he was risking himself for her to establish a power dynamic whereby the guard would sexually exploit her as a prisoner. Wittick bristled at the notion, adamantly insisting that he merely sought to provide her a new start. He easily could have handed Dee over to the Jedi when she confessed to being the supposed Eye of the Nihil Lourna Dee, but he believed in her ability to change for the better. Lourna had told the councilor the Nihil were finished, so he did not believe providing her to Jedi custody would solve anything. Governments and people she had wronged would want vengeance on Dee, as Wittick put it.\nDee suggested the people she had wronged deserved retribution on her, but Wittick responded that such punitive measures would not restore the harm she caused. However, Wittick told Lourna that her eager work to restore the damage she inflicted on the galaxy was worth to him than anything. Dee quipped, asking whether her redemption was worth more to the Councilor than justice. Wittick confessed that he saw Dee as his \"last chance\" to see someone make a true change in their life, untainted by who they used to be. Lourna asked Councilor what would happen if she failed to live up to his optimism, when a droid interrupted their conversation to inform them the prisoners' work cycle had ended. Dee told Wittick how she had been forced to reinvent herself in a new life many times in order to survive, always because of someone else's expectations or demands. She wanted to believe the man that she could change and be who she wanted unencumbered by her past, but experience weighed against her belief that she could do so.\nAfter a long day repairing machines, Dee encountered Sestin in the commissary. Sestin told Lourna that, despite the assurance that Tasia would be transferred to Starlight Beacon, the Cathar remained in the Restitution's sickbay. The prisoners had one hour of free time before lockdown, in which they could spend their credits on entertainment such as holodramas, and Sestin invited her friend to watch a holo with her. Dee declined, saying she had some thinking to do back in her cell. Ola Hest appeared, attempting to intimidate Lourna to not return to K block and suggesting Dee see a holo with Sestin. Dee pushed past the Ottegan and sped back to the cell block, where she saw Parr and Muglan cornering a panicked Quin at Ola's orders. Hest's enforcers reasoned that Lourna had allegedly stolen from Hest and then \"buddied up\" to them, and Quin had also \"buddied up to them\". Therefore, in their reasoning, Quin may have slighted the entourage despite her apparent innocuousness. Dee attacked Parr and Muglan, breaking the Aqualish's cheek and telling her that no-one could understand her and no-one would care even if they could. Muglan charged Lourna, who responded by injuring the Gluvan and sending her to the sickbay.\nCouncilor Wittick later scolded Dee for intervening in the quarrel. Lourna compared herself to a Jedi in response, pointing out that she had merely defended a friend and had used the minimal force required. Furthermore, Dee had earned everyone's respect—even Hest and her \"dogs\" would not file reports against Dee. Lourna reasoned that she had established herself as a new alpha among the prisoners, eroding Ola's power and influence on the prison ship. The Twi'lek compared the Ottegan boss to a Karkarodon who had lost its teeth, to which the Councilor reminded Dee that Karkarodons' teeth regenerate.\nThe Councilor began to cough and his skin grew pale. Dee told him he was as white as a Gigoran, looking extremely tired. Wittick insisted that watching Dee was a full-time job. Lourna offered to give the man a second chance of his own, acting as an enforcer to make the other inmates fall in line. Dee said they could affect real change together at the \"grassroots\" level without having to wait for the Senate to pass new legislation. Wittick warned Lourna of potential consequences of that course of action, to which she insisted she was well aware. She had made that mistake before, recounting to the guard her experiences as a Tempest Runner.\nThe Restitution visited a communications relay station, where prisoners would be allowed to talk with family members. Quin wanted to talk to Lourna, but she did not. Lourna said she was tired, and Ola Hest mocked her by suggesting her fatigue was due to a long day spent with her handsome guard, Wittick. Hest suggested that, if Dee would not \"cuddle up to\" Wittick, then Sestin would; evoking Sestin's desire make peace and prevent anyone from getting hurt as a reason she would do what \"needed to be done.\" Quin again asked to come into Lourna's cell to thank her for saving her. The Bivall prisoner acknowledged that the two had an acrimonious relationship when they first met.\nQuin had believed that Tasia and Ola would protect her aboard the prison vessel, and went along with them out of peer pressure and fear. Quin whispered to Lourna that it was not easy to admit being scared to her Tempest Runner. Dee replied that there was nothing wrong with being scared, and she was no longer Quin's Tempest Runner. Quin confessed that Tasia had not told her that she had contacted Pan Eyta, and that she doubted the Cathar would have taken her along in her planned escape. The Bivall told the Twi'lek that the inmates who had belonged to Eyta's Tempest believed the Jedi had killed him aboard the Elegencia at Cyclor. They were thus unaware the Dowutin who had attacked \"Sal\" on Arbra was their Tempest Runner.\nQuin had heard Eyta's former personnel talking about Pan and Lourna. One Siniteen had worked under Pan and attended the revel at the Great Hall of the Nihil when Lourna was made a Tempest Runner. Quin told Lourna that Siniteen had said that if Lourna Dee were still alive, then the Storm would never have burnt out and they would not be in prison. Lourna found the Siniteen's faith in her ironic, despite having expected the prisoner to want to kill her. Quin departed Lourna's cell when she found Sestin's holoprojector of her children Ita and Silas. Quin, who believed them to be Lourna's offspring, reacted with \"aww,\" but Dee became quite worried because Sestin never allowed the projector out of her sight. From that, Lourna pieced together the action Sestin would be taking as hinted in Hest's threat—Hest had blackmailed Sestin by taking her children hostage, and sought to force Sestin to kill Tasia.\nLourna ran to the commissary, where Councilor Fry would not let her enter the sickbay as she was not sick. Dee appealed to Fry to summon Wittick who would listen and understand. Fry refused, saying that both she and Governor Arman wished to make an example of \"Sal Krost.\" Quin caught up to Lourna, offering to deal the Twi'lek into a game of klikklak. Lourna asked the Bivall to create a diversion for her, in which Dee would purportedly return to her cell to fetch her sabacc deck and Quin would run after her two minutes later. Lourna injured herself so she could be granted access to the medcenter, asking Quin to get her some help.\nSestin, who was skilled at both repairing and sabotaging droids, deactivated a security droid that tried to prevent her access to a restricted area. Once inside, Sestin tried to stab the still-comatose Tasia with a scalpel. Lourna confronted her friend, offering to get the other Twi'lek help to protect her children from Hest's network of bounty hunters and assassins. Ola Hest had threatened to harm Ita and Silus if Sestin talked with anyone or sought help. Lourna tried to mollify her friend by reminding Sestin that her release was scheduled for only a few weeks in the future, at which point she could see her sons. Setin replied frantically that she would not have a chance to see them if they were dead. Lourna disarmed Sestin, knocking the scalpel to the ground and then taking it. Dee was adamant that Sestin would not want Tasia's blood on her hands, but then killed Tasia with the scalpel Sestin had wielded only moments prior. Alarms sounded, and security droids and guards came to deal with the intruders.\nLourna made clear she was dropping the scalpel of her own volition, rendering her unarmed. Wittick rushed in, calling Lourna by her name \"Lourna,\" confusing Sestin who had only known her friend as \"Sal.\" Sestin asked who Lourna was, while Dee told the Councilor that Ola had coerced her into killing Tasia. Dee explained that the Ottegan had threatened the family of her friend, Sestin Blinn. In so doing, Hest was targeting those closest to Lourna to take revenge on Louna. Dee then told Wittick that Hest had an entire network spreading out from the Restitution like a glitterstim web. Lourna lied that Sestin had tried to stop her from killing Tasia. Wittick asked why Lourna had not come to him for help, to which she replied that this was \"the only way\" and that this is who she was and had always been, calling Wittick by his first name \"John.\"\nLourna was placed in confinement. Sestin struggled to reconcile her friend Sal with the Nihil Tempest Runner Lourna Dee, discussing the recent events with Quin. Quin commented that, with Hest in isolation and Muglan and Parr in the sick bay, and Wittick relieved of duty, it was unclear who was in charge in the prison. Sestin reminded the Bivall not to say that in front of Councilor Fry, who remained in power. Quin reassured Sestin, reminding the Twi'lek that she had done nothing wrong. Lourna had killed Tasia, not Sestin. Sestin asked Quin whether Lourna and Tasia had known each-other for long, to which Quin replied \"long enough.\" Sestin had thought her friend Sal had been a \"grunt\" within the Nihil, only now coming to terms with the fact that Lourna had served as one of the Nihil's three leaders. She struggled to come to terms with Lourna's involvement in planning the destructive acts of the Nihil, including the attack on Valo and the Hyperspace Disaster. Quin told Sestin that, as a Cloud, she did not know as such information was above her grade.\nLourna Dee sat alone, confined in an isolation cube. Ola Hest, locked up in the isolation cube right next to her, knocked on her door, calling her \"Lourna\" and taunting her that everyone knew her secret identity and location. Hest goaded Dee, saying the Jedi would arrive soon and be furious. Dee replied that the Jedi did not \"do\" furious. Ola then told Lourna that Wittick had been removed from his duties and would no longer be able to protect her. Dee, angry, yelled that the Ottegan got what she wanted: Tasia was dead. Furthermore, the Republic took Sestin's sons into protective custody, making them safe from Hest's web of agents. Hest said that it was she who was untouchable when a klaxon blared, urging all prisoners to their cells.\nThe Restitution came under attack, with laserfire audible from space outside the ship. Lourna asked whether Ola Hest had ordered the attack, which the Ottegan vociferously denied. Lourna realized Pan Eyta had survived and chased the Restitution down to finish his vengeance against her. Dee and Hest asked the security droid guarding their cells what was going on. The droid refused to answer, saying that was privileged information. Lourna warned the droid that the person attacking the ship would not stop until he located her, and would eagerly kill everyone in his way. Dee asked the droid if there was a ship clamping onto the Restitution's hull. Lourna pointed out the sound of someone cutting through the hull to prepare for boarding. The droid refused to let the women out of their cubes, but agreed to warn the Governor that Pan Eyta was attacking and to broadcast a distress signal. Unfortunately, internal communications were overloaded and soon to be jammed, so the droid had to alert the Governor itself.\nCoucilor Hazeltoe on L block called Councilor Fry to inform her the Governor had sent them to check deck 7. Security droids formed a defensive perimeter as the Nihil breached the Restitution's hull and came aboard, releasing war cloud gas and shooting people and droids. Fry's comms went down and Sestin volunteered Quin's talents as a slicer to help with comms. At that moment, cell doors were opened, leading to a prison riot. In the meantime, Lourna aand Ola were also released from their solitary confinement and found the nearby computer down. Lourna murmured aloud that she needed to find an escape pod and hope Eyta's people would not find her. Hest expressed doubt at Lourna's willingness to abandon Sestin to the marauders, pointing out the close friendship the two Twi'leks had developed aboard the Restitution. Hest attacked Lourna, trying to knock her unconsciousness to make it easier for Eyta to find her. Ola tried to choke Lourna, believing Eyta would either give her a ride or that she could steal the Dowutin's ship.\nWittick appeared with a stun weapon, disabling the Ottegan while Lourna bit her with her sharpened teeth. He came with a rebreather for Lourna to protect her from the war cloud. The pair rushed to K block, as Lourna feared Sestin would not survive in a riot. Wittick ordered Fry to drop her stun baton, but the Councilor refused to comply. Dee then disarmed Fry and Quin took the baton, giving it to Dee. Wittick ordered the Tempest Runner to drop the weapon, but she also refused. Dee marshalled the crowd to rally behind her, pointing out that Eyta's crew would kill everyone aboard without distinguishing between guard or prisoner. Dee asked Wittick to arm the crowd as the Restitution had become a battleground. Fry asked if the prisoners would simply hand the blasters back once it was all over, to which Dee replied \"one step at a time.\" Dee gave Quin Fry's baton back, commanding her Cloud to only use it on the attackers. As such, Lourna united the prisoners and guards under her command.\nDee asked for a respirator for Sestin, but she insisted Wittick keep his as he was armed with a blaster and would need to breathe. The group approached an armory where scav droids were salvaging and stealing the weapons. Wittick prepared to shoot the scav droids when they heard a Reeman Nihil walking by, telling Pan Eyta over comm that the droids had cleared the armory. One of the prisoners, a former Nihil, attempted to defect and join the Reeman, but he shot her. Wittick shot the Reeman, but alerted the droids to the prisoners' and guards' location in doing so. Wittick told the others to fall back so he could protect them, but Dee told him they needed him with them and he could never destroy all the droids on his own. The Tempest Runner led her squad down a level to the workshops where the load lifters lied.\nThe group descended the stairs while Wittick reported they had lost half their people. Quin tried to force a door open while a scav droid grabbed hold of some of the group. Quin then returned the baton to Fry, who dropped it as she could not see in the war cloud. A scav droid took hold of Fry, dismembering her arm, and Wittick's blaster ran out of charge. Dee then engaged a scav droid in combat, buying the others time to go through the door. Wittick took the droid out with a strong swing of his blaster rifle, commenting that he batted for the phaseball team back at the academy.\nThe group then neared the workshop, but were now completely unarmed. As they entered, they encountered Ola Hest and Muglan. Wittick assured everyone in, pointing out they did not have time to fight each-other while scav droids pierced their way through the previous door. Hest tossed Sestin a hammer which she used to force the door closed. Fry passed out due to blood loss, when Quin and Lourna noted the droids had already ransacked the workshop for weapons. Wittick asked for a plasma torch to cauterize Fry's wound. Lourna Dee asked the Gloovan to help her move shelves, which would not stop the scav droids but might slow them down. Behind the shelves was an access shaft, which the group used to escape their droid pursuers.\nThe motley crew crawled through the hatch as Sestin coughed strenuously under the scarring effects of the war cloud. Councilor Fry gave up, believing she could not survive or get away. She revealed a major stomach injury inflicted by the scav droids. Fry promised to try to slow the droid onslaught, in exchange for Wittick promising not to let any of the attacking \"scum\" escape. The droids killed Fry as the cohort lumbered through the access shaft. They emerged into the commissary when a scav droid came close to penetrating the barrier they set on the hatch. Muglan smashed the hatch with a chair, sealing the shaft. Quin spliced into a droid's comm unit, commandeering a flock of scav droids to send them back to their ship. Hest took a blade from a smashed droid while Quin gave the group the code to enter the kitchen, which released even more war cloud gas into the ship.\nThe Governor sent a message in distress over the comm, telling Lourna to surrender and no-one else would be hurt. The Governor, held at blasterpoint, told anyone who could hear the message to send for help and call the Jedi. At that point, Pan Eyta killed him, taking over the announcement stream. Pan said the Governor had been stupid, and hopefully the same would not be true of Lourna. Pan announced that they had primed the ship to explode, and it would detonate in thirty minutes if she did not turn herself over to him. Eyta offered everyone else aboard to bring him Lourna Dee in exchange for their freedom, which he analogized to an early release. Hest tackled Lourna with the blade, meaning to take Lourna to Pan to ensure her survival. Wittick protested, saying he would not allow the Ottegan to turn Dee over to the Dowutin Tempest Runner, but Lourna agreed with Hest's course of action. As Lourna put it, Ola's plan was the only way to guarantee the others a chance at survival, as Dee's captivity at Eyta's hands would buy them time.\nOla Hest took Lourna Dee before Trilock, a Gormak agent of Pan Eyta's. The Gormak Nihil asked for confirmation the Twi'lek was in fact Lourna Dee, to which Hest threatened to kill Dee if any of the Nihil or scav droids present moved. One of the Nihil told Pan Eyta she could take Hest out, but the Dowutin insisted she not. Trilock warned Pan Eyta, who was in poor health, to stay aboard his ship, but Pan insisted on coming aboard the Restitution to see under Dee's mask for himself. Pan shot and killed Ola Hest, lumbering over to the Twi'lek to verify that she was indeed Lourna. Dee had used decoys in the past, and Eyta felt a need to confirm her identity. Lourna told Pan he did not have to kill the Ottegan. Eyta pointed out that Hest had had a knife to Dee's throat, which Dee specified was the plan. Trilock urged his boss to take Lourna aboard the Nihil ship and go.\nPan, frantically, demanded to know of Lourna's \"plan.\" In the meantime, Dee tried to erode Trilock's will to serve Eyta. Pan threatened to kill Lourna unless she told him what she meant by her \"plan,\" when Trilock and a female Nihil brandished their weapons towards Eyta to reinforce the Nihil's stipulated agreement to turn Dee over to the Republic in exchange for a reward or amnesty. The Dowutin again demanded to know Dee's plan, which she revealed was a plan to give the others of her squad time to arrive.\nWittick, Sestin, Quin, and Muglan arrived at the confrontation point. Wittick invoked the authority of the Republic Correctional Alliance to command the marauders to all drop their weapons. Sestin asked Lourna whether the Tempest Runner had everything under control, to which Dee replied that she did indeed for the first time in a long time. Quin commented that the Nihil had all the guns, but Muglan reassured the Bivall that all the guns were pointed at Pan Eyta. Trilock ordered Lourna's reinforcements to stay back as the Nihil mutinied against the Dowutin. Wittick taunted the Gormak that the Nihil could not shoot the guards and inmates while all blasters were pointed at Pan. Trilock sent the scav droids to attack Dee's reinforcements when Quin sliced into them, turning the droids on the Nihil.\nThe scav droids killed all of the Nihil except Pan, causing Wittick to bemoan that the droids were only supposed to incapacitate the attackers. Lourna told the Councilor that they looked pretty incapacitated to her, engaging Pan in combat and asking him how he thought his forces looked while disarming the Dowutin by knocking the blaster from his hands and taking it. She ordered Pan on his knees, and Eyta told her to \"finish it\" by killing him. Wittick ran over to the Twi'lek he had so hoped to redeem to stop her from pulling the trigger, appealing to her hope for change. Lourna told the Councilor that it was too late now, and there was no walking away from what she must do. Everyone would know who Lourna Dee was. Sestin told Lourna she already knew who Dee was: her friend, the woman who gave up her freedom so Sestin could see her sons. Lourna was Sal.\nAn apoplectic and degenerating Pan Eyta yelled in confusion, asserting that Lourna Dee was Lourna Dee and demanding she \"finish this\" by ending his life. Lourna replied that it was already finished and ordered Quin to deactivate the scav droids. Dee then gave the blaster to Wittick, telling the Councilor that the Dowutin was all his. The defeated Tempest Runner screamed in agony, yearning for Lourna to be his end rather than a Republic prison guard.\nAboard the flight deck, Councilor Wittick sent out a distress signal for anyone listening to come to the correctional vessel's assistance. No reply came in, and Quin informed Lourna that she was attempting to force the scav droids to repair the transmitters. Pan Eyta, still alive and now in stuncuffs, told Lourna that the Republic would not thank her for her deeds that day. Dee asked why they had not imprisoned Eyta in an isolation cube. However, the droids had not yet reactivated the cell controls so they could not lock him up. Sestin provided Wittick heart stims he had been taking for a terminal ailment, and Sestin told Lourna that Wittick had not visited the infirmary so frequently only to see her. The last few hours without the stims had been hard on the Councilor.\nQuin hacked the personnel records to verify the seriousness of Wittick's illness. The records said Wittick was due for medical discharge at the end of his next tour of duty, angering Lourna because the man had never mentioned that to her. Lourna then recognized why Wittick believed she was his last chance to do something good; coming to believe it had never been about her, just as it had never been about her in her past lives. Eyta laughed in her moment of recognition, as Dee compared Wittick and his \"noble words\" and aspirations to Bala Waleen, Oppo Rancisis, and Asgar Ro; all men who had manipulated her to their own ends. Wittick denied knowing what Lourna was talking about, while Eyta laughed in the irony that he did. Asgar had called Lourna \"his greatest work,\" and Lourna had fallen for it. She decried the trend in her life of changing herself and donning new identities at the wishes of others, always for someone else's gain. Eyta taunted the Twi'lek, calling her pathetic and asking if this was not all part of her plan to gain new friends and allies.\nIn that moment, Quin's commandeered droids repaired the internal and external comms arrays. Parr and Muglan signaled the flight deck from the exercise hall. The Gloovan reported to Wittick that they had gathered all the survivors. Few prisoners and no guards had survived the Nihil attack, save for Wittick. Most security droids had been taken offline. Quin opened external communications, where they heard the voice of Tempest Runner Zeetar on a Nihil code. Sestin asked whether the signal they heard was the Republic Defense Coalition .\nWittick asked who it was, to which Lourna initially replied that it was \"fate\" before changing her answer to \"an opportunity.\" Quin told Dee the assembled prisoners could see and hear her. She took the blaster from Wittick, telling the man that she was sorry she had ever entrusted it to him in the first place. Pan smiled, saying \"that's my girl.\" Dee then sent a live message to the survivors that Pan Eyta had betrayed all of them, executing the Dowutin in front of their eyes. Wittick tried to get Lourna to stop her violent streak, but she rebuffed him, saying no one was ever allowed to tell her what to do again. Sestin tried to tell her friend that this behavior was not who Lourna was, distressing Dee that her close friend would try to tell her who she was or was not. Lourna affirmed her self-determination, insisting that only she could decide who Lourna Dee was. Dee said she had so wanted Sestin to see her children, threatening the other Twi'lek woman.\nLourna Dee cocked her blaster, preparing for a shot. Wittick informed Lourna that there was only enough charge left in the blaster for one more shot, forcing Dee to choose the subject of her rage. Dee then gave an inspirational speech to the survivors, invoking Marchion Ro's speech at his father's funeral to speak of rebirth and renewal. She offered those aboard a chance to flee in shuttles and escape pods or to join her in a reborn Tempest of the Nihil, where they would ensure they would never be imprisoned again. Quin and many survivors in the exercise hall announced their intentions to join Dee. Wittick warned Lourna that the Republic would hunt her down if she went through with her plan, which the Twi'lek denied. Sestin burst into tears and Wittick implored Dee not to procede.\nLourna then shot and killed Wittick and sent Sestin in an escape pod with a distress beacon in the Darkknell systems. Sestin was eventually rescued by the RDC vessel Moonseeker and told the rescuers of the Nihil's attack on the Restitution. She begged the Defense Coalition personnel aboard to reunite her with her children. When asked the whereabouts of the prison ship, Sestin said she did not know, but her friend \"Sal\" had sent her aboard an escape pod. Sestin told her rescuers that Sal did not survive.\nTempest Runner Zeetar, who had been sending out an emergency message, picked up a holotransmission from Marchion Ro. The Talpini Tempest Runner was surprised to see Ro alive. Ro assured Zeetar that the Storm never dies, although the Talpini responded that the Storm was not what it had once been. Zeetar's dreadnought Technocrat had been lost to the Jedi, leaving Zeetar's Tempest with only nine ships. Ro ordered Zeetar to regroup at the Great Hall, where they would make their plans for the future. Each man believed Lourna Dee dead and her Tempest destroyed. Ro believed Lourna and her Tempest unnecessary, insisting he had something \"far more effective.\" At that moment, Dee joined the call, wishing to hear Marchion's plans. At that moment, the prison ship dropped out of hyperspace to join Zeetar's vessel. A Nihil informed the Talpini that the ship was registered as the Restitution.\nMuglan, now promoted to a Cloud in Lourna Dee's Tempest, offered to prime the correctional vessel's weaponry against Zeetar. To Ro's delight, Lourna refused to allow the Nihil to fire on one-another. Republic records said Lourna Dee had been lost, but she said she had merely been biding her time. Quin, now a Storm, presented Lourna a new and upgraded mask. Zeetar insisted that Dee could not be a Tempest Runner without a Tempest to command, but Lourna dismissed the remark by revealing her new, stronger Tempest of former inmates. She believed she now commanded more resources than either Zeetar or Ro, and they should discuss the matter aboard her ship. Ro asked if Lourna Dee meant the Restitution, to which Dee laughed and had Storm Quin reveal the ship's new name: the Lourna Dee. Lourna told Ro and Zeetar not to forget her new flagship's name, the Lourna Dee.\nLourna Dee along with her Tempest were considered to be the most sadistic and clever of the Nihil and, as a result, were feared by many of them. Dee did closely follow the rules the Nihil had such as granting permission for Pan Eyta to punish a Storm in her Tempest. Dee greatly admired intelligence and cleverness in her Tempest. She believed anyone intelligent and clever in her Tempest would advance far in the organization, as her Cloud Belial had. Lourna Dee also thought very highly herself given that she named multiple of her starships after herself and would harm anyone who asked her why. Despite her ferocity, Dee could be intimidated by those who displayed power over her.\nSince a young age, Lourna Dee had issues trusting people. Bala Waleen's betrayal on Aaloth stuck with her for life, causing her to be all the angrier when she learned that Wittick had visited the sick bay to treat a heart disease with stimulants rather than to see and rehabilitate her. She at one point tried to live under her brother's name, Inun, but was unable to continue the act out of the belief that he was better than she ever would be. After the attack on the Restitution, Lourna vowed to never allow anyone to tell her what to do again. She emerged with new confidence in her identity as the feared Tempest Runner Lourna Dee, imbued with self-determination and tenacity.\nThroughout her life, Lourna Dee always had issues following the chain of command. She loved her family on Aaloth, despite constantly finding herself on opposite sides of arguments with her father Yudiah and sister Haleena. When her boyfriend Bala Waleen asked her to join him in a coup d'état against her family, he promised her that she would succeed her father as keeper and her family would not be harmed. Nevertheless, Bala betrayed Lourna, having her family executed and installing himself as Aaloth's keeper. This led Lourna to a life full of anger and vengeance. As Jedi Master Oppo Rancisis pointed out after rescuing Dee from the Zygerrian slave camp, one did not have to be a Jedi to sense Lourna's deep-seeded anger or her reticence to share her reasons for such unbridled rage.\nAs a cadet at the Carida Academy, Lourna consistently earned top marks in her classes. Captain Reese deemed her an excellent student in all areas of her training except that she did not respect the chain of command. Ultimately, her unwillingness to take abuse from her nominal superiors led her to violently attack a fellow cadet and desert from the academy with a stolen starfighter. After her supposed death, Dee tried to turn over a new leaf under the name \"Sal Krost,\" but her fear that Wittick only helped her as a final act before he retired overrode her emotions, leaving Sestin to believe \"Sal Krost\" died the moment \"Lourna Dee\" was reborn.\nLourna Dee wore armored leather made from the hide of a kell dragon and a matching mask that concealed her identity and filtered the poisonous gases that the Nihil frequently made use of. She carried a single long-bladed knife that she sheathed on her thigh and a blaster that resembled the shape of a staff.\nDee named several starships after herself; including a stormship Lourna Dee formerly known as the Tooth Spike, her cruiser Lourna Dee used during the Great Hyperspace Disaster, and the prison ship Lourna Dee formerly called the Restitution.\nLourna Dee first appeared in the 2021 novel The High Republic: Light of the Jedi, written by Charles Soule. Prior to the book's release, Dee was revealed, albeit unidentified, on the preliminary cover for the first issue of the comic series Star Wars: The High Republic, which was illustrated by Pascalo Blanche and Gonzalo Kenny, and shown to the public during the announcement of the Star Wars: The High Republic multimedia project on February 24, 2020. In the audio drama The High Republic: Tempest Runner, written by Cavan Scott, Dee was voiced by Jessica Almasy. The audio drama introduced an alias for Dee; while the exact spelling was unconfirmed in Tempest Runner itself, Scott established it to be \"Sal Krost,\" though noted that it was subject to change in the event of a script edition.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lourna_Dee_(disambiguation)",
  "/wiki/Template:Cleanup",
  "/wiki/Template:Expand",
  "/wiki/Template:Update",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Star_Wars:_The_High_Republic:_The_Shadow_of_the_Nihil",
  "/wiki/Star_Wars:_The_High_Republic:_Jedi%27s_End",
  "/wiki/The_Haul",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/Talk:Lourna_Dee",
  "/wiki/Aaloth",
  "/wiki/272_BBY",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Lourna_Dee%27s_family",
  "/wiki/Zygerrian_Alliance",
  "/wiki/Galactic_Republic",
  "/wiki/Carida_Academy",
  "/wiki/Prisoner_rehabilitation_program",
  "/wiki/Nihil",
  "/wiki/Lourna_Dee%27s_Storm",
  "/wiki/Lourna_Dee%27s_Tempest",
  "/wiki/Tempest_Runner",
  "/wiki/Pirate",
  "/wiki/Cruiser",
  "/wiki/Lourna_Dee_(cruiser)",
  "/wiki/Noble",
  "/wiki/Slavery",
  "/wiki/Cadet",
  "/wiki/Standard_year",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Marchion_Ro",
  "/wiki/Attack_on_Valo",
  "/wiki/Valo",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Battle_of_Galov",
  "/wiki/Prison_ship",
  "/wiki/Lourna_Dee_(prison_ship)",
  "/wiki/Prisoner",
  "/wiki/First_family",
  "/wiki/Planet",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Ryloth",
  "/wiki/Parent",
  "/wiki/Yudiah_Dee",
  "/wiki/Keeper_of_Aaloth",
  "/wiki/Haleena",
  "/wiki/Spice",
  "/wiki/Mining",
  "/wiki/Ryll",
  "/wiki/Blurrg",
  "/wiki/Inun",
  "/wiki/Bala_Waleen",
  "/wiki/Insurrection_on_Aaloth",
  "/wiki/Death_penalty",
  "/wiki/Zygerrian",
  "/wiki/Keeper",
  "/wiki/Vardem_Kroleyic",
  "/wiki/Shock_collar",
  "/wiki/Gamorrean",
  "/wiki/Unidentified_Gamorrean_sow",
  "/wiki/Unidentified_human_slave_(Lourna_Dee)",
  "/wiki/Human",
  "/wiki/Zygerrian_slave_camp",
  "/wiki/Attack_on_the_Zygerrian_slave_camp",
  "/wiki/Jedi",
  "/wiki/Jedi_Master",
  "/wiki/Oppo_Rancisis",
  "/wiki/Padawan",
  "/wiki/Dal_Azim",
  "/wiki/Telekinesis",
  "/wiki/The_Force",
  "/wiki/Death",
  "/wiki/Jedi_outpost",
  "/wiki/Reese",
  "/wiki/Thisspiasian",
  "/wiki/Gravity_pack",
  "/wiki/Instructor",
  "/wiki/Starfighter",
  "/wiki/Technician",
  "/wiki/Millimeter",
  "/wiki/Wilson",
  "/wiki/Selkath",
  "/wiki/Lalutin",
  "/wiki/Servo_driver",
  "/wiki/Uniform",
  "/wiki/Escape_from_Carida",
  "/wiki/Blood",
  "/wiki/Hyperdrive",
  "/wiki/Engine",
  "/wiki/Nurasenti",
  "/wiki/Karter",
  "/wiki/Beskar",
  "/wiki/Armor",
  "/wiki/Sneef",
  "/wiki/Mandalorian_armor",
  "/wiki/Credit_ingot",
  "/wiki/Tycoon_Trader",
  "/wiki/War_cloud",
  "/wiki/Gas_torpedo",
  "/wiki/Glitterstim",
  "/wiki/Mine",
  "/wiki/Thermal_detonator",
  "/wiki/Hyperspace",
  "/wiki/Gravity_mine",
  "/wiki/Abrion_sector",
  "/wiki/Raid_in_the_Abrion_sector",
  "/wiki/Colicoid",
  "/wiki/Storm_(rank)",
  "/wiki/Jinnix",
  "/wiki/Stormship",
  "/wiki/Towl",
  "/wiki/Blackwing",
  "/wiki/Droid",
  "/wiki/H7-09",
  "/wiki/Helmet",
  "/wiki/Dismemberment",
  "/wiki/Stim",
  "/wiki/Dowutin",
  "/wiki/Pan_Eyta",
  "/wiki/Raid_on_Aaloth",
  "/wiki/Mandalorian",
  "/wiki/Lourna_Dee_(stormship)",
  "/wiki/Tooth",
  "/wiki/Strike",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/No-Space",
  "/wiki/Asgar_Ro",
  "/wiki/Cosmic_dust",
  "/wiki/Path",
  "/wiki/Weequay",
  "/wiki/Kassav_Milliko",
  "/wiki/Proton_bomb",
  "/wiki/Chamber_of_the_Unknown_Spirits",
  "/wiki/Durasteel",
  "/wiki/Vacuum",
  "/wiki/Blaster",
  "/wiki/Rule_of_Three",
  "/wiki/Cloud_(rank)",
  "/wiki/Xanaven",
  "/wiki/Frong",
  "/wiki/Xanaven%27s_Tempest",
  "/wiki/Tempest",
  "/wiki/Flagship",
  "/wiki/New_Elite",
  "/wiki/Gungan",
  "/wiki/Wet_Bub",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Dellex",
  "/wiki/Smash",
  "/wiki/Treason",
  "/wiki/Thermite_bomb",
  "/wiki/Shili",
  "/wiki/Togruta",
  "/wiki/Royal_Togruta_Fleet",
  "/wiki/Togruta_intelligence",
  "/wiki/Force-sensitive",
  "/wiki/Navigator",
  "/wiki/Mari_San_Tekka",
  "/wiki/236_BBY",
  "/wiki/Sylvestri_Yarrow",
  "/wiki/Chancey_Yarrow",
  "/wiki/Limb",
  "/wiki/Bone",
  "/wiki/232_BBY",
  "/wiki/Ab_Dalis",
  "/wiki/Zagyar",
  "/wiki/Raid_on_Elphrona",
  "/wiki/Elphrona",
  "/wiki/Blythe_family",
  "/wiki/Alderaan",
  "/wiki/Eriadu",
  "/wiki/Governor",
  "/wiki/Mural_Veen",
  "/wiki/Credit",
  "/wiki/Eriadu%27s_inhabited_moon",
  "/wiki/Emergences",
  "/wiki/Legacy_Run",
  "/wiki/Loden_Greatstorm",
  "/wiki/Ottoh_Blythe",
  "/wiki/Gaze_Electric",
  "/wiki/Loden_Greatstorm%27s_lightsaber",
  "/wiki/Kassav%27s_Tempest",
  "/wiki/Path_engine",
  "/wiki/Battle_of_Kur",
  "/wiki/Star_map",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Ugor",
  "/wiki/Jedi_archivist",
  "/wiki/OrbaLin",
  "/wiki/Jedi_artifact",
  "/wiki/Relay_Post_Epsilon_One",
  "/wiki/Turbolaser",
  "/wiki/Salvage_droid",
  "/wiki/Andrik_Keller",
  "/wiki/Cathar",
  "/wiki/Tasia",
  "/wiki/Nib_Assek",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Firebird_Squadron",
  "/wiki/Z-29_Skyhawk",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Jano_Brayson",
  "/wiki/Trandoshan",
  "/wiki/Sskeer",
  "/wiki/Escape_pod",
  "/wiki/Vibro-ax",
  "/wiki/Keeve_Trennis",
  "/wiki/Starlight_Beacon",
  "/wiki/Medical_bay",
  "/wiki/Teff",
  "/wiki/Ventilator",
  "/wiki/Space_station",
  "/wiki/Chief_of_Security",
  "/wiki/Ghal_Tarpfen",
  "/wiki/Mon_Calamari",
  "/wiki/Quin",
  "/wiki/Bivall",
  "/wiki/Slicer",
  "/wiki/Councillor",
  "/wiki/Jon_Wittick",
  "/wiki/Fry",
  "/wiki/K_block_(Lourna_Dee)",
  "/wiki/Security_guard",
  "/wiki/Sestin_Blin",
  "/wiki/Ottegan",
  "/wiki/Ola_Hest",
  "/wiki/Aqualish",
  "/wiki/Parr",
  "/wiki/Gloovan",
  "/wiki/Muglan",
  "/wiki/Battle_of_Cyclor",
  "/wiki/Carida",
  "/wiki/Leela_(Lourna_Dee)",
  "/wiki/Music",
  "/wiki/Shrii_ka_rai_ka_rai",
  "/wiki/Reproduction",
  "/wiki/Star_system",
  "/wiki/Tree",
  "/wiki/Arbra",
  "/wiki/Prefabricated_shelter",
  "/wiki/Logging_station",
  "/wiki/Standard_hour",
  "/wiki/Hologram",
  "/wiki/Ita",
  "/wiki/Silus",
  "/wiki/Youngling",
  "/wiki/Standard_day",
  "/wiki/Emissary",
  "/wiki/Administrator",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Load_lifter",
  "/wiki/Novor",
  "/wiki/Sisters_of_the_Ninth_Plane",
  "/wiki/Porter_Engle",
  "/wiki/Lekku",
  "/wiki/Ghost_(folklore)",
  "/wiki/Cam_droid",
  "/wiki/Coma",
  "/wiki/Synthskin",
  "/wiki/Security_droid",
  "/wiki/Suicide",
  "/wiki/Great_Works",
  "/wiki/Jon_Wittick%27s_sister",
  "/wiki/Jon_Wittick%27s_nephew",
  "/wiki/Innovator",
  "/wiki/Terrorist",
  "/wiki/Holodrama",
  "/wiki/Dog",
  "/wiki/Karkarodon",
  "/wiki/Gigoran",
  "/wiki/Galactic_Senate",
  "/wiki/Cyclor",
  "/wiki/Siniteen",
  "/wiki/Arman",
  "/wiki/Klikklak",
  "/wiki/Sabacc",
  "/wiki/Standard_minute",
  "/wiki/Bounty_hunter",
  "/wiki/Assassin",
  "/wiki/Standard_week",
  "/wiki/Attack_on_the_Restitution",
  "/wiki/Realspace",
  "/wiki/Distress_signal",
  "/wiki/Jammer",
  "/wiki/Gas",
  "/wiki/Stun",
  "/wiki/Rebreather",
  "/wiki/Stun_baton",
  "/wiki/Scav_droid",
  "/wiki/Reeman",
  "/wiki/Blaster_rifle",
  "/wiki/Phaseball",
  "/wiki/Gormak",
  "/wiki/Republic_Correctional_Alliance",
  "/wiki/Zeetar",
  "/wiki/Republic_Defense_Coalition",
  "/wiki/Moonseeker",
  "/wiki/Talpini",
  "/wiki/Technocrat",
  "/wiki/Zeetar%27s_Tempest",
  "/wiki/Belial",
  "/wiki/Leather",
  "/wiki/Kell_dragon",
  "/wiki/Poison",
  "/wiki/Knife",
  "/wiki/Staff",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Charles_Soule",
  "/wiki/The_High_Republic_(2021)_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_High_Republic_(Marvel_Comics_2021)",
  "/wiki/Pascalo_Blanche",
  "/wiki/Gonzalo_Kenny",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/February_24",
  "/wiki/2020",
  "/wiki/Cavan_Scott",
  "/wiki/Jessica_Almasy",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic_(2021)_2",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Trail_of_Shadows_2",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_1",
  "/wiki/Category:Images_of_Lourna_Dee",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Soule_Man",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars_Inside_Intel:_The_Nihil_Hierarchy",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Geonosis_and_Other_Outer_Rim_Planets",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Template:LightOfTheJediDate",
  "/wiki/231_BBY",
  "/wiki/Template:RisingStormDate",
  "/wiki/Standard_month",
  "/wiki/249_BBY",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/242_BBY",
  "/wiki/Kara_Xoo",
  "/wiki/230_BBY"
 ]
}