{
 "name": "Lowbacca",
 "display_name": "Lowbacca",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    },
    {
     "name": "Born",
     "values": [
      "4 ABY",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.26 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Ginger with black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Golden"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "New Republic",
      "Galactic Federation of Free Alliances",
      "The Colony"
     ]
    }
   ]
  }
 ],
 "content": "Lowbacca ) or \"Lowie\" was a Wookiee Jedi Knight during the Yuuzhan Vong War. He was the nephew of Chewbacca, the son of Kallabow and Mahraccor, and the brother of Sirrakuk. He studied at Luke Skywalker's Jedi Praxeum and was a companion of Jaina Solo, Jacen Solo, Anakin Solo, Zekk and Tenel Ka. He wielded a bronze-bladed lightsaber.\nLowbacca the Wookiee was born to Kallabow and Mahraccor, with his mother Kallabow being the sister of the famous Rebel hero Chewbacca. While growing up, he had had two passions: computer science and the study of Kashyyyk's complex plant life. The latter had prompted him to go alone into the dangerous lower levels of his homeworld's forests during his rite of passage to young adulthood, and to pit himself against the deadly syren plant.\nBeing a Wookiee, Lowbacca was a rarity among Jedi, as Force-sensitives were even less common among Wookiees than among other species, one being born only every century or so.\nIn 23 ABY at the age of 19, he went to study at Luke Skywalker's Jedi Praxeum. Since most of the people Lowbacca would have to interact with were not fluent in Shyriiwook, the Wookiee trade language, he used a small translator droid that he carried at his waist named Em Teedee. Later in 24 ABY it was modified to hover, and followed him around flying. He became friends with Jaina Solo, Jacen Solo and Tenel Ka. Jacen had a good sense of humour, and Lowie liked him because of this. Lowbacca's combination of computer skills and biological knowledge, and desire to take on the impossible would make him an invaluable asset to the Jedi.\nLowbacca unknowingly set a chain of events in motion when he discovered what eventually turned out to be a derelict TIE Fighter in the jungles of Yavin 4. His new friend Jaina Solo, somewhat envious of Lowbacca's T-23 skyhopper, wanted to repair the TIE Fighter. With the help of Lowbacca, Jacen Solo, and Tenel Ka, she did, but the friends didn't know that they were being watched by the TIE Fighter's pilot, Qorl. Eventually he was forced to reveal himself and he took the Solo twins hostage, forcing them to repair the fighter for him.\nLowbacca ran away to his skyhopper, and returned with it in an attempt to intimidate Qorl into running away. However, Qorl called his bluff and critically damaged the airspeeder, forcing Lowbacca to abandon it in the jungle. Lowbacca tore through the jungle on foot for the Praxeum, losing Em Teedee in the process. Once he got there, he couldn't communicate with anyone. He then remembered that his uncle and Han Solo were still in the system and within communicator range, delivering supplies to Lando Calrissian's GemDiver Station. Solo translated the situation to Tionne Solusar. A rescue mission was mounted and the twins were recovered.\nShortly thereafter, Lowbacca was kidnapped along with his friends Jacen and Jaina, as well as Em Teedee while on a field trip to GemDiver Station. The little droid was taken away from him and they were brought to the Shadow Academy. There, Nightsister Tamith Kai tried to exploit his anger in an attempt to turn him to the dark side. She went to such lengths as reprogramming Em Teedee to spout pro-Imperial propaganda or subjecting him to arduous torture.\nLowbacca gave into his anger twice, the first time when Brakiss attacked Jaina with Force lightning, and the other when he smashed a screeching sonic generator beyond all repair. However, Lowbacca was able to keep himself from being indoctrinated. When Jacen freed himself using a Corusca gem that he had acquired during their field trip, Lowbacca used his excellent programming skills to help his friends in an escape attempt aboard the station just in time for Luke and Tenel Ka to show up to rescue them.\nLater, Lowbacca went to Kashyyyk with Jacen, Jaina, and Tenel Ka in response to his sister, Sirrakuk's, coming of age and going deep in the underlevels of Kashyyyk to harvest strands of the deadly syren plant. Lowbacca had done this under unwise counsel alone, and Sirrakuk wished to repeat this, as did her best friend and Lowbacca's admirer, Raabakyysh. When Raaba did, though, she disappeared and was presumed dead.\nShortly after their arrival, the Second Imperium, headed by Zekk, came to raid a factory for computer supplies for the new fleet. The two parties soon met, and started a skirmish that killed the Nightsister Garowyn, tumbling into the underlevels of the Kashyyyk forest. There, Lowbacca and the others headed off Vonnda Ra and eleven stormtroopers. Shortly following, they encountered a syren plant. There, Nightsister Vonnda Ra and Sirrakuk were swallowed by the carnivorous plant, with Vonnda Ra being eaten and Sirrakuk pulling out the strands of the plant and then being pulled out by Lowbacca.\nIn the Third Battle of Yavin, Tenel Ka and Lowie sabotaged the floating battle platform from which Tamith Kai lead her forces, causing it to crash into a river killing the Nightsister. Suddenly, a bomb exploded and destroyed a large proportion of the Jedi Praxeum though no one was badly injured. With the end of the battle, the Second Imperium had been defeated.\nOn one occasion, Lowbacca was tricked into joining the Diversity Alliance—an anti-Human terrorist organization—by Raaba, a fellow Wookiee who had been presumed dead on Kashyyyk. However, Lowbacca turned against the Diversity Alliance after learning of their true purposes and rejoined his fellow Jedi Knights. He later helped Zekk, Bornan Thul, Tenel Ka, and the Solos destroy the Emperor's Plague.\nDuring the Solos' trip to Ord Mantell, Lowie, M-TD, Zekk, and Tenel Ka secretly entered the Rock Dragon for the Blockade Runners Derby. They used their combined Force ability and won the Blockade Runners' Derby. The fact that they were training at Luke's Jedi Praxeum caused controversy, but as the ship had not been modified specifically for the derby, as was commonly done by participants, after a few days the matter was dropped.\nLater in a docking bay some chameleon creatures, loyal to the Black Sun, were stealing the space mines they had found. Lowie, the Solos, Zekk, and Tenel Ka ran out of the Rock Dragon to stop them. A few of the chameleon creatures were killed. Anja Gallandro arrived and killed one more escaping chameleon, but they ultimately escaped with the mines.\nWhen Han Solo came, Anja accused him of killing her father. Han denied this, his children unconvinced either. Anja convinced them to go with her to Anobis, onboard the Millennium Falcon . They landed near Yuos's village where they were attacked by Knaars. After Jacen used a mind trick to scare away the Knaars, Tenel Ka, Jacen, and Lowie went into the woods to meet up with the Falcon. Upon arrival they were arrested by Elis.\nAnja then went back to Yons's village with Elis's brother, Protas to blow it up, but one of the mines Protas planted detonated and killed him. After hearing this Elis was more open to negotiations, the end result being Lowie and the Solos' freedom, and an end to Anobis's 25 year war.\nAnja came back with them to Yavin 4. She shunned everyone but Zekk and Jacen. A few weeks later, Lando invited them to come to Cloud City so they could see the amusement park SkyCenter Galleria that he and Cojahn were working on. Upon arrival they learned Cojahn was killed .\nLando, despite the bad news, continued with the tour he promised them. Due to lack of spice Anja told Czethros that Cojahn's death was under investigation. In the swamp simulated environment they found out that the Modal Nodes mysteriously disappeared so Lando, Zekk, and Jaina went to Clak'dor VII and learned of Black Sun's influence on Cloud City.\nWhile Lowie was in the snow environment, he noticed an Ugnaught spying on them, which they followed down a tunnel that led into an open room, where seven Black Sun mercenaries with images of them showed themselves, and Lowie ran down another hallway. The Ugnaught launched them down a garbage chute, Lowie grabbed an antenna and Tenel Ka with the other hand, however, Jacen wasn't as lucky and fell through the clouds.\nThe Lady Luck arrived with a rescued Jacen. With the information Jacen heard  and the information Lando got from the Modal Nodes they then had evidence to link Cojahn's death to the Black Sun. Lowie looked up the holo recordings, and found a lot of the recordings deleted, but also found Czethros was on Cloud City and that he himself killed Cojahn.\nWhen Lowie, Jacen, and Tenel Ka went to the address for the debriefing about the Black Sun, they were attacked by the Bespin Wing Guard and Black Sun mercenaries. Lowie jumped into a cloud car and took off. One mercenary and one wing guard took off in pursuit of Lowie. Just as Lowie's engine was giving out, seven thrantas and their Riders came and knocked Lowie's pursuers out of their vehicle and caught them. Lowie then came for a landing on Cloud City.\nLowie later reunited with his fellow Jedi Knights  and returned to Yavin 4. Later Anja ran out of spice so she stole the Lightning Rod, and flew it to the spice mines of Kessel. They got a lead from Lilmit so Tenel Ka, Jacen, and Zekk flew to Dac. Lowie and Jaina stayed on Kessel.\nWhile on Kessel, an army of Black Sun mercenaries took control of the planet and captured Nien Nunb, though Jaina and Lowbacca managed to escape. They found out that while Kessel, Czethros planed to send a signal that would trigger Black Sun spies everywhere. However, Jaina, Lowie, and M-TD sabotaged his plan by destroying the transmitter before Czethros could send the signal. Lowie also helped free the prisoners and defeated the Black Sun mercenaries. Czethros fell into a vat of carbonite and was flash-frozen instantly. The criminal was retrieved by the New Republic. As a result, the names of Black Sun spies in strategic positions of power were discovered amounting to the defeat of the Black Sun.\nFollowing this ordeal, the Solo Twins, Anakin, Tenel Ka, Lowbacca, and Zekk were promoted to apprentice Jedi Knights during a ceremony at the Jedi Praxeum.\nWhen Chewbacca died at the start of the Yuuzhan Vong War, Lowbacca attended his funeral on Kashyyyk. Later, he and Chewbacca's son Lumpawaroo vowed to take up his life debt to Han Solo after Chewbacca's funeral, but Han insisted that he was still mourning Chewbacca. Instead, Luke assigned him to accompany Jedi Knight Daye Azur-Jamin and his wife Tinian I'att, a Wookiee-trained bounty hunter, as scouts in Hutt Space.\nWhen Daye was captured on Nal Hutta, and the Yuuzhan Vong tightened their grip on Hutt territory, however, Lowie and Tinian had to flee back into the New Republic territory, returning to his home planet of Kashyyyk.\nEarly in the War he returned to Yavin 4, and trained with Finn Galfridian. He then went with Finn and the Solo's to Nar Shaddaa to retrieve a holocron.\nUnable to fulfill the debt to Han himself, Lowbacca subsequently stuck close to the Solo children, particularly Jaina. He took part in the Myrkr strike team's assault on the voxyn cloning facility onboard the worldship Baanu Rass, and subsequently served as Jaina's first mate aboard Trickster. He later became a member of Twin Suns Squadron under Jaina's command, where he earned the nickname Streak. At the Battle of Ebaq, Lowbacca was stabbed by the Yuuzhan Vong Warmaster Tsavong Lah, but the wound was not fatal. By the end of the war, Lowbacca was commanding a squadron of his own, and he later bonded with a seedship on Zonama Sekot which he flew during the Battle of Yuuzhan'tar. After the war, Lowbacca told Han he and Waroo were assuming Chewbacca's life debt.\nIn the years after the war, the Jedi went to great lengths to help the Galactic Alliance recover. Lowbacca worked with Jaina and Tesar Sebatyne on at least one occasion in helping to foil criminal warlords eager to profit from the war's fallout. In 35 ABY, after the three boarded the starship Night Lady and took down the Yaka pirate Redstar, they attended his trial on the maximum security space station MaxSec Eight. While Jaina was testifying, the received a Force-cry from their old friend Raynar Thul. Along with most of the other survivors of the Myrkr mission, Lowbacca followed it into the Unknown Regions and discovered that Thul was now Unuthul, the leader of a colony of Killiks.\nLowbacca was one of several Jedi who became Joiners and were absorbed into the Killik hive mind. He fought for the insectoid species during their conflict with the Chiss, and was captured by Chiss forces. He was released by Jagged Fel after the signing of the Qoribu Truce, but the move ended up forcing Fel's entire family into exile from the Chiss Ascendancy. After the truce, Lowie and Tesar hunted pirates who were hijacking abaarian water shipments.\nIn 36 ABY, the Killik-Chiss conflict was reignited by the machinations of Jacen Solo and erupted into an all-out Swarm War. During the war, Lowbacca, Tesar, and Tahiri Veila had endangered the security of the Jedi Order by telling Aryn Dro Thul, Raynar Thul's mother, that the Jedi were planning to kill her son. Grand Master Luke Skywalker found out and ordered the three to meditate on Dagobah for the remainder of the war.\nIn 40 ABY, tensions rose between the Galactic Alliance and the Five Worlds government of the Corellian system. While Corellia was under blockade, Lowbacca and Tesar operated under the command of Alliance Admiral Nek Bwua'tu. Bwua'tu had Jaina and Zekk monitoring secret Corellian shipyards in the Kiris Asteroid Cluster, but when the two were relieved of their posts and sent to the Hapes Cluster, Lowbacca and Tesar took over.\nThe Jedi departed the Alliance after it fell under the despotic rule of Jacen Solo, now the Sith Lord Darth Caedus. Lowbacca was one of many Jedi who fought against Caedus during the Battle of Kashyyyk, and led a Jedi charge against Caedus's flagship, the Anakin Solo. Caedus attempted to Force meld with Lowbacca in order to sense where the other Jedi Knights were. Lowbacca tried to mentally reason with Caedus while simultaneously launching a shadow bomb at the bridge of the Star Destroyer; the bomb hit, but a distraction caused by Ben Skywalker saved Caedus' life.\nLowbacca's home planet joined a Jedi Coalition directed against Caedus in the battle's aftermath. In 41 ABY, Lowbacca went on to participate in some of the final battles of the Second Galactic Civil War, which ended after Caedus was slain in lightsaber combat by his own twin sister, Jaina.\nIn 44 ABY, Jaina and Lando Calrissian returned to the Jedi's home base on Coruscant after an encounter with the recently-discovered Lost Tribe of Sith. Lowbacca was presented with a modified MSE-series droid that had been placed aboard Calrissian's Rockhound by Sith pirates in an effort to determine the programming style and hopefully learn the location of the Sith base.\nThe Jedi Order prepared to launch its StealthX wing from Coruscant to assist Luke Skywalker in his battle with the Lost Tribe. Lowbacca was one of several veteran Jedi pilots who helped command the fighter wing. After launching, the wing arrived at Pydyr and did battle with Sith forces, who soon after escaped.\nLowbacca was a serious fighter who loved the heat of battle. He had a slight sense of humor, but only used it when it was necessary. Of their core group of friends, Lowbacca enjoyed spending time with Jacen Solo because of Jacen's sense of humor. Their relationship came to an end after Jacen became Darth Caedus and ravaged Kashyyyk, Lowbacca's homeworld, thus forcing the Wookiee Jedi to fight his former friend until Caedus' eventual demise.\nLowbacca was created by Kevin J. Anderson and Rebecca Moesta, and featured as a major protagonist throughout their fourteen-book Young Jedi Knights series of young adult novels, published from 1995 to 1998. He later went on to feature in several installments of The New Jedi Order series of novels, which were released from 1999 to 2003. A baby Lowbacca appears in the 1998 novel Rebel Dawn.\nAfter the release of Star Wars: The Dark Nest Trilogy, George Lucas declared that no more Wookiee Jedi could be made in the Expanded Universe. Lowbacca was exiled to Dagobah in The Swarm War, the final chapter of trilogy, but author Troy Denning stated that it was not permanent. When asked about Lowbacca's sudden disappearance, Sue Rostoni, Executive Editor of Lucas Licensing, replied that he was busy doing 'Jedi things.' He has subsequently appeared in several novels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Lowbacca",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Lowbacca",
  "/wiki/Kashyyyk/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/The_Colony",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Chewbacca/Legends",
  "/wiki/Kallabow",
  "/wiki/Mahraccor",
  "/wiki/Sirrakuk",
  "/wiki/Jedi_Praxeum",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Darth_Caedus",
  "/wiki/Anakin_Solo",
  "/wiki/Zekk",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Lightsaber/Legends",
  "/wiki/Wookiee",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Syren_plant/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/23_ABY/Legends",
  "/wiki/Droid/Legends",
  "/wiki/M-TD",
  "/wiki/24_ABY/Legends",
  "/wiki/Jedi",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Yavin_4/Legends",
  "/wiki/T-23_skyhopper",
  "/wiki/Qorl",
  "/wiki/Solo_twins",
  "/wiki/Skyhopper/Legends",
  "/wiki/Airspeeder",
  "/wiki/Han_Solo/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/GemDiver_Station",
  "/wiki/Tionne_Solusar",
  "/wiki/Shadow_Academy",
  "/wiki/Nightsisters/Legends",
  "/wiki/Tamith_Kai",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Torture/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Sonic_generator",
  "/wiki/Corusca_gem/Legends",
  "/wiki/Raabakyysh",
  "/wiki/Second_Imperium",
  "/wiki/Battle_of_Kashyyyk_(Second_Imperium_Crisis)",
  "/wiki/Garowyn",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Vonnda_Ra",
  "/wiki/Third_Battle_of_Yavin",
  "/wiki/Diversity_Alliance",
  "/wiki/Human/Legends",
  "/wiki/Bornan_Thul",
  "/wiki/Battle_of_the_Emperor%27s_Plague_Storehouse",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Rock_Dragon",
  "/wiki/Blockade_Runners_Derby",
  "/wiki/The_Force/Legends",
  "/wiki/Chameleon_creature",
  "/wiki/Black_Sun/Legends",
  "/wiki/Space_mine",
  "/wiki/Anja_Gallandro",
  "/wiki/Gallandro/Legends",
  "/wiki/Anobis",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Yuos",
  "/wiki/Knaar",
  "/wiki/Mind_trick/Legends",
  "/wiki/Elis",
  "/wiki/Protas_(Human)",
  "/wiki/Cloud_City/Legends",
  "/wiki/Cojahn",
  "/wiki/Spice/Legends",
  "/wiki/Czethros",
  "/wiki/Figrin_D%27an_and_the_Modal_Nodes/Legends",
  "/wiki/Clak%27dor_VII",
  "/wiki/Ugnaught/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Lady_Luck/Legends",
  "/wiki/M%27kim",
  "/wiki/Bespin_Wing_Guard/Legends",
  "/wiki/Storm_IV_Twin-Pod_cloud_car/Legends",
  "/wiki/Thranta/Legends",
  "/wiki/Thranta_Rider",
  "/wiki/Lightning_Rod",
  "/wiki/Kessel/Legends",
  "/wiki/Lilmit",
  "/wiki/Dac",
  "/wiki/Battle_of_Kessel_(Black_Sun_Insurgency)",
  "/wiki/Nien_Nunb/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Lumpawaroo/Legends",
  "/wiki/Funeral_of_Chewbacca",
  "/wiki/Daye_Azur-Jamin",
  "/wiki/Tinian_I%27att_Azur-Jamin",
  "/wiki/Chenlambec",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Finn_Galfridian",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Dray%27s_holocron",
  "/wiki/Myrkr_strike_team",
  "/wiki/Mission_to_Myrkr",
  "/wiki/Voxyn",
  "/wiki/Cloning/Legends",
  "/wiki/Koros-Strohna",
  "/wiki/Baanu_Rass",
  "/wiki/Trickster",
  "/wiki/Twin_Suns_Squadron",
  "/wiki/Battle_of_Ebaq",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Warmaster",
  "/wiki/Tsavong_Lah",
  "/wiki/Zonama_Sekotan_fighter",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/Battle_of_Yuuzhan%27tar",
  "/wiki/Tesar_Sebatyne",
  "/wiki/35_ABY/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Night_Lady",
  "/wiki/Yaka",
  "/wiki/Pirate/Legends",
  "/wiki/Redstar",
  "/wiki/Space_station/Legends",
  "/wiki/MaxSec_Eight",
  "/wiki/Raynar_Thul",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Killik/Legends",
  "/wiki/Joiner",
  "/wiki/Hive_mind/Legends",
  "/wiki/Insectoid/Legends",
  "/wiki/Species/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/Qoribu_Truce",
  "/wiki/Fel_dynasty",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Water/Legends",
  "/wiki/36_ABY",
  "/wiki/Swarm_War",
  "/wiki/Tahiri_Veila",
  "/wiki/Aryn_Dro_Thul",
  "/wiki/Parent/Legends",
  "/wiki/Meditation/Legends",
  "/wiki/Dagobah/Legends",
  "/wiki/40_ABY",
  "/wiki/Five_Worlds",
  "/wiki/Corellian_system",
  "/wiki/Blockade_of_Corellia",
  "/wiki/Admiral/Legends",
  "/wiki/Nek_Bwua%27tu",
  "/wiki/Corellian/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Kiris_Asteroid_Cluster",
  "/wiki/Hapes_Cluster/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Battle_of_Kashyyyk_(Second_Galactic_Civil_War)",
  "/wiki/Flagship/Legends",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Force_meld",
  "/wiki/Jedi_shadow_bomb",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Jedi_Coalition",
  "/wiki/41_ABY",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Battle_of_Uroro_Station",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/44_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/MSE-series",
  "/wiki/Rockhound",
  "/wiki/Sith/Legends",
  "/wiki/Programmer/Legends",
  "/wiki/StealthX",
  "/wiki/Pydyr",
  "/wiki/Battle_in_the_Fallanassi_village",
  "/wiki/Spraug",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Rebecca_Moesta",
  "/wiki/Star_Wars:_Young_Jedi_Knights",
  "/wiki/1995",
  "/wiki/1998",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/1999",
  "/wiki/2003",
  "/wiki/Rebel_Dawn",
  "/wiki/Star_Wars:_The_Dark_Nest_Trilogy",
  "/wiki/George_Lucas",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/Troy_Denning",
  "/wiki/Sue_Rostoni",
  "/wiki/Lucas_Licensing",
  "/wiki/Category:Images_of_Lowbacca",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Young_Jedi_Knights:_Heirs_of_the_Force",
  "/wiki/Young_Jedi_Knights:_Shadow_Academy",
  "/wiki/Young_Jedi_Knights:_The_Lost_Ones",
  "/wiki/Young_Jedi_Knights:_Lightsabers",
  "/wiki/Young_Jedi_Knights:_Darkest_Knight",
  "/wiki/Young_Jedi_Knights:_Jedi_Under_Siege",
  "/wiki/Young_Jedi_Knights:_Shards_of_Alderaan",
  "/wiki/Young_Jedi_Knights:_Diversity_Alliance",
  "/wiki/Young_Jedi_Knights:_Delusions_of_Grandeur",
  "/wiki/Young_Jedi_Knights:_Jedi_Bounty",
  "/wiki/Young_Jedi_Knights:_The_Emperor%27s_Plague",
  "/wiki/Young_Jedi_Knights:_Return_to_Ord_Mantell",
  "/wiki/Young_Jedi_Knights:_Trouble_on_Cloud_City",
  "/wiki/Young_Jedi_Knights:_Crisis_at_Crystal_Reef",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Crystal",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/Invasion_2",
  "/wiki/Invasion_4",
  "/wiki/Invasion_5",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Dark_Journey",
  "/wiki/The_Apprentice_(short_story)",
  "/wiki/Star_Wars_Gamer_8",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_II:_Rebel_Stand",
  "/wiki/The_New_Jedi_Order:_Traitor",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_New_Jedi_Order:_Ylesia",
  "/wiki/The_New_Jedi_Order:_The_Final_Prophecy",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Legacy_of_the_Force:_Tempest",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Star_Wars_101",
  "/wiki/Star_Wars_Galaxy_Magazine_5",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars:_The_Art_of_Dave_Dorman",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Droids",
  "/wiki/C-3PO:_Tales_of_the_Golden_Droid",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Jedi_Order_in_100_Easy_Lessons",
  "/wiki/Star_Wars_Insider_74",
  "/wiki/Secrets_of_Kashyyyk",
  "/wiki/Star_Wars_Gamer_4",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_9",
  "/wiki/The_Official_Star_Wars_Fact_File_74",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Fate_of_the_Jedi:_Dramatis_Personae",
  "/wiki/Databank_(original)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2011_Topps_Star_Wars_Galaxy_Series_6",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Galactic_Campaign_Guide",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/Template:Cite_web",
  "/wiki/October_5",
  "/wiki/2006",
  "/wiki/October_29",
  "/wiki/2010"
 ]
}