{
 "name": "Lozz_Beraf",
 "display_name": "Lozz Beraf",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Republic Navy",
      "Galactic Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Lozz Beraf was a human male who captained the Galactic Republic cruiser Stellar Rise. During the Clone Wars, it was infiltrated by Separatist General Grievous, who killed all of the crew save Beraf, intimidating him until Jedi Knight Anap Ree-Di entered the bridge and led Grievous away, eventually forcing him off the ship.\nLozz Beraf was a human male who served in the Galactic Republic's Navy as the commanding officer of the Arquitens-class light cruiser Stellar Rise. He held the rank of captain, serving alongside Jedi Knight Anap Ree-Di during the Clone Wars against the Confederacy of Independent Systems. Beraf was wholly unprepared when Separatist General Grievous infiltrated the Stellar Rise, losing all of his deck crew to Grievous and his IG-100 MagnaGuards in under a minute. Beraf was spared, left in shock and terror as Grievous asked for his name. The captain hissed it as an act of defiance, at the same time at a loss for how the Separatists had gained access to his cruiser.\nGrievous was pleased by Beraf's surprise, feeling that because of his disbelief, he would be unable to retaliate against the invaders. The general continued talking, and when he mentioned the apparent lack of Jedi aboard, he noticed that Beraf reacted, indicating to Grievous that the captain was hiding the presence of such a warrior. Indeed, Ree-Di then revealed herself, ordering Grievous to let her captain go and leave. After trading blows with the MagnaGuards, Ree-Di ran out of the bridge, forcing Grievous to follow. At some point during their fight, Beraf activated an alarm. Ree-Di was ultimately able to trick Grievous into entering an escape pod, ejecting him from the Stellar Rise.\nDespire being terrified by Grievous's presence, Beraf acted defiantly when talking to the general. He failed to keep the presence of Anap Ree-Di a secret, his eyes flickering under the pressure.\nLozz Beraf was created for \"Galactic Tales: Saber Truth,\" the second installment of the Galactic Tales series of short stories. The story was written by Richard Dinnick and was published in Star Wars Insider's 210th issue on May 3, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Captain",
  "/wiki/Arquitens-class_light_cruiser",
  "/wiki/Stellar_Rise",
  "/wiki/Clone_Wars",
  "/wiki/Infiltration_of_the_Stellar_Rise",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Death",
  "/wiki/Jedi_Knight",
  "/wiki/Anap_Ree-Di",
  "/wiki/Bridge_(starship)",
  "/wiki/Starship",
  "/wiki/Commanding_officer",
  "/wiki/Military_rank",
  "/wiki/IG-100_MagnaGuard",
  "/wiki/Standard_minute",
  "/wiki/Cruiser",
  "/wiki/Jedi",
  "/wiki/Escape_pod",
  "/wiki/Eye",
  "/wiki/Galactic_Tales:_Saber_Truth",
  "/wiki/Galactic_Tales",
  "/wiki/Richard_Dinnick",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/May_3",
  "/wiki/2022",
  "/wiki/Titan_Magazines"
 ]
}