{
 "name": "Lug",
 "display_name": "Lug",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Nag Ubdur"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Queen of the Core Network",
      "HoloNet News"
     ]
    }
   ]
  }
 ],
 "content": "Lug was a male Trandoshan camera man during the Galactic Civil War. He was a friend of the journalist Tracene Kane. He perished when he was crushed by a fallen TIE fighter during a battle in the city of Binjai-Tin on the planet Nag Ubdur in 5 ABY.\nFollowing the Battle of Endor in 4 ABY, Lug found work as a cameraman for the Queen of the Core Network, a news network that had emerged at the same time as the establishment of the New Republic. His colleague was the female human journalist Tracene Kane. That year, Lug accompanied Kane on the network's first live broadcast in Hanna City, the capital of the planet Chandrila and the site of the New Republic's new Galactic Senate. Lug held the camera while Kane interviewed the Pantoran Olia Choko, Chancellor Mon Mothma's and the new Senate's public relations representative. The interview took place near an exhibit of stormtrooper helmets painted with flowers, starbursts, and Rebel Alliance starbirds.\nLug was filming the interview when an angry Xan man named Geeska Dotalo hurled rotten fruits at Olia. Kane was about to tell Lug to cut the footage but Choko told them to continue filming. Choko then approached the man on live footage and asked to hear his troubles. Dotalo then told Olia that he came from the Mid Rim colony of Gan Moradir and that crime, famine, and chaos had afflicted his homeworld since the New Republic liberated Gan Moradir. Lug continued recording the exchange when Choko offered Dotalo a job as Gan Moradir's representative in the Galactic Senate. She convinced him that he could help his homeworld by working with the New Republic.\nAfter Choko put Dotalo in touch with a Pantoran New Republic official, Kane instructed Lug to cut the footage. At that point, Lug, Kane, and Choko witnessed a New Republic officer parading several captured Imperial stormtroopers and officers from a holdout garrison on Coruscant. Under Choko's instructions, Lug filmed Choko chastising the New Republic Corporal Camerand Argell for treating prisoners like cattle. She then ordered Argell to tell Commander Rohr to end the parade immediately.\nLug then filmed Choko and Kane talking about how the New Republic was different from the Empire because it cared for democracy and did not prioritize order over all other pursuits. Lug continued filming as a procession of senators entered the old Chandrila Senate house building, the venue for the Galactic Senate.\nLater, Lug and Tracene Kane were embedded with the New Republic Thirty-First during the fighting at Binjai-Tin on the planet Nag Ubdur. New Republic forces had invaded the planet and were fighting Imperial forces. Lug accompanied Kane as they filmed a shattered building. For this job, they were accompanied by a floating cam droid, which Lug could issue verbal commands. When Lug suggested getting Commander Norwich, Kane suggested getting a common citizen rather than a military officer. When Kane asked him about her hair, Lug was bemused but reassured her that it was alright.\nLug soon returned with a young Kupohan New Republic soldier named Rorith Khadur who gave an account of the fighting at Govneh Ridge. He also mentioned that the Empire had massacred the population of Binjai Tin, which was an Ubdurian merchant city. When Khadur began weeping, Lug comforted him by giving him a hug. As a token, Lug handed the man a tooth broken off a zlagfiend, a predatory creature. Lug wished the Kupohan good luck and told him to wear the token as a good luck charm.\nThe two then proceeded to upload their broadcast on top of a wrecked guild tower. Before they could reach the guild tower, a dozen TIE fighters began strafing the New Republic positions. The TIE fighters then launched a suicide attack and began hitting targets and buildings in the area. One of the TIE fighters crashed on top of Lug, killing him. Kane wept for her friend and then began a broadcast telling the life and times of Lug.\nLug was a male Trandoshan. As with other members of his species, he grew up hunting, killing, and reveling in death. Lug did not share his people's love for hunting and violence but his childhood was still influenced by it. As a Trandoshan, Lug was awkward at giving hugs and likened it to the warmth of a protocol droid romancing a tree stump. Lug became a close friend of his fellow news colleague Tracene Kane. After Lug was killed by a TIE fighter, Kane wept for her friend and made a broadcast in his honor.\nLug was a minor character who first appeared in Chuck Wendig's 2015 novel Aftermath and its 2016 sequel Aftermath: Life Debt. His lines are told through the point-of-view of the character Tracene Kane.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Nag_Ubdur",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Queen_of_the_Core_Network",
  "/wiki/HoloNet_News",
  "/wiki/Galactic_Civil_War",
  "/wiki/Tracene_Kane",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Binjai-Tin",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/New_Republic",
  "/wiki/Human",
  "/wiki/Journalist/Legends",
  "/wiki/Hanna_City",
  "/wiki/Chandrila",
  "/wiki/New_Republic_Senate",
  "/wiki/Pantoran",
  "/wiki/Olia_Choko",
  "/wiki/Chancellor_(New_Republic)",
  "/wiki/Mon_Mothma",
  "/wiki/Stormtrooper",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Starbird_(symbol)",
  "/wiki/Xan",
  "/wiki/Geeska_Dotalo",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Gan_Moradir",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_officer",
  "/wiki/Coruscant",
  "/wiki/Corporal",
  "/wiki/Camerand_Argell",
  "/wiki/Commander",
  "/wiki/Rohr",
  "/wiki/Senator",
  "/wiki/Chandrila_Senate_house",
  "/wiki/New_Republic_Thirty-First",
  "/wiki/Battle_of_Nag_Ubdur",
  "/wiki/Cam_droid",
  "/wiki/Norwich",
  "/wiki/Kupohan",
  "/wiki/New_Republic_soldier",
  "/wiki/Rorith_Khadur",
  "/wiki/Ambush_at_Govneh_Ridge",
  "/wiki/Govneh_Ridge",
  "/wiki/Massacre_at_Binjai-Tin",
  "/wiki/Ubdurian",
  "/wiki/Zlagfiend",
  "/wiki/Protocol_droid",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(novel)",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}