{
 "name": "Lugubrious Mote",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kowak"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mole-flea"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Lugubrious Mote was a mole-flea female who claimed to have been with Luke Skywalker during the Rescue of Han Solo.\nAt some point she entered into a mucially beneficially arrangement with Salacious B. Crumb, Jabba Desilijic Tiure's court jestor. She would provide Crumb with material for his jokes and Crumb allowed her to live on him and share the scraps Jabba thew their way. Mote was content with her lot in life, but all that changed when two droids came to the palace with a message from Luke Skywalker, who claimed to be a Jedi Knight. Mote was enthralled by Skywalker's presence and touched by his selfless desire to save Han Solo from imprisonment.\nLater, she bore witness to Princess Leia Organa's thawing of Han Solo, as well as her subsequent capture and enslavement. Mote was also suitably impressed with the Princess' calm and defiant demeanor toward Jabba despite her captivity. She hopped into the Princess' ear and woke her while she slept, telling her that her mistake was to view Jabba as an equal in skill, as he had been a thief all his life and was able to easily capture her because of it. Leia agreed that she made a valid point and requested that Mote reveal herself, to which she responded by hopping on her nose. She and Leia spoke all night, and the Princess told herabout Rebellion's war against the Galactic Empire. She promised that when the Republic was restored, all sentient beings would have a voice, regardless of their wealth or size. When Mote asked if her species could advise great beings such as Senators, Generals, or Moguls, the Princess responded that they could, as they seemed incredibly smart to her. When Mote asked if she could live on the Princess' head and advise her, Leia told her that her scalp would be a poor choice for Mote to live, but she promised the Mole-flea that her Wookiee friend Chewbacca's body would be a much better choice, and Mote agreed while promising to help her escape.\nThe next day, Luke Skywalker arrived at the Palace. Mote was seated on one of Leia's earrings as she watched the proceedings. Realizing that Jabba was drawing Skywalker in, she hurriedly attempted to warn Leia of his intentions, but Leia could not understand her natural speed at first and asked for clarification. Mote told Leia that he was making the same mistake that the Princess had; Jabba was manipulating Skywalker intoto believing he was in control in order to position him over the Rancor pit. Leia attempted to warn Skywalker, but Jabba tugged the chain around her neck to silence her. When Skywalker drew the blaster of another guard to him in response, and Jabba dropped Skywalker and another Gammorean guard into the Rancor pit. As Skywalker fell, Mote jumped onto him.\nIn the pit, Mote attempted to explain who she was to Skywalker, but he mistook her for the spirit of an ancient Jedi advising him. Mote decided to indulge Skywalker rather than correct him. With Mote's advice, Skywalker managed to defeat the Rancor by luring it under the door and slamming it down on the beast.\nLater, Skywalker and his friends were taken to the Dune Sea to be cast into the Sarlaac living in the Great Pit of Carkoon on his personal sail barge. Lugubrius told Skywalker she believed in him and told him to \"do as his tingling scalp told him.\" Skywalker then managed to escape his bonds and retrieve his lightsaber from one of the droids he sent beforehand, the astromech R2-D2. While Mote stayed with Skywalker as he fought off Jabba's forces, Leia killed the Hutt by choking him with the chain he used to tether her to him. Leia and Skywalker then fired the main gun of the Barge into the deck and swung onto the Desert Skiff where their friends waited. Mote then reunited with the Princess and admitted to her that she had grown attached to Skywalker after all.\nAfter the rescue, Mote made Princess Leia promise never to reveal her presence to Skywalker. She later joined the circus, and hoped that one day Skywalker would learn to think for himself.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kowak",
  "/wiki/Mole-flea",
  "/wiki/Gender",
  "/wiki/Luke_Skywalker",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Salacious_B._Crumb",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Jedi_Knight",
  "/wiki/Han_Solo",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Jubnuk",
  "/wiki/Dune_Sea",
  "/wiki/Sarlacc",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Khetanna",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/The_Tale_of_Lugubrious_Mote",
  "/wiki/The_Legends_of_Luke_Skywalker%E2%80%94The_Manga"
 ]
}