{
 "name": "Luke_Skywalker%27s_best_friend",
 "display_name": "Luke Skywalker's best friend",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Luke Skywalker's best friend was a Force-sensitive childhood friend of Luke Skywalker and lieutenant in the Rebel Alliance who participated in the battles of Yavin, Hoth and Endor.\nHe tended to share many of the same character traits as Luke, especially his adventurous spirit. He was Force-sensitive, though was not as strong in the Force as Luke Skywalker was.\n\"Luke Skywalker's best friend\" is the protagonist of the Choose Your Own Star Wars Adventure trilogy by Christopher Golden. Because these novels are written in the second-person point of view similar to the Choose Your Own Adventure series, the reader assumes the role of the protagonist. Within the context of the story, the reader is first identified by the phrase \"Luke Skywalker's best friend\" and is identified subsequently by various epithets in order to maintain ambiguity. The process of making choices preserves the illusion that the reader is actively taking part in and influencing the events within each novel.\nBecause Luke Skywalker's best friend is \"you\" , the book remains ambiguous about the physical traits  of Luke Skywalker's best friend, so that the reader can feel that he or she is truly part of the events. Furthermore, the fate of the galaxy is largely determined by the choices of the reader, seemingly directly influencing the story. Each subsequent novel assumes that the reader's choices in the previous novels led to each movie's canonical ending, albeit with Luke Skywalker's best friend involved. For example, although several possible endings for \"A New Hope\" result in the Death Star not being destroyed, \"The Empire Strikes Back\" begins assuming that it was destroyed.\nWhile no gender, race, age, or appearance is given in the text, the illustrations in the novels portray Luke Skywalker's Best Friend as a human male about Luke's age with shoulder length hair.\nDepending on the choices of the reader, the character experiences many different events, all variations on the plot of the original films.\nLuke Skywalker's best friend grew up with Luke on Tatooine. One day, Luke purchases R2-D2 and C-3PO only to have R2-D2 escape in search of Ben Kenobi. From here, the reader's choices affect what happens. Among the possibilities are remaining on Tatooine, aiding in the rescue of Princess Leia, foiling the Empire and helping Princess Leia save Alderaan from destruction, not helping out in the attack on the Death Star resulting in the Empire building three more, destroying the Death Star, and joining the Empire.\nThe novel begins assuming that the events portrayed in A New Hope were fulfilled as they were in the movie resulting in the Rebel Alliance relocating to Hoth. Luke Skywalker's Best Friend is a lieutenant in the Rebel Alliance and a member of Rogue Squadron. Among the possibilities are leaving Luke to die at the hands of the wampa, becoming Rogue Leader, being trained by Yoda on Dagobah with Luke, foiling Boba Fett's plan to take Han to Jabba Desilijic Tiure and rescuing Han, working with Luke to kill Darth Vader in a lightsaber duel, and joining the Empire to become a Dark Jedi.\nAgain, the novel begins assuming that everything prior to the start of the novel happened as they did in the movie. Luke Skywalker's Best Friend has been infiltrating Jabba's palace as a guard along with Lando Calrissian. The possibilities include betraying your friends to Jabba, killing Jabba, pretending to work with Boba Fett to recapture Han, helping to destroy the shield generator on Endor, helping to destroy the second Death Star, and joining Luke in his battle against Vader and the Emperor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Choose_Your_Own_Star_Wars_Adventure",
  "/wiki/Christopher_Golden",
  "/wiki/The_galaxy/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alderaan/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Wampa/Legends",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Dagobah/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Choose_Your_Own_Star_Wars_Adventure:_A_New_Hope",
  "/wiki/Choose_Your_Own_Star_Wars_Adventure:_The_Empire_Strikes_Back",
  "/wiki/Choose_Your_Own_Star_Wars_Adventure:_Return_of_the_Jedi"
 ]
}