{
 "name": "Luke_Skywalker_(The_Star_Wars)",
 "display_name": "Luke Skywalker (The Star Wars)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aquilae"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aquilaean Starforce",
      "Aquilaean Council",
      "Jedi-Bendu"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Annikin Starkiller"
     ]
    }
   ]
  }
 ],
 "content": "Luke Skywalker was a Jedi General for the Aquilae, as well as one of the survivors of the Knights of Sith's attack on the Jedi-Bendu. He was the mentor of Annikin Starkiller.\nAccording to Vantos Coll, Luke Skywalker was the one who led the Jedi Rebellion and he was also First Bodyguard to the Emperor. Following the defeat of the rebellion, Skywalker fled to Aquilae, where he became a general in its military.\nWhen the Aquilaean Council was debating whether they should go to war with the Empire, Skywalker, after sternly telling Count Sandage to sit down after the latter accused Skywalker and the other council members of being dreamers regarding mounting effective resistance against the Empire, told them that they need to reach a decision immediately due to the upcoming Imperial raid being far more than just a raid for resources, with him citing to Senator Nash that procrastination is a dangerous business while war is his business upon being told that war is a dangerous position.\nHe also inquired whether Tarkin had approved the defensive measures he requested. King Kayos conceded Luke's suggestion, but decided not to take further action until they found out more about what the Empire's plans were just as his sons Biggs and Windy rushed in to inform their father that Leia was leaving.\nAfter the council meeting, Skywalker went to the Hidden Fortress, far beneath the Palace of Lite, where he wanted an update of any Imperial ships leaving Alderaan and he found out that a full battalion of Stardestroyers left for the Anchorhead System or a nearby system. Skywalker was also worried that Captain Clieg Whitsun hadn't reported in and decided to put the base on alert. It was then that he was reunited with his friend, Kane Starkiller who asked Skywalker to take his son, Annikin Starkiller, as his Padawan learner and teach him how to be a Jedi.\nSkywalker was honored, but hesitant to take on Starkiller as his apprentice, as he thought Kane could finish Annikin's training himself. Kane revealed that he was getting too old and that he was dying, even going the extra step by showing his fellow Jedi that he was not the same Kane that Skywalker knew and that this Kane Starkiller was mostly artificial. Following this meeting, Skywalker later learned from his subordinate Montross, of a Space Fortress leaving the Anchorhead System and heading straight for Aquilae.\nSkywalker and Annikin joined King Kayos and Queen Breha for dinner to inform them of the Empire's movements and the disappearance of their best agent, Whitsun, had disappeared. Kayos promised the Jedi that he wasn't going to approve of the Alliance Treaty and supply him with the war code so he can act in Aquilae's defense. Though Skywalker had little patience for politics, Kayos reminded him that this had to be done legally.\nSkywalker is then summoned back to the war room after being informed that the Space Fortress had disappeared from sensors. He then caught Annikin flirting with a woman and briefly, but pre-emptively dueled him. He remarked that the young man was well trained but he required discipline. The General is then informed that Whitsun had just been admitted to the infirmary and he went to see his operative, who confirmed that the Imperial Starforce was on its way. Skywalker then ordered Annikin to go and retrieve Princess Leia and only the princess.\nHe later commanded Devil Squadron from Aquilae to attack the Space Fortress. Unfortunately, as Kayos' convoy was destroyed by orbital bombardment, the Senate chose to accept the Empire's peace treaty with Queen Breha's approval and ordered Skywalker to stand down. Skywalker had little choice, for he'd be committing treason and no one would follow him were he to disobey. He then recalled the two remaining starfighters, only for them to be destroyed. Enraged, Skywalker demanded to the senators if they should accept the \"peace\" the Empire promised and ordered them to leave, promising that the war has only just begun.\nSkywalker later rendezvoused with Annikin and Leia at the Hidden Fortress, where he informed the Princess of her father's passing. They then take the discussion to the throne room, where Breha explains that the Senate had been corrupted. She had only ruled by marriage to King Kayos and now that he's dead, she lacks the political power to stop them, thereby making Leia the true queen. Skywalker then took on the task of escorting Leia and her twin brothers Windy and Biggs to the Ophuchi system, where the Chrome companies have offered to supply him with the troops and ships necessary to restore Leia to the throne. As they prepared to depart disguised as commoners, Skywalker took note of the two droids C-3PO and R2-D2, whom Annikin and Leia recovered from the desert. He advised Annikin that the droids won't harm a living being but they would give accurate information to anyone who asks, so they'll be useful against the Space Fortress. Unfortunately, they are caught by Count Sandage, who was intent on bringing Leia to the Empire so they could control Aquilae. Skywalker refused to let it happen before bisecting the Count and making their escape. Once at a safe distance, they self-destructed their hidden fortress to throw the Empire off their trail.\nAs the party made their way across the desert, their landspeeders ran low on power, so they stopped at a homestead for refueling. But just as Annikin and Whitsun came out with a fuel rod, they are ambushed by stormtroopers, who decided they were not worth the trouble to look after, forcing the Jedi to attack pre-emptively. Skywalker then moved and killed the pilot of a hover tank and set it to explode to distract a trio of jet stickers, enabling the party to make their escape.\nBecause of his being exposed to exotic elements, Skywalker possessed a weathered and cracked appearance, although it was set off by his piercing silver beard and dark, penetrating eyes. In addition, his overall physique gave him the appearance of someone within the age of sixty years, although he was in fact far older.\nLuke Skywalker was a powerful Jedi, second only to Kane Starkiller. In combat, Skywalker was able to move so fast that he would leave an After-image of himself behind in his wake.\nThis incarnation of Luke Skywalker first appeared in the 1974 rough draft of Star Wars. In this story treatment, he was already an experienced Jedi  and acted as the deuteragonist to the story. In the finished film, Luke Skywalker—the desert farmboy from Tatooine and Jedi in training—was modeled more after Annikin Starkiller, while this draft's version of Luke became the film's Obi-Wan Kenobi.\nIn 2013, Dark Horse Comics began publishing The Star Wars, a comic book adaptation of George Lucas' rough draft. Although Luke's role overall remained true to the draft screenplay, his introduction and dialogue had been edited slightly to take into account the differences between comic book and film formats. In the original draft, the door opened revealing Luke Skywalker just as Sandage was undergoing the rant about dreamers, causing Sandage to meekly sit down immediately. In the comic, Skywalker appeared just as Sandage was ranting and sternly ordered the count to sit down before addressing the council.\nJonathan W. Rinzler, writer of this comic, modeled Skywalker's design after Sterling Hayden and Alec Guinness  with a slightly more cropped beard.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Luke",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Aquilae_(The_Star_Wars)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Aquilaean_Council",
  "/wiki/Jedi-Bendu",
  "/wiki/Annikin_Starkiller",
  "/wiki/Knights_of_Sith",
  "/wiki/Vantos_Coll",
  "/wiki/Great_Jedi_Rebellion",
  "/wiki/First_Bodyguard",
  "/wiki/Emperor_(The_Star_Wars)",
  "/wiki/Galactic_Empire_(The_Star_Wars)",
  "/wiki/Count/Legends",
  "/wiki/Sandage",
  "/wiki/Nash",
  "/wiki/Tarkin_(The_Star_Wars)",
  "/wiki/King/Legends",
  "/wiki/Kayos",
  "/wiki/Biggs_(The_Star_Wars)",
  "/wiki/Windy_(Aquilae)",
  "/wiki/Leia_(The_Star_Wars)",
  "/wiki/Hidden_Fortress",
  "/wiki/Palace_of_Lite",
  "/wiki/Alderaan_(New_Galactic_Empire)",
  "/wiki/Stardestroyer",
  "/wiki/Captain/Legends",
  "/wiki/Clieg_Whitsun",
  "/wiki/Kane_Starkiller",
  "/wiki/Padawan/Legends",
  "/wiki/Montross_(Aquilae)",
  "/wiki/Space_Fortress",
  "/wiki/Breha_(The_Star_Wars)",
  "/wiki/Devil_Squadron_(Aquilae)",
  "/wiki/Battle_of_the_Space_Fortress",
  "/wiki/Treason/Legends",
  "/wiki/Force_speed",
  "/wiki/Luke_Skywalker",
  "/wiki/1974",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/Star_Wars",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/2013",
  "/wiki/Dark_Horse_Comics",
  "/wiki/The_Star_Wars",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Jonathan_W._Rinzler",
  "/wiki/Alec_Guinness",
  "/wiki/The_Star_Wars_1",
  "/wiki/The_Star_Wars_2",
  "/wiki/The_Star_Wars_3",
  "/wiki/The_Star_Wars_4",
  "/wiki/The_Star_Wars_5",
  "/wiki/The_Star_Wars_6",
  "/wiki/The_Star_Wars_7",
  "/wiki/The_Star_Wars_8",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Star_Wars_(article)",
  "/wiki/Star_Wars_Insider_144",
  "/wiki/Template:Cite_web"
 ]
}