{
 "name": "Lula_Talisola",
 "display_name": "Lula Talisola",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kantam Sy",
      "Yoda"
     ]
    }
   ]
  }
 ],
 "content": "Lula Talisola was a human female Jedi Padawan who lived on Naboo before joining the Jedi Order and being trained under Jedi Masters Yoda, Torban Buck, and Kantam Sy. Talisola trained aboard the Padawan Academic Cruiser Star Hopper during the High Republic Era and Nihil conflict, and she was the best friend of fellow Padawans Farzala Tarabal and Qort, often looking out for them.\nWhen the Padawans of the Star Hopper were sent to respond to an Emergence in the Trymant system after the Great Hyperspace Disaster, Talisola met the Force-sensitive resident Zeen Mrala during a confrontation with a group of Nihil pirates. The Nihil threatened the people of Bralanak City, and the Jedi were able to fight off the Nihil with the help of Mrala, whom they welcomed back to Starlight Beacon, where the two grew closer, and even meditated together.\nSoon after, the Nihil were spotted on the junk moon of Quantxi. During a bit of deliberation, Mrala decided to depart on her own to find her friend Krix Kamerat, who had joined the Nihil, and Talisola and her friends followed. Planetside, the Padawans once again found themselves facing scores of Nihil raiders while defending a Junk Maven campsite on the moon. Talisola split off from the other two to search for Mrala, and tracked Kamerat's location to find her and her former friend facing off, Mrala choking Kamerat with The Force. Talisola quickly intervened, but Kamerat was rescued by Marchion Ro. The Jedi attempted to prevent the Nihil's Spider Cruiser from escaping, but were unsuccessful. Afterwards, Talisola reunited with her Padawan friends, happy they were okay.\nDuring a trip back to Trymant IV, Talisola felt envious of the progress Vernestra Rwoh had made as a Jedi Knight at a similar age to her. The Jedi touched down on the now-damaged world, and met with Elder Barbatash, who stopped a fight from breaking out with some locals. A conversation with Barbatash lead the Jedi to Vrant Tarnum, where Talisola and Rwoh descended to search the rocky planet. They found many Nihil ships moving in formation, and eventually departing the hidden base with their Path engines. Talisola received news that the Nihil were planning to attack Valo, where the Republic Fair was being held, but Crashpoint Tower had been disabled, so they couldn't be warned. The Jedi soon departed for Valo.\nOn the way to Valo, Talisola confided her insecurities in Rwoh, and was reassured of her timing and the pace of her journey. Exiting hyperspace, they found Lonisa City under Nihil attack, and joined the fight while trying to contact Starlight. Without a response, they descended to the ground and continued the fight there. Working with Ty Yorrick and meeting Ram Jomaram and some Bonbraks, they rush to Crashpoint Tower. Fighting the Nihil, a Hragscythe, and Drengir along the way, on speeder bike, on Sanval, and on foot, the two made it to the Tower. There, Talisola would fight several Nihil ships in the air and on the ground, but was eventually saved by V-18, though Talisola was wounded in the arm during the fight. After Jomaram repaired the Tower's communications, he asks to join Mrala and Talisola on their future journies, and they accept. Soon after, the group continued to fight the Nihil in the streets of Lonisa City.\nAfter the attack on the Republic Fair, the Padawans reunited on Starlight, where Talisola met Ishnar Ti-Kharatal, and introduced Qort and Tarabal to Jomaram. After a discussion with their and the Padawans departed for Takodana to help defend the temple there from incoming Nihil attacks. During preparations, two Nihil double agents planted thermal detonators and blew up the temple, as Nihil starfighters approached. Talisola and the others were saved from the attack after Qort's Vonduun crab mask was broken in the destruction and he unleashed his unrestricted natural abilities, driving Kamerat and his Nihil away.\nBack on Starlight, Talisola and the other Padawans participated in the Great Jedi Rumble Race held by masters Buck and Sy, and later was part of a task force to find and capture Kamerat for good. Bibs found Kamerat's Nihil encampment on Dol'har Hyde, and the Padawans descended upon the world to finally capture Kamerat in the depths of his base. With Kamerat imprisoned on the Starhopper, Talisola was presented with the opportunity to be knighted. After reflecting on, accepting, and finally expressing her love for Mrala, Talisola declined the opportunity to be knighted, but was happy for her two best friends as they became Jedi Knights.\nLula Talisola, a Force-sensitive human female, lived in an orphanage on the planet Naboo. Eventually she was taken to the Jedi Order's Jedi Temple on Endovar by former Jedi Kantam Sy, who returned to the Order in order to train Talisola. Due to her young age, Talisola did not remember her original home. She became close friends with two other Padawans, Farzala Tarabal and Qort, frequently looking out for them when they got up to mischief. Eventually, Talisola became a member of the class of Padawans aboard the cruiser Star Hopper, who were supervised by Jedi Masters Torban Buck and Yoda.\nAround 232 BBY, the freighter Legacy Run was destroyed in hyperspace outside of the Hetzal system. This caused the Great Hyperspace Disaster, when the star system was imperiled by large amounts of hyperspace debris. In the aftermath, further Emergences of the debris began occurring throughout the Outer Rim Territories. When one Emergence threatened the Trymant system, the Star Hopper was the only Jedi or Galactic Republic starship within range, and it diverted to assist.\nAs Yoda ordered the Padawans to prepare themselves for whatever awaited them at Trymant, Talisola grew nervous, feeling that her skills were not up to going out in the field yet, even though she had aced all of her exams, as she thought she should have been happy about the situation but was unable to focus. In response to a question from Tarabal, Yoda reminded the apprentices that they could not turn back as they were Trymant's only hope, and Talisola thought that things might go terribly wrong.\nWhen the Star Hopper was about to arrive at Trymant, Yoda and Buck gathered the Padawans and had them report on what they had learned about the situation. Tarabal and Qort reported that it was fallout from the Great Disaster, and Talisola, alongside the Bravaisian Bibs, reported that several large chunks of debris were on course to hit Bralanak City, the most densely populated area of Trymant IV, the most densely populated planet in the system. Yoda reminded the apprentices to trust in the Force, and Buck stated that he and Yoda would be handling the largest pieces of debris, before the Padawans were sent to board their rescue speeders. Taking the helm of a speeder with Tarabal as her co-pilot, Talisola headed into action. Steering around falling debris, she alarmed her Zygerrian friend after narrowly dodging a large piece in response to a warning from him, grinning.\nOnce on the ground, Talisola stepped into a leadership role while working with Tarabal, Qort and Bibs to assist civilians, and began to think that things might actually go well. During their efforts, Tarabal spotted and alerted Talisola to a piece of debris heading for a building with people on its roof, so she told Qort and Bibs to follow with their hover platform while she and Tarabal hopped into their rescue speeder. As Talisola flew the speeder, Tarabal managed to shoot down the debris just in the nick of time. Talisola complimented him, before wondering how they were going to evacuate the city, as they needed a large craft the people would be able to fit into. Spotting a large ship in the area, Tarabal suggested it to his friend.\nThe cruiser belonged to the Nihil pirates, who were there to evacuate Tromak, a member of the Elders of the Path. The Padawans, led by Talisola, arrived at the building where the spider-shaped ship had landed just after Tromak had asked the pirates not to kill Zeen Mrala and Krix Kamerat, two young members of the group who had been attempting to persuade the pirates to allow the use of their ship as an evacuation vessel. With her lightsaber already ignited, Talisola politely insisted that the pirates' vessel was required for evacuation immediately. Bibs was concerned that they hadn't asked nicely, and one pirate snapped that they were not going to hand over their ship to childen, especially \"snivelling\" Jedi. As Mrala and Kamerat dove out of the way, a firefight occurred as the Nihil opened fire on the Padawans, who deflected the shots.\nThe sight of Talisola and her friends fighting awed Mrala, who as a Force-sensitive in a sect that spurned its use had been trying to hide her powers all her life. Mrala realized that she could be like the Jedi and use her powers for good. After deflecting the first barrage, Talisola retorted to the pirates that she had been \"asking nicely\" earlier, and Tarabal declared that they would take the ship. As the Padawans leapt forward again, Talisola and Mrala both sensed a large piece of debris heading straight for their position. The two girls, strangers to each other, moved as one, Mrala leaping out to hold off the debris while Talisola Force pushed away attacking pirates. The Padawans were shocked at Mrala's actions, but Talisola stepped in to help her when the untrained girl began to lose her hold on the debris, reassuring her that they had her back. A shocked Kamerat was dragged away by Tromak as another figure emerged from the Nihil ship, declaring that the Jedi were right where he wanted them. As the pirates surrounded the Padawans and Mrala, the figure ordered their execution.\nTarabal asked her what they were going to do, and Talisola declared that they had no choice but to fight. Masters Yoda and Buck shortly arrived to assist the apprentices, and Talisola and her friends were taken aback by the Chagrian's dramatic \"Buckets of Blood\" nickname before leaping into action. As the battle raged, Mrala asked the Masters for help, as Kamerat had apparently been captured by the Nihil. Talisola immediately backed her up, telling the Masters how Mrala had helped them by using the Force, and offered to sneak around and rescue Kamerat herself. Yoda overruled her and said he would do it himself, telling Buck that Talisola was right about their duty to Mrala when the Jedi healer expressed concern about his ability to lead the Padawans to safety by himself. In the thick of battle, Tarabal shouted a warning to Talisola and Yoda about a projectile flung in their direction by a Gigoran pirate, which Yoda swiftly destroyed. Talisola was visibly impressed, and after Yoda headed off with Mrala's pet, Cham Cham, she reassured Master Buck that the Jedi could handle the situation.\nTalisola led the charge as she, her fellow Padawans, Mrala and Buck waded into battle. In response to Tarabal asking how they were looking, Talisola complimented Mrala's use of telekinesis during the battle, saying she was a natural. Tarabal then spotted Buck, who was in danger of being overwhelmed, and Talisola rallied the Padawans to rescue him, driving the pirates back. Just then, a Republic rescue fleet arrived to assist, leading Buck to proclaim that they were saved. In the aftermath, as Republic ships began landing, Talisola and Tarabal asked Buck why he called himself Buckets of Blood, but neither apprentice found his explanation, about keeping blood inside the body, to be very convincing. Just after the Spider Cruiser took off, Talisola and her fellow apprentices were surprised by the arrival of Yoda, who stated it was imperative that the ship be stopped. Returning Cham Cham to Mrala with the news that he may have eaten a pirate's arm, Yoda told her that she had to come to the Starlight Beacon with them, and he had not been able to rescue Kamerat because he had not wanted to be rescued. Talisola put a hand on Mrala's shoulder to comfort her. The Nihil ship escaped the system by firing on a medical frigate as a diversion.\nWhile travelling to the Beacon on the Star Hopper, Talisola comforted a crying Mrala, who admitted to her that she had left the only place she had lived that felt like home. Mrala added that she might not have had a true home because those who raised her would not have accepted her for who she really was, and Talisola responded that she had left her home so young that she did not remember it, but had found a new one with her friends. Talisola said that she and her friends had Mrala's back, and Tarabal and Qort backed up her statement. She further assured Mrala, as the cruiser prepared to dock with Starlight, that they were going to the best place in the galaxy.\nFor the following week, Talisola and her friends easily incorporated Mrala into their group as they had fun together. At the end of that week, Talisola went to Mrala's room to inform her that the Jedi Masters wanted to speak to her, walking in on her crying as she had just watched a message Kamerat had sent her through paired holoprojectors given to them by Yoda. Talisola asked her what was wrong, and Mrala said she was simply processing the changes in her life before asking the Padawan what she wanted. As Talisola was explaining, however, Masters Yoda, Buck, Sy, Estala Maru and Avar Kriss arrived, Sy asking if they were interrupting. Kriss said that they wanted to talk to Mrala about her future plans.\nDuring the Masters' discussion, Maru pointed out that Mrala was too old to begin Jedi training, but Kriss noted that they did not know what conditions were like on Trymant IV and Sy argued that Mrala got along well with the apprentices, including Talisola. The topic led Talisola to interrupt, suggesting that they should ask Mrala what she wanted to do as her opinion was the most important, and Tarabal backed her up, adding that they also ask the various Padawans and younglings Mrala had befriended, whose opinions were second most important.\nAround 230 BBY, Talisola particpated in a battle at Dol'har Hyde, which resulted in the capture of Kamerat. Talisola accompanied Mrala aboard the Star Hopper to take Kamerat back to Starlight Beacon to be imprisoned, though on the way back to the station, Mrala was called to Corellia to assist other Jedi who were investigating a recent attack. Talisola ensured her friend that would she make sure the Nihil was delivered to Starlight. A short time later, the station was destroyed by the Nihil. In the first official reports from the scene of the destruction, Talisola, along with Buck, Tarabal, and many others, were said to be missing and presumed dead. Mrala, however, felt that she knew Talisola was alive, as she would have would have felt it if she had died. With this, Mrala made an oath that she would do whatever it took to find her.\nLula Talisola was a human female with brown skin, brown eyes and dark brown hair styled in many braids. She was intelligent and skilled, but was unsure of herself due to her skills never having been tried, and was nervous about her first mission on Trymant IV, although she did not show her nervousness externally. She frequently looked out for her best friends, Farzala and Qort, when they got up to mischief. When she did go into action on Trymant IV, she naturally fitted into a leadership role with her fellow apprentices. When approaching the Nihil to request the use of their ship, she considered insisting on it first was \"asking nicely\" before resorting to violence after being fired upon. She also reassured Zeen Mrala that she had her back when helping the girl, who was a complete stranger, hold back falling hyperspace debris.\nTalisola was also quick to advocate that the Jedi had a duty to help Mrala rescue her friend Krix Kamerat, since she had helped them. She also comforted the Mikkian after she had been separated from Kamerat in the battle's aftermath, reassuring her that she and her friends would support Mrala if she needed it. She developed romantic feelings for Mrala, which were difficult for her to process because of the Jedi Order's rules on attachment. As such, despite it having been her life's dream up to that point, she requested to not be made a Jedi Knight when the chance arose, hoping to take more time to understand herself.\nLula Talisola had strong Force powers, being the top of her class in all subjects. She was skilled in lightsaber combat, being able to expertly deflect blaster bolts fired at her. She was also capable of telekinesis, being able to assist Zeen Mrala in holding back a large piece of falling debris and Force-push multiple individuals simultaneously. Talisola could also expertly pilot a rescue speeder.\nLula Talisola wore brown-and-ivory Jedi robes with golden accents and a blue sash. She wielded a blue-bladed lightsaber. She piloted a rescue speeder while assisting in the Trymant IV rescue effort.\nLula Talisola was first revealed in the announcement of the Star Wars: The High Republic multimedia project. Her last name was first revealed in a StarWars.com article on Padawan characters within the project. She made her first appearance in the comic book The High Republic Adventures  1.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lula_(disambiguation)",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/The_High_Republic_Adventures_(2021)_4",
  "/wiki/The_High_Republic_Adventures_(2021)_5",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic_Adventures_Free_Comic_Book_Day_2021",
  "/wiki/Star_Wars:_The_High_Republic_Adventures:_Back_Together_and_Away_Again",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic_Adventures:_Galactic_Bake-Off_Spectacular",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/Talk:Lula_Talisola",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Kantam_Sy",
  "/wiki/Yoda",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Naboo",
  "/wiki/Jedi_training",
  "/wiki/Jedi_Master",
  "/wiki/Torban_Buck",
  "/wiki/Padawan_Academic_Cruiser",
  "/wiki/Star_Hopper",
  "/wiki/High_Republic_Era",
  "/wiki/Nihil_conflict",
  "/wiki/Farzala_Tarabal",
  "/wiki/Qort",
  "/wiki/Trymant_IV_disaster",
  "/wiki/Trymant_system",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Force-sensitive",
  "/wiki/Zeen_Mrala",
  "/wiki/Attack_on_Trymant_IV",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Bralanak_City",
  "/wiki/Starlight_Beacon",
  "/wiki/Quantxi",
  "/wiki/Krix_Kamerat",
  "/wiki/Junk_Mavens",
  "/wiki/The_Force",
  "/wiki/Marchion_Ro",
  "/wiki/Spider_Cruiser",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Jedi_Knight",
  "/wiki/Elders",
  "/wiki/Barbatash",
  "/wiki/Vrant_Tarnum",
  "/wiki/Path_engine",
  "/wiki/Valo",
  "/wiki/Republic_Fair",
  "/wiki/Crashpoint_Tower",
  "/wiki/Lonisa_City",
  "/wiki/Ty_Yorrick",
  "/wiki/Ram_Jomaram",
  "/wiki/Bonbrak",
  "/wiki/Hragscythe",
  "/wiki/Drengir",
  "/wiki/Speeder_bike",
  "/wiki/Sanval",
  "/wiki/V-18",
  "/wiki/Attack_on_Valo",
  "/wiki/Ishnar_Ti-Kharatal",
  "/wiki/Takodana",
  "/wiki/Jedi_Temple_(Takodana)",
  "/wiki/Thermal_detonator",
  "/wiki/Vonduun_crab",
  "/wiki/Krix_Kamerat%27s_cell",
  "/wiki/Great_Jedi_Rumble_Race",
  "/wiki/Bibs",
  "/wiki/Dol%27har_Hyde",
  "/wiki/Battle_at_Dol%27har_Hyde",
  "/wiki/Knighting_ceremony",
  "/wiki/Unidentified_orphanage_(Naboo)",
  "/wiki/Planet",
  "/wiki/Jedi_Temple_(Endovar)",
  "/wiki/Endovar",
  "/wiki/Cruiser",
  "/wiki/232_BBY",
  "/wiki/Freighter",
  "/wiki/Legacy_Run",
  "/wiki/Hyperspace",
  "/wiki/Hetzal_system",
  "/wiki/Star_system",
  "/wiki/Emergences",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Galactic_Republic",
  "/wiki/Starship",
  "/wiki/Bravaisian",
  "/wiki/Trymant_IV",
  "/wiki/Rescue_speeder",
  "/wiki/Speeder",
  "/wiki/Pilot",
  "/wiki/Zygerrian",
  "/wiki/Hover_platform",
  "/wiki/Tromak",
  "/wiki/Elders_of_the_Path",
  "/wiki/Meeting_house",
  "/wiki/Spider",
  "/wiki/Death",
  "/wiki/Lightsaber",
  "/wiki/Unidentified_Nihil_member",
  "/wiki/Telekinesis",
  "/wiki/Force_push",
  "/wiki/Chagrian",
  "/wiki/Blood",
  "/wiki/Jedi_healer",
  "/wiki/Gigoran",
  "/wiki/Cham_Cham",
  "/wiki/Republic_rescue_fleet",
  "/wiki/Limb",
  "/wiki/Republic_medical_frigate",
  "/wiki/The_galaxy",
  "/wiki/Standard_week",
  "/wiki/Holoprojector",
  "/wiki/Estala_Maru",
  "/wiki/Avar_Kriss",
  "/wiki/Jedi_Initiate",
  "/wiki/230_BBY",
  "/wiki/Corellia",
  "/wiki/Battle_on_Corellia",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Braid",
  "/wiki/Mikkian",
  "/wiki/Force_power",
  "/wiki/Lightsaber_combat",
  "/wiki/Jedi_robes",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/StarWars.com",
  "/wiki/The_High_Republic_Adventures_(2021)_1",
  "/wiki/The_High_Republic_Adventures_(2021)_2",
  "/wiki/The_High_Republic_Adventures_(2021)_3",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/The_High_Republic_Adventures_(2021)_7",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_9",
  "/wiki/The_High_Republic_Adventures_(2021)_10",
  "/wiki/The_High_Republic:_Trail_of_Shadows_2",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/Han_Solo_%26_Chewbacca_4",
  "/wiki/Category:Images_of_Lula_Talisola",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Exegol,_the_Unknown_Regions,_and_Wild_Space",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Accessories_and_Structures",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_The_Fallen_Star"
 ]
}