{
 "name": "Luleo_Primoc",
 "display_name": "Luleo Primoc",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gallusian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Luleo Primoc was a musician who performed on the First Light in 10 BBY. The tiny Gallusian was a chart-topping singer with hits such as \"Your Love is Gravy\" and \"Carve Your Name in My Heart\" in the years before the Clone Wars and was also known for starring in a series of holomovies while wearing a dashing humanoid exo-suit. When performing aboard the First Light, he sang from inside a repulsorlift-fitted flask filled with formaldehyde and was paired with bestselling recording artist Aurodia Ventafoli. Although past his prime, Primoc was still favored by retro-collectors and enthusiasts. At one point, Primoc also recorded his own version of the classic Huttese holiday jingle \"Joh Blastoh.\"\nLuleo Primoc first appeared in the 2018 film Solo: A Star Wars Story, and was identified by name in Solo: A Star Wars Story The Official Guide, written by Pablo Hidalgo. Primoc's name is a tuckerization of Louis Prima, a musician who also served as the character's alto temp voice during production. While Prima initially sang the song \"Chicken in the Pot\" in a language that composer John Powell found on the Internet, a linguist converted the lyrics to another language and Prima re-recorded the track. In the final cut of the film, Primoc was performed with a lower pitch by another singer at director Ron Howard's request. John Powell stated that early concept art depicts Primoc's character as a chicken-like creature.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gallusian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Musician",
  "/wiki/First_Light",
  "/wiki/10_BBY",
  "/wiki/Your_Love_is_Gravy",
  "/wiki/Carve_Your_Name_in_My_Heart",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Holodrama",
  "/wiki/Humanoid",
  "/wiki/Repulsorlift",
  "/wiki/Aurodia_Ventafoli",
  "/wiki/Huttese",
  "/wiki/Joh_Blastoh",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tuckerization",
  "/wiki/Chicken_in_the_Pot",
  "/wiki/John_Powell",
  "/wiki/Ron_Howard",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/StarWarsKids.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Life_Day_Cookbook",
  "/wiki/Databank_(website)"
 ]
}