{
 "name": "Luminara_Unduli",
 "display_name": "Luminara Unduli",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mirial"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 19 BBY–18 BBY",
      "Stygeon Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.76 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi assault team",
      "Jedi assault team",
      "Galactic Republic",
      "41st Elite Corps",
      "41st Elite Corps"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Barriss Offee"
     ]
    }
   ]
  }
 ],
 "content": "Luminara Unduli was a Force-sensitive Mirialan female Jedi Master during the final days of the Jedi Order. She commanded the 41st Elite Corps of the Grand Army of the Republic, and was the master of Padawan Barriss Offee. Together, they fought in numerous battlefields of the Clone Wars, before Offee turned against the Jedi Order and bombed the Jedi Temple, much to the horror of Unduli.\nAt the end of the war, Unduli fought in the Battle of Kashyyyk. She was arrested and executed after the Dark Lord of the Sith Darth Sidious issued Order 66 and destroyed the Jedi Order. The Galactic Empire would later use her remains to attract and kill any Jedi that survived Order 66. One such trap was laid for Kanan Jarrus and the crew of the Ghost, who believed Unduli was alive and being imprisoned on Stygeon Prime. They mounted a rescue mission, only to discover that it was a trap by the Grand Inquisitor. The rebels escaped with the knowledge that Unduli was dead and spread the word to dispel the ruse, preventing any more deaths in her name.\nMany years after her demise, Unduli's voice was among many heard by the Jedi aspirant Rey Skywalker as she faced down Darth Sidious on Exegol, telling her to find the light.\nDuring her time as a Jedi, Luminara Unduli took on at least two Padawans, one being fellow Mirialan Barriss Offee; which was in keeping with the traditions of her people, as only Mirialan Jedi were able to train Mirialan Padawans due to a special agreement with the Jedi Order.\nDuring it, Unduli fought the Daa Security Forces on Ontotho along with five other Jedi.\nAt one point Offee was sent by her master Unduli to retrieve an old book. During the quest, she encountered a creature and many traps. When she finally reached the place where the book was, she picked up the book and it turned to sand. She later returned and told her master that she had failed. Unduli told Offee that she didn't fail because she never expected Offee to bring her back, it was about the journey and everything she did to find the book.\nAfter the assassination attempt on Naboo Senator Padmé Amidala, she attended a meeting between the Jedi Council and Supreme Chancellor Sheev Palpatine about the possibility of war between the Republic and the Separatists under Count Dooku. She also met a Jedi youngling, Caleb Dume, who saw her as a \"brave, compassionate, disciplined\" Jedi and who respected her greatly. Luminara later came to serve as a mentor for both Dume and Ahsoka Tano.\nDuring the Separatist Crisis, Unduli, along with Offee, sat in on a meeting between the Jedi Council and Supreme Chancellor Sheev Palpatine, who discussed the growing influence of the Secessionist Movement, and the threat of an imminent war between them and the Galactic Republic.\nLater, Unduli was present in Chancellor Palpatine's office along with other senators and Jedi as the issue of whether Palpatine should take supreme executive powers was debated.\nWhen it became apparent that a full-fledged military conflict between the Galactic Republic and the Confederacy of Independent Systems would occur, Obi-Wan Kenobi was captured by the Confederacy on Geonosis, and Unduli and her Padawan joined Master Mace Windu's quickly launched a rescue mission.\nHoused within the packed arena were Obi-Wan Kenobi, Anakin Skywalker, and Senator Amidala, who were to be tried and executed by the Confederacy leaders assembled on the world. As over two hundred Jedi crept into the arena, they ignited their lightsabers in a challenge to Count Dooku, the leader of the Confederacy, who was personally overseeing the planned execution. A heated but short battle followed; over half of the assembled Jedi Knights fell in battle before Dooku called his forces to a halt. After the Jedi survivors rejected an offer of surrender in exchange for their lives, Dooku prepared to order their deaths and his forces prepared to shoot them down. Unduli raised her lightsaber, prepared to die fighting, but she and the others were saved by the arrival of Grand Master Yoda, accompanied by the newly-created Grand Army of the Republic in several gunships. When the gunships landed, Unduli boarded one alongside Masters Saesee Tiin and Shaak Ti and was airlifted to safety.\nFollowing the battle, Unduli accompanied Masters Windu and Koon to a meeting with Chancellor Palpatine about rescuing Jabba the Hutt's infant son, Rotta. She was then given command of the 9th Assault Corps and its subordinate 41st Elite Corps, and began to work closely with Clone Commander CC-1004, nicknamed \"Gree.\" She and Offee fought against a Separatist ambush at Ilum four months into the conflict, leading to Yoda saving them both when the Ilum temple was nearly destroyed. During the Malevolence Campaign, Unduli dealt with Separatist reinforcements to prevent them helping General Grievous and his flagship from escaping. This prevented Unduli's fleet group from assisting Master Kenobi's and Skywalker's fleet from destroying both the Malevolence and Grievous. Then, only a few months later, she would face the cyborg General in person on Nadiem in the Outer Rim.\nLater on, Unduli traveled to Rodia to escort captured Viceroy Nute Gunray to Coruscant for trial. The Jedi Master was joined by Anakin Skywalker's Padawan, Ahsoka Tano. Aboard the Venator-class Star Destroyer Tranquility, Unduli spearheaded the interrogations of the viceroy, whose denial of information cost Tano her patience. The Padawan threatened Gunray with her lightsaber, and though Unduli scolded the Padawan for using fear as a weapon, the viceroy agreed to \"negotiate.\" Before any information could be gleaned, the Tranquility was attacked by Asajj Ventress and a battle droid squad, who had arrived to rescue Gunray.\nAfter Unduli and Clone Commander Gree managed to destroy the army of super battle droids, the Jedi Master sensed that Tano was in danger and rushed to meet with her. Unduli arrived to assist the Padawan in confronting Ventress, who was cornered. However, while \"surrendering,\" Ventress activated thermal detonators that she had planted in the Star Destroyer's reactor room, crippling the cruiser, and escaped to the ravaged engine room. Although Tano offered to help, noting her past run-ins with Ventress and stating that the assassin was \"too powerful for any one Jedi,\" Unduli unwisely pursued the assassin on her own, leaving Tano to guard Gunray.\nFinding and engaging Ventress in lightsaber combat, Unduli was hampered by a wound to the left eye early in the battle and was eventually trapped beneath several pipes the Dark Acolyte collapsed on her from the ceiling, though she put up a good fight nonetheless. As Ventress moved to deal the killing blow, the Jedi Master was saved by the timely arrival of Tano, who had decided to disobey her orders in the interest of helping Unduli. The Mirialan accepted the Padawan's help for the continuing duel, but in the end, Ventress escaped with Senate Commando Captain Faro Argyus, who had defected to the Separatists and freed Gunray from Republic custody. Unduli and Tano transmitted the signal of the Republic cruiser that the Separatists had used to escape the Tranquility to Jedi Master Kit Fisto, who tracked Gunray to the third moon of Vassek. Unduli apologized to Tano for not taking her advice before the Padawan departed to rendezvous with her own Master.\nUnduli later returned to Geonosis to help Masters Ki-Adi-Mundi and Obi-Wan Kenobi destroy Poggle the Lesser's new droid foundry there. She attended the mission briefing before the invasion made planetfall and interceded in Kenobi and Skywalker's casual sniping, reminding them that they had a battle to fight. Along with her Padawan, Barriss Offee, she joined Anakin Skywalker and Ahsoka Tano in the storming of the droid factory. While she and Skywalker acted as diversions, the two Padawans Offee and Tano made their way through the vast underground catacombs to destroy the factory. Unduli cut her way through dozens of battle droids alongside Skywalker, demonstrating her mastery of both her lightsaber and the Force, but was forced into a temporary retreat after the Separatists unveiled their new super tanks, whose ray shields and warhead launchers decimated the Republic ranks. Alongside Skywalker, Unduli placed explosives along the underside of the bridge the tanks were crossing and then watched as the detonation sent the tanks plummeting to their doom. She and Anakin then watched in horror as the factory exploded and collapsed with their Padawans inside; Unduli believed that Offee died and prepared herself to accept the loss, but Anakin insisted that they are still alive. He is proven right by a faint signal from Ahsoka underneath a large pile of rubble. Ecstatic to see her Padawan alive, Unduli congratulated both on the success of their mission but also counseled Skywalker on being prepared for the time when he would have to let his apprentice go.\nFollowing this, Unduli went in search of Poggle the Lesser, who had retreated into the catacombs of an ancient temple. While she and a trooper searched the temple, a sandstorm prohibited reinforcements from reaching their positions. While communicating with Masters Kenobi and Mundi via hologram, Unduli's clone trooper was killed by the undead hordes of the mysterious Hive Queen Karina the Great and Unduli cut the communication whilst turning to face her attackers. Having been knocked unconscious and captured, the Jedi Master was taken before Karina. Jedi Kenobi and Skywalker came to her rescue; they were not far off when Unduli regained consciousness and wrestled her way out of the zombies' reach, only to find her usually crippling moves had no effect on the undead warriors. Realizing what they were up against, she contacted Kenobi to warn him not to come after her but was cut off as the zombies overwhelmed her.\nUnduli was imprisoned in Karina's abode and was held in an energy trap as the Geonosians prepared to infect her with brain worms. However, Skywalker and Kenobi, who had disregarded her warnings and continued their search with the help of their clone troopers, came to the rescue. Unduli, much to her chagrin, nearly found herself infected due to Kenobi's eagerness to see how the process worked, but resigned herself under the hope that it was all part of the plan. With Kenobi and Commander Cody delaying the zombies and the Queen, Skywalker freed Unduli and the two captured Poggle. Cody and his troopers shot down the cave support, burying the Queen and taking Poggle prisoner. Unduli, along with Skywalker, Kenobi, and Mundi took Poggle to Coruscant. She and Skywalker allowed their apprentices to make supply run from Ord Cestus's medical station to Master Windu's forces on Dantooine.\nAfter Offee betrayed the Jedi Order out of anger at its involvement in the Clone War, Unduli was shaken by what her apprentice had done. To try to find solace, she focused her attention on the Wookiee city Kachirho, which had been damaged by Confederate attacks, on the planet Kashyyyk. As she focused on repairing the damages to city and preparing new defenses for it, she ultimately spent months preparing for the coming Separatist invasion of Kashyyyk. During the Outer Rim Sieges, she served alongside Yoda, Republic forces, and Wookiee warriors during the engagement she had been preparing for, directing her forces just prior to the battle's commencement. While on the Wookiee homeworld, she piloted a green Delta-7B Aethersprite-class light interceptor.\nUnduli led her forces into battle against the attacking Droid Army. In the midst of the battle, Darth Sidious issued Order 66, a command ordering all clone troopers to kill their Jedi commanders. Unduli evaded the fate that many of her fellow Jedi had, though for years it was believed she had been shot down by her troops on Kashyyyk. In actuality, Unduli had been taken into custody by the Empire. The Jedi Order was destroyed, and Sidious declared himself Emperor and transformed the Republic into the Galactic Empire.\nAfter a short time in the prison known as the Spire on Stygeon Prime, she was executed in her cell in the presence of the Grand Inquisitor, who then held her remains for future purposes of the Empire.\nAfter her death, rumors began to spread that Unduli had survived the Clone Wars and was still alive, with those rumors existing as of 5 BBY. In reality, the Empire used Unduli's remains to lure Jedi survivors into traps so they could be killed, corrupting the Mirialan Master's memory. One such trap was laid by the Inquisitor with Unduli's remains still held in the Spire. In an attempt to trick Jedi survivor Kanan Jarrus, who had previously gone by the name Caleb Dume, and the rebel crew of the Ghost into a trap, former Imperial Senator Gall Trayvis, a secret operative of the Empire, 'hacked' a HoloNet News transmission to proclaim that Unduli was being held in the Stygeon system. Jarrus and the crew determined that they would mount a rescue mission to save Unduli. Jarrus, who remembered Unduli as a compassionate and capable Jedi, especially wanted to find her as he believed she would be a better teacher for his apprentice, Ezra Bridger, than he had been.\nThe rebels infiltrated the Spire, with Jarrus and Bridger leading the search for the Jedi Master. They found the cell she appeared to be held in, where they saw a physical manifestation of her. Jarrus could sense her presence, but something about it felt wrong. Her physical manifestation  soon disappeared into a case on the wall, which contained Unduli's desiccating remains. It was at that moment that the Inquisitor revealed himself and attempted to kill the two Jedi, but the rebels were able to escape. The experience nonetheless helped teach Jarrus that he could train Bridger himself. Having survived the Inquisitor's trap, Jarrus resolved to spread the word that Unduli was dead and news of her imprisonment was being used as bait for exiled Jedi.\nDuring Jarrus's vision during his second visit to Lothal's Jedi Temple, a vision of Unduli's lightsaber was present in the Jedi Temple's dojo.\nSome time by 34 ABY, Luke Skywalker learned about Unduli and her fate, and wrote of her in his book, The Secrets of the Jedi.\nIn 35 ABY, during the Battle of Exegol, Unduli's voice was heard by Rey among the voices of many Jedi of the past who aided her with killing the resurrected Darth Sidious, with Unduli advising that the girl seek the light.\nA wise protector of the Galactic Republic and Jedi Order, Luminara Unduli was known as a Jedi Master of great patience, bravery, compassion, and discipline. She was held in great esteem by her colleagues and was a trusted advisor to both the Jedi Council and the Republic. Unduli had mastered control of her emotions as well as her physical abilities, making her a model Jedi. She was able to keep a cool head amid dangerous situations, even when about to be forcibly infected with brain worms, and refused to show anger or even raise her voice. Though confident in her abilities as a Jedi, she greatly underestimated the prowess of the assassin Asajj Ventress and was only saved by the timely arrival of Ahsoka Tano, whose advice she had disregarded. However, she was humble enough to admit her mistake and was genuinely thankful to Tano for rescuing her.\nAs she was about to be infected with a brain worm, Unduli displayed discomfort with the prospect but nevertheless was able to make a joke about whether it was part of Obi-Wan Kenobi's plan. Indeed, Unduli was humorous on occasion, at one point stifling a snort of laughter at Anakin Skywalker's \"simple logic\" approach to dealing with droids, and when she requested that some strategic planning be saved for her so she didn't feel left out. Even though she claimed to Skywalker that she was ready to let go of her Padawan whenever the time was right, Barriss Offee's treason shook Unduli and forced the Jedi Master to try to find solace on Kashyyyk.\nUnduli was an extremely powerful and skilled Jedi Master, with few able to match her. Her skill with a lightsaber allowed her to duel Asajj Ventress on an even footing even with one eye impaired. She was also skilled in unarmed combat, as demonstrated when she was disarmed and captured by undead Geonosian warriors, she was able to put up a decent fight despite being severely outnumbered and in handcuffs. Unduli possessed at least some knowledge of Form II, as she was able to recognize it when Ventress applied it against her in battle, and was also known to adopt the classic Form III combat stance when preparing to fight. Unduli wore black robes and a headdress along with brass-colored armbands and a sash, the latter two embossed with ornate symbols. She wielded a green-bladed lightsaber.\nUnduli's bones somehow still radiated her presence in the Force many years after her death, albeit corrupted slightly.\nUnduli wore Jedi Master robes with a tabard from her homeworld. She piloted a green Delta-7B Aethersprite-class light interceptor with the help of an astromech droid.\nLuminara Unduli was played by Mary Oyaya in Attack of the Clones and Fay David in Revenge of the Sith. She was voiced by Olivia d'Abo in Star Wars: The Clone Wars and The Rise of Skywalker. Unduli was originally to have been depicted in Star Wars: Episode III Revenge of the Sith being killed as part of Order 66, but this scene was cut along with the deaths of Barriss Offee and Shaak Ti. Unused footage from Attack of the Clones was going to be used for this appearance.\nThe female Jedi mentioned by Rafa Martez in The Clone Wars season 7 episode \"Dangerous Debt\" who talked to the sisters after their parents died is described as having dark robes and green skin like Unduli, but it has not been explicitly confirmed whether that was her or not.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Luminara_Unduli",
  "/wiki/Luminara_Unduli/Legends",
  "/wiki/Queen%27s_Hope",
  "/wiki/A_Jedi%27s_Duty",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_5",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Tales_from_Wild_Space:_The_Journey",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Mace_Windu_and_Other_Force_Users",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Exegol,_the_Unknown_Regions,_and_Wild_Space",
  "/wiki/Mirial",
  "/wiki/19_BBY",
  "/wiki/18_BBY",
  "/wiki/Stygeon_Prime",
  "/wiki/Mirialan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/41st_Elite_Corps",
  "/wiki/Barriss_Offee",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Padawan",
  "/wiki/Clone_Wars",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Imperial_Palace",
  "/wiki/Battle_of_Kashyyyk",
  "/wiki/Death",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Order_66",
  "/wiki/Galactic_Empire",
  "/wiki/Kanan_Jarrus",
  "/wiki/Spectres",
  "/wiki/Ghost",
  "/wiki/Spire_(Stygeon_Prime)",
  "/wiki/Duel_on_Stygeon_Prime",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Rey_Skywalker",
  "/wiki/Time",
  "/wiki/Jedi",
  "/wiki/Daa_Security_Forces",
  "/wiki/Ontotho",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Naboo",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Jedi_High_Council",
  "/wiki/Supreme_Chancellor",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Jedi_Initiate",
  "/wiki/Ahsoka_Tano",
  "/wiki/Separatist_Crisis",
  "/wiki/Emperor%27s_office",
  "/wiki/Geonosis",
  "/wiki/Mace_Windu",
  "/wiki/Count_of_Serenno",
  "/wiki/Luminara_Unduli%27s_lightsaber",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Saesee_Tiin",
  "/wiki/Shaak_Ti",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Rotta",
  "/wiki/9th_Assault_Corps",
  "/wiki/Clone_Commander",
  "/wiki/CC-1004",
  "/wiki/Ambush_at_Ilum",
  "/wiki/Jedi_Temple_(Ilum)",
  "/wiki/Malevolence_Campaign",
  "/wiki/Battle_near_the_Kaliida_Nebula",
  "/wiki/Grievous",
  "/wiki/Cyborg",
  "/wiki/Nadiem",
  "/wiki/File:IShouldHaveListened-CoD.ogg",
  "/wiki/Rodia",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Tranquility",
  "/wiki/Asajj_Ventress",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Thermal_detonator",
  "/wiki/Star_Destroyer",
  "/wiki/Cruiser",
  "/wiki/Assassin",
  "/wiki/Lightsaber_combat",
  "/wiki/Senate_Commando",
  "/wiki/Captain",
  "/wiki/Faro_Argyus",
  "/wiki/Consular-class_space_cruiser",
  "/wiki/Vassek",
  "/wiki/File:IfYouAreQuiteFinished-LaPR.ogg",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Geonosis_primary_droid_foundry",
  "/wiki/Hologram",
  "/wiki/Karina_the_Great",
  "/wiki/Ord_Cestus",
  "/wiki/Ord_Cestus_medical_station",
  "/wiki/Dantooine",
  "/wiki/Wookiee",
  "/wiki/City",
  "/wiki/Kachirho",
  "/wiki/Kashyyyk",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Wookiee_warrior",
  "/wiki/Luminara_Unduli%27s_Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Galactic_Emperor",
  "/wiki/Death_penalty",
  "/wiki/5_BBY",
  "/wiki/Gall_Trayvis",
  "/wiki/HoloNet_News",
  "/wiki/Stygeon_system",
  "/wiki/Ezra_Bridger",
  "/wiki/Lothal",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Jedi_Temple_dojo",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Luke_Skywalker",
  "/wiki/The_Secrets_of_the_Jedi",
  "/wiki/35_ABY",
  "/wiki/Battle_of_Exegol",
  "/wiki/Form_II",
  "/wiki/Form_III",
  "/wiki/Jedi_robes",
  "/wiki/Clothing",
  "/wiki/Homeworld",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Astromech_droid",
  "/wiki/Mary_Oyaya",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Fay_David",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Olivia_d%27Abo",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Rafa_Martez",
  "/wiki/The_Clone_Wars:_Season_Seven",
  "/wiki/Dangerous_Debt",
  "/wiki/Martez_family",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Destroy_Malevolence",
  "/wiki/Rookies",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Lair_of_Grievous",
  "/wiki/Holocron_Heist",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Weapons_Factory",
  "/wiki/Legacy_of_Terror",
  "/wiki/Brain_Invaders",
  "/wiki/Grievous_Intrigue",
  "/wiki/The_Deserter",
  "/wiki/Gungan_Attack",
  "/wiki/Almost_a_Jedi",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Secret_Weapons",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Ahsoka_%26_Padm%C3%A9",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Voices",
  "/wiki/Destiny_(episode)",
  "/wiki/Kanan_7",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/Droids_in_Distress_(book)",
  "/wiki/The_Secret_Jedi:_The_Adventures_of_Kanan_Jarrus:_Rebel_Leader",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Rise_of_the_Old_Masters",
  "/wiki/The_Inquisitor%27s_Trap",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_20",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Luminara_Unduli",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Sabine_My_Rebel_Sketchbook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Rebels_Recounted",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_III:_Revenge_of_the_Sith",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars:_Lightsaber_Battles",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_7",
  "/wiki/Star_Wars_Universe",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_8",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Delta-7_Aethersprite_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars_Bust_Collection_3",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Sixth_Brother",
  "/wiki/Raada",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/The_Wrong_Jedi",
  "/wiki/May_9",
  "/wiki/2020",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Breaking_Ranks",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Vision_of_Hope",
  "/wiki/May_12",
  "/wiki/2007"
 ]
}