{
 "name": "Lunar Shadow Captain",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "The Lunar Shadow Captain was a male Weequay who enjoyed frequenting the Jekk'Jekk Tarr; he was known to stay in the cantina until he lost consciousness, eventually stumbling back to his quarters in the flophouse located on the Nar Shaddaa Docks. On one such occasion he was approached by Meetra Surik, who had been asked by his Nikto crew to keep a watch out for their captain, as the air in the cantina was toxic for their species. Apparently the Lunar Shadow was due for departure and the crew was distressed that the captain would not return in time.\nThe player can enter the Jekk'Jekk Tarr without a spacesuit before the meeting with Visquis is triggered, providing that the player character is equipped with a breath mask; this way the Lunar Shadow captain can be contacted before the cantina patrons become hostile. Otherwise, if the meeting has been triggered, the captain will be approached by the spacesuit clad Mira.\nConversely, the Exile has the choice to convince the irritated crew members to abandon their wayward captain and hire the refugee Odis as their pilot. Either way, the captain cannot be killed and is the only patron of the Jekk'Jekk Tarr to remain neutral during the skirmish.\nIf the Mission to Nar Shaddaa mission has already taken place, it will be impossible to talk with the captain as the player is no longer able to enter the Jekk'Jekk Tarr.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Lunar_Shadow",
  "/wiki/Jekk%27Jekk_Tarr",
  "/wiki/Cantina/Legends",
  "/wiki/Flophouse",
  "/wiki/Nar_Shaddaa_Docks",
  "/wiki/Nikto/Legends",
  "/wiki/Species/Legends",
  "/wiki/Enviro-suit",
  "/wiki/Visquis",
  "/wiki/Breath_mask/Legends",
  "/wiki/Mira",
  "/wiki/Refugee/Legends",
  "/wiki/Odis",
  "/wiki/Pilot/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(First_Jedi_Purge)",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}