{
 "name": "Lunacca",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Wooden Wookiee"
     ]
    }
   ]
  }
 ],
 "content": "Lunacca was a Wookiee male from the planet Kashyyyk who worked as a fourth generation woodcarver. During the war between the Resistance and the First Order, he ran a stall called The Wooden Wookiee in the Merchant Row of Black Spire Outpost on the planet Batuu. Lunacca was responsible for carving many of the wooden drinking vessels used around the outpost, including those sold at Oga's Cantina with specific drinks.\nHe was an extremely skilled carver, being able to carve any object, from small trinkets to large sculptures, out of any type of wood. He made frequent trips back to his homeworld, including one at some point following the Battle of Crait, in order to bring back supplies, such as wroshyr wood, for his work. During those periods The Wooden Wookiee would temporarily close because Lunacca did not employ Batuuan locals to help with customer service. The Wooden Wookiee was a one-Wookiee operation and because most others on Batuu lacked the strength to carve wroshyr wood, Lunacca's customers could be guaranteed that his goods were carved by his own hands.\nLunacca was first created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Elee_%26_Me",
  "/wiki/Kashyyyk",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/The_Wooden_Wookiee",
  "/wiki/Planet",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/First_Order",
  "/wiki/Merchant_Row_(Batuu)",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Batuu",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Homeworld",
  "/wiki/Battle_of_Crait",
  "/wiki/Wroshyr_wood",
  "/wiki/Wroshyr_tree",
  "/wiki/Limb",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/May_31",
  "/wiki/2019",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu"
 ]
}