{
 "name": "Lur_Arka_Sulas",
 "display_name": "Lur Arka Sulas",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rundil ot Sulem"
     ]
    }
   ]
  }
 ],
 "content": "Lur Arka Sulas was a green-skinned male Twi'lek who lived on Outer Rim planet of Dantooine c. 3956 BBY. He worked for the rancher Rundil ot Sulem, and met an amnesiac Revan on his visit to the Jedi Enclave there.\nSulas worked for the rancher Rundil ot Sulem of the pastoral Outer Rim planet of Dantooine, serving as an aide and executor. When Rundil's daughter, Sasha, was kidnapped by Mandalorians raiders, Sulas was sent to search for her. His search had taken a number of years, and many sentients had often diverted him away or attempted to take advantage of him for their own greedy reasons. He was at the Jedi Enclave in 3956 BBY when an amnesiac Revan, along with Bastila Shan and their party, arrived after fleeing the destruction of Taris. He eventually asked them for help in locating her. Revan told him he didn't know who Sasha was but offered to find her.\nLater, aboard the Ebon Hawk the Rutian Twi'lek, Mission Vao, and the exiled Wookiee, Zaalbar, discovered a shortage of emergency ration supplies. After analyzing the scene, Revan concluded that the culprit must have been a sentient, and not a small animal. After searching the ship for some time, Revan cornered the stowaway in the Ebon Hawk's cargo hold. When Revan confronted the stowaway, he discovered them to be a young female human. The child spoke a strange form of Mando'a, and Revan quickly suspected that she may have been the child Sulas spoke of. Revan first attempted to communicate with her peculiar language, assuring her that she was safe, and that she would be returned home. Revan returned back to Dantooine, and informed Sulas of the situation. Sulas was initially hesitant to board the ship, due to his previous experiences with spacers. However, upon learning more about the stowaway, Sulas was sure that they were indeed Sasha. Sulas boarded the Ebon Hawk and spoke to Sasha, remarking on her linguistic difficulties. While Sasha was hesitant to leave with Sulas, Revan explained to her that she would be safe. Sulas left the ship with Sasha, and returned her to her parents, where he expected her to learn Basic.\nIf Sulas is not informed about Sasha before the destruction of Dantooine, the main quest, 'Alien Stowaway' cannot be completed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Rundil_ot_Sulem",
  "/wiki/Revan/Legends",
  "/wiki/Sasha_ot_Sulem",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/3956_BBY",
  "/wiki/Jedi_Enclave",
  "/wiki/Mandalorian/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Destruction_of_Taris",
  "/wiki/Taris/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Rutian/Legends",
  "/wiki/Mission_Vao",
  "/wiki/Wookiee/Legends",
  "/wiki/Zaalbar",
  "/wiki/Foodstuff/Legends",
  "/wiki/Rodent/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Human/Legends",
  "/wiki/Mando%27a/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_New_Essential_Chronology"
 ]
}