{
 "name": "Lureia",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 1042 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Industrial Heuristics"
     ]
    }
   ]
  }
 ],
 "content": "Lureia was a female Human who was born during the Republic Dark Age.\nLureia lived on a frontier world that continually changed hands during a conflict between the Sith Lords Daiman and Odion, and as a result of the invasions, all of Lureia's family were killed, except for her teenage sister. However, in c. 1032 BBY, when Lureia was aged about ten, her sister was also killed. For a week Lureia lived in panic, until she was discovered by talent scouts working for the company Industrial Heuristics, who believed that Lureia had the potential to become an expert at repulsorlift design. Lureia was subsequently sent to the planet Gazzari, to serve aboard an arxeum, a type of mobile university dedicated to war sciences, which Daiman had acquired from the Quermian Sith Lord Ayanos Bactra. However, the arxeum was destroyed during the Battle of Gazzari, and Lureia and the other prospective students fled the planet with the Jedi Knight Kerra Holt, aboard the mercenary transport Diligence. Whilst aboard the craft, Lureia spent all of her time in her bunk, folding and refolding a blue-colored headband that had belonged to her sister",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1042_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Industrial_Heuristics",
  "/wiki/Republic_Dark_Age",
  "/wiki/Second_Charge_Matrica",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Daiman",
  "/wiki/Odion",
  "/wiki/Death/Legends",
  "/wiki/1032_BBY/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Gazzari",
  "/wiki/Arxeum",
  "/wiki/Quermian/Legends",
  "/wiki/Ayanos_Bactra",
  "/wiki/Battle_of_Gazzari",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kerra_Holt",
  "/wiki/Mercenary/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Diligence_(New_Sith_Wars)",
  "/wiki/Knight_Errant_(novel)"
 ]
}