{
 "name": "Lusa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chiron"
     ]
    },
    {
     "name": "Died",
     "values": [
      "27 ABY",
      "Chiron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chironian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red-gold"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire Reborn",
      "Diversity Alliance",
      "New Jedi Order",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Lusa was a female Chironian from the planet Chiron. She joined the New Jedi Order after deserting the Diversity Alliance, and was killed by voxyn during the Yuuzhan Vong War.\nAs a child, Lusa was abducted by the Empire Reborn movement and interned on Lord Hethrir's worldcraft, where she attended the \"school\" there which propagated Empire Reborn propaganda. She was bullied by the Human captives there including the Helper Vram who made speciesist comments about cutting off her horns. In 14 ABY, she met the two children of New Republic Chief of State Leia Organa Solo, Jaina and Jacen, who had also been abducted.\nAfter failing a Force-sensitivity test where Hethrir deliberately made it impossible for non-Humans to demonstrate any Force-ability by dampening their Force abilities, she was consigned to slavery despite the protests of Jaina. Later, when the Solos, Luke Skywalker and Chewbacca confronted Hethrir and his Empire Reborn at Crseih Station, Lusa managed to break free of her captors and came to the aid of the Solo twins and Chewbacca by attacking several Proctors and Empire Youth.\nWith the defeat of the Empire Reborn, she was freed and returned to her homeworld and family though the experience gave her a prejudice against Humans which she would harbor for many years to come. Even Lusa's family was not able to understand her pain and she had a difficult time making friends or trusting anyone until she met the Diversity Alliance.\nAround 22 ABY, she met a few members of the alien-rights group, the Diversity Alliance. They had all experienced some form of humanocentrism expressed towards them by Humans—particularly Imperials—and also shared her hatred. Believing that they were trying to make the galaxy a better place for non-Human species and having found a sense of belonging, she joined them and was further indoctrinated by their propaganda which blamed Humans for all the galaxy's wrongs.\nAs she rose through the ranks of the Diversity Alliance, the leader Nolaa Tarkona began sending her on covert operations which included saving the lives of aliens, freeing slaves and overthrowing leaders who opposed the Alliance. Around 24 ABY, she was sent on a mission to sabotage the navicomputers of a Human-crewed geological survey ship which had accidentally destroyed a forest on the planet Kaisa and inadvertently wiped out the insectoid Buro people. Her job was to sabotage the vessel's navicomputer so that it would be lost when they emerged from hyperspace.\nHowever, following the mission, she felt a pang of guilt when she saw that one of the geologists had a teenage daughter. With her eyes opened to reality and her indoctrination washed away, Lusa went up to them as they were loading the sabotaged navicomputer aboard and admitted her guilt in sabotaging in it and placed herself at their mercy. Instead of receiving vengeance, the geologists forgave her and had the device repaired.\nFollowing that, the geologists offered to transport her wherever she wanted. She chose to go to Coruscant because she wanted to contact either Leia Organa Solo who had been re-elected the Chief of State or Jedi Master Luke Skywalker, who now headed the Jedi Praxeum on Yavin 4, and inform them about the true identity of the Diversity Alliance which had now categorized her as a traitor to their cause. It was from there that she went to Yavin 4.\nThere, at Skywalker's Jedi academy, she befriended him as well as the Solo twins and also formed a bond with Raynar Thul. She brought attention to the fact that the Diversity Alliance was not what it seemed, and she almost died when an undercover Bothan Alliance member shot her with a tranquillizer while she was resting in a river. Luckily, Skywalker came to her rescue and apprehended the assassin.\nLusa accompanied a New Republic Senate team exploring the claims made against the Diversity Alliance concerning the stockpiling of weapons for a war against Humans and the New Republic. With the defeat of the Alliance, she stayed at the academy to learn to focus her Force healing powers and become a Jedi.\nDuring the Yuuzhan Vong War, Lusa was resting in a field on Chiron when a voxyn struck her down.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chiron_(planet)",
  "/wiki/27_ABY/Legends",
  "/wiki/Chironian",
  "/wiki/Gender/Legends",
  "/wiki/Empire_Reborn",
  "/wiki/Diversity_Alliance",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Voxyn",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Lord/Legends",
  "/wiki/Hethrir",
  "/wiki/Worldcraft",
  "/wiki/Human/Legends",
  "/wiki/Helpers",
  "/wiki/Vram",
  "/wiki/Speciesism",
  "/wiki/14_ABY/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Darth_Caedus",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/House_of_Solo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Confrontation_on_Crseih_Station",
  "/wiki/Crseih_Station",
  "/wiki/Proctor_(Empire_Reborn)",
  "/wiki/Empire_Youth",
  "/wiki/Anti-Humanism",
  "/wiki/22_ABY/Legends",
  "/wiki/Humanocentrism",
  "/wiki/The_galaxy/Legends",
  "/wiki/Nolaa_Tarkona",
  "/wiki/24_ABY/Legends",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Kaisa",
  "/wiki/Buro",
  "/wiki/Hyperspace/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Solo_twins",
  "/wiki/Raynar_Thul",
  "/wiki/Bothan/Legends",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_Crystal_Star",
  "/wiki/Young_Jedi_Knights:_Delusions_of_Grandeur",
  "/wiki/Young_Jedi_Knights:_Jedi_Bounty",
  "/wiki/Young_Jedi_Knights:_The_Emperor%27s_Plague",
  "/wiki/Young_Jedi_Knights:_Return_to_Ord_Mantell",
  "/wiki/Young_Jedi_Knights:_Trouble_on_Cloud_City",
  "/wiki/Young_Jedi_Knights:_Crisis_at_Crystal_Reef",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/The_Women_Of_Star_Wars",
  "/wiki/Star_Wars_Galaxy_Magazine_12",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}