{
 "name": "Lushros Dofine",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Neimoidia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "above Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.93 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Lushros Dofine was the captain of the Providence-class carrier/destroyer Invisible Hand during the Clone Wars. Born to the Dofines of Neimoidia, he exhibited a cool demeanor not usually associated with his fellow Neimoidians, and so he rose through the ranks of his society with relative ease. He trained as a freighter captain in the Trade Federation, and in time, he was given command of a Lucrehulk-class battleship. In 22 BBY, he was present at the First Battle of Geonosis, and he aided General Grievous in retreating from the Galactic Republic's onslaught.\nDofine's actions at Geonosis earned him the respect of Grievous, who put him in command of the Invisible Hand. Dofine saw much combat during the Clone Wars, and the calmness he had exuded throughout his life served him well once again. The Neimoidian fought his last battle at the Republic's capital world, Coruscant. After Grievous had successfully kidnapped Supreme Chancellor Palpatine, Dofine began his retreat, but he was harried by both Jedi Knights that had boarded the ship, and Republic Star Destroyers that were engaging in broadsides with him. As the situation continued to sour, Dofine abandoned ship, but his escape pod was struck by stray turbolaser fire in the process, killing the captain instantly.\nBorn to the Dofine family of Neimoidia, Lushros Dofine hailed from a long lineage of successful and influential conservative negotiators within the Trade Federation. The uncanny ability of the Dofines to know just when to retreat at the negotiation table had saved the Federation billions over the years, so their standing with the conglomerate at the time of Lushros' birth was considerable. When he came of age, Dofine himself joined the Federation, and, following in the footsteps of his cousin Daultay Dofine, trained as a freighter commander. Despite the fact that he was preceded by his cousin, Dofine would constantly insist that he achieved his goals by his own volition. His calm demeanor helped him rise through the ranks of his society, although he earned the ire of some of his fellow Neimoidians in the process.\nBy 22 BBY, Dofine was captaining a Lucrehulk-class battleship, which was present at Geonosis when the Galactic Republic invaded, starting the Clone Wars. The core of Dofine's ship was on the Geonosian surface at the time, and was one of the last of its kind to leave the planet. One of the Confederacy of Independent Systems' generals, Grievous, was also late in evacuating, and so he left the planet on Dofine's ship. The Republic dispatched V-19 Torrent starfighters after the fleeing Confederate craft, but Dofine was more than able to hold them off, buying his compatriots more time to escape.\nGrievous was impressed with the way that Dofine had acquitted himself in the final hours of the battle, and when he took the Providence-class carrier/destroyer Invisible Hand as his flagship, he selected Dofine as the ship's captain. As the Clone Wars raged across the galaxy, Dofine saw combat in many engagements, but his calmness in the face of Grievous' intimidating personality allowed him to gain the respect of the Kaleesh general.\nIn 19 BBY, Grievous launched a surprise attack against the Republic's capital world of Coruscant. When Grievous himself left the Invisible Hand to kidnap Supreme Chancellor Palpatine from the planet surface, Dofine was left in command of the fleet as it engaged the forces of the Republic. Also aboard the ship was the leader of the Confederacy, Count Dooku. Grievous returned, his mission a success, but as the Invisible Hand prepared to leave Coruscant with the captive Chancellor, it was boarded by two Jedi Knights: Obi-Wan Kenobi and Anakin Skywalker. Dofine had already begun tracking their progress through the ship by the time that Grievous had reached the bridge.\nThe Invisible Hand soon had more dire problems to deal with, as the Venator-class Star Destroyer Guarlara was moving into attack position. Dofine engaged in broadsides with the enemy ship, but the resulting battery fire from the Star Destroyer damaged the Invisible Hand so severely that it began to plummet towards Coruscant's surface. The move took its toll on the ship's artificial gravity, prompting Dofine to order his OOM pilot battle droids to magnetize, lest they fall to the front of the bridge. The pilots were able to right the ship eventually, at the behest of Grievous, and they were able to turn their attention back towards the Jedi, who had succeeded in freeing Palpatine and killing Dooku. As they ventured through the ship's corridors in the hope of escaping, Dofine trapped them with ray shields, and Grievous had them brought to the bridge.\nGrievous' choice proved damaging: once on the bridge, the two Jedi were able to break free of their restraints and wreak havoc. Dofine, less than pleased with the situation, fled the bridge in panic, along with the rest of the crew, and boarded and then launched an escape pod before the general remotely launched the rest of them. The Invisible Hand was left to resume its fall towards Coruscant's surface, and while several of his colleagues, including the general and some OOM pilot battle droids, were picked up by other Confederate ships, Dofine's escape pod was struck by a stray turbolaser blast, killing the captain instantly.\nCool, calm, and collected, the unflappable Lushros Dofine was served well by his demeanor while serving both the Trade Federation and the Confederacy of Independent Systems. Although he did not make many friends among his fellow Neimoidians, Dofine's level-headed approach to crises made him, in the eyes of some, fearsome. Although the Dofine family already had a significant standing within the Federation, and his own cousin, Daultay, had already served as a captain, Dofine was quick to mention that his path was his alone. As a tactician, he was skilled enough to gain the respect of General Grievous, making him one of the few Neimoidians to do so, although he was unable to turn the tide at the Battle of Coruscant.\nLushros Dofine first appeared as an unnamed character in the opening scenes of George Lucas' Star Wars: Episode III Revenge of the Sith. In the film he was portrayed by Colin Ware and voiced by Ben Burtt. The character was later identified in the StarWars.com Databank. In 2007, James Lord elaborated on Dofine's story through the StarWars.com Hyperspace feature, \"What's The Story?\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Unidentified_Neimoidian_captain_(Invisible_Hand)",
  "/wiki/Lushros_Dofine",
  "/wiki/Star_Wars:_The_Saga_Collection",
  "/wiki/Neimoidia/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/File:WhatsTheSituation-ROTS.ogg",
  "/wiki/Captain/Legends",
  "/wiki/Providence-class_carrier/destroyer",
  "/wiki/Invisible_Hand/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Dofine_family",
  "/wiki/Freighter/Legends",
  "/wiki/Lucrehulk-class_battleship",
  "/wiki/22_BBY/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Turbolaser/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Time/Legends",
  "/wiki/Daultay_Dofine/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Core_ship/Legends",
  "/wiki/Planet/Legends",
  "/wiki/V-19_Torrent_starfighter/Legends",
  "/wiki/Kaleesh/Legends",
  "/wiki/File:AllBatteriesFire-ROTS.ogg",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Guarlara_(Venator-class)/Legends",
  "/wiki/Gravity/Legends",
  "/wiki/OOM_pilot_battle_droid/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Ray_shield/Legends",
  "/wiki/Pablo_Hidalgo",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Ben_Burtt",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/2007",
  "/wiki/James_Lord",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(novelization)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(unabridged_audiobook)",
  "/wiki/Dressing_a_Galaxy:_The_Costumes_of_Star_Wars",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_147"
 ]
}