{
 "name": "Luskin_Exovar",
 "display_name": "Luskin Exovar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lessuris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Sky-blue and silver"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Scout Service",
      "Republic Scout Service",
      "Exovar's Emporium"
     ]
    }
   ]
  }
 ],
 "content": "Luskin Exovar was a male Human scout from Lessuris who retired from the Republic Scout Service in anticipation of the Galactic Republic's downfall.\nBorn on the backwater world of Lessuris, Luskin joined the Republic Scout Service as a teenager. He excelled at his work charting dozens of new worlds and opening up entire sectors. Over time his efforts and adventures became the inspiration for phenomenal tales of death-defying bravery.\nAfter his official retirement, Exovar built Exovar's Emporium inside a mountain on the icy planet Neftali.\nAt some point Luskin struck back against the Galactic Empire, and using a laser cutter he was sheared the head off of an All Terrain Armored Transport. He would eventually mount the head on the entrance to his Emporium as both a trophy and, as the head was still functional, a defensive turret.\nLuskin was extremely extroverted and would bombard anyone within earshot with friendly inquiries, answers to unasked questions, and tangled-up tales from long ago. He would accentuate his quirky personality with sudden bursts of chaotic and unfocused activity. This was an act, however, and careful observation revealed that beneath the chaotic exterior was a hidden clarity born of a lifetime of experience.\nLuskin was very droid-friendly. Back when he was a scout, his droid companions were the only things he could really rely on, and this attitude had a profound effect on him being far more open and welcoming to droids than was normal. This attitude resulted in the majority of his staff at the Emporium being droids.\nLuskin had the survival and combat skills to make him one of the best scouts in the Service. In addition, he proved to be very successful with his business, and his Emporium was a huge success.\nLuskin Exovar was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.\nHe was designed as the owner of one of the featured places of interest.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lessuris",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Scout_Service/Legends",
  "/wiki/Exovar%27s_Emporium",
  "/wiki/Cohden_K%27Reye",
  "/wiki/Scout/Legends",
  "/wiki/Mountain/Legends",
  "/wiki/Neftali/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Laser_cutter/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997"
 ]
}