{
 "name": "Luthen_Rael",
 "display_name": "Luthen Rael",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Luthen Rael's network"
     ]
    }
   ]
  }
 ],
 "content": "Luthen Rael, code-named \"Axis\" by the ISB, was a human male antique dealer and rebel leader during the time of the Galactic Empire. Rael owned Galactic Antiquities and Objects of Interest on the galactic capital of Coruscant at the height of the Empire's reign. However, the gallery was little more than a front for an extensive rebel network and spy operation organized by Rael, who secretly worked against the Empire alongside others like Senator Mon Mothma and Saw Gerrera.\nBy 5 BBY, Luthen Rael ran a spy operation with Kleya Marki, a dedicated rebel who worked as an emissary, messenger, and enforcer for the cause. Rael also owned the Galactic Antiquities and Objects of Interest gallery on the upper levels of the galactic capital of Coruscant, of which Marki was the concierge.\nThat year, upon being contacted by Bix Caleen of the planet Ferrix's Caleen Salyard about the sale of an Imperial N-S9 Starpath Unit under the possession of Cassian Andor, Rael traveled to the world with his modified Fondor Haulcraft to meet with Andor. Andor claimed that he had stolen the Starpath unit from the Imperial Naval Base in Steergard, while Rael revealed that he had come to recruit the man, rather than to pursue the device. During their conversation, the two were ambushed by Preox-Morlana Corpos who were pursuing Andor as he had recently killed two of their number on the world Morlana One. With the help of an angered and close-knit Ferrix community, Rael and Andor worked together to defeat the Pre-Mor forces. Mounting a speeder bike, the two then covertly departed Ferrix aboard the former's ship.\nThe two traveled to Aldhani, where Rael offered Andor a job, upon the completion of which he would pay Andor 200,000 credits: Andor was to join a group of rebels on a mission to attack the Galactic Empire's Aldhani Garrison. Rael successfully persuaded Andor that this was a chance to truly hurt the Empire, with Andor taking on the alias \"Clem\" for the purposes of the mission. Rael then negotiated with the Aldhani rebel leader Vel Sartha, telling her that \"Clem\" was critical support for the vulnerable group and that she could use him as a replaceable member. Sartha eventually relented and allowed Clem to join.\nRael then departed for Coruscant, changing his attire and donning a wig. In his gallery, Rael met with Senator Mon Mothma, under the guise that she was buying a gift for her husband. In reality, Mothma was secretly leading anti-Imperial efforts alongside Rael, and was meeting with him to alert him that she was going to bring someone else into the rebels' inner circle. Rael advised against this, believing it would get them caught, but Mothma stood by it.\nFollowing the successful completion of the heist on Aldhani, which he learned from a client in his shop, Rael instructed Marki to arrange for Cassian Andor, the last remaining connection to him to be eliminated.\nSome time later, Marki advised him to sever all remaining loose ends along with Andor, including the frequency connection with Bix Caleen on Ferrix -now occupied by the Galactic Empire. Luthen agreed and reluctantly shut down the connection.\nRael departed Coruscant the same day and traveled to Segra Milo where he met with Saw Gerrera to discuss a new mission. He asked Saw to meet with a connection of his, Anto Kreegyr, who had been probing the Imperial power station in Spellhaus and had found some weak spots which Saw's rebels could exploit to destroy it. Saw refused to risk the safety of his men for someone he did not know, to which Rael protested that he was trying to make Saw join the greater rebel movement and finally start working with others. Saw ultimately rejected the offer and Rael left empty handed.\nLuthen Rael was a human male with grey hair and light skin. The man was skilled at discerning valuable finds and labored to personally traverse the galaxy for pieces necessary to achieve his goals. He was capable of adopting numerous guises and collected a wide range of exotic tools.\nAs a curator of all manner of exotic tools, Rael flew a cleverly modified Fondor Haulcraft and kept a collection of various items in his gallery on Coruscant. He wore a Kuati Signet that had a personal significance as a necklace, and additionally kept a vast array of clothing aboard his ship to allow for a quick change of attire.\nLuthen Rael is portrayed by Stellan Skarsgård. His first name was revealed in the subtitles for the first Andor trailer, and his last name was first shown in a LEGO set reveal during Celebration Anaheim.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Luthen_Rael%27s_network",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Antiquities_and_Objects_of_Interest",
  "/wiki/The_galaxy",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/Saw_Gerrera",
  "/wiki/5_BBY",
  "/wiki/Kleya_Marki",
  "/wiki/Standard_year",
  "/wiki/Bix_Caleen",
  "/wiki/Planet",
  "/wiki/Ferrix",
  "/wiki/Caleen_Salyard",
  "/wiki/Imperial_N-S9_Starpath_Unit",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Fondor_Haulcraft",
  "/wiki/Thief",
  "/wiki/Steergard_Naval_Yard",
  "/wiki/Steergard",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Preox-Morlana",
  "/wiki/Corpo",
  "/wiki/Death",
  "/wiki/Morlana_One",
  "/wiki/Pre-Mor_Enforcement",
  "/wiki/Speeder_bike",
  "/wiki/Starship",
  "/wiki/Aldhani",
  "/wiki/Credit",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_Garrison",
  "/wiki/Vel_Sartha",
  "/wiki/Clothing",
  "/wiki/Wig",
  "/wiki/Perrin_Fertha",
  "/wiki/Segra_Milo",
  "/wiki/Anto_Kreegyr",
  "/wiki/Spellhaus",
  "/wiki/Hair",
  "/wiki/Galaxy",
  "/wiki/Pilot",
  "/wiki/Kuati_Signet",
  "/wiki/Necklace",
  "/wiki/Stellan_Skarsg%C3%A5rd",
  "/wiki/LEGO",
  "/wiki/Celebration_Anaheim_(2022)",
  "/wiki/Category:Images_of_Luthen_Rael",
  "/wiki/Kassa_(episode)",
  "/wiki/That_Would_Be_Me",
  "/wiki/Reckoning_(episode)",
  "/wiki/Aldhani_(episode)",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)"
 ]
}