{
 "name": "Luuke Skywalker",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Wayland"
     ]
    },
    {
     "name": "Born",
     "values": [
      "9 ABY",
      "Wayland"
     ]
    },
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Wayland"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.72 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Joruus C'baoth"
     ]
    }
   ]
  }
 ],
 "content": "Luuke Skywalker was a genetic clone of the Jedi Knight Luke Skywalker, grown from cells extracted from the hand Skywalker lost during his duel with the Dark Lord Darth Vader on Cloud City. Skywalker's hand and lightsaber were recovered by Vader and taken to Emperor Palpatine's Mount Tantiss storehouse on the planet Wayland. In 9 ABY, the insane clone Jedi Master Joruus C'baoth performed a mind trick on Imperial Grand Admiral Thrawn's subordinate, Captain Gilad Pellaeon, ordering him to make a special clone for him. The clone that later became Luuke Skywalker was grown in secret from sample B-2332-54, the sorting code assigned to Luke Skywalker's hand. The clone was grown in a Spaarti cloning cylinder over the period of less than a month. When he was ready, the clone was given Jedi training by C'baoth and over time became little more than an extension of C'baoth's will.\nC'baoth wished to turn Skywalker and the former Emperor's Hand Mara Jade over to the dark side and take them on as his apprentices. When they refused, C'baoth incapacitated Jade and unleashed the Luuke clone, determined to have at least one Skywalker serve him. The clone, wielding the lightsaber Skywalker lost in Cloud City, faced off against Skywalker in the Emperor's throne room at Mount Tantiss. The clone's presence caused a buzzing pressure to form within Skywalker's mind, and Skywalker was constantly put on the defensive as the clone attacked with vicious thrusts of his lightsaber. The clone proved to have a similar proficiency in lightsaber dueling and Force techniques as Skywalker, utilizing Force attacks such as lightsaber throw. Eventually, Skywalker's sister, Leia Organa Solo, entered the throne room but was quickly neutralized by C'baoth. As Skywalker continued to lose ground to the clone, Jade found an opportunity to recover Organa Solo's lightsaber. Jade was able to slip under the clone's guard and kill him, and C'baoth was killed shortly thereafter. However, the entire experience went on to traumatize Skywalker in the days following.\nLuuke Skywalker was created from tissue cells taken from the severed hand of Luke Skywalker, which was lost along with Skywalker's lightsaber during a duel with the Dark Lord Darth Vader on Cloud City in 3 ABY. The hand and lightsaber were discovered in a pile of scrap by an Ugnaught named Groggin in Cloud City's Smelting Core D, who intended to melt the lightsaber down for metal. Vader intervened and took both the severed hand and the lightsaber as trophies for Galactic Emperor Palpatine. As Vader boarded his shuttle to leave Cloud City, he briefly contemplated creating a clone of Skywalker from the severed hand to serve as his own apprentice. However, Palpatine discovered Vader's deception and ordered him to bring Skywalker's severed hand and lightsaber to his private storehouse at Mount Tantiss on Wayland. Vader personally presented the hand and lightsaber to Palpatine, where they were added to the Emperor's personal collection.\nSix years later, Grand Admiral Thrawn returned from the Unknown Regions in a campaign to crush the New Republic and rebuild the Empire, and formed an alliance with the Guardian of Mount Tantiss, a mad Jedi clone named Joruus C'baoth. C'baoth, through the use of a mind trick, ordered Thrawn's subordinate, Captain Gilad Pellaeon, to secretly create a clone for himself inside Mount Tantiss's cloning facilities using sample B-2332-54, the sorting code for Luke Skywalker's severed hand. C'baoth then erased the order from Pellaeon's memory in order to make sure that the captain would never report it to Thrawn.\nThe clone that later became Luuke Skywalker was grown in a Spaarti cloning cylinder in under one month, was trained to be proficient in the Jedi arts, and was eventually put under C'baoth's total control.\nThe clone's abilities were soon tested when C'baoth summoned him to the Emperor's throne room on Mount Tantiss, which had recently been infiltrated by the original Luke Skywalker, now a Jedi Knight, with the help of former Emperor's Hand Mara Jade. When C'baoth realized he could not turn Skywalker to the dark side, he struck Jade with Force lightning and introduced the clone. At C'baoth's command, the clone, dressed in a brown robe and concealed by the light of a hologram next to him, unclipped a lightsaber from his belt and began moving toward Skywalker and Jade. The lightsaber the clone wielded was Skywalker's first, retrieved from Cloud City and stored at Mount Tantiss along with his hand. The clone's presence caused a buzzing pressure to form against Skywalker's mind and gave the Jedi a disturbing sense of familiarity. Skywalker was quickly reminded of his confrontation in the Dark Side Cave on Dagobah with the Dark Spirit, a Force manifestation of himself that he had dueled, and the clone Luuke finally revealed his face to the Jedi. Skywalker's mind froze in shock as he gazed upon a face that was his own, the buzzing pressure in his mind continuing to grow. C'baoth disclosed the clone's origins and claimed that whichever Skywalker defeated the other would be the one to serve him.\nCatching Skywalker off guard, the clone ignited his lightsaber and began aggressively swinging his blade toward Skywalker's chest. As Skywalker attempted to block with his own lightsaber, the force of the clone's attack nearly threw the Jedi off balance. When Skywalker retreated to a raised guard platform at the lower level of the throne room, the clone followed through with a lightsaber throw, which sliced halfway through the platform, causing Skywalker to perform an unsuccessful backflip onto the ground. The clone retrieved his lightsaber and once more engaged Skywalker. He hurled his lightsaber at Skywalker when the Jedi leaped up to a nearby catwalk. The saber barely missed Skywalker but sliced through most of the catwalk and the support struts holding it to the ceiling. Skywalker attempted to Force-pull the clone's falling lightsaber to himself but was thwarted by C'baoth, who stopped the lightsaber in midair and insisted that the duel be fought fairly. The clone had been standing still the whole time, knowing precisely what his master was doing. Skywalker threw his own lightsaber at the clone's, intending to destroy the clone's weapon. However, C'baoth intervened once again and threw an object at Skywalker, which caused the Jedi to miss and lose his mental grip on the clone's lightsaber. The clone recovered his lightsaber and raised it to an en guard position as a weary Skywalker prepared to continue the duel.\nSkywalker's sister, Leia Organa Solo, along with her husband, Han Solo, and the smuggler Talon Karrde, found their way into the throne room during the battle. An attack from C'baoth left Organa Solo incapacitated, prompting Skywalker to aggressively attack his clone in a bid to finish the duel quickly and save his sister. The clone Luuke fell back before the onslaught, barely being able to block Skywalker's blows. The clone then retreated up a set of stairs to his master's side while Skywalker seemingly pursued him. Skywalker, however, switched his lightsaber off and attempted to bargain his own life with C'baoth for those of his comrades. As C'baoth conversed with Skywalker and Jade, the clone reignited his lightsaber and leaped toward Skywalker, who ignited his own weapon just in time to parry the clone's aerial attack. The clone drove Skywalker off the stairway and onto the floor below, and the two continued their fight on the lower level until Skywalker leaped back up to the main floor with the clone in pursuit. The clone then attacked Skywalker with vicious horizontal thrusts, slowly backing the Jedi against a wall. Jade managed to recover Organa Solo's lightsaber while C'baoth was distracted and charged at Skywalker's clone. The clone was aware of Jade's imminent attack but decided to take a gamble and finish off Skywalker first. As the clone swung his lightsaber for a finishing blow, Skywalker ducked, causing the clone's lightsaber to slice through a viewscreen mounted on the rock wall behind Skywalker. The electronic components of the viewscreen exploded in the clone's face, and he shrieked, staggering backward. Dazed and angry, the clone raised his lightsaber in attack toward Jade. The former Emperor's Hand ducked and struck the clone with a killing strike, thus fulfilling the last command given to her by Palpatine: to kill Luke Skywalker.\nThe death of the clone Luuke caused a deranged Joruus C'baoth to go on a rampage. Mara Jade was forced to slay the insane Jedi Master with the help of Luke Skywalker, who had been instantly relieved of the buzzing pressure in his mind after the death of his clone. After the duel, Skywalker gave the clone's lightsaber, his own first lightsaber, to Jade as a gift. Skywalker continued to be haunted by the duel with his clone, causing him several sleepless nights. He recorded his experience with his clone in a personal datapad journal written several days after the confrontation. In it, he described his fears about his own future and how restless it left him. Skywalker compared the clone to the spirit he fought on Dagobah, describing how both adversaries had his own strengths and weaknesses and were his equals in almost every way. Skywalker was disturbed at the thought that a nearly exact duplicate of himself could become, in his mind, evil. Skywalker continually wondered if the same potential was present in himself and whether one day he could fall to the dark side.\nPhysically, Luuke Skywalker was an exact duplicate of Luke Skywalker. Mentally, he was little more than a mindless drone, an extension of Joruus C'baoth's will. The clone was created for C'baoth's use as a tool, and he obeyed the insane Jedi Master's every command instantly. The clone was devoid of any sense of individuality and showed no recognizable sign of emotion until the end of his bout with Skywalker, when he shrieked and attacked Mara Jade in fury after a viewscreen blew up in his face. Skywalker considered the clone to be thoroughly evil, a twisted perversion of himself.\nLuuke Skywalker had much of the same proficiency in application of the Force and lightsaber dueling as the original Luke Skywalker. During the duel at Mount Tantiss, Skywalker found himself constantly matched by the clone. Their abilities were nearly equal, though the clone's presence caused a pressure to form in Skywalker's mind, giving the clone a slight advantage. The clone's lightsaber techniques utilized vicious, aggressive thrusts, and he was able to synchronize with C'baoth's mind, allowing him to carry out the Jedi Master's will instantly. The clone was adept in several telekinetic Force techniques, including Force jumping, pulling, and lightsaber throwing.\nLuuke Skywalker was created by Timothy Zahn in 1993 for The Last Command, the third and final novel in the Thrawn Trilogy. His background was expanded upon in The Last Command Sourcebook, written by Eric S. Trautmann and published in 1994. The clone later made an appearance in the final issue of The Last Command comic book adaptation in 1998.\nA slight discrepancy exists in the nature of the clone's death. The Last Command describes Mara Jade as striking the clone down with Leia Organa's lightsaber. However, the comic book adaptation of the novel depicts Jade stabbing the clone through the chest.\nOn April 1 2012, Luuke Skywalker featured in \"An Apology\", a non-canon short story written by Timothy Zahn that was posted on the Random House genre website Suvudu as an April Fools' Day joke. The story was presented as an epilogue to the Fate of the Jedi novel series and was recounted from the first-person perspective of Luuke, as an in-universe recollection of his life. According to the story, Luuke was secretly selected by Grand Admiral Thrawn to take Luke Skywalker's place among the New Republic hierarchy, and during Mara Jade's duel against Luuke on Mountain Tantiss in The Last Command, the former Emperor's Hand inadvertently killed the real Luke Skywalker and Luuke subsequently took the Jedi's place, pretending that he was the original Luke. According to the text that accompanied the story, this \"revelation\" rendered all appearances of Luke Skywalker in post–Last Command Star Wars media as appearances of Luuke.\nAn Apology went on to elaborate that after the clone's infiltration of the New Republic, Thrawn surreptitiously fed Luuke orders, and the Dark Jedi adapted well to his new role, although at times he struggled to accustom himself to Luke Skywalker's taste in food. Luuke went on to establish a new Jedi Order and founded a Jedi Academy on the moon Yavin 4. Thrawn requested that Luuke obtain tissue samples from the Sith spirit Exar Kun and the unorthodox Jedi Callista, and the clone failed to complete the task, although Luuke subsequently mollified the Grand Admiral by providing him with genetic samples from the crime lords Prince Xizor and Durga the Hutt. According to An Apology, Luuke later participated in the Black Fleet Crisis and the conflict surrounding the rediscovery of the Caamas Document, but the strains of war began to show on him and Thrawn considered replacing the Dark Jedi with a new clone. Over time, Thrawn gathered a collection of clones, and during the Yuuzhan Vong War, Luuke came to suspect that the Admiral was insane. Thrawn also began substituting clones with their original progenitors, as he had with Luke and Luuke, then imprisoning the progenitors inside the Grand Admiral's fortress in the Patagonia system. A replacement for Luuke, named Luuuke Skywalker, was eventually created by Thrawn, and Luuke planned to go forth to Patagonia, to accept his final fate.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Cloning/Legends",
  "/wiki/Joruus_C%27baoth",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Luke",
  "/wiki/Wayland",
  "/wiki/9_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Duel_on_Cloud_City/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Anakin_Skywalker%27s_second_lightsaber",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Mount_Tantiss/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_madness",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Sample_B-2332-54",
  "/wiki/Spaarti_cloning_cylinder",
  "/wiki/Standard_month/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Assault_on_Mount_Tantiss",
  "/wiki/Emperor%27s_throne_room",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Death/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Groggin",
  "/wiki/Smelting_Core_D",
  "/wiki/ST_321/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/New_Republic/Legends",
  "/wiki/Guardian_of_Mount_Tantiss",
  "/wiki/Jedi/Legends",
  "/wiki/Memory_rub",
  "/wiki/Force_lightning/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Dark_Side_Cave",
  "/wiki/Dagobah/Legends",
  "/wiki/Dark_Spirit",
  "/wiki/Force_vision/Legends",
  "/wiki/Force_Jump",
  "/wiki/Han_Solo/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Talon_Karrde",
  "/wiki/Viewscreen/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Timothy_Zahn",
  "/wiki/1993",
  "/wiki/The_Last_Command",
  "/wiki/Star_Wars:_The_Thrawn_Trilogy",
  "/wiki/The_Last_Command_Sourcebook",
  "/wiki/Eric_S._Trautmann",
  "/wiki/1994",
  "/wiki/The_Last_Command_6",
  "/wiki/The_Last_Command_(comics)",
  "/wiki/1998",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Shiak",
  "/wiki/April_1",
  "/wiki/2012",
  "/wiki/An_Apology",
  "/wiki/Canon",
  "/wiki/Random_House",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/New_Jedi_Order",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Force_ghost",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Callista_Ming",
  "/wiki/Crime_lord/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Durga_Besadii_Tai",
  "/wiki/Black_Fleet_Crisis",
  "/wiki/Caamas_Document_Crisis",
  "/wiki/Caamas_Document",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Fortress/Legends",
  "/wiki/Patagonia_system",
  "/wiki/Luuuke_Skywalker",
  "/wiki/Patagonia",
  "/wiki/The_Last_Command_(unabridged_audiobook)",
  "/wiki/The_Last_Command_1",
  "/wiki/West_End_Games",
  "/wiki/Mirror_Image",
  "/wiki/Jedi_Search",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/1995_Topps_Star_Wars_Galaxy_Series_3",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/So_You_Want_To_Be_A_Jedi...",
  "/wiki/Star_Wars_Galaxy_Magazine_13",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/InQuest_Gamer",
  "/wiki/Star_Wars_Episode_VII:_Rise_of_the_New_Republic",
  "/wiki/InQuest_Gamer_50",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_27",
  "/wiki/Star_Wars_Insider",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/The_Official_Star_Wars_Fact_File_86",
  "/wiki/The_Official_Star_Wars_Fact_File_107",
  "/wiki/The_Official_Star_Wars_Fact_File_115",
  "/wiki/Wizards.com",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/20_Most_Memorable_Moments_of_the_Expanded_Universe",
  "/wiki/Star_Wars_Insider_83",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Clone_B-2332-54",
  "/wiki/The_Emperor%27s_Trophy",
  "/wiki/Star_Wars_Galaxy_Magazine_11",
  "/wiki/Heir_to_the_Empire",
  "/wiki/The_Essential_Atlas",
  "/wiki/Great_ReSynchronization",
  "/wiki/Battle_at_Ukio",
  "/wiki/Battle_of_Bilbringi_(9_ABY)",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/The_Clone_Wars:_No_Prisoners"
 ]
}