{
 "name": "Luunti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Targen's gang"
     ]
    }
   ]
  }
 ],
 "content": "Luunti was a Rodian female who worked on the planet Nal Hutta as part of a gang lead by the Human Targen. In 3643 BBY, during the Cold War between the Galactic Republic and the Sith Empire, Luunti and her fellow gang members were hired to install listening devices in the room of the mercenary known as Red Blade, who was staying in the palace of the Hutt crime lord Suudaa Nem'ro. The Blade, who was actually an Imperial Intelligence agent called Cipher Nine, returned to her room while the gang were installing the devices and killed them.\nThe female Rodian Luunti worked on the planet Nal Hutta during the Cold War between the Galactic Republic and the Sith Empire. In the year 3643 BBY, she was a part of a gang of freelance criminals lead by the Human cyborg Targen, who were hired to install listening devices in one of the guest rooms in the Hutt crime lord Suudaa Nem'ros Palace. The room was being used at the time by a mercenary known as the Red Blade who had recently completed a number of tasks for Nem'ro's lieutenant Karrels Javis, although unknown to anyone in the palace the individual was actually an Agent of Imperial Intelligence known as Cipher Nine. Luunti accompanied Targen and two other gang members to the room while the Blade was out and the Rodian began installing the devices, including one under the mercenary's bed.\nTargen hurried Luunti as she worked, but the group were not quick enough and the undercover agent arrived before they were finished. Targen turned to greet the Red Blade, after which the agent attacked and killed all four gang members in the room, including Luunti.\nLuunti had green skin and purple eyes. As a Rodian, she lacked hair. She was willing to follow Targen's lead in attacking the Red Blade, a mercenary with a dangerous reputation.\nLuunti wore brown clothing and carried a blaster pistol while installing the listening devices in the Red Blade's room.\nLuunti was created for the 2011 BioWare MMORPG Star Wars: The Old Republic. She appeared in the quest \"Economies of Scale\" which is part of the Imperial Agent class's story on the planet Hutta. Players have the option to immediately attack the gang upon entering the room for dark side points, trying to make a deal with them for light side points or asking who hired them for no alignment points. This article assumes that players chose the dark side option as the Agent is an Imperial character, although attempting to talk with the gang still results in their deaths as they attack the player.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Targen%27s_gang",
  "/wiki/Planet/Legends",
  "/wiki/Human/Legends",
  "/wiki/Targen",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Listening_device/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Red_Blade",
  "/wiki/Nem%27ro%27s_Palace",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Imperial_Agent",
  "/wiki/Cipher_Nine",
  "/wiki/Standard_year/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Karrels_Javis",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}