{
 "name": "Luuuke_Skywalker",
 "display_name": "Luuuke Skywalker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.72 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "New Jedi Order",
      "Clone Army"
     ]
    }
   ]
  }
 ],
 "content": "Luuuke Skywalker was a clone of the Jedi Master Luke Skywalker, who died in 9 ABY, created by Grand Admiral Thrawn to serve as his agent in the galactic community, which the Admiral controlled secretly using a legion of clones to replace prominent people. After warding off the Lost Tribe of Sith when they emerged in 43 and 44 ABY, Thrawn's first clone of Luke, Luuke Skywalker, retired after serving Thrawn since the original's death. Luuke was replaced summarily with Luuuke, who inherited duties as the Grand Master of the New Jedi Order and a significant political persona. Luuuke would go on to assemble a Clone Army comprised of the copies whom Thrawn had made over the decades. Working with another clone, Streeen, Luuuke devised a time machine that he used to attack the galaxy during the Clone Wars.\nLuuuke Skywalker was a genetic clone of the Jedi Master Luke Skywalker created by Grand Admiral Thrawn to serve as his agent in the galactic community, supporting the reigning Galactic Federation of Free Alliances government and filling the role of Grand Master of the New Jedi Order as one of his many clone servants in similarly prominent positions. Luuuke was the replacement of another clone, Luuke Skywalker, who had fulfilled this purpose for decades after the original's death in 9 ABY, actually earning the position of Grand Master. Luuke switched successfully with Luuuke after dealing with the emergence of a Sith tribe in 43 ABY and 44 ABY.\nInheriting Luke Skywalker's life, Luuuke set out to unite the clones whom Thrawn had created to form a Clone Army in an attempt to rule the galaxy. Eventually, another clone, Streeen, and he created a time machine. The pair used this to transport the Army to the galaxy during the Clone Wars period, when they fought the Galactic Republic's Clone Army, as well as the Jedi Anakin Skywalker and Obi-Wan Kenobi.\nAs the replacement for Luuke Skywalker, Luuuke was his physical duplicate, genetically identical to the original Luke Skywalker. The long-deceased Skywalker was a Force-sensitive Human with blue eyes, fair skin, blond hair, and was 1.72 meters tall. Luuuke transitioned seamlessly to replace Luuke in the galactic community, appearing as Luke would have if he had survived to be sixty-three years old.\nLuuuke was mentioned in \"An Apology\", a non-canonical short story by Timothy Zahn that was released on April 1, 2012 as an April Fools' Day joke. In the context of the story, any appearance of Luke Skywalker following the Fate of the Jedi series would be Luuuke. Further, the article in which \"An Apology\" was published announced facetiously that Luuuke would star in upcoming novels such as Star Wars: The Clone Wars 2: Luuuke by Zahn. The provided cover of that novel pictured Luuuke, with an appearance based upon a preexisting image depicting Luke confronting the Dark Spirit during the events of Star Wars: Episode V The Empire Strikes Back. The novel serial, The Clone Wars 2 or Son of Clone Wars, was to continue releasing titles for perpetuity, and Luuuke's adventure with Streeen would have taken place in the seventeenth volume of the tale. Though he was considered indistinguishable from his predecessors, it was not made clear whether or not Luuuke maintained the use of cybernetic prosthesis, which the original Luke required after losing his hand in a duel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/New_Jedi_Order",
  "/wiki/Clone_Army_(Luuuke)",
  "/wiki/Luuke_Skywalker",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Mission_to_Wayland",
  "/wiki/9_ABY/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Galactic_community",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Lost_Tribe_of_Sith_emergence",
  "/wiki/43_ABY",
  "/wiki/44_ABY",
  "/wiki/Grand_Master/Legends",
  "/wiki/Streeen",
  "/wiki/Time_travel/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Time/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Army/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Del_Rey",
  "/wiki/Erich_Schoeneweiss",
  "/wiki/An_Apology",
  "/wiki/Timothy_Zahn",
  "/wiki/April_1",
  "/wiki/2012",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Dark_Spirit",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Cybernetics/Legends",
  "/wiki/Duel_on_Cloud_City/Legends",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/June_3",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/The_Last_Command",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/19_BBY/Legends",
  "/wiki/File:Luuuke_basis.jpg"
 ]
}