{
 "name": "Lyda Skims",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 23 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.67 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "55 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue",
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Lyda Skims was a Human female who served as a Rebel Alliance spy, code named Skimmer. During the time of the Galactic Civil War, she was responsible for stealing information on a secret Imperial project called Project Dead Eye. While evading capture, Lyda transmitted information on the Dead Eye Prototype to the Alliance, and was eventually rescued by an operative sent to rescue her.\nAround 23 BBY, a Human female by the name of Lyda Skims was born to Lynn and Doyle Skims. She also had brother by the name of Athon. She spent her early life on Corellia, a planet in the Galactic Core, where she worked at her mother's textile facility. Her work there gave Lyda a broad knowledge of clothing design as well as engineering and droid repair. Lyda cultivated other interests during this time, including arts and modern dance.\nBoth Lyda's father and brother served on the side of the Alliance to Restore the Republic during the course of the Galactic Civil War against the Galactic Empire. Athon, who worked as a GR-75 medium transport pilot, was killed during a delivery to Alliance contacts on Alderaan at the time of its destruction by the first Death Star. Lyda's father suffered a similar fate in the subsequent Battle of Yavin, where he was killed while piloting a Y-wing starfighter during the assault on the Death Star. After the devastating losses of both her brother and her father, and the selling off of her mother's business, Lyda made the decision to join the Alliance in order to continue her family's tradition of service. Though she lacked significant combat skills, she served as a spy, code named \"Skimmer,\" on undercover missions for the Alliance in about 1 ABY.\nLyda's assignment initially comprised of relatively safe, boring undercover work, where she watched and reported on troop movements at an Imperial signals facility. During her time there, she became close friends with one of the Imperial officers, a supervisor of hers by the name of Wes. One night, a file got routed to her station. Believing it to be important, she stole Wes' security cylinder to decode it and make a copy. Upon doing so, she realized the report concerned details on Project Dead Eye, an experimental drug concocted by Imperial scientist Doctor Vacca to enhance the efficacy of frontline soldiers. There was not enough information in the report to duplicate the process of creating the formula. However, it did reveal that the drug required the use of Alderaanian Flora, a rare plant which used to grow on Alderaan. When the Empire discovered that Wes' security cylinders were used to access the Dead Eye plans, he realized that Lyda was the only one who could have stolen them.\nLyda believed Wes to be a good man who did not harbor much love for the Empire. In fact, she believed he would be willing to help the Rebellion once his tour was up. Nevertheless, Lyda understood that Wes would have no other choice but to turn her in. Otherwise, he himself would be accused of being a spy. With her cover blown, Lyda promptly went into hiding for a period of several weeks. Datadiscs outlining the initial report of her findings were intercepted by the Alliance, but were misappropriated by several underworld organizations, including the Meatlumps and various swoopers. Agents in the field had some luck recovering the disks, but many remained missing.\nIn an encrypted Rebel transmission, Rebel Alliance officer Bren Derlin, who was well acquainted with Lyda and her family, expressed a desire to return her to safety. The Rebel leader Princess Leia Organa, eager for more information on the project, also took a personal interest in finding Lyda before the Empire did. In fact, Moff Tiaan Jerjerrod of the Galactic Empire sent an emergency alert to all officers concerning Lyda. In this transmission, Moff Jerjerrod urged that any Rebels associated with the delivery of documents related to the secret research project be terminated with extreme prejudice. Still in hiding, though committed to her mission, Lyda attempted delivery of a datadisc at a designated drop zone. She was hampered, however, by a previously unknown Imperial patrol in the drop area. Rather than abort the mission, she attempted surveillance, but she was caught and charged with trespassing.\nAn Imperial transport was dispatched to deliver her for processing. However, when the transport experienced a mechanical failure, she used that opportunity to make her escape into the wilderness. Undeterred by these events, Lyda soon resumed surveillance of the Imperial signals facility. In an effort to get better footage of their operations, she climbed a fence and was detected. However, she this time managed to evade capture by fleeing back into the wilderness. By this point, the Empire turned to the public for assistance in capturing Lyda. The Imperial Security Bureau released a public news alert on the Imperial HoloVision, urging citizens to be on the lookout for the Rebel operative. The report admitted that she was responsible for stealing documents related to the Dead Eye project. Although her reconnaissance efforts were cut short, data acquired from the surveillance operation proved to be of the highest quality. One encoded datadisc fell into the possession of a Rebel sympathizer, who happened to be Lyda's friend.\nRebel Coordinators tasked with the responsibility of overseeing Lyda's progress instructed another operative of theirs to rendezvous with her friend and retrieve the disk. Lyda used an obscure encryption scheme for the disk, as it was the only crypto she had available, and she did not want to risk interception of the message. Upon being decoded by the Rebellion, the datadisc revealed Lyda's concerns. She did not think she could avoid capture for much longer, and believed it would only be a matter of time before she was spotted again. In the report, Lyda mentioned seeing many stormtroopers. The report also contained more information on the specifics of Project Dead Eye. Namely, that the powerful drug was being developed by the Alderaanian Dr. Vacca, and that by improving eyesight, the Dead Eye formula increased hand-eye coordination and reduced scope drift. As a result, the drug had the potential to turn the Empire's lowliest grunt into a super soldier. Lyda's report mentioned that given the destruction of his homeworld by the Empire, Vacca's loyalties could be turned in favor of the Rebellion. In the conclusion of her report, Lyda asked the Rebellion to send her love to her mother.\nAfter decoding the report, a Rebel Coordinator dispatched their operative to find Lyda and see if she was still alive. In the meantime, Lyda managed to remain in hiding until the operative tracked her down. Upon being located, Lyda was ambushed by a group of five thugs, however they were fended off by her fellow comrade. Lyda thanked her rescuer, and divulged additional details about her mission. Lyda, ready to conclude her assignment, instructed the operative to return to the Rebel Coordinator and send for a larger extraction team to return her to safety. The perilous mission evidently did not phase Lyda very much. Shortly after her rescue, Lyda already began requesting more assignments, much to the chagrin of the Rebel Coordinator tasked with rescuing her, who bemoaned her headstrong and risk-averse demeanor.\nLyda lacked any significant proficiency in combat. However, her technical skills, tenacious nature and fearlessness led her to be an exceptional choice for undercover missions. Though she possessed a great many qualities such as courage, resourcefulness and intelligence, her youthful exuberance often led her to go beyond the scope of her missions. Bren Derlin worried that her spunk had the risk of taking her too far. A Rebel Coordinator likewise criticized her for being headstrong, as well as impulsive in the face of danger. When Lyda found herself stranded in the wilderness, she worried that her luck had finally run out, and that her capture was inevitable. However, she maintained an upbeat demeanor throughout the ordeal, and had even felt a bit flattered at the measure of attention she had attracted from the Empire.\nDuring the time of her investigations into Project Dead Eye, Lyda Skims wore a beige and brown-colored cold weather jacket overtop a tan-colored dress blouse shirt. This simple outfit was complemented by a pair of beige dress slacks and similarly colored hide boots.\nLyda Skims was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. She was featured as part of \"The Cries of Alderaan\" quest line, an episodic story arc broken into three acts. Following the debut of The Cries of Alderaan Act 1: Codes on August 12, 2003, Lyda was mentioned in the game, albeit rather indirectly in the form of a series of encoded transmission fragments. These transmissions, when decoded, revealed the first name of \"Lyda,\" and the codename \"Skimmer.\" However, the transmissions were presented to the player as an unintelligible cryptogram puzzle designed by Chief Creative Officer, Raph Koster, who revealed that it would require the collaboration of players outside the game to solve. Players worked together for several days to decrypt the encoded text. As part of Publish 3 The Warren on October 8, 2003, Lyda Skims appeared for a limited time as an actual NPC for the Rebel version of the continued quest line. As part of this quest, Rebel players were tasked by Rebel Coordinators to meet with a friend of Lyda to retrieve an encoded datadisc. Players were then tasked to locate Lyda herself, fight off five thugs, and converse with her. Lyda also appeared in the Alliance Operative Field Dossier - Skimmer, a Star Wars Galaxies website article written from an in-universe perspective, as well as The Cries of Alderaan Act 2: Loyalties webcomic, published along with the launch of Act 2. Due to its nature as a limited-time event, Lyda Skims could no longer be encountered following the conclusion of the story's second act. Conflicting sources pose a discrepancy regarding Lyda's eye color. The Alliance Operative Field Dossier - Skimmer listed Lyda's eye color as blue, whereas the actual character model used for Lyda Skims depicted her with brown eyes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Spy/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Project_Dead_Eye",
  "/wiki/Dead_Eye_Prototype",
  "/wiki/Birthday/Legends",
  "/wiki/Lynn_Skims",
  "/wiki/Doyle_Skims",
  "/wiki/Athon_Skims",
  "/wiki/Planet/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Death/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/DS-1_Orbital_Battle_Station",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Code_cylinder/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Vacca",
  "/wiki/Soldier/Legends",
  "/wiki/Plant/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Meatlumps",
  "/wiki/Swooper/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Bren_Derlin/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Moff/Legends",
  "/wiki/Tiaan_Jerjerrod/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Imperial_HoloVision",
  "/wiki/Canon",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Alderaanian/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Scope/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Jacket/Legends",
  "/wiki/Shirt",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/The_Cries_of_Alderaan_Act_1:_Codes",
  "/wiki/August_12",
  "/wiki/Raph_Koster",
  "/wiki/October_8",
  "/wiki/Alliance_Operative_Field_Dossier_-_Skimmer",
  "/wiki/In-universe",
  "/wiki/The_Cries_of_Alderaan_Act_2:_Loyalties",
  "/wiki/The_Cries_of_Alderaan_Act_3:_Dead_Eye",
  "/wiki/Template:SWG_timeline",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance",
  "/wiki/August_14",
  "/wiki/January_24",
  "/wiki/2005"
 ]
}