{
 "name": "Lylee Anaraku",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow-green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "61st Mobile Infantry",
      "61st Mobile Infantry"
     ]
    }
   ]
  }
 ],
 "content": "Lylee Anaraku was a Mirialan male who served in the Rebel Alliance's 61st Mobile Infantry, also known as Twilight Company, during the Galactic Civil War. During the company's attack on the planet Allst Prime, he searched for the fellow soldier Brand, who rescued him from an Imperial All Terrain Scout Transport, or AT-ST walker. Anaraku was confident in Brand's abilities against the walker, although his comrade wondered how he would fare if she was not around. As he tried to encourage Brand to play a game of Lifters with him and the company member Briala after Allst Prime, his fellow soldier ignored him. Anaraku was then attacked and incapacitated by an Imperial, only for Brand to come to his aid again.\nDuring the Galactic Civil War, Lylee Anaraku served as a soldier in the Rebel Alliance's 61st Mobile Infantry, better known as Twilight Company. He became acquainted with the soldier Brand and the Twilight Company member Briala, who Anaraku planned to play the card game Lifters with. After hearing Briala call All Terrain Scout Transports—AT-ST walkers—\"Stalkers,\" Anaraku caught onto the nickname. Between 2 BBY and 0 BBY, Twilight Company attacked the backwater planet Allst Prime, targeting the Imperial outpost there.\nWhile soldiers of Twilight Company fought Imperial forces in the forests of Allst Prime, Anaraku chose to look for Brand, being ignorant of a maneuvering AT-ST. As the walker chose to fire at the Mirialan, Brand arrived and tackled him to the ground, rescuing him from the AT-ST's barrage. After Anaraku claimed that he was looking for her, she remarked about his ignorance to the AT-ST. He was confident the walker did not stand a chance against Brand, with his comrade being confused when he called it a stalker. When she asked what if she was not around to help him, Anaraku was confident she would be.\nAnaraku continued by inviting Brand to join him and Briala's game of Lifters after the fighting, Brand briefly saving him from a passing blaster shot between his sentences. His comrade then ignored his invitation and pushed past, crawling along a log to lock onto a target with her blaster. Anaraku continued pleading to her but she stopped listening to him. That was when he was attacked from behind by an Imperial. He called out to Brand but quickly fell unconscious. Brand, however, heard Anaraku calling to her and turned around, shooting the Imperial down before rushing in to his aid. She removed his head covering and found blood oozing from the back of his head.\nLylee Anaraku was a male Mirialan with green eyes and yellow-green skin. He had black, diamond-shaped cheek markings which spread across his skin. He was close to the fellow rebel Brand and became distracted by finding and talking to her during the fighting on Allst Prime, which nearly got him killed twice.\nLylee Anaraku wore brown colored clothing and carried a blaster rifle. He also wore a cloth head covering over his head.\nLylee Anaraku appeared through flashbacks in \"Inbrief,\" a short story written by Janine K. Spendlove that was first published in Star Wars Insider 161 on November 10, 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mirialan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Company",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Allst_Prime",
  "/wiki/Planet",
  "/wiki/Allst_Prime",
  "/wiki/Soldier",
  "/wiki/Brand",
  "/wiki/Galactic_Empire",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Walker",
  "/wiki/Lifters",
  "/wiki/Briala",
  "/wiki/Rebel_trooper",
  "/wiki/2_BBY",
  "/wiki/0_BBY",
  "/wiki/Allst_Prime_Imperial_outpost",
  "/wiki/Imperial_Army",
  "/wiki/Forest",
  "/wiki/Blaster",
  "/wiki/Clothing",
  "/wiki/Blaster_rifle",
  "/wiki/Inbrief",
  "/wiki/Janine_K._Spendlove",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/November_10",
  "/wiki/2015",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_2016_Del_Rey_Sampler",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Star_Wars_Insider_Special_Edition_2019",
  "/wiki/Hazram_Namir",
  "/wiki/Bounty_hunter",
  "/wiki/Battle_on_Vir_Aphshire",
  "/wiki/Battle_of_Yavin",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Declaration_of_the_Rebel_Alliance",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Titan_Magazines"
 ]
}