{
 "name": "Lyle Kullan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Lyle Kullan was a human male pilot who flew under the callsign Rogue Four in the Alliance to Restore the Republic's Rogue Squadron during the Galactic Civil War.\nDuring the Galactic Civil War, Lyle Kullan flew a T-65B X-wing starfighter as Rogue Four, alongside members of the Rogue Squadron under Commander Luke Skywalker during an attack on an Imperial shipyards in the Taris system. The squadron's mission was to fend off the TIE fighters, while A/SF-01 B-wing starfighters from Blade Squadron bombed the shipywards. Kullan was frustrated by fellow pilot and rookie, Ibti Myrak, who argued with Skywalker and refused to stay in formation. Eventually, this led to an argument between Kullan and the rookie, when Kullan was about to shoot an enemy TIE, Myrak impatiently cut in front of his X-wing and took the shot instead, nearly crashing into Kullan, causing Skywalker to chastize both pilots. Shortly after, the B-wings released their bombs and destroyed the shipyards. Back on Home One, Kullan and the other pilots tried to confront Myrak about her reckless behaviour, however the rookie wouldn't listen and stormed off.\nThree days later, Draedan pirates attacked the Alliance Fleet in the Cilpar system. Kullan and the rest of Rogue Squadron launched in their X-wings to protect the cruisers. Going against orders from Rogue Leader, Myrak, decided to leave formation and chase after a pirate vessel that attempted to escape, which led to her being ambushed. Fortunately, Kullan and the rest of the squadron came to her rescue and destroyed the pirates.\nAfter the Rebels lost contact with Kullan while he was on patrol in the Valo system, Skywalker and the rest of Rogue Squadron launched in their X-wings, only to find themselves ambushed by an Imperial II-class Star Destroyer and its TIEs. Kullan turned out to be an agent for the Empire and orchestrated the trap in order to capture Skywalker. However, back on Home One, grounded rookie pilot, Myrak, found Kullan's secret messages and stole an X-wing to warn the Rogues. On arrival, Myrak destroyed the tractor beam projectors that had caught onto Skywalker's X-wing, releasing him and allowing the squadron to chase after Kullan. Before Kullan could dock his X-wing in the Star Destroyer's hangar, the rebel fleet arrived under the command of Admiral Gial Ackbar, which forced the Star Destroyer to jump to lightspeed, leaving Kullan behind and taken into Rebel Alliance custody.\nLyle Kullan was a human male with black hair, dark-colored eyes and skin. He carried out the orders given by his squadron commander and worked towards the team goals of the unit, which contrasted with the singled-minded behaviour of the rookie pilot, Ibti Myrak, who disobeyed those orders, which Kullan didn't agree with. As a spy working secretly for the Empire, Kullan betrayed the trust of his fellow pilots and the Rebel Alliance, when he revealed his true nature to them.\nAs a pilot for the Alliance to Restore the Republic's Rogue Squadron during the Galactic Civil War, Lyle Kullan wore the standard orange flightsuit, with white-flight vest and life support equipment. He wore a white K-22995 light flight helmet with red stripes, that was also adorned the Alliance crest in red.\nLyle Kullan first appeared in \"Squad Goals, Part One\", which was the first of a two-part comic story published in the eleventh issue of the 2020 comic book series Star Wars Adventures. Written by Cavan Scott and illustrated by Manuel Bracchi, it was published on October 19, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Squad_Goals,_Part_One",
  "/wiki/Squad_Goals,_Part_2",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Spy",
  "/wiki/Rogue_Squadron",
  "/wiki/Rebel_pilot",
  "/wiki/Callsign",
  "/wiki/Rogue_Four",
  "/wiki/Galactic_Civil_War",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Commander",
  "/wiki/Luke_Skywalker",
  "/wiki/Destruction_of_the_Taris_shipyards",
  "/wiki/Taris_shipyards",
  "/wiki/Taris_system",
  "/wiki/Squadron",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Blade_Squadron",
  "/wiki/Ibti_Myrak",
  "/wiki/TIE_line",
  "/wiki/X-wing_starfighter",
  "/wiki/Home_One",
  "/wiki/Draedan",
  "/wiki/Pirate",
  "/wiki/Attack_in_the_Cilpar_system",
  "/wiki/Alliance_Fleet",
  "/wiki/Rogue_Leader",
  "/wiki/Valo_system",
  "/wiki/Ambush_in_the_Valo_system",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Tractor_beam_projector",
  "/wiki/Star_Destroyer",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Lightspeed",
  "/wiki/Flight_suit",
  "/wiki/Life_support",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Rebel_Alliance_starbird",
  "/wiki/Star_Wars_Adventures_(2020)_11",
  "/wiki/2020",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Cavan_Scott",
  "/wiki/Manuel_Bracchi",
  "/wiki/October_19",
  "/wiki/2021",
  "/wiki/Star_Wars_Adventures_(2020)_12"
 ]
}