{
 "name": "Lylos Tannon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Coral"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Coruscant Security Force",
      "Coruscant Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Lylos Tannon was a female Twi'lek who worked on the planet Coruscant as a police officer in the Coruscant Security Force during the period of the Galactic War.\nWhile working as a police officer with the Coruscant Security Force, Tannon investigated a cybernetics scam run by Doctor Zeke and his assistant Bolgm. Though she tracked their activities for weeks, she was unable to catch them in the act. It was shortly after the defeat of Revan, Tannon enlisted the help of Agents Theron Shan and Jonas Balkar of the Republic Strategic Information Service to bring them down. During a sting operation in the Dealer's Den, Tannon accused Shan of cheating at Sabacc which brought the attention of Bolgm since Shan had cyber implants. Though Shan was at first unaware of Tannon's identity, he went along with the ruse until Doctor Zeke showed himself. Tannon then distracted Bolgm and Shan charged at him, forcing him down, before Tannon knocked the criminal unconscious with the butt of her blaster. Shan meanwhile chased after Doctor Zeke and was joined by Balkar. Shan tackled the doctor and Tannon was able to place him in cuffs. Tannon thanked the agents for their help and before leaving the Dealer's Den, the three toasted to Tannon's hopeful promotion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/Galactic_War",
  "/wiki/Cybernetics/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Zeke",
  "/wiki/Bolgm",
  "/wiki/Battle_of_Yavin_4_(Galactic_War)",
  "/wiki/Revan/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Theron_Shan",
  "/wiki/Jonas_Balkar",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Dealer%27s_Den",
  "/wiki/Sabacc/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/One_Night_in_the_Dealer%27s_Den",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}