{
 "name": "Lynela Kabe-Oyu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Lynela Kabe-Oyu was a Kel Dor Jedi Master who was part of the Jedi Order during the High Republic Era. During an assassination attempt on the Hynestian royal family, Kabe-Oyu got the royal family to safety.\nLynela Kabe-Oyu was a Force-sensitive Kel Dor who served in the rank of Jedi Master of the Jedi Order a few years before the Cataclysm. Kabe-Oyu co-directed the Jedi Temple on the planet Hynestia with the Jedi Master Stellan Gios. They managed to negotiate an accord between the Hynestians and the Hutts at this time. On the day the agreement was to be celebrated at the royal palace, Gios' new Padawan Vernestra Rwoh arrived at the temple and interrupted the two masters in a scrimmage. After welcoming the young Mirialan, the three Jedi made their way to the palace to witness the celebrations there.\nIn doing so, Rwoh discovered that the service droids were about to serve the Hutts povo punch, even though the Hutts couldn't stand the povoberries. When Gios stopped the droid and apologized to the Hutts, the Hutts revealed that they had been waiting for the excuse to justify aggression against the Hynestians. With Gios preventing this, the Hutts and their subordinates began to attack the surrounding Hynestians, so Kabe-Oyu rushed to Queen Nyla and escorted her to safety. Gios and his padawan were able to stop the attackers and capture the Hutts, after which they handed them over to the Hynestians while they left the palace. The Kel'Dor complimented Rwoh on their quick wits, which had prevented worse from happening.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kel_Dor",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Assassination_attempt_on_the_Hynestian_royal_family",
  "/wiki/Hynestian_royal_family",
  "/wiki/Force-sensitive",
  "/wiki/Cataclysm",
  "/wiki/Temple_on_Hynestia",
  "/wiki/Planet",
  "/wiki/Hynestia_Prime",
  "/wiki/Stellan_Gios",
  "/wiki/Hynestian",
  "/wiki/Hutt_Clan",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Mirialan",
  "/wiki/Hutt",
  "/wiki/Nyla",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Lynela_Kabe-Oyu",
  "/wiki/First_Mission",
  "/wiki/The_High_Republic_Adventures_Annual_2021"
 ]
}