{
 "name": "Lynia_Delline",
 "display_name": "Lynia Delline",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Half-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Lavender"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Lynia Delline was a half-Human female who worked as an aide to Chief of State Mon Mothma during the early years of the Alliance to Restore the Republic. An attractive woman who had inherited some unusual abilities from her ancestors, she described her work as observing things for the Chief of State. After attending one of Mothma's rallies on the planet Agamar, she met a young Agamarian named Keyan Farlander, whom she helped join the Rebel Alliance. Delline followed Farlander's career as a starfighter pilot closely, and the two eventually began a relationship.\nLynia Delline was born in the years surrounding the fall of the Galactic Republic and grew up during the reign of Emperor Palpatine. She had a brother who became a starfighter pilot and was either injured or killed while flying. However, like much of her early life, Delline rarely spoke of what happened. She joined the Alliance to Restore the Republic at some point before the Battle of Turkana and became an aide to the Alliance's Chief of State, Mon Mothma. She would later describe her job as \"observing things\" for the Rebel leader.\nIn 1 BBY, Delline accompanied Mothma to the Outer Rim planet Agamar aboard the Mon Calamari Star Cruiser Independence. On Agamar, Mothma addressed members of the Agamar Resistance, hoping to persuade them to join the Rebel Alliance. After the Chief of State gave her speech, Delline moved among the assembled crowd, distributing copies of the Rebel pamphlet A Call to Reason, before assisting the other Rebels present with removing all evidence that the meeting had taken place. One of the Agamarians, Keyan Farlander, approached her and announced that he had decided to join the Alliance as a starfighter pilot, and Delline made sure he understood the commitment he was making before introducing him to a recruiter.\nDelline flew back to the Independence aboard the same shuttle as Farlander and, worried that the young Rebel would suffer the same fate as her brother, attempted to persuade him to serve the Alliance in a less dangerous way. Farlander, however, was determined to join the Alliance Starfighter Corps, and she respected his decision, wishing him luck before leaving him in the hangar of the Independence.\nMon Mothma left the Independence soon after and Delline accompanied her, only returning to the Alliance flagship toward the end of Operation Strike Fear, a major Imperial offensive against the Rebellion. The day Delline arrived, she learned that Farlander was due to be promoted to captain and attended a small promotion ceremony conducted by Commander Lagrane. After the ceremony, Farlander approached her and the two spoke briefly before Farlander left to attend a party being held by Red Squadron in his honor. Delline declined an invitation to join them, saying she had to get back to work, but gave Farlander a kiss on the cheek when she saw his disappointment. The two were quickly becoming friends and saw each other twice more before Delline's duties with Mothma took her off the ship once more.\nShe returned to the Independence again while the Alliance searched for information on a new Imperial weapon. There, she attended an Alliance High Command meeting with Mothma, Admiral Gial Ackbar, General Jan Dodonna and General Crix Madine, during which the group planned an operation to steal some Imperial communications satellites and use them to eavesdrop on Imperial transmissions in the Cron Drift. Farlander was waiting for Delline as she left the meeting, and the two conversed with Mothma before dining together in the ship's executive dining room. Delline's duties took her off the Independence the next day but, after the Battle of Yavin, she promised to spend more time with Farlander.\nDelline was an attractive half-Human woman with what Farlander described as a \"dazzling smile\" and lavender eyes that seemed to change color from different angles, yet conveyed a serious look. She was a private individual, who spoke little of her early life and what had happened to her brother. She did describe her ancestors as a little different, which had resulted in her having some unusual abilities. After meeting Farlander, she kept their meetings short and would not let them get too personal, even though there was a mutual attraction between them and she followed his career with interest when away from the Independence. Though she was generally unflappable, her professional shell could be broken, such as when she blushed after Mon Mothma once commented on her attraction to Farlander in front of the pilot. Delline was loyal to the Rebellion and had a great respect for Mothma's opinion.\nLynia Delline was created by Rusel DeMaria and first appeared in The Farlander Papers, a novella that accompanied the 1993 LucasArts video game Star Wars: X-Wing, and introduced the player character Keyan Farlander. Delline was unnamed in The Farlander Papers but reappeared in the narrative sections of DeMaria's X-Wing: The Official Strategy Guide, which expanded on the events of the previous book and in which she served as Farlander's love interest. Delline's history is left mysterious in the book, with just a couple of references to her past. The book's glossary states that she is half-Human, but the nature of her mixed ancestry is not explored and neither are the unusual abilities she inherited from her ancestors.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Chief_of_State_(Alliance)",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Agamar/Legends",
  "/wiki/Agamarian",
  "/wiki/Keyan_Farlander/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Battle_of_Turkana/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Independence/Legends",
  "/wiki/Agamar_Resistance",
  "/wiki/A_Call_to_Reason",
  "/wiki/Shuttle/Legends",
  "/wiki/Alliance_Starfighter_Corps",
  "/wiki/Hangar/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Operation_Strike_Fear",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Lagrane",
  "/wiki/Red_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/Starship/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/General/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Crix_Madine/Legends",
  "/wiki/Battle_of_Orron_III",
  "/wiki/Communications_satellite",
  "/wiki/Cron_Drift/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Rusel_DeMaria",
  "/wiki/The_Farlander_Papers",
  "/wiki/1993",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_X-Wing",
  "/wiki/X-Wing:_The_Official_Strategy_Guide",
  "/wiki/Human/Legends",
  "/wiki/X-Wing_Collector%27s_CD-ROM:_The_Official_Strategy_Guide",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Battle_of_Tatooine_(Galactic_Civil_War)",
  "/wiki/Great_ReSynchronization",
  "/wiki/0_BBY/Legends",
  "/wiki/Template:YearMathGRS"
 ]
}