{
 "name": "Lyra_Erso",
 "display_name": "Lyra Erso",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aria Prime"
     ]
    },
    {
     "name": "Born",
     "values": [
      "47 BBY",
      "Aria Prime"
     ]
    },
    {
     "name": "Died",
     "values": [
      "13 BBY",
      "Lah'mu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.70 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galen Erso's field team",
      "Erso family"
     ]
    }
   ]
  }
 ],
 "content": "Lyra Erso was the human female wife of the scientist Galen Erso. During the Clone Wars, Galen was arrested while researching kyber crystals on Vallt and charged with espionage by Confederate loyalists. While in confinement, Lyra gave birth to their daughter, Jyn. The three were rescued by Lieutenant Commander Orson Krennic, an old friend of her husband and a member of Supreme Chancellor Sheev Palpatine's top secret Death Star project.\nKrennic convinced Galen to continue his study in kyber crystals, and secretly used Galen's research in order to weaponize the crystals for use in the Death Star. Over the course of several years, Lyra became suspicious of Krennic's motivations for saving her family, and was able to persuade Galen to abandon his research into kyber crystals and flee Coruscant for Lah'mu with the help of Saw Gerrera. Four years later, Krennic and a squad of death troopers found the Erso family, and attempted to bring them all back to Coruscant. Lyra was killed by a death trooper when she threatened Krennic with a blaster.\nYears later, Jyn became part of the Alliance to Restore the Republic and stole plans to the Death Star battle station, Krennic's achievement. With Rogue One's sacrifice, Grand Moff Wilhuff Tarkin ordered the Death Star to fire at Scarif, wiping out Rogue One and all Imperial forces present, including Krennic, proving Lyra's final words correct.\nLyra Erso was born on Aria Prime in 47 BBY. She grew up as an only child and studied at the University of Rudrig in 29 BBY. Lyra's mother had to take out loans to fund her education, which Lyra later paid back from a job providing HoloNet footage. As a child, Lyra became friends with Nari Sable.\nLyra met Galen Erso at the age of 21, when she worked as a guide for Galen's team of scientists studying crystals on the planet Espinar. Lyra headed a survey team that discovered an intricate cave system and found crystals unique to the planet. Her expert knowledge of the cave system led to her being picked by Galen as his guide while he studied the crystals. While working together, Galen and Lyra fell in love and were married six months later on the planet Coruscant.\nThree years after marrying Galen, as the Clone Wars began, Lyra worked as Galen's lab assistant during their time researching kyber crystals on the planet Vallt for Zerpen Industries. Lyra had an ear for mimicry, and was able to communicate with the local Valltii in their native language better than her husband.\nIt was just before coming to Vallt, that Lyra became pregnant with her and Galen's daughter, Jyn. In 22 BBY, a coup occurred on the planet with the help of the Confederacy of Independent Systems. The previous ruler, King Chai, was killed and replaced by Marshal Phara, a Separatist ally. Galen and Lyra were caught while trying to escape Vallt, and Galen was arrested on fake charges of espionage against the Confederacy.\nWhile Galen was detained by the Vallti, Lyra was being held in the northern wing of the Keep in Tambolor. Jyn was born during this time in captivity; Galen was able to be present during the birth, even though he was being investigated for spying for the Galactic Republic.\nSix months after the birth of Jyn, the Erso family was rescued from confinement by Orson Krennic as part of a prisoner exchange program. Galen, Lyra, and Jyn were exchanged for Nan Pakota and Urshe Torr, two prominent Separatist scientists. After the exchange, Krennic ordered the Keep to be destroyed by Republic forces, resulting in the death of Galen and Lyra's research partners and friends, as well as many inhabitants of the planet.\nIn 18 BBY, Krennic offered her a job surveying a cave system on the planet Alpinn. At first she was skeptical of his offer, correctly assuming that he just wanted her out of the way. In the end, however she accepted the offer at Galen's encouragement, bringing Jyn along for the three-month survey.\nDuring their time on Alpinn, Lyra and Jyn stayed at the Alpinn archaeology camp with Lyra's old friend Sable, the pilot Has Obitt, and other researchers.\nThe caves turned out not to be kybers, but ranite, a related crystal.\nOn the way back to Coruscant, Lyra, Jyn, Nari, and Has stopped in orbit of Samovar and Wadi Raffa, two planets being mercilessly stripped of resources useful to the Empire. Lyra was greatly unsettled and angry at the destructive mining operation, taking Krennic to task for the environmental devastation.\nThe Erso family hid from Imperial forces for four years on the Outer Rim planet Lah'mu. While on the planet, the Ersos lead a self-sustaining life by growing crops and filtering water on their large homestead, procured for them by Saw Gerrera. Paranoid of being found by Krennic, the family created an elaborate plan to hide from Krennic, which included the building of an underground bunker beneath a small cave on their property. Krennic and a cadre of death troopers finally found the Erso family and confronted them. Lyra instructed Jyn to escape, but not before giving her a pendant of a kyber crystal fragment, which she had taken from Galen's research materials as they escaped Coruscant. She then fled and her husband Galen told Krennic that she had passed away during their time on Lah'mu. To Galen's dismay, however, Lyra returned and confronted Krennic and his troopers, threatening him with a blaster. Lyra was shot and killed by a trooper, causing her to shoot Krennic in his left shoulder postmortem, injuring him. Lyra's body was taken aboard Krennic's shuttle on a gurney on the Director's orders. Krennic informed Galen that they would have a funeral for Lyra as soon they reached Corscuant and would be honored.\nLyra studied the history and philosophy of the Jedi as an outgrowth of her reverence to the natural world. She agreed with the Order's values of generosity, compassion, and peaceful resolution. Lyra believed she was able to feel the Force, although she was unable to tap into it and use it like the Jedi. While living on Coruscant during the early years of the Empire, Lyra began wearing a red sash identified with sects of Force worshipers on planets such as Jedha. It was unknown whether she ever made contact with the Church of the Force which was developing on Coruscant at the same time.\nLyra Erso was portrayed by Valene Kane in the 2016 film Rogue One: A Star Wars Story. The first footage of Lyra Erso was seen in the second International trailer released on November 10, 2016.\nIn an earlier version of the film's script, Lyra was meant to be a Jedi, but this plot point was quickly abandoned because the creative team thought that it was better to examine how the lives of normal inhabitants of the galaxy were after the downfall of the Jedi Order following Order 66.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Parent",
  "/wiki/Jyn_Erso",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Lyra",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Darth_Vader_Annual_2",
  "/wiki/Rebel_Rising",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Aria_Prime",
  "/wiki/47_BBY",
  "/wiki/13_BBY",
  "/wiki/Lah%27mu",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galen_Erso%27s_field_team",
  "/wiki/Erso_family",
  "/wiki/Marriage",
  "/wiki/Scientist",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Clone_Wars",
  "/wiki/Kyber_crystal",
  "/wiki/Vallt",
  "/wiki/Spy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Reproduction",
  "/wiki/Rescue_of_Galen_Erso",
  "/wiki/Lieutenant_Commander",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Project_Stardust",
  "/wiki/Crystal",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Standard_year",
  "/wiki/Coruscant",
  "/wiki/Saw_Gerrera",
  "/wiki/Squad",
  "/wiki/Death_trooper",
  "/wiki/Death",
  "/wiki/Trooper",
  "/wiki/Blaster",
  "/wiki/0_BBY",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Battle_station",
  "/wiki/Rogue_One",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Scarif",
  "/wiki/University_of_Rudrig",
  "/wiki/29_BBY",
  "/wiki/Lyra_Erso%27s_mother",
  "/wiki/HoloNet",
  "/wiki/Nari_Sable",
  "/wiki/26_BBY",
  "/wiki/Planet",
  "/wiki/Espinar",
  "/wiki/Cave",
  "/wiki/Wedding_of_Lyra_and_Galen_Erso",
  "/wiki/25_BBY",
  "/wiki/Aide",
  "/wiki/Time",
  "/wiki/Zerpen_Industries",
  "/wiki/Ear",
  "/wiki/Valltii",
  "/wiki/Valltii_language",
  "/wiki/Language",
  "/wiki/22_BBY",
  "/wiki/King",
  "/wiki/Chai_(king)",
  "/wiki/Marshal",
  "/wiki/Phara",
  "/wiki/Capture_of_Galen_Erso_(Vallt)",
  "/wiki/Keep",
  "/wiki/Tambolor",
  "/wiki/Galactic_Republic",
  "/wiki/Standard_month",
  "/wiki/Prisoner",
  "/wiki/Nan_Pakota",
  "/wiki/Urshe_Torr",
  "/wiki/Republic_Military",
  "/wiki/18_BBY",
  "/wiki/Alpinn",
  "/wiki/Alpinn_archaeology_camp",
  "/wiki/Pilot",
  "/wiki/Has_Obitt",
  "/wiki/Ranite",
  "/wiki/Orbit",
  "/wiki/Samovar",
  "/wiki/Wadi_Raffa",
  "/wiki/Mining",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Water",
  "/wiki/Erso_homestead",
  "/wiki/Capture_of_Galen_Erso",
  "/wiki/Jyn%27s_kyber_pendant",
  "/wiki/Funeral",
  "/wiki/Jedi",
  "/wiki/Jedi_Order",
  "/wiki/The_Force",
  "/wiki/Jedha",
  "/wiki/Church_of_the_Force",
  "/wiki/Valene_Kane",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/November_10",
  "/wiki/The_galaxy",
  "/wiki/Order_66",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_2",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volumes_1_%26_2",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/Rebel_Rising_(audiobook)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Rogue_One_Adaptation_2",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/StarWars.com",
  "/wiki/Where_in_the_Galaxy_Are_the_Worlds_of_Rogue_One%3F",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/Databank_(website)",
  "/wiki/September_25",
  "/wiki/September_26",
  "/wiki/The_Art_of_Rogue_One:_A_Star_Wars_Story"
 ]
}