{
 "name": "Lytos Urtell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Glow Dome"
     ]
    }
   ]
  }
 ],
 "content": "Dr. Lytos Urtell was a male Sullustan scientist, best known for his invention of SenseLights, which contributed to fantastic light shows at the Glow Dome on Adarlon.\nLytos Urtell was employed at a high-level position within SoroSuub Corporation. He was let go for unknown reasons and his files were sealed so they cannot be accessed without high company security clearance. He was out of work until Corinna A'Daasha hired him to design holoprojector displays at her nightclub the Glow Dome. He was given a private office and lab where he could conduct his work in peace and he in turn designed their very popular light displays.\nUrtell took the opportunity to wire the whole club for surveillance and has placed holorecorders throughout the club. He also was able to perform research and create prototype systems, including a personal holoprojector prototype that could instantly disguise the wearer, and SenseLights which were an experiment in mind control. His prototype personal holoprojector was in high demand due to its usefulness in clandestine operations and it attracted the attention of both Rebel and Imperial forces as well those looking for personal gains like Cha Raas and Vallikor En-Vahdi.\nDr. Urtell was an odd and enigmatic scientist, even for a Sullustan. While he was left alone with his work he was content, quiet, and most of all fiercely private. He preferred to be left alone and was visibly uncomfortable during social interactions. He was very curious and explored his environment without boundaries. He had no reservations about recording hundreds of private conversations or trying to implant subliminal messages through light displays. Urtell viewed everyone and everything as a potential subject for experimentation.\nExtremely gifted in matters of programming and engineering, Urtell was a genius when it came to mechanical and technical skills. He was highly trained in holophysics which explained why he was so adept at creating light displays. He also had a biology background that helped him associate how his holophysics would effect different alien physiologies.\nUrtell carried very little in way of unusual items. He had a datapad, a diagnostic scanner, and miscellaneous tools and lab equipment that aided in his research. He did carry around a blaster pistol for protection but he was not very good with it.\nLytos Urtell was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Tom O'Neill. His name also appeared in Ultimate Alien Anthology as an example Sullustan name.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Glow_Dome",
  "/wiki/SenseLights",
  "/wiki/Adarlon/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Corinna_A%27Daasha",
  "/wiki/Holoprojector/Legends",
  "/wiki/Holorecorder/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Cha_Raas",
  "/wiki/Vallikor_En-Vahdi",
  "/wiki/Datapad/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Tom_O%27Neill",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}