{
 "name": "Lyttan_Dree",
 "display_name": "Lyttan Dree",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 4 ABY",
      "Kudo system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Carida Academy",
      "Carida Squadron",
      "Onyx Squadron",
      "Imperial Navy's officer corps",
      "Squadron Five",
      "Carida Academy",
      "Carida Squadron",
      "Onyx Squadron",
      "Imperial Navy's officer corps",
      "Squadron Five"
     ]
    }
   ]
  }
 ],
 "content": "Lyttan Dree, or Cadet 541-145, was a male human who served as a cadet and second-in-command in Onyx Squadron in the Galactic Empire under the callsign Onyx 2. Unlike most cadets, Dree was good friends with fellow cadet Han Solo. Solo was impressed with Dree's ability to be his friend, a good pilot and follow the rules all at the same time.\nLyttan and his brother Tamu Dree joined the Empire after facing starvation on Boiyuh. In 13 BBY, Lyttan and Tamu attended the Imperial Academy on Carida. There they took basic training under Sergeant Triosa Broog. They met Kanina Nico and helped in saving Han Solo from Beilert Valance's beating. Two weeks later, Lyttan was surprised to see Solo still alive after his stunt and introduced himself to Solo. Lyttan saw Solo was at the bottom of the leader board. Lyttan and his brother flew TIEs during a exercise. Lyttan saw that Tamu was too close to Jarwen's TIE and his TIE suffered damage. Lyttan thanked Solo for saving Tamu from his damaged TIE.\nFollowing the exercise, Lyttan, Solo, and their cadet squad were punished and assigned to make soup for the Academy. Flight Instructor Yurib Nakan assigned Lyttan and his fellow cadets to take charge of Quasar Fire-class Imperial Cruiser 07200823. Lyttan was assigned to the comms by Kanina. After dropping Valance and other cadets in deep space, Lyttan and the others were given day passes and invited them to board a Pantolomin cruiser. Despite Kanina's objections, Lyttan and the others went with Solo aboard the cruiser. Lyttan and the other cadets entered the cruiser and played cards. After Pjolan's attempt to kill Solo, Lyttan was grabbed by Kanina in order for them to leave. Lyttan then pulled his brother away from his wedding. Lyttan and the other cadets were able to return to the cruiser and the academy. There, Lyttan and the other cadets were reinstated to full flight status by Nakan.\nLyttan and his fellow cadets became Carida Squadron and were sent to the Imperial Navy Mobile Base on Qhulosk. There, Lytttan noticed that Solo was turning his TIE's dampeners off to give him more speed. Lyttan and Tamu decided to do so the same. Lyttan and the squadron took part in attacking Howlan and disabling the city's shield generators. Unfortunately, Valance was shot down and left in the city. Lyttan and the other cadets decided to help Solo in rescuing Valance from the city despite Nakan's orders and took speeder bikes to rescue him.\nIn 10 BBY Dree and Onyx Squadron were assigned aboard a Cantwell-class Arrestor Cruiser and were attacked by raiders seeking to steal their TIE/rb heavy starfighters. During the skirmish, Dree was flanked by several raiders. Solo disobeyed Onyx Leader's instructions in order to save Onyx Two, leading to his craft's damage and crash aboard their ship. He was then sentenced at a tribunal for disobeying orders. Solo appealed the Commodore Almudin, one of the officers on the tribunal, pointing out that Dree would be dead if not for his actions, but his arguments were dismissed.\nDree was eventually promoted to the military rank of lieutenant and piloted a TIE/IN interceptor in the 204th Imperial Fighter Wing based on the Star Destroyer Pursuer. Before his mission, he called his brother via hologram. They discussed how Tamu's family was doing and shared jokes about their military service. Later, Lyttan shared a drink with his commander, Teso Broosh while on the way to the Kudo system on a mission. Upon arrival in the system, he deployed with the rest of his squadron and was attacked by a large group of TIE fighters that came from the Star Destroyer Celerity.\nAfter their carrier was destroyed, Dree followed his commander's order and surrendered to the attackers. He landed his TIE on Kudo. While being escorted to meet Admiral Gratloe, he remarked that it was odd that the officer was keeping his rank even though he was seceding from the Empire. In the meeting, he expressed his disgust at Gratloe's rhetoric about joining together when Gratloe's forces had destroyed the Summit and killed hundreds of Imperial personnel. Dree later escaped custody with the rest of Squadron Five.\nWhen they reached their TIEs, Broosh revealed he had a backdoor built into his fighter to make sure he was not locked out. Dree realized that was why Broosh worked on his own fighter. Once Broosh arranged the return of their starfighters, Dree and the rest of Squadron Five went to retake the Celerity. On their way, they were joined by a group of TIE fighters who were loyal to the Empire. As he approached the Star Destroyer, Dree pondered how Shakara Nuress would react to the return of the capital ship. Before he could finish his thought, he was destroyed by a blast from the incoming Rebels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Target_Vader_5",
  "/wiki/4_ABY",
  "/wiki/Kudo_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Carida_Academy",
  "/wiki/Carida_Squadron",
  "/wiki/Onyx_Squadron",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Squadron_Five_(Shadow_Wing)",
  "/wiki/Cadet",
  "/wiki/Callsign",
  "/wiki/Onyx_Two",
  "/wiki/Han_Solo",
  "/wiki/Pilot",
  "/wiki/Tamu_Dree",
  "/wiki/Boiyuh",
  "/wiki/13_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Imperial_Academy",
  "/wiki/Carida",
  "/wiki/Sergeant",
  "/wiki/Triosa_Broog",
  "/wiki/Kanina_Nico",
  "/wiki/Beilert_Valance",
  "/wiki/Jarwen",
  "/wiki/Yurib_Nakan",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Imperial_Cruiser_07200823",
  "/wiki/Pantolomin_cruiser",
  "/wiki/Pjolan",
  "/wiki/Imperial_Navy_Mobile_Base",
  "/wiki/Qhulosk",
  "/wiki/Howlan",
  "/wiki/74-Z_speeder_bike",
  "/wiki/Speeder_bike",
  "/wiki/10_BBY",
  "/wiki/Cantwell-class_Arrestor_Cruiser",
  "/wiki/TIE/rb_heavy_starfighter",
  "/wiki/Onyx_Leader",
  "/wiki/Ubbel",
  "/wiki/Tribunal_of_Han_Solo",
  "/wiki/Commodore",
  "/wiki/Almudin",
  "/wiki/Imperial_officer",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/TIE/IN_interceptor",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Star_Destroyer",
  "/wiki/Pursuer",
  "/wiki/Hologram",
  "/wiki/Teso_Broosh",
  "/wiki/Mission_to_the_Kudo_system",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Celerity",
  "/wiki/Summit",
  "/wiki/Kudo",
  "/wiki/Admiral",
  "/wiki/Gratloe",
  "/wiki/Shakara_Nuress",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Han_Solo_-_Imperial_Cadet_1",
  "/wiki/Han_Solo_-_Imperial_Cadet_2",
  "/wiki/Han_Solo_-_Imperial_Cadet_3",
  "/wiki/Han_Solo_-_Imperial_Cadet_4",
  "/wiki/Han_Solo_-_Imperial_Cadet_5",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Bounty_Hunters_8",
  "/wiki/Bounty_Hunters_9",
  "/wiki/TIE_Fighter_1",
  "/wiki/TIE_Fighter_2",
  "/wiki/TIE_Fighter_3",
  "/wiki/TIE_Fighter_4",
  "/wiki/TIE_Fighter_5",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/TIE/rb_Heavy_Expansion_Pack",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Skystrike_Academy_Squadron_Pack",
  "/wiki/Death",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Mimban",
  "/wiki/Starships_and_Speeders"
 ]
}