{
 "name": "M%27Kae",
 "display_name": "M'Kae",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Death Squadron",
      "Death Squadron"
     ]
    }
   ]
  }
 ],
 "content": "M'Kae was a human male who served as a communications officer in the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic. He was stationed on board the Imperial II-class Star Destroyer Avenger and served in the crew pit on the starship's bridge.\nIn 3 ABY, the Avenger was a part of Death Squadron and was charged with destroying the Millennium Falcon as it attempted to escape from the rebel defeat at the Battle of Hoth. While pursuing the Falcon, the freighter disappeared from the Avenger's scanners, and M'Kae informed Captain Lorth Needa, commander of the Avenger, that the Sith Lord Darth Vader demanded a report on their progress.\nThe human male M'Kae served as a communications officer in the Imperial Navy and was stationed in the crew pit on the bridge of the Imperial II-class Star Destroyer Avenger, which was a part of Death Squadron. In 3 ABY, during the Galactic Civil War against the Alliance to Restore the Republic, the Avenger participated in the Battle of Hoth and was among the ships that pursued the fleeing Millennium Falcon, a rebel YT-1300 light freighter, in the aftermath of the battle.\nThe Falcon evaded capture by hiding out in the Hoth asteroid field, eventually encountering the Avenger when it attempted to escape. After the Falcon's hyperdrive failed to function, the ship's captain, Han Solo, turned the vessel around and started flying directly toward the Avenger. The Star Destroyer's commander, Captain Lorth Needa, gave orders for the ship's shields to be raised, after which M'Kae flipped a switch on his console. The Falcon then flew in close past the bridge's viewports, causing M'Kae to look up from what he was doing while Needa and others closer to the viewport ducked for cover.\nNeeda immediately ordered that the Falcon be tracked, but was informed that it had disappeared from the Avenger's scanners. M'Kae then informed the captain that the Sith Lord Darth Vader wanted an update on their progress in capturing the Falcon. Needa chose to report the failure to Vader in person, and was consequently executed by the Sith for his failure. The Falcon, meanwhile, had landed on the Avenger's command tower in order to evade its scanners, and was able to escape undetected by the Imperials, although not unnoticed by the bounty hunter Boba Fett.\nM'Kae had fair skin and dark blond hair.\nM'Kae wore a light gray Imperial uniform with a black belt and a darker gray cap bearing an officer's disk and a communications headset.\nM'Kae was created for the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back, in which he was portrayed by Mark Capri. Capri shot his scenes on the Star Destroyer bridge on Stage 5 at Elstree Studios at some point between April 24 and May 2, 1979. The character was not identified in the film, but referred to as a \"communications officer\" in the script. Capri is also visible on the bridge of the Executor toward the end of the film due to footage from the bridge of the Avenger being reused, but this article assumes that this is a different character. The character was first named in the new Star Wars canon on a card in the 2019 Topps Star Wars Black \u0026 White: The Empire Strikes Back set of trading cards released by The Topps Company, Inc.\nIn the Star Wars Legends continuity, M'Kae appeared prior to the release of The Empire Strikes Back in the novelization of the film written by Donald F. Glut. The character's name originated on a card in the Dagobah Limited expansion set of the Star Wars Customizable Card Game in 1997. According to a Star Wars CCG fan site, M'Kae was named as a tuckerization of Mark McKay, the stage name of radio personality Mark Tuttle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/M%27Kae",
  "/wiki/M%27Kae/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Death_Squadron",
  "/wiki/File:Mkae-Vader.ogg",
  "/wiki/Communications_Officer",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Avenger",
  "/wiki/Starship",
  "/wiki/Bridge_(starship)",
  "/wiki/3_ABY",
  "/wiki/Millennium_Falcon",
  "/wiki/Battle_of_Hoth",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Captain",
  "/wiki/Lorth_Needa",
  "/wiki/Commanding_officer",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/File:Needa-ShieldsUp.ogg",
  "/wiki/Imperial_Navy",
  "/wiki/Hoth_asteroid_belt",
  "/wiki/Hyperdrive",
  "/wiki/Han_Solo",
  "/wiki/Deflector_shield",
  "/wiki/Viewport",
  "/wiki/Death",
  "/wiki/Sith",
  "/wiki/Command_tower",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Belt",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Headset",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Mark_Capri",
  "/wiki/Elstree_Studios",
  "/wiki/April_24",
  "/wiki/May_2",
  "/wiki/1979",
  "/wiki/Executor",
  "/wiki/Star_Wars",
  "/wiki/2019_Topps_Star_Wars_Black_%26_White:_The_Empire_Strikes_Back",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Donald_F._Glut",
  "/wiki/Dagobah_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1997",
  "/wiki/Tuckerization",
  "/wiki/Category:Images_of_M%27Kae",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/The_Moviemaking_Magic_of_Star_Wars:_Ships_%26_Battles",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/Creating_the_Worlds_of_Star_Wars:_365_Days",
  "/wiki/The_Empire_Strikes_Back_Notebook",
  "/wiki/October_27",
  "/wiki/2009"
 ]
}