{
 "name": "M'Kyas Love",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Latarzian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark-colored"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "M'Kyas Love, originally also known as Grandyl Grieve, was a male Latarzian who was a dangerous assassin trained by the Empire. Sometime after the Battle of Endor, Grieve switched sides and began working for the the New Republic in their Intelligence Service. During this time, he began going by the name M'kyas Love. In the opinion of his superior officer, General Airen Cracken, Love redeemed himself many times during his service with the New Republic. All records of Love being Grandyl Grieve were sealed by Cracken so that only the highest authorities in the New Republic could access them. Eventually, Love retired and opened Loose Cannon Arms, a weapon shop on the galactic capital planet of Coruscant.\nLater, when an individual using the trademarks of Grandyl Grieve began to assassinate New Republic officials, General Cracken sent a young New Republic Intelligence agent named Daniera Karmony to request Love's help in tracking down the assassin before the person could assassinate the New Republic Chief of State, Leia Organa Solo. Love initially refused the request, but he changed his mind and began to help in the investigation. After Karmony and Love had been investigating the assassinations for some time, Love was present with General Cracken and Major Cabe Marquez at the Maltesara Masquerade Benefit in order to protect the Chief of State. However, Karmony found out that Love was Grieve and believed that he was the assassin, so she came to the benefit in order to stop him. In her attempt, Karmony shot Love in the shoulder. In response to the attack by Karmony, Love said that the assassin was Marquez. Attempting to complete his assignment, Marquez fired a dart shooter at Leia Organa Solo, which was stopped by a particle shield generator that had been given to Solo by Love. When Marquez pointed the dart shooter at Karmony and General Cracken, Love shot Marquez with his custom heavy blaster pistol, ending the life of the assassin.\nM'Kyas Love was an extremely adept marksman with blasters, and was also skilled in the use of grenades and other thrown weapons, as well as missile launchers and vehicle-mounted weapons. He was also skilled in hand-to-hand combat and in the use of many melee weapons.\nM'Kyas Love, also known as Grandyl Grieve, was going to be one of the main characters in Love Is a Warm Blaster, a short story written by Paul Danner for Star Wars Adventure Journal 17, which was going to be published by West End Games in the fall of 1998. He was also going to have a section detailing his statistics for Star Wars: The Roleplaying Game. However, when West End Games had financial difficulties, the Star Wars Adventure Journal was canceled along with all of West End Games's other Star Wars products.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Latarzian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Loose_Cannon_Arms",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Death/Legends",
  "/wiki/Daniera_Karmony",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Major/Legends",
  "/wiki/Dart_shooter",
  "/wiki/Grenade/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Love_Is_a_Warm_Blaster",
  "/wiki/Paul_Danner",
  "/wiki/Star_Wars_Adventure_Journal_17",
  "/wiki/West_End_Games",
  "/wiki/1998",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Star_Wars",
  "/wiki/January_27",
  "/wiki/2015",
  "/wiki/December_27",
  "/wiki/2010",
  "/wiki/August_5",
  "/wiki/November_7",
  "/wiki/2022"
 ]
}