{
 "name": "Maa_Kaap",
 "display_name": "Maa Kaap",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "67 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Maa Kaap was a Zabrak male who served aboard the Woebegone as first mate during the waning years of the Galactic Republic.\nAround 67 BBY, Maa Kaap and the rest of the crew aboard the Woebegone were on Bal'demnic. The ship, the Woebegone was holding cargo that belonged to the Hutts. Blir' noticed there was a change in temperature, Captain Ellin Lah suspected a stowaway. Thinking it could be a stowaway, they turned on the vid feed and discovered that the stowaway was an injured Muun. They did not know that this Muun was Darth Plagueis. The group asked Plagueis a few questions, but the Sith Lord asked to be left with the captain. While the Sith Lord spoke with the captain, the crew watched the conversation through a vid link. He asked the captain to take him to Muunilinst, a trip he would pay handsomely for. Kaap showed particular distrust in the Sith Lord. Shortly after, Lah arrives back to the crew after asking Plagueis to wait while they discussed. The group discussed their options, but decided to contact the authorities on Bal'demnic. Lah informed Plagueis, and was subsequently killed. Plagueis then came for the rest of the crew. Kaap fought the Sith Lord with a blaster, and once that was depleted, a Vibroblade. Plagueis then killed Kaap and the rest of the crew and flew the ship to Muunilinst.\nKaap was shown to be protective of Lah and to had a good relationship with her and the rest of the crew.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/67_BBY",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Woebegone",
  "/wiki/First_Mate/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Maa_Kaap",
  "/wiki/Bal%27demnic",
  "/wiki/Hutt/Legends",
  "/wiki/Blir%27",
  "/wiki/Captain/Legends",
  "/wiki/Ellin_Lah",
  "/wiki/Muun/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Muunilinst/Legends",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)"
 ]
}