{
 "name": "Maarisa_Zsinj",
 "display_name": "Maarisa Zsinj",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chandrila"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Judicial Forces",
      "Republic Outland Regions Security Force",
      "Judicial Forces",
      "Republic Outland Regions Security Force",
      "Republic Outland Regions Security Force",
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Maarisa Zsinj was a Human female from Chandrila. An admiral of the Republic Outland Regions Security Force, she fought in the Clone Wars. In the wake of the war, Mme. Zsinj remained loyal to the new government, the Galactic Empire led by Palpatine, former Supreme Chancellor of the Republic. Eventually, Zsinj rebelled against the Empire that had sidelined her, stealing the Star Destroyer Retaliation and becoming a pirate. She was killed by her own son and former pupil, Zsinj, who was eager to go up in the military hierarchy.\nMaarisa Zsinj was born to Human parents on Chandrila, a planet of the Core Worlds, during the height of the Galactic Republic. At some point in her youth, she married a mechanic from Fondor, and the two begat a son, Zsinj—who bore no first name, per the traditions of his father's culture. Mme. Maarisa Zsinj served as an admiral in the Outland Regions Security Force of the Galactic Republic, and her skills earned her the nickname of \"Ace of the Spacelanes.\" She acted as a mentor to her son, who served under her during the Clone Wars. When Palpatine, then Supreme Chancellor of the Republic, transformed the government into the Galactic Empire at the end of the conflict, the Zsinj remained loyal to him. Zsinj now served as an Imperial admiral, at the helm of the Venator-class Star Destroyer Retaliation. However, as the Imperialization went by, female officers suffered discrimination, and Maarisa Zsinj was gradually relegated to second class duties. Eventually, the Retaliation was recalled for decommissioning, and her son volunteered to take command of it. Shocked by her own offspring's opportunism, Maarisa Zsinj refused to pass control of her ship. She decided to steal the Retaliation and start preying on government ships to fight what she saw as Imperial corruption. Because of that, Zsinj was now considered a pirate by the Empire. Since he knew her tactics better than anyone else, her own son was tasked with defeating her, with the promise of obtaining the Victory-class Star Destroyer Iron Fist, which had been slated for retirement. Although initially reluctant to commit matricide, the young Zsinj eventually put his emotions aside and entered a ferocious campaign that resulted in his mother's death. Maarisa Zsinj's Imperial service record was erased and her past admiralty wiped out of existence. Years later, as he faced his own incoming demise in 8 ABY, audio recordings from one of the enemy ships picked up what his final word was: \"Mama,\" echoing his very first.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chandrila/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Judicial_Forces/Legends",
  "/wiki/Republic_Outland_Regions_Security_Force",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Retaliation",
  "/wiki/Pirate/Legends",
  "/wiki/Death/Legends",
  "/wiki/Zsinj",
  "/wiki/Reproduction/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Zsinj%27s_father",
  "/wiki/Fondor/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Imperialization/Legends",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Iron_Fist_(Victory-class)",
  "/wiki/Parricide",
  "/wiki/8_ABY/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/StarWars.com",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire"
 ]
}