{
 "name": "Mace_(The_Star_Wars)",
 "display_name": "Mace  (The Star Wars)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Aquilaean system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aquilaean Starforce"
     ]
    }
   ]
  }
 ],
 "content": "\"Mace,\" serving as \"Devil Leader,\" led the Devil Squadron in mounting a desperate counterattack on the Space Fortress in the Aquilaean system.\nWhen the New Galactic Empire's Space Fortress entered the Aquilaean system and attacked the planet Aquilae, the Jedi-Bendu General Luke Skywalker, based in the Aquilaean Starforce's hidden fortress beneath the Palace of Lite, ordered a desperate counterattack on the Space Fortress, which was commanded by Governor Crispin Hoedaack and General Darth Vader.\nMace and their squadron of six Aquilaean fighters promptly scrambled from the city of Gordon's spaceport outpost on Aquilae. All other spaceports had been hit by strikes from the Space Fortress, leaving Devil Squadron alone to face the gargantuan fortress, with General Skywalker instructing the fighters to use a ranger defense and target its breath ports and lock areas.\nHaving told off Devil Six for off-topic chatter, Devil Leader ordered Devil Two to check their rotation planes. Affirming the order from Mace, whom Devil Two referred to as \"boss,\" the pilot remarked that they were encountering a threshold disturbance. After Skywalker wished the Force of others to be with them, Devil Squadron bombarded the Space Fortress with laser fire, causing ruptures and casualties within. Devil Two later reported heavy Imperial fire at twenty-three degrees, which Devil Leader acknowledged before proceeding to order the squadron to converge at an opening while the squadron leader mapped the fortress surface. With Devil Four providing cover from behind, Devil Leader strafed the fortress but soon lost Devil Four, who failed to stay on target and succumbed to cannon fire. Further on, Chewie and Devil Six received orders to regroup, and General Skywalker directed Mace to concentrate fire at a weak point nearby, while Babs was shot down.\nWith the further losses of Devil Six and another fighter, Devil Squadron was left only with Mace and another pilot. They encountered a life-pod, which they let go—it contained the droids C-3PO and R2-D2. Focusing on the task at hand, the fighters received General Skywalker's news that transformer code zero three was the Space Fortress' main relay, the destruction of which would lead to the destruction of the entire fortress.\nHowever, General Vader calculated that the battle would be over in the Empire's favor by zero three hundred, bringing an end to the three-hour-war. The Senate had voted to end the ongoing war between the Aquilaeans and the New Galactic Empire, and Senator Sandage of Aquilae also reported to General Skywalker that peace terms, with the agreement of Queen Breha, had been relayed to the Empire, which accepted them, forcing Skywalker call off the assault. While Mace initially resisted the general's order to cease the attack, they eventually relented, only to be struck down by Imperial fire alongside the other pilot. The two's deaths angered General Skywalker, who exclaimed that the war was just beginning.\nA Human, Mace was quick to detect threats in the midst of battle and to respond to orders from base, but was hesistant in breaking off the attack on the Space Fortress when General Skywalker gave the order.\nDevil Leader wore a flight suit that was complete with a helmet featuring an orange visor and a breath mask that fully covered the head.\nMace appears in The Star Wars 2, an adaptation of George Lucas' rough draft of the film Star Wars: Episode IV A New Hope, where the character's role would be filled by Red Leader Garven Dreis. The rough draft simply refers to the pilot leader by the name Mace without referring to the call sign \"Devil Leader.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mace",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Special:Upload",
  "/wiki/Aquilaean_system",
  "/wiki/Human/Legends",
  "/wiki/Devil_Squadron_(Aquilae)",
  "/wiki/Battle_of_the_Space_Fortress",
  "/wiki/Space_Fortress",
  "/wiki/Galactic_Empire_(The_Star_Wars)",
  "/wiki/Aquilae_(The_Star_Wars)",
  "/wiki/Jedi-Bendu",
  "/wiki/Luke_Skywalker_(The_Star_Wars)",
  "/wiki/Underground_Fortress",
  "/wiki/Palace_of_Lite",
  "/wiki/Crispin_Hoedaack",
  "/wiki/Gordon_(Aquilae)",
  "/wiki/May_the_Force_of_others_be_with_you",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Time/Legends",
  "/wiki/Aquilaean_campaign",
  "/wiki/Sandage",
  "/wiki/Breha_(The_Star_Wars)",
  "/wiki/Breath_mask/Legends",
  "/wiki/The_Star_Wars_2",
  "/wiki/George_Lucas",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Red_Leader/Legends",
  "/wiki/Garven_Dreis/Legends",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film"
 ]
}