{
 "name": "Madaga-Ru",
 "display_name": "Madaga-Ru",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Voss"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Voss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Azure"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Voss Mystics"
     ]
    }
   ]
  }
 ],
 "content": "Madaga-Ru was a male Voss Mystic living during the Galactic War.\nMadaga-Ru was in some form a radical and a heretic among the other Mystics; he believed that his fellow Voss lived in denial and only \"seeing\" what they want to see. Madaga-Ru exiled himself and lived as a hermit in the dangerous wilds outside the city of Voss-Ka.\nAround 3640 BBY Madaga-Ru was approached by the Empire's Wrath in his search for the true Voice of the Emperor. He explained to the Wrath that the Voice went missing in the Nightmare Lands, where all who ventured were driven mad. He advised the Wrath to gain the Blessing of Oneness from a Mystic Vana-Xo and the Pendant of Bone from a Voss commando Biddeck-Va to enter the Dark Heart. After the Wrath had acquired both objects, Madaga-Ru appeared before the Sith Warrior as a ghostly apparition, insisting on possessing the Wrath briefly as compensation for his assistance, regardless of consent.\nAfter the Wrath had freed the Voice, Madaga-Ru appeared before the Sith warrior as an apparition, revealing that he gained the knowledge needed to keep Sel-Makor from escaping his prison, as well as warning that one person among the Wrath's crew was a traitor, but was unable to say their name. The traitor was later revealed to be Malavai Quinn.\nMadaga-Ru admitted to preferring his hermit's way of life over the false pretenses of his people's civilization. Despite this disapproval of his culture, Madaga-Ru remained a true believer in the fundamental Voss way of life—a way of balance, simplicity and faith in the visions of the Mystics. Those who refused to respect Mystic philosophy or deliberately broke Voss law received Madaga-Ru's stern admonishment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Voss",
  "/wiki/Voss_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Voss_Mystics",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Galactic_War",
  "/wiki/Force_vision/Legends",
  "/wiki/City/Legends",
  "/wiki/Voss-Ka",
  "/wiki/3640_BBY",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Nightmare_Lands",
  "/wiki/Blessing_of_Oneness",
  "/wiki/Vana-Xo",
  "/wiki/Pendant_of_Bone",
  "/wiki/Voss_commandos",
  "/wiki/Biddeck-Va",
  "/wiki/Dark_Heart",
  "/wiki/Sel-Makor",
  "/wiki/Malavai_Quinn"
 ]
}