{
 "name": "Maddie_Macatten",
 "display_name": "Maddie Macatten",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Maddie Macatten was a female Bith who was considered to be old by 8 ABY. Formerly a slave on the planet Kal'Shebbol in the Kathol sector of the Outer Rim Territories, Macatten was freed when her master was killed by the Aing-Tii—a mysterious species that hated slavers—while on a trading mission. Taking one of her former master's ships, the Scupper Bantoo, Macatten headed into the Kathol Outback. Setting herself up as a merchant, she spent her days searching for the Aing-Tii homeworld so that she could properly thank them for freeing her from slavery.\nMaddie Macatten was an elderly female Bith slave on Kal'Shebbol, the capital planet of the Kathol sector. When her master was killed by the Aing-Tii—a race noted for their hatred of slavers—Macatten found herself released from her servitude. Taking the ownership papers to one of her master's ships, the Gymsnor-2 light freighter Scupper Bantoo, she flew the vessel out of its docking bay. Macatten headed for the Kathol Outback and set herself up as a merchant, using the Scupper Bantoo to travel between the worlds of the Outback where she traded replacement machinery parts and luxury items to the various colonies she encountered. Macatten made several modifications to the Scupper Bantoo, but it was an old vessel and could only take so much upgrading.\nWhile engaged in her trading endeavors, Macatten sought out any and all information on the Aing-Tii. She hoped to find their hidden homeworld so that she could personally thank them from freeing her from slavery. While a lot of the data she gained was rumor and speculation, Macatten was considered a good source of information on the Aing-Tii by the residents of the Outback. She also knew that the planet of Shatuun was home to a pair of mated Star Dragons, a fact that was known to only a few individuals. During her travels, Macatten encountered the crew of the New Republic CR90 corvette FarStar, which was on a mission to track down the rogue Imperial Moff, Kentor Sarne.\nMaddie Macatten was a black-eyed Bith who possessed an impressive visual acuity when objects were within a thirty centimeter range, although her eyesight suffered when trying to focus on objects over twenty meters distant. She could not see anything beyond forty meters. Macatten could also smell the scent of individuals within a three-meter radius that helped her to determine their moods and state. She was also manually dexterous, and her fine motor skills assisted her while operating fine tools, or when pickpocketing.\nMacatten was slightly senile, constantly talking to herself, although she rarely finished a sentence. She had a tendency to ramble on about anything and everything when in the presence of others. Some even considered her crazy. Although she had a lot of information to share, most of it was wrong. Despite this, elements of the truth were often found in her words. The streams of babble usually bored those present, causing them to stop listening to her before any useful information was revealed. Macatten would often hum Bith folk tunes to herself while working, and her priority in life was the discovery of the Aing-Tii homeworld so that she could thank them for indirectly freeing her from slavery.\nMacatten had the ability to fly, repair, and modify space transports, as well as navigate through hyperspace. An experienced trader and businessbeing, she was a shrewd bargainer and could ascertain the value of items. Macatten knew a lot of information regarding the Kathol Outback, although not all of it was accurate, and she knew about alien species, cultures and languages, and was quite streetwise despite her burgeoning senility. She was also a deft pickpocket and con artist when the need arose, and was know to gamble. Despite her advanced years, Macatten was still relatively fit and could climb and jump, and was agile enough to avoid danger when necessary. Technically adept, she could also drive repulsorlift vehicles, program and repair computers and droids, and apply first aid. She was skilled with a blaster, and armed herself with a sporting model. She also carried a datapad, comlink, various tools, and 250 credits.\nMaddie Macatten was created for The Kathol Outback, a supplement to The DarkStryder Campaign published by West End Games. She was intended to be used by the Gamemaster to introduce information—or even misinformation—to the players regarding the Aing-Tii species, as well as to serve as a source of potential replacement parts. It is also suggested that Macatten could join the crew of the FarStar, the player character's principal ship, should the Gamemaster so wish. In 2008 Maddie Macatten received an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/Kathol_sector",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Maddie_Macatten%27s_slave_master",
  "/wiki/Death/Legends",
  "/wiki/Aing-Tii/Legends",
  "/wiki/Species/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Scupper_Bantoo",
  "/wiki/Kathol_Outback",
  "/wiki/Merchant/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Aing-Tii_homeworld",
  "/wiki/Capital/Legends",
  "/wiki/Gymsnor-2_light_freighter",
  "/wiki/Hangar/Legends",
  "/wiki/Shatuun",
  "/wiki/Duinuogwuin/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/FarStar",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Eye/Legends",
  "/wiki/Centimeter/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Music/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Sporting_blaster",
  "/wiki/Datapad/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/The_Kathol_Outback",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/West_End_Games",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_DarkStryder_Campaign,_Deluxe",
  "/wiki/The_Saga_Begins",
  "/wiki/The_DarkStryder_Campaign"
 ]
}