{
 "name": "Madel Wharen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Drever Corporation",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Madel Wharen was a Human male researcher and developer for the Drever Corporation, a minor weapons manufacturing company located in the Parmel sector. Wharen had many talents, and his technical skills played a significant role in the Drever Corporation's reputation for reliability. Wharen had a tumultuous relationship with the corporation's board and managing director, however, which was largely a result of his Rebel sympathies. The combination of his technical skills and his political views made him a person of interest for both the Rebellion and the Empire, such that Rebel agents made plans to recruit him, while Imperial agents made plans to prevent him from being recruited.\nMadel Wharen was a Human male researcher and developer for the Drever Corporation, a minor weapons manufacturing company located in the Parmel sector. Wharen was known as the inventor of the Phoenix Plasma Punch, a cutting tool which was widely acclaimed by Imperial Customs, and other organizations which used it. For a time, he served on the Board of Directors for the corporation. Wharen was the only close friend of Jenson Drever II, the managing director of the Drever Corporation.\nWharen was a discreet yet staunch supporter of the Alliance to Restore the Republic. Too prudent to publicly support the Rebel cause, Wharen nevertheless constantly pushed for business policies that would be beneficial for the Alliance, or detrimental for the Galactic Empire. His political leanings led to many arguments with Drever. Ultimately, these arguments resulted in Wharen being transferred to a backwater research and development station and severely strained his friendship with Drever. In many ways, this transfer was beneficial to the Drever Corporation, since Wharen thrived in this environment, and improved many of the corporation's product lines. In fact, Wharen's ability to find and cheaply correct flaws in products during this research and development process was one of the reasons the Drever Corporation had a reputation for reliability.\nAt some point between the Battle of Yavin and the Battle of Endor, the Rebel Alliance was aware of Wharen's pro-Rebel leanings and wished to recruit him. This was complicated by the fact that the Imperial Security Bureau  was also aware of his sympathies. ISB agents closely watched Wharen, along with his wife, Bea, and his young son, Padyn. In fact, a Surveillance agent had been inserted into the Drever Corporation Board when Wharen was still a board member, and had discovered his support for the Rebels. When Wharen was transferred to research and development, the ISB ensured that his work there was closely overseen by several other agents, as they believed that the Alliance would attempt to extract him. In order to prevent such an extraction, these ISB agents were given access to Investigations resources, as well as the ability to call upon the Drever Corporation's internal security forces.\nErratic and temperamental, Madel Wharen would often break off in the middle of a sentence to go to a nearby computer terminal with an idea. Wharen considered himself an inventor rather than a corporate drudge, and had little tolerance for anyone who advocated putting profits ahead of quality, or for corporate executives in general. Despite his vocal opposition of corporate activities, Wharen was a discreet Rebel sympathizer, although he was too prudent to support the Alliance publicly. However, he maintained his support despite being removed from the Drever Corporation's Board of Directors and the negative effect it had on his friendship with Drever.\nNot particularly strong or agile, Wharen had a thin, gangly build and possessed light skin and unruly gray hair.\nDespite his eccentricities, Wharen was a highly skilled technician, inventor, and engineer who was a mechanical genius. Specifically, Wharen was skilled at engineering and repairing blasters and other machinery, in addition to repairing and programming computers and droids. He was particularly adept at improving existing designs. Wharen also had considerable knowledge of and skill with mechanical security systems.\nWharen's ability to consistently engineer profitable products led a large portion of the Drever Corporation's staff to be loyal to him personally. His knowledge extended to C-227 motivators, DDX pulse modulators, flux control modules, integrated power flow control chips, and microprocessors. In addition to his technical abilities, he was skilled at persuasion, despite his erratic temperament.\nMadel Wharen usually wore a lab coat over a rumpled, unkempt business suit, and was never seen without a datapad in hand. He generally wore his clothing for three days at a time. Wharen generally kept two thousand credits on his person.\nMadel Wharen was a character created for the Star Wars: The Roleplaying Game sourcebook Galaxy Guide 9: Fragments from the Rim, written by Simon Smith and Eric S. Trautmann. As the sourcebook was a collection of elements and \"adventure hooks\" that could be used in games, the fate of Madel Wharen was deliberately left open, in order to allow gamemasters to use the characters in their games freely.\nOne possibility suggested for Wharen's character was having Alliance agents forcing Drever out of his own company and installing Wharen as the head of the Drever Corporation. This would then force the Empire to either directly take over the company, a move which would have repercussions amongst other corporations, or attempt to quietly remove Wharen, which would create a dangerous internal power struggle in the corporation and make it more likely that the Empire would be discovered interfering with the company.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Drever_Corporation",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/Engineer/Legends",
  "/wiki/Parmel_sector",
  "/wiki/Jenson_Drever_II",
  "/wiki/Politics/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Phoenix_Plasma_Punch",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Bea_(female)",
  "/wiki/Padyn",
  "/wiki/Surveillance_(Imperial_Security_Bureau)/Legends",
  "/wiki/Investigations/Legends",
  "/wiki/Computer_terminal",
  "/wiki/Hair/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Programmer/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/C-227_motivator",
  "/wiki/DDX_pulse_modulator",
  "/wiki/Flux_control_module",
  "/wiki/Power_flow_control_chip",
  "/wiki/Microprocessor",
  "/wiki/Datapad/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Simon_Smith",
  "/wiki/Eric_S._Trautmann"
 ]
}