{
 "name": "Madhi Vaandt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "44 ABY",
      "Blaudu Sextus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White fur"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink with freckles"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Perre Needmo Newshour"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tyl Krain"
     ]
    }
   ]
  }
 ],
 "content": "Madhi Vaandt was a female Devaronian freelance news reporter active after the Second Galactic Civil War. Vaandt honed her craft under the guidance of Tyl Krain, a man with whom she worked her entire career. A compassionate journalist who frequently reported live and on location, Vaandt occasionally did a segment for the Chevin Perre Needmo's show, The Perre Needmo Newshour. After a particularly successful show wherein Vaandt covered the Galactic Alliance's failure to provide sufficient aid and protection to the beings of the Coruscant underworld, Vaandt was again hired by Needmo to cover a continuous segment about the prevalence of slavery throughout the galaxy. In doing so, Vaandt came into contact with Freedom Flight, an anti-slavery organization who planned to further their own covert agenda through the exploitation of the Devaronian's benevolence.\nSeveral interactions with the clandestine Freedom Flight led Vaandt to Vinsoth, where she acquired the Chev slave Shohta Laar, after she beat his master in a drinking game. She then freed Laar and hired him to work on her production staff. Vaandt rendezvoused with a Freedom Flight representative known as Blink on a moon of Vartos, from whom she learned of the recent slavery-uprising on Klatooine, and the impending revolt on the obscure world of Blaudu Sextus. Vaandt reported the progress of the slave revolt by the Octusi on Blaudu Sextus. While reporting the Mandalorian attack on the Octusi, she was killed by Belok Rhal.\nMadhi Vaandt was a young female Devaronian female who, early in her life, developed an interest in galactic events. As such, she aspired to become a HoloNet news reporter. Early in her career, Vaandt was taken under the wing of a Human male named Tyl Krain, from whom she learned the intricacies of ethical news reporting.\nImmediately following Madhi Vaandt's death, her production assistant, Shohta Lar, claimed her position and continued to report on the events unfolding on Blaudu Sextus, despite remaining under heavy fire from Belok Rhal and his Mandalorian commandos.\nMadhi Vaandt abhorred the institution of slavery and sought to actively expose its existence on backwater worlds neglected by the Galactic Alliance. Through her experience with slaves, Vaandt became attuned to the nuances of their behavior and was able to recognize subtle insubordination of Shohta when he was instructed to provide her with a live HoloNet feed. Vaandt envisioned her viewers attentively watching her as she reported from various locations across the galaxy. Chief Daala found Vaandt's appearance bewitching. Despite that, she also found Vaandt to be rather beautiful, and believed that Nek Bwua'tu, even while comatose, shared the same opinion. Those who heard it were mesmerized by Madhi Vaandt's voice, one that was melodious and rich with the accent of her native people.She was charming and exuded sincerity when she reported.\nMadhi Vaandt was rather fond of Tyl Krain and wholeheartedly applied his lessons in effective news reporting. Although she looked upon him as a sort of father figure, Vaandt also felt that Krain was rather attractive for a Human man. She had mixed emotions about Shohta Laar in the days that immediately followed their time on Vinsoth. She kept few secrets from her crew.\nMadhi Vaandt was recognizably Devaronian, and considered a fine representative of her species in both likeness and speech. Her white hair was cut short and tousled, as though she had done nothing more than run her fingers through it. Her shapely eyes were green and enthralling as she looked intensely into the cam. Vaandt's skin was pink and freckled, and makeup only slightly diminished the two dark ovals on her forehead that hid under white bangs. She dressed in modest and practical clothing when in the field, to conceal what was upon closer scrutiny a lithe and petite frame. Her Devaronian physiology afforded her a considerable alcohol tolerance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/44_ABY",
  "/wiki/Blaudu_Sextus",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/White",
  "/wiki/Pink",
  "/wiki/The_Perre_Needmo_Newshour",
  "/wiki/Tyl_Krain",
  "/wiki/Journalist/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Human/Legends",
  "/wiki/Chevin/Legends",
  "/wiki/Perre_Needmo",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Coruscant_underworld",
  "/wiki/Slavery/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Freedom_Flight",
  "/wiki/Vinsoth/Legends",
  "/wiki/Chev",
  "/wiki/Shohta_Laar",
  "/wiki/Guumak",
  "/wiki/Alcohol/Legends",
  "/wiki/Blink",
  "/wiki/Vartos%27_moon",
  "/wiki/Vartos",
  "/wiki/Klatooinian_uprising",
  "/wiki/Klatooine/Legends",
  "/wiki/Octusi",
  "/wiki/Belok_Rhal",
  "/wiki/HoloNet/Legends",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Apocalypse..._Now!",
  "/wiki/Star_Wars_Insider_132"
 ]
}