{
 "name": "Mag_(clone_trooper)",
 "display_name": "Mag  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Orto Plutonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Mag\" was the nickname of a clone cold assault trooper commander in the Grand Army of the Republic during the Clone Wars. In 22 BBY, he and his squad were stationed at Glid Station, a Republic outpost on the ice planet of Orto Plutonia. Mag and his squad were assigned to field-test an assortment of subzero gear, including the CK-6 swoop bike. However, the squad was beset by many problems, including an elusive and deadly sentient species that they encountered, which the squad nicknamed the \"ice men.\" The \"ice men\" killed any clone patrol they encountered, leaving no witnesses. One night, Mag and a clone trooper under his command, Shiv, were attacked and killed by the \"ice men\" while inspecting one of the station's outer sensors.\nAfter the death of Mag and Shiv, the remaining clones stationed at Glid Station were killed by the \"ice men,\" along with all the battle droids at the nearby Separatist base. The Republic later sent a search party to Orto Plutonia to investigate what had happened to Glid Station. The party discovered that the \"ice men\" were, in fact, a colony of Talz that had been attacked by the Separatists. In the resulting conflict, the Republic base was caught in the middle of the fighting between the two factions.\nMag was the nickname of a clone of the bounty hunter Jango Fett. He was born and trained on the planet of Kamino to be a cold assault commander in the Grand Army of the Republic. In 22 BBY, during the Clone Wars fought between the Republic and the Separatists, Mag and his squad were stationed at Glid Station, a Republic outpost on the frozen world of Orto Plutonia. The planet was orbited by the sovereign moon of Pantora, populated by the Pantorans, which had remained allied to the Galactic Republic during the Clone Wars. While there, Mag and his squad were tasked with testing an assortment of experimental cold weather devices, including the CK-6 swoop bike, nicknamed the \"Freeco bike.\"\nWhile on Orto Plutonia, Mag's squad was met with several difficulties. The squad's rations were not shipped in insulated canisters, and due to the extreme cold, the rations were frozen solid. This forced the clones to boil their food, which took away what little flavor the rations had. In addition, the Freeco bikes required perpetual attention for they froze up if not constantly maintained. Compounding matters, Mag's squad continued to encounter a large, mysterious, and deadly sentient species they called the \"ice men.\" All the patrols that happened upon the \"ice men\" were killed, leaving the true nature of the species unknown.\nAlthough there was a nearby Separatist base on the planet, Mag and his squad never encountered any battle droids. However, the clones attempted to stay in fighting shape by building snowmen that resembled B1-Series battle droids, B2 battle droids, and General Grievous—the Supreme Commander of the Separatist Droid Army—using them as target practice.\nOne night, while Mag and one of his men, Shiv, were inspecting an outer sensor, their Freeco bikes froze up. This left the two stranded until dawn, when Glid Station could send an LAAT/i gunship to pick them up. The two clones built a small camp, set a tent, and prepared to wait out the night. However, while Mag and Shiv were discussing a letter Shiv was writing to a hatchmate of his, Flanker, the two clones were attacked by the \"ice men.\" The \"ice men\" ripped open the tent and killed Mag, and next killed Shiv while he was reaching for a blaster pistol. Later, both Glid Station and the nearby Confederate outpost were attacked by the \"ice men,\" and all of the clone troopers and battle droids present at both bases were eradicated.\nWhen the Republic lost contact with Glid Station, the Galactic Senate sent an investigation party, led by Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker, to Orto Plutonia to determine the fate of the outpost. The team was accompanied by representatives from Pantora: Chairman Chi Cho and Galactic Senator Riyo Chuchi. The Jedi's investigation discovered that the \"ice men\" were in fact a peaceful tribe of Talz that had been attacked by the Separatist battle droids. In the resulting conflict, Mag, Shiv, and the rest of Glid Station had been caught in the middle of the fighting between the two factions.\nLike all clones of Jango Fett, Mag stood 1.83 meters tall. Mag was not amused finding Shiv writing letters instead of sleeping and chastised his subordinate for it.\nOn Orto Plutonia, Mag wore cold assault trooper armor with red stripes on the helmet and the shoulder pads. He also piloted a Freeco bike.\nMag made his first and only appearance in the six-page The Clone Wars webcomic Cold Snap, which led directly into \"Trespass,\" an episode in the first season of the Star Wars: The Clone Wars television series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_cold_assault_trooper/Legends",
  "/wiki/Magg",
  "/wiki/Slavery/Legends",
  "/wiki/Zlarb/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Orto_Plutonia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Shiv_(clone_trooper)",
  "/wiki/Clone_trooper_commander",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Glid_Station/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/CK-6_swoop_bike/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Species/Legends",
  "/wiki/Talz/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Talz_village/Legends",
  "/wiki/Battle_of_Orto_Plutonia/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Pantora/Legends",
  "/wiki/Pantoran/Legends",
  "/wiki/Ration_cube/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Supreme_Commander",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Low_Altitude_Assault_Transport/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Hatchmate",
  "/wiki/Flanker",
  "/wiki/DC-17_hand_blaster/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Chairman/Legends",
  "/wiki/Chi_Cho/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Riyo_Chuchi/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Clone_trooper_armor/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_Clone_Wars:_Cold_Snap",
  "/wiki/Trespass",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Official_Star_Wars_Fact_File_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_4_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_4_(2014)",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com"
 ]
}