{
 "name": "Magir Paca",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Garos IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Committee of Seven for Garosian Unification",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Magir Paca was a male Human who served the New Republic as a leader of the underground resistance on Garos IV.\nMagir Paca was a Human male from the planet Garos IV. His father was good friends with Tork Winger, and Paca grew up calling him \"Uncle\". When Paca began his governmental service, it was as an aide to Winger, who was serving as the Assistant Minister of Defense. For over ten years Paca served the government with Winger as his mentor. By 6 BBY, Paca held the post of Assistant Minister of Commerce. Unlike his mentor, who saw the Galactic Empire as a positive force in the galaxy, Paca despised the Empire and saw that it was a threat to Garos IV. He was one of the original leaders of the Garosian resistance, known as the Committee of Seven for Garosian Unification. The resistance worked to end the Garosian Civil War between the native Garosians and the Sundari colonists by convincing them that the Empire was the true enemy.\nPaca, along with Desto Mayda and Sundari radical Camron Gelorik, convinced a young Dair Haslip to join the Imperial Army as a spy. Haslip, who had been enthusiastic about joining the Empire until seeing his friend—and Desto Mayda's son—Jos killed by Imperial scout troopers, agreed.\nPaca's governmental position allowed him to covertly supply useful information and intelligence to the resistance. In 4 ABY, Imperial forces realized there was a intelligence leak and set a trap to catch the perpetrator. Evidence against Paca was compiled, and the Empire suspected he was a member of the resistance and built a case against him. Fortunately for Paca, Governor Winger's adopted daughter, Alexandra had sliced into the Imperial computer files and discovered the information pertaining to Paca. Alexandra warned him of the danger, and Paca managed to disappear before Imperial soldiers could arrest him. Going underground, Paca took a more active role in the resistance, and began to coordinate the underground's activities.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Garos_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Committee_of_Seven_for_Garosian_Unification",
  "/wiki/New_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tork_Winger",
  "/wiki/Standard_year/Legends",
  "/wiki/6_BBY/Legends",
  "/wiki/Minister_of_Commerce_(Garos_IV)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Garosian_Civil_War",
  "/wiki/Garosian",
  "/wiki/Sundari/Legends",
  "/wiki/Desto_Mayda",
  "/wiki/Camron_Gelorik",
  "/wiki/Dair_Haslip",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Jos_Mayda",
  "/wiki/Scout_trooper/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Alexandra_Winger",
  "/wiki/Slicer/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Turning_Point_(Charlene_Newcomb)",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/A_Glimmer_of_Hope",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/West_End_Games",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4",
  "/wiki/Whispers_in_the_Dark",
  "/wiki/Star_Wars_Adventure_Journal_2",
  "/wiki/Mission_to_Zila",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Shadows_of_Darkness",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Rendezvous_with_Destiny",
  "/wiki/Star_Wars_Adventure_Journal_6",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}