{
 "name": "Magur Torigai",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Magur Torigai was a male Mon Calamari zoologist.\nIn 1 ABY, Magur Torigai resided in the city of Restuss on Rori. While here, he would investigate wildlife on the moon. Unfortunately, he soon discovered that a local population of gubburs—imported to Rori by a misguided researcher from Corellia—got loose and began to breed uncontrollably. Torigai feared that they would pose a threat to Rori's sensitive ecosystem, so he hired a well-armed spacer to help him lower the gubbur population. The spacer asked why the researcher brought gubburs to Rori, and why they were not being killed off by the local predators. Magur explained that gubburs had three long whiskers, useful for detecting weather and tectonic motion. The researcher wanted to test if gubburs could predict earthquakes on Rori. He also explained that gubburs were notorious for their terrible smell, akin to burning leather, which helped them repel most native predators.\nUltimately, the spacer agreed to help Magur, and set out to the wild to control the gubbur population. The spacer succeeded, and returned to Magur for his reward. However, Magur's troubles did not end there. He received a report of another non-native animal, a Talusian Guf drolg, endangering the local ecosystem. It was an omnivorous creature, ill-tempered, and generally hostile. The spacer once again agreed to help Magur, by setting out to kill the Guf drolg, which was eating many native creatures. Fortunately, the spacer succeeded, and he was once again awarded by Magur for his efforts.\nBefore the Battle of Restuss erupted, Magur was apparently evacuated from the city by the Empire.\nMagur Torigai was a non-player character  in the 2003 MMORPG Star Wars Galaxies. He was removed from the game on June 27, 2006 due to the new changes that were made to Restuss.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Zoologist/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Restuss",
  "/wiki/Rori/Legends",
  "/wiki/Gubbur",
  "/wiki/Corellia/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Leather/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Guf_drolg",
  "/wiki/Battle_of_Restuss",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/2003",
  "/wiki/June_27",
  "/wiki/2006"
 ]
}