{
 "name": "Magva Yarro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ghorman"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Partisans",
      "Cavern Angels",
      "Cavern Angels"
     ]
    }
   ]
  }
 ],
 "content": "Magva Yarro was a human female who took part in the peaceful protest against the Galactic Empire on her homeworld of Ghorman before the regime began slaughtering the protesters in 2 BBY. After surviving the massacre, she joined the Partisans, a militia group led by the resistance fighter Saw Gerrera, and fought against the Empire, operating as a forward spotter for their Cavern Angels squadron.\nWhile on the moon Jedha in 0 BBY, she was among the group of Partisans who escorted Rebel Alliance members Jyn Erso, K-2SO, and Cassian Andor and the Guardians of the Whills Chirrut Îmwe and Baze Malbus to the Catacombs of Cadera. Yarro was present there shortly before Jedha City was destroyed by the Empire's Death Star superweapon, which caused a shockwave that killed Gerrera and several Partisans.\nHailing from the Colonies planet Ghorman, Magva Yarro participated in the peaceful protest on her homeworld against the Galactic Empire. In 2 BBY, the Empire initiated the Ghorman Massacre, in which they killed several protesters. Being one of the few survivors, Yarro saw the true nature of the Empire and decided to search for a faction that opposed it.\nRejecting the Rebel Alliance led by former Imperial senator Mon Mothma, she instead joined up with an extremist militia group, the Partisans, that was led by the resistance fighter Saw Gerrera to combat the Empire. She became a forward spotter for their Cavern Angels X-wing starfighter squadron. At one point, she piloted a UT-60D U-wing starfighter/support craft over the moon Jedha while the gunner fired the ship's mounted weapon. At another point, she participated in a firefight around a structure.\nWhile on Jedha in 0 BBY, Yarro and a group of Partisans escorted Rebel Alliance members Jyn Erso, Cassian Andor, and K-2SO along with Guardians of the Whills Chirrut Îmwe and Baze Malbus following their capture in Jedha City to the Catacombs of Cadera, where the Partisans' base was located. During the journey, she personally escorted Malbus. Later, at the base, Yarro nonchalantly looked at Erso while the girl was escorted to Gerrera. Shortly after, the Empire had their Death Star superweapon obliterate Jedha City, creating a large shockwave. Although the base was hastily evacuated, Gerrera and several Partisans were killed in the event.\nMagva Yarro was initially a naive idealist who believed that the Galactic Empire could be combatted through non-violent means. After living through the Ghorman Massacre, she experienced a psychological reaction that caused her to look for the fiercest group fighting the Empire.\nYarro avoided Mon Mothma's Rebel Alliance as she viewed its members as ineffective cowards and thought Mothma was not fierce enough, despite the fact that the former senator openly condemned the Ghorman Massacre and denounced the Empire prior defecting from the Imperial Senate and forming the Alliance. As a member of the Partisans, Yarro showed strong loyalty to the group. A human female, Yarro had light skin and wore dark face paint around her eyes.\nAlong with several equipment pouches around her chest and a device on her head, Magva Yarro wore a dark coat with red accents as well as dark pants. She was equipped with a modified DH-17 blaster rifle and carried multiple cylinders on her back.\nMagva Yarro first appeared in the 2016 anthology film, Rogue One: A Star Wars Story. She was identified in Star Wars: Rogue One: The Ultimate Visual Guide, a reference book written by Pablo Hidalgo and released in conjunction with the film. The character was portrayed by Sabine Crossen. The Jedha desert scenes were filmed at Wadi Rum, Jordan in 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ghorman",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Partisans",
  "/wiki/Cavern_Angels",
  "/wiki/Galactic_Empire",
  "/wiki/Homeworld",
  "/wiki/Ghorman_Massacre",
  "/wiki/2_BBY",
  "/wiki/Saw_Gerrera",
  "/wiki/Squadron",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/0_BBY",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Jyn_Erso",
  "/wiki/K-2SO",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Guardians_of_the_Whills",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Baze_Malbus",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Jedha_City",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Death",
  "/wiki/Colonies",
  "/wiki/Planet",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/X-wing_starfighter",
  "/wiki/Pilot",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Gunner",
  "/wiki/Starship",
  "/wiki/Battle_on_Jedha",
  "/wiki/Imperial_Senate",
  "/wiki/Declaration_of_the_Rebel_Alliance",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Color",
  "/wiki/DH-17_blaster_rifle",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Sabine_Crossen",
  "/wiki/2015",
  "/wiki/Category:Images_of_Magva_Yarro",
  "/wiki/Star_Wars:_Where%27s_the_Wookiee%3F_2",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Saw%27s_Renegades_Expansion_Pack",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Birth_of_the_Rebellion",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Secret_Cargo",
  "/wiki/April_10",
  "/wiki/2017",
  "/wiki/October_15",
  "/wiki/2019"
 ]
}