{
 "name": "Mair_Koda",
 "display_name": "Mair Koda",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vernet"
     ]
    },
    {
     "name": "Born",
     "values": [
      "20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Mair Koda was an independent freighter captain and spacer who made a living transport goods between the planets of the Zuni cluster. Koda spent her early years growing up on the light freighter Blue Boy with her parents, until her mother ran off with a Wroonian smuggler. Koda's father, unable to cope with making a living and keeping his adventurous daughter from dangerous situations, entrusted her to the care of Arn and Emmi Stonelaw, two chorba-farmers on Vernet. Koda grew up with the Stonelaw's two sons, Yuri and Kristoff, and worked on the family farm until she was eighteen. Eventually, Koda joined her father where he groomed her to take over the Blue Boy; when her father died, Koda inherited the ship and his old trading route.\nKoda kept up the regular transport runs and resisted overtures from the criminal underworld to work for them. She also turned down offers from the Rebel Alliance. During one run back to Vernet, Koda found out that the Empire had established a base on the planet and forcibly conscripted all males aged between eighteen and twenty-five, including her foster brother, Kristoff. Koda and Yuri attempted to infiltrate the base and rescue Kristoff, only to find him brainwashed by the Empire into believing in their cause. Koda and Yuri were forced to flee Vernet.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vernet",
  "/wiki/20_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Zuni_cluster",
  "/wiki/Light_freighter/Legends",
  "/wiki/Blue_Boy",
  "/wiki/Wroonian/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Arn_Stonelaw",
  "/wiki/Emmi_Stonelaw",
  "/wiki/Corellian_chorba-root",
  "/wiki/Farmer/Legends",
  "/wiki/Yuri_Stonelaw",
  "/wiki/Kristoff_Stonelaw",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Vernet_Imperial_Army_Training_Camp",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Draw",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/2_ABY/Legends"
 ]
}