{
 "name": "Mak Luunim",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Muunilinst"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Muunilinst"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Muun"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Mak Luunim was a Muun male who resided in the city of Pilaan on the planet Muunilinst. Aside from being a collector of art based on himself, Luunim also supported the Rebel Alliance by handling its secret financial accounts. After Alderaan was destroyed by the Galactic Empire's first Death Star, the Alliance lost a significant amount of its funds and needed the secret accounts tended by Luunim.\nLuunim was tasked with meeting Rebels Princess Leia Organa and Luke Skywalker at his home to hand over a datacard that held the account access codes, but Luunim died in an airspeeder accident before he could make contact with them. The Rebels later discovered that Luunim's death was orchestrated by Nal Kenuun, a feared gambler to whom Luunim owed credits.\nMak Luunim was a Muun male who resided in the city of Pilaan on the planet Muunilinst. He was an avid collector of marble sculptures and paintings that depicted his likeness, commissioning Muunilinst's greatest artisans to make them and thus entangling himself in heavy debt to many individuals. Despite his monetary problems, Luunim handled several financial accounts for the Rebel Alliance. In 0 ABY, shortly after the destruction of the Galactic Empire's first Death Star superweapon, Alliance General Jan Dodonna arranged for Luunim to meet with fellow Rebels Princess Leia Organa and Luke Skywalker at the Muun's apartment in Pilaan to hand over a datacard that Luunim was keeping safe. The datacard contained several account access codes that the Alliance desperately needed, as the majority of its funds had been lost when Alderaan, Organa's homeworld, was destroyed by the Death Star.\nHowever, before Luunim could meet with the Rebels, he died in an airspeeder accident due to a failure in its central turbine while mid-air. Luunim's demise was actually orchestrated by Imperial stormtroopers under the employ of Nal Kenuun, a ruthless gambler to whom Luunim owed credits. When Organa and Skywalker, accompanied by the smugglers Han Solo and Chewbacca, who provided transportation to Muunilinst; and Tobin Elad, an Imperial assassin working undercover among the Rebels, arrived at Luunim's apartment, they were greeted by his grieving employee.\nThe employee informed the Rebels that Luunim had already passed away and before they could learn more of what happened, six Imperial stormtroopers appeared and attempted to capture the Rebels. A short skirmish ensued between the two groups, with the Rebels taking down three of the stormtroopers and locking the rest within Luunim's apartment, which was outfitted with a state-of-the-art security system. The Rebels were able to escape unharmed and hid inside one of the city's many cantinas.\nThey later learned from a local bartender that Luunim was in debt to a large number of individuals, and that almost everyone in the city did not believe his death was an accident. Further questioning of the bartender revealed Luunim's debt to Kenuun. The Rebels deduced from the bartender's information that Kenuun had Luunim's apartment raided of anything valuable, including the datacard for which they were looking. Upon meeting Kenuun shortly after, the gambler confirmed their suspicion by admitting his involvement in Luunim's death.\nBeing a Muun, who were known for their financial skills, Luunim was assigned by the Alliance to safeguard a portion of its funds. Luunim was also an avid collector of art, commissioning many artisans to create works of art depicting his own image.\nMak Luunim was created by author Alex Wheeler for the 2008 novel Rebel Force: Target, the first installment in the Star Wars: Rebel Force series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Muunilinst/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/City/Legends",
  "/wiki/Pilaan",
  "/wiki/Planet/Legends",
  "/wiki/Accountant/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Mak_Luunim%27s_apartment",
  "/wiki/Datacard/Legends",
  "/wiki/Death/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Nal_Kenuun",
  "/wiki/Gambling/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Marble/Legends",
  "/wiki/Artist/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/General/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Transport/Legends",
  "/wiki/X-7",
  "/wiki/Assassin/Legends",
  "/wiki/Mak_Luunim%27s_employee",
  "/wiki/Skirmish_at_Mak_Luunim%27s_apartment",
  "/wiki/Cantina/Legends",
  "/wiki/Unidentified_bartender_(Muunilinst)",
  "/wiki/Bartender/Legends",
  "/wiki/Alex_Wheeler",
  "/wiki/2008",
  "/wiki/Rebel_Force:_Target",
  "/wiki/Star_Wars:_Rebel_Force",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/0_ABY"
 ]
}