{
 "name": "Mako_(slicer)",
 "display_name": "Mako  (slicer)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3662 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cheek HoloNet implant",
      "Synthetic Kidney"
     ]
    }
   ]
  }
 ],
 "content": "Mako was a Human female who lived during the Cold War. She was discovered by Braden on the moon Nar Shaddaa, and was hired by him to provide intel and tech for those participating in the Great Hunt.\nBy the age of 7, Mako was an orphan living on Nar Shaddaa and already had earned a reputation for having an unnatural affiliation to all things computer related, including slicing. Her skills were such that she managed to teach herself every known programming language, and at the age of eight, managed to crash the bank account of a red light district orphanage in which she lived, which had attempted to sell her. After escaping the orphanage with a large amount of credits from their account, she found herself working with several of Nar Shaddaa's most notorious slicer gangs. 7 years after her escape, at the age of 15, several of Mako's friends disastrously messed up a job given to them by a Hutt Cartel. Mako was in some way partially blamed for the incident and ended up wounded in an alley where she was found by a bounty hunter named Braden. Braden required a tech specialist for his crew and offered her the job, which she accepted, wanting to leave the moon and let the failed job fade from the Hutt's memories. She soon came to see Braden's crew as her first real family and grew to love the code of honor and underground culture of the bounty hunting world. For a short time, the Trandoshan hunter Qyzen Fess was a bounty hunter who worked for Braden and Mako.\nIn 3643 BBY, Braden had recruited an impressive crew, composed of himself, Mako, a Kadas'sa'Nikto named Jory, and an talented new protégé, to compete in the Great Hunt, a competition held for hunters across the galaxy. But while the Hunter and Mako were out, they returned to discover Braden and Jory murdered. Mako first assumed that the Hunter was the one responsible, but realized that it couldn't be true. Reviewing her holorecordings, they discovered that the perpetrator was Tarro Blood, a cunning Mandalorian who allowed an accomplice to murder Mako's adopted family.\nWithout Braden to negotiate with Suudaa Nem'ro the Hutt for Great Hunt sponsorship, Mako had to call in every favor to get her partner into the Great Hunt. They managed to succeed, though they suffered constant interference from Blood.\nThroughout their travels together, Mako began wondering about her cranial implant and her family. Eventually, she learned that someone named Carteri was poking around Nar Shaddaa asking about her. Confronting the man, Mako learned that she had an identical sister named Coral, on the Republic SIS watch list. Carteri presented Mako a datapad which was lined with encryption that was hard for her to crack. Searching from SIS databases, Mako learned that Carteri didn't exist in them and found something about \"Project 32\". Eventually, she managed to contact Coral, who insisted that an SIS agent named Izak was after her, but wouldn't say why. She sent Mako and her partner to Dromund Kaas, where Mako encountered more identical sisters, who continued to mistake her for Coral.\nMako finally cracked the information on the datapad to allow her to call Izak and trick him into giving away Coral's location on Nar Shaddaa. Confronting Coral, Mako was shocked to hear her own sister calling her a cheap copy. Subduing Coral, Mako chose to hand her over to Izak.\nDuring the Hunter's travels in Rishi, the two were contacted by Thera Markon, daughter of Crysta Markon, their handler during the Great Hunt. Thera told them that Crysta was killed by the Kanawyn Syndicate and was issuing a bounty on them. After taking care of the Syndicate, Thera expressed to the group a desire to use their influence with the Empire to expand her smuggling business to Dromund Kaas, something Mako had mixed feelings towards since it involves betraying their primary clients.\nDuring the Eternal Empire's Conquest, the hunter went missing. Sometime afterward, Mako quit bounty hunting, blaming it for the reason she loses everyone she cares about. After the majority of the group left, she hunted with Torian until Mandalore summoned the clans. She was then left on Carratos.\nEventually Mako would team up with Mandalorian mercenary and former companion to the Voidhound, Akaavi Spar, becoming a bounty hunting duo, but promised themselves to only take contracts against 'bad guys'. The two would later be recruited into the Eternal Alliance by the Outlander while they were hunting down Les Madrin, who they were hired to kill.\nGrowing up as an orphan on Nar Shaddaa, Mako was tougher than she appeared, savvy of the underworld, and very much aware of its dangers. Mako had an intense interest in bounty hunting, loving the code of honor some hunters used and its underworld culture.\nMako was in no way unaware of the dangers and hard truths of bounty hunting such as kidnapping and killing, but accepted them as a necessity of the job. She approved of bounty hunters having a code of honor, such as defending the weak, and avoiding killing when it was possible, such as capturing a target alive. Despite accepting killing as a necessity of hunting, Mako strongly disapproved of killing when other options were available, especially when they were innocent, and had no means of defending themselves, or when the killer took pleasure from it. Despite this, Mako did not object to a hunter killing someone if they asked to die, or if she thought they deserved it.\nMako believed in staying professional and avoided getting romantically involved with other members of the teams she worked with. However, if she truly developed feelings for someone, and they returned them, she would quickly abandon this notion. Above nearly all else, Mako disliked her partner showing any true loyalty to the Empire, preferring to stay free and independent.\nMako was perhaps one of the most gifted and talented slicers in the galaxy during her time. Described as having an unnatural affiliation for every kind of computer as a child, she had taught herself all known forms of programming language by age 7. Mako's natural skills at slicing were further augmented by an advanced cybernetic implant which gave her a direct uplink to the holonet. Her skill was so great that she was able to slice into both Republic and Imperial databases simultaneously and edit records without leaving any traceable trail. An unprecedented feat for a team of slicers let alone one person.\nDespite her young age Mako was proficient with blasters and wielded a vibroknife. In battle, she used medical gear to heal her allies, and employed numerous gadgets to aid her in battle.\nMako was featured in a development diary released by BioWare and later received her own page on the official Old Republic website in the holonet section. She is the first companion for the bounty hunter class in the game. For male Bounty Hunter Classes, Mako may be romanced and married. If the player chooses not to romance her, she may begin a romantic relationship with another of the Hunter's companions, Torian Cadera. The Outlander who is a Bounty Hunter or a Smuggler can recruit both her and her associate Akaavi Spar for the Eternal Alliance.\nHer name is misspelled sometimes as Mayko, which might come from the circumstance that when she was revealed in the English walkthrough, her name was only heard. However, BioWare has written her name as Mako in the subtitles for French and German of that video.\nThere are several phrases written in Aurebesh on her biography page at the official site. When translated, they read: \"SIS Object of Interest,\" \"Coral is Not Mako\" and \"Ran Qyzen.\"\nShe is voiced by Lacey Chabert.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mako_(disambiguation)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Mako_(slicer)",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/3662_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Braden",
  "/wiki/File:Braden-Introduction-Mako-TOR.ogg",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Moon/Legends",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Hutt_Cartel",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Qyzen_Fess",
  "/wiki/3643_BBY",
  "/wiki/Kadas%27sa%27Nikto/Legends",
  "/wiki/Jory",
  "/wiki/Hunter_(individual)",
  "/wiki/Tarro_Blood",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Hutt/Legends",
  "/wiki/Carteri",
  "/wiki/Coral_(Human)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Izak",
  "/wiki/Dromund_Kaas",
  "/wiki/Rishi/Legends",
  "/wiki/Thera_Markon",
  "/wiki/Crysta_Markon",
  "/wiki/Carratos",
  "/wiki/Voidhound",
  "/wiki/Akaavi_Spar",
  "/wiki/Eternal_Alliance",
  "/wiki/Outlander",
  "/wiki/Les_Madrin",
  "/wiki/Vibroknife",
  "/wiki/BioWare",
  "/wiki/Torian_Cadera",
  "/wiki/Alliance_Commander",
  "/wiki/Lacey_Chabert",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}