{
 "name": "Makrit",
 "display_name": "Makrit",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Before 4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Cream"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree tribe"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Logray"
     ]
    }
   ]
  }
 ],
 "content": "Makrit was a male Ewok from Endor. He served as the shaman of the tribe that lived in Bright Tree Village under Chief Buzza, with Logray as his apprentice. At one point, he tried to offer woklings from his own tribe in sacrifice to the Great Devourer, a Gorax who lived near Mount Krana. However, Makrit's treachery was discovered by Chirpa, Ra-Lee, and Logray, who freed the woklings imprisoned in a giant wicker Ewok. Deprived of his offerings, Makrit became the victim of his own designs, as the Devourer ate him instead. In the years that followed, the shaman's betrayal would be immortalized in song by the Ewoks, who bestowed upon him the moniker of Makrit the Untrustworthy.\nA member of the diminutive Ewok race, Makrit hailed from Endor, a forested moon that orbited the gas giant of the same name. In his time, he served as the shaman of the Ewok tribe that dwelled in Bright Tree Village, high in the conifers of Endor. A respected member of his community, he wielded the power of an artifact known as the Sunstar, and had an apprentice named Logray.\nAt one point, a gigantic Gorax embarked upon a devastation spree, notably wreaking havoc in a Dulok village and killing all those inside. Makrit came to worship that Gorax, whom he named \"the Great Devourer,\" and believed the creature could be sated if offered a sacrifice. Therefore, he built a large, Ewok-shaped wicker statue at the foot of Mount Krana, and started kidnapping woklings of his own tribe to fill it with.\nAfter a time, the leader of Bright Tree Village Chief Buzza started worrying about the disappearances, suspecting that Duloks were involved. Makrit, however, put the chief under a whammy, convincing him the missing woklings had probably just wandered away and gotten lost somehow. Some younger members of the tribe, however, were not convinced. Buzza's son Chirpa, his friend Ra-Lee, and Makrit's own apprentice Logray decided to confront the Duloks on their own. When they arrived at the Dulok camp, they found traces of devastation and a gigantic footprint, then were attacked by a lone Dulok who spoke of offerings to the Great One. Makrit, however, had followed Logray and his friends from the village. He paralyzed the Dulok with the power of the Sunstar and let them speak of the sacrifice while maintaining an innocent facade.\nFollowing the directions of the whammied Dulok, the Ewoks then travelled to the place of sacrifice near Mount Krana. When Chirpa and Ra-Lee entered the wicker statue to set the woklings free, Makrit dropped all pretense and locked them inside. Admitting that he was behind the kidnappings, the shaman nevertheless insisted that the sacrifice was necessary. As the Great Devourer approached, Makrit stood in awe. Ra-Lee, however, blew a horn that attracted a group of angry borras. The creatures came trampling down, breaking the wicker statue and thus setting the prisoners free. Makrit could only watch in dismay as Chirpa, Ra-Lee, Logray and the woklings flew on borraback. The shaman realized in horror that the sacrifice still needed to happen, and he was the only remaining Ewok there. The last thing he saw was the open, hungry mouth of the Great Devourer.\nEventually, Makrit's one-time apprentice Logray took the position of shaman, which he still held by the time of the Battle of Endor in 4 ABY. Meanwhile, the memory of Makrit's treachery was immortalized in a song, the ballad of Makrit the Untrustworthy.\nA male Ewok, Makrit had cream-colored fur and brown eyes. To achieve his goals, he was willing to lie, manipulate others, and lead innocents to a certain death.\nMakrit first appeared in the fourth installment in the 5-issue comic book weekly miniseries Star Wars Adventures: Tales from Vader's Castle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Endor",
  "/wiki/4_ABY",
  "/wiki/Ewok",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bright_Tree_tribe",
  "/wiki/Logray",
  "/wiki/Ewokese",
  "/wiki/Shaman",
  "/wiki/Bright_Tree_Village",
  "/wiki/Chief",
  "/wiki/Buzza",
  "/wiki/Wokling",
  "/wiki/Great_Devourer",
  "/wiki/Gorax",
  "/wiki/Mount_Krana",
  "/wiki/Chirpa",
  "/wiki/Ra-Lee",
  "/wiki/Standard_year",
  "/wiki/Music",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Forest",
  "/wiki/Moon",
  "/wiki/Orbit",
  "/wiki/Gas_giant",
  "/wiki/Endor_(planet)",
  "/wiki/Conifer",
  "/wiki/Sunstar",
  "/wiki/Dulok",
  "/wiki/Dulok_camp",
  "/wiki/Boar-wolf",
  "/wiki/Battle_of_Endor",
  "/wiki/Eye",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_4",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle",
  "/wiki/The_Kroolok",
  "/wiki/Life_Day_Treasury",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Chewbacca_and_Other_Aliens_of_the_Rebellion_and_the_Resistance",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded"
 ]
}