{
 "name": "Mal%C3%A9-Dee",
 "display_name": "Malé-Dee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Delegation of 2",
      "000",
      "Delegation of 2",
      "000"
     ]
    }
   ]
  }
 ],
 "content": "Malé-Dee was a human male politician who served in the Senate of the Galactic Republic during the later stages of the Clone Wars. Malé-Dee was one of the senators and officials who greeted Supreme Chancellor Sheev Palpatine at the Senate Office Building after he returned from his rescue aboard the Invisible Hand, above Coruscant. Malé-Dee was also a member of the Delegation of 2,000, a subgroup of the Senate which was concerned with Chancellor Palpatine's conduct during the Clone Wars.\nMalé-Dee, a male human, was a senator serving the Galactic Senate in the late stages of the Clone Wars. He was also a member of the Delegation of 2,000, a group of two thousand senators who grew concerned with how Chancellor Sheev Palpatine was ruling the Galactic Republic.\nFollowing the conclusion of the Battle of Coruscant and the death of Count Dooku, Malé-Dee was one of the many politicians who greeted Chancellor Palpatine after he returned from his captivity aboard the Invisible Hand. Palpatine arrived in front of the Senate Office Building by way of a Util-313 speeder bus, and was escorted by his saviors, Jedi Master Obi-Wan Kenobi and Knight Anakin Skywalker.\nIn the group of politicians, Malé-Dee stood to the left of his fellow Delegation member, the Mon Calamari Meena Tills. After Palpatine departed the shuttle bus, Malé-Dee moved forward with his constituents to greet him. The group of senators turned around to return into the office building, and Malé-Dee conversed with Nee Alavar, another member of the Delegation of 2,000. Palpatine emerged at the front of the group to announce the results of the battle to Jedi Master Mace Windu. With Malé-Dee and his fellow senators behind him, Palpatine announced that Dooku had been killed and that General Grievous had eluded capture.\nAs a member of the Delegation of 2,000, Malé-Dee was one of the two thousand senators who signed the Petition of 2,000, a document formally complaining about the Chancellor's conduct. The document also requested that he relinquish his emergency powers, granted to him at the beginning of the Clone Wars, to the Senate following its conclusion. One day after Palpatine transformed the Republic into the Galactic Empire, sixty-three members of the Delegation were arrested on counts of treason. It is unknown if Malé-Dee was among those arrested.\nKee Chan portrayed Malé-Dee in a brief appearance in Star Wars: Episode III Revenge of the Sith. The character's name is given in the film's closing credits. The character first appeared in the film's novelization as a member of the Delegation of 2000, in which a deleted scene featuring Malé-Dee and other members of the delegation addressing Chancellor Palpatine was adapted. In the new continuity, both the deleted scene and novel are no longer considered canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mal%C3%A9-Dee",
  "/wiki/Mal%C3%A9-Dee/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Delegation_of_2,000",
  "/wiki/Politics",
  "/wiki/Galactic_Senate",
  "/wiki/Clone_Wars",
  "/wiki/Senator",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Invisible_Hand",
  "/wiki/Coruscant",
  "/wiki/Cloning",
  "/wiki/Death",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Util-313",
  "/wiki/Speeder_bus",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mon_Calamari",
  "/wiki/Meena_Tills",
  "/wiki/Nee_Alavar",
  "/wiki/Jedi",
  "/wiki/Mace_Windu",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Petition_of_2,000",
  "/wiki/Standard_day",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Senatorial_arrests",
  "/wiki/Treason",
  "/wiki/Kee_Chan",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(novelization)",
  "/wiki/Delegation_of_2000",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/StarWars.com"
 ]
}