{
 "name": "Malarus",
 "display_name": "Malarus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "First Order military",
      "First Order military"
     ]
    }
   ]
  }
 ],
 "content": "Malarus was a human female who served as a commander in the First Order around 34 ABY. She arrested the First Order Security Bureau Agent Terex after he undertook a rogue mission to destroy the Resistance.\nAfter the First Order Security Bureau Agent Terex defied Captain Phasma's warnings not to embark on a rogue mission to destroy the Resistance, the First Order dispatched Commander Malarus to punish Terex. Malarus brought a Maxima-A class heavy cruiser and several TIE/fo space superiority fighters to the desert planet that Terex had pursued Poe Dameron to. Malarus' space forces wiped out the Ranc Gang's fleet of \"Uglies\" and destroyed Terex's flagship Carrion Spike.\nMalarus then led an Atmospheric Assault Lander and a contingent of stormtroopers and TIE fighters to the planet's surface. She greeted Dameron and his droid BB-8 as he emerged from the cave with the disabled C-3PO and a dejected Terex. After exchanging pleasantries, Dameron warned Malarus that his Black Squadron was capturing footage of their meeting in case she ordered her men to gun him down. Malarus complimented Dameron for his political savvy before ordering him to hand over Terex. Dameron complied, but told Terex about his defeat before dragging Terex towards Malarus.\nMalarus, Terex, and her stormtroopers then boarded the bulk freighter Romary. There, she questioned Captain Perrili about her connections to the Resistance. Despite Perrili's claims about her business just being business, Malarus ordered her to be shot and Romary rigged to explode as their tanker began to siphon the Romary's fuel supply. Malarus then took the Enshado to a hyperspace ring. There, she and the Enshado were confronted by Dameron, who demanded they leave without the Romary's fuel or they would blow up the Romary. Malarus told her forces to hold off Dameron's forces as the Enshado made their way to the hyperspace ring. Unfortunately, Dameron's forces destroyed the ring. Malarus, knowing they were under orders to avoid a direct confrontation with the Resistance, had the tanker's crew abandon the tanker. Malarus then made sure to set the tanker on self-destruct. Unfortunately, only the Romary blew up, and Dameron's forces took the tanker.\nMalarus then spoke to Terrex about Dameron. She and Terex then went to Abednedo to capture Oddy Muva. After capturing Muva, she told his wife, Sowa Chuan, to tell Dameron about her husband's capture. Aboard a transport, Malarus had Terex interrogate Muva for information on the Resistance. She was then informed that X-wings were coming their way and that another officer had captured Jessika Pava, Karé Kun and their team at Spalex. Malarus then had Dameron and Wexley taken aboard the Enshado. She then took the Enshado to Spalex to capture the rest of Black Squadron. She then ordered Terex to kill Muva, seeing him as dead weight. However, Terex released Muva, who then helped Dameron and Wexley escape. Malarus and Terex then took a Xi-class light shuttle to Spalex to finish off the last of Black Squadron. They were stopped by Dameron and Wexley in their X-wings. Malarus then watched as Muva made a suicide run on the Enshado and then made her escape into hyperspace.\nMalarus then traveled to Cato Neimoidia using Dameron's own X-wing. There she incapacitated Dameron's astromech droid, BB-8, and engaged Dameron, in a fighter borrowed from Baron Paw Maccon, in head-to-head combat. During their dogfight, Malarus showed no remorse about causing civilian casualties. She gained the upper hand in the engagement and as she went in for the kill, BB-8 reactivated himself and took control of the fighter. After BB-8 was picked up by Dameron in a mid-air ship transfer, Malarus crashed. She was confronted by an official of House Reya, who arrested her and said they would give her a trial.\nMalarus was a tall blonde human woman with an amber right eye. Her left eye was artificially black due to the introduction of a naturally occurring narcotic. The narcotic also promoted her body-mass growth and intelligence, and retarded her aging. She tied her hair into a tight bun. Malarus complimented Resistance pilot Poe Dameron for his savvy.\nMalarus first appeared in the 2017 comic book Poe Dameron 13, which was written by Charles Soule and illustrated by Phil Noto. When creating Malarus, Soule asked Noto to model the character after actress Brigitte Nielsen's character from the film Rocky IV.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/First_Order",
  "/wiki/First_Order_military",
  "/wiki/Commander",
  "/wiki/34_ABY",
  "/wiki/First_Order_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/Battle_over_a_desert_planet",
  "/wiki/Resistance",
  "/wiki/Captain",
  "/wiki/Phasma",
  "/wiki/Maxima-A_class_heavy_cruiser",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Unidentified_desert_planet",
  "/wiki/Poe_Dameron",
  "/wiki/Realspace",
  "/wiki/Ranc_Gang",
  "/wiki/Fleet",
  "/wiki/Ugly",
  "/wiki/Flagship",
  "/wiki/Carrion_Spike",
  "/wiki/AAL-1971/9.1_Troop_Transport",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/TIE_line",
  "/wiki/Planet",
  "/wiki/Droid",
  "/wiki/BB-8",
  "/wiki/Cave",
  "/wiki/C-3PO",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Politics",
  "/wiki/Romary",
  "/wiki/Perrili",
  "/wiki/First_Order_tanker",
  "/wiki/Enshado",
  "/wiki/Hyperspace_transport_ring",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Abednedo_(planet)",
  "/wiki/Oddy_Muva",
  "/wiki/Sowa_Chuan",
  "/wiki/Jessika_Pava",
  "/wiki/Kar%C3%A9_Kun",
  "/wiki/Spalex",
  "/wiki/Xi-class_light_shuttle",
  "/wiki/Cato_Neimoidia",
  "/wiki/Astromech_droid",
  "/wiki/Baron",
  "/wiki/Paw_Maccon",
  "/wiki/Starfighter_combat",
  "/wiki/House_Reya",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Resistance_pilot",
  "/wiki/2017",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Poe_Dameron_13",
  "/wiki/Charles_Soule",
  "/wiki/Phil_Noto",
  "/wiki/Category:Images_of_Malarus",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Poe_Dameron_15",
  "/wiki/Poe_Dameron_16",
  "/wiki/Poe_Dameron_17",
  "/wiki/Poe_Dameron_18",
  "/wiki/Poe_Dameron_19",
  "/wiki/Poe_Dameron_22",
  "/wiki/Poe_Dameron_23",
  "/wiki/Poe_Dameron_24",
  "/wiki/Poe_Dameron_31",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/First_Order_Conversion_Kit",
  "/wiki/TIE/fo_Fighter_Expansion_Pack_(Second_Edition)",
  "/wiki/Xi-class_Light_Shuttle_Expansion_Pack",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_59",
  "/wiki/Starfighter_Aces",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Poe_Dameron_11",
  "/wiki/Marvel_Comics"
 ]
}