{
 "name": "Malleus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taanab"
     ]
    },
    {
     "name": "Born",
     "values": [
      "39 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown",
      "yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Boma Clan",
      "Exploration Corps",
      "Boma Clan",
      "Exploration Corps"
     ]
    }
   ]
  }
 ],
 "content": "Malleus, who was originally known as Telloti Cillmam'n, was a Force-sensitive Human male from Taanab. Born during the last years of the Galactic Republic, he was detected by the Jedi Order at a young age and sent to be trained at the Jedi Temple of Coruscant as a member of the Boma Clan of Initiates. At the age of thirteen, he fought in the Apprentice Tournament to attract the attention of a potential Jedi Master. Failing to be selected, he was subsequently deemed too old to become a Padawan learner. As was customary, he was forced to join the ranks of the Exploration Corps instead.\nIn 19 BBY, after seven years of service in the Corps, Cillmam'n was dispatched to Nicht Ka with Master Ekim Ryelli and Staguu Itincoovar. Once there, he found the armor and lightsaber of the ancient Dark Jedi Warb Null. After donning the armor, Cillmam'n was flooded with visions that made him turn to the dark side. Carried away by his newfound power, he dueled Ryelli, whom he ended up killing by decapitation, and, after disposing of Itincoovar as well, he left the planet. Now a Dark Jedi himself, Cillmam'n assumed the identity of Malleus, the Hammer of the Dark Side.\nA native of the agriworld of Taanab in the Inner Rim of the galaxy the Human male Telloti Cillmam'n was born in 39 BBY, during the waning decades of the Galactic Republic. He was keenly atuned to the Force, a mystical energy field that sprung from all lifeforms. The infant's potential attracted the attention of the Jedi Order, an ancient order of protectors unified by their belief and observance of the Force. As was traditional among the Jedi, Cillmam'n was taken from his family to undergo training on the planet Coruscant, capital of the Republic and seat of the Jedi Order.\nHe grew up in the Jedi Temple, where he was sorted in the Boma Clan—one of several groupings of Jedi Initiates that were designed to appeal to the traits of their members. His classmates included another male Human, Lumas Etima, with whom the Taanab-born youngling would later develop a rivalry. As all members of the Boma Clan, Cillmam'n enjoyed the personal attention of Yoda, the Grand Master of the Order, who gave them lightsaber instructional courses. Like most Jedi initiates, he did not remember anything about his parents or homeworld. As a child, he maintained good relations with Even Piell and Jocasta Nu, both senior Jedi Masters, who would tell him tales of the Jedi clashing with Sith Lords in the days of old. Piell's stories in particular thrilled the young Human, who began to dream that he too would be remembered in history.\nAs was custom in the Order, an initiate had to attract the attention of a Jedi Master and become a Padawan learner when he or she achieved the age of thirteen. Otherwise, he or she would be considered too old to proceed in his or her advanced training. In 26 BBY, Cillmam'n participated in the Jedi Temple's annual lightsaber tournament as part of the Apprentice Trials. He hoped that, by exhibiting his combat skills and Force talents, he would be able to catch a Master's eye. During the tournament, Cillmam'n bested most of his fellow younglings, including Lumas Etima. In spite of that, no Jedi Master claimed him as Padawan. On top of that, Cillmam'n bitterly witnessed Etima, whom he had dueled and defeated, being chosen by Master Ekim Ryelli. Like many other washouts, he was transferred by the Council of Reassignment to the Exploration Corps, a branch of the Jedi Service Corps, where his talents would be used for archaeology and scouting rather then defending the galaxy with a lightsaber. Meanwhile, the teaching relationship between Ryelli and Etima was cut short when the Clone Wars broke out in 22 BBY. While the two were fighting the battle droids of the Separatist Droid Army on Geonosis, the apprentice ended up being killed whereas the master lost three fingers on his left hand. That traumatic incident reinforced Cillmam'n's opinion that he should have been chosen instead of Etima. As for Ryelli, he retired from combat and became a Jedi archaeologist.\nFrom 26 to 19 BBY, Cillmam'n piloted a Pathfinder scout vessel in the Exploration Corps, although he did it with lingering bitterness and disappointment. In 19 BBY, while the Clone Wars were drawing to a close, Cillmam'n was tasked with accompanying Master Ryelli to Nicht Ka, an ammonia-washed world located on the border of the ancient Sith Empire, along with the Givin astrogator Staguu Itincoovar. Once the Jedi explorers had set foot into the ruins, the archaeologist started examining a few peculiar carvings on the walls. After sending Itincoovar back to their ship so he could do some philological research and help decipher the carvings, Ryelli allowed Cillmam'n to look around the place in the mean time. In another room, the young pilot came across an antique armor that had once belonged to Warb Null, Dark Jedi and metallurgist extraordinaire, whose brief reign of terror had been ended by the Jedi Ulic Qel-Droma in 3998 BBY. The suit was complete, except for the missing right glove, and came with a special, long-handle lightsaber. Feeling a strange fascination for that artifact, Cillmam'n put on the entire suit of armor, and was instantly flooded with visions and voices of the ancient Sith history. With the strength of that armor, the young man thought he could bring an end to the Clone Wars on his own by killing Dooku, leader of the Separatist Confederacy that fought against the Republic.\nWhen Master Ryelli found him, the corruption of the dark side had already tightened its grip on Cillmam'n, who refused to take the armor off. He confronted the archaelogist, asking the question that had haunted him for seven years: why he had chosen Etima rather than him. As Ryelli refused to answer, Cillmam'n started blaming him for not having brought the ongoing war to an end when he had the occasion. To the chagrin of Ryelli, the two then engaged in a violent lightsaber duel. Using the hidden, secondary blade of Null's weapon, Cillmam'n ended up beheading the Jedi archaeologist. At the very moment that Ekim Ryelli breathed his last, Itincoovar tried to contact him via comlink to announce that the Clone Wars had been won by the Republic and that all Jedi were called back to Coruscant by the Supreme Chancellor Palpatine himself. Cillmam'n got to the Pathfinder and, after disposing of the Givin astrogator, elected to leave the planet. Although he briefly considered returning to Coruscant as the Chancellor's message ordered, he finally opted not to, since he did not consider himself a Jedi anymore. Now a follower of the dark ways, he renamed himself Malleus, the Hammer of the Dark Side, and felt ready to impose his law on the whole galaxy.\nTelloti Cillmam'n was a brown-skinned man sporting black, frizzy hair which he styled in a large, rounded shape. His eyes, although originally brown, turned a sulfuric yellow with the corruption of the dark side. From a very tender age, when he was studying at the Temple, Cillmam'n had a thirst to prove himself. He wished nothing more than becoming one of those legendary warriors he had heard about in the tales of Even Piell and Jocasta Nu. When Etima was chosen as a Jedi apprentice instead of him, Cillmam'n was very affected, and he harbored a lasting resentment toward Master Ryelli from that moment on. Bitter and craving for greatness, Cillmam'n's troubled mind offered fertile ground for the dark side of the Force.\nTelloti Cillmam'n, alias Malleus, was created Star Wars author Edward M. Erdelac for use in Hammer, a short story written for the 147th issue of the Star Wars Insider magazine. The narrative was illustrated throughout by Joe Corroney, with the help of the colorist Brian Miller.\nIn Latin, the substantive malleus, mallei literally means \"hammer\" or \"mallet,\" which fits that character's self-awarded epithet of \"Hammer of the Dark Side.\" On his personal blog, Erdelac commented that Cillmam'n's personality was partly inspired by George C. Scott's portrayal of the U.S. General George S. Patton in the 1970 titular movie Patton. Like the movie's hero, Cillmam'n is frustrated at being sidestepped by history. Being a failed Jedi apprentice who finds himself under the direction of a disheartened warrior, Cillmam'ns understands that his dreams of glory are destined to fail, which ultimately paves his way to the dark side. On his Facebook account, Erdelac also commented that he and his editor were \"hopeful for more Malleus in the future.\" However, on April 25, 2014, Lucasfilm announced that the Expanded Universe was being reorganized under the new non-canon \"Star Wars Legends\" banner to make way for a new line of continuity, led by principle projects Star Wars Rebels and the Star Wars sequel trilogy, to take shape.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taanab/Legends",
  "/wiki/39_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Boma_Clan",
  "/wiki/Exploration_Corps/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_Temple_Apprentice_Tournament",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Nicht_Ka",
  "/wiki/Ekim_Ryelli",
  "/wiki/Staguu_Itincoovar",
  "/wiki/Armor/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Warb_Null",
  "/wiki/Duel_on_Nicht_Ka",
  "/wiki/Sai_cha/Legends",
  "/wiki/Hammer_of_the_Dark_Side",
  "/wiki/Agriworld/Legends",
  "/wiki/Inner_Rim",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Jedi_Initiate_Clan/Legends",
  "/wiki/Lumas_Etima",
  "/wiki/Yoda/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Even_Piell/Legends",
  "/wiki/Jocasta_Nu/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/26_BBY/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Council_of_Reassignment/Legends",
  "/wiki/Jedi_Service_Corps/Legends",
  "/wiki/Archaeology/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Jedi_archaeologist",
  "/wiki/Pilot/Legends",
  "/wiki/Pathfinder_(Jedi)",
  "/wiki/Scout_vessel",
  "/wiki/Ammonia/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Givin/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Metallurgy/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/3998_BBY",
  "/wiki/Glove/Legends",
  "/wiki/Long-handle_lightsaber",
  "/wiki/Sith/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Sulfur/Legends",
  "/wiki/Star_Wars",
  "/wiki/Edward_M._Erdelac",
  "/wiki/Hammer_(short_story)",
  "/wiki/Star_Wars_Insider_147",
  "/wiki/Star_Wars_Insider",
  "/wiki/Joe_Corroney",
  "/wiki/Brian_Miller",
  "/wiki/1970",
  "/wiki/April_25",
  "/wiki/2014",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Sequel_trilogy",
  "/wiki/January_21",
  "/wiki/File:Erdelac_on_Hammer.png",
  "/wiki/The_Essential_Atlas",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Freedon_Nadd_Uprising_1",
  "/wiki/May_9",
  "/wiki/2020",
  "/wiki/StarWars.com"
 ]
}