{
 "name": "Mallie Marek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 19 BBY and 18 BBY",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Marek",
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Mallie Marek was a Human female who served in the Clone Wars as a Jedi Knight of the Galactic Republic. Although raised and instructed to uphold the Code of the Jedi Order, Mallie developed an emotional attachment to Kento Marek, a fellow Jedi Knight whom she met on the planet Talus. Defying strict tenets of the Order, Mallie and Kento married in secret after falling in love with each other. During their self-imposed exile, the Republic was reorganized into the Galactic Empire and all Jedi—including former Jedi—were declared enemies of the New Order. In order to escape the Great Jedi Purge, Mallie and her husband went into hiding, eventually settling on Kashyyyk, the homeworld of the Wookiee race.\nAt some point after building their home on Kashyyyk, Mallie gave birth to a son, Galen Marek. Not long afterward, Mallie fought a group of Trandoshan slavers in defense of the Wookiees and to protect her family. Her subsequent death forced Kento Marek to raise their only son on his own. When Sith Lord Darth Vader launched a massive invasion on Kashyyyk, Kento Marek was killed in a duel against the Sith Lord. But since Mallie's son was an extremely rare prodigy of the Force, Vader chose to train Galen Marek as his own secret apprentice and personal assassin. In time, Mallie Marek and her husband were forgotten by their son, who knew himself only as \"Starkiller.\" Before Galen's redemption and untimely demise, he recovered a few repressed memories of the father and mother that he could barely remember.\nBefore marrying into the Marek family, Mallie fought for the Galactic Republic during the Clone Wars. Trained as a Knight of the Jedi Order, she and her fellow Jedi were commissioned to serve as commanders and generals in the Grand Army of the Republic. While fighting against Separatists on the planet Talus, Mallie became acquainted with a fellow Jedi Knight named Kento Marek.\nUnlike Mallie, who had no interest in fame and glory through war, Marek was a thrill-seeking young Jedi that yearned to make a great name for himself on the battlefield. Regardless of their different views on the war, the two Jedi gradually developed a rapport with each other. Even though infatuation and especially love were expressly forbidden by the Jedi Code, Kento and Mallie developed feelings for one another. Their mutual attraction culminated into a secret marriage, thus forcing them both into a self-imposed exile as the Order continued to fight on behalf of the Republic. Disguising themselves as a pair of medics, the two former Jedi abandoned the Clone Wars and escaped into the Outer Rim Territories in order to forge a new life together.\nWhen the Sith Lord Darth Sidious, the true persona of Chancellor Palpatine, issued Order 66 to the clone troopers, thousands of Jedi officers were murdered by their own soldiers. Sidious used the opportunity to reorganize the Republic into the first Galactic Empire. Under his New Order, every single Jedi—including ex-Jedi—were targeted for extermination. In order to escape from the galactic-wide genocide, Mallie and Kento Marek hid on Kashyyyk where they were protected by the Wookiees.\nWhile living together in their new home on Kashyyyk, Mallie gave birth to a boy and named him Galen Marek. Due to her respect and admiration for the Marek family's Wookiee allies, Mallie often told stories of the Wookiees' renowned strength and bravery to her son. However, their time together was cut short when a group of Trandoshan slavers infiltrated Kashyyyk with the intention of capturing Wookiees in order to sell them into slavery. In the midst of the fighting, Mallie convinced her husband to take Galen to safety while she defended the Wookiees against the slavers. Although extremely reluctant to leave his wife behind, Kento agreed that he was the logical choice, due to his greater knowledge of the area's terrain.\nAs Kento took their son to safety, Mallie charged into the fighting and, using her yellow-bladed lightsaber, killed many Trandoshans with her in the process. Her efforts, however, cost Mallie her life. In honor of his wife's sacrifice, Kento became resolved to raise Galen on his own while remaining on Kashyyyk. Yet he too would be killed, thus leaving Galen Marek as an orphan to be raised by his father's killer, Darth Vader. Galen, having lost both parents at very early point in his life, was too young to remember either of them while constantly trying to survive under Vader's brutal training regimen. Under the codename \"Starkiller,\" Mallie's son became the Sith Lord's secret apprentice and relentless enforcer.\nAs Starkiller grew into a young man, devoid of any recollection of his mother and father, he developed a fierce sense of loyalty to his master. Despite years of the brutality and virtual torture that defined the training methods of the Sith, Darth Vader was the closest thing that Starkiller had to a father. Thus, he willingly obeyed Vader's will without question, killing many individuals throughout his short life without mercy or hesitation. However, he would later be redeemed and become a Jedi himself before sacrificing his life to save the fledgling Rebel Alliance.\nGalen Marek's untimely demise necessitated Darth Vader's attempts to clone the dead son of Kento and Mallie Marek, hoping to create a version of Starkiller without the emotional attachments of the original. But due to the inconvenient unreliability of cloning, the project was held back by consistent failures that produced aberrant monstrosities. The more stable versions of Galen were undermined by the identity crises that resulted as a side effect of the memory imprints. Following the Battle of Kamino, the legacy of Mallie and Kento Marek was shared by their late son's between two surviving clones—Subject 1138 and the Dark Apprentice. Although the former clone, who also became known as Starkiller, inherited Galen's feelings for Juno Eclipse, he spared no feelings for the dead parents of his genetic donor. As far as he was concerned, neither Kento or Mallie mattered to him at all. The Dark Apprentice succeeded where all of his cloned brethren failed by purging himself of Galen's emotions, with the exceptions of anger and hatred.\nMallie Marek was a compassionate Jedi Knight who believed in defending the freedom and safety of others. She possessed a strong sense of sympathy for those who suffered and, as a result, fought in the Clone Wars to protect civilians that were caught in the crossfire. Unlike most other young Jedi, Mallie was not a thrill-seeking adventurer who yearned for glory and recognition. She saw service in the Grand Army of the Republic as an unfortunate necessity rather than an opportunity for fame and excitement. Her convictions were strong enough to cause Kento Marek, a fellow member of the Jedi Order, to see the war through her point of view.\nAfter Kento and Mallie settled on Kashyyyk as man and wife, Mallie came to regard the Wookiees as honorable and trustworthy allies. When she gave birth to a son, Galen Marek, Mallie would tell stories to her son of the Wookiees' famous exploits and also taught him how to build a friendship band. She deeply loved her family and was willing to sacrifice her life so that they could live.\nAs a trained Knight of the Jedi Order, Mallie Marek was gifted with a connection to the Force that was strong enough to deem her worthy for Jedi training. On Kashyyyk, shortly before her death, Mallie wielded a yellow-bladed lightsaber against mercenary slavers. Her skills in lightsaber combat enabled her to strike down many Trandoshans before she was ultimately overwhelmed and killed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_of_Marek",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Kento_Marek",
  "/wiki/Planet/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Species/Legends",
  "/wiki/Kento_Marek%27s_hut",
  "/wiki/Galen_Marek",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Kashyyyk_(c._18_BBY)",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sith_training",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_assassin/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Battle_on_Death_Star_I",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Aberrant_clone",
  "/wiki/Memory_flash",
  "/wiki/Assault_on_Kamino",
  "/wiki/Kamino/Legends",
  "/wiki/Subject_1138",
  "/wiki/Dark_Apprentice",
  "/wiki/Juno_Eclipse/Legends",
  "/wiki/Prime_clone",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/The_Force_Unleashed_II_(novel)",
  "/wiki/Star_Wars:_The_Force_Unleashed:_Prima_Official_Game_Guide",
  "/wiki/Databank_(original)",
  "/wiki/PlayStation_3",
  "/wiki/Xbox_360",
  "/wiki/Star_Wars:_The_Force_Unleashed_II"
 ]
}