{
 "name": "Malva_Greeku",
 "display_name": "Malva Greeku",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Malva Greeku was a male Rodian, who worked for Black Sun during the time of the Galactic Republic.\nGreeku was given command of the YU-410 light freighter Cutting Strike, to carry out raids and acts of piracy on the behalf of Black Sun. He chose to operate near to the Hydian Way trade route and earned himself a reputation as a capable captain and a skilled fighter.\nWhen he learned from an inside source that the Action IV transport Azure Queen was going to be traveling down the Hydian Way with a valuable cargo of medical supplies, Greeku spent weeks planning an operation to capture the ship. He believed that if he was successful, he would be able to become a Black Sun enforcer and so gain more power and wealth. To capture the transport, Greeku sent out a distress call, claiming to be a Republic ambassador. The Queen then left its course to try and find the ambassador and the Strike then attacked the transport on the edge of an asteroid belt.\nThe Queen's hyperdrive was brought off-line during the attack, so Greeku led a boarding party over to it, to take control of the transport and then repair it. He planned to then fly the transport to Nar Shaddaa. However, the Republic dispatched an ILH-KK Citadel-class civilian cruiser to recapture the Queen, and it ambushed the Cutting Strike. Greeku then sent a transmission to the cruiser, warning its crew not to board the Queen. However, Republic troops were sent over anyway, and they attacked Greeku and the other Black Sun boarders.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/YU-410_light_freighter",
  "/wiki/Cutting_Strike",
  "/wiki/Pirate/Legends",
  "/wiki/Hydian_Way/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Action_IV_transport",
  "/wiki/Azure_Queen",
  "/wiki/Asteroid_belt",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/ILH-KK_Citadel-class_civilian_cruiser",
  "/wiki/Galaxy_at_War"
 ]
}