{
 "name": "Malyssa_Raventhorn",
 "display_name": "Malyssa Raventhorn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zeltron"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Malyssa Raventhorn was a female Zeltron thief and the mistress of Imperial Captain Mulchive Wermis during his time as administrator of The Wheel space station. After Wermis's death, which was due to a fatal heart attack caused by an attack on the Imperials on the Wheel by the New Republic, Raventhorn disappeared.\nA female Zeltron, Malyssa Raventhorn lived during the reign of both the Galactic Empire and its successor, the New Republic. During the Galactic Civil War, in which the Empire fought the Alliance to Restore the Republic, she worked as a thief, and was the only bounty the Chadra-Fan bounty hunter Tutti Snibit apprehended. He was, however, so distracted by Cambrian wine and conversation with Raventhorn that he passed out, which allowed her to escape. Later, she became the mistress of the Human Mulchive Wermis, a captain in the Imperial Navy. Whilst Raventhorn was with Wermis, he was transferred from being captain of the Star Destroyer known as Devastator to station duty aboard the space station known as The Wheel. Wermis brought Raventhorn with him to the station and served as its administrator for several years, growing obese and sedentary in the posting and secretly claiming a small portion of the profits for himself instead of delivering them to the Empire.\nWermis's time as administrator ended when the Besh Gorgon system, where the Wheel was located, was liberated by the newly formed New Republic, an event that caused Wermis to have a fatal heart attack. On the same day as her lover's death, Raventhorn, as well as all of Wermis's stolen credits, vanished without a trace.\nMalyssa Raventhorn was first mentioned in the article The Not-So Magnificent Seven written by Greg Mitchell. Her backstory was later elaborated on in the second entry of Viva Space Vegas! The History of the Marvelous Wheel, a pair of articles released in 2013 on the StarWars.com blog and written by Abel G. Peña and Rich Handley.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zeltron/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Mulchive_Wermis",
  "/wiki/Administrator/Legends",
  "/wiki/The_Wheel/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Death/Legends",
  "/wiki/Heart/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Chadra-Fan/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Tutti_Snibit",
  "/wiki/Cambrian_wine",
  "/wiki/Human/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Devastator/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Besh_Gorgon_system/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/The_Not-So_Magnificent_Seven",
  "/wiki/Greg_Mitchell",
  "/wiki/Viva_Space_Vegas!_The_History_of_the_Marvelous_Wheel",
  "/wiki/2013",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Blog",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Rich_Handley"
 ]
}