{
 "name": "Malyas",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Believers"
     ]
    }
   ]
  }
 ],
 "content": "Malyas was a male Human who served the Believers Sith-worshipping cult during the latter years of the Galactic Republic. Around 31 BBY, Malyas was attacked and defeated at a secret Believer hideout in the undercity of the planet Coruscant by a group of spacers.\nMalyas was a male Human scoundrel who lived during the waning years of the Galactic Republic and served the Believers, a Sith-worshipping cult active in the Cularin system. Around 31 BBY, the Believers enacted a scheme to seize the Pulas, a powerful Sith artifact that had been uncovered on the planet Almas by the Jedi Order. Malyas was among a group of Believers who gathered in a secret hideout within the undercity of the galactic capital planet Coruscant following the capture by the cultists of a Mandalorian iron box which the cultists suspected contained the Pulas. In truth, the box was a decoy and instead contained a fragment of the dark side-imbued city Conkesta.\nA team of spacers arrived at the Believer base in pursuit of the stolen artifact. In the resulting altercation, Malyas and the other cultists were defeated and the Mandalorian iron box was recovered from the Believers' clutches.\nMalyas was a proficient fighter and combat situations he would move stealthily to ambush his adversaries.\nWhile at the Believer hideout in the Coruscant undercity, Malyas wore street clothes. He was armed with a dagger and a blaster pistol.\nMalyas appeared in Coruscani Dawn, a 2002 roleplaying adventure that formed part of the Living Force campaign. In the adventure, the players roleplay as the spacers who fight Malyas while in pursuit of the stolen Mandalorian iron box. If player characters fail to apprehend a Believer who is keeping guard at the entrance to the cultists' base, Malyas and the other Believers ready themselves to fight and prepare an ambush for when the spacers arrive. Otherwise, when the player characters arrive at the hideout, Malyas is just milling about in the base and is taken by surprise by the spacers' arrival. Following either eventuality, it is possible for Malyas to be incapacitated or killed by the player characters in the subsequent battle.\nThough Malyas is depicted in Coruscani Dawn as a member of the Believers, a cult devoted to the dark side of the Force, the adventure does not clarify whether he is a Force-user. He is provided with roleplaying statistics in the adventure and these do not indicate that he was proficient with any Force powers.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Believers",
  "/wiki/Sith/Legends",
  "/wiki/Sith_cult",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Coruscant_Believers_base",
  "/wiki/Coruscant_underworld",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Scoundrel",
  "/wiki/Cularin_system",
  "/wiki/Pulas",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Almas",
  "/wiki/Jedi_Order/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Mandalorian_iron",
  "/wiki/Sith_Cultist",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/City/Legends",
  "/wiki/Conkesta",
  "/wiki/Coruscani_Dawn",
  "/wiki/Canon",
  "/wiki/Mandalorian/Legends",
  "/wiki/Iron/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Dagger/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/2002",
  "/wiki/Roleplaying_game",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Spacer/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Belly_of_the_Beaast",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}