{
 "name": "Mama Stammoch",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Mama Stammoch was a human female mechanic who operated a shop on the Smuggler's Moon Nar Shaddaa during the reign of the Galactic Empire. At some point, the bounty hunter Dengar raced for Stammoch though he eventually ran up gambling debts with Stammoch which he did not pay. Between 3 ABY and 4 ABY, Dengar returned to Stammoch with fellow bounty hunter Beilert Valance, who had been injured by the Crimson Dawn assassin Deathstick and was in need of repairs. Stammoch greeted the pair at the door and expressed surprise at seeing Dengar without the credits he owed her but ultimately allowed the two in. Stammoch stabilized Valance's core processor, but discovered that his human heart was running out of time due to the amount of strain put on it by his cybernetics. She then spoke with Dengar about her discovery, who informed his old boss that he only needed Valance alive long enough to collect a bounty on Boba Fett, before he asked Stammoch what she knew about Crimson Dawn. Stammoch recounted the history of the Shadow Collective established during the Clone Wars and then informed Dengar about Crimson Dawn's history after the war.\nAs Stammoch finished, Valance stated that Stammoch's words sounded like fairy tales, but added that the assassin who had attacked him seemed real enough. Stammoch asked what the assassin looked like and after Valance displayed an image of the assassin, Stammoch recognized the image as Deathstick and began to panic. When Dengar asked if she was okay, Stammoch replied that by going to her shop, Valance and Dengar had gotten them all killed. Dengar tried to down play the threat and suggested that Stammoch was just overreacting. At that moment, however, Deathstick destroyed the entrance to the shop and assured Dengar that Stammoch had not been overreacting. As Deathstick began to kill Stammoch's crew, the mechanic reminded Dengar of her warning about Deathstick, and when Dengar responded he thought she was just being dramatic, Stammoch expressed regret that she didn't simply kill Dengar when he first arrived and she had had the chance. As Deathstick drew closer to the two bounty hunters and Stammoch, Dengar set off a thermal detonator, which allowed him and Valance to escape the shop in a landspeeder.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Technician",
  "/wiki/Smuggler",
  "/wiki/Moon",
  "/wiki/Nar_Shaddaa",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Bounty_hunter",
  "/wiki/Dengar",
  "/wiki/Racer",
  "/wiki/Gambling",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Bounty",
  "/wiki/Beilert_Valance",
  "/wiki/Crimson_Dawn",
  "/wiki/Assassin",
  "/wiki/Deathstick",
  "/wiki/Credit",
  "/wiki/Processor",
  "/wiki/Heart",
  "/wiki/Time",
  "/wiki/Cybernetics",
  "/wiki/Boba_Fett",
  "/wiki/Shadow_Collective",
  "/wiki/Clone_Wars",
  "/wiki/Death",
  "/wiki/Thermal_detonator",
  "/wiki/Landspeeder",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Mama_Stammoch",
  "/wiki/Bounty_Hunters_14",
  "/wiki/Bounty_Hunters_23",
  "/wiki/StarWars.com",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}