{
 "name": "Mandalore_the_Lesser",
 "display_name": "Mandalore the Lesser",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3653 BBY",
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Mandalore the Lesser was the title bestowed upon the Human male leader of the Mandalorian warrior clans during the Great Galactic War and the Cold War. Before becoming Mandalore, the man was a young member of the then-scattered warrior clans. He lived on Geonosis as one of the many Mandalorian gladiators who participated in arena fights for prestige. Although he was a proficient fighter in his own right, his rise to fame was dramatically accelerated by the intervention of Imperial Intelligence, an espionage agency of the reconstituted Sith Empire.\nAgents of Imperial Intelligence identified the young man as a possible pawn they could use to reunite the Mandalorian clans and direct them into an alliance with the Sith. The agents fast-tracked his path to infamy by rigging his gladiatorial matches and spreading the word that he was to become the new warrior-king of his people, Mandalore. He accepted the title and the power it carried, but became subservient to the Empire that built him. As an act of loyalty, the new Mandalore directed his followers to blockade the Hydian Way. The blockade crippled the Galactic Republic against whom the Empire was fighting and placed the Sith as the apparent victors of the Great Galactic War.\nAlthough the blockade on the Hydian Way lasted for a year, it was eventually broken by intrepid smugglers led by the Mirialan Hylo Visz. After the conflict, Mandalore needed to re-energize his people, and so organized the Great Hunt—a galaxy-wide competition for glory. The Hunt's victor challenged the Mandalore to a duel and won, killing the warrior-king and claiming the title for himself; becoming Mandalore the Vindicated. It was later revealed to the galaxy that the Mandalore who had risen to fame on Geonosis was nothing more than an Imperial puppet, and history remember him as \"the lesser\" of the Mandalores.\nDuring the Great Galactic War, the reconstituted Sith Empire tried to recruit the Mandalorians to fight for them. But only a small number of them chose to join. In an attempt to gain all the Mandalorians, Imperial Intelligence decided to find a new Mandalore to reunite the scattered warriors.\nThe individual who would become this new Mandalore was initially a gladiator fighting in the arenas of Geonosis. Aside from his incredible skills, Imperial Intelligence would sabotage his opponents so he would always win. After rising to prominence there, he took the title of Mandalore and called for the scattered Mandalorians to reunite. The Mandalorians answered, and he promised to lead them to great glory. In reality, the new Mandalore was a Sith puppet.\nThe Sith's new alliance with the Mandalore brought the stalemate in the war to a swift end as he led the Mandalorians to blockade the Hydian Way.\nThe blockade rendered the Hydian inaccessible, hindering the Republic war effort and causing a major economic depression in the Core Worlds. The Knights of the Jedi Order, fighting on behalf of the Republic, attempted to break the blockade; however, the Mandalorians soundly defeated them. Seeing a profit to be made in victory against the Mandalorians, the Mirialan smuggler Hylo Visz later led her fellow smugglers in a battle against the blockade which resulted in the defeat of the Mandalore's warriors and the opening of the Hydian Way.\nSome time after the Treaty of Coruscant was signed, Mandalore the Lesser attempted to re-energize the Mandalorians and restore his support among them by reviving a several centuries old competition that spanned the galaxy, known as the Great Hunt. The victor of this \"new\" Great Hunt, however, challenged Mandalore the Lesser to a duel in which he killed Mandalore the Lesser by shooting him to death, and then proclaimed himself the new Mandalore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Mandalore_the_Lesser",
  "/wiki/3653_BBY",
  "/wiki/Geonosis/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Mandalore_(title)",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Gladiator/Legends",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Imperial_Agent",
  "/wiki/Sith/Legends",
  "/wiki/Blockade_of_the_Hydian_Way",
  "/wiki/Hydian_Way/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Mirialan/Legends",
  "/wiki/Hylo_Visz",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/The_galaxy/Legends",
  "/wiki/Mandalore_the_Vindicated",
  "/wiki/Gnost-Dural",
  "/wiki/File:Mandalore%27sCall-Timeline3.ogg",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Great_Hunt_(c._3653_BBY)",
  "/wiki/Category:Images_of_Mandalore_the_Lesser",
  "/wiki/Timeline_3:_The_Return_of_the_Mandalorians",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Timeline_4:_The_Empire_Changes_Strategy",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/The_Holonet",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Canderous_Ordo",
  "/wiki/3954_BBY",
  "/wiki/3667_BBY"
 ]
}