{
 "name": "Mander_Zuma",
 "display_name": "Mander Zuma",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "New Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tionne Solusar"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Toro Irana"
     ]
    }
   ]
  }
 ],
 "content": "Mander Zuma was a male Human Jedi archivist who served as a Master in the New Jedi Order. He took an apprentice, Toro Irana, who later died during an investigation into Hutt criminal circles.\nZuma was a male Human living during the New Republic who had considerable Force-sensitivity. Zuma trained at the Jedi Praxeum on Yavin 4, becoming a Archivist and a Jedi Knight. He took an apprentice, Toro Irana, who was often frustrated by Zuma's lack of desire for accomplishment and heroism. When Irana died under suspicious circumstances on Makem Te, Zuma went to investigate the death.\nZuma's path led him to encounter Reen Irana, his Padawan's sister, who was also investigating the death. They soon learned that Irana had been connected to a drug called Scourge.\nMander Zuma was more at home in the Jedi Archives than in the field, so his combat skills were rusty, coupled with his own doubts of whether he could be a successful Jedi. Mander was able to use telekinesis, Force speed, and mind tricks, but was also susceptible to the latter, following his apprentice's suggestion to lower his blade. Juxtaposed to this weakness, he was very knowledgeable about mind tricks and how to counter them; with Empty Meditation. He wasn't the best at blast deflection, nor lightsaber dueling for that matter, being quickly disarmed by the inexperienced Mika the Hutt. Many even noted that he was not what they expected, when meeting him, further feeding his feelings of self-doubt. However, Mander was described as strong in the Force, and after he defeated Mika, erased his mental hang-ups and felt his former apprentice's blue lightsaber in his hand as an extension of his own.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/Toro_Irana",
  "/wiki/Jedi_archivist/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Death/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Makem_Te/Legends",
  "/wiki/Reen_Irana",
  "/wiki/Jedi/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_speed",
  "/wiki/Mind_trick/Legends",
  "/wiki/Meditation_of_Emptiness",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Mika_Anjiliac_Chiera",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Mander_Zuma",
  "/wiki/Scourge_(novel)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}