{
 "name": "Mandragall",
 "display_name": "Mandragall",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1052 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith"
     ]
    }
   ]
  }
 ],
 "content": "Mandragall was a Human male Sith Lord who ruled a region of space during the Republic Dark Age. By using mercenaries and pirates, he was able to achieve significant military success, but he was eventually murdered by the Sith Xelian.\nMandragall was a Human male who became a Sith Lord during the Republic Dark Age. While in his youth, Mandragall discovered a holocron that had belonged to Elcho Kressh, an individual who had served the Sith during the time of the Great Hyperspace War. Mandragall eventually became the ruler of a region of space, but he came into conflict with rival Sith Lords, and he found himself without sufficient troops to defend his territories. He attempted the defend his borders using droids, but the scheme failed, so he consulted Kressh's holocron to try and find an alternative solution. The device contained records of an operation enacted by Kressh to create an army by forming alliances with mercenaries and pirates. Mandragall followed Kressh's plan word for word: eventually, three-quarters of his forces were independent operators, and he achieved significant military success against his opponents.\nBy 1052 BBY, Mandragall was aged, and he was seduced by the Sith Xelian, who murdered him during the night. In the aftermath of his death, a number of his rivals rose up, only to discover the fleeting nature of Mandragall's army. Eventually, the tactics used by Mandragall spread, and other Sith began to utilize independent fighting forces. The mercenary Jarrow Rusher later recited the story of Mandragall and Kressh to the Jedi Knight Kerra Holt in 1032 BBY.\nMandragall knew more about the Sith of previous eras than his rivals did. Due to the fact that he allowed his forces to retain autonomy, many independent operators fleeing from enslavement by other Sith Lords were willing to fight for Mandragall.\nMandragall was mentioned in the novel Knight Errant, which was written by John Jackson Miller and published in January 2011.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/1052_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Republic_Dark_Age",
  "/wiki/Mercenary/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Death/Legends",
  "/wiki/Xelian",
  "/wiki/Elcho_Kressh%27s_holocron",
  "/wiki/Elcho_Kressh",
  "/wiki/Time/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Army/Legends",
  "/wiki/Jarrow_Rusher",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kerra_Holt",
  "/wiki/1032_BBY/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Knight_Errant_(novel)",
  "/wiki/John_Jackson_Miller",
  "/wiki/January",
  "/wiki/2011",
  "/wiki/Standard_year/Legends",
  "/wiki/StarWars.com",
  "/wiki/The_New_Essential_Chronology"
 ]
}