{
 "name": "Mandalore_the_Vindicated",
 "display_name": "Mandalore the Vindicated",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3636 and 3630 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Lok"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Artus Lok was a Human male Mandalorian warrior of Clan Lok who lived during the Great Galactic War, a galaxy-wide conflict between the Galactic Republic and the resurgent Sith Empire. Sometime after the signing of the Treaty of Coruscant, the reigning Mandalore—seeking to regain support after being defeated during the Blockade of the Hydian Way—organized a competition for glory known as the Great Hunt, which was held on a galactic scale. Artus eventually became the Grand Champion of the Great Hunt, and challenged the Mandalore to a duel in the gladiatorial arenas on the planet Geonosis. He successfully killed the Mandalorian leader and took the title of Mandalore the Vindicated. He began to consolidate his power over the Mandalorian clans, destroying an uprising led by Jicoln Cadera, who believed the Mandalorians should support the Republic. After defeating Cadera's faction, Mandalore the Vindicated ensured that his Mandalorians remained allies of the Sith Empire.\nArtus Lok, a Human male, was a Mandalorian warrior who lived during the Great Galactic War, which was a galactic conflict between the Galactic Republic and the resurgent Sith Empire. Seven years prior to the Sacking of Coruscant, the reigning Mandalore—who was a puppet ruler secretly serving the Sith Empire—was defeated during the Blockade of the Hydian Way. After this, Mandalore organized a galaxy-wide competition for glory, known as the Great Hunt. Artus fought during the competition, eventually becoming the Grand Champion of the Great Hunt.\nArtus challenged Mandalore to a duel in the gladiatorial arenas on the planet Geonosis. He killed the Mandalorian leader and assumed the title of Mandalore the Vindicated. After defeating the Mandalore—who became known as Mandalore the Lesser—he began to consolidate his power over the Mandalorian clans. During this time, Mandalore defeated an uprising by a faction of Mandalorians led by Jicoln Cadera, who believed that the Mandalorians should follow the ways of Mandalore the Preserver—who fought during the Mandalorian Wars and the Jedi Civil War three centuries prior—and support the Republic. After defeating Cadera's Mandalorians, Mandalore the Vindicated ensured that his Mandalorians remained well-paid, yet cautious, allies of the Sith Empire. Under his leadership, the Mandalorians prospered. However, several of his contemporaries believed that their Mandalore was not content with being an ally of the Sith, and secretly harbored greater ambitions.\nDuring the Cold War, Artus summoned the latest Grand Champion to his flagship, the Spirit of Vengeance. He commended the Hunter for avenging Hedarr Soongh, preventing the Great Hunt list from being leaked, and stopping Tarro Blood. He sent the Hunter to Dromund Kaas to kill a Sithspawn and bring its heart as a trophy. Upon his Champion's successful return, Artus introduced the other Grand Champions, Bloodworthy, Jewl'a Nightbringer and the Defenestrator. He declared the Hunter worthy of gaining access to the Blacklist, a confidential list of impossible bounties reserved only to the Grand Champions.\nArtus then confessed that with war threatening to reignite, he wanted the Hunter to stand as his replacement among the Grand Champions, revealing that slaying the Sithspawn was a test. The Hunter gladly accepted his offer and became a Mandalorian.\nWhen a Republic strike team sent by Jun Seros assaulted the Grand Champions' party on Nar Shaddaa to celebrate the Hunter's successful Blacklist kills, killing Bloodworthy, Jewl'a, and Defenestrator, Artus sent a message to his surviving Champion, demanding that they avenge their fallen comrades upon the cowardly Republic scum.\nArtus was later present on Ilum as part of the emergency war council gathered to discuss Darth Malgus' New Empire.\nDuring the Eternal Empire's Conquest, Mandalore summoned all of the clans to him. It was rumored that the Mandalorians continued to fight against the Eternal Empire, but no one had seen physical proof. Mandalore the Vindicated was said to have died in a battle against the Eternal Empire, members of his clan saw him being swarmed by Skytroopers. The manner of the Mandalore's death would later cause a grudge to form within the clans regarding droids. Shae Vizla reluctantly took on the mantle of Mandalore sometime after Artus' death.\nMandalore the Vindicated was a tall human male with dark skin and dark hair which he kept shaven. He had hardened facial features, however he was not as gruff as many other Mandalorians.\nMandalore the Vindicated was respected, even revered by his people. He had once held a deep friendship with former Clan chief of Cadera, Jicoln Cadera. But when Artus defeated the puppet Mand'alor and claimed the title, he and Jicoln fought each other for their views soon clashed. Despite having defeated his former friend and promised to destroy Torian Cadera, he never carry out his promise but left him alive, indicating there's possible regret in his actions. Mandalore still chose to aid the Sith but not firmly as he was cautious of their allies. Artus Lok was also known for a hatred for the bloodthirsty Mandalorian clan chieftain Mavrix Varad, calling him a \"rancor with a forming mouth\", and had standards when it came to his warriors' conduct as shown by his dislike for the dishonorable Mandalorian, Tarro Blood.\nDespite the deep bloody history between Jicoln and Artus, he had shown no grudge against his son and sent a message to the Grand Hunt Champion to take care of him in his travels, showing he did care about the young Mandalorian warrior. The Mand'alor had shown a liking towards the Mandalorian drink Ne'tra gal, drinking much of his after adopting the Great Hunt champion into his clan.\nMandalore the Vindicated first appeared in the video Timeline 4: The Empire Changes Strategy, which was released on the official website of the PC video game Star Wars: The Old Republic. He later received an entry in the \"Biographies\" section of the website's \"Holonet\" feature. On Mandalore's biographical entry, there are several phrases in Aurebesh. When translated, they read \"Mandalore the Vindicated,\" \"champion needed,\" and \"Jedi merely first\".\nThe Bounty Hunter player character in The Old Republic meets Mandalore onboard his cruiser, the Spirit of Vengeance, at the beginning of Act II of their storyline. Mandalore calls on the Hunter, the newly-crowned Grand Champion of the Great Hunt, to slay \"the Ghost in the Darkness\" - a massive terentatek in the jungles of Dromund Kaas - and bring back its heart as proof. Upon doing so, Mandalore offers to induct the Hunter into his clan and requests that the Hunter replace him on the Blacklist, an exclusive group of hunters made up of other Grand Champions, in order to ensure that a Mandalorian remains among their number. With a Mandalorian taking his place, he explains, he can return to \"winning the Sith's wars for them\". Whether the Hunter chooses to join or not is up to the player.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Mandalore_the_Vindicated",
  "/wiki/Lok_(disambiguation)",
  "/wiki/3636_BBY",
  "/wiki/3630_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Clan_Lok",
  "/wiki/Mandalorian/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Gnost-Dural",
  "/wiki/File:ColdWarMandalore-Timeline4.ogg",
  "/wiki/Great_Galactic_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Mandalore_the_Lesser",
  "/wiki/Blockade_of_the_Hydian_Way",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Mandalore_(title)",
  "/wiki/Gladiator/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Death/Legends",
  "/wiki/Crusader%27s_schism",
  "/wiki/Jicoln_Cadera",
  "/wiki/Sith/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Canderous_Ordo",
  "/wiki/Mandalorian_Wars",
  "/wiki/Jedi_Civil_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Hunter_(individual)",
  "/wiki/Spirit_of_Vengeance",
  "/wiki/Hedarr_Soongh",
  "/wiki/Tarro_Blood",
  "/wiki/Dromund_Kaas",
  "/wiki/Sithspawn/Legends",
  "/wiki/Bloodworthy",
  "/wiki/Jewl%27a_Nightbringer",
  "/wiki/Defenestrator",
  "/wiki/Blacklist",
  "/wiki/Jun_Seros_(Jedi)",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Ilum/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/New_Empire",
  "/wiki/Eternal_Empire",
  "/wiki/Skytrooper",
  "/wiki/Mandalore_the_Avenger",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Torian_Cadera",
  "/wiki/Mavrix_Varad",
  "/wiki/Ne%27tra_gal",
  "/wiki/Timeline_4:_The_Empire_Changes_Strategy",
  "/wiki/Personal_computer",
  "/wiki/Video_game",
  "/wiki/Aurebesh/Legends",
  "/wiki/Terentatek/Legends",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Seeing_Red",
  "/wiki/The_Holonet",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Old_Republic",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3653_BBY",
  "/wiki/Alliance_Commander",
  "/wiki/Standard_year/Legends",
  "/wiki/3631_BBY",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}