{
 "name": "Mandalorian prisoner",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorian Neo-Crusaders"
     ]
    }
   ]
  }
 ],
 "content": "A Mandalorian prisoner was captured by the Sith during the Jedi Civil War.\nThe prisoner's ship was captured by Sith forces near Korriban. He was brought in for interrogation at the Sith Academy on the planet as to the location of his weapons cache. The interrogator knew that if the prisoner's drug threshold was brought too high, he would go into shock and be useless and too low of a threshold would simply lead to him adamantly refusing to reveal the location of his hidden weapons cache.\nAs luck would have it, Revan, the amnesiac former Sith Lord who was posing as a Sith student to find the Star Map on Korriban, happened upon him. The interrogator gave Revan a chance to obtain the desired information, promising that the opportunity would win him significant prestige.\nRevan asked the prisoner if there was a way to get him out of the situation. The prisoner, who chose to speak Ryl rather than Basic, was at first reluctant to trust Revan, but eventually complied and told Revan to give him enough truth serum to put him into a catatonic state. Revan did so, slowly putting him into shock. In return, the prisoner gave him the location of his cache, hidden under a trap door in his ship. The prisoner then passed out; the interrogator decided to take him away and dump him somewhere barren, inadvertently allowing him a chance to escape.\nHowever, in an ironic twist of events, Uthar Wynn had recently had the prisoner's ship scrapped for parts, assuming it had been thoroughly scanned for the weapons cache. Nevertheless, when Revan gave Uthar the location of the weapons cache, Uthar awarded him prestige for getting information that others were unable to retrieve.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Jedi_Civil_War",
  "/wiki/Korriban",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Planet/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Star_Map",
  "/wiki/Prestige",
  "/wiki/Twi%27leki/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Uthar_Wynn",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide"
 ]
}