{
 "name": "Maneeli_Tuun",
 "display_name": "Maneeli Tuun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Polis Massa"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 52 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kallidahin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "5 feet",
      "3 inches"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "50 pounds"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple and white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Archaeological Research Council"
     ]
    }
   ]
  }
 ],
 "content": "Maneeli Tuun was a Kallidahin male who was native to the Polis Massa asteroid field. He spoke in sign language and was telepathic. Tuun worked for the Archaeological Research Council on Polis Massa and was part of the medical team that delivered the twins of Senator Padmé Amidala when she was brought to an archaeological dig site on Polis Massa in 19 BBY. Tuun's stolen identity profile was later used by the pirate Hondo Ohnaka to test potential employees of Ohnaka Transport Solutions in Black Spire Outpost on the planet Batuu around 34 ABY.\nManeeli Tuun was a Kallidahin male who was born in the Polis Massa asteroid field around 52 BBY. Tuun came to work at an archaeological dig site on Polis Massa for the Archaeological Research Council. The aim of the Kallidahin efforts at the dig site was to find traces of the extinct Eellayin species—the supposed ancestors of the Kallidahin—and discover why the planet Polis Massa was destroyed.\nWhen the pregnant human Senator Padmé Amidala was brought to the dig site by her allies in 19 BBY, Tuun was part of the medical team that helped to deliver her twins, Luke and Leia. Amidala was also heavily injured, and her condition was judged to be so critical that Tuun and the rest of the team did not have time to change out of their caving jumpsuits. Only two of the technicians on the team were trained physicians, with the rest being xenobiologists who were usually attached to the archaeological team in order to analyze artifacts for organic tissue. After the twins were successfully delivered, Amidala died despite the best efforts of the team. The dig site was later completely abandoned.\nDuring the First Order occupation of the planet Batuu around 34 ABY, Tuun was 86 years old. At the time, the Kallidahin's stolen identity profile was in the possession of the pirate Hondo Ohnaka, who used the profile along with several others to test a group of potential new employees for his company, Ohnaka Transport Solutions. Ohnaka hoped to use the employees in a heist he was planning. In order to test the employees' ability to memorize details from a cover identity, he sent the profiles, including Tuun's, to the employees' datapads and then quizzed them on details from the data.\nLike the other Kallidahin technicians at the Polis Massa dig site, Maneeli Tuun had had little contact with humans and so knew little about their parturition. He and the others involved in the delivery asked few questions of those accompanying the pregnant Padmé Amidala, showing discretion in their task. The team was baffled when it could not save the senator's life. Tuun had purple-and-white skin, red eyes, and no hair. Tuun spoke using sign language and was telepathic. He stood 5 feet, 3 inches tall and weighed fifty pounds.\nTuun wore a form-fitting caving body-suit that was blue-and-brown in color and revealed his body growth-rings. The suit had a remote control mounted on the left shoulder and a brown surgical hood sealed onto it at the neck. Tuun carried sample containers in part of the suit and had several silver cylinders attached to his left wrist.\nManeeli Tuun was created for the prequel trilogy film, Star Wars: Episode III Revenge of the Sith, but he does not appear in the final cut of the film, which was released on May 19, 2005. In the current Star Wars canon, Tuun was first pictured in the twenty-second issue of De Agostini's Star Wars: Build the Millennium Falcon magazine series, which was released on around June 3, 2015. The character was then identified in the 2017 reference book Star Wars: The Visual Encyclopedia. Tuun then made his first appearance in Star Wars: Datapad, an app that launched alongside the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios Park in 2019. In the Star Wars Legends continuity, Maneeli Tuun was first mentioned in the the reference book Star Wars: Revenge of the Sith: The Visual Dictionary, which was written by James Luceno and released on April 2, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Maneeli_Tuun",
  "/wiki/Maneeli_Tuun/Legends",
  "/wiki/Polis_Massa",
  "/wiki/52_BBY",
  "/wiki/Kallidahin",
  "/wiki/Gender",
  "/wiki/Foot",
  "/wiki/Pound",
  "/wiki/Color",
  "/wiki/Archaeological_Research_Council",
  "/wiki/Homeworld",
  "/wiki/Asteroid_field",
  "/wiki/Sign_language",
  "/wiki/Telepathy",
  "/wiki/Twin",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Archaeology",
  "/wiki/Polis_Massa_Base",
  "/wiki/19_BBY",
  "/wiki/Thief",
  "/wiki/Pirate",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Ohnaka_Transport_Solutions",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/34_ABY",
  "/wiki/Reproduction",
  "/wiki/Eellayin",
  "/wiki/Species",
  "/wiki/Human",
  "/wiki/Luke_Skywalker",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Time",
  "/wiki/Jumpsuit",
  "/wiki/Technician",
  "/wiki/Doctor",
  "/wiki/Xenobiologist",
  "/wiki/Death",
  "/wiki/First_Order",
  "/wiki/Battle_of_Batuu",
  "/wiki/Standard_year",
  "/wiki/Heist_on_a_First_Order_train",
  "/wiki/Datapad",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/May_19",
  "/wiki/2005",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_22",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/June_3",
  "/wiki/2015",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/2019",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Revenge_of_the_Sith:_The_Visual_Dictionary",
  "/wiki/James_Luceno",
  "/wiki/April_2",
  "/wiki/File:FlightCrewsWanted-IDIntro.png",
  "/wiki/File:ManeeliTuun-GEDatapad.png",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Mustafar_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_month",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/File:WazellmanProfile-GEDatapad.jpg",
  "/wiki/Darth_Vader_(2020)_5",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_2",
  "/wiki/January_14",
  "/wiki/January_8",
  "/wiki/November_6",
  "/wiki/2016"
 ]
}