{
 "name": "Mantu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Manaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selkath"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.54 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray-pink"
     ]
    }
   ]
  }
 ],
 "content": "Mantu was a Selkath bounty hunter from the planet Manaan. He was one of his species' greatest legends, which was not a good thing when concerning the nature of his people. Although the Selkath were renowned as a peaceful race, Mantu on his own helped diminish that image with his deadly bounty hunting tactics. Mantu's nature eventually caught the eye of the Sith Lord Count Dooku and the Phindian criminal mastermind Moralo Eval, who invited Mantu to participate in a series of challenges at the Box on the planet Serenno.\nAt some point in his life, Mantu became a bounty hunter, and became well known across the galaxy. In 20 BBY, during the Clone Wars, Mantu was invited, along with other fellow bounty hunters, by the Sith Lord Count Dooku and the Phindian criminal mastermind Moralo Eval to participate in a series of challenges at the Box on Serenno.\nCompeting against other bounty hunters in the potentially fatal challenges, the victors would receive the honor of kidnapping Supreme Chancellor Sheev Palpatine of the Galactic Republic. Mantu did well the first two challenges and made it to the third. Once there, the bounty hunters discovered that the room was in reality a ray shield cage, and the only way to pass the shield guarding the control switch would be a shot of a deadly serum which would protect its user from the shields' energy. Quickly, Rako Hardeen ordered the bounty hunters to follow Derrown, the only one who could survive the serum. Mantu and the other bounty hunters, minus Jakoli, who was electrocuted to death by a shield that rose from the floor, proceeded across the lifting platforms. Unfortunately, Mantu inadvertently touched the shield with his arm, and was electrocuted and rendered semi-unconscious. When Mantu recovered his senses, weakened, he grabbed a platform to stop his fall, but was used as a bridge by Embo, and then the platform that supported his feet descended, electrocuting Mantu again, and he fell off the platforms to his death.\nMantu was far from being a typical Selkath. He was a squat hunched being with cold, clammy skin, and had a murderous twinkle in his eye, the greatest difference between him and the other members of his species, as unlike him, his species was known for being a helpful and peaceful culture devoted to the care of their oceans and to the tending of the ill. Ironically, Mantu was one of the most well known modern legends of his species, as a deadly and bloody bounty hunter who relied on surprise to target his prey, much to his species' hatred.\nMantu wielded a deactivator hold-out pistol at the Box.\nMantu was created for the TV series Star Wars: The Clone Wars, and appeared in the episode \"The Box.\" Mantu's body model was a repainted and modified model that was used for another Selkath character who appeared previously in the episode \"Padawan Lost.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mantu",
  "/wiki/Mantu/Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Manaan",
  "/wiki/20_BBY",
  "/wiki/Serenno",
  "/wiki/Selkath",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Planet",
  "/wiki/Species",
  "/wiki/Eye",
  "/wiki/Sith_Lord",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Phindian",
  "/wiki/Moralo_Eval",
  "/wiki/Box",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Republic",
  "/wiki/Ray_shield",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Derrown",
  "/wiki/Jakoli",
  "/wiki/Death",
  "/wiki/Embo",
  "/wiki/Deactivator_hold-out_pistol",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Box",
  "/wiki/Morgo",
  "/wiki/Padawan_Lost",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Bane%27s_Story",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/No_Disintegrations_(Fantasy_Flight_Games)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Mantu",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Prisoners",
  "/wiki/Standard_year"
 ]
}