{
 "name": "Mar Tuuk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Neimoidia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.09 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Ryloth blockade",
      "Ryloth blockade"
     ]
    }
   ]
  }
 ],
 "content": "Mar Tuuk was a male Neimoidian who bore the rank of captain in the Confederacy of Independent Systems' naval branch during the Clone Wars. A native of the Colonies world of Neimoidia, Tuuk was charged with overseeing a Separatist blockade over the besieged world of Ryloth in the first year of the war, following his triumph over the Galactic Republic's relief supply fleet commanded by Admiral Dao. Later, in 21 BBY, commanding from a Lucrehulk-class Battleship, the Neimoidian's fleet of Munificent-class star frigates were assaulted in an expected attack by a Republic task force led by Jedi General Anakin Skywalker—whom Tuuk had held respect for as a military officer—who was dispatched with orders to breach Tuuk's blockade in order for the Republic to liberate the Twi'lek homeworld.\nAmid the engagements in Ryloth's orbit, the Neimoidian captain was able to lure Skywalker and his forces into a trap, which led to the loss of a single of the Jedi's three Venator-class Star Destroyers, following the arrival of Separatist reinforcements. Not long after the Republic was forced to flee, Tuuk learned his adversary helmed the Venator-class Star Destroyer Resolute, Skywalker's flagship, and upon learning his enemy, ordered his fleet to reassume their defensive positions, as he understood Skywalker would return. However, as he expected, Skywalker returned aboard the heavily damaged Venator-class Star Destroyer Defender, offering a false surrender to the Neimoidian. Despite Skywalker's deception, Tuuk fell into the Jedi's trap as the Defender proceeded to crash into and destroy the Neimoidian's flagship, but not before the captain fled his command ship, allowing for the Resolute to return to the star system and destroy the remaining frigates.\nA male Neimoidian who hailed from the planet Neimoidia in the galaxy's Colonies region, Mar Tuuk served within the Confederacy of Independent Systems as a captain of its naval branch during the onslaught of the Clone Wars against the Galactic Republic. When the Confederacy and its military forces, led by Techno Union Foreman Wat Tambor, invaded the Outer Rim Territories planet Ryloth in the first year of the war, Tuuk was placed as the commanding officer of the Confederacy's planetary blockade, helming a fleet of six Munificent-class frigates from a single Lucrehulk-class Battleship at the center. In the Confederacy's preliminary stages of their campaign, the Neimoidian captain's fleet was engaged by a Republic relief supply fleet led by Admiral Dao, while the Separatist Droid Army fought against a small garrison of clone troopers commanded by Jedi General Ima-Gun Di on the surface.\nDuring the battle, Tuuk's forces managed to engage Dao's fleet in orbit to a critical point, rendering them low on supplies, such as fuel and ammunition, while the forces below fought against the droid army on their final reserves. In spite of Tuuk's successes, the Republic admiral sent a message to the Jedi High Council on the Republic capital world of Coruscant, asking for the dispatchment of immediate assistance to Ryloth. But as Dao preached his message, the Neimoidian's forces destroyed the first of his Venator-class Star Destroyers, with his flagship following shortly after as the Separatist blockade disabled their defensive shielding and main reactor.\nAs a result of Tuuk's triumph over Dao's fleet, the Neimoidian positioned his fleet in blockade style above Ryloth, while the droid army eliminated the remaining troopers from the Outer Rim garrison on the surface. However, shortly after their victory and resulting occupation of Ryloth, a small group of three Republic Pelta-class frigates sent from the nearby planet Toydaria arrived in the planet's atmosphere and successfully breached Tuuk's blockade. From there, they delivered food and medical supplies to the starving population of Twi'leks on the surface.\nFollowing the Confederacy's occupation of Ryloth, in 21 BBY, the Republic dispatched a task force of three Venator-class Star Destroyers under the command of Jedi General Anakin Skywalker, with orders to break through Tuuk's blockade to allow the safe landing of a Republic invasion fleet led by Jedi Generals Mace Windu and Obi-Wan Kenobi, to further their liberation campaign of the planet. Though, as Tuuk had anticipated an assault upon his blockade, the Neimoidian ordered four of his Munificent-class star frigates away from the Ryloth system prior to the Republic's arrival. Before the arrival of Skywalker's forces, Tuuk consulted with Emir Tambor, who pondered on the preparedness of both the captain and his fleet for the approaching conflict. Certain in his forces' strength, the Neimoidian expressed that his enemies would be unable to break through the blockade, in belief that the Republic forces would be caught off guard by the trap he had set. Prepared for battle, Skywalker's fleet arrived in the star system and deployed the V-19 Torrent starfighter Blue Squadron, led by Skywalker's Padawan, Jedi Commander Ahsoka Tano, against the blockade as the Neimoidian ordered squadrons of Vulture-class droid starfighters to fend off the attacking starfighters.\nWhile the Venator-class Star Destroyers Resolute—Skywalker's flagship—Defender and Redeemer remained behind to provide support fire for their starfighters, Tuuk examined the Republic's warships and discovered that the leading commander helmed the Resolute, the flagship of General Skywalker, and realized who his opponent was. As a result, upon being alerted by a B1-series battle droid to the quickly closing Blue Squadron, the Neimoidian instructed his bridge crew to remain patient, awaiting Skywalker to reveal his attack strategy before employing countermeasures. Soon thereafter, though, with the Republic's starfighters on a clear approach to his command ship, Tuuk ordered the four away frigates, such as Battlecruisers 17 and 19, to reinforce the blockade and assume their attack positions, which caught the Republic forces off guard.\nWith the Republic lured into his trap and outnumbered, Tuuk began to apply pressure onto Skywalker's fleet, as the Jedi Knight's Star Destroyers suffered a series of suicidal attacks against their hulls from the Neimoidian's droid starfighters. In response to their broken battle lines, Admiral Wullf Yularen ordered the withdrawal of the attacking Blue Squadron, which had maintained its pursuit of Tuuk's battleship as they became surrounded by the vulture droids, much to the Neimoidian's pleasure. Despite Tano's continued pursuit, Tuuk's unrelenting assault on the heavily damaged Star Destroyers forced the Padawan to return to the Republic fleet, but not before losing several of her pilots in the process. Upon Blue Squadron's return, Skywalker ordered the immediate withdrawal of his fleet from the star system, but before it could escape, the damaged Redeemer tore apart in space amid their retreat. Informed of the Republic's retreat, Tuuk's bridge crew pondered on their potential pursuit of their fleeing adversaries, but instructed the blockade to retain their defensive positions and allow the Republic to flee.\nWhen the Defender entered the system all alone, Tuuk was contacted by Skywalker, who offered his surrender in exchange for safe passage of food and medical supplies to the Twi'leks. Tuuk was all to happy to accept and gain the glory of defeating Skywalker, but he soon realized that Skywalker was tricking him when a battle droid told him that there was only one life-form aboard and that all power was being directed to the forward shields. Tuuk watched in horror as the Defender barreled towards his command ship, and after ordering all batteries to target the crippled Republic cruiser, realized it was no use and abandoned ship. Once his ship was destroyed by the Defender crashing into it, Ahsoka arrived with the rest of Skywalker's fleet to destroy Tuuk's blockade, allowing for Republic troops led by Jedi Generals Mace Windu and Obi-Wan Kenobi to land on the planet.\nMar Tuuk was a capable tactician and a prepared leader. As he helmed the Separatist's blockade at Ryloth, he was very familiar with his opponent, the Jedi General Anakin Skywalker. He had a respect for the general but was confident that he would prevail. However, ultimately he was tricked by Skywalker and abandoned ship when Skywalker rammed one of his damaged Venator-class Star Destroyers into his command ship.\nDuring the blockade of Ryloth, Tuuk wore a blue and gray robe with a blue hat featuring the Separatist hex icon. He used a pair of data goggles to interface with his ship.\nMar Tuuk first appeared in \"Storm Over Ryloth,\" the nineteenth episode of the first season of the Star Wars: The Clone Wars television series,which was released on February 27, 2009.\nMar Tuuk was named after Dave Filoni's deceased cat Tuuk.The spinning scope device on Tuuk's data goggles was partly inspired by the mechanical monocle worn by a Ko-Dan fleet officer in the 1984 film The Last Starfighter.\nTuuk was originally going to die aboard his ship, but George Lucas and the show's crew found the character too interesting, so Tuuk was spared. A new scene of him leaving the bridge was added late in the making of the episode \"Storm Over Ryloth,\" and a battle droid stating that Tuuk fled in an escape pod was also added. Also in the original scene, before he was chosen to be spared by the writers, had a panicked battle droid tell the Neimoidian what they should do next, in which Tuuk replied that \"we die\".",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mar_Tuuk",
  "/wiki/Mar_Tuuk/Legends",
  "/wiki/Mar_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Neimoidia",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Ryloth_blockade",
  "/wiki/Military_rank",
  "/wiki/Captain",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/Clone_Wars",
  "/wiki/Colonies",
  "/wiki/Planet",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Ryloth",
  "/wiki/22_BBY",
  "/wiki/Galactic_Republic",
  "/wiki/Dao%27s_fleet",
  "/wiki/Commanding_officer",
  "/wiki/Admiral",
  "/wiki/Dao",
  "/wiki/21_BBY",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Fleet",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Skywalker%27s_fleet",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Officer",
  "/wiki/Blockade",
  "/wiki/Twi%27lek",
  "/wiki/Homeworld",
  "/wiki/Orbit",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Star_Destroyer",
  "/wiki/Resolute",
  "/wiki/Flagship",
  "/wiki/Defender",
  "/wiki/Unidentified_Lucrehulk-class_Battleship",
  "/wiki/Command_ship",
  "/wiki/Ryloth_system",
  "/wiki/Frigate",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_military",
  "/wiki/Techno_Union",
  "/wiki/Foreman",
  "/wiki/Wat_Tambor",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Outer_Rim_garrison",
  "/wiki/Clone_trooper",
  "/wiki/Ima-Gun_Di",
  "/wiki/Fuel",
  "/wiki/Droid",
  "/wiki/Army",
  "/wiki/Jedi_High_Council",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Dao%27s_flagship",
  "/wiki/Deflector_shield",
  "/wiki/Reactor",
  "/wiki/Pelta-class_frigate",
  "/wiki/The_Matter_of_Using_Toydarian_Territory_to_Aid_the_Shipment_of_Relief_Supplies_to_the_Citizens_of_Ryloth",
  "/wiki/Toydaria",
  "/wiki/Foodstuff",
  "/wiki/File:OurBlockadeIsImpenetrable-SOR.ogg",
  "/wiki/Jedi",
  "/wiki/General",
  "/wiki/Ryloth_invasion_fleet",
  "/wiki/Mace_Windu",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Emir",
  "/wiki/V-19_Torrent_starfighter",
  "/wiki/Blue_Squadron_(Galactic_Republic)",
  "/wiki/Padawan",
  "/wiki/Jedi_Commander",
  "/wiki/Ahsoka_Tano",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Starfighter",
  "/wiki/Redeemer",
  "/wiki/Warship",
  "/wiki/B1-series_battle_droid",
  "/wiki/Bridge_(starship)",
  "/wiki/Battlecruiser_17",
  "/wiki/Battlecruiser_19",
  "/wiki/Jedi_Knight",
  "/wiki/Suicide",
  "/wiki/Hull",
  "/wiki/Wullf_Yularen",
  "/wiki/Star_system",
  "/wiki/Battle_droid",
  "/wiki/Starship",
  "/wiki/Robe",
  "/wiki/Hat",
  "/wiki/Separatist_hex_icon",
  "/wiki/Data_goggles",
  "/wiki/Storm_Over_Ryloth",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/February_27",
  "/wiki/2009",
  "/wiki/Tuckerization",
  "/wiki/Dave_Filoni",
  "/wiki/1984",
  "/wiki/Death",
  "/wiki/George_Lucas",
  "/wiki/Escape_pod",
  "/wiki/Category:Audio_files_of_Mar_Tuuk",
  "/wiki/Category:Images_of_Mar_Tuuk",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_23",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Recusant-class_Destroyer_Expansion_Pack",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_52",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Supply_Lines",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Blue_Shadow_Virus_(episode)",
  "/wiki/Innocents_of_Ryloth",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}