{
 "name": "Maramis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shili"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Togruta government",
      "Togruta guard",
      "Togruta guard"
     ]
    }
   ]
  }
 ],
 "content": "Maramis was a Togruta male who served Regasa Elarec Yovet as the captain of the Togruta guard. He and his guard accompanied the regasa to the Republic Fair on the planet Valo. When the fair was attacked by Nihil raiders, Maramis provided assistance to the survivors.\nShortly before the Valo Republic Fair opening, Maramis joined Elarec Yovet as she traveled from her homeworld of Shili to Lonisa City on Valo. The regasa and Maramis were joined by members of the Togruta Guard. Maramis was equipped with a kiavene, a long-barbed pike with disintegration capabilities, and dressed in a long tunic and face mask. Maramis and the rest of the Togruta Guard followed Yovet as she remained with Supreme Chancellor Lina Soh's party throughout the fair's festivities.\nWhen the Nihil marauders began their attack on the Valo Republic Fair, Maramis and Yovet were with Soh, Norel Quo, Matari, Voru, Madam Conserra, and Jedi Master Stellan Gios at the opera house. Despite the immense danger, Yovet ordered all of her guards, except Maramis, to aid the injured, much to Maramis' dismay. Gios stated that the group needed to head to the Valo Jedi Temple, explaining that the vaults underneath the temple would keep the group safe.\nAs the group began making their way to the Jedi temple, they became trapped in the Nihil war cloud. To keep the group safe, Gios ordered them all to huddle together so he could use the Force to keep the air around them clear of the toxic gas. As the group continued making their way to the temple, Maramis pointed out an experimental walker that had been on display at the fair. The walker and its platform seemed to be higher than the war cloud, which would enable the group to head to the temple safely. Maramis helped Gios guide the group to the walker using the echolocation capabilities of his montrals.\nOnce the group finally arrived at the walker, they began using the stairway to reach the platform. While the group hurried up the stairway, a group of Nihil attackers ambushed them. Gios, Maramis, Matari and Voru prepared to defend the group. Maramis and the targons initiated their attack while Gios stayed behind to defend the walker. During a fight between Gios and a Trandoshan Nihil member, the walker stairway fell to the ground. Maramis, Matari, and Voru soon returned to the walker, having successfully defended the walker for the time being. Using the shield from the Trandoshan, Gios and Maramis crafted a makeshift gurney for Quo, who was injured when the stairway fell. Gios then lifted the gurney up to the walker using the Force. Maramis then helped Gios upright the stairway and assisted Gios in climbing to the platform. Another group of Nihil marauders began attacking the group, Maramis taking the lead in fending them off. Once Maramis, the last of the group, reached the top of the stairway, Gios used the Force to push the stairway to the ground.\nSoh began to operate the walker, setting a path for the Jedi temple. The group aboard the walker eventually made it out of Fair Park and arrived at the Unity Arc. Just as they reach the arch, Jedi Master Mikkel Sutmani's Vector crashed into a café on the streets below - brought down by a Nihil marauder. The café then collapsed, trapping and injuring dozens of survivors who were using the building as shelter. At Yovet and Soh's direction, the group disembarked the walker to aid the survivors. Gios and Maramis defended the group from Nihil attackers as they tended to the injured.\nWhen Tempest Runner Pan Eyta began bombing Lonisa City, Gios ordered Maramis to take the rest of the group back to the walker and ensure their safety while Gios defended the injured. Maramis was prepared to defend both Yovet and Soh from Lourna Dee, who attempted to scale the walker after getting past Gios. Luckily, Jedi Master Elzar Mann prevented Dee from reaching the walker but could not stop the bomb that downed the walker and gravely injured Soh. As the Nihil attack ended, Maramis and the rest of the Togruta guard followed Yovet's direction and aided the wounded. Once Togruta reinforcements arrived on Valo, Maramis, Yovet, and the rest of the Togruta guard returned to Shili. Despite the immense danger both Maramis and Yovet endured, Maramis praised the Republic and Jedi – specifically Gios, whom Maramis fought next to for most of the attack.\nMaramis' montrals allowed him to have an acute sense of direction and danger. During the Valo Republic Fair attack, Maramis could determine direction when others couldn't due to the Nihil's war cloud. His montrals also allowed him to sense when danger was approaching, as he did when Nihil marauders attempted to ambush the walker he was defending. Maramis was also highly skilled with his kiavene, using it to take down dozens of Nihil single-handedly.\nMaramis was highly protective, specifically of Elarec Yovet, whom he swore his life to protect. He put the lives of those he was protecting above his own and would do anything he could to ensure their safety – even if it meant leaving behind others. Maramis also had a knack for battle tactics, realizing the best way to reach the Valo Jedi temple before even Jedi Master Gios.\nMaramis appeared in the novel The High Republic: The Rising Storm, which was written by Cavan Scott and published in 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shili",
  "/wiki/Togruta",
  "/wiki/Gender",
  "/wiki/Togruta_government",
  "/wiki/Regasa",
  "/wiki/Elarec_Yovet",
  "/wiki/Captain",
  "/wiki/Republic_Fair",
  "/wiki/Planet",
  "/wiki/Valo",
  "/wiki/Attack_on_Valo",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Maramis",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Lonisa_City",
  "/wiki/Kiavene",
  "/wiki/Pike",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Norel_Quo",
  "/wiki/Matari_(targon)",
  "/wiki/Voru_(targon)",
  "/wiki/Trangess_Conserra",
  "/wiki/Jedi",
  "/wiki/Jedi_Master",
  "/wiki/Stellan_Gios",
  "/wiki/Jedi_Temple",
  "/wiki/Gas",
  "/wiki/Walker",
  "/wiki/Montral",
  "/wiki/Targon",
  "/wiki/Trandoshan",
  "/wiki/Shield_(physical_armor)",
  "/wiki/Gurney",
  "/wiki/The_Force",
  "/wiki/Force_push",
  "/wiki/Mikkel_Sutmani",
  "/wiki/Jedi_Vector",
  "/wiki/Tempest",
  "/wiki/Tempest_Runner",
  "/wiki/Pan_Eyta",
  "/wiki/Lourna_Dee",
  "/wiki/Elzar_Mann",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Cavan_Scott",
  "/wiki/2021",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)"
 ]
}