{
 "name": "Marcovic",
 "display_name": "Marcovic",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "Marcovic was a male Human who served the reconstituted Sith Empire during the Cold War with the Galactic Republic. A lieutenant in the Imperial Military, Marcovic was assigned to a secret listening post on the planet Ord Mantell in the later years of the Cold War. During the early days of Darth Angral's campaign of vengeance for the death of his son where the Sith Lord seized control of Republic superweapons and turned them against the Republic, the Republic Strategic Information Service traced a holotransmission of Angral's back to Ord Mantell, but lost the signal beyond that point. In an attempt to gather information on Angral's plans, the Republic General Var Suthra sent a young Jedi Knight and the astromech droid T7-O1 on a mission to the base, where the two stormed the facility and hacked into their records. Loyal to the Empire even in the face of death, Marcovic sacrificed his life to destroy the facility's subspace transceiver in an attempt to stop the Knight from retrieving the data.\nA Human male, Marcovic enlisted in the military of the Sith Empire during the Cold War with the Galactic Republic, and he had risen to the rank of Lieutenant by the year 3643 BBY. He was eventually assigned to an listening post on the planet Ord Mantell, where the facility's personnel gathered intelligence on Republic troop movements. In 3,643 BBY, the Sith Lord Darth Angral contacted his son Tarnis on the Republic capital of Coruscant, as well as his apprentices Praven, Nefarid, and Sadic on other worlds. To secure his transmission, Angral ran it through several planets, including the Imperial outpost on Ord Mantell.\nHowever, when Angral witnessed his son's death at the hands of a Jedi Knight, he began to issue declarations of war against the Jedi Order and the Republic, seizing control of Republic superweapons in his crusade. The Republic Strategic Information Service , the Republic's intelligence agency, was able to trace Angral's holotransmission back to Ord Mantell but lost it beyond that point. Angral's apprentices had used information gathered by Tarnis, who had been operating undercover as a Republic scientist, to seize control of several Republic superweapon projects, and General Var Suthra of the Republic Military sent the young Jedi Knight who had killed Tarnis to investigate the Ord Mantell facility and figure out Angral's plans. Accompanied by the astromech droid T7-O1, the Jedi located and attacked the base while Marcovic was stationed in the lower levels of the complex.\nMarcovic prepared to defend the Imperial compound along with the other Imperial soldiers and officers stationed in the facility, and the Lieutenant was the only defender left by the time the two attackers reached the listening post's hyperspace transceiver. The Human officer attempted to defend the transceiver with his life, battling the Knight and the droid with his vibrosword, but he was ultimately no match for the Knight's combat prowess and the Jedi severely injured the Lieutenant. Determined to give his enemy nothing, Marcovic refused to say anything beyond his name and rank until he realized that the Jedi's astromech droid was attempting to access the facility's records. In a last-ditch attempt to stop the enemies of the Empire, the Lieutenant threw himself at the droid in a suicidal attack and destroyed the transceiver before he was cut down by the Knight's lightsaber.\nA fair-skinned Human male with black eyes, Marcovic had black hair and a small mustache. Marcovic was a proud individual and fiercely loyal to the Empire, and he despised the Jedi as symbols of the Republic. Even when fatally wounded, he refused to submit to possible questioning, only giving his rank and name to the Jedi. He then attacked T7-O1 when the astromech attempted to access the listening post's records in a last, suicidal attempt to protect the Empire. Unlike the rest of the soldiers stationed at the listening post, Marcovic preferred to wield a vibrosword in combat instead of a blaster.\nMarcovic appears in the BioWare massively multiplayer online roleplaying game Star Wars: The Old Republic, as part of the Jedi Knight class storyline. He is the final boss in the Imperial Listening Post, as part of the \"New Intelligence\" mission on Ord Mantell. Once the player eliminates almost all of his health, a conversation with Marcovic is initiated and the player has the option to ask him to surrender, ignore him or kill him for dark side points. The first two options do not result in alignment points, but Marcovic will attack the player after he realizes that T7-O1 is attempting to hack the facility's computers, and he will be killed regardless.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3643_BBY",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Imperial_Listening_Post",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Darth_Angral",
  "/wiki/Desolator_crisis",
  "/wiki/Duel_in_the_Jedi_Temple_ruins",
  "/wiki/Tarnis_(Sith_Lord)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Hologram/Legends",
  "/wiki/General/Legends",
  "/wiki/Var_Suthra",
  "/wiki/Hero_of_Tython",
  "/wiki/Astromech_droid/Legends",
  "/wiki/T7-O1",
  "/wiki/Mission_to_Ord_Mantell_(Desolator_crisis)",
  "/wiki/Slicer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Subspace_transceiver",
  "/wiki/Military_rank/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Praven",
  "/wiki/Nefarid",
  "/wiki/Sadic",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/T7-series_astromech_droid",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Soldier/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Vibrosword/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}