{
 "name": "Marcus_Trant",
 "display_name": "Marcus Trant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Senate Library",
      "Strategic Information Service",
      "Senate Library",
      "Strategic Information Service"
     ]
    }
   ]
  }
 ],
 "content": "Marcus Trant, known to his subordinates simply as the Director, was a Human male spy for the Galactic Republic who notably served as Director of the Strategic Information Service . Originally a decryption analyst employed by the SIS when it was the covert branch of the Senate Library, Trant became a field agent when the agency began to expand at the start of the Great Galactic War in 3681 BBY, with the return of the Sith Empire. Trant helped Lieutenant Elin Garza of the 45th Infantry Division fight a successful ten-month campaign on the planet Bomodon, during which they forged a close bond. However, their fledgling marriage ended in divorce less than two years later.\nIn the later years of the war, Trant rose through the ranks of the SIS to become Bureau Chief on Nar Shaddaa. His work caused tensions at home, and Trant's relationship with his second wife ended in divorce as well. Three years after the war's end and the beginning of the ensuing Cold War, Trant ascended to the position of Director of SIS. He did not shy away from making hard decisions, even if they caused hundreds of deaths, as long as a greater good was served. As the Republic's intelligence director, Trant believed the SIS was responsible for conducting the dirty work that would protect the Republic. He initiated several operations that would lead to the Galactic War and the Republic's victory over the Sith Empire. That included a mission that resulted in the destruction of the Sith's planet-destroying Sun Razer weapon, and Operation End Game, which brought about the defeat of the Sith Empire's most powerful warship, the Ascendant Spear.\nA Human male, Marcus Trant worked as a decryption analyst for the Galactic Republic's Strategic Information Service, which at the time was a covert subdivision of the Senate Library to avoid questions about its budget. It was then that the Great Galactic War began in 3681 BBY with the return of the Sith Empire. As the war dragged on, the Senate ordered the SIS to be expanded into a full-fledged intelligence agency separate from the Senate Library, and Trant became one of the SIS' field agents. In 3674 BBY, Trant was stationed on the planet Bomodon, when a platoon of the Republic Military's 45th Infantry Division under the command of Lieutenant Elin Garza was shot down. Trant assisted Garza in waging a ten-month guerrilla campaign that ultimately succeeded in driving the Imperial invaders off the planet.\nTrant and Garza became romantically involved during the battle, and the two were married not long after. However, their marriage ended in divorce after only twenty-six months, and Garza married a naval captain named Joron Tal'vor, who died in 3671 BBY. Trant married again, though his work caused tensions at home, and his second wife divorced him as well. His relationship with Garza remained tense throughout the rest of their lives, though they had to frequently interact when Garza became the commanding general of the Republic Special Forces Division, which worked closely with the SIS. Trant participated in many SIS operations throughout the war on planets across the galaxy, including Ralltiir, though they were all classified. In 3654 BBY, he was appointed Bureau Chief on Nar Shaddaa. Over the next four years, Trant established fifty-six different safe houses on the moon and conducted multiple successful operations.\nThree years after the Treaty of Coruscant ended the Great Galactic War in 3653 BBY, the SIS director stepped down due to ailing health. He named Trant as his successor, and Trant was promoted to Director of Republic Strategic Information Service. His troubles began right away: though the Great War had ended, the Republic and the Empire were locked in a bitter Cold War. Instead of soldiers fighting on the front lines, the galaxy became a battlefield of intrigue and spies. A bounty was placed on Trant's head, and intelligence and counterintelligence became the primary concerns of both governments as they sought to fortify their positions for when all-out war would resume. The Sacking of Coruscant, the attack by the Empire which had forced the signing of the Treaty of Coruscant, had left Coruscant in shambles. Other planets, abandoned by the Republic under the treaty's terms, were taken over by the Empire. Planets such as Ord Mantell, Nar Shaddaa, Tatooine, and Balmorra become battlegrounds between the SIS and Imperial Intelligence. Trant initiated operations that he personally supervised, including those of Agent Theron Shan and Director of Mid Rim Operations Ardun Kothe. Trant assigned Shan to reconnoiter the planet Makeb in preparation for a possible Republic intervention. Shan sent Trant a field report highlighting key locations on the planet, as well as evaluating key figures and the local military strength.\nActivities by the SIS increased as they sought more information about Imperial Intelligence and the Empire in general, and Trant personally kept tabs on the most dangerous enemies of the Republic. Under Trant's watch, the SIS began to assist the overwhelmed Coruscant Security Force by providing intelligence on some of Coruscant's most dangerous criminal and militant organizations such as Black Sun and the Justicars' Brigade. Seeing the Jedi Order as a valuable Republic resource, Trant encouraged SIS agents to work hand-in-hand with the Jedi, which played out in operations on locations such as Coruscant, Nar Shaddaa, and Taris. As director of SIS, Trant had to balance the day-to-day operations of an intelligence service with the continual politics that were involved as the head of a government agency. Senate budget and oversight hearings demanded information on covert operations, which Trant refused to give for operational security reasons. The risk of compromising the identity of one of his agents was too great, and only a handful of people had access to the personnel records of SIS. Nevertheless, the bureaucrats who ran the finances of the Republic government wanted to see results for the credits that were spent, and as a result Trant was continually fighting to justify the existence of the SIS, since by its definition, the results of his agency's work were covert.\nIn 3643 BBY, Trant summoned Theron Shan to his office. There, he briefed Shan on the overall state of the efforts by the SIS to undermine the Empire. Together they flew to the SIS operations center on a mission to locate a missing Jedi named Ngani Zho. Though he at first hesitated, Shan accepted the mission, as Zho had raised him and trained him in place of his mother, Jedi Grand Master Satele Shan. Traveling to the Vesla system, Shan found Zho, who told him of a powerful weapon called the Sun Razer that was being developed under the command of Sith Lord Darth Mekhis. Determined to destroy the weapon, Shan called in to Trant to inform him of the developments. Though Zho was mentally unstable, Shan told Trant he believed that Zho had found something important. A week prior to that, an SIS station on Nar Shaddaa was shut down, and Trant had been informed of rumors that the Sith Empire's Imperial Guard was being mobilized. Because of that, Trant knew the Republic had to force every available advantage, Shan's mission being one of them. Both Trant and Shan agreed for the latter to move forward on locating the weapon and conducting reconnaissance. However, as the mission played out, Shan ended up finding and killing Darth Mekhis as well as destroying the Sun Razer. Trant would later remark to Shan that his actions might have put in motion a renewed war with the Sith. Trant offered Shan vacation time, but Shan refused, telling the director he would continue to follow leads on stopping the Sith.\nA renewed war did begin, and with the apparent death of the Sith Emperor at the hands of a Jedi Knight, the Republic gained the upper hand. Trant continued to monitor enemies of the Republic, and eventually classified Cipher Nine, a former Cipher Agent of the Imperial Intelligence responsible for the destruction of the Shadow Arsenal on Quesh, as number three on his list of threats. In 3640 BBY, the new Republic Supreme Commander Jace Malcom worked with Trant in developing a plan to free Republic prisoners-of-war from slave markets. Named Operation Transom, the mission moved forward with success, and the SIS located a major source of the slave dealing on Nar Shaddaa in the palace of Morbo the Hutt. Three months into the surveillance, Trant was informed by field agents that Theron Shan, who had not been assigned to the mission, was snooping around Morbo's palace. Trant called Shan, demanding he leave Nar Shaddaa immediately. At that point, Shan was approached by a Houk and hung up on the director. The Houk demanded that Shan explain his presence, which Shan refused to do. The two fought, and Shan gained the upper hand and defeated the Houk, placing him securely on the ground. When questioned by Shan, the Houk admitted he was an SIS agent. He also told Shan about Operation Transom, the details of which surprised Shan. However, Shan continued to ignore the director's orders to leave Nar Shaddaa and infiltrated Morbo's palace. In the process he helped several captive Republic soldiers escape, alerting the Hutts that the Republic was observing their operations. Trant was soon informed of Shan's actions and that Operation Transom was subsequently blown.\nMeanwhile, Trant visited the Supreme Commander's office in the Senate Building. Though Malcom asked Trant why Shan had interfered with Operation Transom, Trant, covering for Shan, took the blame of the mission's failure. Privately, Trant was furious and promised to himself that he would thoroughly question Shan on the matter. To move forward with defeating the Sith Empire, Malcom had developed a plan to capture and destroy a new Imperial warship, the Ascendant Spear under the command of Darth Karrid, a Falleen Sith Lord. Malcom presented the idea to the SIS director as a joint operation with the military and the Jedi, and Trant agreed. Upon returning to Coruscant, Shan was taken to the Director's office under forced escort by SIS agents posing as Coruscant Security Force police officers. Trant was furious with Shan; not only had he disobeyed a direct order, but he had blown a three-month surveillance operation. As a punishment, Trant took Shan off field duty and reassigned him to the Analytics Department. However, Trant had Shan start work on developing details for the new mission against the Ascendant Spear, called Operation End Game.\nShan submitted his final operational plan to Trant, who redacted Shan's name. Yet, Shan put his name back on the document before it was submitted to Jace Malcom. During the discussion concerning which SIS agent would be assigned as the lead operative, Malcom requested that Trant assign Shan to the mission. Trant, frustrated that Shan had outmaneuvered him, reluctantly agreed. Malcom also requested the aid of the Jedi High Council Master Gnost-Dural, Darth Karrid's former Jedi Master, who arrived on Coruscant a short while later. Shan, Gnost-Dural, and Trant went to the Supreme Commander's office to discuss the final details of the mission. Trant, meanwhile, had been developing a flirtatious relationship with Malcom's receptionist, and Shan privately suspected that she was Trant's move toward wife number three. After the meeting with the mission details finalized, Operation Endgame was put underway. While the mission was formally under Malcom's direct supervision, Trant provided frequent tactical suggestions and information as well as overseeing reports from Shan. On the planet Ziost, Shan and Gnost-Dural secured a black cipher, a special encryption device of the Imperial Navy. The cipher was turned over to Trant, who immediately gave it to the analytics team to work on. Shan and Gnost-Dural, meanwhile, continued with their mission and invited a smuggler named Teff'ith to help them. Trant, however, was skeptical of Teff'ith's abilities and loyalties to Shan and the Republic.\nUsing the black cipher, the SIS discovered that the Ascendant Spear would dock at the space station known as Reaver Station for two days. Trant called Shan with the information, and the team made their way to the station. Shortly thereafter, the SIS intercepted information concerning a planned assault on the planet Ruan. Trant took the information to Malcom, and the two decided to allow the assault to happen to protect the fact that they had access to Imperial communications. The battle at Ruan was a devastating Republic defeat and, shortly thereafter, Trant went to Malcom to brief him on the damage and casualties. The two also decided then to allow a second attack by the Sith, this time on the planet Duro, to take place. Meanwhile, upon his arrival at Reaver Station, Shan found out about the attack on Ruan. Concerned that the cipher was no longer working, Shan contacted Trant, who was in the briefing with Malcom. Trant and Malcom explained their actions to Shan, who was horrified and angered by their decision. After disconnecting with Shan, Trant gave the Supreme Commander the estimated causality rates for the attack on Duro. Malcom agonized over whether his decision was correct, and he asked Trant's opinion on their actions. The Director assured Malcom that the decision was correct in the grand scheme of things, although he joined Malcom in several drinks that evening. Meanwhile, Shan and Gnost-Dural infiltrated the Ascendant Spear and set its course for the Duro system. At the same time, Shan sent Teff'ith to Coruscant to tell his mother, Satele, about the Ascendant Spear's movements and to convince Trant and Malcom to act in defense of Duro.\nTeff'ith warned Master Shan, who in turn convinced Malcom to take action. When the Ascendant Spear arrived at Duro, a Republic fleet under the direct command of Malcom ambushed the ship, and a battle ensued. During the fighting, Shan killed Darth Karrid, allowing the Republic forces to destroy the Ascendant Spear and accomplish the operation's goal. Shan gave Trant his final report on the operation; Trant then went to the official debriefing in the Supreme Commander's office. Shan did not attend and gave his regrets to the Supreme Commander. After the debriefing, Trant returned to his office to continue his work leading the SIS.\nLater in the war, when agents of the secretive Order of Revan framed Shan and several others for the death of Colonel Rian Darok, an officer in the Special Forces Division, the Director lessened the fallout for Shan; instead of a death sentence, Shan was classified as a \"disavowed rogue agent, apprehend on sight.\" Following the uncovering of the Revanite conspiracy and their downfall on Yavin 4, Shan was fully reinstated into the SIS with a promotion and a new job title. Trant continued to lead the SIS during the conquest of the galaxy by the Eternal Empire of Zakuul, in which the Republic surrendered to the invaders' Eternal Fleet and signed a peace treaty that allowed the Republic to keep its independence at the cost of a heavy tribute of raw materials and resources. In 3631 BBY former Sith Intelligence Minister Lana Beniko started a war against Zakuul, and Shan left the SIS to join her Alliance that opposed Zakuul's Emperor Arcann, to Trant's disappointment.\nMarcus Trant had dark skin, brown eyes, and dark brown hair. A man of average height and weight, he carried a relatively subdued presence when walking through the halls of the Senate, which he preferred. Though Trant was, by his nature, a pessimist, he believed in the good of the Republic and threw himself into his job. As Director of SIS, he was faced with hard decisions, often ones of life and death. He never shied away from his responsibility. If need be, he was willing to sacrifice hundreds, if not thousands, if it served the greater good and enabled a Republic victory. His covert work created a severe strain in his personal life, and both his marriages ended in failure. That, however, did not discourage him, and he was known to be somewhat of a womanizer. His failings in his personal life stood in stark contrast to his professional career. Trant was one of the greatest agents of the Republic during his lifetime. His abilities to juggle multiple missions at the same time served him well as Bureau Chief of Nar Shaddaa, and was a trait that he took with him when he became Director of SIS. Though not required, he would directly supervise several missions instead of leaving the task to subordinates.\nSpecifically, Trant had a close interest in the career of Theron Shan. Trant was aware that Shan's mother was Jedi Grand Master Satele Shan, a fact which was a closely guarded secret among a handful of people. Trant valued Shan's work as an operative and considered him one of the best agents in the SIS. Though Trant allowed Shan greater latitude during missions, Shan would also frustrate his director, especially when he would deviate from specific orders. Trant kept a careful eye on Shan as he would his own son, sending him on missions that the director would personally supervise, and taking an interest in Shan's physical and mental health. As director, Trant dedicated himself to ensuring the safety and secrecy of his people above all else. He was known for telling his operatives that if they had done their job correctly, nobody would know they had been there. As the SIS was a covert agency, Trant struggled daily with refusing to hand over operational details to the Senate. The back-and-forth politics frustrated him, as senators continually sought to cut his budget and personnel. However, Trant refused to give up and sought allies to help him vouch for the necessity of the SIS. One of these allies was Jace Malcom, the Republic Military's Supreme Commander. Their relationship developed smoothly and, for the most part, Trant enjoyed working with Malcom, as they both shared a common goal and philosophy. Trant's operational success as an agent and as director made him one of the most valued of the Republic's spies.\nMarcus Trant was created for the Star Wars: The Old Republic metaseries, which is centered on a massively multiplayer online roleplaying game of the same name that was released by BioWare on December 20, 2011. He first appeared in The Old Republic—The Lost Suns 1, a comic published on June 8, 2011. He appeared throughout The Lost Suns story arc, though only identified as \"The Director.\" He was first identified as Marcus Trant in the Star Wars: The Old Republic Encyclopedia, published on October 15, 2012 by Dorling Kindersley. The encyclopedia entries for both Trant and Elin Garza established Trant's backstory, including his relationship with Garza. The Encyclopedia was published shortly before Trant's latest appearance in The Old Republic: Annihilation, an Old Republic novel set chronologically after the game's class storylines. The novel was written by Drew Karpyshyn and published on November 13, 2012.\nMarcus Trant finally appeared in the game itself during the flashpoint \"The Nathema Conspiracy,\" added with Update 5.9 on May 3, 2018. The flashpoint is available to characters of both Republic and Imperial factions, but Marcus Trant will only appear if the player is an Imperial Agent who remained loyal to the Empire or became an independent agent during the end of their class story. In this case, Marcus Trant will seek to eliminate the agent who became the Commander of the Eternal Alliance, and will decide to destroy the Alliance to rid the agent of their friends and support. To that end, Trant will join the Order of Zildrog led by former Horizon Guard Vinn Atrius and travel with the rest of the Order to Nathema, where Atrius and GEMINI 16 plan to awaken Zildrog, an ancient Iokath superweapon capable of destroying the Alliance. Trant confronts the agent, accompanied by Theron Shan and Lana Beniko, over the hologram and sends an Ancient Guardian Droid to stop them. After the player defeats the droid, they find that the GEMINI deceived and betrayed many of her allies, locking them inside energy transfer chambers and using them as fuel for Zildrog's awakening. Marcus Trant dies shortly before the player destroys both GEMINI 16 and Zildrog. However, if the agent made the light-side choice to spare Ardun Kothe on Quesh and later accepted his offer to join the SIS as a double agent, Shara Jenn will appear instead of Marcus Trant, while the other classes face antagonists from their own class stories, meaning that Marcus Trant's involvement with the Order only represents one possibility of many.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Senate_Library",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/Spy/Legends",
  "/wiki/Director_of_Republic_Strategic_Information_Service",
  "/wiki/Agent/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/3681_BBY",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Lieutenant/Legends",
  "/wiki/Elin_Garza",
  "/wiki/45th_Infantry_Division",
  "/wiki/Battle_of_Bomodon",
  "/wiki/Planet/Legends",
  "/wiki/Bomodon_(planet)",
  "/wiki/Marriage/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Bureau_Chief",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Marcus_Trant%27s_second_wife",
  "/wiki/3650_BBY",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Death/Legends",
  "/wiki/Galactic_War",
  "/wiki/Sith/Legends",
  "/wiki/Mission_to_the_Vesla_system",
  "/wiki/Sun_Razer",
  "/wiki/Operation_End_Game",
  "/wiki/Battle_of_Duro_(Galactic_War)",
  "/wiki/Warship/Legends",
  "/wiki/Ascendant_Spear",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_1",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/3674_BBY",
  "/wiki/Elin_Garza%27s_platoon",
  "/wiki/Republic_Military/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Ground_warfare",
  "/wiki/Navy/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Joron_Tal%27vor",
  "/wiki/3671_BBY",
  "/wiki/Marcus_Trant%27s_second_ex-wife",
  "/wiki/General/Legends",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/The_galaxy/Legends",
  "/wiki/Ralltiir/Legends",
  "/wiki/3654_BBY",
  "/wiki/SIS_safe_house",
  "/wiki/Moon/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/3653_BBY",
  "/wiki/Unidentified_SIS_director",
  "/wiki/Soldier/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Balmorra/Legends",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Theron_Shan",
  "/wiki/Director_of_Mid_Rim_Operations",
  "/wiki/Mid_Rim_Operations_Group",
  "/wiki/Ardun_Kothe",
  "/wiki/Makeb",
  "/wiki/Field_Report_875902-234MAK1",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Justicars%27_Brigade",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mission_to_Coruscant_(Desolator_crisis)",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Mission_to_Taris_(Desolator_crisis)",
  "/wiki/Standard_day/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/3643_BBY",
  "/wiki/Strategic_Information_Service_operations_center",
  "/wiki/Ngani_Zho",
  "/wiki/Parent/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Vesla_system",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Mekhis",
  "/wiki/Standard_week/Legends",
  "/wiki/Raid_on_the_SIS_safe_house",
  "/wiki/Imperial_Guard",
  "/wiki/Darth/Legends",
  "/wiki/Dromund_Kaas_operation",
  "/wiki/Tenebrae",
  "/wiki/Hero_of_Tython",
  "/wiki/Cipher_Nine",
  "/wiki/Cipher_Agent",
  "/wiki/Imperial_Agent",
  "/wiki/Shadow_Arsenal",
  "/wiki/Quesh",
  "/wiki/3640_BBY",
  "/wiki/Supreme_Commander_(Republic)",
  "/wiki/Jace_Malcom",
  "/wiki/Prisoner/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Operation_Transom",
  "/wiki/Morbo%27s_Paradise",
  "/wiki/Morbo",
  "/wiki/Hutt/Legends",
  "/wiki/Unidentified_Houk_agent",
  "/wiki/Houk/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Supreme_Commander%27s_office",
  "/wiki/Senate_Building",
  "/wiki/Darth_Karrid",
  "/wiki/Falleen/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Director%27s_office",
  "/wiki/Police_officer/Legends",
  "/wiki/Analytics_Department",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Gnost-Dural",
  "/wiki/Jace_Malcom%27s_receptionist",
  "/wiki/Ziost/Legends",
  "/wiki/Mission_to_Ziost",
  "/wiki/Black_cipher",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Smuggler/Legends",
  "/wiki/Teff%27ith",
  "/wiki/Space_station/Legends",
  "/wiki/Reaver_Station",
  "/wiki/Ruan",
  "/wiki/Battle_of_Ruan",
  "/wiki/Duro/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Order_of_Revan",
  "/wiki/Colonel/Legends",
  "/wiki/Rian_Darok",
  "/wiki/Revanite_crisis",
  "/wiki/Battle_of_Yavin_4_(Galactic_War)",
  "/wiki/Yavin_4/Legends",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Eternal_Empire",
  "/wiki/Zakuul",
  "/wiki/Eternal_Fleet",
  "/wiki/Zakuul%E2%80%93Republic_treaty",
  "/wiki/3631_BBY",
  "/wiki/Sith_Intelligence_Minister",
  "/wiki/Lana_Beniko",
  "/wiki/War_against_Zakuul",
  "/wiki/Eternal_Alliance",
  "/wiki/Emperor/Legends",
  "/wiki/Arcann",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic_(comics)",
  "/wiki/June_8",
  "/wiki/Star_Wars:_The_Old_Republic%E2%80%94The_Lost_Suns",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/October_15",
  "/wiki/2012",
  "/wiki/Dorling_Kindersley",
  "/wiki/Star_Wars:_The_Old_Republic_(novel_series)",
  "/wiki/Drew_Karpyshyn",
  "/wiki/November_13",
  "/wiki/May_3",
  "/wiki/2018",
  "/wiki/Alliance_Commander",
  "/wiki/Order_of_Zildrog",
  "/wiki/Horizon_Guard",
  "/wiki/Vinn_Atrius",
  "/wiki/Nathema",
  "/wiki/GEMINI_16",
  "/wiki/Zildrog",
  "/wiki/Iokath",
  "/wiki/Superweapon/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Mission_to_Nathema_(Zildrog)",
  "/wiki/GEMINI",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Shara_Jenn",
  "/wiki/Category:Images_of_Marcus_Trant",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_5",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Timeline_5:_The_Battle_of_Bothawui",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/3636_BBY",
  "/wiki/3630_BBY"
 ]
}