{
 "name": "Marchion_Ro",
 "display_name": "Marchion Ro",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Evereni"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Slate-gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ro family",
      "Nihil"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Krix Kamerat"
     ]
    }
   ]
  }
 ],
 "content": "Marchion Ro was a male Evereni who held the title of Eye of the Nihil in the days of the High Republic. The son of the previous Eye Asgar Ro, he grew up on the Gaze Electric, his family's ship, and watched as his grandmother, Shalla, and his father developed the marauder group known as the Nihil in the Outer Rim of the galaxy. The Ros grew the Nihil into a significant disruptive force, using a unique mastery of hyperspace to conduct lightning raids, and becoming rich and influential in the process. While he was still a teenager, Ro's father was betrayed and murdered by one of the Nihil's leaders, and Ro succeeded him as the Eye of the Nihil.\nIn 232 BBY, as the Jedi Order and the Galactic Republic prepared to unveil their principal base in the Outer Rim, Ro dispatched a Stormship to intercept a cargo freighter known as the Legacy Run, deliberately causing them to crash into each other. The crash resulted in a hyperspace cataclysm known as the Great Disaster, as the Legacy Run tore itself apart and emerged at lightspeed to strike various astronomical objects in realspace. Profiting from the subsequent blockade of the Outer Rim's hyperlanes, the Nihil struck at several worlds, revealing their existence to the Republic. Ro solified his hold on the Nihil and concealed their true strength from the Jedi by sending one of its leaders, Kassav Milliko, and his Tempest fleet into a Republic trap in the Kur Nebula. Hidden once again from their gaze, Ro could continue his preparations for his planned confrontation.\nWorking in the shadows, Ro secretly collected an ancient relic from the Elders of the Path cult on Vrant Tarnum, which would allow him to control a creature from his family's past; a creature he collected from a shrine guarded by Ro relatives on the planet Rystan. The Nihil subsequently attacked the Republic Fair on Valo, striking at the heart of the Republic's expansion efforts in the Outer Rim, and leaving thousands dead. In retaliation, the Jedi attacked a Nihil base on Grizal, briefly liberating the Jedi Master Loden Greatstorm who had been held prisoner by the Nihil for nearly a year. Ro unleashed his secret creature, the Great Leveler, on the Jedi, overwhelming them and turning Greatstorm into dust. The attack on Valo and the engagement on Grizal showed the Nihil's continued strength and their possession of a weapon powerful enough to destroy the Jedi.\nUsing the Republic assumption that Lourna Dee was the true leader of the Nihili, Ro planned to strike at the Jedi directly, collecting several more creatures from their hidden homeworld and smuggling them onto Starlight Beacon as it orbited over the planet Eiram. Nihil operatives sabotaged the station while the Jedi were distracted by the Force-paralysing effects of Ro's Nameless creatures, and the whole galaxy watched as Starlight Beacon tore itself apart before crashing onto Eiram's surface. Dozens of Jedi died onboard Starlight Beacon and, in the aftermath, Ro revealed himself to the galaxy with a public broadcast, taking credit for his acts of destruction and challenging the Republic to stay away from the Outer Rim. In response, Supreme Chancellor Lina Soh sent a Republic Defense Coalition fleet into the Outer Rim to defend it against the Nihil and to capture Marchion Ro. However, Ro sealed off ten sectors of the Outer Rim from the Republic's intervention, using the stormseed technology developed by scientists loyal to the Nihil and destroying the fleet as it attempted to enter his territory.\nMarchion Ro was born to a family of Evereni wanderers during the time of the High Republic. He was raised by his grandmother, Shalla Ro, and his father, Asgar Ro, aboard their family's fortress ship, the Gaze Electric. To his family, Marchion represented the ultimate end point for their plans, akin to the point of a knife, believing he would be the one to finally bring about their revenge.\nMarchion grew up hearing stories of his family's particular history within the wider galaxy. Centuries previosuly, the perpetual storm of the Evereni's homeworld, Everon, had caused their civilization's collapse, as attempts to live with the storm failed when a wind rose, so strong that their flying cities could no longer remain airborn. After this great storm which they would call the \"Shear\", the Evereni stopped trusting their homeworld and, as their institutions failed and war ravaged what remained of their society, they stopped trusting each other as well. Not even families trusted each other anymore. Using what technology remained after the Shear, the last faction of the Evereni, including the Ros, left Everon to survive, entering into new conflicts with the other species of the galaxy due to their inability to trust. Branded as outlaws and hunted by the other sentient species of the galaxy, the Evereni hid in the shadows.\nMarchion was also told of his family's history with the fabled Jedi Order, the designated protectors of the expanding Galactic Republic. The Evereni's instinctive distrust and the Ro family's beliefs on balance, practiced by \"the faithful,\" ran counter to the Jedi's own beliefs on balance, precipitating conflict between them and the Ros. In those centuries prior, the Ros had confronted the Jedi, a conflict they had lost. But, during this time, they had discovered an ancient weapon which had the power to defeat even the mighty Jedi Knights and their Force powers: a race of nameless creatures, coming from an old, living world, with the power to overwhelm Force-sensitives with their mere presence. The attempt to use these creatures failed, and the Jedi suppressed knowledge of their existence as well as those who had tried to use them. Defeated, the Ros retreated into the shadows to await the day they could get their revenge. In secret, the Ros had retained one of the Nameless, a creature they remembered as the Great Leveler. They trapped it on the planet Rystan, guarded by droid attendants, protected and worshipped by their own relatives.\nIn 252 BBY, Marchion came across another of his family's secrets: an ancient woman called Mari San Tekka, who the Ros had been holding prisoner for close to a hundred years. Mari had been born into the San Tekka clan, a family of explorers who rose from humble roots to become one of the wealthiest families in the galaxy, in large part due to Mari's particular ability: she had the ability to detect paths through hyperspace. But the ways she detected were unconventional, and the technology of the time was unable to properly calculate these paths. Using Mari's ability, the San Tekkas had developped the technology to follow these paths through hyperspace, growing rich from this discovery and allowing the Core systems to begin settling the outer reaches of the galaxy. The Ros had heard of Mari's abilities, and kidnapped her to use her ability for their own purpose. Since then, they had kept her alive through the use of a medical capsule, leaving her frail and weak but alive long past her natural lifespan.\nMarchion instinctively befriended a confused and dazed Mari, who at first assumed he was his father, Asgar. As they spoke, his grandmother told Asgar that the instinct, one their people had developed for centuries, was what they needed to finally accomplish their goal, and instructed Asgar to refine Marchion's natural inability to trust and his instinct to use the people around him until he no longer needed them. Asgar was a hard, abusive father to Marchion, following his mother's instructions to hone his instincts until he became the one they would need in their confrontation against the Jedi and the Republic. As a result of this abuse, Marchion felt nothing but hatred for his father. Marchion also learned other skills from his family during this time, including learning from his grandmother the best way to keep a Jedi prisoner.\nSince their exile had begun, the Ros had been developing weapons, technology and plans for their eventual confrontation with the Jedi and the Republic. Among these weapons, Marchion's great-grandmother had gathered a band of pirates, allowing them to operate and develop in Thull's Shroud, near Belsavis. The band called themselves the Nihil, and Shalla had assumed the role of the Eye of the Nihil, the group's unofficial guide as they developed. Allowing the Nihil to grow themselves, the Ros nevertheless remained in touch with the group, providing them with information and targets, and getting their cut of the takes. began to develop a new technology that they would use to turn the Nihil into a powerful new faction in the Outer Rim, one stronge enough to challenge the Republic's expansion. Asgar worked with Mari San Tekka to develop a new kind of technology to use her hyperspace ability.\nUnder his tutelage, Mari had developped the ability to detect seemingly impossible Paths through hyperspace, and the Ros had created a kind of engine which could translate the Paths into navigational data. After Marchion met with Mari San Tekka, Asgar believed that the time had come to use the Nihil as they were meant to be, but his mother disagreed. Shalla argued that Mari was not ready for such a burden, but Asgar believed that she would die from old age if they waited any longer. Shalla wanted to wait longer, until they were ready to truly confront and defeat the Jedi, but Asgar was tired of waiting. He pushed his mother over the side of the balcony overlooking Mari's capsule as Marchion watched from below.\nAsgar took Marchion when he traveled to meet with the Nihil Tempest Runners, Pan Eyta and Kassav Milliko. The two had become disillusioned with Shalla's leadership and many of their members had begun to abandon the Nihil, plans Eyta and Milliko had begun to consider themselves. Arriving in a small fighter and informing them of his mother's death, Asgar told the Tempest Runners that he intended to change the way they were run. Milliko instead threatened to simply kill the remaining Ros and take the Gaze Electric for themselves, but Asgar instead persuaded them to listen to him. Suggesting a bet, he proposed that they use as many of their ships as they could to eliminate his single starfighter; should they win, he would surrender the Gaze Electric to them. But if he won, they would listen. Eyta scoffed at the idea that Asgar could defeat them all, but he told them that he would not be the one fighting: instead, he woud be pitting them against Marchion, who was still a child. Confident they would win, the Nihil threw many ships at Marchion as he prepared to fight them in orbit above the planet. Over comms, Asgar told Marchion that he would give him everything he needed to win, but also warned him that his failure woud be his fault alone, and that all their family's hope would die with him. Marchion calmly assured his father that he knew that. The boy was provided with a new type of hyperspace path through his Path engine, directly from Mari San Tekka: the Battle Paths. This allowed him to briefly enter hyperspace and then reappear at another angle to attack his enemies. Marchion tore through Eyta and Milliko's fighters, demonstrating the new technology to the stunned Nihil leaders. Satisfied, Asgar told Marchion to stand down. However, the boy ignored his father and continued destroying ships, until his father threaten to cut off the Battle Paths and allow the Nihil to destroy him. Marchion obeyed through gritted teeth.\nWith the promise of granting them access to the Paths, Asgar became the new Eye of the Nihil, remaining in the shadows and providing Paths for their raids. Under Asgar's stewardship, the Nihil grew from a small, local pirate band to a major force for disruption in the Outer Rim. They quickly grew enough to expand from two Tempest fleets to three, a third which would be led by a ruthless Twi'lek named Lourna Dee. As Asgar led the Nihil from the shadows, Marchion continued his studies about his family's past, studying texts that Asgar had long forgotten within the library.\nAt one point, Asgar was left bleeding in his quarters within the Great Hall of the Nihil located in No-Space, an area of space where the Nihil operated. Ro found the man, after which Asgar begged him for help. When Ro asked who had harmed him, Asgar stated that he did not know. He then repeatedly kicked his father, and continued the act even after he died from the first few kicks. After finishing, he stood over his father's body for an hour in order to keep the scene in his memory. Following Asgar's death, Ro inherited the title of Eye of the Nihil, the Gaze Electric, and the Path engines, devices that allowed ships to travel anywhere in the galaxy on paths that conventional systems rejected. Through his father's murder, which he suspected was performed by one of the Nihil Tempest Runners, Ro also inherited the family goal to achieve revenge against the Jedi Order.\nDuring the High Republic Era, Ro, like his father before him, led the Nihil and delivered the routes—which were secret paths through hyperlanes that were unmapped in galactic databases—leading to No-Space—to them. Ro at one point also obtained his father's treasures, which included an artifact; a rod that grew warm and emanated a purple glow when touched. Ro supplied the marauders with the Path engines, devices that allowed the Nihil's ships to travel anywhere in the galaxy on paths that conventional systems rejected. He consulted Mari San Tekka, an old woman kept alive in a medical pod who was also known as the Oracle, of the San Tekka clan to request new Paths for Nihil raids and stored the new routes charted by her aboard the Gaze Electric's central database.\nAround 232 BBY, Ro sent a Stormship, belonging to a Cloud in the Tempest of Dowutin Nihil Tempest Runner Pan Eyta, in hyperspace to intercept the Legacy Run freighter, and the two vessels collided that shattered the latter into several fragments in an event that was known as the Great Hyperspace Disaster. The fragments exited hyperspace at high speeds and collided with many astronomical objects in realspace, including those within the Hetzal system. Ro was present within the Great Hall during a feast by the raiders. He was seated at an empty table within the hall. Ro watched as a member of the Tempest of Twi'lek Tempest Runner Lourna Dee, Zagyar, reported to her on their attack on a convoy of Garello Technologies ships, but later looked away when a member of the crew was dragged into the vaccuum of space as one of their members, Blit, miscalculated a harpoon shot and caused the death of herself and most of Zagyar's crew.\nRo then held a meeting with the Eyta, Dee, and the third Tempest Runner, the Weequay Kassav Milliko, within a small structure at the end of the Great Hall to discuss the threat the Jedi Order and the Galactic Republic posed to the Nihil. At that time, he also suspected that one of the Tempest Runners was responsible for his father's murder. Eyta stated that the Republic did not possess a military and was occupied with the construction of the Starlight Beacon space station. Ro responded by stating that his Republic spies informed him that they had begun to investigate the cause of the Emergences, a series of disasters that occurred in the Outer Rim Territories.\nRo also discussed the Republic's hyperspace blockade by Chancellor Lina Soh, revealing that them finding out about the Nihil would result in the marauders being hunted down and defeated as they were still not powerful enough to battle the Republic Defense Coalition. The Eye suggested that the Nihil maintain a low profile and halt new operations. He was then informed by Dee about a job to kidnap Blythe family members on the planet Elphrona and ransom them to their relatives on their homeworld of Alderaan.\nAlthough Ro was initially hesitant due to the attention it would bring to the Nihil, he approved Dee's job and agreed to supply her Tempest with the Paths necessary to reach Elphrona undetected. Unbeknownst to Dee, Ro did not see any value in kidnapping the family, instead aiming to capture a Jedi from the Jedi outpost on the planet. After Dee left, Milliko voiced his concern about approving the job and offered to share his own ideas with the Eye, but Ro reminded Milliko of that he led the Nihil and only he could supply Paths to them, adding that there was a \"price\" for attempting to take over what Ro owned.\nRo later traveled in hyperspace aboard the Gaze Electric on a path charted by Mari San Tekka. Ro requested that San Tekka, residing in a medical pod, alter the ship's course. When San Tekka failed to respond, Ro pressed a button on the pod's console that shocked her body. After repeated shocks, San Tekka began to suffer from a seizure that triggered an alarm, summoning Doctor Kisma Uttersond, a Chadra-Fan. When San Tekka finally recovered, Ro was informed by her of a new path between the locations Pasaana and Urber that could cut a third of the travel time.\nSan Tekka then asked Ro if he had made any progress on his plan, to which the Eye responded that the plan was ongoing. He also informed her that the Republic was building a large network of navigational droids that would predict where pieces of the Legacy Run would emerge out of hyperspace in events called Emergences, and asked her if it was possible to do so, offering the woman her favorite dinner. When San Tekka confirmed that the action could be done, Ro began to plan out the Nihil's next strategy and made his way to the Gaze Electric's bridge.\nRo contacted the three Tempest Runners and informed them that he would supply them with a list of Emergences that have yet to occur. Milliko, Eyta, and Dee would use the information to perform various operations such as looting disaster sites and ransoming the information while still avoiding Republic attention. After closing the connection, Ro ordered that San Tekka receive her dinner.\nUsing the knowledge of the Emergences provided by Ro, Milliko attempted to ransom the information to the population of the planet Eriadu, but failed to prevent a fragment of the Legacy Run from hitting it's inhabited moon. Meanwhile, Dee was present at the site of the fortieth Emergence in deep space in order to prevent the Republic from retrieving the Legacy Run's flight recorder. The resulting skirmish ended in a Nihil defeat and the Republic recovering the device.\nUnbeknownst to the Tempest Runners, Ro provided the information on Dee's ship to one his spies, the chief aide of Senator Izzet Noor, Jeni Wataro, who in turn passed it on the Republic. The information allowed them to intercept Dee and her Tempest in time. Ro was later informed by Wataro about Dee and Milliko's failures. He was also told that the flight recorder was damaged, thus limiting the amount of data that could be recovered from it and keeping the Nihil's location a secret. At that time, Ro believed that the moment marked a new beginning for the Nihil. Ro and the Tempest Runners later gathered in the Great Hall of the Nihil, with the Eye informing them of the consequences of their actions.\nRo was also informed by Wataro about the location of a transport carrying the flight recorder, and that a battle fleet consisting of both the Republic and Eriadu population would intercept any Nihil that attempted to attack the transport. He decided to send Milliko and his Tempest there without informing them about the fleet to die in battle as a sacrifice to maintain the Nihil's secrecy, as the Republic would believe they had defeated the marauders and cease their search for them.\nRo struck Milliko in the face. When the Tempest Runner attempted to retaliate with a concealed blaster, Ro launched one of his vibro-stars from his wrist that sheared Milliko's hand in two and destroyed the blaster, but Milliko continued to fight by attempting to punch Ro. The Eye caught the Tempest Runner's hand and threw him on the floor, before planting his foot on Milliko's chest and reminding him of who the Eye was. Ro then detailed his plan that would help the Nihil recover from the brink of defeat. He asked that Milliko head for the transport carrying the flight recorder destroy it, and ordered Dee to continue with the kidnapping job on Elphrona. Before the Tempest Runners left, Ro gave Milliko his severed hand.\nAfter Ro secretly ordered Milliko's Storms to kill the Tempest Runner if he tried to flee from the Republic by noting Milliko's actions at Eriadu had endangered all of the Nihil, Milliko and his Tempest traveled to the Kur Nebula in the Outer Rim to destroy the transport, but they encountered a trap when the battle fleet appeared before them. In the ensuing Battle of Kur, the Storms did not follow their orders to kill Milliko, and Ro contacted Milliko and told him to defend against the fleets while he supplied the Tempest Runner with a Path. The Eye then started a public transmission to the entire Tempest, supplying them with Battle Paths to fend off against the fleets. Suddenly, the Path engines of Milliko's Tempest's ships activated and caused them travel in and out of hyperspace at a rapid pace and colliding with Republic and Eriaduan ships.\nRo then contacted Milliko on a private channel, telling the Tempest Runner that he had suspected the Weequay of murdering his father, before thanking him for his sacrifice to the Nihil and closing the transmission. The Battle of Kur ended in Milliko's Tempest being wiped out completely, as well as the death of Milliko himself.\nAfter Dee and her Tempest successfully kidnapped one of the Blythe family's members, farmer Ottoh Blythe, and Jedi Master Loden Greatstorm, Ro was given the Jedi's lightsaber by Dee and began inspecting and swinging it. Dee informed the Eye of Kassav and his Tempest's defeat, an event he was already aware of. The Twi'lek, who had began to figure out Ro's true intentions for Milliko and the flight recorder, stated her thoughts to the Eye, to which he responded by detailing his plan and the effects of Milliko's Tempest's defeat. The battle on Elphrona marked the beginning of a conflict between the Jedi and the Nihil.\nRo then stated that he required Dee again in the future. Approaching Blythe, he ignited the lightsaber and executed the farmer in front of Greatstorm, before explaining to Dee why he had sent her and her Tempest to Elphrona; to capture a Jedi to be used in his future plans. At the Great Hall of the Nihil, Ro displayed images of the Battle of Kur on the displays of communications droids. The Eye explained to the marauders that Milliko and his Tempest had made a heroic sacrifice to protect the Nihil, while the Republic and the Jedi slaughtered them. In his thoughts, Ro believed he had taken another step on his path. He then announced that the Nihil would be operating galaxy-wide using an archive of Paths. Ro had thus declared himself the sole leader of the Nihil, with everyone beneath him, even though many rifts were created throughout the group.\nRo later consulted Mari San Tekka aboard the Gaze Electric, telling her to rest as he had much work for her. Afterward, the Eye made his way to the ship's prison room, in which Greatstorm was kept. When Ro approached the Jedi, the latter attempted to use a mind trick on him, but it failed to affect the Eye. He explained to Greatstorm that his family had extensive knowledge on the Jedi and their powers, as well as how to resist them. He added that the prison was designed to keep the Jedi from calling on the Force as the cells were connected to the ship's electrical system that shocked the prisoners within and would thus cause Greatstorm to lose focus.\nWhen Greatstorm asked about Ro's motivations, the Eye stated that he had goals that he would achieve by any means necessary. He then detailed his history with the Nihil, and that all their operations were proceeding smoothly until the Republic expanded their own operations into the Eye's territory along with the construction of the Starlight Beacon. The Jedi then used the Force and pushed Ro into the ship's bulkhead. He then threatened to execute one of the prisoners if Greatstorm attempted the action again.\nRo then revealed that he had orchestrated the Great Disaster and the subsequent chaos in the Hetzal system. When Greatstorm claimed the Jedi Order would come searching for the Jedi Master, Ro pulled out his father's rod and stated that he was not worried about the Jedi. At some point afterward, Ro instructed the Nihil to do two things; maintain a low profile as events after the Great Disaster brought them much attention in order to bring the galaxy into a false sense of security, and to find and establish a main base. The Eye also elevated the Talpini Zeetar to a Tempest Runner to replace Milliko. Although Eyta suggested the Great Hall, the location was hardly defensible. The planetoid of Grizal was eventually chosen as the base; the prison complex there had been located by Zeetar.\nFollowing a skirmish between Nihil and Jedi on the Amaxine space station, Ro was approached by Nihil member Nan, who informed the Eye that her guardian, Hague, was killed in the event along with many others. Ro blamed their deaths on the Jedi and assured her that the Nihil would be responsible for their Order's destruction. As their campaign against the Republic and Jedi carried on, Nan continued to serve the Nihil, becoming one of Ro's most trusted spies by collecting more intelligence than her fellows. To her, her actions were done in the name of the Eye, whose reputation among the Nihil rose as the conflict continued.\nAboard the Gaze Electric, San Tekka learned that debris from the Great Hyperspace Disaster was entering the Trymant system, and would multiple locations within, including the planet Trymant IV. Uttersond, who overheard her, passed on the details to Ro, who realized that Trymant IV was one of the areas they planned to travel to as he wished to acquire information from the Gran Elder Tromak there regarding the location of another artifact that would complete his father's rod.\nWith that in mind, Ro informed Zagyar that they needed to reach the Trymant system before it was wiped out, adding that it may hold the answer to everything that lied ahead before ordering him to alert the ship's bridge to set course for that system. Later on, the Eye himself contacted the Nihil at the bridge via hologram. He stated that he had chosen the best of the Nihil to accompany him aboard the ship for the journey ahead, and that completing it would grant them powers that would destroy both the Republic and the Jedi.\nWhen Ro and the Nihil arrived at Trymant IV during the Emergence there, they attacked the planet and only allowed Tromak aboard their Spider Cruiser, Squall Spider. When the Jedi arrived on the planet to save its citizens and fend off the Nihil, Ro stepped out of the vehicle, ordering his marauders to kill them all. While the Nihil fought with the Jedi, he approached Tromak and a boy named Krix Kamerat, the latter of whom wished to rescue his friend, Zeen Mrala. Ro pointed out that Mrala revealed herself as Force-sensitive, and that the Elders of the Path outlawed usage of the Force. As Kamerat wanted to bring Mrala aboard the Squall Spider, Ro stated that the boy would have to be left behind as well. However, Tromak defended the boy and stated Kamerat was his assistant. The Elder added that without him, Ro would be unable to obtain the information he sought regarding the artifact. Thus, Ro allowed them to stay on board.\nBefore the Spider Cruiser left, Ro spotted Jedi Grand Master Yoda. He then ordered the Nihil to continue their attack on the Jedi and prevent Yoda from infiltrating their ship, before asking Tromak to accompany him and prepare to depart Trymant IV. However, Ro was informed by Zagyar that Yoda, who had successfully boarded the ship, had disappeared from sight. After giving orders to track down the Jedi, Kamerat stated that he would join the search as well. The Squall Spider departed Trymant IV, before encountering a medical frigate and multiple Jedi Vectors. Ro ordered Zagyar to fire a full-powered blast at the ship. Once the frigate was struck, the Vectors converged on the ship to provide assistance, thus allowing the Spider Cruiser to escape into hyperspace and leave the Trymant system.\nKamerat pointed out that they were leaving the system, to which Ro asked the boy if he was still worried about Mrala despite her using the Force and siding with the Jedi. The Eye blamed the girl for allowing Yoda to enter their ship with a creature, which attacked the ship's crew. When Ro asked Kamerat what the girl meant to him, the boy responded that she was no one.\nAboard the Gaze Electric, Ro spoke with Tromak to acquire the information he seeked. However, the Eye learned that the information could not be disclosed to outsiders and was only limited to the Council of Elders. Disappointed, Ro ordered that both Tromak and Kamerat—whom Ro had ordered Zagyar and the droid Nihil X-10 bring to him ahead of breakfast—be escorted to the ship's battle rink, where quadrupedal creatures known as bogaranths would be ridden while following the slime runners who guided them. During an ongoing match, he entered the rink and ordered the Nihil to halt the game as he had discovered a holoprojector with a transponder beacon directly connected to Starlight Beacon, thus revealing that a traitor had given away their location to the Jedi.\nWhen Ro questioned Tromak and Kamerat about the device, the boy blamed the Elder. Although Ro was already aware that Kamerat had used the device to contact Mrala, he pretended to be convinced. After Ro ordered that Tromak be taken away to be eaten by the bogaranths, he confronted Kamerat and stated that Mrala had betrayed him again by keeping the beacon's existence a secret. Nonetheless respecting the ruthless sense of survival Kamerat had shown, Ro, joined by X-10 and Zagyar, then offered the boy a chance at redemption by helping the Nihil lure the Jedi into a trap, to which Kamerat accepted.\nWhile a diversionary Nihil force kept the Jedi occupied in space, the two travelled to the junk moon of Quantxi, after which Ro was informed that the Jedi had fallen into their trap. They were approached by a Junk Maven, who stated the Junk Mavens wanted no involvement in the Nihil's conflict with the Jedi. While Ro was distracted, another Junk Maven began running toward the communications tower on the planet. The Eye then ordered Kamerat to kill her before she could reach the tower in order to prove his worth before handing the boy a weapon.\nSometime later, the Junk Mavens began attacking the Nihil, which Ro witnessed. He ordered Zagyar to have X-10 prepare the Squall Spider to open fire on the Junk Mavens as well as for the Nihil's departure from Quantxi. Ro then boarded a vessel and headed toward Kamerat. He found the boy entangled with the Jedi, Mrala among them. The vessel fired its weapons on the Jedi, creating a distraction that allowed Ro to pick up Kamerat and pull him into the ship's ramp. The Jedi and Mrala began to pull the ship toward them, before the Squall Spider picked up the vessel and escaped into hyperspace.\nHaving learnt the location of the artifact from Kamerat by that point, Ro travelled with Kamerat to the astronomical object of Vrant Tarnum and entered the Kharvashark Ruins, where the artifact was found. Ro, revealing to Kamerat that he reminded the Eye of his own past as a child, removed his mask and entrusted it to the boy, tasking him with overseeing the new Nihil outpost in the area. At some point, Ro tasked Zeetar and his Tempest with raiding the MPO-1400 Purgill-class star cruiser Halcyon and acquiring the codes for the Chandrila Charter Company shipyards. The Tempest succeeded in their mission, but lost some of their members in the process.\nAt some point, Ro approached the Talortai Nihil Udi Dis and had him join his personal retinue as part of a private mission to the tidally locked planet Rystan. He sent out a message to his cousin Kufa, informing her that he was coming to Rystan. Almost a year after the Battle of Kur, Ro travelled through the Rystan Badlands aboard the Squall Spider, piloted by Dis. When the Talortai pointed out that the journey would have been easier with the use of a Path, Ro stated that doing so would mean he would not have seen Dis' piloting skills in action, adding that he was as impressive as his heritage had stated as the Talortai species had a strong connection to the Force. After Dis landed the Spider on Rystan, the two exited the Spider Cruiser and met with Kufa.\nAfter a short exchange, the three headed to the Golamaran ice flats, where the Shrine, home to a Nameless creature that Kufa called the Great Leveler, was located. They travelled there via the hoversled Open Hand, before mounting and riding large creatures known as slarga for the rest of the journey. After reaching an outcrop, they dismounted their slarga and entered the ice caves beneath Golamaran that would take them to the Shrine. During that time, Kufa asked why Ro had to visit the Shrine, since the caves were empty and the Leveler was forgotten by that time. Kufa further doubted that the entity's droid attendants still functioned. When she asked Ro if he was there to bring them hope and reopen the Hand, he stated that it was not his place and he was not a prophet.\nDis then reached out with the Force to sense a presence he felt was intensifying, before Ro asked him what he had felt. After the Talortai responded that he felt nothing, the sounds of a cobonica creature's roar echoed in the passageway the three were in. Kufa then insisted that they leave the caves if they were to survive. Ro grabbed her to prevent her from leaving and activated Greatstorm's lightsaber, preparing to fend off the incoming creature. The three then battled the cobonica, with Ro driving the lightsaber into one of the creature's eyes and cause it to flinch. The cobonica overpowered Kufa and Dis, and swallowed Ro whole. However, the Eye used the lightsaber to kill the creature from inside its body and cut himself free from its belly.\nRo then took off his mask to clean its filters, before Kufa pointed out a tattoo on his face. When the Eye disregarded it as nothing of importance, Kufa stated that they both knew that was not true. The trio then continued to make their way to the Shrine. After finally reaching it, Ro noticed that Dis lost his balance and asked the Talortai if he could continue moving, but Dis replied that that he was able to. However, Dis began to hallucinate and saw his own father. Kufa pointed out that he was being cleansed with the Leveler's power. She and Ro then asked Dis to observe the chamber where the Leveler resided, guarded by four inactive droids. The droids were reactivated and began attacking the trio when Dis slipped on a patch of ice.\nDuring the fight, Dis, no longer able to utilize his connection to the Force to sense incoming threats due to the Leveler's power, was stabbed from behind by one of the droids. Ro and Kufa defeated the droids, before the former approached Dis and asked him what he he had experienced. After the Talortai failed to formulate a cohesive response, Ro marveled at the entity's power. Both he and Kufa cited a mantra, \"Balance will come,\" before he killed Kufa with Greatstorm's lightsaber. Ro then pulled out a comlink and stated that he had found the Leveler and ordered the Nihil to follow his beacon. The Eye then thanked a dying Dis for his efforts, before bringing his foot down on the Talortai's head. The Nihil then had the Leveler frozen in ice and taken to their base on the planetoid Grizal.\nAfterward, Ro travelled to Grizal and met with Zeetar, Eyta, and Dee at the base. He ignored Dee's question regarding his mission on Rystan, and instead asked about development on Path-jumper devices. Handing over his mask to Eyta, he asked the Dowutin if he had kept a low profile as he had instructed. Eyta, who had recently carried out an attack on the Mid Rim Territories planet Cyclor, was about to state that change was needed in the Nihil, before he was interrupted mid-sentence by Ro as the Eye had activated a control for his mask, still in Eyta's hands, that began electrocuting the Dowutin and causing him to convulse as a show of superiority in order to shame him into obedience. Ro chastised him for disobeying his orders while he writhed in pain, pointing out the Nihil killed in the battle and the fact that the Republic was put on high alert and leaving the room before Eyta managed to break the helmet and stop the electrocution.\nThe three then learned about San Tekka's existence through a hologram recording of a conversation between Dis and Eyta. Aboard the Squall Spider, Ro thought about how Eyta started becoming problematic to him, and as such he pulled the electrocution trick with his mask. , and also suspected that the Dowutin was the one to murder Asgar. The Eye was then contacted by Uttersond, and the two discussed the Great Leveler. Uttersond pointed out that the creature had been refrigerated, ready to be taken to the Gaze Electric, while Ro revealed that Dis was overwhelmed byu the Leveler and did not survive the mission at Rystan. When Uttersond stated that the creature was ready for testing, Ro replied that defrosting the Leveler could harm it, before Eyta, who overheard part of the conversation, approached the two.\nEyta questioned Ro's decisions; what he was hiding from the rest of the Nihil. As the Dowutin spoke, Zeetar, Dee, and other Nihil began approaching the group, wishing to learn what had transpired. Ro stated that he would inform everyone when the time was right, but Eyta insisted that Ro do it at that moment. As tensions between them rose, Eyta revealed San Tekka's existence in front of the other Nihil, with Ro accidentally confirming it by stating that no one was allowed to see her without his authority.\nWhen the Dowutin suggested seizing the woman and the Gaze Electric, Ro retorted; stating that while the Nihil could kill the Eye at that moment, San Tekka had been loyal to Ro's family for centuries. The Eye united the Nihil present by revealing that that their enemy, Chancellor Soh, was going to hold the Republic Fair on the planet Valo, where millions of her followers would attend, and pointed out that that was where they would attack next. As the rest of the Nihil chanted the death of Soh, Eyta had no choice but to join in. Ro later entered the ship's laboratory, where Greatstorm was held by then, and conversed with Uttersond regarding the Leveler. At some point, Ro planted a bomb aboard the Elegencia, rigged to detonate should Eyta attempt to make hyperspace jump back to Grizal.\nRo was later contacted by Eyta when the latter was above Valo aboard his own ship, the Elegencia, participating in the attack on Valo. Eyta expressed annoyance at the fact that they were supposed to be maintaining communications silence, to which the Eye replied that the Dowutin was supposed to provide a field report of the battle. The Eye was informed that one of the ships at the fair, the Innovator, was destroyed and that they needed to be left to complete their tasks at hand, before Ro stated that they should scatter to the prearranged coordinates after finishing them and avoid a repeat of the attack on Cyclor. During the battle, the bomb Ro planted had been destroyed, allowing Eyta to return to Grizal safely. The attack on Valo ultimately left hundreds of thousands dead, putting the Jedi on high alert.\nFollowing the event, Ro was informed by a spy within the Republic's Senate that Chancellor Soh was severly injured in the attack. After Eyta returned to Grizal, Ro congratulated him on leading the successful attack as the Nihil cheered. Afterward, he and the Tempest Runners entered a temporary hall, where Eyta demanded that Ro take off his helmet as the victory at Valo was Eyta and Lourna's alone and thus the Eye was to obey him, but abstained as Zeetar and Dee remained quiet. The Dowutin then demanded that they attack Cyclor again, striking the Republic while they were recovering from the attack on Valo, and potentially hit other locations such as Chandrila, Alderaan, and the Republic's capital planet of Coruscant. Ro explained that doing so would be suicide, as he saw the bigger picture, unlike Eyta.\nThe altercation between Eyta and Ro turned into a brawl when the latter ignited Greatstorm's lightsaber and pointed it at the former's throat. When Eyta grabbed Ro's arm and slammed it into a table, he swung his free hand and jabbed a needle filled with poison into the Dowutin's neck, weakening and stumbling the Tempest Runner. The Eye pointed out that Eyta was so quick to respond that he failed to see the real incoming attack, before repeateadly punching his face and stating that the Tempest Runner's ambition and thirst for glory would stop him from seeing the Republic's destruction. Ro gave an order to start a revel at Grizal before departing for the Gaze Electric.\nAfter Eyta recovered, he decided to attack Cyclor once more, but his Tempest was greatly outnumbered by both Republic and Jedi forces upon reaching the planet. Being left to die by his fellow Tempest Runners and Ro, Eyta abandoned his Tempest and escaped his ship via an escape pod.\nWhile aboard the Gaze Electric, above Grizal, Ro was asked by Uttersond on whether or not the final test for the Leveler was ready. In that moment, Ro recalled the memory of his father's last moments and soon after began hearing his voices, leading the Eye to unknowingly retort at Uttersond. When the confused Chadra-Fan clarified that he only asked, Ro stated that they would be ready only when he said so. He was then contacted by Dee and informed that a Republic ship, occupied by Nihil Quin Amarant and his Republic prisoner, Klerin Chekkat, was approaching Grizal, before he ordered the Twi'lek to destroy the ship. However, the ship was allowed to land after Amarant hailed his fellow Nihil at Grizal. Unbeknownst to all of them, a pair of Jedi, Indeera Stokes and Greatstorm's Padawan, Bell Zettifar, hid aboard the ship. They activated a homing beacon after the vessel had been scanned, signaling other Jedi to the Nihil outpost's location.\nUsing his helmet's internal display, Ro watched the footage broadcast from Dee's own mask; Chekkat was dragged into Dee's chambers. He was then informed by the Twi'lek that, as was revealed by Amarant, Chekkat knew the existence of a disruptor field, possessed by the Republic, that could disable all types of energy weapons. After Zeetar ordered Lourna to kill Chekkat, Ro closed the feed. Unknown to him, however, Greatstorm had used a mind trick on Uttersond in order to have the Jedi released. In an ensuing scuffle immediately afterward, Greatstorm used to Force to send the Chadra-Fan flying through a window, right as Ro took notice of the commotion. The Eye then ignited the Jedi's own lightsaber and pointed it at him, stating there was no escape.\nAt that moment, several Jedi arrived at Grizal in their Vectors and began attacking the base in what became known as the Battle of Grizal. Ro was informed of the attack before Greatstorm used the distraction as an opportunity to enter a scuffle with him. Greatstorm used the Force to hurl Ro into the equipment used to keep the Jedi trapped and regained his lightsaber when Ro dropped it as a result, before beginning his escape from the outpost. When the Eye recovered, he encountered the Jedi Master again at a hatch, stating he was unarmed and, as such, the Jedi would not harm him. Ro then feigned surrender before launching needle-sharp hypodermics from his wrists, but Greatstorm avoided the attack by letting himself fall from the hatch as Ro watched. He then immediately came under fire from a Vector, forcing him to throw himself to the deck, his armor protecting him from harm.\nRecovering afterward, Ro saw a specter of his father, who chastised him, before reaching the hatch that Greatstorm had fallen from to see the Nihil camp below in ruins. He then caught sight of Greatstorm, who had survived the fall, fighting alongside Zettifar, questioning how the Jedi Master had survived his imprisonment and why he had not been broken. The specter of Asgar pointed out that Ro should fear the Jedi, adding that they were unstoppable, before Ro pulled out both of the artifacts that would completed the rod and allow him to control the Great Leveler. Asgar's specter warned Ro that using rod would be the end of the Eye, but Ro responded that it was only the beginning. The Eye then combined the artifacts together.\nRo then saw a shuttle containing Dee suspended in air by the Jedi that had used the Force, while he continued to hear Asgar's voice chastising him and telling him to fear the Jedi. Through a camera that Uttersond had installed onto the creature's back, Ro watched as the Leveler broke free from its cage and rushed past him and toward the Jedi. The creature then mentally incapacitated the Jedi. The act petrified Greatstorm in patricular, killing him. Believing that him studying his father's texts and recovering the artifacts was worth all the effort, Ro used the rod to recall the Leveler. The camp then turned silent as both the Nihil and Jedi departed Grizal. In the end, the battle resulted in the deaths of many Nihil. While their scattering forces were on the run and their bases began to be attacked, the Gaze Electric remained untouched. While some Nihil resented Ro's leadership as their losses continued, others revered him as the lord of the pirates, with some younger Nihil viewing him as being more than a mere mortal being.\nAt some point, Ro was received a tithing of coaxium from Dee. Sometime after the Battle of Grizal, he held a meeting with the Tempest Runners, also attended by multiple Nihil, including Kamerat and Nan, aboard the Gaze Electric, in which he discussed a Nihil loss on Dalna—a planet in the Outer Rim with a special connection to his family—after hearing reports of the event. Tempest Runner Kara Xoo, who filled the position left by Eyta's disappearance, stated that it was just a ploy by the Republic to undermine their victories. When Dee pointed out that Xoo's fleet was down twenty ships, Ro wished to know who was in charge of the Dalna run, after which an Ithorian Nihil identified himself as the leader of the run. The Eye then threw a sticky charge toward the Ithorian. The charge attached to his face before exploding, killing the Nihil member and those close to him.\nRo then moved on to discuss the replacement weapon and Jedi prisoner that Dee had promised, citing that the Leveler was growing \"anxious for test subjects.\" The Twi'lek revealed that they were still mapping overlapping routes and citing slow politics as the reason for the lack of a replacement Jedi, before stating that Ro would eventually receive his replacements. When Ro explained that the Republic had obtained more than enough of the Nihil's Path engines and that it was only a matter of time because that government could begin understanding the technology, Dee assured him that the Gravity's Heart, a space station and gravity well projector capable of disrupting hyperspace activities located in the Berenge sector, would halt them, but reiterated that they needed to understand the routes before they could do so.\nDee requested the assistance of San Tekka to speed up completion of the project, to which Ro asked what the benefit of doing so was. She then detailed that more precise mapping and improved intelligence would lead to more profitable hauls, adding that the Gravity's Heart would be powerful in an offensive against the Republic. When Dee stated that it would be disastrous to repeat Eyta's defeat at Cyclor, Ro was displeased upon hearing that and recalling the attack on Grizal. He then suggested having Dee bring her scientist, Chancey Yarrow, aboard the ship, but she stated that doing so would hamper the space station final tweaks as Yarrow would be unsettled. Ro finally agreed to let Dee borrow San Tekka before turning his attention to Nan and ordering her to protect the Oracle with her life, much to Nan's fear, as she assumed the mission was punishment for some kind of failure, and Kamerat's glee. Not taking his attention off Dee, Ro also ordered Nan to have Uttersond accompany them and prepare San Tekka for travel. After the meeting, Ro gave Nan a puzzle box that the Oracle enjoyed and would prove useful if the old woman needed to be forced to cooperate.\nRo at one point contacted Yarrow regarding a task, which the scientist then shared with Nan. Unbeknownst to him, however, Dee, Yarrow, and the Graf family had already created a plan to convince the Eye to hand over San Tekka by informing him of the potential power of the Gravity's Heart so that they could utilize the Oracle's knowledge to complete their mapping data needed to build a more successful gravity well projector. During the battle in the Berenge sector later on, which saw the destruction of the Gravity's Heart, San Tekka passed away in her pod. Telling Nan that the Gravity's Heart would never have been successful, the Grafs and Yarrow believed they had successfully deceived Ro and even convinced Nan to leave his service. Unknown to them, however, the project had played into Ro's plans, as its research allowed him to begin construction of the stormseed weapons.\nSince their mission to Vrant Tarnum, Ro brought Kamerat into his inner circle, with the boy being in command of his own group of Nihil. Following an attack on Vrant Tarnum by Republic and Jedi forces, which saw the Nihil there driven away from Kharvashark Ruins, the Eye was approached by the boy aboard the Gaze Electric. He asked Ro if he could be given the artifact that they had found in the ruins, wishing to experience its power.\nRo pointed out that the pain of seeing Mrala joining the Jedi still consumed the boy, and that he had elevated Kamerate above several Nihil who had been in the group for much longer and into his inner circle, and yet he was still asking for more. Ro then tasked the boy with taking what remained of his forces after the Vrant Tarnum attack and destroying the Jedi Temple on the world of Takodana and killing its guardian, Jedi Master Sav Malagán. However, Kamerat and his forces failed at both tasks.\nAt some point, hologram transmissions of Ro were intercepted by the Leresai Assembly. Although garbled, they were passed on to the Jedi Order, who in fact did not know of Ro's name or that he was the Eye of the Nihil. Without that information, the Jedi suspected that Dee, believed by them to have been killed at the Battle of Galov, instead held the title, and rumors circulated that another Eye had taken the Twi'lek's place.\nRo learned that the Republic tasked two individuals, Jedi Master Emerick Caphtor and a detective, Sian Holt, with capturing the Tarnab Arathab Fal, who claimed he could sell a weapon that could destroy the Jedi Order and also killed a number of Nihil on the planet Vorzyd V. In No-Space, Ro contacted Uttersond via hologram and informed him of his findings, and asked the Chadra-Fan if he had seen a Tarnab lurking around recently. When Uttersond stated he had not seen any, Ro ordered him to stay alert, as the scheme could either be a fraud or a betrayal, before the latter ended communication.\nRo suspected that the doctor was involved in the scheme, and as such he tasked Zagyar and X-10 with tracking down Uttersond, following him to the Tarnab if the doctor's involvement was confirmed, and making both of them suffer before killing them. Indeed, Uttersond was in league with Fal. Zagyar and the other Nihil member then located and boarded the ship the Chadra-Fan was on via the Squall Spider.\nRo was then contacted by Zagyar and informed that the ship was attacked by Fal and no survivors were left, before the Tarnab fled to his own ship and escaped into hyperspace just as the Spider Cruiser arrived. Zagyar also pointed out that the way in which Fal's ship jumped into hyperspace led him to speculate that the Tarnab was in possession of one of the Nihil's Path engines. The pair then found Uttersond injured and unconscious, and Zagyar asked if they should kill him. Ro refused, stating that while someone within the Nihil may have betrayed them, they would not be able to learn more with Uttersond's death, and thus the Eye ordered the pair to keep the doctor alive.\nVia hologram, Ro communicated with Zeetar and Dee, who were being pursued by the Jedi. The Talpini stated that they had done everything the Eye had asked, including testing the Leveler's power on the Jedi, fortifying the Great Hall, and rebuilding their Storm. Ro pointed out how the fortification was Dee's idea, and that it was down to Zeetar and his fellow Tempest Runners to rebuild their Storm. Zeetar angrily stated how the Eye had promised to bring the Jedi to their knees, but instead the Runners were hunted by the Jedi.\nWhen Ro asked the Talpini what he expected him to do, the latter stated that he should be present with the Tempest Runners, before the Eye asked Dee what she thought of the matter. She stated how Ro would always perform the same action; plot a his own course and abandon the Runners. A team of Jedi, aboard the starcruiser Ataraxia, soon jumped out of hyperspace using a Path and began attacking the ship Dee and Zeetar were on. Ro ordered them to defend the Great Hall before closing communication. In the ensuing attack, Zeetar was killed while Dee was captured.\nThe warlord Burnium Ro shared his surname with Marchion. During the reign of the Galactic Empire, Burnium used rhetoric and imagery associated with the Nihil.\nThe man who used the name Marchion Ro was a long-limbed Evereni with long, dark hair, black eyes, and slate-gray skin etched with silver markings, along with an angular physique. Following the Battle of Kur, he had a more confident appearance and he later grew a light beard on his cheeks. When Ro took off his mask, his physical appearance would leave the impression of a \"predator\" on the Tempest Runners. As the leader of the marauders, Ro felt he was the only individual who saw the full potential of the Path engines. He was initially worried about the threat the Jedi Order and Republic posed to the Nihil, going so far as to suggest that the Nihil cease operations to maintain a low profile.\nWith his father dead and believing most of his extended family would try to stab him on sight, Ro considered Mari San Tekka the closest thing he had to a family left, but also despised how much he relied on her for hyperspace routes as her death would cause the Nihil as a whole to lose their biggest advantage over ordinary marauder gangs. Thus, he was secretive about the true nature of the Paths a secret from the rest of the Nihil, including the Tempest Runners. He would go so far as to shock her in her medical pod repeatedly and cause her to have a seizure in order to receive vital information on the Paths as quickly as possible. Ro at one point considered disbanding the Tempests altogether and leading the Nihil alone if the Tempest Runners did not obey him completely.\nAlthough he came to believe, possibly without even realizing it, he was the only being in the universe who mattered, he had no desire to rule over the galaxy. Ro also claimed he continued to practice the rituals performed by \"the faithful\" among his family. In order to acquire and control the Great Leveler, which Ro viewed as a creature of great power, he killed his cousin, Kufa, whom had been overjoyed to see him again. During their reunion, he had not wanted to show her his face, which contained a tattoo that disturbed her despite his claims it meant nothing. While his face softened when she spotted the silver markings on it, Ro only ever saw her as a deluded hag who had squandered the power of the Leveler when it was in her grasp. Despite having said the Talortai was a friend, Ro also killed Udi Dis to ensure the Leveler could be unleashed, although he thanked the talented Nihil pilot for his service before murdering him. He also had scoured the galaxy for the artifact to complete his father's rod.\nAfter seeing the Leveler in action, the Eye was unable to believe what he had experienced, and was left breathless. He thought that all of the effort put into studying his father's texts and searching for that artifact had been worth the trouble. When he collected more Nameless but was asked why he was forging the Nihil into a force that could destroy the Jedi and Republic, he never even considered giving the honest answer; he simply did not want individuals he saw as lesser telling him what to do, so he felt groups like the Jedi and Republic could not be allowed to exist because, according to him, the version of freedom they offered constrained people like him. While he may have not known the truth himself, Ro truthfully did not fight for the thoughts like power, wealth, or revenge that sometimes crossed his mind, instead fighting to wipe out the beings who dared give out laws and orders meant to contain him.\nRo did not believe the Nihil needed to know information about his past, including information on his homeworld and original name, and so he answered his fellow Nihil with few words, giving nothing away. He doubted that his family would accept him if he were ever to return to them. In order to maintain the Nihil's secrecy, Ro would go so far as to sacrifice one of his Tempests, a third of the Nihil, to do so. He hid his true intentions from his subordinates until after the events he planned out had transpired.\nRo also believed that the road to achieving a goal did not matter if the intended result would be achieved regardless. He viewed everyone and everything as a tool to be used to achieve that goal, Although he entrusted his own mask to Krix Kamerat, who reminded the Eye of his own childhood. He even elevated the boy above several longer-serving Nihil and into his inner circle. As the Eye of the Nihil, he wanted to be a strong individual, unlike Uttersond, Greatstorm, or his father. If Ro was able to find it in himself to reflect on what he stood for, he would have found he worked only to ensure his own authority; his talk of giving the Nihil freedom or achieving his family's revenge were, deep down, mere claims, and Ro instead fought for the simple belief that he was the only being in existence who mattered, and therefore the only one deserved to give orders.\nRo held differing opinions for each of his Tempest Runners, and thought that the groups of Nihil they led reflected their leaders' personalities; Eyta's were precise planners, Milliko's was impulsive and chaotic, and Dee's was subtle. To Ro, Milliko felt predictable as a sunrise, believing that either the Weequay hated silence, or was focused on ensuring that people knew the Tempest Runner was present. After setting up Milliko's demise at the Battle of Kur, Ro made a marytr out of him in order to unite the Nihil. Ro saw Zeetar as an obedient soldier and someone who would not follow in Eyta's footsteps as the Talpini knew his place. When observing Zagyar, the Eye respected the fact that Zagyar answered Eyta directly without hiding the truth when explaining Blit's miscalculation.\nRo viewed Eyta as a physically strong individual, and as such used his mask in order to subdue the Dowutin as a show of superiority to shame him into obedience. When being confronted by Eyta aboard the Gaze Electric, Ro was confident that the Dowutin would not attempt to kill him and was only aiming to gain attention from fellow Nihil. In another confrontation with Eyta, Ro repeatedly punched him and pointed out that the Dowutin's ambition and thirst for glory would not allow him to see the Republic's destruction. Ro also planned to make a martyr out of Eyta, like with Kassav at Kur, by planting a bomb aboard the Dowutin's ship and having it detonate should he attempt to return to Grizal. Following Eyta's defeat at the second battle at Cyclor, Ro believed that the remaining two Tempest Runners at the time, Dee and Zeetar, had fallen in line, and no one would challenge him ever again.\nWhen thinking about Asgar, Ro believed he lacked vision, and that he should have restructured the Nihil back when he led the Nihil. When Asgar, who had never treated Ro with kindness or respect, was gravely injured and begged his son for help, Ro repeatedly kicked him, continuing to do so even after the man had died as an act of gratification. He stood over his body for an hour to keep the scene in his memory, wishing to remember Asgar as a corpse rather than the man who had made Ro's life a misery. However, Ro would later be plagued with the voices of Asgar chastising him. On one instance, the voices caused him to accidentally snark at Uttersond, but decided to play along as to keep others from suspecting that Ro was speaking to dead people.\nThrough planning, Marchion Ro was able to manipulate both the Nihil and the Jedi Order by causing the Great Disaster and setting off the chain of events that would help him achieve his goals. His Nihil successfully captured a Jedi after he ordered them to only kidnap a family on Elphrona, as their presence would attract Jedi from the outpost on the planet. Ro was also a skilled fighter, which he demonstrated when injuring and lecturing Milliko. Ro saw Eyta as a physically strong individual, and as such he used alternative methods of subduing the Dowutin when confronting him, such as electrocuting the Tempest Runner with the Eye's own mask and injecting him with a toxin. When Ro delt with Greatstorm unarmed, he exploited the latter's status as a Jedi by stating that the Jedi Master would not attack an unarmed individual and feigning surrender, before using the opportunity to attack Greatstorm.\nMarchion Ro wore a mask created from smoked transparisteel with a storm symbol etched onto it, along with a pattern of lines and swirls and an \"eye\" at the center of the mask. After the events on Quantxi, Ro gave the mask to Kamerat. For clothing, he wore a sleeveless white tunic and belt under a jacket, boots, and black pants. Other colors of pants that Ro also wore at different points in time included greenand brown. The Eye also donned tight leather gloves that had padded knuckles. The gloves were reinforced with acceleration compensators and armored plating that allowed him to punch a hole in a durasteel wall without suffering any pain. He also wore multiple cuffs around his ears.\nFollowing the Battle of Kur, Ro wore his father's heavy fur cloak—Arratan wolf skin covering the shoulders—which conveyed the history of the battles in which it was worn to the Nihil. He donned an ornate mask marked with a superstorm within a red circle that resembled a crown, and it came with communications functionality and an internal display.\nVibro-stars were stored in a sheath on his wrist. His wrists also contained devices that could launch needle-sharp hypodermics filled with poison. Under one of his sleeves was an injector that protruded from a diminutive mechanical arm. For protection, Ro wore armor.\nAfter receiving Greatstorm's lightsaber, Ro hung the weapon on his belt and kept it on his person, using it to threaten those who opposed him. He lost the weapon when Greatstorm himself retrieved it from him in a scuffle during the attack on Grizal. Under his tunic, he kept a three hand-long rod made of stone and metal with symbols such as fire and screaming faces carved into it. The rod emanated a purple glow and grew warm when touched. When it was combined with the other artifact from Kharvashark Ruins, it allowed the wielder to assume control of the Great Leveler. Ro also carried a comlink on his belt.\nMarchion Ro was created by Charles Soule for the Star Wars: The High Republic multimedia project. He was first revealed in a blog post on StarWars.com titled \"Inside Star Wars: The High Republic: Meet the Villains,\" published on October 29, 2020. The character then made his debut appearance in Soule's novel The High Republic: Light of the Jedi, published on January 5, 2021. In the audio drama The High Republic: Tempest Runner, released on August 31, 2021, Ro was voiced by Marc Thompson.\nRo's first name has been inconsistently pronounced between audiobooks. When asked about this, Lucasfilm Story Group member Leland Chee pointed out multiple examples of other Star Wars subjects who have encountered a similar situation, such as Han Solo and Twi'lek, as well as the fact that there was precedent for using a hard \"K\" sound for names with \"CH,\" such as Michael Giacchino. Among the High Republic authors, Ro's first name was always pronounced \"Mar-k-ion.\" They discussed the issue before deciding on the version with the hard \"K\" as it \"felt tougher and had more of an edge,\" thus falling in line with Ro's character. Chee personally preferred the \"Mar-ch-ion\" pronunciation, as it sounded \"authoritative.\" In the end, room was left open for characters to use different pronunciations in-universe, with Chee further pointing out speculation that the Tempest Runners did so intentionally.\nSoule described Ro as an improviser who took any opportunities that were available, further adding that Ro was not afraid to commit evil acts if it would service his goal. The author wanted the character to stand alongside previous villains in Star Wars, such as Darth Vader and Kylo Ren, while avoiding familiar ground in order to make Ro feel unique as an antagonist. According to Soule, developing Ro's character was the biggest challenge in writing Light of the Jedi, and he further described him as \"absolutely terrifying.\" In a short interview with Star Wars: The High Republic Show host Krystina Arielle, Soule described Ro as someone who went after something he knew he wanted without letting emotion hinder that, and as such making the character the leader of the Nihil \"made perfect sense\" for the story.\nWhen designing Ro's helmet, the art team wished to create an iconic design that could also stand with established characters like Vader and Maul. The final design for the helmet was a combination of different designs that were unreleased.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ro_(disambiguation)",
  "/wiki/Template:Redlink",
  "/wiki/Template:Update",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_Trail_of_Shadows_4",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/Star_Wars:_The_High_Republic:_Eye_of_the_Storm",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/Evereni",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Ro_family",
  "/wiki/Nihil",
  "/wiki/Krix_Kamerat",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/High_Republic_Era",
  "/wiki/Asgar_Ro",
  "/wiki/Gaze_Electric",
  "/wiki/Shalla_Ro",
  "/wiki/Pirate",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Galaxy",
  "/wiki/Path",
  "/wiki/Hyperspace",
  "/wiki/Lourna_Dee",
  "/wiki/Tempest_Runner",
  "/wiki/232_BBY",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Starlight_Beacon",
  "/wiki/Stormship",
  "/wiki/Freighter",
  "/wiki/Legacy_Run",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Emergences",
  "/wiki/Realspace",
  "/wiki/Kassav_Milliko",
  "/wiki/Kassav%27s_Tempest",
  "/wiki/Battle_of_Kur",
  "/wiki/Kur_Nebula",
  "/wiki/Nameless_control_rods",
  "/wiki/Elders_of_the_Path",
  "/wiki/Vrant_Tarnum",
  "/wiki/Nameless",
  "/wiki/The_Shrine",
  "/wiki/Kufa",
  "/wiki/Rystan",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Valo",
  "/wiki/Battle_of_Grizal",
  "/wiki/Grizal",
  "/wiki/Jedi_Master",
  "/wiki/Loden_Greatstorm",
  "/wiki/Great_Leveler",
  "/wiki/Eiram",
  "/wiki/The_Force",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Marchion_Ro%27s_broadcast",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Republic_Defense_Coalition",
  "/wiki/Republic_Defense_Coalition_Outreach_Fleet",
  "/wiki/Stormseed",
  "/wiki/Chancey_Yarrow",
  "/wiki/Ros",
  "/wiki/Everon",
  "/wiki/Great_Storm",
  "/wiki/Jedi_Knights",
  "/wiki/Force-sensitive",
  "/wiki/Droid",
  "/wiki/252_BBY",
  "/wiki/Mari_San_Tekka",
  "/wiki/San_Tekka_clan",
  "/wiki/Core_Worlds",
  "/wiki/Medical_capsule",
  "/wiki/Thull%27s_Shroud",
  "/wiki/Belsavis",
  "/wiki/Path_engine",
  "/wiki/Pan_Eyta",
  "/wiki/Battle_Path",
  "/wiki/Tempest",
  "/wiki/Twi%27lek",
  "/wiki/Library",
  "/wiki/Blood",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/No-Space",
  "/wiki/Standard_hour",
  "/wiki/Death",
  "/wiki/Starship",
  "/wiki/The_galaxy",
  "/wiki/Hyperspace_route",
  "/wiki/Engine",
  "/wiki/Cloud_(rank)",
  "/wiki/Dowutin",
  "/wiki/Hetzal_system",
  "/wiki/Lourna_Dee%27s_Tempest",
  "/wiki/Zagyar",
  "/wiki/Attack_on_the_Garello_convoy",
  "/wiki/Garello_Technologies",
  "/wiki/Blit",
  "/wiki/Harpoon",
  "/wiki/Weequay",
  "/wiki/Space_station",
  "/wiki/Spy",
  "/wiki/Blockade",
  "/wiki/Chancellor",
  "/wiki/Blythe_family",
  "/wiki/Planet",
  "/wiki/Elphrona",
  "/wiki/Ransom",
  "/wiki/Homeworld",
  "/wiki/Alderaan",
  "/wiki/Elphrona_Outpost",
  "/wiki/Doctor",
  "/wiki/Kisma_Uttersond",
  "/wiki/Chadra-Fan",
  "/wiki/Pasaana",
  "/wiki/Urber",
  "/wiki/Bridge_(starship)",
  "/wiki/Eriadu",
  "/wiki/Eriadu%27s_inhabited_moon",
  "/wiki/Fortieth_Emergence",
  "/wiki/Black_box",
  "/wiki/Lourna_Dee_(cruiser)",
  "/wiki/Aide",
  "/wiki/Senator",
  "/wiki/Izzet_Noor",
  "/wiki/Jeni_Wataro",
  "/wiki/Transport",
  "/wiki/Fleet",
  "/wiki/Blaster",
  "/wiki/Vibro-star",
  "/wiki/Limb",
  "/wiki/Storm_(rank)",
  "/wiki/Raid_on_Elphrona",
  "/wiki/Farmer",
  "/wiki/Ottoh_Blythe",
  "/wiki/Loden_Greatstorm%27s_lightsaber",
  "/wiki/Nihil_conflict",
  "/wiki/Lightsaber",
  "/wiki/Communications_droid",
  "/wiki/Prisoner",
  "/wiki/Mind_trick",
  "/wiki/Telekinesis",
  "/wiki/Star_system",
  "/wiki/Talpini",
  "/wiki/Zeetar",
  "/wiki/Planetoid",
  "/wiki/Grizal_camp",
  "/wiki/Skirmish_on_the_Amaxine_station",
  "/wiki/Amaxine_space_station",
  "/wiki/Nan",
  "/wiki/Hague",
  "/wiki/Trymant_system",
  "/wiki/Trymant_IV",
  "/wiki/Gran",
  "/wiki/Tromak",
  "/wiki/Hologram",
  "/wiki/Trymant_IV_disaster",
  "/wiki/Attack_on_Trymant_IV",
  "/wiki/Spider_Cruiser",
  "/wiki/Squall_Spider",
  "/wiki/Youngling",
  "/wiki/Zeen_Mrala",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Republic_medical_frigate",
  "/wiki/Jedi_Vector",
  "/wiki/Hospital_ship",
  "/wiki/Frigate",
  "/wiki/Cham_Cham",
  "/wiki/Council_of_Elders",
  "/wiki/X-10",
  "/wiki/Bogaranth",
  "/wiki/Holoprojector",
  "/wiki/Transponder_beacon",
  "/wiki/Quantxi",
  "/wiki/Unidentified_Junk_Maven_1",
  "/wiki/Junk_Mavens",
  "/wiki/Unidentified_Junk_Maven_2",
  "/wiki/Quantxi_communications_tower",
  "/wiki/Weapon",
  "/wiki/Showdown_on_Quantxi",
  "/wiki/Entry_ramp",
  "/wiki/Kharvashark_Ruins",
  "/wiki/Zeetar%27s_Tempest",
  "/wiki/Attack_on_the_Halcyon_(Nihil)",
  "/wiki/MPO-1400_Purgill-class_star_cruiser",
  "/wiki/Halcyon",
  "/wiki/Chandrila_Charter_Company_shipyards",
  "/wiki/Talortai",
  "/wiki/Udi_Dis",
  "/wiki/Rystan_Badlands",
  "/wiki/Species",
  "/wiki/Golamaran_ice_flats",
  "/wiki/Hoversled",
  "/wiki/Open_Hand",
  "/wiki/Slarga",
  "/wiki/Water",
  "/wiki/Cave",
  "/wiki/Cobonica",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Udi_Dis%27_father",
  "/wiki/Comlink",
  "/wiki/Attack_on_Cyclor",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Cyclor",
  "/wiki/Helmet",
  "/wiki/Standard_century",
  "/wiki/Republic_Fair",
  "/wiki/Attack_on_Valo",
  "/wiki/Laboratory",
  "/wiki/Bomb",
  "/wiki/Elegencia",
  "/wiki/Innovator",
  "/wiki/Galactic_Senate",
  "/wiki/Chandrila",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Poison",
  "/wiki/Escape_pod",
  "/wiki/Quin_Amarant",
  "/wiki/Klerin_Chekkat",
  "/wiki/Indeera_Stokes",
  "/wiki/Padawan",
  "/wiki/Bell_Zettifar",
  "/wiki/Homing_beacon",
  "/wiki/Armor",
  "/wiki/Shuttle",
  "/wiki/Camera",
  "/wiki/Coaxium",
  "/wiki/Dalna",
  "/wiki/Kara_Xoo",
  "/wiki/Kara_Xoo%27s_Tempest",
  "/wiki/Unidentified_Ithorian_Nihil",
  "/wiki/Ithorian",
  "/wiki/Politics",
  "/wiki/Gravity%27s_Heart",
  "/wiki/Gravity_well_projector",
  "/wiki/Berenge_sector",
  "/wiki/Scientist",
  "/wiki/Graf_family",
  "/wiki/Gravity_well",
  "/wiki/Battle_in_the_Berenge_sector",
  "/wiki/Krix_Kamerat%27s_cell",
  "/wiki/Mission_to_Vrant_Tarnum",
  "/wiki/Attack_on_Takodana",
  "/wiki/Jedi_Temple_(Takodana)",
  "/wiki/Takodana",
  "/wiki/Sav_Malag%C3%A1n",
  "/wiki/Leresai_Assembly",
  "/wiki/Battle_of_Galov",
  "/wiki/Emerick_Caphtor",
  "/wiki/Detective",
  "/wiki/Sian_Holt",
  "/wiki/Tarnab",
  "/wiki/Arathab_Fal",
  "/wiki/Vorzyd_V",
  "/wiki/Star_Cruiser",
  "/wiki/Ataraxia",
  "/wiki/Battle_for_No-Space",
  "/wiki/Warlord",
  "/wiki/Burnium_Ro",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Hair",
  "/wiki/Universe",
  "/wiki/Soldier",
  "/wiki/Transparisteel",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Jacket",
  "/wiki/Boot",
  "/wiki/Leather",
  "/wiki/Glove",
  "/wiki/Acceleration_compensator",
  "/wiki/Durasteel",
  "/wiki/Ear",
  "/wiki/Cloak",
  "/wiki/Arratan_wolf",
  "/wiki/Crown",
  "/wiki/Stone",
  "/wiki/Fire",
  "/wiki/Charles_Soule",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/StarWars.com",
  "/wiki/October_29",
  "/wiki/2020",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/January_5",
  "/wiki/2021",
  "/wiki/August_31",
  "/wiki/Marc_Thompson",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars",
  "/wiki/Han_Solo",
  "/wiki/Michael_Giacchino",
  "/wiki/In-universe",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ben_Solo",
  "/wiki/Star_Wars:_The_High_Republic_Show",
  "/wiki/Krystina_Arielle",
  "/wiki/Maul",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic_(2021)_3",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_The_Gaze_Electric",
  "/wiki/Star_Wars_Adventures_(2020)_6",
  "/wiki/The_High_Republic_Adventures_(2021)_1",
  "/wiki/The_High_Republic_Adventures_(2021)_2",
  "/wiki/The_High_Republic_Adventures_(2021)_3",
  "/wiki/The_High_Republic_Adventures_(2021)_4",
  "/wiki/The_High_Republic_Adventures_(2021)_5",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._1",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic_Adventures_Free_Comic_Book_Day_2021",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_10",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_Haul",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic:_Mission_to_Disaster_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Starlight:_Shadows_Remain",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_Midnight_Horizon_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_1",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/Halcyon_Legacy_1",
  "/wiki/Soule_Man",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Inside_Intel:_The_Nihil_Hierarchy",
  "/wiki/Star_Wars:_The_Mini_Book_of_Lightsabers",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/242_BBY",
  "/wiki/Category:Images_of_Marchion_Ro",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/The_High_Republic:_Trail_of_Shadows_1",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/The_High_Republic:_Trail_of_Shadows_2",
  "/wiki/Star_Wars_(2020)_7",
  "/wiki/January_12",
  "/wiki/January_13",
  "/wiki/Xanaven",
  "/wiki/231_BBY",
  "/wiki/230_BBY"
 ]
}