{
 "name": "Marcellin Wessel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Galactic Empire7th Sector Army",
      "7th Sector Army"
     ]
    }
   ]
  }
 ],
 "content": "Marcellin Wessel was a Human male who was one of the first regional governors, or Moffs, of the Galactic Empire.\nBeginning as a colonel commanding Grand Army of the Republic forces on the more remote fronts of the Clone Wars, Wessel was appointed by Palpatine under the Sector Governance Decree, which authorized the creation of regional governors to administer entire sectors. Wessel's early rise to the administration of Immalia sector hints at a history of unquestioned loyalty to Palpatine, since such appointments were made only on behalf of those who had proven their loyalty, and as moffs were intended from the start to be answerable only to the Emperor, it was crucial that they be beings who could be depended on without reserve. Shortly after the conclusion of the Clone Wars, Moff Wessel, acting at the request of Sate Pestage, submitted a report outlining the \"highlights\" of Order 66 to Emperor Palpatine.\nWhen Emperor Palpatine declared his Galactic Empire in 19 BBY, Wessel was made Grand Moff of the Immalia Oversector and assumed the role of commander of the 7th Sector Army.\nIt is not known exactly what happened, but evidently Moff Wessel's fortunes turned for the worse. In 3 ABY, at the height of the Galactic Civil War, he had been relegated to the governorship of Yinchorr, a dead-end position in a useless star system. Wessel decided that he could advance his career again by capturing Princess Leia Organa, and kidnapped the leaders of the Yinchorri Elders Council, offering to trade their lives back to the Yinchorri in exchange for Organa. With no choice, the Yinchorri agreed that their beloved elders were worth the life of one Human. They set a trap for Leia, but Wessel double-crossed the Yinchorri, angering them sufficiently to overthrow him and his regime. However, their insurrection was swiftly crushed by the Empire, ending with the killing of the Council and destruction of Tol-Kachorn.\nThese events did not, however, stop the advancement of his son, Redd, to becoming a general in the Imperial Army and eventually head of Central Command under Carnor Jax.\nGovernor Wessel was created in 1983 for the Marvel comics issue The Alderaan Factor by writer Randy Stradley, currently in charge of the Star Wars comic lines for Dark Horse Comics. Like so many Imperial characters written in those days, he had no first name, and indeed it was not seen as relevant at the time. However, Daniel Wallace, included the name as a sort of easter egg in his HoloNet News article for Star Wars Insider 84. In his blog, he wrote: \"'Meet Your Regional Governors' has profiles on Denn Wessex  and Marcellin Wessel, who is intended to be the old man in charge of Yinchorr in the Marvel comic The Last Gift From Alderaan . General Redd Wessel, who appears in Star Wars: Crimson Empire, would presumably be his son.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Seventh_Army",
  "/wiki/Moff/Legends",
  "/wiki/Denn_Wessex",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Sector_Governance_Decree/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Immalia_sector",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Casualty_Report:_Order_66",
  "/wiki/Order_66/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Immalia_Oversector",
  "/wiki/7th_Sector_Army",
  "/wiki/3_ABY/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Yinchorri",
  "/wiki/Council_of_Elders_(Yinchorri)",
  "/wiki/Tol-Kachorn",
  "/wiki/Redd_Wessel",
  "/wiki/General/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Imperial_High_Command/Legends",
  "/wiki/Carnor_Jax",
  "/wiki/1983",
  "/wiki/Star_Wars_(1977)_86",
  "/wiki/Randy_Stradley",
  "/wiki/Daniel_Wallace",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Star_Wars_Insider_84",
  "/wiki/Starfall_(adventure)",
  "/wiki/Star_Wars_(1977)_53",
  "/wiki/Star_Wars:_Crimson_Empire",
  "/wiki/Star_Wars_Insider",
  "/wiki/Republic_HoloNet_News_Special_Inaugural_Edition_16:5:241",
  "/wiki/Order_66:_Destroy_All_Jedi",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com"
 ]
}