{
 "name": "Maren Kelsome",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Maren Kelsome was a Human male soldier of the Alliance to Restore the Republic during the Galactic Civil War. As a young man, Kelsome received his first assignment as a scout to the frozen planet of Akuria II to clean out the remnants of a gutted Imperial garrison destroyed during the Mission to Akuria II, just weeks after the Battle of Yavin. Kelsome performed adequately, helping to remove the last Imperial troops, which allowed the native Akurians to regain their homeworld. Colonel Odan, commander of the Rebels on Akuria II, promoted Kelsome from private to corporal for his performance.\nKelsome later answered a call for soldiers trained in arctic survival to protect the Alliance's Echo Base on the ice planet Hoth, where, under the command of Colonel Ledick Firest, he learned how to function in a formal military structure, which he found quite different from the ragtag Akuria II group that had served under Odan. During the Battle of Hoth in 3 ABY, Kelsome acted as Echo Base's forward scout at Outpost Beta on the base's defensive perimeter, designated Point Rider Five. He earned the distinction of being the first to report the sighting of Imperial All Terrain Armored Transports approaching the base from Hoth's North Ridge, but he and his tauntaun mount were crushed to death under an AT-AT's massive footpad after underestimating the walkers' deceptive speed.\nYoung Maren Kelsome's first assignment with the Alliance to Restore the Republic was to the ice world Akuria II as a scout under the command of Colonel Odan. Kelsome was responsible for sweeping up retreating Imperial troops from a gutted garrison that Odan and his ragtag forces previously wiped out with the help of Luke Skywalker and Princess Leia Organa during a battle just weeks after the Battle of Yavin. Kelsome performed adequately, removing the Imperial presence, and helping the native Akurians to reclaim their homeworld. Odan promoted Kelsome from private to corporal for his actions.\nWhen the call for soldiers trained in arctic survival to protect the Alliance's new Echo Base reached Odan, Kelsome volunteered and transferred to the ice planet Hoth. At Echo Base, Kelsome served under field commander Colonel Ledick Firest, who taught Kelsome formal military structure, which he found to be quite a departure from Odan's undisciplined group on Akuria II. Kelsome was assigned to one of the regular scouting patrols around Echo Base's outer perimeter.\nWith the onset of the Battle of Hoth in 3 ABY, Kelsome was one of the base's many soldiers who were thrust into first-time combat duty. He served as the Alliance's forward scout at Outpost Beta, the outermost manned station on the base's perimeter, under the designation Point Rider Five. When the Empire arrived in the Hoth system, Kelsome and the other advance outposts were notified, with instructions to observe and relay any information on the Imperial invasion force they could, and then to fall back to avoid being overrun.\nKelsome was the first to report the presence of Imperial All Terrain Armored Transports two kilometers from Hoth's North Ridge, although he didn't know what the giant machines were. After issuing an initial sensor report to Echo Station 3-T-8, he nervously described the physical specifications of the heavily armored walkers via comlink directly to General Carlist Rieekan in the Echo Base command center. Rieekan grimly determined that Kelsome was describing the formidable AT-AT walker, and, after Kelsome warned that the walkers would be in firing range of the perimeter in another minute, Rieekan ordered him and his men to vacate immediately.\nKelsome, however, underestimated the deceptive speed of the AT-AT while retreating back to the base. After issuing one final warning of the AT-AT advance to the Echo Base defenses over the whine of servomotors, laser cannon blasts, and the terrified screams of his tauntaun, Kelsome and his mount were crushed to death under one of the walkers' massive footpads before the Alliance fired a single shot.\nMaren Kelsome's arctic survival skills validated him for transfer from one ice planet—Akuria II—to another—Hoth—to serve at the newly-constructed Echo Base. While under the tutelage of Ledick Firest, Kelsome found stringent military protocol to be very different from the loose group run by Odan on Akuria II.\nKelsome was unfamiliar with the AT-AT walker, failing to recognize the giant machine for what it was when reporting the first sighting of the approaching Imperial force to Echo Base during the Battle of Hoth. The imposing size of the war machine frightened the youthful Kelsome, and his nervousness was evident during his comlink conversation with Carlist Rieekan. His unfamiliarity with the AT-AT would prove to be his undoing, when he failed to recognize the walker's deceptive speed and was consequently trampled to death.\nDuring his scout service on Hoth, Kelsome was trained in tauntaun riding, demolitions, and artillery use. His equipment included a blaster rifle, grenades, a comlink, and macrobinoculars.\nA \"Corporal Kelsome\" character first appeared in the 1989 West End Games sourcebook Galaxy Guide 3: The Empire Strikes Back to provide a profile of a standard Echo Base soldier for roleplaying purposes. The Kelsome character was provided a detailed backstory in the 1996 second edition of Galaxy Guide 3, as part of a major expansion on the first edition sourcebook by Pablo Hidalgo, which also provided a full name for the character, \"Maren Kelsome.\" The second edition of Galaxy Guide 3 tied Kelsome with a tauntaun rider appearing in early versions of The Empire Strikes Back script, who first encounters the AT-AT walkers during the opening stages of the Battle of Hoth. This tauntaun rider, before being identified as Kelsome, first appeared in the 1980 Marvel comic adaptation of the film, Star Wars  40, and also appears with several lines in the 1983 radio adaptation of The Empire Strikes Back, identified only as \"Outpost Beta.\" With the merging of these two characters, the second edition of Galaxy Guide 3 was the first source to confirm Kelsome's death in the battle.\nKelsome's biographical entry in the second edition of Galaxy Guide 3 also links him to the Marvel serial comic The Kingdom of Ice, released from July 1978 to January 1979. Specific references in the entry, including the planet Akuria II, the native Akurians, the character Colonel Odan, and a mention of the Imperial garrison defeated during the Mission to Akuria II, all originated in the Marvel comic.\nThe \"tauntaun rider\" character destined to become Kelsome was first illustrated by conceptual artist Ralph McQuarrie during the development stages of The Empire Strikes Back. Originally, the rider was intended to be Luke Skywalker, who, in the conceptualized scene, rides his tauntaun up a ravine only to be surprised by the presence of Imperial walkers and then must flee for his life.\nMaren Kelsome should not be confused with the character of Trey Callum, who appears in the film as the trench officer who confirms the presence of AT-ATs approaching Echo Base. Callum is the third link in a chain of comlink calls, originating with Kelsome and passing through Echo Station 3-T-8, that reports the presence of AT-ATs to the base.\nThe 1990 West End Games The Rebel Alliance Sourcebook and the sourcebook's 1994 second edition include an introductory narrative in \"Chapter Six: Ground Combat\" detailing how \"the advance scout on Echo Base's North Ridge  the first to see the walkers\" goes on to save the life of a downed snowspeeder pilot once the last AT-AT has passed his position. The scout single-handedly neutralizes a squad of snowtroopers before carrying the pilot to safety on his tauntaun. This description is a clear reference to the \"tauntaun rider\" who was later identified as Maren Kelsome. However, with the advent of Kelsome's death early in the battle as established by Galaxy Guide 3 in 1996, any connection between this character in the Rebel Alliance Sourcebook and Kelsome provides a stark continuity inconsistency, since Kelsome is long dead by this point.\nIn The Empire Strikes Back radio drama and the radio drama script, published in The Empire Strikes Back: The National Public Radio Dramatization, Carlist Rieekan addresses Kelsome as a lieutenant. The first edition Galaxy Guide 3 later identified Kelsome as being a corporal during the Battle of Hoth.\nKelsome's report of the AT-ATs in the radio drama script describes the walkers as \"twenty, twenty-five meters high,\" whereas in the actual radio drama, the Kelsome character describes the walkers as \"ten, fifteen meters high.\" This height differential mirrors a persistent canonical discrepancy across sources concerning the actual height of the AT-AT walkers. To date, many sources, including West End Games Star Wars: The Roleplaying Game supplements and sourcebooks such as Star Wars: Complete Cross-Sections, identify the AT-AT at 15.5 meters, while others, including Star Wars: Complete Locations, put the AT-AT at 22.5 meters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/3_ABY/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Akuria_II",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Polar_Base",
  "/wiki/Mission_to_Akuria_II",
  "/wiki/Standard_week/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Akurian",
  "/wiki/Homeworld/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Odan",
  "/wiki/Private/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Ledick_Firest/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Outpost_Beta/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/North_Ridge/Legends",
  "/wiki/Tauntaun/Legends",
  "/wiki/Death/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Hoth_system/Legends",
  "/wiki/Kilometer/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Echo_Station_3-T-8/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/General/Legends",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Laser_cannon/Legends",
  "/wiki/Artillery/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Macrobinoculars/Legends",
  "/wiki/1989",
  "/wiki/West_End_Games",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/1996",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/1980",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_(1977)_40",
  "/wiki/1983",
  "/wiki/The_Empire_Strikes_Back_(radio)",
  "/wiki/The_Kingdom_of_Ice",
  "/wiki/July",
  "/wiki/1978",
  "/wiki/January",
  "/wiki/1979",
  "/wiki/Ralph_McQuarrie",
  "/wiki/Trey_Callum/Legends",
  "/wiki/Officer/Legends",
  "/wiki/1990",
  "/wiki/The_Rebel_Alliance_Sourcebook",
  "/wiki/1994",
  "/wiki/The_Rebel_Alliance_Sourcebook_(Second_Edition)",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Cold_assault_stormtrooper",
  "/wiki/Canon",
  "/wiki/The_Empire_Strikes_Back:_The_National_Public_Radio_Dramatization",
  "/wiki/Lieutenant/Legends",
  "/wiki/Star_Wars:_Complete_Cross-Sections",
  "/wiki/Star_Wars:_Complete_Locations_(2005)",
  "/wiki/Retcon",
  "/wiki/Star_Wars:_Battlefront",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/From_Star_Wars_to_Indiana_Jones:_The_Best_of_the_Lucasfilm_Archives",
  "/wiki/The_Art_of_Star_Wars_Episode_V:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Echo_Base",
  "/wiki/Star_Wars_Insider_74",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2015_Topps_Star_Wars_Illustrated:_The_Empire_Strikes_Back",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee",
  "/wiki/September_26",
  "/wiki/2007"
 ]
}