{
 "name": "Mari-Elan Nora",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "After 3670 BBY",
      "Noremac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lorrdian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Mari-Elan Nora was a female Lorrdian and a member of the Jedi Order around the time of the emergence of the new Sith Empire. Descended from slaves liberated by the Jedi, Nora wished to put an end to the oppression of the Argazdan Redoubt in the Kanz sector, and bring about a decisive conclusion to the centuries-old Kanz Disorders, under which the Lorrdians suffered continuously as slaves. Despite the new emergence of the Sith, the Galactic Senate granted Nora's wishes, and she led a team of Jedi Knights and Republic soldiers against the Argazdans.\nAlthough the Argazdans fought bitterly for their holdings, Nora's forces proved superior, and achieved victory in 3670 BBY. During the liberation of Lorrd, the Argazdan slavers retreated into the gargantuan Slave Pits. When Nora dispatched men to follow, they never returned. Although she could not detect anything through the Force, the Jedi suspected that a great evil lurked within. Nora went on to become the Jedi Watchman of the Kanz sector, before being killed by slavers on Noremac. She was interred in the Crypt of Martyrs on Lorrd.\nMari-Elan Nora was descended from Lorrdians who had been saved from a slave colony by a team of Jedi Knights. A female Lorrdian herself, she joined the Jedi Order, and vowed to bring justice to the home of her ancestors—Lorrd. The planet had been under the oppression of the Argazdan Redoubt since the beginning of the Kanz Disorders three hundred years prior. Despite the emergence of a new Sith Empire, and the resultant Great Galactic and Cold Wars threatening the Galactic Republic, Nora was able to gain enough support in the Galactic Senate for her cause.\nAs a result Nora launched her own crusade to bring a conclusive end to the Kanz Disorders. She teamed up with several other Jedi, as well as the Republic Army, and waged a bitter campaign against the Argazdan Redoubt. Although the Argazdans fought bitterly to hold their territories and their slaves, Nora and her allies emerged victorious in 3670 BBY. During the final battle on Lorrd, the Argazdans beat a hasty retreat into the gargantuan Slave Pits, and then mysteriously vanished. Jedi and soldiers were dispatched to flush out the Argazdans, but did not return. Although she could not sense anything, Nora believed that something sinister was lurking in the Slave Pits. To contain it, she ordered that the Pits be filled in, and that their existence be hidden. The Kanz Disorders were finally over, having claimed over five billion lives.\nIn the wake of the conflict, she became the Jedi Watchman of the Kanz sector. Nora was eventually slain by slavers on Noremac. The Jedi Knight's body was brought to Lorrd, where it was buried in the Crypt of Martyrs, located in Qatamer. The Crypt was reserved for all those who had devoted their lives to combating slavery, and Nora's memorial was accompanied by both a biographical hologram, relaying the events of her life, and a recording of the Jedi Knight herself in the wake of the liberation of Lorrd. Mari-Elan Nora's memorial was visited by the young Human Tash Arranda, who along with her brother, Zak, explored the Slave Pits and discovered what lurked inside—a gargantuan monster of alien origin. Arranda later profiled Nora in her essay entitled Death in the Slave Pits of Lorrd, Or: What I Did On My Inter-Term Break, and illustrated the late Jedi as well.\nNora felt a degree of patriotism for the world of her forefathers, Lorrd, and could not tolerate the Argazdan oppression of the planet. She felt so strongly about her convictions that she took her case to the Republic Senate, and was prepared to bring about the end of the Kanz Disorders. Although she was able to brave the Argazdans, she was worried by the evil lurking in the Slave Pits, which she could not sense through the Force.\nWorking with other Jedi, Nora was able to throw off the yoke of Argazdan oppression, and free the people of Lorrd. During the campaign to free the planet, Nora and her compatriots faced strong opposition from the Argazdans, who were determined to hold on to their territory—nonetheless, she proved the victor.\nMari-Elan Nora was created by Adrick Tolliver for his StarWars.com Hyperspace article, \"Death in the Slave Pits of Lorrd.\" The character was illustrated in the article as well. Tolliver tied his new character to a retcon involving a discrepancy in Star Wars: Knights of the Old Republic II: The Sith Lords. In that game, it is stated that Lorrdians were rescued from Argazdans by Jedi—an event that was not supposed to have happened at that point in the fictional history. Tolliver intended that Nora's ancestors would be an allusion to these earlier liberated Lorrdians, in an attempt to resolve the discrepancy in The Sith Lords. Tolliver was also privy to information from the yet-to-be released reference book, The Essential Atlas, which included information pertaining to Jedi involvement in ending the Kanz Disorders.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3670_BBY",
  "/wiki/Noremac",
  "/wiki/Lorrdian/Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Death_in_the_Slave_Pits_of_Lorrd,_Or:_What_I_Did_On_My_Inter-Term_Break",
  "/wiki/Tash_Arranda/Legends",
  "/wiki/Time/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Slavery/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Argazdan_Redoubt",
  "/wiki/Kanz_sector",
  "/wiki/Kanz_Disorders/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Army",
  "/wiki/Argazdan",
  "/wiki/Liberation_of_Lorrd",
  "/wiki/Slave_Pits_of_Lorrd",
  "/wiki/The_Force/Legends",
  "/wiki/Lorrdian_Yuuzhan_Vong_monster",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Death/Legends",
  "/wiki/Crypt_of_Martyrs",
  "/wiki/Lorrd/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Qatamer",
  "/wiki/Hologram/Legends",
  "/wiki/Human/Legends",
  "/wiki/Zak_Arranda/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Adrick_Tolliver",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Death_in_the_Slave_Pits_of_Lorrd",
  "/wiki/Retcon",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Video_game",
  "/wiki/The_Essential_Atlas",
  "/wiki/Timeline_1:_Treaty_of_Coruscant",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_Blogs"
 ]
}