{
 "name": "Mari_Amithest",
 "display_name": "Mari Amithest",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Between 30 BBY and 26 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Bear Clan",
      "Bear Clan"
     ]
    }
   ]
  }
 ],
 "content": "Mari Amithest was a Force-sensitive human female and a member of the Jedi Order as a child during the last years of the Galactic Republic. Raised within the Jedi Temple on Coruscant, Amithest began her training in the ways of the Force and lightsaber combat among other Jedi younglings as a member of the Bear Clan. In 22 BBY, while practicing her lightsaber skills under the supervision of Grand Master Yoda, Amithest's class was visited by Jedi Knight Obi-Wan Kenobi, who sought the ancient Jedi Master's help in locating the planet Kamino.\nThe Grand Master decided to use Kenobi's inquiry to engage his students' problem-solving skills. Amithest's classmate, J. K. Burtola, deduced that the Kaminoan homeworld's location was erased from the Jedi Archives.\nMari Amithest was a child; born at some point between 30 BBY and 26 BBY, she lived during the final years of the Galactic Republic. Having joined the Jedi Order at a young age, she became a member of the Bear Clan—a class of younglings who trained together in the Jedi Temple on the planet Coruscant. In 22 BBY, Amithest and the rest of the Bear Clan were practicing with training lightsabers under the tutelage of Jedi Grand Master Yoda in one of the Temple's classrooms when the Jedi Knight Obi-Wan Kenobi interrupted the lesson to seek Yoda's guidance.\nYoda halted the class, and Amithest and the others greeted Kenobi, who explained that he was looking for the planet Kamino, but could not find it in the Jedi Archives. Yoda instructed Amithest's classmate Liam to lower the classroom's blinds so that Kenobi could show the class a holographic star map and indicate where the planet should be. The ancient Jedi Master asked the class if they had any thoughts on why the planet might be missing. Ultimately, J. K. Burtola, another classmate of Amithest, suggested that it was erased from the archives. Satisfied with this answer, Yoda moved away from the younglings to speak briefly with Kenobi about this troubling idea.\nMari Amithest was a human female who had black hair, brown eyes, and tan skin. She conducted herself in an appropriate manner, greeting the more senior Jedi Obi-Wan Kenobi upon his visit to her classroom.\nAmithest was Force-sensitive and therefore possessed the powers of the Force. As a youngling, she received an introductory course in lightsaber techniques from Yoda, who taught Amithest to let her intuition guide her actions.\nWhile training with Yoda, Amithest wore tan Jedi robes, a brown belt, and a gray training helmet. She used a training lightsaber to practice her skills at blocking simulated blaster bolts.\nMari Amithest was portrayed by Phoebe Yiamkiati in the 2002 film Star Wars: Episode II Attack of the Clones and was identified in the film's credits. The character was identified as simply \"Jedi Child May\" in the film's script and originally responded to Yoda's question with \"If the planet blew up, the gravity would go away.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mari_Amithest",
  "/wiki/Mari_Amithest/Legends",
  "/wiki/30_BBY",
  "/wiki/26_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Bear_Clan",
  "/wiki/Force-sensitive",
  "/wiki/Youngling",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Jedi_training",
  "/wiki/The_Force",
  "/wiki/Lightsaber_combat",
  "/wiki/Jedi_Initiate",
  "/wiki/22_BBY",
  "/wiki/Lightsaber",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Master",
  "/wiki/Planet",
  "/wiki/Kamino",
  "/wiki/J._K._Burtola",
  "/wiki/Kaminoan",
  "/wiki/Homeworld",
  "/wiki/Jedi_Archives",
  "/wiki/Reproduction",
  "/wiki/Training_lightsaber",
  "/wiki/Jedi",
  "/wiki/Jedi_temple",
  "/wiki/Liam",
  "/wiki/Hologram",
  "/wiki/Star",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Force_power",
  "/wiki/Jedi_apparel",
  "/wiki/Belt",
  "/wiki/Armor",
  "/wiki/Blaster",
  "/wiki/Phoebe_Yiamkiati",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Gravity/Legends",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(original)",
  "/wiki/The_Art_of_Star_Wars_Episode_II:_Attack_of_the_Clones"
 ]
}