{
 "name": "Mari San Tekka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Prior to 332 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 231 BBY",
      "Gravity's Heart",
      "Berenge sector"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "San Tekka clan"
     ]
    }
   ]
  }
 ],
 "content": "Mari San Tekka was a Force-sensitive human female hyperspace prospector and member of the San Tekka clan. At the age of six, while traveling with her family, San Tekka gained the ability to locate the Paths, unconventional routes through hyperspace. She used her ability to bring wealth and fame to her family, but was taken by the family of Marchion Ro, who used the Paths that San Tekka generated for their own benefit. Asgar Ro, the father of Marchion, utilized the Paths after taking control of the Nihil criminal organization, as did Marchion after his father's death. By that time, San Tekka had been alive for over a century, housed in a medical pod aboard Ro's flagship Gaze Electric, and still believed she was working as a prospector. However, after Ro took the Jedi Master Loden Greatstorm prisoner, San Tekka was able to telepathically communicate with him, regaining an awareness of her surroundings while Ro and Doctor Kisma Uttersond were unaware of it.\nMari San Tekka, a human female, was born into the San Tekka clan of hyperspace prospectors sometime prior to 332 BBY. She was Force-sensitive, and at the age of six, while travelling with her family, Mari developed the ability to detect Paths, unconventional hyperspace routes. She used this ability to bring wealth and renown to the San Tekkas for years. However, the fame came with a price: Mari was eventually kidnapped by a family with a longstanding grudge against the Galactic Republic and Jedi Order, who used her ability to their benefit, keeping her alive in a medical capsule. The rest of the San Tekka clan believed her to be long dead.\nBy 232 BBY, Mari was an unwitting prisoner aboard the Gaze Electric, the flagship of Eye of the Nihil Marchion Ro, who used her as his father Asgar and his grandmother had, calculating Paths that he could use. Mari believed Ro was selling the Paths to the Galactic Republic. Ro kept Mari's existence secret from the Nihil pirates he nominally led, posing as the source of the Paths. Besides Ro, only Doctor Kisma Uttersond and the hired crewmembers of the Gaze Electric knew of Mari's existence.\nAround that year, Ro arranged the Great Hyperspace Disaster as part of his plans against the Republic and Jedi Order, which led to the destruction of the freighter Legacy Run after it nearly collided with a Nihil Stormship in hyperspace. As the starship's debris Emerged randomly across the Outer Rim Territories, Ro had Mari calculate the future Emergences, after shocking her to snap her out of a trance despite Uttersond's warnings that she might die. In her mental fog, however, Mari was happy to do the calculations.\nWhile investigating the cause of the disaster, Jedi Master Avar Kriss and Jedi Knight Elzar Mann travelled to Naboo to visit the current heads of the San Tekka clan, Marlowe and Vellis. When Kriss described the unusual hyperspace goings-on, Marlowe and Vellis immediately recognized the signs of Mari's abilities, but did not tell the Jedi the truth, although they promised their family's help. Mann sensed their dishonesty, but Kriss dissuaded him from prying further as she felt it would not be helpful at that time. After the Jedi had left, Marlowe and Vellis discussed the possibility that Mari was still alive, but were puzzled as to how that was even possible.\nThe Nihil used Mari's Emergence calculations in the ensuing chaos, which led the Republic and Jedi to realize the pirates had the ability to predict the incidents, an ability the Republic and Jedi had gained through a navidroid array constructed by Keven Tarr. In order to conceal the Nihil's true numbers, Ro sent one of the Nihil's three Tempests to their deaths at the Battle of Kur. Around the same time, Lourna Dee's Tempest captured Jedi Master Loden Greatstorm during a raid on Elphrona. Greatstorm was taken to Ro, who imprisoned the Twi'lek aboard the Gaze Electric under torturous conditions intended to make it difficult for him to use his Force powers.\nFor nearly a year, Greatstorm was tortured by Uttersond at Ro's orders, finding it difficult to think. However, he established a telepathic connection with Mari, although he was not even sure if she was real. The psychic rapport led Mari to gain a greater awareness of her situation, although she continued to calculate Paths for Ro.\nAs part of his ongoing plans, Ro elevated Udi Dis, a Force-sensitive Talortai navigator, into a member of his personal crew. In that position, Dis learned of Mari's existence. However, the Tempest Runner Pan Eyta, Dis' former superior, used the fact that Dis had once been a reedug addict to find out about some of Ro's plans. Ro had made Dis throw out his stash, but Eyta arranged for Dis to get his hands on some reedug stolen from the Reekrider Cartel. While under the drug's influence, Dis recorded a taunting holomessage for Eyta in which he revealed Mari's existence. Ro later brought Dis to Rystan, where he was killed after Ro had used him to see the Great Leveler's effects on Force-users. When Ro returned to the Nihil base on Grizal, he was confronted by Eyta, who had shown the recording to Lourna Dee and Zeetar. Making a slip-up, Ro confirmed the existence of \"the Oracle\" in public, but, angry over the error, still took care to conceal Mari's name from the pirates. The incident led Ro to attempt to kill Eyta more than once, although the Dowutin eventually escaped the Battle of Cyclor in an escape pod, vowing revenge on both Ro and Dee for double-crossing him.\nThe Jedi eventually located the Grizal base, and Greatstorm was able to escape captivity in the process. He located Mari onboard the Gaze Electric, but she told him she was already gone and urged him to go to his Padawan, Bell Zettifar, who was participating in the attack and had sensed his old Master. Before Greatstorm left, Mari thanked him for bringing her back and showing her the way.\nAs part of the Gravity's Heart gravity-well projector project in the Berenge sector, Ro allowed Tempest Runner Lourna Dee to take Tekka in her stasis pod to the space station. In truth, Dee, the station's creator, a scientist named Chancey Yarrow, and their secret benefactors in the Graf family were intending to deceive Ro into giving them access to Tekka to extract her knowledge to create a version of the Gravity's Heart on their own terms. Unknown to them all, Ro did benefit from the project, using the research established by it to begin develop of the \"stormseeds.\"\nRo sent Tekka to the Gravity's Heart with Uttersond and under the guard of his agent Nan. However, Tekka, continuing to be aware of her surroundings but realizing she was beginning to pass away despite Ro's attempts to prolong her life, began to use the Force to bring Jedi Knight Vernestra Rwoh, who also had a seemingly-unexplainable connection to hyperspace, to her location, intending to give the Jedi Knight the last Path she would ever devise. As the Republic and Jedi besieged the Gravity's Heart and destroyed it, Rwoh met Tekka as the woman finally passed on, receiving the Path before destroying the stasis pod to ensure the ancient woman could rest. News about Tekka and how the Nihil had used her spread around the galaxy through the HoloNet.\nTekka's death robbed the Nihil of the chance to generate new Paths, although Ro possessed a backlog thanks to the great many she had been forced to find before her death. Nevertheless, without Tekka to give them new Paths, the Nihil's Path engines became less reliable. Sometimes using a Path worked as intended, while other Nihil ships would explode while trying to use one. In the aftermath of the Battle of Galov, with the Nihil continuing to suffer heavy losses to the Republic and Jedi, Tempest Runner Zeetar asked the Eye whether he even still possessed the Paths, with Ro promising to send him what he had so the remains of Zeetar's Tempest could return to the Great Hall. Despite their losses, Ro achieved a great victory over the Republic by destroying Starlight Beacon and unleashing the stormseeds into hyperspace to declare the Nihil territory independent.\nA human female, Mari San Tekka was extremely physically frail by 232 BBY due to having been kept alive for far longer than a normal human lifespan. She was mentally hazy and unaware of her surroundings, seeming not to realize that Ro regularly tortured her to make her calculate Paths, and believing that he sold the data to the Republic. However, Mari became more aware of her situation after meeting Loden Greatstorm, and thanked him for the effect his presence had had as he escaped the Gaze Electric, telling him that it was okay to leave her behind.\nMari San Tekka had a unique Force-powered ability to sense Paths, unusual routes through hyperspace that were not accessible to normal travellers. She was able to calculate the Paths even while inside the mental fog that kept her unaware of her status as a prisoner. Despite having no formal training, she was also able to use telepathy to connect with Loden Greatstorm after he became a prisoner aboard the Gaze Electric.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tales_of_Villainy:_The_Gaze_Electric",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_1",
  "/wiki/332_BBY",
  "/wiki/231_BBY",
  "/wiki/Gravity%27s_Heart",
  "/wiki/Berenge_sector",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/San_Tekka_clan",
  "/wiki/Force-sensitive",
  "/wiki/Hyperspace",
  "/wiki/Prospector",
  "/wiki/Path",
  "/wiki/Hyperspace_route",
  "/wiki/Marchion_Ro",
  "/wiki/Asgar_Ro",
  "/wiki/Parent",
  "/wiki/Nihil",
  "/wiki/Death",
  "/wiki/Time",
  "/wiki/Standard_century",
  "/wiki/Flagship",
  "/wiki/Gaze_Electric",
  "/wiki/Jedi_Master",
  "/wiki/Loden_Greatstorm",
  "/wiki/Prisoner",
  "/wiki/Telepathy",
  "/wiki/Doctor",
  "/wiki/Kisma_Uttersond",
  "/wiki/Standard_year",
  "/wiki/Ro_family",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Order",
  "/wiki/Medical_capsule",
  "/wiki/232_BBY",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Shalla_Ro",
  "/wiki/Pirate",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Freighter",
  "/wiki/Legacy_Run",
  "/wiki/Stormship",
  "/wiki/Starship",
  "/wiki/Emergences",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Avar_Kriss",
  "/wiki/Jedi_Knight",
  "/wiki/Elzar_Mann",
  "/wiki/Naboo",
  "/wiki/Marlowe_San_Tekka",
  "/wiki/Vellis_San_Tekka",
  "/wiki/Jedi",
  "/wiki/Keven_Tarr%27s_navidroid_array",
  "/wiki/Keven_Tarr",
  "/wiki/Kassav%27s_Tempest",
  "/wiki/Tempest",
  "/wiki/Battle_of_Kur",
  "/wiki/Lourna_Dee",
  "/wiki/Lourna_Dee%27s_Tempest",
  "/wiki/Raid_on_Elphrona",
  "/wiki/Elphrona",
  "/wiki/Twi%27lek",
  "/wiki/Force_power",
  "/wiki/Udi_Dis",
  "/wiki/Talortai",
  "/wiki/Tempest_Runner",
  "/wiki/Pan_Eyta",
  "/wiki/Reedug",
  "/wiki/Holomessage",
  "/wiki/Rystan",
  "/wiki/Great_Leveler",
  "/wiki/Grizal_camp",
  "/wiki/Grizal",
  "/wiki/Zeetar",
  "/wiki/Dowutin",
  "/wiki/Battle_of_Cyclor",
  "/wiki/Escape_pod",
  "/wiki/Padawan",
  "/wiki/Bell_Zettifar",
  "/wiki/Gravity_well_projector",
  "/wiki/Space_station",
  "/wiki/Scientist",
  "/wiki/Chancey_Yarrow",
  "/wiki/Graf_family",
  "/wiki/Stormseed",
  "/wiki/Nan",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Battle_in_the_Berenge_sector",
  "/wiki/HoloNet",
  "/wiki/Battle_of_Galov",
  "/wiki/Zeetar%27s_Tempest",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/The_Force",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_Adventures_(2020)_6",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Hyperspace",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_week",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/The_High_Republic:_Tempest_Runner"
 ]
}