{
 "name": "Mari Kosan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Partisans",
      "Kashyyyk resistance"
     ]
    }
   ]
  }
 ],
 "content": "Mari Kosan was a human female who served as a lieutenant in Saw Gerrera's Partisans. Kosan assisted with Gerrera's mission to disrupt Imperial supply lines on Kashyyyk, and wished to stay to assist the native Wookiees. When the Empire struck back at the Partisans, Gerrera felt staying on Kashyyyk was too risky, while Kosan felt that the Partisans needed to protect the Wookiee resistance group.\nBefore the formation of the Galactic Empire in 19 BBY, Mari Kosan worked as a topographer, mapping formations on rural planets. Despite it being her dream job, she could not sit back as the Empire turned its people into \"indentured servants,\" and she joined the Partisans, a rebel cell led by Saw Gerrera.\nIn 14 BBY, the Partisans attacked an Imperial Refinery on the Wookiee homeworld Kashyyyk to disrupt Imperial supply lines. Kosan mapped out the nearest garrisons to the refinery so the Partisans knew that reinforcements would not be able to arrive in time to defend the refinery. When attacking a cargo pad, the Partisans found assistance from the Jedi Padawan Cal Kestis, who was there in search for the Wookiee chieftain Tarfful. After he freed a number of Wookiees at the refinery, Mari awaited them at the door to the cell block as they pushed it open, asking the freed slaves whether they were ready to fight some \"imps\" and commending Kestis' work, telling him they needed to rendezvous with Gerrera.\nKestis found Gerrera and his troops trapped and proceeded to a console to freed the remaining imprisoned Wookiees in the refinery. After clearing the roof of Imperial troops, Mari and the others gathered with Kestis, Gerrera and the Wookiees to celebrate the capture of the refinery. After Gerrera's brief victory speech, he, Kosan and the Wookiee Choyyssyk gathered around Kestis. Gerrera offered the Jedi a place in the Partisans, which he refused, wishing not to walk away from his own mission. Kosan and Choyyssyk then approached him about the finding Tarfful, promising to be in touch with his ship, the Stinger Mantis.\nAfter some time, having found Tarfful in the Shadowlands of Kashyyyk, she contacted the Mantis to inform Kestis. By the time Kestis had arrived to Kashyyyk, Gerrera had left the planet leaving the remaining Partisans to fend for themselves. After fighting their way through the recaptured refinery, Kestis and BD-1 met with Kosan, Tarfful, and Choyyssyk. Tarfful told Kestis to climb the Origin Tree and Kosan gave Kestis a breather to help him get there. The two groups then parted ways.\nMari Kosan was skilled in topography, having mapped out formations on rural planets prior to the rise of the Empire. During her time in the Partisans, she mapped out the nearest garrisons to an Imperial refinery for them. She also understood the Wookiee language and translated Choyyssyk's speech for Cal Kestis.\nMari Kosan first appeared in the 2019 video game Star Wars Jedi: Fallen Order. She is played by Sumalee Montano.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Partisans",
  "/wiki/Kashyyyk_resistance",
  "/wiki/Lieutenant",
  "/wiki/Saw_Gerrera",
  "/wiki/Liberation_on_Kashyyyk",
  "/wiki/Galactic_Empire",
  "/wiki/Kashyyyk",
  "/wiki/Homeworld",
  "/wiki/Wookiee",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Slavery",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/14_BBY",
  "/wiki/Imperial_Refinery",
  "/wiki/Garrison",
  "/wiki/Cargo_Pad_119-Grek",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Cal_Kestis",
  "/wiki/Chief",
  "/wiki/Tarfful",
  "/wiki/Choyyssyk",
  "/wiki/Stinger_Mantis",
  "/wiki/Shadowlands",
  "/wiki/Origin_Tree",
  "/wiki/Breather",
  "/wiki/Language",
  "/wiki/Translator",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Sumalee_Montano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com"
 ]
}