{
 "name": "Maris_Brood",
 "display_name": "Maris Brood",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Iridonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.65 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Unidentified Master",
      "Shaak Ti"
     ]
    }
   ]
  }
 ],
 "content": "Maris Brood was a female Zabrak Jedi Padawan, who survived the initial stages of the Great Jedi Purge. She spent many years in hiding with Jedi Master Shaak Ti on the planet Felucia. After her master's death, she was corrupted by the dark side of the Force, along with the entire planet and its native population. After Brood captured Senator Bail Prestor Organa, she was confronted by Darth Vader's Sith apprentice, Starkiller, who defeated her in combat. Initially tempted to kill her, the apprentice ultimately spared Brood's life and allowed her to disappear into hiding once more.\nMaris Brood was found as an infant by the Jedi Order, and taken into training due to her connection with the Force. Trained by her Master on the starship Gray Pilgrim, she was distanced from the rest of the Order during the Clone Wars. Due to their isolation, Brood and her Master did not fall victim to the execution of Order 66. Still, the effects of the killings were felt even in seclusion; sensing the near-simultaneous deaths of so many Jedi, Brood's Master set out to recover evidence of their fate.\nHer Master disappeared, never to be seen again, but not before he was able to warn Brood of the destruction of the Jedi and Darth Vader's role in the Great Jedi Purge. Bent on revenge, Brood set out to hunt down and destroy the Dark Lord of the Sith. Intercepted by surviving Jedi Master Shaak Ti, Brood was persuaded away from the dark side of the Force and went into hiding in the forests of Felucia with her new Master.\nShaak Ti befriended the native Felucian tribes and continued to train Maris Brood in the Jedi arts on Felucia for years while also hiding from the Sith Lords and their Galactic Empire. Despite Brood's loyalty to Ti, she continued to harbor much anger and resentment over the persecution of the Jedi, a trait which Ti tried and failed to eliminate. By the year 3 BBY, both the Jedi Master and her Felucian shamans sensed that the young Padawan was gradually falling to the dark side of the Force.\nWhen Starkiller, Vader's secret apprentice, visited the planet for the first time, hunting Shaak Ti, Brood requested the chance to confront the assassin at her Master's side; a request that Shaak Ti denied due to her certainty that Brood would be killed by the Sith adept. Ti instead sent her to the rancor graveyard, despite Brood's protestations that she was strong enough to stand alongside her Master. After Ti was defeated and killed by Starkiller, Brood was left without a master once more, stranded and alone on Felucia. When Starkiller visited the planet for a second time, in a mission to rescue Senator Bail Organa, he discovered Brood waiting for him.\nWhen Organa arrived on Felucia in search of Shaak Ti, unaware of her death, hoping she would rescue his adopted daughter, Brood had taken him captive. The loss of her mentor had plunged Brood deeper into darkness; an effect that spread throughout the planet, infecting the Felucians with the dark side. Brood captured the Senator and kept him as her prisoner, planning to offer him to Darth Vader, should he ever find her, in exchange for her life. When Starkiller arrived in search of Organa, the fallen Jedi confronted him with her pet bull rancor.\nStarkiller killed the rancor and defeated Maris Brood, incapacitating Brood with Force lightning as she turned to flee. Begging for her life with the promise of redeeming herself of the dark side's influence, she convinced Starkiller to let her go. Organa protested, recalling Anakin Skywalker's fall to the dark side. Starkiller defended his mercy by saying that Maris Brood was not truly free; and that she would carry the memories of her actions with her forever. What became of her afterwards is unknown.\nAs the Empire's rule spread across the galaxy, Maris Brood and her new Master lived a life of hiding on the distant, inhospitable Felucia. Brood herself was keen to bring the fight to the enemy, though this impulse was held back by Shaak Ti. She was more open to giving into her baser urges and primal emotions than heeding her Master's example of calmness and patience. Despite her inclinations toward the dark side, Ti believed that it was due more to Brood's fear than anger.\nAfter Ti's death, Maris Brood's sense of abandonment and betrayal at having been left alone on Felucia resulted in her immersion in the dark side of the Force, though she would later claim that this was because of the dark nature of the planet itself. Her fear of death at Darth Vader's hands made her more than willing to place her own survival above all else, taking hostages and potentially trading them to the Empire in exchange for her life.\nSuch was her fear of death that Maris Brood resorted to begging for her life at the hands of Starkiller. The apprentice judged such behavior unworthy of the dark side, believing that Brood's failure to control her fear was a weakness that caused an aspiring Jedi Knight to become a coward who pleaded for mercy. Although Brood swore to renounce the dark side, Bail Organa and Starkiller both doubted her sincerity.\nMaris Brood was born a Force-sensitive, who was helped towards realizing her potential first by her original Master and, later, Shaak Ti. Both undertook to train her in the use of the Force and the ways of the Jedi. Trained on both her first Master's ship, the Gray Pilgrim, and on the planet Felucia by Shaak Ti, Maris Brood was not considered strong enough by Ti to face Starkiller when he arrived on the planet to kill Ti.\nBy the time of her fall to the dark side, Brood utilized twin red guard shotos in combat. She was proficient in the use of telekinesis as well as fighting at close range using melee attacks. Brood also showed an affinity for Beast Control, befriending the mythical bull rancor, which was thought to be uncontrollable by the native Felucians. In an attempt to defeat the secret apprentice on Felucia, Maris Brood utilized the ability of Force cloak, hiding from Starkiller before launching withering attacks upon him.\nLeaked Hasbro toy catalogues were the first sources to reveal Maris's name. Her name was later confirmed by the March 2008 issue of Game Informer.\nEarly images of the Force Unleashed figures in both the 2\" and 3.75\" scales showed Maris wielding twin green-bladed lightsabers with tonfa-shaped hilts. However, in later promotional artwork and in Hasbro's figure, Maris Brood is depicted with red-bladed sabers. The handles on the final production figure are in the wrong place, forcing Maris to hold them near the blade rather than at the far end.\nMaris Brood was voiced and portrayed by actress Adrienne Wilkinson.\nMaris can be selected as a playable skin in The Force Unleashed video game through the cheat code MARISBROOD. When selected, however, cutscenes are disabled. In the N-Gage/iPhone versions of the game, Brood holds Organa inside a downed Munificent-class star frigate. When Starkiller defeats her there, she does not beg for her life. Instead, the Sith apprentice decides to spare her by himself.\nIn 2010 Maris appeared as one of the eight playable duelists in the Wii version of Star Wars: The Force Unleashed II. Concept art was also included on the Wii version, with a noticeably different outfit, indicating that she was originally intended to make an appearance in the main game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Maris_(disambiguation)",
  "/wiki/Iridonia/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Maris_Brood%27s_Master",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Felucia/Legends",
  "/wiki/Death/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jungle_Felucian/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Battle_of_Felucia_(Great_Jedi_Purge)",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Galen_Marek",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/File:LastOfTheJedi-TFU.ogg",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Gray_Pilgrim",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Felucian_shaman",
  "/wiki/Mission_to_Felucia_(Great_Jedi_Purge)",
  "/wiki/Sith_assassin/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Prisoner/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Bull_rancor",
  "/wiki/Force_lightning/Legends",
  "/wiki/File:We%27reNotCrazy-TFU.ogg",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/File:MTFBWYMarisBrood-TFU.ogg",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Red",
  "/wiki/Guard_shoto/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Animal_bond",
  "/wiki/Force_cloak",
  "/wiki/Hasbro_Inc.",
  "/wiki/Adrienne_Wilkinson",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Star_Wars:_The_Force_Unleashed_II",
  "/wiki/Category:Audio_files_of_Maris_Brood",
  "/wiki/Category:Images_of_Maris_Brood",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/Star_Wars:_The_Force_Unleashed_(comic)",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/The_Force_Unleashed_II_(novel)",
  "/wiki/Wizards.com",
  "/wiki/The_Force_Unleashed_Preview_2:_Maris_Brood_and_Kazdan_Paratus",
  "/wiki/Star_Wars_Miniatures",
  "/wiki/The_Force_Unleashed_(Star_Wars_Miniatures)",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Force_Unleashed",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/Star_Wars_Fandex_Deluxe_Edition",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Rebellion_Era_Campaign_Guide",
  "/wiki/Star_Wars:_The_Force_Unleashed_II:_Prima_Official_Game_Guide",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/50_Great_Reasons_to_Rewatch_Star_Wars:_The_Clone_Wars_Season_Three",
  "/wiki/Star_Wars_Insider_125",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)#The_Force_Unleashed_Databank"
 ]
}