{
 "name": "Marida Sumar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Copper"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Lothal resistance group",
      "Lothal resistance group"
     ]
    }
   ]
  }
 ],
 "content": "In 4 BBY, Marida Sumar lived with her husband Morad on a farm on Lothal. The two were forced from their home by the Galactic Empire, who had originally wanted to buy it from them but, after Sumar refused the offer, destroyed it and took the couple prisoner. They were later rescued by Ezra Bridger and Garazeb Orrelios. By 2 BBY, Marida and her husband had joined a rebel cell led by Lothal's former Governor Ryder Azadi. She and her husband took part in a joint mission to infiltrate the Lothal Imperial Armory Complex. During the course of that mission, Marida lost her husband.\nMarida Sumar was a female human who lived during the Age of the Empire. In 4 BBY, she and her husband Morad Sumar owned a farm near the city of Kothal. Her husband made a living by selling jogan fruits at a stall in the Kothal market. That year, the Imperial Supply Master Yogar Lyste wanted to buy their farm but Morad refused to sell their livelihood to the Empire. Unwilling to let the matter rest, Lyste visited the farm with three Imperial Troop Transports and several stormtroopers. After razing the farm, Lyste loaded Marida, her husband, and their Aqualish helper onto the side compartments of a Troop Transport.\nWhile traveling through the grassy plains of Lothal, the Sumars and their Imperial captors encountered a TIE fighter that had been commandeered by Ezra Bridger and Garazeb Orrelios, the former a friend of Marida's husband. While the Imperials exchanged fire with the rebel TIE fighter, Ezra managed to board the middle transport. Using the Force, he freed Marida, her husband, and their Aqualish servant from their restraints. Marida, Morad, and their servant then managed to flee into the plains while Ezra and Zeb engaged the Imperials and escaped with a crate of meiloorun fruit.\nBy 2 BBY, Marida and her husband Morad had joined a rebel cell headed by Ryder Azadi, the former Governor of Lothal. Their cell specialized in sabotaging vehicles produced by the Imperial Armory Complex in Capital City. Her husband Sumar used his position as a factory worker to sabotage various vehicles including 614-AvA speeder bikes and AT-DP walkers, causing the Empire to lose many personnel and missions. She, Morad, and the Ithorian bartender Jho were present when Ezra, his master Kanan Jarrus, and the rebel astromech droid Chopper visited Ryder's stone circle encampment.\nWhen Marida and her comrades learned that Ezra and the Phoenix Cell were planning to take out the factory, they cheered. Since Ezra and his team planned to steal secret Imperial plans for a new secret weapon, her husband Morad agreed to help them infiltrate the factory using his position as a worker there. The following day, Morad and Ezra's team departed on their mission. However, Morad was killed when Grand Admiral Thrawn, who had been dispatched by Imperial High Command to investigate the high rate of faulty vehicles at the Lothal factory, forced him to test a faulty 614-AvA speeder bike.\nAfter losing contact with Ezra's team, Marida accompanied Ryder on a diversionary attack on the factory's east gate. Marida used her rocket launcher to damage an Imperial Troop Transport. In response, the Imperials sent two AT-AT walkers to engage them. Ezra's team managed to escape the factory in a stolen AT-DP walker but were attacked by the AT-ATs. Marida used her rocket launcher to hit the foreleg of the AT-AT walker that was crushing the rebels' AT-DP walker. She and Ryder were pleasantly surprised when Ezra, Kanan, and Chopper emerged from the hatch of the AT-AT. Marida bowed her head in sadness when Ezra informed her that her husband Sumar had not survived the mission. After returning to Ryder's base on their two landspeeders, the rebels discovered that Thrawn had been developed a prototype starfighter that was equipped with deflector shields.\nLater, Marida and Ryder were patronizing Old Jho's Pit Stop when they received a HoloNet transmission of the former Imperial Senator Mon Mothma's speech urging the galaxy to rise up in rebellion against the Empire.\nIn 1 BBY, Marida and Ryder survived an Imperial crackdown which claimed the life of Jho. After Ryder informed the Rebel Alliance about the new TIE/D Defender Elite, the Spectres smuggled themselves in Lothal with the help of the crimelord Cikatro Vizago. After the Spectres evaded Imperial forces through Lothal's sewers, Marida and Ryder ferried them to safety in their U-wing.\nMarida Sumar was a human woman with blue eyes and copper skin. She wore a white scarf around her head over a brown and white top. After joining Ryder's rebel cell, Marida learned how to fire a rocket launcher. She was visibly saddened after learning that her husband Morad did not survive an undercover mission at the Lothal Imperial factory.\nMarida Sumar first appeared as a minor background character in the Star Wars Rebels Season One episode \"Fighter Flight,\" which premiered on WatchDisneyXD.com on October 13, 2014. She returned to the series in Star Wars Rebels Season Three Episode 9, which was titled \"An Inside Man.\" In the episode, she received speaking lines for the first time. These lines were performed by Vanessa Marshall, who also voices Hera Syndulla on the series. Despite the character's name already being established, Sumar is identified only as \"Female Citizen\" in the episode's end credits.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lothal",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Lothal_resistance_group",
  "/wiki/4_BBY",
  "/wiki/Marriage",
  "/wiki/Morad_Sumar",
  "/wiki/Morad_Sumar%27s_farm",
  "/wiki/Galactic_Empire",
  "/wiki/Attack_on_Imperial_Troop_Transports",
  "/wiki/Ezra_Bridger",
  "/wiki/Garazeb_Orrelios",
  "/wiki/2_BBY",
  "/wiki/Governor",
  "/wiki/Ryder_Azadi",
  "/wiki/Infiltration_of_the_Imperial_Armory_Complex",
  "/wiki/Imperial_Armory_Complex",
  "/wiki/Imperial_Era",
  "/wiki/City",
  "/wiki/Kothal",
  "/wiki/Jogan_fruit",
  "/wiki/Kothal_market",
  "/wiki/Supply_Master",
  "/wiki/Yogar_Lyste",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Stormtrooper",
  "/wiki/Aqualish",
  "/wiki/Rebels_TIE_fighter",
  "/wiki/The_Force",
  "/wiki/Meiloorun_fruit",
  "/wiki/Capital_City",
  "/wiki/614-AvA_speeder_bike",
  "/wiki/All_Terrain_Defense_Pod",
  "/wiki/Ithorian",
  "/wiki/Jho",
  "/wiki/Kanan_Jarrus",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Stone_circle",
  "/wiki/Phoenix_Cell",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Imperial_High_Command",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Landspeeder",
  "/wiki/Starfighter",
  "/wiki/Deflector_shield",
  "/wiki/Old_Jho%27s_Pit_Stop",
  "/wiki/HoloNet",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/1_BBY",
  "/wiki/Raid_on_a_suspected_rebel_cell",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/Cikatro_Vizago",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Eye",
  "/wiki/Scarf",
  "/wiki/Clothing",
  "/wiki/Star_Wars_Rebels_Season_One",
  "/wiki/Fighter_Flight",
  "/wiki/October_13",
  "/wiki/2014",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/An_Inside_Man",
  "/wiki/Vanessa_Marshall",
  "/wiki/Hera_Syndulla",
  "/wiki/Star_Wars_Rebels",
  "/wiki/TIE_Fighter_Trouble",
  "/wiki/Star_Wars_Rebels:_Recon_Missions",
  "/wiki/Secret_Cargo",
  "/wiki/The_Occupation",
  "/wiki/Star_Wars_Rebels:_Head_to_Head",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Databank_A-Z"
 ]
}