{
 "name": "Maris_Ferasi",
 "display_name": "Maris Ferasi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Maris Ferasi was a female Human from Corellia. In 27 BBY Ferasi acted as a co-pilot on smuggling vessel Bargain Hunter, which was captained by Ferasi's boyfriend Dubrak Qennto. Along with their third crewmember, Jorj Car'das, Ferasi and Qennto were captured by Commander Mitth'raw'nuruodo of the Chiss Expansionary Defense Force when their hyperdrive malfunctioned during a smuggling run and they got lost in the Unknown Regions. During their captivity, which lasted for about three months, Ferasi and Car'das became friends with the commander, and Ferasi even saved Thrawn's life and had a crush on him. When the Chiss commander had studied his guest/prisoners enough, he allowed them to return to the Galactic Republic. Together with Qennto, Ferasi returned home on the Bargain Hunter while Car'das chose to accept an offer from Kinman Doriana—another Human who had been captured by Thrawn—to travel with him.\nMaris Ferasi was born on Corellia during the last decades of Galactic Republic. She was idealistic and believed the galactic government to be corrupted. To protest against the corruption, Ferasi hooked up with small-time smuggler Dubrak Qennto, a fellow Corellian. During her time on board Qennto's ship Bargain Hunter, Ferasi became accustomed to Qennto's temperament. Around 27 BBY Ferasi and Qennto were joined by third member of the crew, Jorj Car'das, who acted as a navigator.\nWhen the group was transporting furs and hidden firegems to a Hutt gangster named Drixo, Progga—Drixo's rival—ambushed the Bargain Hunter. To escape the Hutt, the smuggling group made a risky jump into hyperspace, but their hyperdrive engine was damaged, stranding them far into the Unknown Regions of the galaxy. Progga had followed their jump and moved to attack them again, but instead both ships fell under attack from a local patrol. Bargain Hunter was captured in a shock net, which disabled the ship's electronic systems, while Progga's ship was destroyed. The leader of the patrol, Commander Mitth'raw'nuruodo of the Chiss Expansionary Defense Force, captured Ferasi and her two companions, taking them and their ship to his base in Crustai system.\nDuring her stay at the base, Ferasi became fascinated by the Chiss commander, which caused friction between her and Qennto. Together with Car'das, Ferasi attended language lessons with Thrawn—the two Humans teaching basic to the commander, who taught them Chiss language Cheunh and local trade-language Minnisiat, in return.\nMaris asked to accompany Thrawn and Car'das when they went to investigate the Vagaari attack. Thrawn decided to accommodate her, and she and Car'das accompanied him on the Springhawk. Maris supported Thrawn even when he attempted capture of one of the Vagaari's Gravity-well projectors; a dangerous task. At one point during the battle Thrawn called for a close-up on the hull of one of the opposing warships and discovered that in each of the Zero-g plastic bubbles a slave was held. When Maris saw this, she ordered Thrawn to find a way to destroy the warships without hurting the slaves, and then got mad at him when he said he could not. She soon forgot about it, however, when there appeared a sudden flash of light and subsequent disintegration of part of the canopy. When the dust cleared, she saw Thrawn laying on the floor, wounded, with a tear in his Vacc suit. She and Car'das rushed to him and tried to fix the rip with a Sealant patch, but it would not stick to the material. Maris went chest-to-chest with Thrawn to stop the air from leaking out of his suit with her hands clasped behind his back. She stayed this way until two Chiss came with a bigger patch and transported him to a medical room. One of them declared that she had saved Thrawn's life, and Thrawn himself expressed his gratitude to her when he was better.\nWhen they returned to base, they discovered Qennto's aggressive behavior had gotten him thrown in the brig. She convinced them to release him, but Qennto knew about Maris' 'esteem' for Thrawn and became so hostile that both he and Maris were assigned escorts whenever they tried to leave their room.\nWhen Maris and Dubrak Qennto returned to Republic space after the destruction of Outbound Flight, they managed to pay back their debt to Drixo and continue their smuggling activities. Ferasi, along with Jorj Car'das, would later be known to the Chiss as The Visitors due to their teaching Basic to the Chiss while they were guests/captives of Commander Thrawn.\nMaris Ferasi first appeared in the 2006 novel Outbound Flight by Timothy Zahn. It is unknown what happened to her after that, but at one point Zahn had planned to let her join the Rebellion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Maris_(disambiguation)",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Jorj_Car%27das",
  "/wiki/27_BBY/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Bargain_Hunter",
  "/wiki/Dubrak_Qennto",
  "/wiki/Commander/Legends",
  "/wiki/Chiss_Expansionary_Defense_Force",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Kinman_Doriana",
  "/wiki/Starship/Legends",
  "/wiki/Navigator/Legends",
  "/wiki/Firegem",
  "/wiki/Hutt/Legends",
  "/wiki/Drixo",
  "/wiki/Progga",
  "/wiki/Hyperspace/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Picket_Force_Two/Legends",
  "/wiki/Conner_net",
  "/wiki/Crustai_base",
  "/wiki/Crustai_system",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Cheunh/Legends",
  "/wiki/Minnisiat/Legends",
  "/wiki/Battle_of_the_Geroon_homeworld",
  "/wiki/Springhawk/Legends",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Hull/Legends",
  "/wiki/Vagaari_warship",
  "/wiki/Zero-g_plastic_bubble",
  "/wiki/Enviro-suit",
  "/wiki/Sealant_patch",
  "/wiki/Outbound_Flight",
  "/wiki/The_Visitors",
  "/wiki/2006",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Mist_Encounter",
  "/wiki/Star_Wars_Adventure_Journal_7",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/June_7",
  "/wiki/2016",
  "/wiki/May_17",
  "/wiki/2022"
 ]
}