{
 "name": "Marja Lang",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Moff Sarne's forces"
     ]
    }
   ]
  }
 ],
 "content": "Marja Lang was a Human female who served as the Imperial Vice-Governor of the planet Gandle Ott in the Kathol sector of the Outer Rim Territories. A staunchly loyal Imperial, she was more dedicated to the ideals of the Empire than Moff Kentor Sarne, the sector's ruler. When Sarne withdrew the sector from the Empire in the wake of the Battle of Endor and established himself as a warlord, Lang's devotion to the Empire ensured that she was frozen out of the personality cult that Sarne developed among his forces that engendered loyalty to him over the Empire. In 8 ABY, Sarne was disposed from his capital on Kal'Shebbol by the New Republic. He retreated to Gandle Ott with his fleet, stripping the system of its defense force and governor before departing.\nWith the planet in confusion after Sarne's departure, Lang found herself the highest ranking Imperial on the planet and moved to secure a power base with her fellow abandoned Imperials with the hopes that she would ascend to the post of governor. However, her position was challenged by General Herron Dade, the native commander of the planetary militia. Several days after the Moff's departure, the New Republic CR90 corvette FarStar entered orbit in pursuit of Sarne. A delegation from the corvette spent several days on the planet establishing diplomatic ties, and although Lang was not especially welcoming of their presence, she understood the need to treat them pleasantly.\nMarja Lang was a Human female Imperial bureaucrat who was stationed on the planet Gandle Ott in the Kathol sector as the Vice-Governor. A capable administrator, Lang was loyally devoted to the Imperial philosophy. However, when the ruler of the Kathol sector, Moff Kentor Sarne, quietly withdrew his holdings from the Empire in the wake of the Battle of Endor and established himself as a warlord, he began to cultivate a personality cult within his forces, engendering total loyalty to himself. Due to Lang's fervent loyalty to the Empire proper, she was excluded from the clique.\nIn 8 ABY, New Republic forces deposed Sarne and liberated his capital, Kal'Shebbol. Sarne fled with the majority of his forces, stopping at Gandle Ott to take on supplies. The Moff claimed to have assembled a large fleet to deal with pirates and Rebels throughout the sector, and he made no mention of his recent defeat. Upon his departure, Gandle Ott's citizens discovered that Sarne had left with the majority of Imperial personnel stationed on the planet—including the planetary governor—and the local defense force. With the Governor gone, Lang became the highest-ranking Imperial official on the planet and took on the title of Acting-Governor.\nWith much of the Imperial command structure removed, Gandle Ott fell into confusion. The Bank parliament, the civilian government that had ruled the planet prior to the institution of Imperial authority, began to retake power. General Herron Dade, commander of the planetary militia and highest-ranking native-born official, started to position himself to make a run for the long-abolished presidency. When NewsNet courier droids reached Gandle Ott bearing reports that the New Republic had ousted Sarne from Kal'Shebbol, Lang began to consolidate her own power base among the remaining Imperial forces and sent subspace messages to the Empire requesting reinforcements. Lang hoped that she would officially be named as governor of Gandle Ott. The civilian authorities, fearful that the New Republic would turn its attention on Gandle Ott, made it known that they would be interested in negotiations with the galactic power.\nSeveral days after Sarne's departure, the New Republic CR90 corvette FarStar arrived in Gandle Ott's orbit in pursuit of the Moff. The vessel was permitted to land at Montrol Spaceport, and Lang—along with Stanfeld Duffit, Mayor of Montrol City; several politicians; and an honor guard—headed to the spaceport to formally greet the New Republic representatives. Upon arrival, Lang discovered that the spaceport's security force was intent on arresting the FarStar crew for piracy. A standard check of the ship's registration and Bureau of Ships and Services permits listed the FarStar as stolen Imperial property. Unknown to Lang, Montrol City's BRT supercomputer, CUTH-BRT-92-X3, had been corrupted by Sarne with instructions to delay any New Republic pursuit. To that end, CUTH-BRT-92-X3 altered the records to flag the FarStar as stolen. Lang resolved the issue promptly, and formally welcomed the FarStar delegation, led by the ship's commanding officer, Captain Kaiya Adrimetrum, to Gandle Ott. She then invited the senior staff to accompany her to the Imperial Plaza Hotel, where they would stay for the duration of their visit at the government's expense. Before leaving the delegation at the hotel, Lang invited them to join her for an informal breakfast with her and the Imperial Cabinet.\nAmong the FarStar delegation that Lang met was Jessa Dajus, a former Imperial Intelligence agent who had served in Sarne's forces. Dajus had fallen out of the Moff's favor and had been discovered by New Republic forces in his detention cells, where she claimed to be a shuttle pilot. When the FarStar mission was authorized, Dajus was allowed to join the crew as a tactical advisor. Lang had met Dajus before, when she was serving with Sarne, but did not reveal that fact in public. Lang planned to get Dajus alone and determine whether or not she was truly sympathetic to the New Republic or if she was playing her own game.\nOn the second day of the FarStar's visit, the delegation accepted Lang's offer and joined her and the Cabinet for breakfast. Several hours later, Lang joined General Dade at the Ceremonial Mushroom Cutting, where he symbolically declared that Gandle Ott had renounced its ties to the Empire and should look to controlling its own future. Dade was the center of attention for the gathered media, and Lang was barely able to conceal her boredom during the ceremony. On the third day, Lang hosted a private lunch for the FarStar delegation and her key supporters. After several days on the planet, during which diplomatic relations were established between Gandle Ott and the New Republic, the FarStar departed to continue its mission.\nMarja Lang was a short, pudgy woman with blonde hair that she wore in a long braid down her back. Generally even-tempered, Lang could be charming or threatening when the need arose. Although she did not like dealing with the New Republic, she saw that treating them as equals was wise, and was polite and civil to the delegation. A lifelong bureaucrat, Lang was well-versed in the workings of the Imperial government, and she was knowledgeable about businesses and other cultures. She could operate communications and security equipment, and wore an Imperial uniform on duty. She carried a datapad and personal comlink.\nMarja Lang was introduced in Death Is Remotely Possible, a roleplaying adventure published in The DarkStryder Campaign by West End Games in 1995. During the course of the adventure, the players have to deal with CUTH-BRT-92-X3's attempts to delay the FarStar from pursuing Sarne, which manifests itself in several ways, including near fatal traffic accidents and an assassin droid being unleashed on them. Lang, along with Dade, is one of the officials to whom the players can report these occurrences, along with the suspicion that CUTH-BRT-92-X3 is responsible. Lang takes the information seriously and will look into the matter and discover the protocol modifications made to the unit by Moff Sarne. CUTH-BRT-92-X3 is taken offline and technicians are employed to restore the droid to normal. As the players can talk to either Lang or Dade, this article makes no assumption as to which official receives the reports.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Lang_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Moff_Sarne%27s_forces",
  "/wiki/Lieutenant_governor",
  "/wiki/Planet/Legends",
  "/wiki/Gandle_Ott",
  "/wiki/Kathol_sector",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Sector/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/Capital/Legends",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Ott_system",
  "/wiki/Gandle_Ott_system_defense_force",
  "/wiki/Unidentified_Imperial_Governor_(Gandle_Ott)",
  "/wiki/Military_rank/Legends",
  "/wiki/Governor/Legends",
  "/wiki/General/Legends",
  "/wiki/Herron_Dade",
  "/wiki/Commander/Legends",
  "/wiki/Gandle_Ott_planetary_militia",
  "/wiki/Standard_day/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/FarStar",
  "/wiki/Orbit/Legends",
  "/wiki/DarkStryder_Campaign",
  "/wiki/Corvette/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Administrator/Legends",
  "/wiki/New_Republic_task_force_(Kal%27Shebbol)",
  "/wiki/Pirate/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Bank_parliament",
  "/wiki/Reproduction/Legends",
  "/wiki/President/Legends",
  "/wiki/NewsNet",
  "/wiki/Courier_droid",
  "/wiki/Subspace",
  "/wiki/The_galaxy/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Montrol_Spaceport",
  "/wiki/Stanfeld_Duffit",
  "/wiki/Mayor/Legends",
  "/wiki/Montrol_City",
  "/wiki/Politics/Legends",
  "/wiki/Honor_guard",
  "/wiki/Spaceport/Legends",
  "/wiki/Bureau_of_Ships_and_Services/Legends",
  "/wiki/City/Legends",
  "/wiki/BRT_supercomputer",
  "/wiki/CUTH-BRT-92-X3",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Kaiya_Adrimetrum",
  "/wiki/Imperial_Plaza_Hotel",
  "/wiki/Hotel/Legends",
  "/wiki/Imperial_Cabinet",
  "/wiki/Jessa_Dajus",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Detention_area",
  "/wiki/Shuttle/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Ceremonial_Mushroom_Cutting",
  "/wiki/Media/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Death_Is_Remotely_Possible",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/West_End_Games",
  "/wiki/1995",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Droid/Legends",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/The_DarkStryder_Campaign,_Deluxe"
 ]
}