{
 "name": "Markus_Andarius_Thul",
 "display_name": "Markus Andarius Thul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Thul",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Markus Andarius Thul was a Human male member House of Thul who lived during the Cold War and the Alderaan Civil War.\nBefore the Alderaan Civil War, Markus Thul was a loyal and powerful member of House of Thul. Before his family's return to the planet Alderaan, Markus welcomed the Sith Empire's support and was confident his family would conquer the throne of his homeworld.\nAfter years of conflict, Markus began to distrust the Empire's alliance and feared House Thul was losing its way, by catering to every of the Imperials' orders.\nIn 3643 BBY, Markus led a group of Imperial commandos to sneak inside Castle Organa. However, his plan was a failure until he was captured by Captain Balic Cormac from House Organa. Markus was placed inside a cell and interrogated.\nHe was later visited by Havoc Squad's new lieutenant who was sent to find Gearbox. Markus knew about Gearbox's location, but he begged the lieutenant to protect and rescue his wife Altana and daughter, who were betrayed by the Empire, and promised to explain the truth. The lieutenant agreed to rescue his family from harm. The lieutenant was able to get inside House Thul and rescue Markus' wife and daughter. They were taken safely to House Organa where they were reunited with Markus. Markus thanked the Havoc lieutenant for everything and provided the information about Gearbox and his location. After the lieutenant gave permission to free them, Markus promised that he and his family would be in debt for the Havoc lieutenant. He and his family then departed Alderaan for Chandrila.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_of_Thul",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Alderaan_Civil_War",
  "/wiki/Planet/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/Captain/Legends",
  "/wiki/Balic_Cormac",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Havoc_Squad",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Bex_Kolos",
  "/wiki/Lieutenant/Legends",
  "/wiki/Altana_Thul",
  "/wiki/Valyn_Thul",
  "/wiki/Chandrila/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}