{
 "name": "Markko",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Markko was a male Human who posed as Imperial Counselor Raines, a member of Egron's staff on Chibias, shortly after the Battle of Endor. In reality, he was an Alliance Intelligence agent.\nMara Jade learned that Markko had been hired by Egron to slice open a datacore in order to sell information to the Rebel Alliance. However, Markko was unable to fully slice his way past the core's encryption, and called on Ghent to help in cracking the remainder. However, Markko's dealings with the Empire were actually a cover, for he was an agent of the Alliance, sent to ensure that the datacore—which was in reality the control node of a Star Destroyer—would end up in their hands.\nHowever, he was unprepared for the unexpected arrival of Mara Jade, though he managed to avoid being killed during the escape. He later cornered Mara and Ghent, accompanied by Governor Egron. Mara dispatched Egron, shooting him in the chest, and Markko took Ghent hostage. Mara, however, decided that her work was done—she had only come to eliminated an Imperial traitor, not go on a killing spree. Mara allowed Markko to go free, as long as he freed the captured Ghent. Markko agreed, and Mara let him go so that he could return to the Alliance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Marko_Tyne",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Raines",
  "/wiki/Egron",
  "/wiki/Chibias",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Zakarisz_Ghent",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Handoff",
  "/wiki/Star_Wars_Gamer_10",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}