{
 "name": "Marka_Ragnos",
 "display_name": "Marka Ragnos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Prior to 5100 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5000 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith-Human hybrid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Obsidian"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Disciples of Ragnos"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tavion Axmis"
     ]
    }
   ]
  }
 ],
 "content": "Marka Ragnos was a male half-breed Dark Lord of the Sith who lived during the time of the first Sith Empire, born long before 5100 BBY, and, around that same year, dueled Sith Lord Simus for the title of Dark Lord of the Sith and control of the Sith Empire. Ragnos defeated Simus, who was beheaded in the battle with the other aspiring Dark Lord. Ragnos lived for over a hundred years, growing in power, pitting his adversaries against each other and ensuring that there were no threats to his throne.\nFollowing his death shortly before the Great Hyperspace War, two powerful Sith Lords, Naga Sadow and Ludo Kressh, fought each other to occupy his throne; Ragnos' spirit appeared before them and proclaimed that only the most worthy should succeed him.\nRagnos lived on as a Force ghost after his death, trapped within the confines of his tomb in the Valley of the Dark Lords on Korriban. A thousand years after the Dark Lord's death, Exar Kun summoned Ragnos from his grave through the use of talismans. Ragnos crowned Exar Kun as the new Dark Lord, with Ulic Qel-Droma as Kun's apprentice, as an attempt to resurrect the lost empire thousands of years prior.\nThousands of years after the Sith Empire, during the New Republic era, the Dark Jedi Tavion Axmis made an attempt to bring Marka Ragnos back from the depths from the Force, using an old Sith artifact, known as the Scepter of Ragnos in order to siphon the Force from many Force Nexuses all spread across the galaxy, empowering the Disciples of Ragnos. Tavion's goal to resurrect Ragnos almost succeeded, but her operation was overthrown by the Jedi Jaden Korr, defeating Ragnos' spirit, and enclosing him in his tomb once again, where he was dragged back in the depths of the Force.\nA Sith-Human hybrid, Marka Ragnos was a direct descendant from a Dark Jedi who had fled the Republic after the Hundred-Year Darkness, who lived 20,000 years after the formation of the Old Republic. Feared, obeyed, and admired among the Sith, Ragnos was considered to have been the greatest Dark Lord of the Sith of his age, and was born a long time before 5100 BBY. When the Dark Lord of the Sith died, Ragnos and another powerful Sith, Simus, rose up to take the mantle. A formidable warrior, Ragnos dueled and defeated Simus in combat circa 5100 BBY, proving himself worthy of the mantle of Dark Lord of the Sith.\nAfter gaining the mantle of a Dark Lord, he led ruthless campaigns against his Sith enemies, pitting his adversaries against each other and ensuring that there were no threats to his throne. His iron-fisted rule would last over a century.\nDuring those times Ragnos likely composed his own epistle, created a Scepter capable of siphoning the Force from many different places, which could be used to empower non-Force users, and designed a pair of gauntlets capable of augmenting the strength of the Force in its user.\nYears later, Ragnos, as Dark Lord of the Sith and the ruler of the Sith Council and Sith Empire, was petitioned by a thirteen-year old boy named Tenebrae. The youth had come before Marka Ragnos to ask for training in the Sith arts and for recognition as the ruler of his father's domain, the planet Medriaas. Although he declined to take him as an apprentice, Lord Ragnos was impressed by Tenebrae's power and ambition, and named him the ruler of Medriaas, bestowing on him the rank of Sith Lord and the name Vitiate.\nAfter years of his rule, Marka Ragnos passed away in year 5000 BBY. His death was marked as the end of a golden age of the Sith Empire, despite its reluctance to continue expansion.\nRagnos' legacy lived after his death. The Ragnos Lakes, on Kesh, for instance, were named after him. During his funeral on Korriban, two Sith Lords, Sadow and Kressh emerged as favorites to succeed Ragnos as the next Dark Lord of the Sith and the two engaged in a duel of Sith swords, after a disagreement as to who would better serve the Empire as Dark Lord. Ragnos' spirit appeared before them speaking of a great past and an uncertain future for the Sith Empire, proclaiming that only the most worthy would succeed him. After the duel, Naga Sadow was elected as the new Dark Lord of the Sith.\nAfter the inconvenient arrival of Gav and Jori Daragon, Sadow had an excuse to invade the Republic, claiming that those Galactic Explorers would try to bring Republic reinforcements in an effort to invade the Sith Empire soon enough.\nVitiate did not join in the struggle for succession after Ragnos' death, nor was he involved in the conflict between Naga Sadow and Ludo Kressh, or the Great Hyperspace War. Instead, he decided to stay hidden, until the right time arrived.\nAfter Naga Sadow's election as the new Dark Lord of the Sith, further events led to a major war with the Galactic Republic. Ultimately, because the schism was never healed it spelled the end of their interstellar empire. Ragnos lived long after his death as a Force ghost, trapped within the confines of his own tomb in the Valley of the Dark Lords on Korriban.\nAbout one millennium after his death, during the year 3996 BBY, Ragnos's spirit was unintentionally summoned from the grave by Exar Kun and Ulic Qel-Droma with the help of a pair of Sith talismans. Awakened once again, he crowned Exar Kun as the new Dark Lord of the Sith, and proclaimed Ulic Qel-Droma to be the first Kun's apprentice, all in an attempt to restore the lost empire of a thousand years prior. The Great Sith War devastated the galaxy once again, but the Sith Empire was not restored.\nAt some point prior to 3963 BBY, Celeste Morne destroyed the last known copy of Ragnos' epistle.\nA thousand years after his physical death, during the Jedi Civil War, Revan and his companions visited the tomb of Marka Ragnos, during their search for the Star Forge. Revan had to enter the tomb and retrieve an old Sith artifact in order to impress Uthar Wynn so that Wynn would grant him access to Naga Sadow's tomb where a Star Map was located. Revan had to make his way into the Ragnos' tomb, which was protected by a rogue assassin droid.\nAfter battling the droid forces inside the tomb, Revan and his companions encountered the assassin droid. After conversing with the droid, he said that he was originally programmed to kill Jedi, but his Sith programmers made his cognitive systems more independent than they desired. Since then, the droid kept himself in isolation within the confines of Ragnos' tomb, building droids to aid in his protection. After that, the droid asked Revan for assistance in changing his programming, because, although the droid had developed the desire to not to kill, his programming was often at odds with his desires. Then, the droid offered Revan assistance to help him change his programming. After the reprogramming of the droid was successful, he offered Revan several of his redundant systems, so he could use them on other droids, and then the droid stated that he could escape from the planet, wishing well to Revan. Before exiting the tomb, Revan also found a pair of gauntlets that once belonged to Marka Ragnos. After that, Revan went out of the tomb, to gain prestige with Uthar Wynn.\nA few decades after his death, Vitiate reconstituted the Sith Empire once again. Vitiate ignited a new war against the Galactic Republic 1,319 years after Ragnos's death.\nBy the time of the Galactic War, the ghost of Ragnos roamed the cave known as Architect's Hollow, on the fourth moon of Yavin Prime.\nAt some point in his life, Darth Plagueis traveled to the Valley of the Dark Lords in Korriban. While there, he found no evidence that the spirits of Korriban were real, believing that those were mere diversions created for the credulous, but as Plagueis boarded his ship, he beheld a vision of Marka Ragnos. The apparition challenged Plagueis' claim to the Sith title, and railed against his plan to dismantle the traditions of Korriban. The vision however did not answer Plagueis' questions and inquiries. Instead, Ragnos snarled and disappeared in a whirl of smoke. After the experience, Plagueis wrote that it was possible that the entire episode, simply played out in his mind. Those texts were later acquired by Darth Sidious, Plagueis' former apprentice, and were included in a book he called, \"Book of Sith.\"\nThousands of years after his actual death, during the New Republic era in 14 ABY, Ragnos' spirit was intended to be resurrected from beyond the grave, this time summoned by a Sith cult known as the Disciples of Ragnos whose leader was Tavion Axmis, Desann's student.\nWith the help of an ancient scepter; once used by Ragnos to drain residual Force energy, Tavion and her apprentice siphoned the Force from many Force Nexuses all spread around the galaxy and used it to empower their followers. Tavion plotted to use the collected energy to resurrect Ragnos. After a hard campaign tracking the Disciples of Ragnos across the galaxy, the New Jedi Order managed to track Tavion on Korriban.\nJedi Luke Skywalker and Kyle Katarn were in charge of the campaign on Korriban, dispatching every available Jedi from the temple on Yavin 4, among them, the Jedi Jaden Korr, who participated on almost every mission against the Disciples of Ragnos.\nDuring the Battle of Korriban, Jaden Korr managed to enter Ragnos' tomb, intending to stop Axmis. He was nearly too late, as she managed to resurrect Ragnos by allowing his spirit to possess her body, but Ragnos himself was nevertheless defeated by Korr. Ragnos' ghost was forced back into his sarcophagus, screaming out a dark promise that he would return.\nMarka Ragnos was a respected, feared and obeyed Dark Lord of the Sith, considered wise and powerful. In order to ensure his seat as a Dark Lord of the Sith, Ragnos conducted ruthless campaigns against his Sith enemies, marking the beginning of a Golden Age for the Sith. After his death, Naga Sadow and Ludo Kressh fought to decide who would succeed him, and Ragnos' Force ghost made himself present before them, claiming that only the most worthy would be his successor.\nRagnos' importance among the Sith was so high, that he was summoned back from death twice, first by Exar Kun and Ulic Qel-Droma with the help of talismans. Ragnos chose Exar Kun over Ulic, crowning him as the next Dark Lord, while he assigned Qel-Droma as his apprentice.\nLater, thousands of years after his death, during the New Republic era, Dark Jedi Tavion Axmis believed that if she resurrected Marka Ragnos, she would be able to bring back a new Golden Age for the Sith. When he was defeated by the Jedi Jaden Korr, he angrily exclaimed that he would return.\nMarka Ragnos was powerful, both physically and in the use of the Force, and was considered to be among the most powerful Sith and Force-users in Sith and Jedi history, leading the Sith Empire to a Golden Age of their existence, conducting brutal and ruthless campaigns against his Sith enemies. Ragnos had such knowledge about the Force, that even during his funeral, he was able to show himself to Naga Sadow and Ludo Kressh as a spirit, orchestrating their duel, thus deciding the future fate of the Sith Empire. He also knew how to keep the essence of his body alive, 5000 years after his death, and was proficient in the use of Sith magic.\nRagnos' connection with the Force was strong enough to possess Tavion Axmis in order to fight against Jaden Korr.\nRagnos didn't always wield a lightsaber, the common weapon of the Sith Lords and the Jedi Knights, instead, he mostly wielded a Sith sword, consisting of a metal blade enhanced by Sith sorcery, a weapon of the primitive Sith race, which he could hide inside his scepter. It is possible only he knew of the sword's hiding place, as Tavion Axmis did not draw it until she was possessed by Ragnos.\nHis skills with his customized Sith sword were remarkable in his duel against Jaden Korr inside of his own tomb, as he could skillfully deflect the attacks Korr provided against him, and at the same time, he could unleash the power of the Sith magic with which his sword was imbued.\nRagnos also owned a pair of dark gauntlets which increased his skill with a melee weapon or a lightsaber.\nAccording to Lokar, he could also focus the dark side to make himself nearly unwoundable in battle.\nMarka Ragnos had a mystical Scepter, which had the ability to siphon and store dark side energy, and it could also release the power of the Force on ordinary beings to make them Force-sensitive.\nHe also made a pair of gauntlets which he used to increase his affinity with the Dark side of the Force.\nAfter his death, during the Jedi Civil War when Revan searched for the Star Maps, he retrieved the gauntlets that once belonged to Ragnos inside of his tomb.\nMarka Ragnos' first appearance was in the Star Wars comic Tales of the Jedi – Dark Lords of the Sith 6, written by Tom Veitch and Kevin J. Anderson. It was published in March 14, 1995, placed in 3996 BBY, 1004 years after his actual death, making his first appearance as a Force ghost summoned by Exar Kun and Ulic Qel-Droma.\nWhile a figure of importance in Sith history, Marka Ragnos has actually never appeared in a story in which he was alive, much like another influential Sith Lord, Freedon Nadd.\nIn addition to his appearances in comics, Ragnos has also appeared in the Star Wars games, Star Wars: Knights of the Old Republic as a mummified corpse and in Star Wars: Jedi Knight: Jedi Academy, voiced by Peter Lurie. In the latter game, Ragnos has a leading role, as the game centers around him.\nMarka Ragnos' name was misspelled as \"Marko Ragnos\" in the Xbox version of Star Wars: Knights of the Old Republic. During the same game, when Revan travels to Korriban, the player has the choice to enter Marka Ragnos's tomb and to either aid or destroy the rogue droid inside of Ragnos' tomb. Also, in the same level, the player has the option to either search for the a pair of gauntlets that once belonged to Ragnos, in order to amplify the player's affinity with the dark side of the Force during gameplay.\nDuring the creation of Ragnos' funeral as part of the Tales of the Jedi project, Dario Carrasco, Jr. initially had some problems with Lucasfilm regarding with his concepts of Ragnos' coffin, because his designs resembled too closely an Egyptian sarcophagus; however, it was approved after he submitted a modified design.\nRagnos also received a brief entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Marka_(disambiguation)",
  "/wiki/5100_BBY",
  "/wiki/5000_BBY/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Disciples_of_Ragnos",
  "/wiki/Tavion_Axmis",
  "/wiki/Hybrid/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Simus",
  "/wiki/Sith/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Ludo_Kressh",
  "/wiki/Force_ghost",
  "/wiki/Tomb_of_Marka_Ragnos",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Korriban",
  "/wiki/3996_BBY",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/14_ABY/Legends",
  "/wiki/New_Republic_era",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Scepter_of_Ragnos",
  "/wiki/Jaden_Korr",
  "/wiki/Exiles",
  "/wiki/Hundred-Year_Darkness/Legends",
  "/wiki/Epistle_of_Marka_Ragnos",
  "/wiki/Marka_Ragnos%27_gauntlets",
  "/wiki/Tenebrae",
  "/wiki/Nathema",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Golden_Age_of_the_Sith",
  "/wiki/Ragnos_Lakes",
  "/wiki/Kesh",
  "/wiki/Funeral_of_Marka_Ragnos",
  "/wiki/Sith_sword",
  "/wiki/Gav_Daragon",
  "/wiki/Jori_Daragon",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/3693_BBY",
  "/wiki/Celeste_Morne",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Jedi_Civil_War",
  "/wiki/Revan/Legends",
  "/wiki/Skirmish_on_Korriban",
  "/wiki/Star_Forge",
  "/wiki/Uthar_Wynn",
  "/wiki/Mark_VII_experimental_prototype_assassin_droid",
  "/wiki/Jedi/Legends",
  "/wiki/Star_Map",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_War",
  "/wiki/Architect%27s_Hollow",
  "/wiki/Yavin_4/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Book_of_Sith",
  "/wiki/Kyle_Katarn",
  "/wiki/Desann",
  "/wiki/Alora_(Dark_Jedi)",
  "/wiki/The_Force/Legends",
  "/wiki/Sith_Cultist",
  "/wiki/New_Jedi_Order",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Battle_of_Korriban_(Disciples_of_Ragnos_crisis)",
  "/wiki/File:29mar002.ogg",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_-_Dark_Lords_of_the_Sith",
  "/wiki/Sith_magic",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Lokar",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dario_Carrasco,_Jr.",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(comic_series)",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_6",
  "/wiki/Tom_Veitch",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Freedon_Nadd",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy",
  "/wiki/Peter_Lurie",
  "/wiki/Xbox",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_2",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Category:Audio_files_of_Marka_Ragnos",
  "/wiki/Category:Images_of_Marka_Ragnos",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_3",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Fall_of_the_Sith_Empire_4",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Fall_of_the_Sith_Empire_5",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/Lost_Tribe_of_the_Sith:_Paragon",
  "/wiki/Knights_of_the_Old_Republic_25",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/The_Old_Republic:_Revan_(audiobook)",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Timeline_12:_The_Great_Hyperspace_War",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Star_Wars:_Empire_at_War",
  "/wiki/Crosscurrent",
  "/wiki/Riptide_(novel)",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_90",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/StarWars.com",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/The_Knight_Errant_Gazetteer",
  "/wiki/Databank_(original)",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Tulak_Hord",
  "/wiki/Kyp_Durron",
  "/wiki/Lumiya",
  "/wiki/Darth_Caedus",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Fall_of_the_Sith_Empire",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Wookieepedia:Interview/Dario_Carrasco,_Jr.",
  "/wiki/Tales_of_the_Jedi_2",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Legacy_of_the_Force:_Betrayal"
 ]
}