{
 "name": "Markre Medjev",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "\"Dark-complected\""
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "New Republic",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Markre Medjev was a male Human who served the Jedi Order as a Jedi Knight during the Yuuzhan Vong War. He later went on to obtain the rank of Jedi Master and Chief Librarian after the conclusion of the Second Galactic Civil War.\nA Force-sensitive, Markre Medjev entered into the fledgling Jedi Order during the time of the New Republic. Traveling to Yavin 4, the young Medjev was granted admittance into the Jedi Praxeum there where he began his Jedi training even as the Yuuzhan Vong began their campaign of terror across the galaxy. After his basic instruction in the ways of the Force were complete, Medjev was dispatched to Bothawui where he conducted intensive research on the alien invaders before reporting back to Jedi Master Luke Skywalker on his findings.\nSurviving the conflict which followed, Medjev participated in the final stages of the war. While on Dac during the fourth year of the war, Medjev met with eleven other Jedi in Master Tresina Lobi's quarters to discuss several issues. Before the meeting, Medjev worked with Tresina and Master Cilghal to prepare food for the Jedi. When the meeting began, Master Kenth Hamner informed everyone that Wraith Squadron member Baljos Arnjak was on Coruscant, and reported that The Prophet was on the planet, despite having previously left with Jedi Corran Horn and Tahiri Veila for the living planet of Zonama Sekot, where Master Skywalker and several other Jedi were. With communications to Zonama Sekot lost, and Master Cilghal and Jaina Solo believing it to have moved, the only way to learn what had happened would be to talk with the Prophet. Medjev suggested they ask General Wedge Antilles for help in infiltrating Coruscant, but Hamner told him he would not want to force Antilles to lie to his superiors, and the Jedi resolved to wait one week for word from Skywalker before sending a strike team to capture the Prophet.\nBefore the week deadline was up, Zonama Sekot appeared in orbit around Coruscant, and caused the Yuuzhan Vong to withdraw from their attack on Dac. Medjev and the other Jedi were later summoned to the living planet by Master Skywalker, and Medjev traveled with more than a dozen other Jedi aboard the Millennium Falcon to the planet. Medjev and the others met with Master Skywalker, who told them about the mysterious planet. Medjev then participated in a ceremony in which he bonded with two seed-partners, which were able to be molded into a living ship for him to pilot. Fighting against the invaders in defense of Sekot, Medjev and the Jedi were successful as the Yuuzhan Vong threat was nullified when their weapons and ships returned to their natural state amongst the bizarre environment of the planet. Gathering with the remaining Jedi on the planet, Medjev was present for the meeting that reunified the Order and solidified their placement within the newly created Galactic Alliance.\nAs of 44 ABY, Medjev had obtained the rank of Jedi Master and completed his training as a Jedi Lore Keeper. Appointed as Chief Librarian, Master Medjev oversaw and protected the Jedi Temple Archives on Coruscant. Medjev assisted Jedi Knight Natua Wan in her work in the Archives after she was assigned there following her recovery from the mysterious Force psychosis. When Grand Master Skywalker contacted the Temple and asked for Wan to assist him by researching Sith planets, Medjev informed the young Jedi Knight personally.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Chief_Librarian/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Jedi_training/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Dac",
  "/wiki/Tresina_Lobi",
  "/wiki/Cilghal",
  "/wiki/Kenth_Hamner",
  "/wiki/Wraith_Squadron",
  "/wiki/Baljos_Arnjak",
  "/wiki/Coruscant/Legends",
  "/wiki/Nom_Anor",
  "/wiki/Corran_Horn",
  "/wiki/Tahiri_Veila",
  "/wiki/Planet/Legends",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/General/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Defense_of_Mon_Calamari_(Yuuzhan_Vong_War)",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Seed-partner",
  "/wiki/Zonama_Sekotan_fighter",
  "/wiki/Conclave_on_Zonama_Sekot",
  "/wiki/44_ABY",
  "/wiki/Jedi_Lore_Keeper",
  "/wiki/New_Jedi_Temple",
  "/wiki/Temple_Archives",
  "/wiki/Natua_Wan",
  "/wiki/Force_psychosis",
  "/wiki/Grand_Master/Legends",
  "/wiki/Sith/Legends",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Tionne_Solusar"
 ]
}