{
 "name": "Marko_(Human)",
 "display_name": "Marko  (Human)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Thaereian military"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Marko was a male Human who served in the Thaereian military during the Clone Wars. Around 20 BBY, while on customs duty in the Cularin system, some Thaereian ships commanded by Marko inadvertently impeded the path of a Galactic Republic flotilla. As punishment, Marko was subsequently relieved of his duties.\nMarko was a male Human who served as an officer in the Thaereian military, the armed forces of the Thaereian system, during the time of the Clone Wars. Marko held the rank of lieutenant and was assigned to duty as a customers inspector in the Cularin system, a star system that the Thaereian military were chartered to defend. There, he commanded a Thaereian customs corvette and four Z-95 Headhunter starfighters and was tasked with inspecting starships leaving the system.\nAround 20 BBY, while Marko and his forces were on duty near to the Cularin comet cloud on the edge of the Cularin system, he detected an approaching vessel and ordered it to submit for inspection. The starship in question was piloted by the heroes of Cularin, group of freelance agents attached to the Galactic Republic flotilla Strike Force Cularin who were traveling ahead of the main body of the armada. The agents viewed Marko's instruction as an opportunity to embarrass the Thaereians by tricking Marko and his command into delaying the passage of the Republic strike force; to that end they deliberate dithered at transmitting to him their clearance codes revealing their connection to the oncoming flotilla.\nCommunicating with the freelancers via a hologram, Marko uttered threats to the operatives and ignored an attempt by a Thaereian ensign to interrupt his tirade. The Thaereian lieutenant's denunciation of the agents was cut short by the sudden arrival of the Republic armada. Finally receiving the agents' clearance codes, Marko was taken aback by the realisation that they were part of the Republic task force; he offered the operatives authority to proceed, then quickly ordered the Thaereian vessels to move out of the path of the Republic ships. The Thaereian officer Colonel Rast'tul, the second-in-command of the ground troops accompanying Strike Force Cularin, then contacted Marko to berate him for impeding the passage of the flotilla. Ignoring Marko's attempts to defend himself, Rast'tul relieved the lieutenant from his command, thereby ending Marko's career in the Thaereian military.\nMarko was scornful to the individuals that he subjected to customs inspections, believing himself to be their superior and speaking to them in a snide tone. He was keen to seize any opportunity to attack or confiscate the property of those whose vessels he scrutinized and he sought to find flaws with their permits and manifests. He also believed that he was familiar with all of the tricks that smugglers and pirates employed to evade customs checks.\nMarko was created by Ronald A. Heintz and appeared in Decision: Almas a 2004 Star Wars Legends roleplaying adventure that served as the first part of the Decisions trilogy of RPGA's Living Force campaign.\nIn Decision: Almas, the players roleplay as the freelance agents that Marko encounters in the Cularin system. If the player characters are operating a military starship then Marko demands an explanation for their use of the vessel and threatens to impound it. The players can opt to comply with Marko's order to submit for inspection, in which case the freelance agents transmit their clearance codes and Marko is momentarily alarmed by the realisation that he is holding up a vessel in the Republic fleet. He then gives the operative his approval to proceed and wishes them well on their mission before hastily telling the Thaereian ships to urgently move out of the path of the oncoming Republic flotilla.\nIt is alternatively possible for the players to be deliberately tardy in their compliance with Marko's instructions in order to cause him to hold up the Republic ships and thereby embarrass the Thaereians. If the agents are particularly obstructive, Marko considers simply having his ships fire on them and reporting the operatives as pirates. Marko is later rebuked by Colonel Rast'tul upon the arrival of the Republic armada for blocking the path of the Republic vessels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thaereian_military",
  "/wiki/Lieutenant/Legends",
  "/wiki/Marko",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Cularin_system",
  "/wiki/Thaereian",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Flotilla/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Army/Legends",
  "/wiki/Thaereian_system",
  "/wiki/Time/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Thaereian_Navy_charter",
  "/wiki/Corvette/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Cularin_comet_cloud",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Strike_Force_Cularin",
  "/wiki/Decision:_Almas",
  "/wiki/Canon",
  "/wiki/Hologram/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Rast%27tul",
  "/wiki/Smuggler/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Ronald_A._Heintz",
  "/wiki/2004",
  "/wiki/Roleplaying_game",
  "/wiki/Decisions_trilogy",
  "/wiki/RPGA",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Wizards.com",
  "/wiki/Over_Thaere",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Night%27s_Homecoming"
 ]
}