{
 "name": "Mark Hieks",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nightstrike Soldier Hegemony",
      "Corellian Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Mark Hieks was a Human male who lived on Talus during the Galactic Civil War. He was a mercenary and spy for the Nightstrike Soldier Hegemony, and later served as a member of the Corellian Security Force.\nEarly during the Galactic Civil War between the Galactic Empire and the Rebel Alliance, Mark Hieks was a member of the Nightstrike Soldier Hegemony, a mercenary organization affiliated with the Empire.\nAfter the Battle of Yavin, Mark Hieks was tasked by his superior Galiir Ac Yandar to infiltrate the headquarters of the Aggregate Civil Liberties Organization, a Talusian anti-Imperial organization that disturbed the N.S.H. operations.\nIn 1 ABY, Hieks successfully infiltrated the organization. His job was to plant electronic monitoring devices on four key computer systems. However, Mark had to injure himself to avoid suspicion, rendering him unable to complete the mission himself. Fortunately for him, Galiir sent a spacer working for Colonel Braedic Ekirk to assist him. The spacer met with Mark Hieks in the A.C.L.O medical bay, and was instructed to place monitoring devices on the A.C.L.O's medical computer, personal computer, operations computer, and equipment manifest computer. The spacer carefully carried out the task successfully, and then reported back to Mark. Mark was pleased, but he still had one final task for the spacer to complete. Rebel inspectors were arriving to inspect the local office of the A.C.L.O. The Rebellion was trying to determine whether or not the A.C.L.O should work with them on a more permanent basis. In order to disrupt the inspection, and impede on the A.C.L.O's progress with the Rebellion, Mark tasked the spacer with killing at least ten Rebel inspectors. Once again, the spacer succeeded in his task. Mark was happy with the spacer's skills and dedication to the Empire, yet told the spacer he would have to lay low. Following the completion of the tasks, the spacer returned to Braedic Ekirk, and Mark remained in the A.C.L.O office for a while longer.\nAt some point, Hieks became an agent in the employ of the Corellian Security Force. The Aqualish bounty hunter Ponda Baba formed a group of Aqualish thugs known as the Followers of Baba and raided a number of towns on Talus, but CorSec chose not to directly intervene, because they didn't want to make the situation worse, Instead, Hieks hired a spacer to capture Baba, and the individual was successful and handed over the thug to CorSec.\nMark Hieks appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Mark Hieks was added to the game as part of the \"Crisis of Allegiance\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006. In the game, players taking part in the so-called \"Legacy Quest\" may eventually find themselves in the employ of Mark Hieks. Players are tasked by Mark to plant devices on four A.C.L.O computers, and provided that they are Imperial, they may also accept an additional quest to kill ten Rebel inspectors.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nightstrike_Soldier_Hegemony",
  "/wiki/Corellian_Security_Force",
  "/wiki/Galiir_Ac_Yandar",
  "/wiki/Talus/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/A.C.L.O._office",
  "/wiki/Aggregate_Civil_Liberties_Organization",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Braedic_Ekirk",
  "/wiki/Agent/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Ponda_Baba/Legends",
  "/wiki/Followers_of_Baba",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_1",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}