{
 "name": "Marlo",
 "display_name": "Marlo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nal Hutta"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 997 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "Jekara system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.29 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan with mottled brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "Grand Hutt Council",
      "Grand Hutt Council",
      "Shadow Collective"
     ]
    }
   ]
  }
 ],
 "content": "Marlo was a male Hutt born around 997 BBY that sat on the Grand Hutt Council, the leading government of Hutta, during the Clone Wars, along with Jabba, Gorga, Arok, and Oruba. He was also a dealer in Zygerria's slave market.\nMarlo was born around the year 997 BBY and at one point was either personally acquainted with or knew of Lina Soh, who served as Supreme Chancellor of the Galactic Republic during the period known as the High Republic Era around 232 BBY.\nIn the year 21 BBY, Marlo was in the middle of eating when Jabba contacted him and the other members of the Grand Hutt Council, appeared as a hologram in Jabba's throne room. During the meeting, Marlo remained silent as Jabba and the council discussed the potential danger Ziro presented as the Hutt possessed information that was dangerous to the council. He agreed with Jabba and the other council members to have bounty hunter Cad Bane break Ziro out of Galactic Republic custody and deliver him to the council.\nMarlo was also present when Ziro was brought before the Hutt Grand Council on the planet Nal Hutta after being freed by Bane. When Ziro thanked for the council's help in his escape, Marlo addressed him in Huttese about the reason the council had gone through all the trouble of breaking him out of Republic custody. After Ziro had been taken away to the detention block, Marlo and the rest of the council were entertained by a performance of Da Hutt Moda by Pa'lowick singer Sy Snootles. During the performance, Marlo tried to attract Snootles' attention as the singer made her way towards him. When Snootles kissed council member Gorga, Marlo smiled and laughed. After Snootle's performance, Marlo was enjoying the entertainment of the Twi'lek dancers when Jedi Knights Obi-Wan Kenobi and Quinlan Vos entered the council chamber. Marlo did not speak as Kenobi informed the council of Ziro's escape. As the Jedi left, Marlo returned his attention to the dancers.\nMarlo later traveled to the planet Zygerria to visit its slave market. As Marlo browsed through the market, a dispute erupted between a slave, her master, and a Zygerrian which caught Marlo's attention for a moment.\nTwenty three years later, during the reign of the Galactic Empire, Marlo attended another Hutt Council meeting, during which they discussed an invitation they had received from crime syndicate Crimson Dawn. Marlo, who had by this time gone largely senile, fell asleep during the meeting and was woken up by his protocol droid. He was then asked by fellow Hutt Bokku if they should accept the invitation. Marlo's senility caused him to think he was back in the era of the High Republic and that the invite they were discussing was from then-incumbent Soh. He thus replied that he thought they should accept \"Soh's\" invitation but warned that he did not trust her \"cats, referring to the esteemed chancellor's pet targons. Bokku summarily dismissed Marlo's ramblings, though Jabba admonished him to take the elder Hutt's great age into account and show him the proper respect.\nWhen Bokku, secretly an agent of Crimson Dawn, turned a Hutt fleet against Death Squadron during the Attack on the Executor, the Sith Lord Darth Vader personally boarded the Hutt flagship and cut down Marlo, Bokku, and the rest of the Hutt leadership leading the anti-Imperial attack, leaving Jabba the sole leader of the Hutt Clan. Nonetheless, Jabba chose to carry on the cartel's alliance with the Galactic Empire, deciding it was more profitable to focus on long term relationships and profits.\nMarlo was voiced by Kevin Michael Richardson. Marlo's appearance was based on actor Marlon Brando's portrayal of mob boss Don Vito Corleone in the mobster film, The Godfather.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Marlo",
  "/wiki/Marlo/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Nal_Hutta",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Jekara_system",
  "/wiki/Hutt",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Shadow_Collective",
  "/wiki/Clone_Wars",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Gorga_Desilijic_Aarrpo",
  "/wiki/Arok",
  "/wiki/Oruba",
  "/wiki/Zygerria",
  "/wiki/Standard_year",
  "/wiki/Lina_Soh",
  "/wiki/Supreme_Chancellor",
  "/wiki/Galactic_Republic",
  "/wiki/High_Republic_Era",
  "/wiki/232_BBY",
  "/wiki/21_BBY",
  "/wiki/Hologram",
  "/wiki/Boba_Fett%27s_Palace#Throne_room",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Cad_Bane",
  "/wiki/Planet",
  "/wiki/Huttese",
  "/wiki/Pa%27lowick",
  "/wiki/Sy_Snootles",
  "/wiki/Twi%27lek",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Quinlan_Vos",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Galactic_Empire",
  "/wiki/Crimson_Dawn",
  "/wiki/Protocol_droid",
  "/wiki/Bokku",
  "/wiki/Targon",
  "/wiki/Death_Squadron",
  "/wiki/Attack_on_the_Executor",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Kevin_Michael_Richardson",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Evil_Plans",
  "/wiki/Hunt_for_Ziro",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/Eminence_(episode)",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/War_of_the_Bounty_Hunters_2",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Darth_Vader_(2020)_17",
  "/wiki/Bounty_Hunters_17",
  "/wiki/Crimson_Reign_1",
  "/wiki/Darth_Vader_(2020)_18",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Reproduction",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Death",
  "/wiki/Star_Wars_Insider_191"
 ]
}