{
 "name": "Marlena_Venn",
 "display_name": "Marlena Venn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Marlena Venn was the wife of Tanis Venn. She had married him despite the warnings of her mother, warnings that proved to be all too true. Marlena came to realize that her husband was a shameless womanizer and grew to hate him. She routinely repaired the K-X12 battle droids he hunted with and often cleaned up his messes, and on their anniversary in 3956 BBY decided to take the opportunity to make her feelings known. She rigged the droids to explode if Tanis moved, while he was stranded in the middle of the Dune Sea, she bought her own hunting license, paying twice as much as normal, so that she could and waited until he was trapped. After making sure he got the message, she took the next shuttle leaving Tatooine.\nMarlena was one who was considered by a Czerka Corporation protocol officer to have a mean streak a parsec wide. She was also able to rig Tanis Venn's droids to make him not realize the dangers until too late. When Revan said he had to go she asked him to say hello for Tanis despite leaving a message in the droids.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Venn",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Tanis_Venn",
  "/wiki/Marriage/Legends",
  "/wiki/Marlena_Venn%27s_mother",
  "/wiki/K-X12_probe_droid",
  "/wiki/Battle_droid/Legends",
  "/wiki/3956_BBY",
  "/wiki/Droid/Legends",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Hunting_license",
  "/wiki/Unidentified_Czerka_Corporation_protocol_officer",
  "/wiki/Parsec/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}