{
 "name": "Marlowe San Tekka",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "San Tekka clan",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Marlowe San Tekka was a human male scion of the San Tekka clan during the High Republic Era. He was the heir of a family that helped chart new paths through hyperspace for the Galactic Republic and earned a great fortune in doing so. Residing on the scenic shores of the planet Naboo alongside his husband Vellis, San Tekka helped the Republic in the aftermath of a devastating tragedy known as the Great Hyperspace Disaster that saw hyperspace debris emerge into realspace across the galaxy. San Tekka supplied aid and resources to Keven Tarr, a young systems analyst who successfully created a machine that could predict when and where new incidents would occur, allowing countless lives to be saved. Despite his help to the Republic, San Tekka was not without his secrets and kept certain information related to the mysteries of hyperspace known to only himself and his husband.\nBorn into a clan that earned a great fortune through hyperspace prospecting, the human male Marlowe San Tekka inherited considerable wealth. His clan owed much of its success to Mari San Tekka, a member of the family who developed an ability to sense routes through hyperspace known as Paths. Mari, however, was eventually kidnapped by members of a criminal family, leaving the San Tekkas without their greatest tool. Nevertheless, they continued to provide support to the Galactic Republic for many years; Marlowe became good friends with senator Izzet Noor of Serenno and eventually married a man named Vellis, welcoming a new addition into his influential family. The two lived together in a compound on the planet Naboo, continuing to study the mysteries of hyperspace.\nAround the year 232 BBY, the Class A modular freight transport Legacy Run was destroyed in hyperspace, sending debris hurtling towards the Hetzal system in an event that came to be known as the Great Hyperspace Disaster. Although intervention by the Jedi Order ensured that the system and its most populous planet, Hetzal Prime, survived the incident, wreckage of the Legacy Run continued to appear across realspace in phenomena referred to as Emergences, forcing travel restrictions and closures across the galaxy. Hoping to learn more about the Disaster, Jedi Knights Avar Kriss and Elzar Mann sought out Marlowe and Vellis on Senator Noor's recommendation, meeting with them in their Naboo home. The San Tekkas agreed to supply several of their navulators and modeling tools to Keven Tarr, a Hetzalian systems analyst who hoped to find a way to predict upcoming Emergences. Seeking further answers, Mann presented a Republic theory to the San Tekkas that the Legacy Run had come into contact with another object in hyperspace, a hypothesis which Marlowe denied outright as an impossibility. He claimed that hyperspace simply could not work in such a way, and instead offered up the idea that a mutiny aboard the transport had led to the incident. Although Mann continued to push the issue, both Marlowe and his husband remained steadfast in their claims, and the Jedi departed soon after.\nThe two men had lied, however, and privately confessed worries to each other that Mari San Tekka was somehow involved in the tragedy, despite Marlowe's belief that she should have been long dead by that point. In truth, the elderly woman had indeed survived, kept alive by Marchion Ro, a member of the Nihil marauders who had purposefully ordered a Stormship to travel through the Legacy Run's path in order to cause the disaster. The San Tekkas kept this information to themselves and later traveled to Hetzal's Rooted Moon to see what Tarr had constructed with their people's help: an array of navidroids that, with assistance from the Jedi, was successfully able to predict new Emergences. In one such event, the Republic was able to obtain the Legacy Run's flight recorder, which proved that the freighter had not been alone in hyperspace. When consulted by Supreme Chancellor Lina Soh, Marlowe maintained his position that the event was nothing more than a freak accident, but admitted that the Nihil's unique understanding of hyperspace travel posed dangerous implications.\nActing on this information, Republic Defense Coalition forces along with Jedi aid engaged the Nihil at the Battle of Kur. Although losses were great on both sides, Chancellor Soh was satisfied with the outcome and soon after reopened hyperspace lanes across the galaxy. Marchion Ro survived the battle, however, as did Marlowe's kin Mari. In the aftermath of the conflict, the San Tekkas hired Keven Tarr, bringing him aboard to work in their interests. In the centuries that followed, a descendant of Marlowe, Lor San Tekka, made a name for himself as an explorer, joining the Church of the Force and becoming an ally of New Republic heroes such as the Jedi twins Leia Organa and Luke Skywalker. When the latter went missing, San Tekka was instrumental in helping Organa's military group, the Resistance, locate the long-lost Jedi Master.\nMarlowe San Tekka was a man of privilege and wealth. Whereas his ancestors were rough-edged people who explored the outskirts of the galaxy, he maintained a life of relative opulence. Marlowe's comfortable living allowed him to operate with a relaxed air in his business. Although he considered it an honor to welcome Jedi into his home, he preferred to keep the secrets of his family private and withheld certain facts from them, going so far as to lie before them. Nevertheless, he and his husband could not stand idle as people suffered throughout the galaxy in the wake of the Great Disaster, and offered significant help to the Republic. Although Jedi Master Avar Kriss recognized that both Marlowe and Vellis had kept information away from the Jedi, she viewed their contributions to the Emergences task force as sincere and generous. Marlowe was a pale human with blond hair and blue eyes, much like his husband, though where Vellis's facial features were sharp and angular, Marlowe's were softer.\nLike many members of his family, Marlowe was considered a top mind in the field of hyperspace and was renowned for his knowledge on the subject. He was able to discreetly communicate with his husband Vellis, wordlessly passing thoughts and information between each other that even Jedi Master Kriss could not detect. They routinely made use of this skill when dealing in business with others.\nMarlowe San Tekka first appeared in the 2021 novel The High Republic: Light of the Jedi. He was first mentioned in a StarWars.com article, in which he was identified as \"Marlon.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/San_Tekka_clan",
  "/wiki/Galactic_Republic",
  "/wiki/High_Republic_Era",
  "/wiki/Hypersurveyor",
  "/wiki/Hyperspace_route",
  "/wiki/Hyperspace",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Marriage",
  "/wiki/Vellis_San_Tekka",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Emergences",
  "/wiki/Realspace",
  "/wiki/The_galaxy",
  "/wiki/Keven_Tarr",
  "/wiki/Systems_analyst",
  "/wiki/Keven_Tarr%27s_navidroid_array",
  "/wiki/Reproduction",
  "/wiki/Mari_San_Tekka",
  "/wiki/Path",
  "/wiki/Ro_family",
  "/wiki/Standard_year",
  "/wiki/Senator",
  "/wiki/Izzet_Noor",
  "/wiki/Serenno",
  "/wiki/San_Tekka_compound",
  "/wiki/232_BBY",
  "/wiki/Class_A_modular_freight_transport",
  "/wiki/Legacy_Run",
  "/wiki/Hetzal_system",
  "/wiki/Jedi_Order",
  "/wiki/Hetzal_Prime",
  "/wiki/Jedi_Knight",
  "/wiki/Avar_Kriss",
  "/wiki/Elzar_Mann",
  "/wiki/Navulator",
  "/wiki/Hetzalian_government",
  "/wiki/Transport",
  "/wiki/Jedi",
  "/wiki/Death",
  "/wiki/Marchion_Ro",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Stormship",
  "/wiki/Rooted_Moon",
  "/wiki/Navidroid",
  "/wiki/Fortieth_Emergence",
  "/wiki/Black_box",
  "/wiki/Freighter",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Republic_Defense_Coalition",
  "/wiki/Battle_of_Kur",
  "/wiki/Standard_century",
  "/wiki/Lor_San_Tekka",
  "/wiki/Church_of_the_Force",
  "/wiki/New_Republic",
  "/wiki/Twin",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Luke_Skywalker",
  "/wiki/Resistance",
  "/wiki/Jedi_Master",
  "/wiki/Emergences_task_force",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/StarWars.com",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Soule_Man",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars",
  "/wiki/Standard_week",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY"
 ]
}