{
 "name": "Maro_Vizhen",
 "display_name": "Maro Vizhen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireImperial Diplomatic Service",
      "Imperial Diplomatic Service"
     ]
    }
   ]
  }
 ],
 "content": "Maro Vizhen was a Human female who served the reconstituted Sith Empire during the Cold War. She worked as a diplomat in the Imperial Diplomatic Service. Vizhen took part in the creation of the Shadow Syndicate and was involved in its conflict with Exchange crime boss Ukabi.\nIn 3643 BBY, Vizhen was sent to Nar Shaddaa to oversee the formation of the Shadow Syndicate, an Empire-affiliated alliance of four of the planet's most prominent crime bosses. However, the leader of the local Exchange group, Ukabi, refused to join and forced Vizhen to employ the services of a powerful Empire-aligned individual to deal with him.\nVizhen's move to cripple Ukabi's organization proved to be a blunder, as the crime boss unleashed a vicious retaliation aimed at the Syndicate's interests throughout all Nar Shaddaa. Vizhen's enforcer decided to attack Ukabi's base and eliminate him while the bulk of his forces were engaged in the onslaught. While the enforcer's offensive was partially successful, Vizhen was betrayed by Syndicate member Godoba the Hutt and cornered by Ukabi at her base. She was eventually saved by her enforcer's timely arrival, only to be executed for her incompetence in dealing with the whole affair.\nVizhen is the NPC responsible for a series of missions offered to empire characters in Star Wars: The Old Republic. It is also possible to spare Vizhen's life after the battle with Ukabi through \"light side\" conversation options.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Diplomatic_Service",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Shadow_Syndicate/Legends",
  "/wiki/Exchange",
  "/wiki/Ukabi",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Godoba",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}