{
 "name": "Marr_Idi-Shael",
 "display_name": "Marr Idi-Shael",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cerea"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue",
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Relin Druur",
      "Jaden Korr"
     ]
    }
   ]
  }
 ],
 "content": "Marr Idi-Shael was a male Force-sensitive math savant Cerean and first mate of the starship Junker, aboard which he conducted salvaging operations for many years with his friend, the Captain Khedryn Faal.\nAfter his meeting with the Jedi Knight Jaden Korr and a short informal Force-training with Master Relin Druur in 41 ABY, he asked to join the New Jedi Order, becoming the apprentice of Jaden Korr.\nBy 41.5 ABY, Marr had been partners with Khedryn Faal for many years. The two were together on Fhost, and often played sabacc at the Black Hole cantina. It was in one such of these card games when the local crime boss Reegas Vance attempted to take the coordinates of a Frozen moon Khedryn and Marr had located as a prize in the game. However, this was prevented when Jedi Knight Jaden Korr used the Force to scramble the card shuffler to make Khedryn win. Accusing Khedryn of cheating, Reegas ordered his Weequay bodyguards to attack. Earsh was killed in the ensuing brawl. In the end, Jaden, Marr, and Khedryn escaped out the back door.\nMarr helped Jedi Master Relin Druur board the Harbinger by first executing a micro jump that brought Junker right before Harbinger's shields and then breaking through them with a Powercrystal.\nWhile he helped Relin to board the ship, Junker was boarded by five Massassi warriors. Unable to fight the warriors, Marr used his newly discovered Force ability to pilot Junker blind out of the landing bay and then opened the ship to space, killing the Massassi but not before being gravely wounded himself. With his last strength he set Junker on autopilot to a frozen moon where he knew to find Jaden Korr and Khedryn Faal while Harbinger exploded in the moon's atmosphere.\nAfter his injuries were treated by Korr and Faal, Marr relayed Relin's last words to Korr. He also asked to be trained in the Force in order to become a Jedi, to which Jaden agreed.\nDuring the return trip to the frozen moon, Jaden began to train Marr in the ways of the Force, consisting of disassembling and reassembling Jaden's old lightsaber and running him through a series of lightsaber exercises. When the Junker arrived at Fhost, they discovered that a medical facility on planet was under attack by the clones. Jaden and Marr infiltrated the facility and split up to find the clones. By the time Marr reunited with Jaden, he had already been subdued by the surviving clones, and the clones escaped in a stolen medical supply ship, with Khedryn on board.\nMarr and Jaden tracked the supply ship to a remote system in the Outer Rim. When they arrived, they were contacted by Nyss Nenn, who, also on the supply ship, offered to trade Jaden in a hardsuit for Khedryn in an escape pod. Jaden agreed, but during the transfer his hard suit was breached and Marr also had to don a hardsuit and rescue him.\nThe fully reunited crew then followed the supply ship once again, and found an ancient Rakatan space station. Jaden and Marr boarded the station and were attacked by and defeated a large numbers beings controlled by the station. As they went deeper into the space station the pair was attacked the Nyss and Marr was knocked unconscious. Upon reawakening, he found Jaden had killed Nyss, but found a clone of Jaden, the Iteration standing over him. The Iteration stabbed him in the temple with a mindspear, killing Jaden. Marr engaged the Iteration and initially being outmatched, sunk into the Force and defeated the Iteration. Marr then used the mindspear and the Iteration to transfer Jaden's identity and consciousness into his cloned body. Shortly after Soldier, another clone of Jaden, arrived, being chased by Mother in Seer's body. The three of them held off mother while Khedryn rigged the supply ship to self destruct. Jaden, Khedryn and Marr escaped in the Junker as the station exploded.\nHis latent Force connection allowed him to calculate hyperspace jumps without a navicomputer. In addition, Idi-Shael displayed the rare ability of absorbing energy, as he was able to stop the lightsaber blade of Iteration with his bare hands during their duel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cerea/Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Relin_Druur",
  "/wiki/Jaden_Korr",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Junker_(YT-2400_light_freighter)",
  "/wiki/Captain/Legends",
  "/wiki/Khedryn_Faal",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/41_ABY",
  "/wiki/Padawan/Legends",
  "/wiki/Fhost",
  "/wiki/Sabacc/Legends",
  "/wiki/Black_Hole_(Fhost)",
  "/wiki/Reegas_Vance",
  "/wiki/Frozen_moon",
  "/wiki/The_Force/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Earsh",
  "/wiki/Harbinger_(Sith_dreadnaught)",
  "/wiki/Power_gem",
  "/wiki/Massassi/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Jaden_Korr%27s_first_lightsaber",
  "/wiki/Nyss_Nenn",
  "/wiki/Rakata/Legends",
  "/wiki/Iteration",
  "/wiki/Mindspear",
  "/wiki/Soldier_(clone)",
  "/wiki/Seer_(clone)",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Marr_Idi-Shael",
  "/wiki/Hyperspace/Legends",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Tutaminis",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Fair_Trade",
  "/wiki/Star_Wars_Insider_129",
  "/wiki/Crosscurrent",
  "/wiki/Riptide_(novel)",
  "/wiki/Jedi_Council_Forums",
  "/wiki/Paul_S._Kemp"
 ]
}