{
 "name": "Martio_Batch",
 "display_name": "Martio Batch",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 4 ABY and 6 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Martio Batch was an Imperial officer who rose through the ranks to become one of the twelve Grand Admirals of the Galactic Empire appointed by Emperor Palpatine during an elaborate New Year's Fete Week ceremony two years before the Battle of Yavin. Batch disliked the Imperial court politics that his fellow Grand Admirals reveled in, and as a result of his low profile, he earned the nickname the \"invisible admiral.\" Following the Imperial defeat at the Battle of Yavin in 0 BBY, the Emperor tasked Batch with designing a fool-proof cloaking device that would catch the Rebel Alliance off-guard and ensure the Empire's ultimate victory. Batch spent years aboard the Imdaar Alpha research station trying to develop the cloaking device, using hibridium to develop an experimental cloak. His efforts, however, suffered from a fatal flaw; while the cloaked ship would be invisible, the pilot would be unable to see out.\nAround 3 ABY, Batch abandoned his hibridium-based design and attempted to recreate the successful stygium cloaking screen used in cloaked ships in the past. Batch diverted the Empire's new Tarkin superweapon to the planet Aeten II, where the stygium crystals required for the cloak had been mined before the supply ran dry, and used the weapon's powerful superlaser to shatter the planet, releasing millions of free-floating crystals from the planet's core. Now that he had crystals at his disposal, the Grand Admiral easily recreated the stygium screen, and the Empire began fitting modified V38 assault fighters with the technology. Following extensive testing, Batch's new cloaked TIE phantoms were soon ordered into full production. However, the Rebel Alliance had discovered the project. During an operation to acquire one of the TIE phantoms, the Rebels managed to destroy the Imdaar Alpha research facility, as well as all the cloaked fighters and the cloaking technology in the process. Batch survived the attack and fled to the Outer Rim Territories with his remaining ships. However, his crew soon turned on him, assassinating the Grand Admiral before joining renegade Warlord Harrsk's new splinter kingdom in the Deep Core.\nMartio Batch, a Human male, was an officer of the Galactic Empire who rose to prominence and became one of the twelve Grand Admirals appointed by Emperor Palpatine during an elaborate New Year's Fete Week ceremony two years before the Battle of Yavin. Unlike his fellow Grand Admirals, Batch had a distaste for Imperial court politics and made fewer public appearances, earning him the nickname the \"invisible admiral.\"\nAfter the loss of the Death Star at the hands of the Rebel Alliance at the Battle of Yavin, the Emperor tasked Batch with designing a fool-proof cloaking device. The loss at Yavin had enraged the Imperial command, leading them to seek a weapon that would ensure the Empire's ultimate victory over the Rebels. Palpatine considered Batch an ideal candidate to lead the secret development project due to his low profile.\nBatch spent years aboard the Imdaar Alpha research station trying to develop the cloaking device. The devices had once been common, operating on stygium crystals mined from the planet Aeten II in the Dreighton Nebula. Eventually, the Aeten II mines ran dry and cloaking technology became increasingly rare. While conducting research into alternatives to stygium, Batch contributed a section titled \"What You Don't See: Cloaking Devices\" describing cloaking devices to the Imperial Handbook: A Commander's Guide, the official military guidebook of the Empire.\nUsing hibridium as an alternative, Batch developed an experimental cloak, but it suffered from a fatal flaw; while the cloaked ship would be invisible, the pilot would be unable to see out. Around 3 ABY, Batch attempted to recreate the stygium cloaking screen that had been successful in the past, abandoning the hibridium-based cloaking technology. Batch came upon success when he pulled rank to divert the Empire's new Tarkin superweapon, a stripped-down version of the Death Star, to Aeten II. Using the weapon's powerful superlaser, Batch shattered Aeten II, releasing millions of free-floating crystals from the planet's core. This was the Tarkin's only offensive action before it was destroyed by a Rebel strike team at Patriim.\nNow that he had the necessary crystals at his disposal, the Grand Admiral easily recreated the stygium screen used long ago. Under Batch's command, the Empire began fitting modified V38 assault fighters with the technology at the facility on Imdaar Alpha, with the aim of producing a fleet of the cloaked starfighters. In addition to the stygium, the fighters required a supply of oridium fuel, and the Empire established a mining facility in the Belt of Arah to extract and process the ore. To protect his investment, Batch requisitioned the Executor-class Star Dreadnought Terror, under the command of Admiral Sarn. Both the Terror and the Imdaar Alpha facility were also fitted with the cloaking technology.\nThe initial prototypes of Grand Admiral Batch's new TIE phantom starfighters were tested near Dreighton; however, some early mishaps caused delays to the project, and the Dark Lord of the Sith Darth Vader eventually traveled to the research station to oversee the final stages of the project. The final field tests were soon completed, and, impatient with the project's progress, the Dark Lord ordered the full scale production of the new fighters. Under Vader's command, thousands of the TIE phantoms soon stood ready at the Imdaar Alpha facility.\nIt was around this time that the Rebel Alliance discovered Batch's project, and they soon launched an operation to steal one of the cloaked fighters to be studied. The Rebels managed to destroy the Empire's oridium mining facility at Arah, ending the project's supply. During their mission to obtain one of the TIE phantoms, two Rebel agents destroyed the Terror, as well as Imdaar Alpha. The entire fleet of TIE phantoms was destroyed in the process except for one, in which the Rebels made their escape. For his incompetence, Admiral Sarn was executed by Vader before the Dark Lord escaped the Rebel attack. The stolen TIE phantom was taken back to a Rebel base in the hopes that Alliance engineers could adapt the technology to their own fighters; however, the fighter's self-destruct mechanism activated shortly after its arrival at the base, destroying both the fighter and the cloaking technology it carried.\nBatch survived the Rebel attack and, knowing he had failed his Emperor, took his remaining ships and fled to the Outer Rim Territories. The Grand Admiral's crew was still loyal to Sarn, however, and, after the Emperor's death in 4 ABY, they assassinated Batch before joining Warlord Blitzer Harrsk's Zero Command in the Deep Core.\nYears after Batch's death, one of his discarded cloaking designs, which was plagued with the double-blindness flaw, was used during Grand Admiral Thrawn's military campaign to retake control of the galaxy from the New Republic. By 19 ABY, the Empire was still attempting to overcome the double-blindness flaw in its cloaking design, using such technology as the Computerized Combat Predictor to help the ships fire while unable to see their targets, but was unsuccessful.\nOne of the twelve officers Emperor Palpatine entrusted with being a Grand Admiral, Martio Batch had an aversion to Imperial court politics, which earned him the nickname the \"invisible admiral.\" Due to this, Batch had a low profile compared to his peers that was put to use by Palpatine. Unwilling to face the Emperor's wrath when the Rebels destroyed all the TIE phantoms, Batch chose to flee in the face of his failure with what remained of his forces.\nMartio Batch was created by Star Wars authors Kevin J. Anderson and Daniel Wallace for The Essential Chronology, released in April 2000. Batch's backstory was later expanded upon by Wallace, along with fellow author Abel G. Peña, in the Star Wars Insider 66 article \"Who's Who: Imperial Grand Admirals.\"\n\"Who's Who: Imperial Grand Admirals\" co-author Daniel Wallace has unofficially suggested that Batch's personal Star Destroyer was named Meniscus on his StarWars.com blog. The blog entry also included an equipment list for Batch, which included a blaster pistol, a comlink, his code cylinder, a datapad, and a stygium splinter.\nThe \"Who's Who: Imperial Grand Admirals\" article appearing in Insider 66 was originally slated to appear in Star Wars Gamer magazine, though when the publication was discontinued, the article instead appeared in Insider. The original Gamer article, titled Dirty Dozen: The Imperial Grand Admirals, contained more information and was longer than the version appearing in Insider.\nShortly after being appointed Grand Admiral, Batch was given a direct order by the Emperor: create a fool-proof cloaking device or face execution. Batch made occasional appearances with his fellow Grand Admirals at New Year Fete parties or military fund-raisers; however, he knew his life hinged on the success of the project. Batch experimented with hundreds of new designs without success, with his flawed hibridium design being his most promising. Desperate to show the Emperor he was making progress, the Grand Admiral sent Palpatine prototypes of ships using his hibridium cloak, which the Emperor stored in his secret vaults inside Mount Tantiss.\nBatch moved his research station to Aeten II, believing there had to be a way to get more stygium crystals from the planet. After using the Tarkin to blast free the stygium crystals, Batch sent the Emperor a shuttle and a yacht equipped with his new stygium cloak. Impressed, Palpatine sent Darth Vader to observe the project.\nFollowing the Rebel attack on the project, Batch escaped with the remnants of Admiral Sarn's fleet, hiding in the Outer Rim to escape Palpatine's wrath. It wasn't long before word of the Emperor's death at Endor reached Batch; however, his relief didn't last long. Batch was assassinated by the crew of his flagship, still loyal to the late Admiral Sarn, who proceeded to defect to Warlord Harrsk's new splinter kingdom in the Deep Core.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/4_ABY/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Fete_Week",
  "/wiki/2_BBY/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Imdaar_Alpha",
  "/wiki/Imdaar_Alpha_research_station",
  "/wiki/Hibridium/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Stygium",
  "/wiki/Tarkin_(superweapon)",
  "/wiki/Superweapon/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Aeten_II/Legends",
  "/wiki/Crystal/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Superlaser/Legends",
  "/wiki/V38_assault_fighter",
  "/wiki/TIE/ph_phantom",
  "/wiki/Mission_to_Imdaar",
  "/wiki/Starfighter/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Blitzer_Harrsk",
  "/wiki/Zero_Command",
  "/wiki/Deep_Core/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Imperial_High_Command/Legends",
  "/wiki/Dreighton_Nebula/Legends",
  "/wiki/Imperial_Handbook:_A_Commander%27s_Guide",
  "/wiki/Death_Star/Legends",
  "/wiki/Infiltration_of_the_Tarkin",
  "/wiki/Patriim/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Oridium",
  "/wiki/Fuel/Legends",
  "/wiki/Arah_mining_facility",
  "/wiki/Arah_asteroid_belt",
  "/wiki/Ore/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Terror",
  "/wiki/Admiral/Legends",
  "/wiki/Sarn",
  "/wiki/Dreighton",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Arah",
  "/wiki/Engineer/Legends",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/The_galaxy/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Computerized_Combat_Predictor",
  "/wiki/Star_Wars",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Daniel_Wallace",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/April",
  "/wiki/2000",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Meniscus",
  "/wiki/StarWars.com",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Code_cylinder/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Dirty_Dozen:_The_Imperial_Grand_Admirals",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Mount_Tantiss/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Yacht/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_67",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Death_Star_Owner%27s_Technical_Manual",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/Star_Wars:_Imperial_Handbook:_A_Commander%27s_Guide",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Specter_of_the_Past",
  "/wiki/Nial_Declann",
  "/wiki/Octavian_Grant",
  "/wiki/Josef_Grunger",
  "/wiki/Ishin-Il-Raz",
  "/wiki/Afsheen_Makati",
  "/wiki/Danetta_Pitta",
  "/wiki/Peccati_Syn",
  "/wiki/Miltin_Takel",
  "/wiki/Osvald_Teshik",
  "/wiki/Rufaan_Tigellinus",
  "/wiki/Demetrius_Zaarin",
  "/wiki/Balanhai_Savit"
 ]
}