{
 "name": "Marus Timpel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Antarian Rangers"
     ]
    }
   ]
  }
 ],
 "content": "Marus Timpel was a male Human Jedi Master who served the Jedi Order approximately six centuries prior to the outbreak of the Clone Wars.\nBorn on Coruscant and raised in the Jedi Temple, Marus Timpel honed his Force powers through training at the Temple academy and eventually attained the rank of Jedi Master. Working as a recruiter for the Order, Timpel traveled the galaxy on many occasions, serving the Jedi High Council and the will of the Force. While undertaking routine duties on the planet of Antar 4, Timpel met a Gotal who had been turned down for Jedi training many years earlier; he had, in fact, been turned away by Timpel himself.\nThe Gotal's name was Kaskutal and he possessed none of the bitterness many beings acquired when turned away from the academy. Kaskutal still admired the Order and had made a very successful life for himself as a businessman. Timpel and Kaskutal soon became friends, and the Jedi would express his frustration on how his life as a Jedi limited him in available resources. Upon hearing this, Kaskutal proceeded to raise funds to create an organization that could help the Jedi Order in ways that would alleviate some of Timpel's frustrations.\nThe organization Kaskutal founded became known as the Antarian Rangers. As it grew and expanded, it moved beyond the borders of Antar 4, acquiring more and more members among beings who also admired the Jedi and wished to help them in any way possible. Throughout the rest of his career as a Jedi, Timpel was accompanied by Kaskutal, whose resources and limited Force-sensitivity proved more than valuable on multiple occasions.\nWhen Timpel became one with the Force, Kaskutal took on an administrative role to manage the operations of the Rangers. With his strong business and managerial skills, Kaskutal ensured that the organization was financially stable and helped to continue its expansion. Long after Timpel's death, the organization he helped to build flourished and assisted the Jedi Order through the tough times of the Clone Wars, the rise of the Galactic Empire, and even into the era of the New Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Antarian_Rangers/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/620_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Force_power/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_recruiter",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Antar_4/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Kaskutal",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Hero%27s_Guide",
  "/wiki/Wizards.com",
  "/wiki/Antarian_Rangers_(article)",
  "/wiki/Fly_Casual"
 ]
}