{
 "name": "Marvid_Qreph",
 "display_name": "Marvid Qreph",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "45 ABY",
      "Base Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Columi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Exploitation Technologies"
     ]
    }
   ]
  }
 ],
 "content": "Marvid Qreph was a Columi industrialist and criminal who worked in tandem with his brother, Craitheus, for several decades. When they were younger, their mother was shot and put into a coma by an unknown would-be assassin, which prompted the brothers to track down and find their mother's failed killer. Their attempts had resulted in not only the deaths of several beings they blamed for their mother's condition, but also in the total destruction of everything that their victims held near and dear. During all this, Marvid and Craitheus used their super-genius intellects to create and grow a criminal empire that controlled several different industries throughout the galaxy.\nBy 45 ABY, Marvid and his brother had expanded their activities so that they had more money than legitimate empires, working behind the scenes of all their criminal wrongdoings the whole way. At this time, they had stationed themselves in the Chiloon Rift, where they began funding pirate activities to rob the mining cooperative of the business they were competing in. At the same time, they established their primary headquarters, Base Prime, over an unknown monolith in the heart of the Rift so they could gain Force powers upon entry into it . Among those they hired, they used their biologically-engineered Nargons, Mandalorians led by Mirta Gev, and an enigmatic mercenary by the name of Savara Raine  to carry out their orders. Marvid favored Raine in particular; in fact, he was so fond of her that he created a human-Columi clone of hers that he named Savara Two behind her back.\nIn their attempts to take over the galactic economy, the brothers tried to swindle Lando Calrissian of his asteroid mining refinery on the world of Sarnus, something that Calrissian refused to do, which soon led to a series of activities that prompted Calrissian and his friends—the legendary Luke Skywalker, Han Solo, and Leia Organa Solo—to come after the brothers.\nWhen Base Prime was ultimately attacked by the Millennium Falcon, Marvid and Craitheus, who was rendered half-dead from the attack, entered the space–time-warping gate next to a monolith beneath Base Prime with Savara Two, where they accepted the gift of the Force from mysterious shadow beings. However, when confronted by Skywalker and his sister, they met their end, with Marvid being disintegrated by the former while his brother died thanks to Organa Solo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/45_ABY",
  "/wiki/Base_Prime",
  "/wiki/Columi/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Exploitation_Technologies",
  "/wiki/Craitheus_Qreph",
  "/wiki/The_galaxy/Legends",
  "/wiki/Chiloon_Rift",
  "/wiki/The_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Nargon",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mirta_Gev",
  "/wiki/Vestara_Khai",
  "/wiki/Savara_Two",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Sarnus_Refinery",
  "/wiki/Sarnus",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Space%E2%80%93time-warping_gate",
  "/wiki/Unidentified_monolith",
  "/wiki/Crucible_(novel)",
  "/wiki/Crucible_(audiobook)"
 ]
}