{
 "name": "Masher",
 "display_name": "Masher",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Forest Moon of Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mimph"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Less than 0.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pink",
      "white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White; black pupils"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mimph village"
     ]
    }
   ]
  }
 ],
 "content": "Masher was a male mimph from the Forest Moon of Endor. In 3 ABY, he led a hunting team that captured the Ewok Wicket Wystri Warrick, who was unconscious due to a fight he had had with a beast known as a hanadak. Masher and his team brought Warrick to their village, which was later attacked by the hanadak. In the struggle to defeat the beast, Warrick saved Masher's life, as well as the lives of the other team members. As a reward, Masher offered the Ewok a tooth lost by his mimph comrade, Thrasher.\nA male mimph from the Forest Moon of Endor, Masher lived in a village constructed near a river not far from the Ewoks' Bright Tree Village. In 3 ABY, Masher led a hunting team to the river, where they came across the Ewok Wicket Wystri Warrick, who had fallen unconscious after battling a beast called a hanadak. While the Ewok slept, Masher and his teammates, including Smasher, Thrasher, and another mimph, bound him in rope and placed him on a wheeled vehicle. When Warrick awoke, Masher and the others dragged him back to their village, where they hid him behind a curtain as other mimphs from the village gathered to watch.\nWhen the curtain was drawn and Warrick was revealed, Masher asked the Ewok to roar for the crowd. Instead, Warrick mumbled the Ewokese expletive \"kvark\" to himself. The excited mimphs loudly repeated the word, drawing the attention of the nearby hanadak, which tore through the village and destroyed several mimph homes and buildings. In the hopes of stopping the creature, Masher ordered his team to attack and leaped onto its gargantuan leg with his comrades. The beast, however, showed no sign of slowing down, and merely swatted the diminutive mimphs away.\nWarrick, concerned for the mimphs' safety, tore free of his bonds and safely caught the mimphs before they hit the ground. He then used the curtain to blindfold the hanadak, which fell into the river. Warrick was dismayed over having missed an opportunity to acquire a hanadak fang for his Belt of Honor, so, after quietly consulting with his comrades, the grateful Masher offered Warrick a mimph tooth, which Thrasher had lost in a fight.\nLike most mimphs, Masher was small—significantly shorter than 0.8 meters—with white eyes, black pupils, and pink and pale fur, including a small patch of white fur growing on his chin. Like many mimphs, Masher wore a red cap, although it differed in having two small, white horns protruding from the top.\nCourageous despite his small stature, Masher was proud in the face of danger, showing no fear in capturing creatures much larger than himself, and not hesitating to defend his village against the monstrous hanadak. He was concerned with the impressions of others, and he hoped to impress the mimph village by convincing the captured Warrick to roar. However, he was also quite amiable, as was shown when he offered Warrick a mimph tooth as a trophy after the young Ewok saved his life.\nMasher first appeared in \"Gone With the Mimphs,\" the ninth episode of the second season of the Ewoks television series. \"Gone With the Mimphs,\" written by Linda Woolverton, originally aired on October 18, 1986. While he was not named in the episode, an animation celluloid from the episode revealed Masher's name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Endor/Legends",
  "/wiki/Mimph",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Mimph_village",
  "/wiki/3_ABY/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Hanadak",
  "/wiki/Tooth/Legends",
  "/wiki/Thrasher_(mimph)",
  "/wiki/Unidentified_Endor_river_(mimph_village)",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Smasher",
  "/wiki/Unidentified_mimph",
  "/wiki/Rope/Legends",
  "/wiki/City/Legends",
  "/wiki/Ewokese/Legends",
  "/wiki/Belt_of_Honor",
  "/wiki/Hair/Legends",
  "/wiki/Gone_With_the_Mimphs",
  "/wiki/Ewoks:_Season_Two",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/Linda_Woolverton",
  "/wiki/October_18",
  "/wiki/1986",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27"
 ]
}