{
 "name": "Master_of_Questions",
 "display_name": "Master of Questions",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "The Master of Questions was a mysterious Sith entity in the shape of a Human female who resided in a realm of infinite white nothingness. At the time of the Cold War, the Master of Questions had been trapped in that place for millennia, although she sometimes welcomed unfortunate \"visitors\" who had been brought there by accident. Although she had the power to let her visitors go at will, the Master of Questions would only do so if they could beat her at a game of questions. With each of her questions that was answered incorrectly, the Master would strip her visitor of a part of their strength, which made them weaker and reinforced the power of the realm at the same time.\nAround the year 3643 BBY, the Master of Questions met the Jedi Consular that would one day hold the title of Barsen'thor. The Jedi and their companion, a Trandoshan named Qyzen Fess, had been sucked into the Master's realm after activating a Sith holocron that the Jedi believed was a Noetikon. As she would always do with her visitors, the Master offered the Jedi to play a game of questions in exchange for freedom. The three questions asked by the Master were, \"How do you catch an answer?,\" \"What does the wise person know?\" and \"Soon, this place will be overrun with enemies. What will you do?\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Time/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Jedi_Consular",
  "/wiki/The_Barsen%27thor",
  "/wiki/Trandoshan/Legends",
  "/wiki/Qyzen_Fess",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Noetikon",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Master_of_Questions",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}