{
 "name": "Master Codebreaker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "The Master Codebreaker was a human male codebreaker who was sought out by Rose Tico and Finn on a mission to stop the First Order's flagship, the Supremacy, from tracking the Resistance through hyperspace.\nMaster Codebreaker was known to Maz Kanata, who sent the pair after him while they were desperate for someone of his talents. When they finally spotted him in the Canto Casino in Canto Bight, they attempted to run up to him, but were apprehended by the Canto Bight Police Department for illegally parking their starship on the beach. The Master Codebreaker's companion—a woman going by the name \"Lovey\" who hoped to take his title—asked him about the disturbance, and he responded that he thought it was of little consequence.\nSometime after Supreme Leader Snoke's assumption of leadership within the First Order, Master Codebreaker stole the Smuggler's Guide from the Kanjiklub chief in the middle of negotiations for the domination of Rim territories, and wondered if Maz Kanata intended the book for him as another one of their tests of intellect. Before trying to uncover the enigma, Codebreaker visited the betting parlors of Hosnian Cardota, where he played with the arms dealers, steadily decreasing their money supply to their offense. Eventually, one of them tried to poison him, but the toxicity was nullified by hullepi-culture tongue sheath. He claimed to exit the parlor from the 350th-floor balcony using a para-wing glider. Master Codebreaker then returned to the enigma of the logbook and wrote an entry detailing this exploit in the Smuggler's Guide.\nFollowing his experience in the Hosnian system, Codebreaker noticed that Maz's list of powerful crime syndicates was decades out of date and that she neglected to mention the galaxy's true powers. He then wrote in the Smuggler's Guide new list of powerful syndicates: Black Sun lost their place in the list and became vigo diaspora, Crymorah Syndicate was replaced by Droid Gotra, Crimson Dawn by Son-tuul Pride and Guavian Death Gang, Pykes and Hutts by Kanjiklub and Red Key Raiders. He also added corporate entities that Maz neglected to mention: Sienar Fleet Systems, BlasTech, Kuat Drive Yards, Mining Guild, Corporate Sector Authority.\nTaking a break from ciphers to earn credits, though he also said he wouldn't be against Chandrilan cocktail, Master Codebreaker paid a visit to the Brentaal Trading Houses on Brentaal IV, one of the few worlds that still allow Codebreaker to play the games of odds which he recorded in the logbook.\nAfter his sojourn on Brentaal and parts spinward, he continued trying to uncover the secrets of the logbook, and suggested that it could be bio-hexacrypted and that he only needed to determine the biological sample Maz selected for encryption to crack this. He was also reminded that regardless of which faction holds power, Galactic Republic or Galactic Empire, New Republic or First Order, business interests retain their grip on manufacturing. Eventually, Master Codebreaker managed to decode the meaning of the logbook, concluding that it is an elaborate cipher that Codebreaker claimed means \"Happy Fete Week,\" wondering if it was an elaborate way by Maz to wish him New Year Fete. He recorded his attempts to decode the Smuggler's Guide in it.\nLater, Master Codebreaker tried to send the Smuggler's Guide back on course to Takodana as a thank you to Maz, so he decided to place it in the Millennium Falcon. He managed to locate the YT-1300f light freighter, and sneak the logbook on board, thinking Han Solo wouldn't notice it. The book then ended up being discovered by Gannis Ducain.\nMaster Codebreaker was only known by his title, and kept his original identity a secret. However, he once posted all of his personal information to a public node, encrypted by bio-hexacrypt, and anybody who uncovered the information was welcome to take his mantle. However, nobody was known to have retrieved the information.\nAt the Canto Casino, Master Codebreaker was only allowed to play dice games, and he was forbidden from electronic entertainment.\nMatching his levels of secrecy, the Codebreaker's companion kept her real name hidden from him, and he only referred to her as \"Lovey\".\nHe regularly wore a brooch in the shape of a red flower, a plom bloom, pinned on his lapel, which Maz told Finn and Rose about as an identifying mark. On the day he was sought out by the pair, he was sporting a thin black mustache.\nMaster Codebreaker is a character created by Rian Johnson for the 2017 film Star Wars: Episode VIII The Last Jedi. He was portrayed by Justin Theroux. Prior to Theroux's casting, the Master Codebreaker was originally conceived as a giant insect warlord which was supposed to be an animatronic according to creature and droid effects supervisor Neal Scanlan, but the idea was scrapped when Theroux was cast one day before filming.\nIn earlier versions of the film's script, Finn and Rose met the Master Codebreaker inside a cabaret room of the Canto Casino, only to be taken in a quest for a stashed knapsack and arrested by the Canto Bight Police Department at the casino's rooftop—following their attempt to break into the Master Codebreaker's room to be discovered by a droid. Jason Fry, the author of the film's novelization, originally wanted  to include this alternate meeting between the Codebreaker, Finn and Rose to shake up the fans' expectations, but ultimately it was decided that presenting an alternate version of a major scene would shake up expectations too much, so the idea was dropped.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Poe_Dameron",
  "/wiki/Rose_Tico",
  "/wiki/Finn",
  "/wiki/Mission_to_Canto_Bight",
  "/wiki/First_Order",
  "/wiki/Flagship",
  "/wiki/Supremacy",
  "/wiki/Hyperspace_tracker",
  "/wiki/Resistance",
  "/wiki/Hyperspace",
  "/wiki/Maz_Kanata",
  "/wiki/Canto_Casino_and_Racetrack",
  "/wiki/Canto_Bight",
  "/wiki/Canto_Bight_Police_Department",
  "/wiki/Starship",
  "/wiki/Lovey",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Kanjiklub",
  "/wiki/Unidentified_Kanjiklub_chief",
  "/wiki/Book",
  "/wiki/Betting_parlors_of_Hosnian_Cardota",
  "/wiki/Arms_dealer",
  "/wiki/Poison",
  "/wiki/Hosnian_system",
  "/wiki/Five_Crime_Syndicates",
  "/wiki/Standard_decade",
  "/wiki/The_galaxy",
  "/wiki/Black_Sun",
  "/wiki/Vigo",
  "/wiki/Crymorah_Syndicate",
  "/wiki/Droid_Gotra",
  "/wiki/Crimson_Dawn",
  "/wiki/Son-tuul_Pride",
  "/wiki/Guavian_Death_Gang",
  "/wiki/Pyke",
  "/wiki/Hutt",
  "/wiki/Red_Key_Raiders",
  "/wiki/Sienar_Fleet_Systems",
  "/wiki/BlasTech",
  "/wiki/Kuat_Drive_Yards",
  "/wiki/Mining_Guild",
  "/wiki/Corporate_Sector_Authority",
  "/wiki/Credit",
  "/wiki/Brentaal_Trading_Houses",
  "/wiki/Brentaal_IV",
  "/wiki/Planet",
  "/wiki/Bio-hexacrypt",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/New_Republic",
  "/wiki/New_Year_Fete_Week",
  "/wiki/Takodana",
  "/wiki/Millennium_Falcon",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Han_Solo",
  "/wiki/Gannis_Ducain",
  "/wiki/Flower",
  "/wiki/Plom_bloom",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Master_Codebreaker",
  "/wiki/Rian_Johnson",
  "/wiki/2017",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Justin_Theroux",
  "/wiki/Warlord",
  "/wiki/Neal_Scanlan",
  "/wiki/Knapsack",
  "/wiki/Casino",
  "/wiki/Droid",
  "/wiki/Jason_Fry",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi:_Rose_and_Finn%27s_Secret_Mission",
  "/wiki/The_Last_Jedi_Adaptation_2",
  "/wiki/The_Last_Jedi_Adaptation_3",
  "/wiki/The_Last_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Shuttle_Shock",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/The_Art_of_Star_Wars:_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Last_Jedi:_Heroes_of_the_Galaxy",
  "/wiki/The_Last_Jedi:_Rose_Tico:_Resistance_Fighter",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Force_Awakens:_Incredible_Cross-Sections",
  "/wiki/March_11",
  "/wiki/2018",
  "/wiki/August_19",
  "/wiki/2020"
 ]
}