{
 "name": "Mavra_Zane",
 "display_name": "Mavra Zane",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair",
      "white tattoos"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Yoda"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tren Alvar",
      "Ara Barotta",
      "Fenella Druce",
      "Zeetara Maan",
      "Kai Rees",
      "Kasi Sha'Rhil",
      "Dar Singe",
      "Cho Zeh'Bra",
      "Unidentified Togruta Padawan",
      "Unidentified Twi'lek Padawan",
      "Unidentified Mon Calamari Padawan"
     ]
    }
   ]
  }
 ],
 "content": "Mavra Zane was a female Human Jedi Master who served the Jedi Order during the last years of the Galactic Republic, and was a participant in the Separatist Crisis. During her time as a Jedi, Zane wielded a yellow-bladed lightsaber.\nA Force-sensitive Human, Mavra Zane was trained in the ways of the Force by the Jedi Order. Constructing a yellow-bladed lightsaber and growing strong in the Jedi arts under the tutelage of Grand Master Yoda, Zane achieved the rank of Jedi Master and was appointed as an instructor at the Coruscant Jedi Temple. As the threat of separatism grew in the Galactic Republic's Senate, and the discovery of the reemergence of the Sith on Naboo loomed large, the Jedi High Council saw a need to expand their training program across the galaxy. Selecting a group of Jedi Masters, the Council dispatched them with groups of Padawans to open new academies. Master Zane was selected and tasked with leading a group of students to the forested world of Kashyyyk, where she would instruct her students in the ways of the Force.\nTraveling aboard a Consular-class cruiser with her students, Zane and her charges arrived on Kashyyyk, where they met with Masters Yoda, Mace Windu and Obi-Wan Kenobi. Together, Yoda and Zane oversaw the younglings' training. Shortly after their arrival on the world, the chapter house and nearby village were attacked by Trandoshan slavers and the armies of the Commerce Guild. During the first assault, a group effort by the Jedi and the Wookiees scattered their attackers and bought time for the Jedi to regroup. Master Yoda used the lull in the fighting to return to Coruscant in hopes of divining the political causes of the attacks.\nShortly after Yoda left, Zane and her students were forced into battle again. Assisted by a Wookiee named Chewbacca, a small group escaped the attack, but Zane and many other students were taken captive. After a brief encounter with the Sun Guard, the students who'd escaped boarded a ship called the Star Runner, and flew into space to chase the slavers holding Zane and the other Jedi captive. Receiving a transmission from Masters Yoda and Windu via hologram, the Jedi were notified that Zane and the other captives had been taken to a prison facility above the planet Felucia.\nAboard a Providence-class capital ship, Zane freed herself while her escaped Padawans fought their way through the ship's hangar bay to the other imprisoned students. Soon, the Jedi discovered that the Commerce Guild was amassing a huge army to stage an attack on one of the Core Worlds. Realizing that the information needed to reach the High Council, Zane met up with the Padawans and warded off an attack by Sun Guards and IG-100 MagnaGuards. Upon destroying the ship's reactor core, Zane and her students boarded the Star Runner, escaping. Taking critical damage, the ship crash-landed on the planet below.\nEvading enemy combatants, Zane led her students to the planet's resistance stronghold. The native Felucians, under the leadership of a Human named Mak Pra, planned to storm the enemy's base. Agreeing to assist the resistance, Master Zane and her students infiltrated Presidente Shu Mai's stronghold. Discovering that Mai hoped to weaponize the dangerous chemical Trihexalon for an attack on Coruscant itself, Zane and her students attempted to escape the compound with this knowledge but were captured by the Gossam. Presidente Mai ordered the Jedi to be executed and escorted them to the mouth of a massive sarlacc. Before the Jedi could be disposed of, Master Yoda arrived with Republic reinforcements and freed the Jedi.\nDuring the fighting, the Jedi were engaged by two Zabrak Dark Acolytes, one of whom was named Ror, and were able to defeat them at the cost of allowing Mai to escape. Zane led the chase into space, determined to stop the Gossam before she reached Coruscant. After a brief conflict over\nFelucia, the Commerce Guild's fleet jumped to the capital and the Jedi and the Republic were forced to follow. Flying as Red Leader, Zane led her squad to destroy the Commerce Guild's fleet, ending the threat to Coruscant. Returning to the Jedi Temple, Master Zane elevated her students to the rank of Jedi Knight with the permission of the High Council.\nMavra Zane was portrayed by veteran voice actress Jennifer Hale and motion-capture actress/martial artist Michelle Lee.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Tren_Alvar",
  "/wiki/Ara_Barotta",
  "/wiki/Fenella_Druce",
  "/wiki/Zeetara_Maan",
  "/wiki/Kai_Rees",
  "/wiki/Kasi_Sha%27Rhil",
  "/wiki/Dar_Singe",
  "/wiki/Cho_Zeh%27Bra",
  "/wiki/Unidentified_Togruta_Padawan",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Jedi_instructor",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Consular-class_cruiser",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi_outpost_(Kashyyyk)",
  "/wiki/Battle_of_Kashyyyk_(Separatist_Crisis)",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Commerce_Guild/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Sun_Guard",
  "/wiki/Star_Runner",
  "/wiki/Realspace/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Felucia/Legends",
  "/wiki/Providence-class_carrier/destroyer",
  "/wiki/Hangar/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/IG-100_MagnaGuard/Legends",
  "/wiki/Reactor/Legends",
  "/wiki/Felucian/Legends",
  "/wiki/Mak_Pra",
  "/wiki/Presidente/Legends",
  "/wiki/Shu_Mai/Legends",
  "/wiki/Trihexalon",
  "/wiki/Gossam/Legends",
  "/wiki/Sarlacc/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Ror",
  "/wiki/Red_Leader/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jennifer_Hale",
  "/wiki/Kinect_Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_135"
 ]
}