{
 "name": "Max  (bunny)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bunny"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Max was a demented, diminutive, and destructive member of the bunny species. Over the course of his career, he worked with several different beings, such as a dog and New Republic agent Kyle Katarn. His visage could be found in various locations across the galaxy, notably in Fuel City on the world of Sulon. On that same planet, Max stayed at the House of Max, in the capital city of Barons Hed. Later, he teamed up with Katarn to hunt down Derrida, a Ketton spy who had taken refuge at the Kwenn Space Station. Max and Katarn succeeded in apprehending their quarry but nearly destroyed the station while doing so.\nMax was a pint-sized bunny, homicidal and demented by nature. He worked frequently with a sentient dog partner and was considerably dangerous in his work, though he asked for only a small fee.\nMax's visage could be found in at least two locations: A representation of his head adorned the interior of a Buick spacecraft as well as fueling pipes within Fuel City on the planet Sulon. In 5 ABY, Max was staying at the House of Max in the city of Barons Hed, the capital of Sulon. He was sharing a room with a Human female and had armed himself with a modified Bryar pistol that could fire repeating blasts.\nOne day, when Max's companion decided to go to a nearby market, a man named Kyle Katarn barged into their home. Katarn, a New Republic agent, was pursuing a personal vendetta against the Dark Jedi Jerec and sought to reach the city's Government House. There, the droid 8t88 was deciphering a map to the Valley of the Jedi, which Katarn's late father had sworn to protect.\nKatarn had taken it upon himself to pursue the matter; however, Gran thugs and Grave Tusken mercenaries prowled the streets of Baron's Hed, making Katarn's trip hazardous. Max decided to accompany Katarn on his journey and took his heavily modified pistol to the numerous thugs in a haphazard and frantic manner. Once Katarn reached the Government House, the pair parted ways.\nKatarn and Max later teamed up again to apprehend the Ketton spy Derrida. They caught up with her on Kwenn Space Station, located in the outer reaches of the Mid Rim. They successfully captured Derrida but nearly destroyed the space station in the process.\nA highly destructive being, Max suffered from deteriorated cognitive functions. His sentient dog partner considered him to be highly dangerous, and when Max was pursuing Derrida on Kwenn Space Station, his actions, combined with those of ally, Kyle Katarn, nearly razed the installation. Max had white fur and brown eyes.\nThe character Max belongs to artist Steve Purcell's animated media franchise, Sam \u0026 Max, which first found commercial success in 1987 as a full-length comic series. Purcell eventually went to work for LucasArts as an animator and began writing Sam \u0026 Max comics for the LucasArts quarterly magazine The Adventurer, including several that parodied Star Wars. In 1993, LucasArts released the first Sam \u0026 Max video game, Sam \u0026 Max Hit the Road, which Purcell helped design. Max, sometimes accompanied by Sam, has also made Easter egg cameo appearances in several other LucasArts video games, including Indiana Jones and the Last Crusade: The Graphic Adventure, The Secret of Monkey Island, and Day of the Tentacle, among others.\nMax also makes cameos in a number of LucasArts Star Wars games, including Star Wars: Dark Forces , in which the outline of Max's head is visible on a map of the Ice Station Beta facility; Star Wars: Shadows of the Empire , which uses Max's likeness to represent a \"Challenge Point\" icon in the game's Mos Eisley level; Star Wars: Jedi Knight: Dark Forces II ; and Star Wars: Rogue Squadron III: Rebel Strike , which includes Max's head in the \"cockpit\" of the game's un-lockable Buick feature.\nYet 1997's Jedi Knight: Dark Forces II remains Max's most substantial cameo. In the game, Max is featured in two cameos, the lesser appearing in \"Level 9: Fuel Station Launch.\" At the end of the level, the player can see three images of Max's face on a part of Fuel City's docking array. However, the more significant cameo takes place in \"Level 5: Baron's Hed – The Fallen City.\" If the player moves across the lowest step of a staircase in the early stages of the level, a woman in a nearby building will open a door and leave. If moving quickly enough, the player can sneak in through the opened door. If too slow, the player can wait for the woman to return and reopen the door. Within the building, standing on a large chair, is Max, armed with a Bryar pistol. If the player interacts with Max, the bunny will help the player throughout the rest of the level. Should the player fire on Max, the bunny will return fire. Players can also interact with Max once more to activate the \"MaxCam,\" which shows the level from Max's perspective.\nThe Dark Forces II strategy guide later identified Max by name and provided tips to help players find the \"Easter egg.\" Max's physical appearance in the game hews closely to Purcell's original drawings, and his zealous wielding of a proportionally oversized gun is culled directly from the Sam \u0026 Max mythos.\nRegarding Max's canonicity within the Star Wars Legends continuity, The Dark Forces Saga, a series of game scenarios written by Jason Fry and Abel G. Peña in 2005, identified one of Kyle Katarn's comrades as a \"demented, pint-sized lagomorph.\" The same phrase had previously been used to describe Max within Sam \u0026 Max Hit the Road, and Peña later confirmed that the lagomorph in question was indeed Max. Peña purposely referenced Max in connection to the spy Derrida as a homage to the real-world philosopher Jacques Derrida, a Deconstructionist. Peña felt that the message of Deconstructionism as appropriate when referencing a \"quasi-canonical Easter egg\" like Max because Star Wars continuity, like reality, is uncertain and will \"always be undermined.\"\nWhen asked about the canon status of Simon the Killer Ewok from the 2001 video game Star Wars: Galactic Battlegrounds, Leland Chee, manager of Lucasfilm's Holocron continuity database, compared him to Max.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Max",
  "/wiki/Bunny",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Species/Legends",
  "/wiki/Unidentified_sentient_dog",
  "/wiki/New_Republic/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/The_galaxy/Legends",
  "/wiki/Fuel_City",
  "/wiki/Planet/Legends",
  "/wiki/Sulon",
  "/wiki/House_of_Max",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Barons_Hed",
  "/wiki/Derrida/Legends",
  "/wiki/Ketton/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Kwenn_Space_Station/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Buick",
  "/wiki/Starship/Legends",
  "/wiki/Fuel/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Max%27s_companion",
  "/wiki/Bryar_pistol/Legends",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Canon",
  "/wiki/Standard_day/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Government_House_(Sulon)",
  "/wiki/Model_88-series_administration_droid",
  "/wiki/8t88/Legends",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/Morgan_Katarn",
  "/wiki/Gran/Legends",
  "/wiki/Grave_Tuskens",
  "/wiki/Mercenary/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/File:SamAndMaxHitTheRoad.png",
  "/wiki/Steve_Purcell",
  "/wiki/1987",
  "/wiki/Star_Wars_comic_books",
  "/wiki/LucasArts",
  "/wiki/The_Adventurer",
  "/wiki/Star_Wars",
  "/wiki/1993",
  "/wiki/Video_game",
  "/wiki/Easter_egg",
  "/wiki/Star_Wars:_Dark_Forces",
  "/wiki/1995",
  "/wiki/Imperial_Robotics_Construction_Facility_Ice_Station_Beta",
  "/wiki/Star_Wars:_Shadows_of_the_Empire_(video_game)",
  "/wiki/1996",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/1997",
  "/wiki/Star_Wars:_Rogue_Squadron_III:_Rebel_Strike",
  "/wiki/2003",
  "/wiki/Cockpit/Legends",
  "/wiki/File:Sam_and_Max-Adventurer_4.jpg",
  "/wiki/The_Adventurer_4",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II:_The_Official_Strategy_Guide",
  "/wiki/File:Icestationbeta_max.jpg",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Jason_Fry",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/2005",
  "/wiki/Rabbit/Legends",
  "/wiki/Simon_(Ewok)",
  "/wiki/2001",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Leland_Chee",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Holocron_continuity_database",
  "/wiki/Category:Images_of_Max",
  "/wiki/Star_Wars:_Shadows_of_the_Empire_Limited_Collector%27s_Edition",
  "/wiki/Wizards.com",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Missions_18:_Rogue_Squadron_to_the_Rescue",
  "/wiki/January_23",
  "/wiki/2013",
  "/wiki/May_2",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/November_4",
  "/wiki/2006",
  "/wiki/May_4",
  "/wiki/2010",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Jedi_Council_Forums",
  "/wiki/January_26"
 ]
}