{
 "name": "Maxeena_Sov%27lya",
 "display_name": "Maxeena Sov'lya",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kothlis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Maxeena Sov'lya was a petty crime lord and member of Kothlis' high society. After her parents returned to Bothawui, Sov'lya took control of the family enterprises and transformed it into a business empire. However, she mostly let trusted subordinates take care of it while she concentrated on her crime syndicate.\nSov'lya had extensive contacts in the criminal underworld and started her syndicate while still working under her parents. She was very discreet in her illegal activities and was considered a charming member of the local high society.\nMost of her operations took place around Tal'cara and were run by a distant relative Bothan known as \"Uncle Dravos.\" While some of her activities were legal, most of them were protection rackets and smuggling. It was rumored that she had a relationship with the Beldonna's Legion's second-in-command and used this connection to avoid law enforcement. Her main rival was Ukert but she realized that it was better to coexist than risk everything in open competition and warfare. Sov'lya would occasionally hire Ukert to assist her by destroying evidence at his business Reclamation Services, Inc..",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kothlis/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Tal%27cara",
  "/wiki/Uncle_Dravos",
  "/wiki/Smuggler/Legends",
  "/wiki/Beldonna%27s_League",
  "/wiki/Ukert",
  "/wiki/Reclamation_Services,_Inc.",
  "/wiki/Platt%27s_Smugglers_Guide",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}