{
 "name": "Maxhagan",
 "display_name": "Maxhagan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gangster"
     ]
    }
   ]
  }
 ],
 "content": "Maxhagan was a male Human who settled in Greenwood Station on the planet Nox.\nAccording to Tre Sana, in 25,797 BBY, Maxhagan was crossed by a family from Volke House on Shikaakwa, which bought information from Maxhagan but refused to pay. In response, Maxhagan initiated a feud that destroyed the Volke family's entire network on Nox and left three thousand others dead.\nBy 25,793 BBY, Maxhagan was making all of his money from information, through his control of the Network, a collection of informants which reach extended beyond Greenwood Station to all of Nox. It is known that he had conducted business with Tre Sana, though they did not meet and their business did not involve the Network. Maxhagan later dealt with Tre Sana and Lanoree Brock, finding the whereabouts of Lanoree's brother, Dalien Brock, for a fee.\nTre Sana described Maxhagan as a sharp and brutal, saying he would have had no trouble sleeping after three thousand sentients died as a result of his actions. When Lanoree Brock touched his mind, her impression was that his thoughts were akin to a pit of filth.\nMaxhagan chose to remain in the open rather than hide, running a stall that sold imported water in District Six, but this did not belie a lack of caution. He kept armed men covertly around him as bodyguards, and had implants that enhanced his ability to keep Je'daii out of his thoughts.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gangster/Legends",
  "/wiki/Greenwood_Station",
  "/wiki/Nox",
  "/wiki/Tre_Sana",
  "/wiki/25,797_BBY",
  "/wiki/Shikaakwa",
  "/wiki/25,793_BBY",
  "/wiki/Lanoree_Brock",
  "/wiki/Dalien_Brock",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Maxhagan",
  "/wiki/Je%27daii",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}