{
 "name": "Maximian_Ajax",
 "display_name": "Maximian Ajax",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Imperial heavy freighter",
      "Redhurne system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Thirty-Second Infantry",
      "61st Mobile Infantry",
      "Thirty-Second Infantry",
      "61st Mobile Infantry"
     ]
    }
   ]
  }
 ],
 "content": "Maximian Ajax was a human male who served as a grenadier and sergeant in the Rebel Alliance during its war against the Galactic Empire. He was a member of the Thirty-Second Infantry before the group was obliterated. Ajax then became a part of the Alliance's 61st Mobile Infantry, nicknamed Twilight Company. During the Alliance's Mid Rim Offensive, which began around 1 ABY, he served with the company on the planet Bamayar, where he and another soldier named Twitch helped to capture the Chenodra port.\nIn 3 ABY, after Imperial Governor Everi Chalis defected to Twilight Company, Ajax spoke unfavorably about the new guest with several other soldiers over a game of cards aboard the company's CR90 corvette, the Thunderstrike. Ajax also took part in Twilight Company's campaign on the planet Coyerti, in which he and a number of other rebels faced an AT-ST walker until the Coyerti natives came to their aid. Ajax later led a squad during a raid on an Imperial freighter, where they set up a choke point in a main passageway. However, during their withdrawal from the freighter, Ajax and his squad were backed into a corner by Imperial stormtroopers, who killed the grenadier while the rest of the group was rescued.\nMaximian Ajax served as a grenadier in the Rebel Alliance during the Galactic Civil War against the Galactic Empire, eventually rising to the rank of sergeant. Initially a member of the Alliance's Thirty-Second Infantry, he was one of five survivors after the unit was obliterated in an event that resulted in the death of over 400 members of the infantry group.\nAjax then joined the Alliance's 61st Mobile Infantry, better known as Twilight Company, although he continued to wear the Thirty-Second Infantry's \"Bleeding Roughneck\" badge. When the company fought on the Mid Rim planet Bamayar during the Alliance's Mid Rim Offensive, which began around 1 ABY, Ajax and another soldier named Twitch helped to secure the port of Chenodra, but their actions during the battle led Twitch to believe that she was responsible for a bad mistake.\nIn 3 ABY, Twilight Company attacked the planet Haidoral Prime, prompting the planet's Imperial governor, Everi Chalis, to defect to the Rebellion. Shortly after leaving the planet aboard the company's CR90 corvette, the Thunderstrike, Ajax was present in the \"clubhouse,\" a social crawl space above the corvette's engineering section. While discussing Chalis, he played cards with several other soldiers, including Twitch, the ex-bounty hunter Brand, and the Besalisk Gadren. Ajax, ignoring a remark on Chalis from Twitch, asked Gadren if he would take a swing at the governor, but the Besalisk pointed out that he had already shot her once himself, having stunned Chalis during her extraction. Ajax then looked to Roach, a recruit from Haidoral Prime who was sitting near them, and speculated that she might confront the former governor of her homeworld.\nIn response to Ajax, Gadren reminded him that Roach was not alone in having mental scars and briefly explained why he had personally joined the Alliance when Roach asked if he had \"scars\" of his own. Ajax affirmed that it was the shortest story he had heard from a Besalisk. First Sergeant Hazram Namir, a high-ranking trooper who had been sitting nearby consulting a datapad, argued that Gadren was Corellian and not Besalisk, but Gadren reminded the first sergeant that Corellian was his demonym and his species was still Besalisk. Ajax responded to Roach that the first sergeant was not educated like the rest of them, prompting Namir to swear at the sergeant in response. The card players laughed before continuing with their game, with Twitch winning the next round.\nRoach pointed out her grudge with Chalis, having spent six months in a detention center on Haidoral Prime. As a result of Roach's disclosure, Ajax declared that the next winner of their card game would pick another player to tell their story. Within the next two minutes of playing, Namir silently suspected Ajax was cheating. Ajax ultimately won the round and picked Brand to tell her story. The former bounty hunter briefly explained how she had taken a bounty on Twilight Company's captain, Micha Evon, but changed her mind. Brand countered by asking why Ajax had joined the Alliance. Ajax was eager to tell his story, but Namir left, knowing Ajax was going to talk about a hunting trip he had endured with some lovers.\nTwilight Company later launched a campaign on the planet Coyerti, during which Ajax and a number of other rebel troopers attacked the local Imperial garrison. While the rebels were confronted by an AT-ST walker, Twilight Company's X-wing starfighters were unable to fly closer to the surface and assist the troops. However, the fighting was interrupted by a drumbeat-like sound, which the infantrymen realized was the Coyerti natives swarming to attack the Imperials. The entire Imperial garrison was on fire within ten minutes, but Ajax and his comrades continued throwing grenades, prompting Lieutenant Sairgon, Evon's second-in-command, to beg them to stop wasting the explosives.\nAfter Twilight Company left Coyerti, Ajax and other personnel were informed that the Coyerti campaign was among a number of rearguard actions of the Alliance Army. Ajax later told his stories of fighting the garrison on Coyerti in the clubhouse, smacking his palm on a metal tabletop to imitate the drumbeat-like sound of the Coyerti and drawing laughter when he mentioned Sairgon's begging over the throwing of grenades. Shortly after finishing his tales, Ajax asked Namir if there was any news of the Sixty-Eighth Infantry, an aquatic unit in the Alliance with which Twilight Company had once crossed paths.\nWhen Namir, who had missed out on recent news due to being under medical care, asked what Ajax's question had to do with anything, Twitch joked that Namir had been busy throwing up during the recent announcement. After laughing at Twitch's retort, Ajax told the first sergeant about the other rearguard actions made by Alliance forces, which Gadren claimed was coordinated to assist the withdrawal of the Alliance Fleet from the Mid Rim. Namir soon claimed that he would check with Evon about the Sixty-Eighth.\nSoon after, Twilight Company was attacked three times in the Metatessu sector by Imperial forces, and the Thunderstrike's chief of engineering, the droid M2-M5, discovered that the corvette's hyperdrive was leaking hypermatter, which allowed for the Empire to track the Rebel ship. As a result, Chalis and the high-ranking members of the company coordinated a raid for supplies to repair the hyperdrive, targeting a heavy freighter in the Redhurne system. Namir approved Ajax to take part in the mission—along with a number of others with experience in zero-gravity combat, EVA procedure, and space suit and oxygen mask handling—as one of the squad leaders. Namir then worked with the squad leaders to devise strategies and run drills.\nAfter boarding the Imperial freighter on a boarding pod, which used laserdrills to breach the ship's hull, Ajax led a squad through the enemy vessel. They set up a choke point in one of the main passageways as part of a push by multiple squads toward the engineering section to clear a path for Sergeant Fektrin and his personnel. Any Imperial defenders who passed the blockade were intercepted by Namir, who had set up a kill zone to eliminate them. Following the arrival of an Imperial Gozanti-class cruiser in the space battle, the squads aboard the freighter were given five minutes to evacuate and return to the Thunderstrike.\nIn their haste to return to the boarding pod, Ajax and his squad backed themselves into a corner as stormtroopers engaged them. Namir came to their assistance, firing at the stormtroopers until Ajax's squad could escape. However, Ajax was killed in the process, holding a grenade in his hand while shouting obscenities. The raid ultimately proved successful, and Twilight Company repaired the Thunderstrike's hyperdrive enough to stop the hypermatter leak and prevent the Empire from tracking them further. Following the mission, Captain Evon discussed Twilight Company's casualties with Namir and Sairgon, both of whom remarked that Ajax was a tough soldier to lose and would be difficult to replace.\nAlthough Ajax's body had not been recovered from the freighter, he and the seven other fallen soldiers of the raid were given a funeral. Per tradition, Quartermaster Hober read aloud Ajax's name, and Twitch gave a short eulogy, proclaiming him a Bleeding Roughneck until the end. She then raised a rusted and dented blaster power pack in Ajax's honor, which was then drained of its power into the Thunderstrike's vehicle charging station by Hober. The clubhouse was packed following the funeral, with many talking about Ajax and the others who had died in the raid. When Twitch entered the social area, one individual blamed the grenadier for the death of Fektrin—who had also perished during the raid—causing a brief fight to break out between the two.\nFollowing the funeral of Evon, who perished on the planet Hoth, Namir, Twitch, and other rebel personnel met on the backwater pirate planet Ankhural. At a cantina there, Namir reminisced about Ajax cheating at cards, while Twitch mentioned her and Ajax's mishap on Bamayar.\nA human male, Maximian Ajax was one whom Hazram Namir considered a jerk and found tolerable when interacting with infrequently. Despite no longer being in the Thirty-Second Infantry, Ajax continued to wear that unit's \"Bleeding Roughneck\" patch. As with other members of Twilight Company, the sergeant called recruits like Roach \"fresh meat.\" He was speculative about his comrades confronting Everi Chalis, questioning whether Gadren and Roach would confront the governor. Ajax also aimed jibes at Gadren and Namir, using a mocking whisper for the latter.\nAjax liked storytelling, giving a grin when he announced over a game of cards that it was story time. He was keen to share his own tale when his turn came, and on another occasion, he retold his experience on Coyerti to others at the clubhouse, not stopping for Brand's interjection. The sergeant played cards with other soldiers a number of times, being believed to cheat at games by Namir. Ajax was wasteful in his use of grenades on Coyerti, throwing them excessively to the point that Sairgon had to intervene. In his last stand against a group of stormtroopers, he shouted obscene language as he was killed in the fray. In the wake of the raid, Namir implied that the late sergeant was nearly irreplaceable.\nAjax was experienced in zero-gravity combat, EVA procedures, and the use of space suits and oxygen masks. His aim with a ranged weapon impressed Hazram Namir more than the aim of most snipers did.\nServing as a grenadier, Ajax utilized grenades during both the Coyerti campaign and the raid on an Imperial heavy freighter in the Redhurne system.\nMaximian Ajax appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/3_ABY",
  "/wiki/Unidentified_Imperial_heavy_freighter",
  "/wiki/Redhurne_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Thirty-Second_Infantry",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/File:Ajax-InsultNamir-BTC.ogg",
  "/wiki/Grenadier",
  "/wiki/Sergeant",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Obliteration_of_the_Thirty-Second_Infantry",
  "/wiki/Mid_Rim_Retreat",
  "/wiki/1_ABY",
  "/wiki/Battle_of_Bamayar",
  "/wiki/Company",
  "/wiki/Planet",
  "/wiki/Bamayar",
  "/wiki/Rebel_trooper",
  "/wiki/Twitch",
  "/wiki/Chenodra",
  "/wiki/Spaceport",
  "/wiki/Governor",
  "/wiki/Everi_Chalis",
  "/wiki/Soldier",
  "/wiki/CR90_corvette",
  "/wiki/Thunderstrike",
  "/wiki/Coyerti_campaign",
  "/wiki/Coyerti",
  "/wiki/Destruction_of_the_Coyerti_Imperial_garrison",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Walker",
  "/wiki/Coyerti_(species)",
  "/wiki/Homeworld",
  "/wiki/Ajax%27s_squad",
  "/wiki/Raid_on_an_Imperial_heavy_freighter",
  "/wiki/Imperial_heavy_freighter",
  "/wiki/Squad",
  "/wiki/Stormtrooper",
  "/wiki/Death",
  "/wiki/File:TwitchBrand-Bamayar-BTC.ogg",
  "/wiki/File:Twilight_Company_patch.png",
  "/wiki/Military_rank",
  "/wiki/Infantry",
  "/wiki/Mid_Rim_Territories",
  "/wiki/File:TwitchAjaxGadren-Chalis-BTC.ogg",
  "/wiki/Attack_on_Haidoral_Prime",
  "/wiki/Haidoral_Prime",
  "/wiki/Corvette",
  "/wiki/Engineer",
  "/wiki/Bounty_hunter",
  "/wiki/Brand",
  "/wiki/Besalisk",
  "/wiki/Gadren",
  "/wiki/Stun",
  "/wiki/Roach",
  "/wiki/First_Sergeant",
  "/wiki/Hazram_Namir",
  "/wiki/Trooper",
  "/wiki/Datapad",
  "/wiki/Corellian",
  "/wiki/Species",
  "/wiki/Standard_month",
  "/wiki/Prison",
  "/wiki/Standard_minute",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Captain",
  "/wiki/Micha_Evon",
  "/wiki/File:AjaxBrand-Coyerti-BTC.ogg",
  "/wiki/Imperial_Garrison_(Coyerti)",
  "/wiki/X-wing_starfighter",
  "/wiki/Drum",
  "/wiki/Garrison",
  "/wiki/Fire",
  "/wiki/Grenade",
  "/wiki/Lieutenant",
  "/wiki/Sairgon",
  "/wiki/Alliance_Army",
  "/wiki/Sixty-Eighth_Infantry",
  "/wiki/Water",
  "/wiki/Alliance_Military",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/File:Sairgon-EightDead-BTC.ogg",
  "/wiki/Metatessu_sector",
  "/wiki/Imperial_Military",
  "/wiki/Chief_of_engineering",
  "/wiki/Droid",
  "/wiki/M2-M5",
  "/wiki/Hyperdrive",
  "/wiki/Hypermatter",
  "/wiki/Starship",
  "/wiki/Gravity",
  "/wiki/EVA_suit",
  "/wiki/Breath_mask",
  "/wiki/Freighter",
  "/wiki/Boarding_pod",
  "/wiki/Laserdrill",
  "/wiki/Hull",
  "/wiki/Fektrin",
  "/wiki/Fektrin%27s_squad",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Naval_warfare",
  "/wiki/Limb",
  "/wiki/File:32nd_Infantry.ogg",
  "/wiki/Funeral",
  "/wiki/Quartermaster",
  "/wiki/Hober",
  "/wiki/Blaster_power_pack",
  "/wiki/Hoth",
  "/wiki/Pirate",
  "/wiki/Ankhural",
  "/wiki/Ankhural_cantina",
  "/wiki/File:Ajax-Roach-BTC.ogg",
  "/wiki/Time",
  "/wiki/Language",
  "/wiki/File:EvonNamir-Ajax-BTC.ogg",
  "/wiki/Realspace",
  "/wiki/Oxygen",
  "/wiki/Sniper",
  "/wiki/File:Ajax-Grenades-BTC.ogg",
  "/wiki/Star_system",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Category:Audio_files_of_Maximian_Ajax",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)"
 ]
}