{
 "name": "Maximilian_Veers",
 "display_name": "Maximilian Veers",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Denon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.93 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "82 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "501st Legion",
      "Imperial Officer Corps",
      "501st Legion"
     ]
    }
   ]
  }
 ],
 "content": "Maximilian Veers was a human male who served as a general in the Galactic Empire's army. In that capacity, he fought in the Galactic Civil War, which pitted the Galactic Empire against the Rebel Alliance. Veers was famous for his leadership during the Imperial assault on the then Rebellion-occupied Hoth system, during which he led a squadron of AT-AT walkers past Rebel defenses and personally destroyed the shield generator powering Rebel base's deflector shield. His leadership in the battle was critical to the successful takeover of the Hoth planetary system, a key victory for the Galactic Empire. Veers himself was critically injured during the battle when a Rogue Squadron snowspeeder crashed into his AT-AT's cockpit, destroying the walker, but ultimately survived.\nA human male, Maximilian Veers was born on the planet of Denon. In time, he came to serve as an army officer of the Galactic Empire, an authoritarian regime that governed most of the galaxy. As such, he was involved in the Empire's struggle against the Rebel Alliance, which contested the rule of Emperor Palpatine. Rising in the ranks through cunning and courage, Veers took part in over a dozen battles, including conflicts against the Zalorians on Zaloriis and the Culroonians on Culroon III. Aside from being a brilliant army officer, Veers was also a husband and a father.\nVeers was eventually assigned to the Death Star battle station, but was ultimately not on board during the Battle of Yavin, where it was destroyed by the Rebel Alliance. The destruction of the Death Star also helped accelerate his career due to the large amount of Imperial officers killed during the battle.\nFollowing the Battle of Yavin, Veers already served as a general. At that time, he was tasked with hunting down a governor who betrayed the Empire and locating the former senator Johhar Kessen. The Empire believed that Kessen would play a key role in finding the location of the Rebel Alliance's new headquarters, and for the duration of that mission, Veers was assisted by Captain Kosh, an officer stationed on Tatooine and in command of the 68th Legion.\nSometime later, Veers along with Admiral Kendal Ozzel, travel to the planet Mustafar to meet with Darth Vader, the Emperor's dark enforcer, at his castle. Veers stood along side Ozzel behind Vader as the Sith Lord looked out over the Mustafar landscape. After the admiral stated that the rebels were vermin and asked Vader on how they would eliminate them, Veers spoke up and informed Ozzel that he was mistaken. He stated that the rebels were not vermin but weeds and that the Empire was like a storm.\nVeers went on to explain that in a storm, weeds are able to bend and survive just as the Rebellion was capable of doing despite the Empire's constant attacks. The general went on to say that if the Rebels were more like a tree, sturdy and rooted in one place, then it would be different. Veers went on to comment that until the situation changed, the Rebels would continue to slip through their fingers. His comment caused Vader to then recall the same statement Princess Leia made to Grand Moff Tarkin. Vader stated that Veers made an interesting point and went on to explain their next course of action against the Rebels.\nShortly thereafter, Darth Vader launched Project Swarm, under which thousands of Viper probe droids were dispatched across the galaxy in an effort to discover the location of the new Rebel base. Incensed by the lack of quick progress, Vader ended up executing the project's supervisor, Major Yaltza. As a result, General Veers was put in charge of the operation and transferred to the Executor, the flagship of Vader's own flotilla, Death Squadron. When Professor Ud pointed out that the Rebels had used at least one ancient site in the past, Veers assembled a team of archaeological consultants that notably included the rogue scholar Chelli Aphra. The first lead they investigated was a deathshrine of the Central Isopter buried in the Kartovian Formation, on Ash Moon 1. Veers himself took part in the ensuing expedition. Although the ground crew did not find anything resembling a military base there, Professor Ud was killed after activating a structural trigger, and Aphra's father Korin was found lurking on the premises and arrested.\nAboard the Executor, Veers often clashed ideologically with Ozzel, his superior. While Ozzel preferred a measured, calculated approach to military strategy, Veers was more doggedly loyal to the personal whims of Vader, making him a favored figure among the Imperial hierarchy.\nEventually, one of the Viper droids detected signs of an occupied settlement on the sixth planet of Hoth, a system located in the Anoat sector of the galactic Outer Rim. On the Executor, Veers joined the panel of officers who reviewed the droid's data, along with Vader, Ozzel and his subordinate, Captain Firmus Piett. While Vader immediately identified the data as proof of the Rebellion, Ozzel was more skeptical. Vader ultimately ordered the fleet to investigate the Hoth system, and Veers began to prepare for the assault.\nOzzel's approved lightspeed course, intended to surprise the Rebellion, brought the Imperial fleet out of lightspeed close to the system. As a result, Rebel forces on the planet's surface had time to prepare a defense plan and organize an evacuation. Due to a localized energy shield protecting the base and power generator, orbital bombardment of the base was considered to be an ineffective attack strategy. After informing Vader of such information, Veers was ordered to lead a ground assault on the power generator and disable the energy shield. Vader then executed Ozzel and promoted Piett to Admiral.\nVeers, who had always kept a low profile in front of Vader, had been offered a chance to correct Ozzel's mistake. His squadron of Imperial AT-AT walkers were deployed beyond the border of the energy shield, allowing a ground approach to be made. Veers led the squadron into the Echo Base mountain valley, facing heavy Rebel ground fire as he approached the shield generators. The general led his troops from the front, in the cockpit of the lead walker, as the Rebels prepared to evacuate their headquarters. A group of snowspeeders led by Rebel Commander Luke Skywalker tried to delay Veers' force, destroying two walkers. As Rebel ground forces retreated, Veers ordered his walker to fire on the shield generator, destroying it. The generator's destruction marked the end of the Rebel defense, allowing Vader and his men to land on Hoth and break into the base, and demonstrating Veers' effectiveness as a military commander.\nDuring the battle, Blizzard 1 was decapitated when a snowspeeder flown by Derek Klivian crashed into it. The action injured Veers to the point of nearing death, but his unyielding devotion to carrying out Vader's will allowed him to stay conscious and ultimately survive long enough for Imperial medics to assist him. Veers later infiltrated Echo Base with his snowtroopers.\nMaximilian Veers was a powerfully built man with brown hair and eyes. Weighing 82 kilogram and standing 1.93 meters, he was ten centimeters taller than the average stormtroopers, the Empire's white-armored shock troops.\nVeers was a brilliant tactician, and a cool and efficient officer. He did not hesitate to put himself in harm's way on the front line, wearing Imperial officer battle armor. Cunning and capable, he was also devoted to his family. Because of those qualities, he was viewed as a model Imperial officer. An effective and decorated officer, Veers enjoyed the respect of his peers thanks to an impressive record of ground combat, and due to Veers' calm demeanor during battle he earned respect from Darth Vader himself.\nVeers always seemed very sure of himself when talking to Vader and had learned to tread lightly around the Sith Lord, fearing both the mysterious power he wielded and his volatile temperament. For example, when Veers went to see Vader in his quarters, he was not bold enough to interrupt the meditating Sith, but stood quietly at attention until he spoke. To Veers, serving Vader was an absolute commitment that he was unwilling to fail, believing that his truest duty was to succeed in following the Sith Lord's orders.\nOn the battlefield, Veers wore a grey-green chest armor over his duty uniform, and a matching open face helmet with an ample rear skirt and a black chin strap.\nGeneral Veers first appeared in the 1980 movie Star Wars: Episode V The Empire Strikes Back, the second installment in the original trilogy of Star Wars, in which he was played by the English actor Julian Glover. Robert Watts, an associate producer on The Empire Strikes Back, invited Glover in, as the two were next-door neighbors at the time. Glover worked on the movie for five days, which he later described as \"five days of complete and total bewilderment.\"\nDespite having a relatively small part in the movie, Glover discussed Veers' relationship to Vader with Star Wars creator George Lucas. In Glover's opinion, Veers should not be sycophantic toward Vader, since a proper general would not lack confidence. Lucas approved the actor's vision of the character, allowing Veers to stand up to Vader a little.\nThe armored breastplate worn by Veers in The Empire Strikes Back was the same design seen on the snowtroopers and the bounty hunter Dengar.\nThere was potential for Veers to appear in the next movie, Star Wars: Episode VI Return of the Jedi. In an early draft of the film's script, Veers was slated to return as the Commander of Endor's Garrison, personally leading the battle on the moon. Robert Watts, co-producer of the movie, contacted Julian Glover to offer him the bit, but the actor was working on something else at the time and could not do it.\nIn Return of the Jedi, Robert Watts played AT-ST pilot Lieutenant Blanaid. Before this pilot was identified, Watts once said that his character was General Veers. However, that identification was refuted on the official StarWars.com website, on the grounds that Veers' demotion to a simple pilot was unlikely.\nThe reference book Ultimate Star Wars and its newer edition confirm that Veers infiltrated Echo Base with snowtroopers, while the magazine Star Wars Helmet Collection 57 claimed that he died when his AT-AT was destroyed when Klivian crashed his speeder into it. The short story \"The Truest Duty\" from the anthology From a Certain Point of View: The Empire Strikes Back later revealed that Veers was on the verge of death immediately after Klivian's speeder crashed into his AT-AT, but that he had survived.\nIn the script of The Empire Strikes Back, Veers died when the Rebel snowspeeder pilot Derek Klivian flew his damaged vessel directly into the cockpit of the general's walker. That scene, however, never made it into the final cut of the film, although it did appear in the novelization, written by Donald F. Glut.\nVeers' background and fate were expanded upon in a number of reference books and comic books, although those stories are part of the Star Wars Legends, formerly known as the Expanded Universe.\nOn October 2, 2017, during an interview with Ed Dolista for the Episode 256 of IndyCast, Julian Glover was asked by Dolista his opinion about Veers' fate. Glover stated that he thinks Veers may have survived since his apparent death happened offstage  and that he could well be brought back if Lucasfilm wants.\nMaximilian Veers appears as the main antagonist in the 2015 LEGO animated television series LEGO Star Wars: Droid Tales. He is the overreaching antagonist in the first three episodes, and the main antagonist in the last two episodes. Following the Battle of Endor, General Veers and a renegade group of stormtroopers attempted to restart the droid foundries on Geonosis in order to restore the Galactic Empire. His plot involved tricking Lando Calrissian and his partner R2-D2 into gathering old droids and reusing their parts to build battle droids. Veers' scheme was defeated by the combined efforts of R2-D2, Lando, C-3PO, Chewbacca, Nien Nunb, and Admiral Ackbar.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Maximilian_Veers",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/Doctor_Aphra_(2016)_37",
  "/wiki/Doctor_Aphra_(2016)_38",
  "/wiki/Crimson_Reign_2",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/The_Truest_Duty",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Imperial_Officers_and_Agents",
  "/wiki/Special:Upload",
  "/wiki/Denon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/501st_Legion",
  "/wiki/General",
  "/wiki/Imperial_Army",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Hoth",
  "/wiki/Hoth",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Deflector_shield_generator",
  "/wiki/Echo_Base",
  "/wiki/Deflector_shield",
  "/wiki/Rogue_Squadron",
  "/wiki/Snowspeeder",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Time",
  "/wiki/Officer",
  "/wiki/Politics",
  "/wiki/The_galaxy",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Zalorian",
  "/wiki/Zaloriis_campaign",
  "/wiki/Zaloriis",
  "/wiki/Culroonian",
  "/wiki/Culroon_III_campaign",
  "/wiki/Culroon_III",
  "/wiki/Army",
  "/wiki/Imperial_officer",
  "/wiki/Marriage",
  "/wiki/Parent",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Death",
  "/wiki/Hunting",
  "/wiki/Governor",
  "/wiki/Senator",
  "/wiki/Johhar_Kessen",
  "/wiki/Captain",
  "/wiki/Kosh",
  "/wiki/Tatooine",
  "/wiki/68th_Legion",
  "/wiki/Admiral",
  "/wiki/Kendal_Ozzel",
  "/wiki/Mustafar",
  "/wiki/Anakin_Skywalker",
  "/wiki/Fortress_Vader",
  "/wiki/Sith_Lord",
  "/wiki/File:PrepareYourTroopsForASurfaceAttack.ogg",
  "/wiki/Project_Swarm",
  "/wiki/Viper_probe_droid",
  "/wiki/Major",
  "/wiki/Yaltza",
  "/wiki/Executor",
  "/wiki/Flagship",
  "/wiki/Flotilla",
  "/wiki/Death_Squadron",
  "/wiki/Professor",
  "/wiki/Rupo_Ud",
  "/wiki/Archaeology",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Deathshrine",
  "/wiki/Central_Isopter",
  "/wiki/Kartovian_Formation",
  "/wiki/Ash_Moon_1",
  "/wiki/Korin_Aphra",
  "/wiki/Imperial_Military",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Droid",
  "/wiki/Hoth_system",
  "/wiki/Anoat_sector",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Firmus_Piett",
  "/wiki/Star_system",
  "/wiki/Lightspeed",
  "/wiki/Imperial_Navy",
  "/wiki/Alliance_Military",
  "/wiki/Power_generator",
  "/wiki/Orbital_bombardment",
  "/wiki/Blizzard_Force",
  "/wiki/Mountain",
  "/wiki/Troop",
  "/wiki/Cockpit",
  "/wiki/Blizzard_1",
  "/wiki/Walker",
  "/wiki/T-47_airspeeder",
  "/wiki/Commander",
  "/wiki/Luke_Skywalker",
  "/wiki/Alliance_Army",
  "/wiki/Derek_Klivian",
  "/wiki/Cold_weather_assault_stormtrooper",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Centimeter",
  "/wiki/Stormtrooper",
  "/wiki/Armor",
  "/wiki/Imperial_officer_battle_armor",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/The_Force",
  "/wiki/Darth_Vader%27s_meditation_chamber",
  "/wiki/Meditation",
  "/wiki/Clothing",
  "/wiki/Helmet",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars",
  "/wiki/Julian_Glover",
  "/wiki/Robert_Watts",
  "/wiki/George_Lucas",
  "/wiki/Bounty_hunter",
  "/wiki/Dengar",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Endor",
  "/wiki/Garrison",
  "/wiki/Battle_of_Endor",
  "/wiki/Moon",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Blanaid",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Rebel_pilot",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Donald_F._Glut",
  "/wiki/Star_Wars_Legends",
  "/wiki/October_2",
  "/wiki/2017",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Geonosian_droid_factories",
  "/wiki/Geonosis",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/R2-D2",
  "/wiki/Battle_droid",
  "/wiki/C-3PO",
  "/wiki/Chewbacca",
  "/wiki/Nien_Nunb",
  "/wiki/Gial_Ackbar",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/Star_Wars:_Commander",
  "/wiki/Shu-Torun_Lives",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Kendal",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_Invasion_of_Echo_Base",
  "/wiki/Star_Wars_Adventures_(2020)_1",
  "/wiki/Bounty_Hunters_27",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/New_Year%27s_Hothin%27_Eve",
  "/wiki/Flight_of_the_Falcon_(episode)",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/LEGO_Classic_Star_Wars",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_6",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_24",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Star_Wars_Book",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/Star_Wars_50",
  "/wiki/Star_Wars_Insider",
  "/wiki/In_Their_Own_Words:_Making_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Insider_119",
  "/wiki/The_Empire%27s_Finest:_Who%27s_Who_in_the_Imperial_Military",
  "/wiki/Star_Wars_Insider_96",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/Star_Wars_Insider_190",
  "/wiki/Databank_(original)"
 ]
}