{
 "name": "Maz_Kanata",
 "display_name": "Maz Kanata",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Takodana"
     ]
    },
    {
     "name": "Born",
     "values": [
      "973 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Unknown"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.24 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Free Fleet",
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Maz Kanata, also known as Maz Kanata the Usurper, Kanata the Despoiler, Kanata the Benevolent and Kanata of the Free Fleet, was a Force-sensitive humanoid female who was born over a millennium before the brewing war between the First Order and the Resistance. Living in an ancient castle on the planet Takodana, Kanata gained a reputation as a \"pirate queen\" by allowing traveling smugglers to reside in her home—as long as they honored her prohibitions against politics and war. Kanata spent centuries traveling the galaxy, collecting antiques and trinkets, which she kept inside the storehouses and vaults of her castle. One notable item was the lightsaber crafted by Jedi Knight Anakin Skywalker during the Clone Wars, and later wielded by Skywalker's son, Luke, who was instrumental in toppling the Galactic Empire.\nThirty years after the Empire's defeat at the Battle of Endor, the smuggler Han Solo brought Rey, a scavenger from the desert planet Jakku, to Kanata's castle. Kanata took interest in the girl, and when the Skywalker lightsaber called out to Rey through the Force, the smuggler queen told the scavenger to keep the weapon. However, Rey refused, and shortly before stormtroopers of the First Order arrived looking for her she fled the castle. During the ensuing battle, Kanata's castle was destroyed, and Rey was taken prisoner, so Kanata entrusted the lightsaber to Finn, a former First Order stormtrooper who abandoned his previous occupation, choosing to help the Resistance.\nBorn over a millennium before the conflict between the First Order and the Resistance, Maz Kanata was a Force-sensitive female who learned to live and thrive in the criminal underworld of the galaxy. Living on her homeworld, the planet Takodana, Kanata resided in a lakeside castle which was home to the ancient protocol droid ME-8D9, nicknamed \"Emmie.\" The castle was a battleground between ancient Jedi and Sith, and with time, Emmie was rumored to have started out with the Jedi Order. Relatively late during Kanata's stay on Takodana, she married, and her husband gifted her a statue in her image. The statue remained at the castle until the time of the First Order–Resistance conflict, although the marriage did not last.\nA thousand years before the First Order–Resistance conflict, Kanata became reputed as a \"pirate queen,\" giving credits, equipment, and connections to young smugglers, often allowing them a day in her home for free or a long-term stay for rent. She held sway over more than a thousand ports when the Galactic Republic was still young. In addition to hosting smugglers and pirates, Kanata housed traveling musicians, and she hired a majordomo who oversaw the castle's activities and a kitchen crew headed by the Artiodac chef Strono Tuggs, who stayed with Kanata's castle for centuries.\nUnlike her chef, however, Kanata spent centuries of her life traveling the galaxy collecting antiques and other treasures. She kept her collection of countless trinkets in the storehouses and vaults of her castle, and she protected items that spoke to her through the Force, believing that relics from the past could impact the future. In addition to these items, she had come into possession of other numerous treasures which she then stored within buried vaults armed with antitamper subspace alarms located all across the galaxy. She began to designate the locations on her Smuggler's Guide, a logbook of her own making. At some point, Kanata was part of the Free Fleet.\nDuring the High Republic Era, three criminals delivered a baby Aloxian to Takodana Castle hoping that she would be able to handle him, the criminals themselves having become terrified of the child. Initially assuming that the three were up to shenanigans, Kanata was surprised when she opened the box to find the infant Qort inside. Bringing him inside the castle, Kanata enlisted the help of her loadlifter droid steward HURID-327, but despite HURID's best efforts Qort would not stop crying.\nWhen Kanata went off to get some milk to feed the child with, Qort used his natural strength and untrained Force powers to incapacitate the droid, leaving him in pieces on the floor, before escaping to Takodana Castle's basement storerooms. There, Qort found a vonduun crab skull Kanata had been given by her friend Farks, putting it on just before Kanata found him, having been directed after the child by HURID. Calmed by the helmet, Qort would not remove it and did not destroy anything else.\nTrying to discover the origins of the child, Kanata called on Farks for information about the skull, and the Patrolian told her about the Aloxians and the importance of the helmets to their culture. Farks further speculated that the child had been kidnapped by Argoban raiders, who were known for such practices. Kanata, deciding that the information changed things, decided to get some assistance from Sav Malagán, a Jedi Master stationed at the nearby Jedi Temple and a long-time friend of hers. Qort's Force-sensitivity was eventually discovered, and he was taken in by the Jedi Order.\nYears later, following a debacle at Vrant Tarnum by Krix Kamerat, the leader of a Nihil specialized cell, the Eye of the Nihil Marchion Ro ordered him to find a way to prove himself after, who chose to attack Takodana, which had a Jedi Temple, in the hopes of destroying the temple and demonstrating to the Maz Kanata that the Nihil were the only true marauders in the area. The lone Jedi at the Takodana temple, Sav Malagán, was able to drive off the first wave of the attack, but called for reinforcements from Starlight Beacon as she knew the Nihil would return.\nKanata and Malagán soon welcomed a group of Jedi Padawan reinforcements that arrived from the Star Hopper to the temple, which included Qort. The Padawans helped set up defenses at the temple. Due to Nihil infiltration, the temple was destroyed, and along with it, Qort's mask. With the block on his abilities removed, Qort took to the skies and fought off the Nihil with his lightsaber as Kanata and Malagán watched on.\nKanata's connection to the Force acquainted her with members of the Jedi Order and protected her from danger, but following Darth Sidious' rise to power, the formation of the Galactic Empire, and the execution of all Jedi, Kanata kept her abilities a secret. However, the Empire was challenged by the Alliance to Restore the Republic. Nineteen years after the New Order's creation, it suffered a major loss during the Battle of Yavin when Luke Skywalker, son of Jedi Knight Anakin Skywalker, destroyed the Death Star, a massive Imperial superweapon. Prior to that event, Kanata's voice was heard by Ezra Bridger in 1 BBY during his mission to a place that existed between time and space.\nShortly after the Battle of Yavin, Kanata discovered that the Empire had been collecting an unsettling amount of information on her. To prevent them from learning too much, she hired a mercenary via hologram to strike selected Imperial targets on six worlds: Tatooine, Dandoran, Er'Kit, Hoth, Yavin 4, and her home of Takodana. The mercenary was successful in completing Kanata's objectives, so she rewarded the gunman by employing an Ithorian saboteur to work for them.\nIn 4 ABY, sometime before the climactic Battle of Endor, Kanata traveled to Ord Mantell where she was reunited with her \"boyfriend,\" the Wookiee Chewbacca, and helped Leia Organa to infiltrate into Jabba's Palace to rescue Han Solo from Jabba the Hutt by suggesting she disguise herself as the bounty hunter Boushh.\nAfter Sidious was killed by former Jedi Anakin Skywalker during the Battle of Endor, Kanata felt again comfortable sharing her Force-sensitivity. Not long after the battle, Kanata once more made the acquaintance of Solo, serving him Parkellan Slings and admonishing him for not bringing Chewbacca. Correctly guessing that he was there for something, she interrogated him and was told that he was meeting an Imperial defector, Ralsius Paldora, regarding information that would help him free the Wookiees on Kashyyyk, who were still suffering under Imperial rule.\nWarning Solo of dire consequences should he bring the Empire's attention to her doorstep, Kanata pointed him in the direction of the crowd. Unfortunately, the Empire did indeed arrive on Takodana looking for their pilfered information and Kanata immediately assumed Solo was responsible, reminding him of her one absolute rule. She later contacted him for a further tongue-lashing when Imperial air reinforcements, consisting of a light cruiser and multiple TIE fighters, appeared over Nymeve Lake, ordering him to clean up his mess  and then to leave once the Imperials were dealt with.\nIn 5 ABY, Kanata's home was visited by Romwell Krass Junior, an Imperial Security Bureau agent who had narrowly escaped a New Republic attack on the Hyborean Moon which took the lives of his family and friends. On the third day of his stay, Krass was drinking at Kanata's bar when he saw a New Republic pilot. Krass assaulted the man, blaming the pilot for his family's death. The fight was stopped by Emmie, who informed the two that they had violated the castle rules; as such, she rendered them unconscious and brought them to cells within the castle's dungeon.\nWhen the two awoke, they began yelling at each other, before Kanata arrived and told them to be silent. Retrieving a step-stool from the wall, Kanata climbed to look through the windowed door of Krass' cell, adjusting her goggles and telling the Imperial to come closer. As she examined Krass, she told him that she saw his suffering, as well as the suffering caused by him. Declaring that the Empire was dead, Kanata unlocked the cell, telling Krass to leave the castle and find peace. After the Imperial left, Kanata granted the pilot freedom, and she went to meditate on a parapet overlooking Nymeve Lake. Emmie joined the pirate, stating that the castle was at peace. Kanata, responding that her heart was not at peace, told Emmie that the Force felt off balance. Requesting that the droid prepare her starship, the Tua-Lu, for flight, Kanata added that she wished to look around the galaxy and see what she could see.\nIn the time that followed, Skywalker's son, Luke, the last remaining Jedi, began training a new generation of warriors. However, Skywalker vanished when his Jedi were destroyed by Kylo Ren, a pupil of his who went on to lead the First Order, the organization born from the Empire's remnants. At some point in her travels, Kanata acquired Skywalker's lightsaber, which was constructed by Anakin and later wielded by Luke. Cognisant of the lightsaber's greatness, Kanata stored the weapon in an ancient, wroshyr wood curio box, along with a four-thousand-year-old hyperspace sextant, a fusioncutter head, and a diatium power cell.\nDuring the rise of the First Order, Kanata was visited by Solo, an old friend of hers. When Solo entered the castle, Kanata greeted him by shouting his name, temporarily halting the tavern's activity. Kanata approached Solo and inquired about the absence of Chewbacca—Solo's first mate and Kanata's Wookiee \"boyfriend\" of over thirty-one years. Solo, who was accompanied by Rey, Finn, and BB-8, which were a young scavenger from the desert world Jakku, a defecting First Order stormtrooper, and a Resistance astromech droid, respectively, explained that Chewbacca was making repairs to their starship, the Millennium Falcon. Assuming that Solo needed desperate help with something, Kanata led the group to a table to eat and discuss their dilemma.\nSolo explained that the droid BB-8 contained a map leading to Luke Skywalker, and that it needed to be delivered to his wife, Resistance General Leia Organa, with whom Solo was estranged. Kanata refused, saying that Solo had been avoiding the fight for too long, and he needed to go home. Finn objected Kanata's answer, while Rey asked Kanata what \"fight\" she was referring to. Kanata explained that there was only one fight: the fight against the dark side of the Force, which took the form of the Sith, the Empire, and the First Order. Kanata went on to argue that they should all oppose the spreading of the First Order, but Finn insisted that a fight against the First Order could not be won. As Finn spoke, Kanata adjusted her variable lens corrective goggles, crawled up onto the table, and looked into Finn's eyes, saying that he had the eyes of a man who wanted to run. Finn, telling Kanata she did not know the things he had seen, suggested that they all needed to run. Resigned, Kanata climbed down from the table and directed Finn to Sidon Ithano and Quiggold, two pirates who would trade work for transportation to the galaxy's Outer Rim Territories. Finn stood up and left, and when Rey went after him, Kanata asked Solo who she was.\nThe smuggler informed Kanata that Rey lived alone on Jakku, and that the scavenger wished to return there, believing her family would be coming back. Kanata went to speak with Rey, finding the human with BB-8 in a lower level hall, stumbling out of a storeroom and looking shaken. Rey, who had a vision after coming into contact with the Skywalker lightsaber, asked Kanata what it was, saying she regretted entering the room. Kanata explained that the lightsaber belonged to Luke and his father before him, and it was then calling to her. Rey responded by insisting she return to Jakku, but Kanata, removing her goggles and taking the girl's hand, told her that she already knew the truth: whomever Rey was awaiting would never come back. However, Kanata added that while no one from Rey's past was returning, there was someone who still could, so Rey replied that the person was Luke Skywalker.\nMaz then told Rey, that what she sought was not behind her, but ahead. Kanata admitted that she was not a Jedi herself, but she still knew the Force, explaining that it moved through and surrounded every living thing. Instructing Rey to close her eyes and feel the light side of the Force, the pirate told the scavenger that it would always guide her, and that the girl should keep the lightsaber. However, Rey stated that she would never touch the weapon again, and that she wanted nothing to do with the Force. Kanata stammered as Rey, followed by BB-8, quickly left the hall, leaving the pirate alone with her thoughts: one could teach knowledge, skills, and even the Force, but not patience.\nShortly after Rey left, patrons of the castle hurried outside to witness the destruction of the New Republic's capital, Hosnian Prime, visible in the sky above. Finn deduced it was an act of the First Order, and he regrouped with Solo and Chewbacca, asking where Rey was. Kanata approached the group and told them that Rey was where she needed to be, and said there was something they should see. The pirate led them to the storeroom where Rey was, and she presented the lightsaber to Finn. Solo, who had been a close friend of Luke's, asked where Kanata got the weapon, but Kanata dismissed him, saying it was a story for another time. Telling Finn to find Rey, Kanata passed the lightsaber to him. But before they left the room, the castle shook, signaling the arrival of the First Order, and the hallway collapsed as First Order TIE fighters leveled the castle.\nLed by Chewbacca, the four cleared a tunnel to the surface, where the Wookiee and Solo immediately joined the battle against the First Order troops. Finn and Kanata exited next, and the pirate ordered Finn to find and help Rey and BB-8. However, Finn insisted that he needed a weapon first, so Kanata reminded him that he already had one, seizing his wrist that held the lightsaber. Finn activated the blade and entered the fight alongside Solo and Chewbacca until forces of the Resistance arrived to provide support. However, despite the Resistance's arrival and the retreat of the First Order's forces, Finn was unable to prevent Rey from being taken captive by Kylo Ren. In the battle's aftermath, Kanata spoke with BB-8, telling the droid that although the First Order took Rey, they could not give up hope, and the Resistance needed the astromech's help. Kanata then walked over to Finn, joking that she had some cleaning up to do. Looking up at Finn, Kanata smiled with satisfaction, noting that she no longer saw the eyes of a coward, but the eyes of a warrior.\nAfter the destruction of her castle, Kanata resumed her life of adventure whilst the Resistance continued their struggle against the First Order. When the Resistance fleet was tracked through hyperspace and picked off one ship at a time, Finn and technician Rose Tico departed the fleet in order to find someone capable of breaking through the clearance codes for an infiltration of the First Order's flagship, the Mega-class Star Dreadnought Supremacy. Finn contacted Kanata, who was unable to help them personally as she was involved in what she referred to as a \"union dispute,\" actually a firefight, the details of which were something they did not want to know.\nBy that point, Kanata had already endured sixty-seven injuries, from which twenty-two were considered life-threatening, having gone through a plethora of treatments over a millennium of life, was still remaining on her feet nevertheless. However, she was able to recommend a Master Codebreaker whom she knew was capable of cracking anything. Pointing the two in the direction of Canto Bight, a luxury city resort, Kanata told them that the codebreaker could be identified by a red flower lapel pin before cutting off the transmission.\nFollowing the Battles of Crait and Grail City, Maz told Poe Dameron it was not yet her time to join the Resistance. Eventually, she had joined the Resistance at their new base on Ajan Kloss, acting as an advisor to Leia and other Resistance members. After learning that Darth Sidious had returned with the Final Order, a massive fleet of Xyston-class Star Destroyers designed by the Sith Eternal, and was planning to attack the free worlds, Maz advised the only way stop him was to find Exegol. When Leia sensed Rey and her son, Kylo Ren dueling on Kef Bir, Maz knew that the only way for Leia to save her son would be to use all the strength she had left to reach him. When Leia passed away, Maz and other members of the Resistance gathered around her body to bid her farewell. Maz was also present when Leia's body became one with the Force. When the Resistance returned from victory on Exegol, Maz welcomed Chewie home and presented him the Medal of Bravery.\nKanata was a humanoid alien who stood at a height of 1.24 meters . She had brown eyes, wispy white hair, and burnt-orange skin. Her face was wrinkled by centuries of hearty laughter and kind smiles. Due to the pirate's millennia-long lifespan, decades were like brief moments in time for her.\nAs a poet and painter, Kanata took delight in all forms of art, so she offered board to traveling musicians in exchange for their performances. One such musician was Infrablue Zedbeddy Coggins, an alien who played the hypolliope horn cluster in a quartet alongside Taybin Ralorsa, Ubert Quaril, and Sudswater Dillifay Glon. Kanata also allowed a variety of scoundrels to stay in her castle, but only if they obeyed her prohibitions against war and politics, as well as her only spoken rule: \"All are welcome. ,\" a mantra written in a hundred different languages on a wall beyond her bar. Individuals who broke the castle law were subjected to Kanata's sentences, which ranged from being locked in her dungeon to potentially being ejected from the airlock of the Tua-Lu. The hostess took a liking to one particular scoundrel, the Wookiee Chewbacca, whom she jokingly referred to as her boyfriend.\nFrom her castle, Kanata witnessed the rise and fall of galactic powers, which she attributed to the delicate balance between the light and dark sides of the Force. Although Kanata chose not to train as a Jedi, she had a strong connection to the Force, giving her the preternatural gift of sensing changes of fortune throughout the galaxy. Kanata's powers also allowed her to feel the presence of others, demonstrated when she sensed Solo's return.\nIn addition to speaking Galactic Basic Standard, Kanata could speak an alien dialect.\nSpending centuries of her life traveling the galaxy, Kanata owned many starships, including the Tua-Lu—also known as the Stranger's Fortune—and the Epoch Swift. During her travels Kanata collected countless antiqued trinkets and treasures, notably including Skywalker's lightsaber. She stored the lightsaber in an ancient, unlocked wroshyr wood curio box, along with her other dearest treasures: a four-thousand-year-old hyperspace sextant, a fusioncutter head, and a diatium power cell. The box was kept behind the closed door of a basement storeroom, a vault which also contained a bust of Cherff Maota, a Jedi Master of old.\nKanata's millennia-old castle was located on the edge of a primordial forest along the shore of Nymeve Lake, a freshwater body and battle site between ancient Sith and Jedi. The stone fortress had a trapezoidal architecture, considered both impressive and beautiful. Despite the castle's age, it was modernized with sensor arrays and communications gear that allowed its owner to stay connected with the rest of the galaxy. Kanata enjoyed the technological contrast between her castle and the surrounding forest, and she viewed it as the manifestation of a cosmic balance. Towers of the castle also held prayer flags hung by deep-space explorers, and the entrance to Kanata's castle was adorned with various flags and banners which represented hundreds of cities, civilizations, and guilds; among them were a flag of the Ohnaka Gang, the emblem of the Broken Horn Syndicate, Mandalorian war banners, and podracing pennants . Directly above the sectioned metal door was a towering statue of the pirate queen with her arms outstretched, a gift from Kanata's former husband.\nThe smuggler dressed practically, and at the time of Solo and Rey's visit Kanata wore clothes she knitted herself: colorful socks, baggy maroon pants held by a leather belt, a dark gray vest over a blue-green sweater, and a simple gray cap. Attached to Kanata's cap were large, variable lens corrective goggles, and her silver-buckled belt suspended an assortment of technology, including a compact blaster pistol. The pirate also wore a beaded necklace and a large number of rings and bracelets, such as the Bracelet of the Sutro.\nFollowing The Walt Disney Company's acquisition of Lucasfilm Ltd., the production company announced on October 30, 2012 that it would begin work on a Star Wars sequel trilogy of films, starting with Star Wars: Episode VII The Force Awakens, directed by J.J. Abrams. In March 2013, preliminary screenwriter Michael Arndt realized a \"Yoda-like mentor figure\" for the protagonists, the character which became Maz Kanata. Earlier in the production, Abrams and co-production designer Rick Carter had discovered they shared a common teacher: award-winning high school instructor Rose Gilbert, who taught until her retirement at the age of 94. In tribute to their teacher, the character of Kanata was based off of Gilbert, and in order to prevent spoilers, crew members referred to Kanata as \"Rose\" while on set. To help capture the wise, timeless spirit of Gilbert, Christian Alzmann, a concept artist at Industrial Light \u0026 Magic , kept pictures of the teacher spread throughout the ILM work stations.\nConcept work for Kanata began in March 2013, and Alzmann sketched the character as a member of Yoda's species. As of May 2013, Alzmann drew the character as a hunched, green alien with a headdress, and in June, the artist redesigned Kanata's face to be bug-eyed and snub-nosed; during pre-production in July, Kanata's character was characterized as a \"guru.\" During the film's production phase, Kanata was to be realized as a puppet or animatronic character, but the crew ran short on time—in part from an injury Harrison Ford received on set—so Abrams decided to create Kanata using computer graphics . According to Abrams, CG also allowed the team more time to agree on a design, and it removed limitations that a practical character would have had.\nIn June 2014, costume concept artists Glyn Dillon, Dermot Power, creature concept designer Jake Lunt Davies, and senior sculptor Luke Fisher were tasked with creating a \"fortuneteller\" look for Kanata, so they designed a sequin-covered shawl—along with the goggles and wrinkles that ended up in the film. In October 2014, Fisher sculpted a maquette of Kanata, which was then painted by creature paint finish designer Henrik Svensson to finalize the design.\nOn June 2, 2014, Lucasfilm announced the casting of Lupita Nyong'o, an actress who won an Academy Award for Best Supporting Actress for her work in the film 12 Years a Slave. Nyong'o would go on to play the character in all the films of the sequel trilogy. According to Nyong'o, she was primarily interested in the role of Maz Kanata because of the motion capture aspect—something she had wanted to do ever since seeing Andy Serkis portray Gollum in The Lord of the Rings. Since Nyong'o had no prior experience in motion capture, she was coached by Serkis, who played the character of Supreme Leader Snoke, the film's antagonist. Every morning of filming The Force Awakens, Nyong'o would have 149 dots applied to her face, an experience she described as \"alienating\" because of the suit's distracting nature and her unfamiliarity with motion capture. For The Rise of Skywalker, an animatronic was built that utilized multiple puppeteers.\nThe character of Maz Kanata was generally praised by critics, such as Scott Mendelson of Forbes, who felt that Kanata was the center of the film's best scene, and Stephanie Zacharek of Time magazine, who saw Kanata as \"the love child of E.T. and Lena Horne.\" Conversely, Matt Goldberg of Collider.com criticized the character's design, definition, and role, calling Kanata the film's \"bar-owner/Yoda stand-in/exposition mouthpiece.\" Nyong'o's portrayal of Maz Kanata was nominated for a Visual Effects Society award for Outstanding Animated Performance in a Photoreal Feature, and Nyong'o was also nominated for a Saturn Award for Best Supporting Actress.\nIn Star Wars: Episode IX The Rise of Skywalker, Claire Roi Harvey was Kanata's physical performer and Richard Coombs vocalized her lines.\nFor the film's soundtrack, composer John Williams wrote \"Maz's Counsel,\" a three-minute and seven-second-long piece associated with Kanata. The song is first used in the scene in which Kanata looks into Finn's eyes, and the composition is later used when Kanata speaks to Rey about the Skywalker lightsaber. During the latter scene, \"Maz's Counsel\" briefly incorporates \"The Force Theme\" and \"Rey's Theme.\"\nOn April 20, 2016, Kanata appeared in \"Hunting for Han,\" the third episode of LEGO Star Wars: The Resistance Rises, a series of LEGO short films which aired on Disney XD. In the show, Kanata was voiced by Grey Griffin, who reprised the role for \"The Test,\" the eighth episode of LEGO Star Wars: The Freemaker Adventures which aired on July 25, 2016. In addition to Griffin's voice work, Marc Thompson provided Kanata's voice for the audiobook of the novel Aftermath: Life Debt, which was written by Chuck Wendig for The Aftermath Trilogy and released July 12, 2016.\nIn the trailer for The Force Awakens, Kanata is heard asking Rey who she is, to which the girl responds, \"I'm no one.\" Although the piece of dialogue was cut from the final edit of the film, it appears in The Force Awakens: Rey's Story, a junior novel adaptation written by Elizabeth Schaefer. In this version, Kanata is introduced to Finn and Rey, and when Rey reveals herself to be a scavenger, Kanata excitedly deduces that the girl knows machines. Enthusiastically, Kanata tells Rey that each component of a machine has a purpose for being, and the diminutive pirate asks Rey what her purpose is.\nAnother scene removed from the film, titled \"Tunnel Standoff,\" begins with Kanata, Solo, Finn, and Chewbacca hurrying from the storeroom in Kanata's castle, when they are found by stormtroopers. Ordered by Supreme Leader Snoke to take the four as prisoners, the stormtroopers command Solo, Finn, and Chewbacca to surrender their weapons. However, Solo plays coy, mispronouncing \"Snoke\" as \"Smoke\" and asking what makes him \"supreme.\" The lead stormtrooper again orders Solo to hand over his blaster, and Solo replies that \"it's broken.\" According to Chris Corbould, the special effects supervisor for The Force Awakens, the rough cut of this scene concluded with Kanata using the Force to collapse the ceiling on the First Order troops.\nIn a third deleted scene which followed the attack on Kanata's castle, the character travels to the Resistance base on D'Qar and presents Skywalker's lightsaber to Organa; a prominent shot of this scene was used in The Force Awakens' second teaser trailer. However, Abrams realized that the scene was unnecessary, saying that Kanata would have had nothing to do at the base, and it would not have added to the story.\nThe reference books Star Wars: The Force Awakens: The Visual Dictionary and Star Wars Character Encyclopedia: Updated and Expanded mention that Kanata hadn't seen Han Solo in 25 years before he visits her castle in The Force Awakens. Lucasfilm Story Group member Matt Martin stated that he felt that the statement was based on a line in early draft of The Force Awakens but was removed, but still made it into those books due to those timelines.\nIn a limited-time promotion for the mobile game Star Wars: Commander, a series of missions titled \"Maz's Objectives\" was made available on March 24, 2016. The objectives were eligible to players with a headquarters of level four and up, and completing a mission set awarded players with unique Supply Crates called \"Maz's Curio Boxes,\" which contained new playable units. For players allied with the Rebel Alliance, the Curio Boxes contained \"Ithorian Infiltrators,\" while players allied with the Galactic Empire received \"Kubaz Invaders. These objectives were entirely optional, and not required to complete the campaign mode\"\nOutside of the character's canonical appearances, Kanata appears in various LEGO releases, including LEGO Star Wars: The Freemaker Adventures, LEGO Star Wars: The Resistance Rises, and LEGO Star Wars: The Force Awakens. While these appearances are not a part of the official Star Wars canon, they are set in a unique, continuous universe.\nSet during the Galactic Civil War, The Freemaker Adventures shows Kanata meeting the titular Freemaker family when their ship, the StarScavenger, crashes outside her castle. The crash landing causes damage to a ship owned by the pirate Hondo Ohnaka, and the Dowutin Grummgar brings the pilot responsible, Zander Freemaker, into the castle to meet with the Weequay pirate captain. Encountering Ohnaka, Grummgar restrains Zander, and Ohnaka tells him that the damages must be paid for. Zander replies that he has no money, and Ohnaka replies that he will also accept blood, limbs, or next of kin as payment. Zander's younger brother, Rowan, attacks Grummgar, demanding that his brother be set free. Grummgar lifts Rowan up with one hand, and Ohnaka jokes that the boy would make a good crew member if he were taller. As Ohnaka laughs, Kanata notices the commotion and throws a mug at the pirate, hitting him in the head. Picking up another cup threateningly, Kanata walks toward Ohnaka, affirming that he will not cause any trouble in the castle, something he has done before. Stopping Ohnaka as he begins to act coy, Kanata comments that the last incident involving him had her pulling teeth out the castle walls for weeks. Agreeing to work out the problem peacefully, Ohnaka begins to make a deal with Kordi Freemaker, so Kanata leaves them and enters through a door to another room. However, as the door opens, Rowan senses a crystal of the Kyber Saber, an ancient Jedi weapon, and he follows Kanata. Just before Rowan enters the room, Kanata stops him, asking if he is lost and stating that only she is allowed in there. Rowan apologizes, saying he thought he felt something. Kanata inquires what he felt, but Rowan changes his mind and leaves.\nThe Freemakers embark on Ohnaka's mission to recover three golden orbs from the third moon of Takodana, but they choose to return empty-handed when they learn the orbs are varactyl eggs. When Kordi offers to try another deal instead, Ohnaka scoffs, and as he orders his crew to kill the Freemakers, Kanata enters the room and throws another mug at his head. Kanata, who overheard that Ohnaka sent kids to do a dangerous task, approaches the Weequay, again striking him with a mug and pushing him towards the castle's exit, telling him not to come back until she is no longer angry. When Ohnaka tries convincing Kanata to let him stay, she hits twice more before he leaves. Remarking that there is no decency left in the galaxy, she instructs the three Freemakers to follow her into the other room. Saying that their presence is bad for business, Kanata offers to provide them with what they need to leave the planet. Zander requests a quantum field regulator, and Kanata opens a drawer and asks him what type he needs. Slightly confused, Zander asks for a double-A type for a Class-D salvage ship, and to his surprise, Kanata removes one from the drawer. Running to the drawer, Zander asks what else she has, but Kanata dismisses him and turns her attention to Rowan. Commenting how she likes his smile and the way he confronted Ohnaka, Kanata opens a locked drawer and removes a Kyber Saber crystal. She presents it to the excited boy, explaining that she found it on Rodia ages ago. When Kordi asks how they can thank Kanata, the pirate says that they can leave. As she escorts them out the door, Kanata tells the Freemakers that they are nice kids, but that her castle is not a place for nice or kids. Rowan is the last to exit, and Kanata stops to tell him that searching for the Kyber crystals is a noble quest, adding that when they inevitably get desperate they should seek the \"Maker of Zoh.\" When Rowan asks what she means, Kanata acts senile, says bye, and hurries into her castle.\nIn The Resistance Rises, which is set after the Galactic Civil War, the pirate Bala-Tik meets with Kanata to complete a trade: a concealed item Kanata wants in her collection, for the location of Solo . However, nearly everybody in Kanata's castle has been cheated by Solo, and the patrons begin to argue over who was swindled the worst. A brawl quickly erupts, and when Kanata's genuine \"Princess Leia Battle of Endor speeder bike\" breaks as a result, Kanata becomes enraged, retrieving the Skywalker lightsaber, cutting the ceiling's masonry to fall on her quarreling guests, and declaring the fight to be over. With the commotion stopped, a hooded individual tells the patrons that Solo's ship was last sighted on Jakku, and that the smuggler would not stay in one place for long. As the criminals race out the castle's door, Kanata approaches the figure, immediately recognizing him to be Lando Calrissian. The two collect the case Bala-Tik left behind and open it to reveal two musical instruments. Kanata begins to play, and she invites Calrissian to join, who gladly accepts.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/Star_Wars:_The_High_Republic_Adventures:_Back_Together_and_Away_Again",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Han_Solo_%26_Chewbacca_6",
  "/wiki/Pirate%27s_Price",
  "/wiki/Bounty_Hunted",
  "/wiki/Last_Shot",
  "/wiki/Maz%27s_Scoundrels",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Fake_It_Till_You_Make_It",
  "/wiki/Force_Collector",
  "/wiki/Choose_Your_Destiny:_A_Maz%27s_Castle_Mission",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Resistance_Reborn",
  "/wiki/Choose_Your_Destiny:_A_Finn_%26_Poe_Adventure",
  "/wiki/Flight_of_the_Falcon,_Part_5:_Grand_Theft_Falcon",
  "/wiki/Halcyon_Legacy_4",
  "/wiki/Tales_from_Wild_Space:_Win/Lose",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Takodana",
  "/wiki/973_BBY",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Force-sensitive",
  "/wiki/Humanoid",
  "/wiki/Reproduction",
  "/wiki/Millennium",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Takodana_Castle",
  "/wiki/Planet",
  "/wiki/Pirate_king",
  "/wiki/Smuggler",
  "/wiki/Politics",
  "/wiki/Standard_century",
  "/wiki/The_galaxy",
  "/wiki/Collector",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Clone_Wars",
  "/wiki/Luke_Skywalker",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Han_Solo",
  "/wiki/Rey_Skywalker",
  "/wiki/Scavenger",
  "/wiki/Desert",
  "/wiki/Jakku",
  "/wiki/Lightsaber",
  "/wiki/The_Force",
  "/wiki/Queen",
  "/wiki/Stormtrooper",
  "/wiki/Battle_of_Takodana",
  "/wiki/Finn",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Homeworld",
  "/wiki/Protocol_droid",
  "/wiki/ME-8D9",
  "/wiki/Battle_of_Takodana_(Jedi_versus_Sith)",
  "/wiki/Jedi",
  "/wiki/Sith",
  "/wiki/Time",
  "/wiki/Jedi_Order",
  "/wiki/Marriage",
  "/wiki/Maz_Kanata%27s_husband",
  "/wiki/Credit",
  "/wiki/Standard_day",
  "/wiki/Galactic_Republic",
  "/wiki/Pirate",
  "/wiki/Musician",
  "/wiki/Unidentified_castle_majordomo",
  "/wiki/Artiodac",
  "/wiki/Chef",
  "/wiki/Strono_Tuggs",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/High_Republic_Era",
  "/wiki/Youngling",
  "/wiki/Aloxian",
  "/wiki/Qort",
  "/wiki/Loadlifter_droid",
  "/wiki/HURID-327",
  "/wiki/Milk",
  "/wiki/Force_power",
  "/wiki/Droid",
  "/wiki/Vonduun_crab/Legends",
  "/wiki/Bone",
  "/wiki/Farks",
  "/wiki/Patrolian",
  "/wiki/Argoban",
  "/wiki/Sav_Malag%C3%A1n",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_Temple_(Takodana)",
  "/wiki/Vrant_Tarnum",
  "/wiki/Krix_Kamerat",
  "/wiki/Nihil",
  "/wiki/Krix_Kamerat%27s_cell",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Marchion_Ro",
  "/wiki/Attack_on_Takodana",
  "/wiki/Jedi_temple",
  "/wiki/Starlight_Beacon",
  "/wiki/Padawan",
  "/wiki/Star_Hopper",
  "/wiki/Darth_Sidious",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Ezra_Bridger",
  "/wiki/1_BBY",
  "/wiki/World_Between_Worlds",
  "/wiki/Realspace",
  "/wiki/Star_Wars:_Commander",
  "/wiki/Saponza%27s_partner",
  "/wiki/Hologram",
  "/wiki/Dandoran",
  "/wiki/Er%27Kit",
  "/wiki/Hoth",
  "/wiki/Yavin_4",
  "/wiki/Mercenary",
  "/wiki/Ithorian",
  "/wiki/Saboteur",
  "/wiki/4_ABY",
  "/wiki/Ord_Mantell",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Bounty_hunter",
  "/wiki/Boushh",
  "/wiki/Death",
  "/wiki/Endor",
  "/wiki/Parkellan_Sling",
  "/wiki/Ralsius_Paldora",
  "/wiki/Liberation_of_Kashyyyk",
  "/wiki/Kashyyyk",
  "/wiki/Skirmish_on_Takodana",
  "/wiki/Nymeve_Lake",
  "/wiki/5_ABY",
  "/wiki/Romwell_Krass_Junior",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Agent",
  "/wiki/New_Republic",
  "/wiki/Attack_on_the_Hyborean_Moon",
  "/wiki/Hyborean_Moon",
  "/wiki/Unidentified_New_Republic_pilot",
  "/wiki/Pilot",
  "/wiki/Starship",
  "/wiki/Tua-Lu",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Ben_Solo",
  "/wiki/Wroshyr_wood",
  "/wiki/Maz%27s_Curio_Box",
  "/wiki/Hyperspace_sextant",
  "/wiki/Fusioncutter",
  "/wiki/Diatium_power_cell",
  "/wiki/Cantina",
  "/wiki/First_Mate",
  "/wiki/BB-8",
  "/wiki/Astromech_droid",
  "/wiki/Millennium_Falcon",
  "/wiki/General",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Goggles",
  "/wiki/Eye",
  "/wiki/Sidon_Ithano",
  "/wiki/Quiggold",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Human",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Capital",
  "/wiki/Hosnian_Prime",
  "/wiki/Atmosphere",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Troop",
  "/wiki/Poe_Dameron",
  "/wiki/Rose_Tico",
  "/wiki/Flagship",
  "/wiki/Mega-class_Star_Dreadnought",
  "/wiki/Supremacy",
  "/wiki/Master_Codebreaker",
  "/wiki/Canto_Bight",
  "/wiki/Battle_of_Crait",
  "/wiki/Battle_of_Grail_City",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Ajan_Kloss",
  "/wiki/Final_Order",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Sith_Eternal",
  "/wiki/Exegol",
  "/wiki/Kef_Bir",
  "/wiki/Medal_of_Bravery",
  "/wiki/Alien",
  "/wiki/Poet",
  "/wiki/Artist",
  "/wiki/Infrablue_Zedbeddy_Coggins",
  "/wiki/Hypolliope_horn_cluster",
  "/wiki/Taybin_Ralorsa",
  "/wiki/Ubert_Quaril",
  "/wiki/Sudswater_Dillifay_Glon",
  "/wiki/Airlock",
  "/wiki/Galaxy",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Language",
  "/wiki/Epoch_Swift",
  "/wiki/Cherff_Maota",
  "/wiki/Tree",
  "/wiki/Water",
  "/wiki/Sensor_array/Legends",
  "/wiki/Cosmic_Force",
  "/wiki/Prayer_flag",
  "/wiki/City",
  "/wiki/Ohnaka_Gang",
  "/wiki/Broken_Horn_Syndicate",
  "/wiki/Mandalorian",
  "/wiki/Podracing",
  "/wiki/Dug",
  "/wiki/Sebulba",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Limb",
  "/wiki/Clothing",
  "/wiki/Knitting",
  "/wiki/Leather",
  "/wiki/Belt",
  "/wiki/Hat",
  "/wiki/Blaster_pistol",
  "/wiki/Necklace",
  "/wiki/Ring",
  "/wiki/Bracelet",
  "/wiki/Bracelet_of_the_Sutro",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/October_30",
  "/wiki/2012",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/J.J._Abrams",
  "/wiki/March",
  "/wiki/2013",
  "/wiki/Michael_Arndt",
  "/wiki/Yoda",
  "/wiki/Rick_Carter",
  "/wiki/Rose_Gilbert",
  "/wiki/Christian_Alzmann",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Yoda%27s_species",
  "/wiki/May",
  "/wiki/June",
  "/wiki/July",
  "/wiki/Harrison_Ford",
  "/wiki/2014",
  "/wiki/Glyn_Dillon",
  "/wiki/Dermot_Power",
  "/wiki/Jake_Lunt_Davies",
  "/wiki/Luke_Fisher",
  "/wiki/October",
  "/wiki/Henrik_Svensson",
  "/wiki/June_2",
  "/wiki/Lupita_Nyong%27o",
  "/wiki/Andy_Serkis",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Star_Wars:_The_Force_Awakens_(soundtrack)",
  "/wiki/John_Williams",
  "/wiki/The_Force_Theme",
  "/wiki/Rey%27s_Theme",
  "/wiki/April_20",
  "/wiki/2016",
  "/wiki/Hunting_for_Han",
  "/wiki/LEGO_Star_Wars:_The_Resistance_Rises",
  "/wiki/LEGO",
  "/wiki/Disney_XD",
  "/wiki/Grey_Griffin",
  "/wiki/The_Test",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/July_25",
  "/wiki/Marc_Thompson",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Chuck_Wendig",
  "/wiki/Star_Wars:_The_Aftermath_Trilogy",
  "/wiki/July_12",
  "/wiki/The_Force_Awakens:_Rey%27s_Story",
  "/wiki/Elizabeth_Schaefer",
  "/wiki/Blaster",
  "/wiki/Chris_Corbould",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Matt_Martin",
  "/wiki/Video_game",
  "/wiki/March_24",
  "/wiki/Kubaz",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Freemakers/LEGO",
  "/wiki/StarScavenger",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Dowutin",
  "/wiki/Grummgar",
  "/wiki/Zander_Freemaker",
  "/wiki/Weequay",
  "/wiki/Blood",
  "/wiki/Rowan_Freemaker/LEGO",
  "/wiki/Kordi_Freemaker/LEGO",
  "/wiki/Kyber_crystal",
  "/wiki/Kyber_Saber",
  "/wiki/Third_moon_of_Takodana",
  "/wiki/Varactyl",
  "/wiki/Egg",
  "/wiki/Class-D_cargo_container",
  "/wiki/Rodia",
  "/wiki/Jek-14/LEGO",
  "/wiki/Bala-Tik",
  "/wiki/Rathtar",
  "/wiki/Prince",
  "/wiki/Speeder_bike",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/The_High_Republic_Adventures_(2022)_1",
  "/wiki/The_High_Republic_Adventures_(2022)_3",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_9",
  "/wiki/The_High_Republic_Adventures_(2021)_10",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/A_Recipe_for_Death",
  "/wiki/Tales_from_a_Galaxy_Far,_Far_Away:_Aliens:_Volume_I",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Retcon",
  "/wiki/5-Minute_Star_Wars_Villain_Stories",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Monster_Misunderstanding",
  "/wiki/Teach_You,_I_Will",
  "/wiki/The_Imposter_Inside",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_1",
  "/wiki/Unexpected_Company",
  "/wiki/The_Starfighter_Stunt",
  "/wiki/The_Padawan_Path",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_2",
  "/wiki/Triplecross",
  "/wiki/Choose_Your_Destiny:_A_Han_%26_Chewie_Adventure",
  "/wiki/Han_Solo_%26_Chewbacca_7",
  "/wiki/A_Disarming_Lesson",
  "/wiki/Bounty_of_Trouble",
  "/wiki/Forces_of_Destiny:_The_Leia_Chronicles",
  "/wiki/Newest_Recruit",
  "/wiki/Crash_Course",
  "/wiki/Hasty_Departure",
  "/wiki/The_Stranger",
  "/wiki/Accidental_Allies",
  "/wiki/Art_History",
  "/wiki/Star_Wars_Rebels",
  "/wiki/A_World_Between_Worlds",
  "/wiki/Jyn%27s_Trade",
  "/wiki/Age_of_Resistance_Special_1",
  "/wiki/Beasts_of_Echo_Base",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/The_Path_Ahead",
  "/wiki/Ewok_Escape",
  "/wiki/An_Imperial_Feast",
  "/wiki/Traps_and_Tribulations",
  "/wiki/Chopper_and_Friends",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Last_Shot_(audiobook)",
  "/wiki/Pirate%27s_Price_(audiobook)",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/The_Face_of_Evil",
  "/wiki/The_Happabore_Hazard",
  "/wiki/Run_Rey_Run",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens:_Rey%27s_Story_(audiobook)",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/The_Force_Awakens_(Golden_Book)",
  "/wiki/The_Force_Awakens_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_3",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/The_Force_Awakens_Adaptation_5",
  "/wiki/Sands_of_Jakku",
  "/wiki/BB-8_Bandits",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Rey",
  "/wiki/Tracker_Trouble",
  "/wiki/Perilous_Pursuit",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/A_Call_for_Heroes",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi:_Rose_and_Finn%27s_Secret_Mission",
  "/wiki/The_Last_Jedi_Adaptation_2",
  "/wiki/The_Last_Jedi_Adaptation_3",
  "/wiki/Porg_Problems",
  "/wiki/Porgs!",
  "/wiki/Shuttle_Shock",
  "/wiki/Poe_Dameron_26",
  "/wiki/Poe_Dameron_27",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_18",
  "/wiki/Journey_to_Star_Wars:_The_Rise_of_Skywalker:_The_Resistance",
  "/wiki/A_Crash_of_Fate",
  "/wiki/A_Crash_of_Fate_(audiobook)",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars_Adventures_(2017)_24",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Volume_1",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Volume_2",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Volume_3",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Volume_4",
  "/wiki/The_Maker_of_Zoh",
  "/wiki/The_Storms_of_Taul",
  "/wiki/Star_Tours:_The_Adventures_Continue",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/From_Trenches_to_Wrenches:_The_Roger_Story_(episode)",
  "/wiki/What_Goes_Up..._(episode)",
  "/wiki/Scouting_for_Leia/A_Mission_with_Maz",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/The_Art_of_Star_Wars:_The_Force_Awakens",
  "/wiki/Rey%27s_Survival_Guide",
  "/wiki/Star_Wars_Insider_162",
  "/wiki/The_Adventures_of_BB-8",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Awakenings",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/LEGO_Star_Wars_Episode_VII:_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Unsung_Heroes",
  "/wiki/Star_Wars_Insider_179",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/The_Last_Jedi:_Rose_Tico:_Resistance_Fighter",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_Outer_Rim",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2021",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/A_Galaxy_for_Everyone",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Star_Wars_-_The_Official_Magazine",
  "/wiki/Star_Wars_-_The_Official_Magazine_101",
  "/wiki/Database",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Force_Awakens%E2%80%94The_Official_Visual_Story_Guide",
  "/wiki/Category:Images_of_Maz_Kanata",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/The_High_Republic_Adventures_(2021)_1",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Battle_of_Hoth",
  "/wiki/January_15",
  "/wiki/January_24",
  "/wiki/2018",
  "/wiki/January_7",
  "/wiki/2019",
  "/wiki/August_9",
  "/wiki/2020",
  "/wiki/December_16",
  "/wiki/2015",
  "/wiki/August_5",
  "/wiki/July_27",
  "/wiki/December_22",
  "/wiki/January_13",
  "/wiki/January_12",
  "/wiki/February_5",
  "/wiki/February_24",
  "/wiki/June_29",
  "/wiki/January_14",
  "/wiki/January_9",
  "/wiki/March_26",
  "/wiki/June_17",
  "/wiki/June_3"
 ]
}