{
 "name": "Mazicia Organa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Before 67 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 38 and 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "House of Organa",
      "High Court of Alderaan"
     ]
    }
   ]
  }
 ],
 "content": "Mazicia Organa was a Human female who served as the Queen of the planet Alderaan during the period leading up to the Clone Wars, a pan-galactic conflict. She was also the mother of Bail Prestor Organa, who became the last Viceroy and First Chairman of the Alderaan system. In 38 BBY, the life of Mazicia Organa was shattered when her youngest brother, the agricultural specialist Tayvor Mandirly, was murdered on a moon known as Antar 4. The famous blockade runner CR90 corvette later known as the Tantive IV was built during her reign, under the name Star of Alderaan. Despite the time that had gone by since Mandirly's passing, the mourning Queen was never able to resume a normal life. At some point before the outbreak of the Clone Wars in 22 BBY, the Queen's sorrow was such that she died of grief.\nA Human female, Mazicia Organa came from Alderaan, a pristine planet of refined culture, in the waning decades of the Galactic Republic. She was one of several children, the youngest of which became the renowned agricultural expert Tayvor Mandirly. Later in life, Mazicia joined the House of Organa, one of the galaxy's most respected Ancient Houses, by marrying the Viceroy Organa. Eventually, Mazicia Organa was crowned Queen of Alderaan. In the year 67 BBY, she gave birth to a baby boy, the Prince Bail Prestor Organa. Together, the Queen and the Viceroy Organa became dedicated and loving parents, but they never spoiled their son, even though his patrician education came with many privileges.\nIn 38 BBY, Mazicia's brother Tayvor was murdered on the moon Antar 4 by Raxis and Nolid, two members of a local criminal organization, during a colfillini plantation dispute on the planet. Mandirly's charred body was found nailed to a stake by the Jedi apprentice Obi-Wan Kenobi. That traumatic event was devastating for the Queen of Alderaan, and from then on, sorrow began to take over her life.\nSometime before 33 BBY, the Queen ordered the construction of the Star of Alderaan, a Corellian CR90 corvette the use of which was reserved to Senator Agrippa Aldrete, who represented the Alderaan sector in the Galactic Senate. Organa allowed the ship to serve the House of Alderaan without granting it the status of royal vessel so that it could have additional defensive systems and weapons added, predicting that her family might someday need more protection in dangerous situations. As years went by, Mazicia never managed to get over her brother's death, which eventually led to her own demise. When the Clone Wars erupted between the Republic and the Separatist Confederacy in 22 BBY, Queen Mazicia Organa had been dead for some time, and the throne had been passed to Breha Antilles, who was the wife of Bail Organa.\nLong after Queen Mazicia's death, her memory was still vivid in the mind of her son. At the start of the Clone Wars, Bail Organa was still deeply resentful against Raxis and Nolid, believing they should have been executed for provoking his mother's passing. House Organa also continued to use the Star of Alderaan, later renamed the Tantive IV, for over three decades, and their involvement in the Rebellion against the newly formed Galactic Empire proved Mazicia's prediction that her family might need more protection.\nThe Queen of Alderaan Mazicia Organa was deeply attached to her family. Her son Bail would remember her as a \"doting\" mother, and the Queen's love for her brother ultimately sent her into depression after he died. During her reign, however, Organa proved to be far-sighted and proactive. She was capable of foreseeing the dark times to come, providing her descendants with a private starship that could be fitted for war.\nMazicia Organa was first mentioned in the 2006 October issue of the Star Wars Insider magazine, in the article \"20 Things You Didn't Know About the Tantive IV.\" The article was written by Pablo Hidalgo as part of the Refresher Reading recurring feature. In the text, Mazicia Organa was only referred to as a past Queen of Alderaan, with no explicit mention of her family ties with Bail Organa. Two years later, Bail Organa's mother was mentioned, albeit unnamed, in the novel The Clone Wars: Wild Space, written by Karen Miller. The two characters were confirmed to be one and the same on page 15 of the 2010 reference book Star Wars Blueprints: Rebel Edition.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Alderaan/Legends",
  "/wiki/67_BBY",
  "/wiki/38_BBY/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/High_Court_of_Alderaan",
  "/wiki/Queen/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Viceroy/Legends",
  "/wiki/First_Chairman/Legends",
  "/wiki/Alderaan_system/Legends",
  "/wiki/Agricultural_expert",
  "/wiki/Tayvor_Mandirly",
  "/wiki/Death/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Antar_4/Legends",
  "/wiki/Blockade_runner",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Tantive_IV/Legends",
  "/wiki/Time/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Ancient_Houses",
  "/wiki/Marriage/Legends",
  "/wiki/Organa_(viceroy)",
  "/wiki/Crown/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Raxis",
  "/wiki/Nolid",
  "/wiki/Unidentified_criminal_organization",
  "/wiki/Colfillini",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Corellian_Engineering_Corporation/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Agrippa_Aldrete/Legends",
  "/wiki/Alderaan_sector/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Royal_Alderaan_Civil_Fleet",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Breha_Organa/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Period",
  "/wiki/2006",
  "/wiki/Star_Wars_Insider_90",
  "/wiki/Star_Wars_Insider",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Refresher_Reading",
  "/wiki/2008",
  "/wiki/The_Clone_Wars:_Wild_Space",
  "/wiki/Karen_Miller",
  "/wiki/2010",
  "/wiki/Star_Wars_Blueprints:_Rebel_Edition",
  "/wiki/The_Clone_Wars:_Wild_Space_(audiobook)",
  "/wiki/Bouris_Ulgo",
  "/wiki/3653_BBY",
  "/wiki/3643_BBY",
  "/wiki/0_BBY/Legends",
  "/wiki/Skywalker_family/Legends",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Hybrid/Legends",
  "/wiki/Star_Wars_(radio)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/High_Council_of_Alderaan",
  "/wiki/The_Illustrated_Star_Wars_Universe",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/Dark_Force_Rising",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/Cloak_of_Deception",
  "/wiki/Bail_Antilles/Legends",
  "/wiki/Databank_(original)",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Template:TOR_dates",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars_(1977)_53"
 ]
}