{
 "name": "Meck_Odom",
 "display_name": "Meck Odom",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Special Operations",
      "Imperial Special Operations",
      "B'omarr Order",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Meck Odom was a Human male Imperial officer who served the Galactic Empire and later joined the Alliance to Restore the Republic during the Galactic Civil War. He was assigned to the research facility on Danuta.\nOdom came from a wealthy family from the Core Worlds who, however, had no ties to the Emperor. His father was a celebrated architect, and his mother ran an import-export business. He also had a sister.\nOdom was a more spiritual person than the average citizen of the Empire, and had studied the teachings of the B'omarr Order.\nOdom was the best friend of Kyle Katarn when they were roommates during their tenure at the Academy of Carida. His Omega Exercise was an assault against a weapons factory which turned out to be a deserted warehouse infested by mynocks; this didn't deter him, however, from contacting his father in the comm net and bragging about his heroism.On the other hand, Kyle fought against a Rebel base and became a hero among the cadets.\nAfter he exited the hospital, Katarn called Meck for a secret meeting at the Academy's library—specifically, the cooking section—where he confided to him the unexplained premonitions that guided him through his mission, and called upon his religious background. Meck wasn't happy that Kyle brought up this personal matter in a discussion, and all he could say was that his studies didn't mention much about the Force. Meck left when he heard Nathan Donar III approaching, calling Katarn, but later joined them while Donar entertained them with his version of Katarn's story, which Meck found funny, especially after four years of listening to Kyle's bad jokes. He was surprised hearing that Kyle hadn't up to that time called his father to tell him the news.\nKatarn was decorated with the Imperial Medal of Valor and Odom lifted him up, as a cheering crowd of their peers came to admire the medal up close. Odom's parents and sister came to his class' graduation and invited Katarn  to stay with them that night. Katarn said that he wouldn't ruin a family meeting, but Odom insisted that his parents would really like to meet a real hero; Kyle said he would, if Odom's stunning sister would also be there.\nOdom had requested an Imperial Special Operations assignment that had been granted relatively quickly.As a Lieutenant he served in the secret Danuta research facility at the city of Trid on Danuta, where a partial set of Death Star plans was kept. A reprogrammed maintenance droid spied the facility for the Rebel Alliance, and footage of Meck was seen by Kyle, who had defected to the Alliance. Recognizing Meck from that video during a mission briefing for the Alliance made Mon Mothma suspicious.\nWhile serving on Danuta, he would often but secretly visit the Danuta Temple to be among the B'omarr monks, and the Blue Moon.\nLater, while Katarn was on a mission to steal the plans for that facility, he encountered Odom while he was meditating at the Temple and made an appointment at the Blue Moon. Although uncomfortable, Meck came to the bar dressed as a civilian. He was relieved to see that Kyle was alone and it wasn't some trap of the \"security types\". Meck showed Kyle his wanted poster, with his holo and accusations. Kyle admitted that he defected, and he explained everything about the mission to Danuta. Kyle promised to keep his identity secret and that they'd work together for a believable story. Meck explained that each side of the facility had several openings, designated with a letter, and his duty was scheduled at 21:00 at the gate S-2. He also pointed out a security glitch in the air ducts, and suggested to Kyle to infiltrate the complex through an air shaft.\nMeck was supposed to use remote testing equipment to open and close the door locks, momentarily dhutting down the security systems of the outer perimeter, giving Kyle a window of seven minutes to enter.A squad leader reported to Horst that he detected that the alarm system was shut down in sector S-2. Horst was about to open a channel to the quick response team and send a squad of walkers when Meck Odom showed up, and explained that he was finishing up some remote tests on the door locks and fell behind schedule. Horst scolded the Lieutenant, pointing out that his watch ended 5 minutes ago, and that his false alarm would raise up squad of Imperial commandoes. Odom apologised and promised that it won't happen again.\nDuring the skirmish, the two staged a blaster shot that wounded and rendered Odom unconscious, hoping that this would remove Odom from suspicion.\nMeck Odom had dark hair and skin, and a square face with a permanent smile. Whenever he interacted with Kyle Katarn, he almost always appeared cheerful and playful, and as a good friend he wanted to keep his spirits high.\nUnlike most citizens of the Empire, he secretly had an interest in religion, but as the Empire didn't tolerate them, he kept a low profile about it.\nDespite his Imperial allegiance, Kyle Katarn was sure that he would betray the Empire once he knew about the evil nature of the Death Star; Kyle would trust the success of his mission, and his life, based on their friendship, and Meck's religious philosophies.At the time, Odom was not entirely certain he had done the right thing and felt responsible for the deaths of his fellow Stormtroopers; but he comforted himself with the belief that the Rebellion would do the right thing—his true loyalty was to saving lives, not to the Empire or Rebellion.However the troublesome course of Kyle Katarn's life made Meck to wish not to meet him ever again and end their friendship.\nMeck Odom first appeared in the Dark Forces: Soldier for the Empire novel based on the Star Wars: Dark Forces video game. In the video game level corresponding to the Mission to Danuta there is no interaction with a character analogous to Meck Odom, although there can be several Imperial officers at the room where the Death Star plans are kept.\nMeck Odom was portrayed in the Dark Forces: Soldier for the Empire audio drama by Kale Browne, the same voice actor who portrayed Biggs Darklighter in the Star Wars radio drama. He is called \"Odom Meck\" throughout the audio dramatization and is listed by this name on the Dark Forces: The Collector's Trilogy audio drama box.\nThe novel refers to Meck's religious background but it isn't until the drama where it is specified that he studied with the B'omarr order; in the novel the Danuta Temple is nondescripit, while in the audio drama its denomination is specified as B'omarr. Their first meeting on Danuta differs significantly: the novel suggests that Katarn visited the Temple only hoping that Meck would come there, and left a message for him; Meck indeed accepts some risk when he decides to meet Katarn after receiving his message. In the audio drama Katarn finds Meck in person while meditating in the Temple, and the men arrange their meeting for later.\nAnother point of divergence is their last meeting in the facility. In the novel both Kyle and Meck are conscious about the security cameras; Meck pretends to run against Kyle and once Kyle identifies Meck, he shoots at him, carefully in order to wound him, without any more interaction, ensuring that that their collaboration isn't revealed in the facility's footage. In the dramatization however, once they find themselves alone, they do have a final dialogue, before they agree to be shot and wounded to make it believable.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Special_Operations",
  "/wiki/B%27omarr_Order/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/File:HowDoIFitIn-DFSftE.ogg",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Danuta",
  "/wiki/Treason/Legends",
  "/wiki/File:KyleInfamous-DFSftE.ogg",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Academy_of_Carida",
  "/wiki/Omega_Exercise",
  "/wiki/Mynock/Legends",
  "/wiki/Battle_of_AX-456",
  "/wiki/AX-456",
  "/wiki/Force_vision/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Nathan_Donar_III",
  "/wiki/Morgan_Katarn",
  "/wiki/Imperial_Medal_of_Valor",
  "/wiki/Rimmer/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Danuta_research_facility",
  "/wiki/Trid",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Danuta_Temple",
  "/wiki/Blue_Moon",
  "/wiki/Mission_to_Danuta",
  "/wiki/Standard_minute/Legends",
  "/wiki/Horst_(Keycard)",
  "/wiki/Squad/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Imperial_commando",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/Star_Wars:_Dark_Forces",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/Kale_Browne",
  "/wiki/Biggs_Darklighter/Legends",
  "/wiki/Star_Wars_(radio)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Dark_Forces:_The_Collector%27s_Trilogy_audio_drama",
  "/wiki/Category:Audio_files_of_Meck_Odom",
  "/wiki/Wizards.com",
  "/wiki/Kyle_Katarn%27s_Tale",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}