{
 "name": "Medliuna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Medliuna was a Mirialan female who lived during the Cold War between the Galactic Republic and the reconstituted Sith Empire. During the war, she worked as a merchant in the market area of Jiguuna, an industrial town controlled by a Hutt crime lord named Suudaa Nem'ro on the planet Nal Hutta. Medliuna sold various types of medium armor at the stall although she had a number of droid parts around the stall as well, however she did not offer these for sale. As all merchants in Jiguuna were, Medliuna was expected to pay some of his profits from his stall to one of Nem'ro's lieutenants at the crime lord's palace. Whilst at the stall she wore brown hooded armor and a backpack. The Mirialan had a bald head, blue eyes and green skin. Like many of her species at the time, Medliuna's face was decorated with tattoos which consisted of three lines made of triangles of alternate orientation. One of these was postioned beneath each of her eyes and the third down the center of her forehead.\nMedliuna first appeared in the video game Star Wars: The Old Republic released by BioWare in 2011. She appears as a medium armor vendor on the planet Nal Hutta, the starting planet for players of the bounty hunter and Imperial Agent class.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mirialan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jiguuna",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Nem%27ro%27s_Palace",
  "/wiki/Species/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Imperial_Agent",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}