{
 "name": "Medrit_Vasur",
 "display_name": "Medrit Vasur",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Beviin"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians"
     ]
    }
   ]
  }
 ],
 "content": "Medrit Vasur was a blacksmith and the husband of the Mandalorian bounty hunter named Goran Beviin.\nAlthough Goran's line of work meant that he was often away for long stretches while Medrit remained on Mandalore their long, happy marriage spanned from well before 25 ABY until after 40 ABY; early in the Yuuzhan Vong War, they also adopted Dinua Jeban, a fourteen-year-old Mandalorian war orphan.\nAfter Sintas Vel was awakened from carbon freeze, he let Hayca Mekket know she might be needed when Fett let loose his lack of confidence in Beluine's ability. When Jaina Solo came to train under Fett, he forged the Mandalore a set of his own beskar upper body armor, though Goran had wanted a set of greaves made as well. He would later be told of the true identity of Gotab by Solo but believed the matter closed after learning he had willingly chosen to be a Mando'ad instead of a Jedi.\nMedrit's gender has been specified in Legends as male, making Goran and Medrit the first explicitly gay couple in Star Wars literature.\nAlthough the Dramatis Personae at the beginning of Legacy of the Force: Sacrifice lists his name as Medrit Beviin, he's introduced in the text of the novel itself as Medrit Vasur. He is also called Medrit Beviin in The Essential Reader's Companion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Clan_Beviin",
  "/wiki/Mandalorian/Legends",
  "/wiki/Blacksmith",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Goran_Beviin",
  "/wiki/25_ABY/Legends",
  "/wiki/40_ABY",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Dinua_Jeban",
  "/wiki/Sintas_Vel",
  "/wiki/Hayca_Mekket",
  "/wiki/Beluine",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Mandalorian_iron",
  "/wiki/Bardan_Jusik",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Boba_Fett:_A_Practical_Man",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}