{
 "name": "Mee Deechi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Umbara"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 21 BBY and 20 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Umbaran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.93 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Umbaran government",
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Mee Deechi was an Umbaran male who represented the planet Umbara in the Galactic Senate during the Clone Wars as a member of the Umbaran government. He was a leading advocate of increased troop production and the continuation of hostilities with the Confederacy of Independent Systems. This brought him into political conflict with anti-war senators such as Padmé Amidala of Naboo and Onaconda Farr of Rodia. Although he believed the anti-war stances of those senators were unpatriotic, he respected colleagues like Farr despite their political disagreements.\nWhen Farr and his allies proposed a bill to cut the Republic's military budget, Deechi worked with Senator Halle Burtoni of Kamino to defeat the legislation and pass Burtoni's proposal to produce more clone troopers. Farr was murdered by his own aide, Lolo Purs, during the debate, and Deechi became a prime suspect due to his political disagreements with Farr. When Purs grew suspicious that Deechi had information about her involvement, she stabbed him to death. Purs was later arrested for her crimes. Deechi's death sparked Umbara's secession from the Republic and the resulting Battle of Umbara.\nIn the waning years of the Galactic Republic, thousands of star systems broke away from the Republic and formed the Confederacy of Independent Systems, ultimately sparking the Clone Wars between the Republic and the Separatist Alliance in 22 BBY. Mee Deechi, the representative of his homeworld Umbara in the Galactic Senate, became a proponent of defeating the Separatists through military might. Deechi believed that military spending was key to the Republic's war effort. This led him to ally with like-minded senators such as Halle Burtoni of Kamino to push the Republic to buy more weapons and troops to gain greater control of the war. At some point during the war, Burtoni showed Deechi and other members of the Senate a holographic projection of Phase II clone trooper armor, an upgrade over the previous generation of clone trooper armor.\nThe Galactic Senate became a political battlefield of its own during the war, with senators debating between continuing the war versus seeking a diplomatic solution with the Confederate government. Senator Padmé Amidala of Naboo urged the Senate to enter into peace talks with the Separatist Senate, a proposal also backed by her friend and Separatist Senator Mina Bonteri. Deechi, a proponent of the war's continuation, questioned Amidala on having Separatist friends, as cries of treason echoed throughout the Senate. The peace proposal fell apart when the Senate received a message from Count Dooku, the leader of the Separatist Alliance, saying that he was withdrawing the Separatist Senate's call for peace and accusing the Republic of carrying out an attack against the people of the Confederacy—an attack that had allegedly killed Senator Bonteri. In truth, the attack had been carried out by Count Dooku to scuttle the peace process.\nIn response to the escalating political tensions between the two governments, Burtoni proposed legislation to create five million more clone troopers, a bill that Deechi supported as well. Senator Bail Organa of Alderaan, a leading opponent of a troop increase, intended to speak before the full Senate in opposition to the legislation, but he was left injured in a politically-motivated attack and was unable to speak. Senator Mon Mothma of Chandrila urged the Senate to wait for Organa to speak, to which Deechi retorted that Organa was nowhere to be found. In Organa's place, Senator Amidala addressed the full Senate with an impassioned plea to not let the cost of the war remove vital social services from the people of the Republic. Though he disagreed with Amidala's stance, Deechi nonetheless applauded the young Senator's address.\nThe debate continued, with senators such as Organa, Amidala, Mothma, and Onaconda Farr of the planet Rodia proposing their own counter-legislation to decrease military spending and prevent a troop increase. Though Deechi respected Senator Farr, he nonetheless had his adversary followed to see if he could uncover any damaging information about the Rodian. It was through this clandestine operation that Deechi learned Farr had secretly held a meeting at Coruscant's docks under the derrick major with an unknown contact..\nThe day after Deechi had Farr followed, Senator Amidala once again spoke before the Senate to advocate for the reduction of military spending, as well as the dangers of continuing to escalate the war with the Separatists. Deechi, who attended the speech, spoke with Amidala after she exited the Senate chamber. The Umbaran implied that her views were dangerous and unpatriotic, a stance that Amidala accused of being warmongering. Amidala and her allies attended a small gathering to celebrate her speech, a celebration at which Farr collapsed and died after unknowingly drinking poison. A memorial service was held on a Coruscant landing platform in honor of the fallen senator, with Deechi attending to pay respects to his political rival before Farr's body was returned to Rodia.\nThough the investigation into Farr's murder was officially conducted by Lieutenant Tan Divo of the Coruscant Security Force, the inspector inspired little confidence in Amidala, who conducted her own investigation alongside Senator Organa. Suspecting that political malfeasance was behind Farr's murder, the two anti-war senators confronted Deechi and Burtoni in the Umbaran senator's office. Both of the pro-war senators denied the allegations that they had anything to do with Farr's murder. Though they may have been political rivals, neither had motive to kill him. Burtoni found Farr to be a useful fundraising tool, as his stance led to contributions to her political endeavors, while Deechi expressed his respect for the late senator, despite their political differences. Deechi revealed that he nonetheless had Farr secretly followed and told Amidala and Organa about the Rodian's meeting on the docks. Amidala and Organa left to investigate the lead, though they did not give up their suspicions about Deechi or Burtoni.\nThat night, Deechi was confronted by Lolo Purs, an aide to Senator Farr and a representative for Rodia. Purs was the true assassin and killed Farr after coming to resent him as a result of his brief decision to align Rodia with the Separatists earlier in the war. She had escaped suspicion for the crime but soon learned that Deechi was aware of Farr's meeting at the docks, which Purs had arranged in an attempt to intimidate Farr out of the Senate. In the hopes of covering her tracks, Purs stabbed Deechi in the chest, killing the Umbaran senator. His body was discovered by Amidala and Organa, prompting Lieutenant Divo to take increased security precautions in light of the murders of two senators. Purs' guilt was soon uncovered by Senator Amidala, and the young Rodian was arrested by the Coruscant Security Force. Shortly after Deechi's death, the troop increase bill that Deechi helped champion was passed into law, and the proposal to reduce military spending was rejected.\nAs a result of Deechi's assassination, Umbara withdrew from the Republic and allied itself with the Separatist Alliance. The secession led to the Battle of Umbara between the Separatists and the invading Grand Army of the Republic. By the battle's end, the Republic emerged victorious and Umbara was brought back into the Republic fold. Nevertheless, Umbara launched another effort to resist after the Republic transitioned into the Galactic Empire, but the planet would eventually become a part of that regime.\nMee Deechi was an Umbaran male with white hair, a gaunt face, pale skin, and black-rimmed gray eyes which gave him ultraviolet vision, all of which cast the senator in an intimidating light. A skilled deal-maker and legislator, Deechi was fiercely loyal to the Republic and became a proponent of escalated military action against the Separatists, to the point that he considered anti-war speeches to be unpatriotic and dangerous. After it was revealed that Padmé Amidala had held a secret meeting with her friend, Separatist Senator Mina Bonteri, Deechi publicly questioned the fact that Amidala had Separatist friends to influence, a question made in an attempt to influence the outcome of the Senate debate over the peace process.\nDeechi found allies in like-minded senators, such as Halle Burtoni of Kamino, with whom he worked to defeat anti-war legislation and increase military spending to strengthen the Republic's forces. Unlike Burtoni, however, Deechi respected his political enemies despite their differences, such as Onaconda Farr. Nonetheless, the devious Deechi was not above spying on a respected colleague, so he had Farr followed in an attempt to dig up political dirt on his rival—a decision that ultimately led to Deechi's own murder.\nWhile in office, Deechi wore grey, high-collared clothing similar to that of Sly Moore, a fellow Umbaran who served in the Senate as senior administrative aide to Chancellor Palpatine.\nMee Deechi was created for the animated television series Star Wars: The Clone Wars. He first appeared in the second season episode \"Senate Murders,\" which aired on March 19, 2010. The character met his demise in the same episode, but he later returned for a prequel episode in the third season called \"Pursuit of Peace\" on December 3, 2010. He was voiced by Gideon Emery.\nDeechi's appearance in \"Pursuit of Peace\" was brief, though he was part of a deleted scene that would have expanded his role in attempting to pass pro-war legislation. In the scene, Deechi threatens Amidala and tries to pressure her into voting for the military funding legislation because, he claimed, it would open a trade route near her home planet of Naboo. He took his intimidation a step further by claiming that her opposition to the bill would cause the people of Naboo to believe that she did not have their best interests at heart.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mee_Deechi",
  "/wiki/Mee_Deechi/Legends",
  "/wiki/Umbara",
  "/wiki/21_BBY",
  "/wiki/20_BBY",
  "/wiki/Coruscant",
  "/wiki/Umbaran",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Umbaran_government",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Senator",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Troop",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Politics",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Onaconda_Farr",
  "/wiki/Rodia",
  "/wiki/Reduced_military_spending_bill",
  "/wiki/Republic_Military",
  "/wiki/Halle_Burtoni",
  "/wiki/Kamino",
  "/wiki/Republic_military_enhancement_bill",
  "/wiki/Clone_trooper",
  "/wiki/Death",
  "/wiki/Lolo_Purs",
  "/wiki/Battle_of_Umbara",
  "/wiki/Standard_year",
  "/wiki/Star_system",
  "/wiki/22_BBY",
  "/wiki/Homeworld",
  "/wiki/Hologram",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Clone_trooper_armor",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Separatist_Senate",
  "/wiki/Mina_Bonteri",
  "/wiki/Treason",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Attack_on_Confederate_people",
  "/wiki/Cloning",
  "/wiki/Trooper",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaan",
  "/wiki/Mon_Mothma",
  "/wiki/Chandrila",
  "/wiki/Rodian",
  "/wiki/Docks_under_the_derrick_major",
  "/wiki/Galactic_Senate_Chamber",
  "/wiki/Poison",
  "/wiki/Funeral_of_Onaconda_Farr",
  "/wiki/Lieutenant",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Inspector",
  "/wiki/Deechi%27s_office",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Rebellion_on_Umbara",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Spy",
  "/wiki/Clothing",
  "/wiki/Sly_Moore",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Senate_Murders",
  "/wiki/March_19",
  "/wiki/2010",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Pursuit_of_Peace",
  "/wiki/December_3",
  "/wiki/Gideon_Emery",
  "/wiki/Pursuit_of_Peace_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/So_Much_More",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_60",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Databank_A-Z",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Mee_Deechi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/ARC_Troopers",
  "/wiki/Nightsisters_(episode)",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Darkness_on_Umbara",
  "/wiki/Carnage_of_Krell",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide"
 ]
}