{
 "name": "Meebur_Gascon",
 "display_name": "Meebur Gascon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Great Zilk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zilkin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "0.33 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic High Command",
      "D-Squad",
      "Republic High Command",
      "D-Squad"
     ]
    }
   ]
  }
 ],
 "content": "Meebur Gascon was a male Zilkin from Great Zilk who served as a colonel, and later as a Brigadier General, in the Grand Army of the Republic during the Clone Wars.\nGascon wanted to be promoted to the rank of Brigadier General. He was considered a military strategist and served with Republic Strategic Command since the First Battle of Geonosis.\nDuring the Clone Wars, Gascon was assigned command of D-Squad, a group of droids which included astromech droids R2-D2, QT-KT, U9-C4, and M5-BZ as well as WAC-47, a DUM-series pit droid. They were given a top secret mission to steal a decoding module from a vault inside a enemy battleship.\nAs the mission began, WAC over-confidently decided to take matters in his own hands by setting their transport shuttle on a collision course with their targeted ship in order to attract its attention. The result of this maneuver gathered a bit more attention than necessary, as the shuttle is taken in by a tractor beam and the dreadnought's droid crew proceeded to cart off the astromechs off for interrogation. The droids, however, managed to overpower the droids and sneak away to initiate the next step of their mission by having C4 cause a temporary power outage to circumvent the security settings at the decoding module vault, and WAC successfully managed to dupe to the droid guards stationed outside the vault. But when Gascon attempted to open the vault door, he accidentally inserted M5's tools into a power outlet, causing the astromech to suffer an enormous electric shock, disabling the droid for some time. Gascon then seemed unsure of the mission and confessed about not having any field experience, after some talking the droids and Gascon find a common ground.\nThe droids managed to disable the security measures within the vault itself and penetrated to the module storage chamber. However, their undertakings had caught the attention of the ship's droid commander, Aut-O, who arrived on the scene with an escort of battle droids to investigate. But R2, who conveniently stood near a control pad for the chamber's artificial gravity, promptly turned it off, causing all the droids to float helplessly around. This gave the droid team the opportunity to finish off the battle droids; Aut-O still remained functional and attempted his best to thwart them, but by cooperating, Gascon, WAC and R2 managed to put him out of commission as well. Aut-O still managed to sound the general alert before he deactivated, forcing the team to evacuate immediately. At first eager to leave to prevent their capture, Gascon consented to his team's wish to take the damaged M5 with them, and amidst the chaos the alarm had caused, Gascon and his droid team managed to slip away with the decoding module in their possession.\nOn their way back to Coruscant they managed to repair M5-BZ, but just as things started to calm down, a comet storm got in their way. WAC-47 managed to get their shuttle out of hyperspace before a collision could yield more catastrophic results, but the ship was nevertheless caught in the middle of the swarm and was hit by several ice comets. With the ship being unable to continue its journey, the team was forced to crash-land on a nearby wasteland planet named Abafar. Gascon insisted on staying near the ship and waiting for help but R2-D2, who has taken possession of the encryption module, took matters into his own hands and rolled off into the wasteland to conclude the mission. He was promptly joined by his droid comrades, Gascon soon after followed. The group aimlessly wandered the wasteland, Gascon started to lose his temper and argued with WAC-47, soon after they found a shipwreck giving Gascon hope.\nHowever, they promptly found the dead bodies of the ships crew, after this event Gascon started to lose his mind. WAC-47 declared him self the leader, the rest of the droids overruled him and abandoned him and Gascon. Soon after WAC's single-mindedness of going ahead no matter revived Gascon's will to live. But then they are surprised to discover that Afabar was not completely lifeless when a whole herd of strange, rat-like creatures came stampeding across the wasteland. Gascon trusting the creatures' survival instincts, made himself and WAC hitch a ride on their backs, and indeed the creatures took them to a waterhole and a nearby city sunken into the surface of the planet, where to their surprise they found the rest of the D-Squad already present. With WAC haven proven himself so much alike him, Gascon field-promotes the delighted droid to Corporal, while the astromechs were left a bit baffled at this new development.\nGascon and his squad had made it to a small town called Pons Ora. Gascon accompanied by WAC-47 entered a restaurant for some food while the rest of D-Squad did some scouting. The duo were rudely shooed out by the diner's cook, Borkus. Gascon went to the side of the diner to eat the scraps. But before he could start eating, a human dishwasher named Gregor stepped out of the diner to throw out the garbage, accidentally hitting Gascon. Apologizing for his mistake, Gregor offered to give him some food on the side. However, Gascon stared at Gregor and identified him as a clone trooper. Gregor apparently had no idea what a clone was and was forced to return to work. Gascon and WAC then rendezvoused with the rest of D-Squad, who confirmed the presence of Separatist forces on Abafar. Soon after D-Squad found a heavily guarded landing field with a transport shuttle. Though Gascon insisted they discreetly make their way to the shuttle, the droids point out that the Separatists may be on the lookout for them after their adventure on the dreadnaught.\nAs a head-on attack would be suicide, Gascon decided to enlist Gregor's help. D-Squad then located Gregor's apartment and got his attention by having R2 project a hologram of Captain Rex. They explained to him his true origins as a clone, meant to fight for the Republic. Gregor was hesitant to believe them, saying he's lucky that Borkus is paying off his rent. Gascon corrected him by saying that he's Borkus' slave. As Gregor has amnesia, Gascon had R2 ID Gregor off his identification code on his wrist, revealing Gregor to be a clone commando. Gregor then agreed to assist D-Squad. They then go searching for his equipment, unaware that Borkus was watching them. They go to Borkus' diner, only for him to come to them, revealing that he has Gregor's gear. Gregor demanded to know why he withheld the truth from him. Borkus said he didn't care and reminded Gregor that he owes him a life debt. The clone retorts that he made him a slave he then demanded his gear. Borkus gets the drop on Gregor, but with the help of the droids, they tied him up. As D-Squad was leaving Borkus revealed that the Separatists had a plan to blow up a Republic cruiser in orbit of the Republic fleet with the rhydonium fuel they mined.\nD-Squad then made it to the landing zone Gregor provided cover fire for Gascon and the droids as they made their way to the shuttle. However, the battle droids spotted D-Squad and opened fire on them. A stray shot hit a Rhydonium canister, knocking down BZ and Gascon inside him. The Colonel told WAC to leave him, an order that the pit droid quickly complied with. However, Gregor came back for him and the droid and stays behind to cover their escape. Though Gascon and R2 insists they can save him, Gregor promises he will return home. As the Separatists surrounded him, Gregor shot nearby canisters, causing massive explosions. As their shuttle departed Abafar, Gascon promised that Gregor's sacrifice would not be forgotten and they would watch for his return.\nAfter escaping Abafar D-Squad landed on the the Renown. Though the droids were confused as to why the ship's hangar blast doors were closed and the lack of crew presence, Gascon dismissed their concerns. Upon arriving on the bridge, however, they discovered that the clone officers were merely holograms. Suddenly, the ship jumped to hyperspace and it comes to light that the ship has, in fact, been commandeered by Confederacy droids. D-Squad escaped the bridge and evades their pursuers in the hangar control room. D-Squad then took note of a device in the control room, which R2-D2, identified as a bomb trigger, as the hangar blast doors opened to reveal rows of rhydonium canisters. It became clear that the Confederacy intended to use the Star Destroyer as a way to destroy the vessels of the Republic Navy. But Gascon had no intention of stopping the bomb, he wanted to get off the ship the second it exited hyperspace.\nHowever, Gascon and the rest of D-Squad soon found out that the Renown was heading for a space station in the Carida system, Gascon panics, identifying it as the location of the Republic strategy conference where the Jedi council and many high ranking Republic officers were stationed. Before they could decide on their next course of action, Gascon spotted a buzz droid spying on them and they all gave chase. They chase the buzz droid only to be greeted by a whole swarm of them. D-Squad managed to take all of them out by opening the airlock, but with that action, M5-BZ got also sucked out into space. Gascon then gave a short speech, promising that they will not let BZ's sacrifice be in vain by stopping the Separatists. Gascon came up with a plan for D-Squad to escape on the shuttle while R2 reprogramed the trigger mechanism to detonate prematurely. But their plan was hit with complications, as a super tactical droid went to arm the detonator while battle droids pursued D-Squad. Gascon and U9-C4 drew their fire while R2 tussled with the super tactical droid. As everyone gets on the shuttle, Gascon refused to leave Artoo behind, but WAC initiates liftoff leaving Artoo behind.\nUltimately, R2 got the upper hand and successfully reprogramed the detonator, causing the rhydonium to explode prematurely, destroying the Star Destroyer, but saving the Republic fleet. Soon after Gascon managed to contact the space station, informing Anakin Skywalker of R2's sacrifice. Anakin sent out salvage teams to scourer the wreckage, who retrieved R2's remains and repaired him. Gascon personally commended R2's bravery and tells D-Squad that he'd be honored to serve with them again. An excited WAC then told him that D-Squad has been assigned to Gascon's platoon, allowing them to see each other for the rest of the war, much to Gascon's chagrin as he sobbed with sadness.\nGascon's design originated from concept artwork for Star Wars: Episode I The Phantom Menace, a design originally conceived for Jar Jar Binks. He was voiced by Stephen Stanton, who also voiced Moralo Eval. Like Gascon, Eval's story arc was written by Brent Friedman.\nMeebur Gascon's character appears in several side-stories in the non-canon 2015 video game Disney Infinity 3.0's Twilight of the Republic Clone Wars-era story. A non-canon comic strip included in the Launchpad section of Star Wars Insider 180 claimed Gascon was unable to find work after the Clone Wars ended, forcing him to go into the customer service of an astromech droid support company. While on the job, Gascon worked off a laptop on a desk and wore a headset, which he once used to talk to a customer who needed to be told where a droid's toggle switch was.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Meebur_Gascon",
  "/wiki/Meebur_Gascon/Legends",
  "/wiki/Template:Expand",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Template:Image",
  "/wiki/Special:Upload",
  "/wiki/Great_Zilk",
  "/wiki/Zilkin",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_High_Command",
  "/wiki/D-Squad",
  "/wiki/Colonel",
  "/wiki/Brigadier_General",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Military_rank",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Droid",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/QT-KT",
  "/wiki/U9-C4",
  "/wiki/M5-BZ",
  "/wiki/WAC-47",
  "/wiki/DUM-series_pit_droid",
  "/wiki/Mission_to_steal_a_Separatist_encryption_module",
  "/wiki/Encryption_module",
  "/wiki/Aut-O%27s_flagship",
  "/wiki/D-Squad%27s_Neimoidian_shuttle",
  "/wiki/Tractor_beam",
  "/wiki/B1-series_battle_droid",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Aut-O",
  "/wiki/Coruscant",
  "/wiki/Hyperspace",
  "/wiki/Comet",
  "/wiki/Abafar",
  "/wiki/Void_strider",
  "/wiki/Pons_Ora",
  "/wiki/Borkus",
  "/wiki/Human",
  "/wiki/Gregor",
  "/wiki/Clone_trooper",
  "/wiki/Rho-class_transport_shuttle",
  "/wiki/Shuttle",
  "/wiki/Suicide",
  "/wiki/Captain",
  "/wiki/Rex",
  "/wiki/Amnesia",
  "/wiki/Clone_commando",
  "/wiki/Life_debt",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Rhydonium",
  "/wiki/Renown",
  "/wiki/Hologram",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Carida_system",
  "/wiki/Republic_strategy_conference",
  "/wiki/Jedi_Council",
  "/wiki/Pistoeka_sabotage_droid",
  "/wiki/Airlock",
  "/wiki/ST-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/D-Squad%27s_Rho-class_transport_shuttle",
  "/wiki/Anakin_Skywalker",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Stephen_Stanton",
  "/wiki/Moralo_Eval",
  "/wiki/Brent_Friedman",
  "/wiki/2015",
  "/wiki/Video_game",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_180",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Secret_Weapons",
  "/wiki/A_Sunny_Day_in_the_Void",
  "/wiki/Missing_in_Action",
  "/wiki/Point_of_No_Return",
  "/wiki/Category:Images_of_Meebur_Gascon",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_42",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/StarWarsKids.com",
  "/wiki/Battle_Droids_and_Other_War_Droids",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/Databank_(website)"
 ]
}