{
 "name": "Meekerdin-maa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "72 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tintinna"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Uhumele"
     ]
    }
   ]
  }
 ],
 "content": "Meekerdin-maa, also known as Ratty, was a male Tintinna who worked as the engineer of the smuggler vessel Uhumele. He had an assistant named Janks.\nMeekerdin-maa was with the rest of the crew when Dass Jennir and Bomo Greenbark snuck on-board the Uhumele. He informed them that they were the only survivors of the Battle of Half-Axe Pass. When Bomo demanded that they be taken to Sullust to meet up with his family, Meekerdin-maa had to tell him that all the refugees were loaded on a ship to be sold to slavers. He was busy in the engine room of the Uhumele during the frantic escape from New Plympto.\nOn their way to Orvax IV, Meekerdin-maa comforted Bomo when he was informed by Mezgraf that it was a living hell of the Galaxy. When a quorum of the crew was called to decide what to do when they arrived at Orvax IV, he vowed to do everything in his power to help him find his family.\nUpon landing on Orvax IV, Bomo and Meekerdin-maa disguised themselves as Jawas with lights under their hoods to mimic the glowing yellow eyes. After Mezgraf wrangled a runaway pack animal and Dass Jennir used a Jedi Mind trick to fool a pair of T'surr guards, Meekerdin-maa discovered a large group of Nosaurians held in a lower level holding pit. As the crew of the Uhumele rushed to the pit, they were discovered by several T'surr guards. After Mezgraf, Jennir, Ko Vakier, and Bomo dispatched them, most of the crew decided to return to the Uhumele. Before leaving, Meekerdin-maa whispered to Jennir, \"May the Force be with you..\"\nUpon returning to the Uhumele, Bomo attempted to leave the ship to continue his search for his family, despite Meekerdin-maa's best attempts to contain him. He was with Bomo when Jennir returned with the coordinates to the buyer of Bomo's daughter.\nOnce they arrived at Calamar, Meekerdin-maa joined the rest of the crew in a meal while Jennir did some more investigating on the location of the owner of Bomo's daughter. When Jennir returned, they flew the Uhumele to Dezono Qua's villa to confront him. Meekerdin-maa, Bomo and Janks went to sabotage the droid control center. They successfully deactivated all the droids protecting Dezono. After Jennir killed Dezono when learning that Dezono killed and ate Bomo's daughter, Meekerdin-maa returned to the Uhumele and attempted to comfort Bomo.\nWhile on Pizkoss, Meekerdin-maa and Bomo were chased by stormtroopers. After hiding under a market table, they ran into Janks, spilling all the food he had purchased. Before they could gather it up and escape, they were discovered by more stormtroopers. Bomo started firing at them, but Meekerdin-maa grabbed his arm and told him to run. They fled, leaving Janks behind to be captured.\nBefore reaching the docking bay where the Uhumele was, Meekerdin-maa called Crys Taanzer on his comlink to warn her of Imperial trouble. Upon entering the docking bay, Meekerdin-maa and Bomo found three stormtroopers setting up an E-Web heavy repeating blaster. Crys lifted off, scattering the stormtroopers while lowering a rope ladder for her crewmembers. Meekerdin-maa and Bomo were hauled aboard by Schurk-Heren and Mezgraf. Once safely aboard, Meekerdin-maa informed his captain that Janks was captured.\nThe crew of the Uhumele headed to Mimban for a rendouvous with a buyer for the mysterious artifact they possessed. Before they landed, the crew stopped in an asteroid field to hide the artifact. Bomo volunteered to wear Meekerdin-maa's spacesuit and help, and Meekerdin-maa quickly went off to replace the ship's transponder.\nOnce on Mimban, Meekerdin-maa and the rest of the crew met with Haka Hai at his base. When a firefight broke out after Lumbra doublecrossed Hara right after he tried to steal the artifact from Schurk-Heren, Meekerdin-maa sought cover with the rest of the crew of the Uhumele. He was captured along with everyone else by Haka's gang after Lumbra fled with the artifact.\nMeekerdin-maa was chained to a large ball and forced to work on Haka's equipment. After Bomo escaped captivity, Meekerdin-maa observed Haka and his men heading into the swamp and assumed they were after Ko Vakier. He was freed by Bomo and Crys after they raided the armory. The engineer used his skills to rig up some grenades to explode remotely so Bomo could use them in an ambush. He then went to free Schurk-Heren, Ko Vakier and Mezgraf from their cell.\nAfter Haka's gang was wiped out, Meekerdin-maa returned to the Uhumele with the rest of the surviving crew.\nEventually, the crew of the Uhumele decided to assassinate Darth Vader, the second in command of Emperor Palpatine. Dass Jennir also had Meekerdin-maa secretly tasked with working on some engines with the Uhumele, causing Bomo Greenbark, who overheard the exchange, to get suspicious.\nAs befitting any excellent engineer, Meekerdin-Maa was uncannily observant as well as extraordinarily sensitive, not only to the machinery under his care but with his companions, as well. Despite his age—fifty-three standard years—his personality and stature often led others to think of him as a youngling. Though the end of the Clone Wars led many peoples throughout the galaxy to disdain the Jedi and disbelieve the Force, Meekerdin-Maa stood by his principles and believed in the Force, and generally thought well of its now-\"extinct\" servants.\nHe was also very compassionate and cared deeply for his crewmates and any passengers. It was this caring nature that lead him to become good friends with Bomo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/72_BBY/Legends",
  "/wiki/Tintinna",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Uhumele",
  "/wiki/Engineer/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Janks",
  "/wiki/Dass_Jennir",
  "/wiki/Bomo_Greenbark",
  "/wiki/Cleansing_of_New_Plympto#One_month_of_fighting",
  "/wiki/Sullust/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Dark_Times_2",
  "/wiki/Orvax_IV",
  "/wiki/Mezgraf",
  "/wiki/Galaxy/Legends",
  "/wiki/Mission_to_Orvax_IV",
  "/wiki/Jawa/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/T%27surr_(species)",
  "/wiki/Nosaurian/Legends",
  "/wiki/Ko_Vakier",
  "/wiki/May_the_Force_be_with_you/Legends",
  "/wiki/Mesa_Greenbark",
  "/wiki/Calamar",
  "/wiki/Dezono_Qua",
  "/wiki/Qua_family%27s_villa",
  "/wiki/Assault_on_Dezono_Qua%27s_villa",
  "/wiki/Droid/Legends",
  "/wiki/Dreypa%27s_Oubliette",
  "/wiki/Pizkoss",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Dark_Times_6",
  "/wiki/Crys_Taanzer",
  "/wiki/Comlink/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/E-Web_heavy_repeating_blaster",
  "/wiki/Schurk-Heren",
  "/wiki/Asteroid_belt",
  "/wiki/Enviro-suit",
  "/wiki/Haka_Hai",
  "/wiki/Lumbra",
  "/wiki/Grenade/Legends",
  "/wiki/Skirmish_on_Mimban",
  "/wiki/Youngling/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Star_Wars:_Dark_Times:_The_Path_to_Nowhere",
  "/wiki/Dark_Times_7",
  "/wiki/Dark_Times_8",
  "/wiki/Dark_Times_9",
  "/wiki/Dark_Times_10",
  "/wiki/Dark_Times_11",
  "/wiki/Dark_Times_12",
  "/wiki/Dark_Times:_Blue_Harvest,_Part_1",
  "/wiki/Dark_Times_15",
  "/wiki/Dark_Times_16",
  "/wiki/Dark_Times_17",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_1",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_2",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_3",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_4",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_1",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_2",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_4",
  "/wiki/Star_Wars:_Panel_to_Panel_Volume_2:_Expanding_the_Universe",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_95",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Dark_Times_1"
 ]
}