{
 "name": "Mei  (Dark Jedi)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jensaarai"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Sukarr",
      "Unidentified cyborg master"
     ]
    }
   ]
  }
 ],
 "content": "Mei was a Human female Dark Jedi who lived during the waning years of the Galactic Republic. Her father was Sukarr of the Jensaarai cult.\nMei was the daughter of Sukarr, a Dark Jedi slain by Jedi Master Obi-Wan Kenobi in 19 BBY shortly before the end of the Clone Wars. Later, Mei encountered another Dark Jedi, a Bpfasshi named Fomadu, who was contemplating suicide in the wake of his brother Zukao's death during the Bpfassh Uprising. She saved Fomadu from killing himself, and he transferred the Force-bond he had shared with his Bpfasshi sibling to her. In return, Fomadu gave her purpose, while their new master, a mysterious Force-sensitive cyborg, gave them hope. Mei, Fomadu and their master worshipped the Great Void, which, they believed, was the only truth, as there was no the Dark side nor the Light side.\nShortly after the beginning of the Great Jedi Purge, Fomadu and Mei tracked down two Jedi Masters, T'ra Saa and Tholme, to Nar Shaddaa, to kill them for their role in slaughtering the Bpfasshi. However, they found Obi-Wan Kenobi there instead, who went to Nar Shaddaa after his duel with Darth Vader to sell the Soulless One before travelling to Tatooine with newborn Luke Skywalker. They sensed Kenobi in the Force when he was fighting with street thugs, and they helped the Jedi to defeat them, only to attack him themselves immediately thereafter. They chased the Jedi through the streets of Nar Shaddaa using the Force speed. Fomadu finally caught up with Kenobi in the waste shaft, but the Jedi managed to strike his opponent down in a fierce duel.\nMei arrived at the scene shortly thereafter, and she vomited upon noticing her lover's severed head. Kenobi justified his actions by telling Mei that Fomadu had left him with no choice, although his words didn't weaken her resolve to kill the Jedi. However, at Kenobi's insistence, she promised that she would deliver Luke to Tatooine should she emerge victorious. Kenobi foresaw that the duel would result in the death of both of them, and he refused to fight Mei, throwing his lightsaber to the ground. Unwilling to murder her defenseless opponent, Mei angrily demanded that he fight. When Kenobi refused to do so, Mei tried another approach by stealing the cradleboard with Luke. However, her attempt to use Luke as a bait for Kenobi failed when the baby used the Force to activate his father's lightsaber lying in the cradle. The lightsaber's blade struck Mei just behind her chin and erupted from the apex of her skull, killing the Dark Jedi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Mei",
  "/wiki/19_BBY/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jensaarai/Legends",
  "/wiki/Sukarr",
  "/wiki/Unidentified_cyborg_master",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Duel_on_Susevfi",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bpfasshi",
  "/wiki/Fomadu",
  "/wiki/Suicide/Legends",
  "/wiki/Zukao",
  "/wiki/Death/Legends",
  "/wiki/Bpfassh_Uprising",
  "/wiki/Force-bond",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Chaos",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Great_Jedi_Purge",
  "/wiki/T%27ra_Saa",
  "/wiki/Tholme/Legends",
  "/wiki/Duel_on_Mustafar/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Soulless_One/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_speed",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber/Legends",
  "/wiki/Anakin_Skywalker%27s_second_lightsaber",
  "/wiki/Lone_Wolf:_A_Tale_of_Obi-Wan_and_Luke"
 ]
}