{
 "name": "Mek_Nu%27Tiv",
 "display_name": "Mek Nu'Tiv",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kudon"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Mek Nu'Tiv was a Kudon trader. During the Cold War, Nu'Tiv acquired an Alderaanian data archive, and arranged to sell it to the First Order. Nu'Tiv was tricked by Han Solo, who posed as an officer of the First Order, and the archive was taken by Poe Dameron of the Resistance.\nNu'Tiv managed to get her hands on a data archive which contained what was left of the Royal Library of Alderaan, after the planet was destroyed by the Galactic Empire. Hoping to sell the archive, she was approached by the First Order, and arranged a meeting aboard her cruiser so that she could make a deal with them. C-3PO's droid spy network learnt of the archive, along with Nu'Tiv's negotiations, and he organized a heist plan so that the Resistance could take the archive and sell it for credits. General Leia Organa assigned Poe Dameron and Black Squadron to the task, giving them old ships so their identities would not be discovered. As Black Squadron made their way to Nu'Tiv's cruiser, a First Order Xi-class light shuttle landed to meet with Nu'Tiv, who waited with her men to check the legitimacy of the First Order's credentials.\nHowever, the First Order were not actually involved in the trade. The shuttle that landed on Nu'Tiv's cruiser contained Han Solo and Chewbacca, who had acquired codes from the slicer Finwej that let them impersonate the First Order. Dressed in the uniform of a First Order officer, Solo met Nu'Tiv and her bodyguards, but Nu'Tiv recognized the work of Finwej, denouncing Solo to be a fraud. As she did so, Chewbacca shot and killed one of her men, taking Nu'Tiv by surprise while he and Solo escaped to locate the data archive.\nAt the same time as Nu'Tiv's men chased down Solo and Chewbacca, Black Squadron approached the cruiser. Poe used the ion cannons built into his Z-95 Headhunter to disable the power on Nu'Tiv's cruiser, confusing both her and Solo. Assuming the ion cannon fire was from associates of the two smugglers, Nu'Tiv ordered her men to kill the intruders, sending several of her fighters after Black Squadron. Poe landed his Z-95 on the cruiser, but he and BB-8 ran into Nu'Tiv, who aimed her blaster pistol at Poe, demanding to know whether he was with the First Order impersonators. When Poe denied being with anyone else, Nu'Tiv decided to punish him anyway. Before she could shoot, BB-8 stunned her, and she collapsed to the ground. With Nu'Tiv incapacitated, Solo and Chewbacca found the data archive, but upon discovering what it contained, realized that Organa and the Resistance were also searching for it. The smugglers decided to let the Resistance have the archive, and secretly cleared the way for Poe and BB-8 to find it. Outside the cruiser, Black Squadron had destroyed the remaining enemy fighters, and escaped with the data archive, returning to the Resistance base on D'Qar.\nDespite appearing calm and collected, Nu'Tiv was quick to become angered when her cruiser came under attack. After learning that the buyers she was meeting with were impostors, she ordered her guards to kill them. When she later confronted Poe Dameron, who denied being with the First Order impersonators, she chose to take her anger out on him regardless. As he searched Nu'Tiv's storage, Han Solo noted that she was organized, keeping her possessions in storage crates.\nNu'Tiv had gray fur, gray eyes, and brown hair. She also had red markings that decorated her face.\nNu'Tiv owned a cruiser, upon which she stored her possessions, including the Alderaanian data archive. She also had a squadron of neon-colored starfighters that lay in wait near her cruiser in case they were needed. She carried a NN-14 blaster pistol.\nMek Nu'Tiv first appeared in the 2018 canon comic Poe Dameron Annual 2, written by Jody Houser and illustrated by Andrea Broccardo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kudon",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Merchant",
  "/wiki/Cold_War",
  "/wiki/Alderaanian",
  "/wiki/Archive_of_the_Great_Library_of_Alderaan",
  "/wiki/First_Order",
  "/wiki/Han_Solo",
  "/wiki/First_Order_officer",
  "/wiki/Poe_Dameron",
  "/wiki/Resistance",
  "/wiki/Royal_Library_of_Alderaan",
  "/wiki/Alderaan",
  "/wiki/Planet",
  "/wiki/The_Disaster",
  "/wiki/Galactic_Empire",
  "/wiki/Mek_Nu%27Tiv%27s_cruiser",
  "/wiki/C-3PO",
  "/wiki/Droid",
  "/wiki/Resistance_spy_droid_network",
  "/wiki/Heist_of_the_Alderaanian_data_archive",
  "/wiki/Credit",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Starship",
  "/wiki/Cruiser",
  "/wiki/Xi-class_light_shuttle",
  "/wiki/Shuttle",
  "/wiki/Chewbacca",
  "/wiki/Slicer",
  "/wiki/Finwej",
  "/wiki/Bodyguard",
  "/wiki/Death",
  "/wiki/Ion_cannon",
  "/wiki/Z-95_Headhunter",
  "/wiki/Smuggler",
  "/wiki/Mek%27s_fighters",
  "/wiki/BB-8",
  "/wiki/Blaster_pistol",
  "/wiki/Stun",
  "/wiki/Starfighter",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/NN-14_blaster_pistol",
  "/wiki/2018",
  "/wiki/Poe_Dameron_Annual_2",
  "/wiki/Jody_Houser",
  "/wiki/Andrea_Broccardo",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Resistance"
 ]
}