{
 "name": "Mekel",
 "display_name": "Mekel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Yuthura Ban"
     ]
    }
   ]
  }
 ],
 "content": "Mekel was a force-sensitive male human who was a prospective student of the Sith Academy on Korriban during the waning years of the Jedi Civil War.\nIn 3956 BBY, Mekel was met by Revan, a former Sith Lord now a retrained Jedi Padawan, outside the gates of the Academy tormenting a number of sentients wishing to be admitted. Mekel promised to admit whichever person was able to stand in one place the longest without food, water or sleep. Revan was disgusted by this display of cruelty and spoke his mind to the brash Mekel, who only left with a huff and a half-hearted threat.\nAfter Mekel left, Revan convinced the surviving hopefuls to abandon their quest to join the Sith .\nRevan would later meet Mekel again in the tomb of Tulak Hord in the Valley of the Dark Lords. A former headmaster of the Academy, Jorak Uln, had been driven out by his apprentice, Uthar Wynn, and became a demented hermit holed up in the tomb, kidnapping any Sith students who happened upon him. Wishing to gain prestige to further infiltrate the Academy, Revan sought out Uln and discovered he had captured Mekel. Revan refused to give in to Jorak's game and allowed himself to be tortured in Mekel's place. Shocked that someone would sacrifice himself for him, Mekel used the Force to free Revan and help him kill Jorak. After the battle, Mekel expressed his gratitude to Revan for saving his life, deduced that he was not a true Sith, and assured Revan that he would not expose him. Revan then tried to encourage Mekel to go over to the light side. After thinking for a bit, Mekel ultimately decided to leave the Sith, but it is likely he didn't join the Jedi either, as he felt he didn't deserve it for all the people he hurt.\nAlthough Mekel's full arsenal of Force powers is not known, he demonstrated his ability with the dark side power Force drain when he and Revan fought Jorak.\nIf the player chooses the dark side path for this scenario, he can allow Jorak to torture Mekel to death, or he can turn on Mekel after the two defeat Jorak.\nTwo alignment-neutral possibilities exist as well: If Revan does not kill Jorak quickly enough, Mekel may simply fall in combat, resulting in no alignment shift. If the player does not persuade Mekel to abandon the dark side after defeating Jorak, he will simply stay on at the Academy. When the player returns from Naga Sadow's tomb, depending on which choice he made, Mekel may join in with the rest of the Academy in attacking him and end up being killed.\nSimilarly, there are alignment-changing possibilities with Mekel's \"hopefuls\": Dark side points can be rewarded if Revan persuades the Aqualish hopeful that his final task is to kill the guard at the gate. The Aqualish charges the guard, and is quickly killed. Depending on which party members are present, the player will get different responses. Jolee will wonder aloud if all Sith are that gullible when they join the order. Juhani will criticize such cruel, manipulative behavior. Conversely, Zaalbar and HK-47 will be amused, with Zaalbar remarking that he feels no pity whatsoever for the dead Aqualish, and HK praising such skillful \"eliminating of the opposition.\"\nMekel was voiced by Robin Atkin Downes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Yuthura_Ban",
  "/wiki/Juhani",
  "/wiki/Jolee_Bindo",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Korriban",
  "/wiki/Jedi_Civil_War",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/3956_BBY",
  "/wiki/Revan/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Sith_hopeful",
  "/wiki/Tulak_Hord",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Jorak_Uln",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Uthar_Wynn",
  "/wiki/Sith/Legends",
  "/wiki/Prestige",
  "/wiki/Torture/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force_drain/Legends",
  "/wiki/Tomb_of_Naga_Sadow",
  "/wiki/Aqualish/Legends",
  "/wiki/Jolee",
  "/wiki/Zaalbar",
  "/wiki/HK-47",
  "/wiki/Robin_Atkin_Downes",
  "/wiki/Wookieepedia:Sourcing"
 ]
}