{
 "name": "Melanah_Sal_Graeff",
 "display_name": "Melanah Sal Graeff",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sienar Fleet Systems"
     ]
    }
   ]
  }
 ],
 "content": "Melanah Sal Graeff was a human female Sienar Fleet Systems development executive who held the title of Viceprex. She regularly visited the planet Corellia to check on her company's interests there and in 13 BBY was in Coronet Spaceport when it was locked down due to the criminal Han Solo bribing his way through the Imperial security check point.\nMelanah Sal Graeff was a human female who worked as a development executive Viceprex for Sienar Fleet Systems during the reign of the Galactic Empire. She routinely traveled to the planet Corellia to inspect her company's factories and speak with government representatives regarding reducing export taxes.\nIn 13 BBY, Sal Graeff was present in Coronet Spaceport on Corellia when the spaceport was locked down due to the criminal Han Solo managing to bribe his way through the security checkpoint. She had already passed through the security check point prior to the lock down but travelers were prevented from moving further into the spaceport while a search was conducted. The Viceprex passed by Han as he desperately sort somewhere to hide from the Imperials looking for him.\nMelanah Sal Graeff had brown eyes, dark skin and black hair with white highlights.\nWhile in the spaceport, Sal Graeff wore a black uniform and belt with a black breath mask with an in-built comlink.\nMelanah Sal Graeff first appeared in the 2018 Anthology Series film, Solo: A Star Wars Story and was first identified by the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sal_(disambiguation)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sienar_Fleet_Systems",
  "/wiki/Viceprex",
  "/wiki/Planet",
  "/wiki/Corellia",
  "/wiki/13_BBY",
  "/wiki/Coronet_Spaceport",
  "/wiki/Han_Solo",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Era",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Spaceport",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Breath_mask",
  "/wiki/Comlink",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader"
 ]
}