{
 "name": "Melas  (Sarkan)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sarka"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sarkan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mottled gray"
     ]
    }
   ]
  }
 ],
 "content": "Melas was a physically deformed Sarkan who was exiled from his homeworld of Sarka for his gregarious and social ways, traits considered outrageous to the insular Sarkans. However, he absconded with a considerable fortune in smuggled metals and gems, allowing him to travel from world to world, seeing different sights and meeting all sorts of interesting beings. Shortly before the Battle of Yavin, Melas was a patron at Chalmun's Spaceport Cantina on the planet Tatooine.\nOriginally from the planet Sarka, Melas was born with physical deformities, resulting in a loss of status for he and his family. Melas thus spent his youth as an outcast, though his unusual appearance was not his greatest crime in the eyes of his fellow Sarkans.\nMelas' people typically despised off-worlders, viewing non-Sarkans as primitives and savages. However, Melas actually enjoyed the company of aliens and Humans, eschewing the formal greeting protocols mandated by his government. Melas' gregarious and social ways were an outrage, and he was exiled from his homeworld.\nHowever, exile did not pose much of a problem for Melas: Sarka was rich in precious metals and gems, and he was able to smuggle a considerable fortune off-planet when he was forced to leave. Melas used his riches to travel from world to world, seeing different sights and meeting all sorts of interesting beings, wanting nothing more than to see as many different species as possible.\nAbout a year before the Battle of Yavin, Melas was featured in a Star Tours advertisement for the planet Tatooine as a patron at Chalmun's Spaceport Cantina in Mos Eisley spaceport. In 0 BBY, the thirsty Sarkan barfly was present in the cantina, seated in a booth to the left of the entrance and next to another booth containing Chachi and Ohwun De Maal, a Duros couple.\nTo the protocol-bound Sarkans, Melas was always a troublemaker, both for displaying curiosity in other aliens and his gregarious, social ways. Despite his wealth, Melas was not entirely unaffected by his status as a Sarkan expatriate. He missed his homeworld on occasion and often spoke of its lush jungles, jewel-encrusted mountains, and beautiful cave-cities with a melancholy eloquence that belied his normally optimistic nature. However, Melas' insatiable curiosity for what was out there easily eclipsed his bouts of sadness.\nA broad-snouted Sarkan with mottled gray skin, Melas was born with physical deformities: Standing at 1.7 meters in height, he was unusually diminutive in stature for his species. He also had short, stubby claws and unusual, vibrant blue eyes that invited unwanted attention.\nMelas wore red and tan robes, along with a red turban. During his travels, he developed a fondness for smoking an Esoomian gruu pipe to heighten his awareness, and only rarely was he seen without the sweet-smelling device clasped in his scaly palms. Melas also carried a hold-out blaster and a credit voucher with 220,000 credits. He had numerous financial accounts totaling 2 million credits.\nMelas first appeared in the 1997 Special Edition re-release of the 1977 film Star Wars: Episode IV A New Hope. The character was created by redressing the puppet originally used for the Pacithhip prospector Ketwol, which was designed by Howie Weed, chief creature maker of the Special Editions.\nEffects supervisor John Knoll noticed that the back of the original puppet's head looked like a completely different creature—by covering Ketwol's trunk and tusks with a turban, using the back of Ketwol's head as Melas' face, and redressing the puppet with new clothing, a new character was made. Melas was shot and edited into the cantina footage, replacing Arleil Schous, a Defel whose off-the-shelf canine mask had long bothered A New Hope writer and director George Lucas.\nThe Melas character was first identified by name in the Star Wars Trilogy Sourcebook, Special Edition, a supplement for West End Games' Star Wars: The Roleplaying Game. The text was written by George R. Strayton, Paul Sudlow, and Eric S. Trautmann, and released on October 1, 1997.\nMelas was listed as an example of a Sarkan name in the 2003 Ultimate Alien Anthology, a revised and expanded edition of the Alien Anthology sourcebook for Wizards of the Coast's Star Wars Roleplaying Game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Melas",
  "/wiki/Melas_(Sarkan)",
  "/wiki/Sarkan/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Melas_(Human)",
  "/wiki/Human/Legends",
  "/wiki/Grand_Marshal/Legends",
  "/wiki/Sarka/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Gemstone/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Star_Tours/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Chachi_De_Maal",
  "/wiki/Ohwun_De_Maal/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Jungle/Legends",
  "/wiki/Mountain/Legends",
  "/wiki/Cave/Legends",
  "/wiki/City/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Turban/Legends",
  "/wiki/Esoomian/Legends",
  "/wiki/Gruu_pipe",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Credit_voucher",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Don_Bies",
  "/wiki/1997",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Pacithhip/Legends",
  "/wiki/Prospector/Legends",
  "/wiki/Ketwol/Legends",
  "/wiki/Howie_Weed",
  "/wiki/John_Knoll",
  "/wiki/Arleil_Schous/Legends",
  "/wiki/Defel/Legends",
  "/wiki/Canine",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/George_R._Strayton",
  "/wiki/Paul_Sudlow",
  "/wiki/Eric_S._Trautmann",
  "/wiki/October_1",
  "/wiki/2003",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Alien_Anthology",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Star_Tours:_The_Adventures_Continue",
  "/wiki/Alien_Encounters",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Special_Edition_Limited",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Q%26A",
  "/wiki/Star_Wars_Insider_71",
  "/wiki/Inside_the_Worlds_of_Star_Wars_Trilogy",
  "/wiki/Star_Wars:_Complete_Locations_(2005)",
  "/wiki/Databank_(original)",
  "/wiki/Category:Images_of_Melas",
  "/wiki/Convenient_Daily_Departures:_The_History_of_Star_Tours",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Time/Legends",
  "/wiki/Star_Wars:_Force_Collection"
 ]
}