{
 "name": "Melchi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Herglic"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Pelagia",
      "Melchi's Medical Relief"
     ]
    }
   ]
  }
 ],
 "content": "Melchi was a Herglic spacer native to the Tapani sector, captain of the medical frigate Benevolence and agent of House Pelagia.\nMelchi spent several decades running a small transport company on Pelagon in the Pelagia Province. He traveled across the entire sector shipping cargo or acting as a messenger service. It was honest work but not enough to make him financially stable. He was popular with all the noble houses and had many friends across the sector.\nWhen the Empire and House Mecetti moved against House Pelagia and devastated the capital world of Pelagon Melchi returned to find the remnants of Pelagia's mighty fleet drifting in orbit. He took command of a damaged Nebulon-B medical frigate the Benevolence and coordinated a relief effort. House Pelagia granted Melchi command of the frigate and he became a mobile relief unit traveling to disaster areas within the sector and offering medical assistance. The Great Council on Procopia subsequently voted to fund his operations since Melchi did not charge for his services.\nUnbeknownst to most outside of the Pelagia government and a selected few of his high ranking crew, Melchi relief efforts were actually a cover for smuggling cargo and information for House Pelagia. With the blessing of Procopia to travel freely throughout the sector, Melchi was able to supply Pelagia with weapons and military supplies to assist their re-armament program. Due to the large amount of respect that he had throughout the area he was never searched by sector authorities.\nMelchi had wrinkled gray skin and would speak with a loud booming voice punctuated with snorts from his blowhole. He always wore his captain's uniform and carried an ornate walking stick which he used to gesticulated during conversations. He also carries an ornate heavy blaster.\nHe was a kind individual who was willing to sacrifice his time to ease the suffering of others. He was stubborn about his belief and would aggressively share his views with others. Melchi was extremely loyal to House Pelagia and would enthusiastically go about his assignment to smuggle cargo for the house.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Herglic/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Pelagia",
  "/wiki/Melchi%27s_Medical_Relief",
  "/wiki/Spacer/Legends",
  "/wiki/Tapani_sector/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Benevolence",
  "/wiki/Pelagon",
  "/wiki/Pelagia_Province",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/House_Mecetti",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Great_Council_(Tapani_Federation)",
  "/wiki/Procopia/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Lords_of_the_Expanse",
  "/wiki/Platt%27s_Smugglers_Guide"
 ]
}