{
 "name": "Melina_Carniss",
 "display_name": "Melina Carniss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "7 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure",
      "Talon Karrde",
      "Ysanne Isard",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Melina Carniss was a dark-haired Human dance choreopgrapher for Jabba Desilijic Tiure who also served as a secret security officer.\nMelina Carniss served as a dancer and later a dance choreographer for Jabba Desilijic Tiure at his palace on the planet of Tatooine. She was also a secret security officer at the palace. In 4 ABY, she attempted to arrest Mara Jade, disguised as a dancer named Arica, when Jade tried to grab a blaster from one of the palace guards. Carniss thought Jade was part of an assassination attempt on Jabba by one of his rivals, Lady Valarian. However, Jade was not trying to kill Jabba, but instead Luke Skywalker, who was meeting with the Hutt.\nCarniss took Jade into custody and led her out of the throne room to the dungeons. However, as she turned Jade over to the Gamorrean guards, Jade used the Force to turn Carniss's blaster muzzle, causing her to shoot one of the Gamorreans. The guards turned on Carniss with their force pikes, giving Jade time to escape.\nTwo years after the death of Jabba, she was recruited by Talon Karrde, but she became a spy of Ysanne Isard during the Bacta War of 7 ABY. Carniss provided information regarding a smuggling shipment in the Alderaan system, leading to an ambush by Captain Ait Convarion's Star Destroyer Corrupter. The attack was repulsed successfully by Wedge Antilles' group. Karrde discovered her treachery and wanted to eliminate her immediately. However, Booster Terrik managed, with difficulty and at great expense, to persuade Karrde to leave her alive long enough to use her to feed misinformation to Isard and ultimately set the stage for the Battle of Thyferra. She captained the YT-1210 freighter Empress' Diadem during the Bacta War.\nTwo years later, Karrde would encounter a woman named Celina Marniss  who would, in fact, turn out to be Mara Jade. He hired her soon after he discovered this.\nIn Timothy Zahn's 1995 short story, \"Sleight of Hand: The Tale of Mara Jade\", he described the character of Melina Carniss as dark-haired, wearing a red jumpsuit, and crouching over the rancor pit after Oola was dropped in. This was later overridden, and the character in the red jumpsuit became Laudica. A Human female with black hair, wearing a white dress first appeared in the Special Edition release of Star Wars: Episode VI Return of the Jedi, but it is unconfirmed whether this character is Melina Carniss.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Melina_Carniss",
  "/wiki/7_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Talon_Karrde",
  "/wiki/Ysanne_Isard",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Assassin/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Death/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Force_pike/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Bacta_War",
  "/wiki/Second_ambush_in_the_Graveyard",
  "/wiki/Ait_Convarion",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Corrupter/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Booster_Terrik",
  "/wiki/Battle_of_Thyferra",
  "/wiki/YT-1210_light_freighter/Legends",
  "/wiki/Empress%27_Diadem",
  "/wiki/Timothy_Zahn",
  "/wiki/Sleight_of_Hand:_The_Tale_of_Mara_Jade",
  "/wiki/Laudica",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Tales_from_Jabba%27s_Palace",
  "/wiki/A_Time_to_Mourn,_a_Time_to_Dance:_Oola%27s_Tale",
  "/wiki/Mara_Jade_%E2%80%93_By_the_Emperor%27s_Hand_1",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}