{
 "name": "Mellora Falon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Granta Omega"
     ]
    }
   ]
  }
 ],
 "content": "Mellora Falon was a young Human female scientist. Shortly after the Battle of Naboo, she graduated from a prestigious scientific institute and then embarked on an expedition to Uriek, where she met and befriended Granta Omega, a Force Blank.\nDeveloping an attachment to Sith artifacts and an intense curiosity about the power of the Force after spending time with Omega, Falon later helped him capture Jedi Padawan Anakin Skywalker in a small gathering of their Sith-cult friends and associates on Coruscant.\nOmega had recently encountered Skywalker on the civil-war besieged planet of Haariden, where, by chance, he came into contact with the Jedi contingent that had come to rescue the very team of Senate-sponsored scientists in which Omega was posing as a legitimate member using the alias, \"Dr. Tic Verdun.\" The Senate had wished to defuse the civil war and secure peace by secretly sending a scientific expedition that would examine the planet's mineral rights and equitably divide the wealth among both sides of the conflict; Omega, interested in maintaining the civil war in order to secure for his own galactic business interests the world's total wealth, of course seized the opportunity to infiltrate the expedition team through a Senatorial contact. Young Skywalker, protecting the scientists, had impressed Omega with his statement that the Force sometimes \"frustrated\" the boy, and Omega acutely desired to study him further, and so planned the young Jedi's capture.\nRevealing now to a captured Skywalker that she had taken Jedi Darra Thel-Tanis' lightsaber, Mellora challenged the drugged young man to a duel. Although still under the influence of the tea-borne drug, Skywalker nearly defeated Falon before his Master suddenly appeared to rescue him, and Omega himself intervened, ordering all his fellow cultists to flee through a window. From there, he and Mellora headed back to Haariden, where Omega continued his titanite tests and the global resource mapping of the mineral.\nBut under assignment by the Jedi High Council, Kenobi and Skywalker further pursued Omega to Haariden.\nIn the end, as Omega and Falon fled the Jedi on a swoop bike under the erupting Kaachtari volcano, Omega pushed Falon off the vehicle and sped to safety. She was rescued by Obi-Wan Kenobi and Skywalker, then turned over to the Haaridan security forces.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Granta_Omega",
  "/wiki/Scientist/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Uriek",
  "/wiki/Void_in_the_Force",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith_cult/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Haariden",
  "/wiki/Mission_to_Haariden",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Tic_Verdun",
  "/wiki/Sano_Sauro",
  "/wiki/Darra_Thel-Tanis",
  "/wiki/Lightsaber/Legends",
  "/wiki/Titanite",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Kaachtari",
  "/wiki/Volcano/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi_Quest:_The_Master_of_Disguise",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}