{
 "name": "Melnea Arnthout",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Melnea Arnthout was a leader of a group of colonists on Tatooine. One of the crew members who crashed the Dowager Queen into Tatooine, Arnthout helped found Tatooine's first settlement. She owned a 2PO-series protocol droid that was captured by Jawas. The city Arnthout was named after her.\nMelnea Arnthout was the leader of the colonists who headed to Tatooine around 100 BBY with the intent of establishing a mining colony. Arnthout supervised the construction of temporary shelters, and organized mining and security details.\nUpon arrival, Arnthout and the colonists encountered a native alien species that were instinctive cowards, but coveted the colonist's technology. The first season after establishing the colony—named Bestine—was harsh; one of the colony ships, the Dowager Queen, crashed kilometers away from Bestine and denied the colonists vital supplies. Sandstorms nearly destroyed the settlement, most of the banthas disappeared, and the colonists barely grew enough food to survive. The theft of Arnthout's protocol droid, 2PO, enraged the settlers, forcing her to act. Arnthout knew that she had to assuage the colonist's fears, retrieve valuable property, and get the natives to stop interfering with their equipment and supplies.\nArnthout set out to negotiate with the natives, eventually rescuing a pair from a dewback that had it's front paw trapped. Freeing the dewback, she allowed the natives to saddle the beast and led it and her back to their camp. At the camp, Arnthout found her missing droid, 2PO, and learned that the natives were called Jawas. The Jawas had borrowed the droid out of curiosity rather than malice, and the protocol droid had learned about the Jawa's culture and language. Arnthout asked the droid to tell her all about them.\nArnthout negotiated a non-aggression pact with the Jawas, water rights, salvage rights to the Dowager Queen, and free trade of information. After Arnthout's meeting with the Jawas, the settlers adopted the Jawa name for the planet, learned about the planet's geography and native wildlife, and were warned about the planet's other native species, the Sand People.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Dowager_Queen/Legends",
  "/wiki/2PO-series_protocol_droid",
  "/wiki/Jawa/Legends",
  "/wiki/Arnthout/Legends",
  "/wiki/100_BBY/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Colony_ship/Legends",
  "/wiki/Kilometer/Legends",
  "/wiki/Sandstorm/Legends",
  "/wiki/Bantha/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/2PO",
  "/wiki/Dewback/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/West_End_Games",
  "/wiki/Between_A_Rock_And_A_Hard_Place",
  "/wiki/Galaxy_Guide_7:_Mos_Eisley",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Secrets_of_Tatooine",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Jawas",
  "/wiki/Star_Wars_Gamer_3",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}