{
 "name": "Mendegar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Deysum III"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Mendegar was a female bounty hunter active during the Galactic Civil War. Born Nell Wenn on Deysum III, the young woman aspired to be a police officer, joining the local Police Academy with dreams of eventually joining the Sector Rangers. However, her dreams were soon dashed as she found that many of her fellow officers were not noble public servants, but corrupt individuals who were no better than the criminals they hunted.\nWenn took her concerns to her superiors, expecting the corruption to be contained in her unit. Turned away with a lecture about the reality of the work and the need for public relations, she took her concerns direct to the planetary governor. The governor promised an investigation, but that night Wenn's apartment was firebombed. She survived, but her boyfriend did not.\nAfter recovering, Wenn resigned from the police force and began her own investigation into the bombing. As she dug deeper, she found that many of her former colleagues, including those responsible for the firebomb and her boyfriend's death, had corporate bounties on their heads. Taking the name Mendegar, she became accredited as a bounty hunter and took all the contracts related to her former colleagues. She conducted a mission of vengeance to prove that justice could prevail.\nMendegar continued working as a bounty hunter throughout the Outer Rim Territories, eventually using Tasariq as her main base of operations. She was primarily employed by Captain Kullan Velerinden, but took work from the Outer Rim all the way to the Inner Rim.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Deysum_III",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/Police_Academy",
  "/wiki/Sector_Ranger/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Tasariq",
  "/wiki/Captain/Legends",
  "/wiki/Kullan_Velerinden",
  "/wiki/Inner_Rim",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Tasariq:_The_Crystal_Planet",
  "/wiki/Star_Wars_Adventure_Journal_15"
 ]
}