{
 "name": "Menugg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gamorr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Vurrha's Blood"
     ]
    }
   ]
  }
 ],
 "content": "Menugg was a Gamorrean male who worked as a successful soldier on his homeworld of Gamorr. He was eventually persuaded to leave the planet by a group of off-worlders and began working as a mercenary throughout the galaxy. He later became affiliated with the criminal group known as Vurrha's Blood on the planet Tatooine, serving as a bodyguard for its leader, Vurrha Chur. Menugg was a master of conflict, specializing in melee combat and growing bored when he was not fighting.\nThe Gamorrean male Menugg was born on his species' homeworld of Gamorr, where he became a highly successful soldier, with numerous victories to his name and great success with female companions. His skill eventually attracted the attention of a group of off-worlders, who traveled across Gamorr to Menugg's village and persuaded Menugg to leave his home by showing him items and images from the outside galaxy. After leaving his home village, Menugg initially worked for those who had convinced him to leave Gamorr and soon made a name for himself as a mercenary.\nHe eventually joined the criminal group known as Vurrha's Blood on the planet Tatooine after its leader, the Quarren Vurrha Chur, was nearly assassinated. Menugg then served loyally as the Quarren's bodyguard for at least several years, traveling everywhere with him, a job for which he was very well paid. Chur was the only other member of the organization who spoke Gamorrean, so he let Menugg know what was happening on occasion. Menugg planned to one day use his riches to retire to Gamorr and build a large home for he and a family to live in.\nMenugg had green skin, yellow eyes, and black hair. He stood 1.9 meters tall while he served with Vurrha's Blood and, by that time, was extremely muscular, with permanently bloodshot eyes due to the number of blows he had taken to the head during his career. Even while still on Gamorr, Menugg lived for conflict, with melee combat being the type of fighting he found the most enjoyable. Long periods without violence, especially if others were talking, would bore the Gamorrean, although he was disciplined enough to endure it. On Gamorr, he was successful with Gamorrean sows and was pleased with his life. However, the lure of trinkets and images of other planets eventually persuaded him to leave his home, a decision that he never regretted. Menugg was extremely loyal to Chur due to the high wages the Quarren paid him, although his allegiance could be swayed by a persuasive competitor willing to pay more.\nWhile fighting on Gamorr, Menugg became a master of warfare, being capable in melee combat and proficient with a blaster. He was able to pilot a starship and knew how to use armor effectively. The only language that Menugg spoke and understood was Gamorrean.\nMenugg always wore padded armor and carried a thogk and a blaster rifle. He also wore a utility belt and carried a stash of 800 in his left boot.\nMenugg first appeared in Ultimate Adversaries, a book released in 2004 by Wizards of the Coast as a supplement to the Star Wars Roleplaying Game. In the book, Menugg's portrait was illustrated by Daniel Falconer, and the character is one of a large number of possible adversaries provided for use in the game. He is usable in any of the three eras of play that were available at the time of the book's release, the Rise of the Empire era, the Rebellion era, and the New Republic era. As such, this article makes no assumptions as to what time frame Menugg was active during, although the book suggests that if the Gamorrean is being used during the Rise of the Empire era or the New Republic era, he could be working as a bodyguard for a noble or politician. Although it is not clear when Menugg was active, the entry for Ereen Agar, another member of Vurrha's Blood, in The Complete Star Wars Encyclopedia establishes that Vurrha Chur operated during the Galactic Civil War.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Gamorr/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Vurrha%27s_Blood",
  "/wiki/Soldier/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Vurrha_Chur",
  "/wiki/Reproduction/Legends",
  "/wiki/Species/Legends",
  "/wiki/Menugg%27s_village",
  "/wiki/City/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Gamorrese",
  "/wiki/Standard_day/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Time/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Language/Legends",
  "/wiki/Padded_armor",
  "/wiki/Thogk",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Credit",
  "/wiki/Boot/Legends",
  "/wiki/Ultimate_Adversaries",
  "/wiki/2004",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Daniel_Falconer",
  "/wiki/Roleplaying_game",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Rebellion_era",
  "/wiki/New_Republic_era",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Ereen_Agar",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galactic_Civil_War/Legends"
 ]
}