{
 "name": "Merai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dac"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "over Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Merai was a Mon Calamari commander who joined the ranks of the Confederacy of Independent Systems during the Clone Wars and paid dearly for his act of secession in the First Battle of Kamino.\nConsidered one of the greatest Calamari commanders of his time and one of the most decorated heroes of the Quarren War, Merai joined the Confederacy following the attack on his homeworld by the Force Harvester. Passel Argente quickly gave him his first order: to strike at the heart of the Republic's clone army—Kamino itself. He acquired the coordinates for the main reactor of Tipoca City from the Corporate Alliance, enabling him to cut off the supply of clone troopers for the Republic. The fact that the information had little background and no supporting evidence didn't bother Merai, who went with his gut instinct and attacked Kamino. His starfighters engaged with the Jedi protecting Kamino, and the battle began to go well for the Separatists.\nSuddenly, Merai's ship was shot down, though the commander didn't give up. He piloted his starfighter, Shark, out of his downed command ship to destroy the main reactor himself. It was then he realized he had been fooled. The information was false, and Merai found himself surrounded by Delta-7 Aethersprite-class light interceptors. Merai drew the Jedi away from his forces who were still attacking the Kaminoan defenses, though he knew the battle was lost. In a last-ditch effort, he flew Shark into the midst of the hyperdrive docking rings used to transport the Jedi Starfighters to and from Kamino. He sacrificed himself by blowing up his ship, taking many hyperspace rings out and allowing his forces to retreat.\nUnlike other Separatist commanders, Merai valued battle droids as soldiers rather then expendables. He viewed the crew of his ship who were also Mon Calamari as family and was willing to die for them so that they would continue fighting the Republic and Jedi. Merai believed in what the Confederacy of Independent Systems stood for and believed it was the galaxy's greatest hope for freedom.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/22_BBY/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/First_Battle_of_Kamino",
  "/wiki/Quarren_War",
  "/wiki/Attack_on_Mon_Calamari_(Clone_Wars)",
  "/wiki/Force_Harvester",
  "/wiki/Passel_Argente/Legends",
  "/wiki/Tipoca_City/Legends",
  "/wiki/Corporate_Alliance/Legends",
  "/wiki/Shark_(starfighter)",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Kaminoan/Legends",
  "/wiki/Hyperdrive_docking_ring",
  "/wiki/Republic_50",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blood-Feud:_Warriors_of_the_Deep!",
  "/wiki/Star_Wars_Insider_129",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded"
 ]
}