{
 "name": "Mercos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Special Forces",
      "Rebel Alliance Special Forces"
     ]
    }
   ]
  }
 ],
 "content": "Commander Mercos was a male human member of the Alliance to Restore the Republic's Special Forces. After the Battle of Yavin, Mercos was stationed at Echo Base, the Alliance's secret base located on the planet of Hoth, when the enemy Galactic Empire attacked. Although the Alliance massively evacuated the planet, Mercos was left behind, and he survived alone on Hoth for weeks after the battle.\nDuring the Imperial blockade of the Anoat sector, Mercos joined the Smuggler's crew, who dispatched the Rebel on a variety of missions throughout the sector.\nAlthough he was soft-spoken, Mercos became a figure of awe among the Alliance personnel of the Anoat sector because of his past ordeal on Hoth.\nMercos was created for the canon mobile game Star Wars: Uprising, which was developed by Kabam for iOS and Android platforms and released in 2015, where he is a unique 5 star crew member. This article assumes 100% game completion of Star Wars: Uprising, which means the Smuggler acquired Mercos as a member of their crew and dispatched him on Crew Runs.\nWhile on Crew Runs, Mercos provides a bonus to all Technical Crew on the same Run.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Commander",
  "/wiki/Battle_of_Yavin",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Hoth",
  "/wiki/Standard_week",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Iron_Blockade",
  "/wiki/Anoat_sector",
  "/wiki/The_Smuggler",
  "/wiki/Sector",
  "/wiki/Kabam",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back"
 ]
}