{
 "name": "Merili",
 "display_name": "Merili",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Born",
     "values": [
      "27 BBY",
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Fi",
      "Kashyyyk orbit"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Nightsisters"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Nightsisters",
      "Secret Order of the Empire",
      "Galactic Empire",
      "Church of the Dark Side"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Cronal",
      "Sariss"
     ]
    }
   ]
  }
 ],
 "content": "Merili was a Human female from the planet Dathomir who served as a dark side Prophetess during the time of the Galactic Empire. Initially found among the Nightsisters by the Supreme Prophet Kadann, Merili was presented to Emperor Palpatine and inducted into the ancient cult of the Prophets of the Dark Side. Due to a number of factors in her training under Prophet Cronal, she was known by Kadann and Palpatine to have been completely insane, and both manipulated Merili throughout her life to serve their various desires. Eventually, she became one of only two Emperor's Eyes and was later trained in the Dark Force religion by the Dark Jedi Sariss.\nFollowing her induction into the Prophets of the Dark Side, Palpatine took advantage of Merili's insanity and used her to control the Wookiee homeworld of Kashyyyk. Under her command, Kashyyyk was virtually pacified, and the Wookiees kept in line through her use of the Force and dark side beasts. During her time on the jungle planet, Merili came to think of the world as her own \"kingdom,\" thus further demonstrating her insanity to her masters. As guardian of Kashyyyk, Merili assisted the scientists Nycolai Kinesworthy and the mad Treun Lorn in the development of the N-K Project. Merili would eventually lead the two men to a secret storehouse on the planet Utapau where they obtained the body of the late General Grievous to act as the host for the N-K Project.\nBorn on the planet of Dathomir, Merili was trained by the Witches of Dathomir from birth, as was the custom for all Force-sensitive females on the planet, though unlike most others she then became a member of the Nightsisters. At an unknown time, the Supreme Prophet Kadann visited the planet and was impressed with Merili's strong connection to the dark side of the Force—however, he was disturbed by what he could sense to be unbridled madness in her. Nevertheless, when she asked him if she could become a Prophet he accepted her for training, and took her with him back to the Empire. During her training, Merili was tutored by another Prophet, Cronal, becoming what he considered to be his greatest student. He taught Merili how to use Darksight, a way to see and manipulate the future. Excited by this new ability, she began to alter and add to Cronal's teaching. In an effort to increase her own powers over the future, Merili delved into Aing-Tii flow-walking, Dathomirian Heartshadow, and began her own personal experiments in manipulating the space-time continuum through the dark side. Although her efforts resulted in a greater mastery of the future than her teacher, she was driven supertemporally insane.\nEventually, Merili and Kadaan traveled the distance back to the heart of Imperial space. Once there, Kadann introduced her to the Emperor, who she won over with her raw power and her utterly dark nature, which the two of them shared. Palpatine, like Kadann, only wanted to use her considerable power, though he too recognized the madness within her. To this end, he assigned her to oversee the Imperial occupation of the Wookiee homeworld of Kashyyyk, where Palpatine hoped Merili's insanity would not interfere with his own plans of galactic control.\nIt was during this time, however, that Palpatine discovered a special gift which Merili possessed; though she could see the future as any other Prophet could, her mind also somehow existed there, causing her not only to be able to see the future but also, on certain occasions, manipulate it. Palpatine recognized the dangers that this power posed for Merili's sanity, but nevertheless selected her to become one of his two Emperor's Eyes.\nAssigned a complement of five Star Destroyers and nine Imperial garrisons under her direct command, she held Kashyyyk and its star system in an iron grip. Using her Force powers and the formidable Force Wraiths she called forth from the dark side, Merili kept the native Wookiees in line. Another tactic of hers was to use threats against the weak and young which she had carried out often in her madness, thus letting the Wookiees know she would not tolerate resistance. In addition, she had three adult rancors from her home planet who served as her guards and constant companions.\nThough her powers did not match that of fellow Prophets Jedgar or Kadann, many people who knew of her believed her to be the most dangerous of the Prophets due to her unrestrained insanity. Her speech and mannerisms reflected this: at one moment she would be completely calm, speaking with a measured voice, while the next she would be shrieking, quite animated, and acting very wild. Due to these characteristics, Merili was able to keep the Wookiees of Kashyyyk in line, and was known to use her insanity to further this end. During her tenure on the planet she was known to have watched over Nycolai Kinesworthy while he was creating advanced combat droid technologies in the Myyydril Caverns. It was Merili that led Kinesworthy and Treun Lorn to the Emperor's secret storehouse on the planet Utapau. There, they retrieved the dead body of General Grievous, and used it in the construction of N-K Necrosis, as part of the N-K Project.\nSometime before the Battle of Endor, which would witness the fall of the Empire, Merili was trained further in the ways of the Dark Force religion by fellow Prophetess Sariss. Under the guidance of Sariss, Merili joined the secretive Church of the Dark Side, which was under the guidance of former Prophet Cronal. The role of the Church was ultimately to sow dissension amongst the various rival Imperial Remnant warlords, thus preventing any one ruler from sitting on the Imperial throne.\nEventually, Merili became the spiritual adviser of Grand Admiral Peccati Syn, who had grown up a follower of the Sacred Way, a religion which the Empire had declared illegal. Having strong roots in religion, Syn was a fanatic devotee to the Church of the Dark Side, and thus Merili was able to manipulate the Grand Admiral. Due to her manipulation of Syn, Merili was able to achieve the Church's secretive ends and neutralize him as a threat to the throne.\nHowever, Merili herself also perished onboard Syn's flagship in combat with Admiral Ackbar over Kashyyyk.\nDue to her seduction by the dark side, and the use of special powers she possessed, Merili had turned completely insane. Her insanity allowed her to brutally subjugate the Wookiee homeworld of Kashyyyk, and keep its fierce inhabitants in line. Nonetheless, it was because of her special ability of being able to influence future events that Merili's mind had begun to come apart under the stresses of temporal ambiguity, thus making her hold on reality tenuous at the best of times.\nThough she was not as powerful in the Force as other Prophets of the Dark Side, Merili was believed by many to have been the most dangerous of the Force-users among the group. Nonetheless, Merili had a limited scope regarding her own ambitions and was comfortable with the control she enjoyed over Kashyyyk—what she referred to as \"her kingdom.\" It was this decision on her part which spared the rest of the galaxy from witnessing her insanity at large, an insanity which could have easily grown out of control due to her ambition.\nMerili had long, wild black hair and startling amber eyes. Rather than wearing the proper star robes of the Prophets of the Dark Side, Merili chose instead to wear the traditional reptile-scale armor of the Witches of Dathomir covered entirely in an ordinary robe, which made her look both unarmored and weaponless. Her weapons included a poison-coated dagger which she hid in a sheath on the upper portion of her right arm, as well as her walking staff which was a disguised power weapon and could be activated by pressing a stud with her thumb.\nHaving been raised among the Nightsisters of Dathomir, Merili was known to have had a very strong connection to the dark side of the Force. She was believed by many to be purely evil, sharing this common ground with Palpatine who was delighted to have her powers at his disposal. In battle she preferred relying on her Force Wraiths and the mind-controlled Wookiees for physical combat, though she would resort to fighting by herself if she was in immediate danger. Merili was one of only two female Prophets of the Dark Side, sometimes referred to as Prophetesses, though she did not openly associate herself with them, neither wearing their star robes or visiting the first Church of the Dark Side on Coruscant or the headquarters station Scardia.\nAmong her many dark side powers, Merili was adept at being able to gaze into the future—a power shared with her fellow Prophets of the Dark Side. However, the difference with Merili was that she was able to project a part of her mind into the future as well, and exist there while viewing its events. These powers were due to her having studied Darksight with Lord Cronal, and adding to his teachings with studies into Aing-Tii flow-walking and Dathomirian Heartshadow. Due to this uncanny ability, not only was she able to perceive events in the future, but on certain occasions she was able to actually influence them, similar to what a Jedi Master could achieve with battle meditation. Owing to her special power, Merili was recruited to serve as one of the Emperor's Eyes, a special level of Dark Side Adept loyal only to Palpatine.\nMerili was originally created for an article in Polyhedron 103, where she was named Merili. Abel G. Peña later reused the character and seemingly misspelled her name as Merilli for the \"Who's Who: Imperial Grand Admirals\" article in Star Wars Insider 66, though he later corrected it in both The Dark Forces Saga and The Story of General Grievous: Lord of War where she was once again named Merili. The character was again referenced by Peña in an article on the Star Wars Blog, The Imperial Warlords: Despoilers of an Empire.\nWhen asked on the StarWars.com message boards whether or not the backstory in the early Polyhedron should be considered canon, Peña stated that it should be so unless a future source contradicts it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Prophets_of_the_Dark_Side",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Prophetess",
  "/wiki/Dathomir/Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Silooth_(Star_Destroyer)",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Human/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Black",
  "/wiki/Nightsisters/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Church_of_the_Dark_Side",
  "/wiki/Cronal",
  "/wiki/Sariss",
  "/wiki/Planet/Legends",
  "/wiki/Supreme_Prophet",
  "/wiki/Kadann",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Emperor%27s_Eye",
  "/wiki/Dark_Force",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Nycolai_Kinesworthy",
  "/wiki/Treun_Lorn",
  "/wiki/N-K_Project",
  "/wiki/Utapau/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Darksight",
  "/wiki/Aing-Tii/Legends",
  "/wiki/Flow-walking",
  "/wiki/Heartshadow",
  "/wiki/Space-time_continuum",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_Wraith",
  "/wiki/Rancor/Legends",
  "/wiki/Jedgar",
  "/wiki/Battle_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Myyydril_Caverns",
  "/wiki/N-K_Necrosis",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Warlord/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Peccati_Syn",
  "/wiki/Sacred_Way/Legends",
  "/wiki/Liberation_of_Kashyyyk/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/First_Church_of_the_Dark_Side",
  "/wiki/Coruscant/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Scardia_Station",
  "/wiki/Battle_meditation",
  "/wiki/Dark_Side_Adept",
  "/wiki/Polyhedron_103",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/The_Story_of_General_Grievous:_Lord_of_War",
  "/wiki/Star_Wars_Blog",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/StarWars.com",
  "/wiki/Polyhedron",
  "/wiki/Prophets_of_the_Dark_Side:_Villains_for_the_Star_Wars:_New_Republic_Campaign,_Part_One",
  "/wiki/Dangers_from_the_Dark_Side:_Villains_for_the_Star_Wars:_New_Republic_Campaign,_Part_Two",
  "/wiki/Polyhedron_104",
  "/wiki/Star_Wars_Insider",
  "/wiki/Wizards.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Blogs"
 ]
}