{
 "name": "Meriva_Greef",
 "display_name": "Meriva Greef",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "204th Imperial Fighter Wing",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Meriva Greef was a human female sergeant in the Galactic Empire's 204th Imperial Fighter Wing, serving as ground crew aboard the Imperial I-class Star Destroyer Pursuer. Following the Battle of Endor in 4 ABY, Lieutenant Yrica Quell, who was in shock from the products of the battle, slept in the same bed as Greef for comfort. Quell deserted the fighter wing shortly after.\nBy 5 ABY, Greef was elevated to join the ranks of the 204th's pilots. Quell also returned to the unit around that year and met Greef again during a celebration. Greef was congratulated on her promotion to pilot, but expressed that it was not how she wanted to leave the ground crew.\nDuring the Galactic Civil War, Meriva Greef served in the Galactic Empire's 204th Imperial Fighter Wing as a ground crewmember with the rank of sergeant aboard the fighter wing's flagship, the Imperial I-class Star Destroyer Pursuer. Shortly after at least one 204th squadron patrolled the outskirts of the celestial body Cathar, Greef discovered one of the pilots, Yrica Quell, scrubbing her flight suit of a bile stench. In the days after the Battle of Endor and the death of Emperor Palpatine in 4 ABY, Quell, who was in shock from the recent events, slept in the same bed as Greef for warmth and comfort. Quell then deserted the 204th following the genocide on the planet Nacronis, which took place two weeks after Endor.\nGreef continued to serve the 204th and was promoted to TIE pilot and rostered to one of the 204th's squadrons by 5 ABY. Quell returned to the fighter wing around that year and worked frequently with the ground crew of the Yadeez, a bulk freighter which became 204th's flagship after the loss of its other starships. One day, the 204th's pilots got together to celebrate the birthday of Shakara Nuress, the former commanding officer of the fighter wing who had since died in battle. Greef attended and greeted Quell for the first time since her desertion. Seeing Greef's flight suit, Quell congratulated her on her elevation to pilot. Greef remarked that it had not been how she had intended to leave the ground crews.\nMeriva Greef was a human female with dark skin, a thin face and a high pitched voice which Yrica Quell found comical. She allowed Quell to sleep in her bed to comfort the latter while she was in shock with the outcome of the Battle of Endor. had been eager to fly for the 204th, but expressed to Quell that the circumstances she had been transferred for were not what she had intended, although her tone did not convey disappointment to the other pilot.\nMeriva Greef was first mentioned in the 2019 novel Alphabet Squadron, the first volume in the Star Wars: Alphabet Squadron trilogy, written by Alexander Freed. She first appeared in the final volume of Freed's trilogy, the 2021 novel Victory's Price.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Soran_Keize",
  "/wiki/Sergeant",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Pursuer",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Lieutenant",
  "/wiki/Yrica_Quell",
  "/wiki/Fighter_wing",
  "/wiki/5_ABY",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Standard_year",
  "/wiki/Pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Military_rank",
  "/wiki/Flagship",
  "/wiki/Squadron",
  "/wiki/Cathar_(astronomical_object)",
  "/wiki/Standard_day",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Destruction_of_Nacronis",
  "/wiki/Planet",
  "/wiki/Nacronis",
  "/wiki/Standard_week",
  "/wiki/Endor",
  "/wiki/Yadeez",
  "/wiki/Bulk_freighter",
  "/wiki/Starship",
  "/wiki/Shakara_Nuress",
  "/wiki/Commanding_officer",
  "/wiki/Attack_on_Pandem_Nai",
  "/wiki/Flight_suit",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/2021",
  "/wiki/Victory%27s_Price",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/TIE_Fighter_1",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Jakku",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)"
 ]
}