{
 "name": "Merl_Cobben",
 "display_name": "Merl Cobben",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance Starfighter Corps",
      "Resistance Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Merl Cobben was a human male A-wing pilot in the Resistance. During a skirmish, he was saved by fellow pilot Tallissan Lintra, to whom he then felt indebted. In 34 ABY, he participated in the Battle of Crait and was one of the few Resistance members to survive and escape from the planet Crait.\nBy 35 ABY, he was stationed in the Resistance base on the moon Ajan Kloss, where he mourned the death of General Leia Organa after her passing. Prior to the Battle of Exegol, he hugged fellow pilot Allie Samta and, after the Resistance emerged victorious at Exegol, celebrated the victory at the base.\nMerl Cobben was a human male who served as an RZ-2 A-wing interceptor pilot in the Starfighter Corps of the Resistance during its war against the First Order. Fellow Resistance pilot Tallissan Lintra saved Cobben's life during a skirmish, leaving him feeling indebted to her; however, he outlived his comrade, who perished during the Battle of Oetchi in 34 ABY. Shortly after this, Cobben took part in the Battle of Crait, in which the surviving personnel of the destroyed Resistance fleet made a final stand against the First Order in an outpost on the planet Crait. Cobben was one of the small number of Resistance members who managed to survive the battle and escape.\nBy 35 ABY, Cobben was stationed in the Resistance's new headquarters on the moon Ajan Kloss. When the Resistance's leader, General Leia Organa, passed away, Cobben and many others gathered around her body to mourn in silence. He later spoke to a member of the Resistance ground crew near the CR90 corvette Tantive IV when the protocol droid C-3PO announced that the astromech droid R2-D2 was receiving a transmission.\nThe message was from their ally Rey, who was sending the Resistance a route to reach the planet Exegol, where the First Order and the Sith Eternal were amassing a fleet to take over the galaxy. The Resistance used this route to plan an attack on Exegol, and, after the planning meeting, Cobben rushed through the base on Ajan Kloss and hugged fellow pilot Allie Samta when he ran into her. After the Resistance defeated the First Order and the Sith at Exegol with the aid of the Citizens' Fleet, Cobben and Samta were among those who celebrated the victory at the Ajan Kloss base, with Cobben standing on an A-wing starfighter and cheering among the crowds.\nCobben was a distracting daredevil and after the Battle of Crait, he flew to honor the memory of his fallen comrades, particularly Lintra, to whom he still felt indebted. He had brown hair, light skin, and blue eyes.\nCobben wore a green flight suit with a white flight harness and a FreiTek Incorporated life support unit. He also wore a green A-wing pilot's helmet, a pair of black boots, and a pair of gray gloves. He flew a white and blue RZ-2 A-wing interceptor.\nMerl Cobben was portrayed uncredited by actor Mick Cobb in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker. The character was identified by the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo and utilized a tuckerization of Cobb's name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_Starfighter_Corps",
  "/wiki/RZ-2_A-wing_interceptor",
  "/wiki/Resistance_pilot",
  "/wiki/Pilot",
  "/wiki/Tallissan_Lintra",
  "/wiki/34_ABY",
  "/wiki/Battle_of_Crait",
  "/wiki/Planet",
  "/wiki/Crait",
  "/wiki/35_ABY",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Death",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Battle_of_Exegol",
  "/wiki/Allie_Samta",
  "/wiki/Exegol",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Resistance_navy",
  "/wiki/Crait_outpost",
  "/wiki/Resistance_ground_crew",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Rey_Skywalker",
  "/wiki/Sith_Eternal",
  "/wiki/Final_Order",
  "/wiki/The_galaxy",
  "/wiki/Sith",
  "/wiki/Citizens%27_Fleet",
  "/wiki/A-wing_starfighter",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Flight_suit",
  "/wiki/Flight_harness",
  "/wiki/FreiTek_Incorporated",
  "/wiki/Life_support",
  "/wiki/Helmet",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Mick_Cobb",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tuckerization",
  "/wiki/Category:Images_of_Merl_Cobben",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Heralds_of_Hope_Squadron_Pack",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Oetchi_system",
  "/wiki/Battle_of_Yavin",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/December_20"
 ]
}