{
 "name": "Merratt Jaxton",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "44 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free AlliancesGalactic Alliance Starfighter Command",
      "Galactic Alliance Starfighter Command",
      "Imperial-Alliance conspiracy"
     ]
    }
   ]
  }
 ],
 "content": "Merratt Jaxton was a Human male General who served in the Galactic Alliance Starfighter Command and the Chief of Starfighter Command during the time following the Second Galactic Civil War. Apparently loyal to Galactic Federation of Free Alliances Chief of State Natasi Daala as the tensions between the Galactic Alliance and New Jedi Order escalated, and he was the one who recommended the prosecution of Cha Niathal. However Jaxton soon became involved in a conspiracy to remove Daala and restore the Galactic Empire and partly through these actions he became a member of the governing Triumvirate that replaced Daala.\nMerrat Jaxton was a Human male who served the Galactic Alliance Armed Forces. He achieved the rank of Chief of Starfighter Command during the years after the Second Galactic Civil War when many previous high-ranking officers had to be replaced. He was close to Chief of State Natasi Daala and informed her that certain members of the Officer Corps were unhappy with the way she was handling the tensions between the government and the Jedi Order. It was his recommendation that she institute an impartial prosecution of Cha Niathal for dereliction of duty during Darth Caedus' rise to power during the Second Galactic Civil War, in order to appease the displeased officers and to show to the public that government officials were not spared the same prosecution that led to the conviction of Grand Master Luke Skywalker, since both made the same mistake of trusting Caedus.\nUnknown to Daala, Jaxton conspired with Kuati Senator Haydnat Treen and Moff Drikl Lecersen to overthrow Daala's administration and High Moff Jagged Fel of the Imperial Remnant. The end plot was to reinstate the former Galactic Empire by gradually combining the Alliance and Remnant to create a new government. Once the new Empire became a reality, Lecersen and Treen intended to rule the reinstated New Order as Emperor and Empress. Jaxton met with Lecersen, Treen and Senator Fost Bramsin to discuss the number of naval officers that would join their cause. This led to them discussing the senior naval officer, Admiral Nek Bwua'tu, and the likelihood of his willingness to participate in the overthrow of the Chief of State. However, his loyalty to Daala made him incorruptible and, while Lecersen wanted to use subtle means to corrupt Bwua'tu, Jaxton proposed to simply assassinate him.\nJaxton was one of the people who were held hostage aboard the Errant Venture during the sabacc tournament. He was upset due to his loss to Wynn Dorvan. After returning to Coruscant, he was debriefed personally by Daala. Afterward, he met with his fellow conspirators at a starfighter Holosimulator, where they discussed their further plans.\nAfter the Jedi staged a coup d'état against Daala's regime, just as the conspirators were about to launch their own coup, Treen negotiated with Acting Grand Master Saba Sebatyne to form a coalition government so as to gain support from all branches of the government and military while keeping their plans for a new Galactic Empire on track. The Senate agreed to the measure and the office of the Chief of State was suspended and replaced by a Triumvirate for an indefinite period of time. The first triumvirs were composed of of Sebatyne, to represent the Jedi; Treen, for the Senate; and Jaxton, for the military.\nSometime later, Jaxton was removed from his position as triumvir and was replaced by Wynn Dorvan, a former Chief of Staff under the Daala Administration and later the first Triumvirate. When the conspiracy ultimately collapsed due to infiltration by the Lost Tribe of Sith, Jaxton became a loose end who endangered the conspirators with his intimate knowledge of the plot to recreate the first Galactic Empire. As a consequence, General Stavin Thaal, a fellow conspirator, forced Jaxton to commit suicide.\nJaxton was a Human male of average height with a squarish build that the public expected for a military leader. He was considered handsome by Senator Treen but also flighty as well. He was a skilled marksman, with the ability to fire a blaster pistol from his hip and still hit a target fifty meters away with great accuracy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/44_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Starfighter_Command",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/General/Legends",
  "/wiki/Chief_of_Starfighter_Command_(Galactic_Alliance)",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/New_Jedi_Order",
  "/wiki/Cha_Niathal",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Triumvirate_(Galactic_Alliance)",
  "/wiki/Galactic_Alliance_Defense_Force",
  "/wiki/Officer/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Luke_Skywalker",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Kuati/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Haydnat_Treen",
  "/wiki/Moff/Legends",
  "/wiki/Drikl_Lecersen",
  "/wiki/High_Moff",
  "/wiki/Jagged_Fel",
  "/wiki/Imperial_Remnant",
  "/wiki/New_Order/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Fost_Bramsin",
  "/wiki/Admiral/Legends",
  "/wiki/Nek_Bwua%27tu",
  "/wiki/Errant_Venture/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Wynn_Dorvan",
  "/wiki/Starfighter/Legends",
  "/wiki/Holosimulator",
  "/wiki/Jedi/Legends",
  "/wiki/Plan_Delta",
  "/wiki/Saba_Sebatyne",
  "/wiki/Galactic_Alliance_Senate",
  "/wiki/Office_of_the_Chief_of_State",
  "/wiki/Chief_of_Staff/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Stavin_Thaal",
  "/wiki/Suicide/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)",
  "/wiki/Cal_Omas",
  "/wiki/28_ABY/Legends",
  "/wiki/40_ABY",
  "/wiki/41_ABY",
  "/wiki/Padnel_Ovin",
  "/wiki/Abeloth",
  "/wiki/Rokari_Kem",
  "/wiki/Gial_Gahan",
  "/wiki/Nu_Toreena",
  "/wiki/Bail_Antilles_(Galactic_Alliance)",
  "/wiki/130_ABY",
  "/wiki/Gar_Stazi"
 ]
}