{
 "name": "Mervais_Gandor",
 "display_name": "Mervais Gandor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Jakku"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "204th Imperial Fighter Wing",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Mervais Gandor was a human male who served in the Galactic Empire's 204th Imperial Fighter Wing. Formally an ordnance specialist, he came to be an Imperial Starfighter Pilot for the fighter wing by 5 ABY. When Lieutenant Yrica Quell returned to the unit from desertion, Gandor guarded her in an unpowered turbolift before Colonel Soran Keize arrived to speak with the deserter.\nWhile the 204th was faced by a New Republic starfighter wing at the planet Chadawa, Gandor spoke with Wild Leader Denish Wraive, with whom he sung half a dozen verses of \"The Khuntavaryan Fall.\" When the fighter wing then joined the larger Empire at the planet Jakku, Gandor spoke with his brother Sliblis, who served on another Imperial vessel.\nDuring the Battle of Jakku, the 204th used radiation to silence New Republic starships before destroying them. The starfighter wing from Chadawa, however, soon arrived to intervene. When two of the New Republic pilots spoke over an open channel, Gandor questioned the pilot Chass na Chadic on which fighter she flew. Wraive called the Imperial pilot out shortly after, taunting him. During the ensuing dogfight, Gandor was killed, and his name was later lamented by another 204th pilot.\nMervais Gandor raised bantha calves on his homeworld before eventually becoming an ordnance specialist aboard the Imperial I-class Star Destroyer the Pursuer, the flagship of the Galactic Empire's 204th Imperial Fighter Wing. He was considered the clumsiest of the ordnance specialists on the Pursuer by Lieutenant Yrica Quell prior to her desertion from the 204th two weeks after the Battle of Endor in 4 ABY.\nAround 5 ABY, the 204th attacked New Republic forces led by General Hera Syndulla in the Cerberon system, but were forced to flee on a bulk freighter shortly after. Quell returned to the fighter wing during the escape and Gandor guarded her at an unpowered cargo turbolift turned brig. Once Colonel Soran Keize—the 204th's commanding officer—arrived, the ordnance specialist advised Quell through an intercom to stand back and the cell opened for the colonel to speak to the deserter, who wished to rejoin the 204th.\nLater that year, the 204th was working with a larger group of the Empire. Under orders by Grand Moff Randd, the fighter wing carried out a string of genocides on worlds that had parted from the Empire. By around this time, Gandor flew as an Imperial Starfighter Pilot for the unit. During the unit's mission, however, it was pursued by Syndulla's forces through a number of star systems. At the 204th's next target, the planet Chadawa, the fighter wing hid under the world's defensive mechanical rings after briefly engaging the local Chadawan navy. A starfighter wing deployed from Syndulla's flagship, the refitted Star Destroyer Deliverance, and made short attacks on the 204th as its forces worked towards devastating Chadawa.\nWhile both parties were at a stalemate, New Republic personnel used a comm channel to speak to the 204th pilots, some getting responses. Gandor interacted with Denish Wraive, the leader of the New Republic's Wild Squadron. Although Wraive was reluctant to share names of his comrades, the pair came to sing half a dozen verses of \"The Khuntavaryan Fall,\" which they were ultimately not able to finish. The Deliverance's starfighter wing soon engaged the 204th head on, and the fighter wing escaped while the Chadawan navy attacked Syndulla's forces.\nThe 204th rendezvoused with a large remaining portion of the Empire at the planet Jakku, which awaited a last stand with the New Republic. Gandor was permitted by Keize to speak with his brother Sliblis, who served aboard the Executor-class Star Dreadnought Ravager. The pair spoke over hologram and wept as they exchanged stories. The New Republic soon launched an attack on the Empire at Jakku. During the battle, the 204th reproduced particle effects that were seen at Chadawa and used the subsequent radiation to sever the communications of enemy starships before swiftly defeating them. The fighter wing, Gandor among the unit, used this tactic to destroy the heavy cruisers Brightsaber, Serenade and Hunting Hound.\nSyndulla identified the 204th's new method and sent the Deliverance's starfighter wing after the Imperial fighter wing. When the New Republic fighter wing found the 204th, the New Republic pilots Nath Tensent and Chass na Chadic conversed over an open channel. Gandor questioned over the channel whether Chadic was the pilot who flew a A/SF-01 B-wing starfighter, trying to figure out which fighter she was in. After the pilot mentioned Wraive's name, the Wild Squadron leader called Gandor out, taunting him about not finishing \"The Khuntavaryan Fall.\" The two wings engaged, each losing fighters in the ensuing engagement. Gandor eventually perished, and his name was called out when both sides began reciting names of their lost comrades over the comm channel.\nMervais Gandor was a human male. His accent gave the impression of a working-class resident of the Core Worlds to Nath Tensent. Gandor also came across as clumsy to Yrica Quell. At Jakku, he wept when making contact with his brother again. Gandor was also curious to find things out about the Deliverance's starfighter wing, inquiring with Denish Wraive and also seeking to find out which fighter Chass na Chadic flew.\nMervais Gandor first appeared in the 2020 novel Shadow Fall, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Jakku",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Fighter_wing",
  "/wiki/Lieutenant",
  "/wiki/Yrica_Quell",
  "/wiki/Turbolift",
  "/wiki/Colonel",
  "/wiki/Soran_Keize",
  "/wiki/New_Republic",
  "/wiki/Deliverance%27s_starfighter_wing",
  "/wiki/Planet",
  "/wiki/Chadawa",
  "/wiki/Wild_Leader",
  "/wiki/Denish_Wraive",
  "/wiki/The_Khuntavaryan_Fall",
  "/wiki/Sliblis",
  "/wiki/Ravager",
  "/wiki/Battle_of_Jakku",
  "/wiki/Radiation",
  "/wiki/New_Republic_pilot",
  "/wiki/Pilot",
  "/wiki/Chass_na_Chadic",
  "/wiki/Death",
  "/wiki/Bantha",
  "/wiki/Homeworld",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Pursuer",
  "/wiki/Flagship",
  "/wiki/Standard_week",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Attack_on_Cerberon",
  "/wiki/Barma_Battle_Group",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Cerberon_system",
  "/wiki/Attack_on_Troithe",
  "/wiki/Yadeez",
  "/wiki/Brig",
  "/wiki/Commanding_officer",
  "/wiki/Standard_year",
  "/wiki/Grand_Moff",
  "/wiki/Randd",
  "/wiki/Star_system",
  "/wiki/Chadawan_navy",
  "/wiki/Star_Destroyer",
  "/wiki/Deliverance",
  "/wiki/Wild_Squadron",
  "/wiki/Starfighter",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Hologram",
  "/wiki/Starship",
  "/wiki/Heavy_cruiser",
  "/wiki/Brightsaber",
  "/wiki/Serenade",
  "/wiki/Hunting_Hound",
  "/wiki/Nath_Tensent",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Core_Worlds",
  "/wiki/2020",
  "/wiki/Shadow_Fall",
  "/wiki/Alexander_Freed",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/TIE_line",
  "/wiki/TIE_Fighter_1",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_The_Rebel_Files"
 ]
}