{
 "name": "Mesa_Greenbark",
 "display_name": "Mesa Greenbark",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "New Plympto"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Orvax IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nosaurian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Separatist holdouts"
     ]
    }
   ]
  }
 ],
 "content": "Mesa Greenbark was a female Nosaurian who married Bomo Greenbark, a commander of the New Plympto resistance who fought against the Galactic Empire. With Bomo, she had had a daughter who they named Resa and after the declaration of the New Order, the political regime of the Empire, she and her child attempted to evacuate their homeworld to escape Imperial forces. While her husband and the rest of the resistance fought one final battle at Half-Axe Pass, Mesa and Resa attempted to reach a spaceport in an area called Cadgel Meadows, but were captured by Imperials before reaching their destination. The evacuees were enslaved and taken to the planet Orvax IV where Mesa was killed attempting to prevent her daughter being sold.\nMesa Greenbark lived on the planet New Plympto in the Corellian sector of the Core Worlds, the homeworld of her species. Mesa married another Nosaurian named Bomo Greenbark and with him had a female child, who they named Resa. When the Clone Wars began between the Galactic Republic and the Confederacy of Independent Systems, the Nosaurians came to side with the Confederacy, and fought against Republic forces on their homeworld. After the defeat of the Confederacy in 19 BBY, the New Plympto resistance was left as one of the Separatist holdouts and continued to fight against the newly formed Galactic Empire in a conflict that became known as the Cleansing of New Plympto.\nA month after the declaration of the New Order, the political regime of the Empire, the Nosaurians begun evacuating their women and children from New Plympto including Resa and Mesa. While the other male Nosaurians continued fighting the Empire in an area known as Half-Axe Pass, Bomo personally saw his family and other evacuees to the transports they were using to escape. Before boarding the transport, Mesa and Resa asked Bomo to leave with them, but when he refused, they said a final farewell and boarded the final vehicle available. With the final passengers aboard the transports, the journey to the spaceport in the area known as Cadgel Meadows began, where Mesa and Resa intended to find transport to the planet Sullust in the Brema sector of the Outer Rim Territories.\nThe transports never reached Cadgel Meadows and were instead stopped by Imperial forces. All Nosaurians on board, including Mesa and her daughter, were then captured and moved off world to be sold as slaves. The Imperials brought them to the world of Orvax IV, a well known slave world, where they hoped to sell them to the highest bidder. When the slavers came to take Resa for sale however Mesa attempted to prevent her daughter being separated from her and fought the slavers. Her attempts were in vain however and Mesa was killed in the attempt to save her daughter.\nWith Mesa's attempt to save her a failure, Resa was taken and sold by a Chagrian slaver named Orso Meeto to the Human Dezono Qua. A day after Mesa's death, her husband arrived to save her and became distraught when he discovered he was too late. Bomo then left to find Resa but once again failed to save his family as Qua had had her cooked and consumed her, an act for which Bomo's friend Dass Jennir, a Jedi, killed him.\nMesa Greenbark appeared in the Star Wars: Dark Times comic book series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/New_Plympto/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Orvax_IV",
  "/wiki/Nosaurian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Separatist_holdouts/Legends",
  "/wiki/Bomo_Greenbark",
  "/wiki/Commander/Legends",
  "/wiki/New_Plympto_resistance_(Imperial_Period)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Resa_Greenbark",
  "/wiki/New_Order/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Half-Axe_Pass",
  "/wiki/Spaceport/Legends",
  "/wiki/Cadgel_Meadows",
  "/wiki/Slavery/Legends",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellian_sector/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Species/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cleansing_of_New_Plympto",
  "/wiki/Standard_month/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Brema_sector",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Chagrian/Legends",
  "/wiki/Orso_Meeto",
  "/wiki/Human/Legends",
  "/wiki/Dezono_Qua",
  "/wiki/Dass_Jennir",
  "/wiki/Jedi/Legends",
  "/wiki/Star_Wars:_Dark_Times",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dark_Times_1",
  "/wiki/Dark_Times_3",
  "/wiki/Dark_Times_7",
  "/wiki/Dark_Times_13",
  "/wiki/Dark_Times_16"
 ]
}