{
 "name": "Mexnean",
 "display_name": "Mexnean",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Berri"
     ]
    },
    {
     "name": "Born",
     "values": [
      "236 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Berrite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.3 meters"
     ]
    }
   ]
  }
 ],
 "content": "Mexnean was a Berrite female con artist and thief.\nShe frequented starports, cantinas, and any other location where she could be assured of finding a mark for her con games. Her criminal activities included laundering money for spice smugglers, running fixed sabacc games, and many other lucrative scams. One of her trademark schemes was to run up extravagant expenses while claiming to be employed by a corporation or crime lord, charge them to her supposed employer, and disappear. Even General Airen Cracken, the head of the Rebel Alliance's and later the New Republic's intelligence services, lost credits to one of Mexnean's scams.\nIn 7 ABY, Mexnean had accumulated enough charges against her that the New Republic could have sent her to prison for decades. However, the Republic was willing to drop some of the charges if she were brought in for questioning, and if she agreed to give up information about some of the crime lords she had recently had business with. General Cracken posted a 1,500 credit reward for her capture.\nThough Berrites were often stereotyped as dim-witted and slow, Mexnean was an accomplished con artist and an expert pick-pocket. She was also familiar with a wide range of languages, cultures, alien species, and criminal organizations. She tended to wear expensive cloaks and arm herself with a slugthrower pistol.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Berri",
  "/wiki/236_BBY/Legends",
  "/wiki/Berrite",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Con_artist/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/7_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Slugthrower/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies"
 ]
}