{
 "name": "Mia Zaprin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Mia Zaprin was a female Human who lived on Naboo with her family at the time of the Galactic Civil War.\nAfter the Battle of Yavin, Mia Zaprin lived at the remote Zaprin Estate in the Gallo Mountains on Naboo with her father Larence, her mother and her brother Jowres.\nIn 1 ABY, a group of sick narglatchs and motts surrounded the Zaprin's home. Mia and her brother Jowres went outside to check the situation but were attacked by the crazed animals. Mia was bitten in the leg and developed a severe infection that caused her to fall into a delirium. Her worried father sent an urgent call for help and soon a medic sent by the 2-1B droid Billingsly arrived at the Zaprin Estate. He examined Mia and tried to cure her illness, but the infection didn't respond to the treatment. So the medic single-handedly killed several of the feral creatures that surrounded the house. From blood samples extracted from the creatures' bodies, the medic was able to create an anti-toxin. After an injection with the new medicine, Mia quickly recovered from her illness.\nMia Zaprin was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Mia Zaprin was added to the game upon the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.\nMia Zaprin could be found in a remote building in the Gallo Mountains southeast of the Lake Retreat. She was part of the quest \"House Call\" for players of the Medic profession. During each server reset, Mia Zaprin's appearance was randomized, but she consistently appeared as a female Human.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Larence_Zaprin",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Naboo/Legends",
  "/wiki/Zaprin_family",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Zaprin_Estate",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Gallo_Mountains/Legends",
  "/wiki/Jowres_Zaprin",
  "/wiki/1_ABY/Legends",
  "/wiki/Narglatch/Legends",
  "/wiki/Mott/Legends",
  "/wiki/Medic/Legends",
  "/wiki/2-1B_surgical_droid",
  "/wiki/Billingsly",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Varykino/Legends",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}