{
 "name": "Mia_Hawkins",
 "display_name": "Mia Hawkins",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cobalt Flag",
      "Ghost cell",
      "Eagle's network"
     ]
    }
   ]
  }
 ],
 "content": "Mia Hawkins was a Human female terrorist living during the Cold War. She had a sister named Neyla, who was in charge of another terror cell.\nShe was previously a part of Cobalt Flag, an anti-occupation group on Sullust. The group fought the Sith Empire by organizing bombings and sabotage. She then joined the Ghost cell on Tatooine after being brought to their village in secret, where she was trained by the Old Man. Eventually disgusted with their methods, she chose to flee and sell the group out to Imperial Intelligence.\n\nIn the year 3643 BBY, Mia Hawkins contacted Agent Cipher Nine in a via public holotransmitter. She instructed Nine to gather Imperial security holocams from the droids around Mos Ila and then take them to a local droid seller named Datto Wys. She arranged for Datto to a trade a mouse droid for the holocams. When Nine bought the mouse droid, it lead the agent to Mia's hideout. The two met and Mia told Nine about how she trained with the cell, but grew sick by their brutal methods. In exchange for a way out, she was willing to help the Imperial Intelligence dismantle the cell. The problem was, she did not know the exact location of the village, where the cell trained her, since they subdued her whenever they moved her in or out of the village. In order to find the location, Mia suggested that she and the agent should identify an unknown smuggler called \"Dragon Eyes\" who secretly supplied the village.\nSince Nine made her presence known, Mia feared that they are now being followed by the Ghost Cell assassin. In order to get rid the assassin, they set up an ambush inside an abandoned wind farm warehouse. In the meantime, it turned out that \"Dragon Eyes\" was a local Exchange member named Milosh Varta. After Nine interrogated Varta about the location of ghost cell's stronghold and later executed him, Mia helped the agent infiltrate the stronghold through a secret supply line by hiding inside a supply crate. Inside the stronghold, Mia was somehow captured as Nine confronted the leader, known only as \"the Old Man\". After Nine killed the Old Man, Mia was executed by the agent.\nHawkins can be killed  or set free  after Cipher Nine completes their mission. She can also be flirted by a male Cipher Nine.\nIf Mia is executed and Ardun Kothe is killed while Cipher Nine is on Quesh recovering the Shadow Arsenal, the agent will be confronted by Neyla Hawkins while on Corellia instead of Kothe. Neyla will mention Mia and will act as if killing the Cipher is only way to exact revenge.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cobalt_Flag",
  "/wiki/Ghost_cell",
  "/wiki/Eagle%27s_network",
  "/wiki/Terrorist/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Neyla_Hawkins",
  "/wiki/Sullust/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Ghost_cell_village",
  "/wiki/Old_Man_(Ghost_cell)",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Standard_year/Legends",
  "/wiki/Mos_Ila",
  "/wiki/Datto_Wys",
  "/wiki/Exchange",
  "/wiki/Milosh_Varta",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Ardun_Kothe",
  "/wiki/Shadow_Arsenal",
  "/wiki/Corellia/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}