{
 "name": "Micah Giiett",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "33 BBY",
      "Yinchorr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown/green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Bultar Swan"
     ]
    }
   ]
  }
 ],
 "content": "Micah Giiett was a male Human who served the Jedi Order during the final years of the Galactic Republic before the return of the Sith Lords. A highly respected member of the Jedi High Council, Master Giiett served for many years prior to the Yinchorri Uprising of 33 BBY.\nA master swordsman, Master Giiett had training in the ways of the Jedi Sentinel, believing that Jedi should not rely solely on the Force to get the job done. A contemporary of the Master of the Order, Master Mace Windu, and fellow Councilor Plo Koon, Giiett's final mission took him to the planet Yinchorr. There Giiett fought valiantly, sacrificing himself in the end so that his comrades could escape.\nIf Micah Giiett had a traditional Jedi upbringing, he was most certainly discovered by doctors on his homeworld to be Force-sensitive; doctors who then would have notified the Jedi Temple of their discovery. After being recruited by a member of the Acquisition Division, Giiett would have been inducted into the Temple's academy on Coruscant and begun training in a clan of younglings. Eventually graduating from the academy, Giiett was chosen by a Jedi Master to continue his training in the field. After years of study, Giiett passed the Trials of Knighthood and was promoted to a full Knight of the Order.\nFollowing the path of the Jedi Sentinel, Jedi Giiett eventually was promoted to the rank of Master himself. A well respected man within the Order and a wielder of dual yellow-bladed lightsabers, Giiett's unusual style of teaching made him identifiable as a Sentinel; he often would point out to his students that they could not and should not rely solely on the Force to solve their problems. One of his most prolific teaching methods involved four cups and four stones. He would tell his students that three of the stones were white, and one of them was black. Hiding each stone under one cup he would shuffle the cups and ask where the black stone was. Using the Force to track the cup they believed the black stone to be under, most students would accurately point to the cup where Master Giiett had said he put the black stone. In fact however, through slight of hand there was no black stone in play: all cups had a white stone under it. The lesson of the demonstration was that, while the use of the Force could make things easy, a Jedi should not be so overconfident that they did not expect the unexpected or believe everything they saw. This trick derived from the Master's belief that any trained Force-user could make a good gambler, but the Force doesn't trump the powers of a logical and attentive mind.\nIn 53 BBY, Giiett and Yoda summoned Jedi Masters Qui-Gon Jinn and Tahl along with Jinn's Padawan Xanatos and masterless Orykan Tamarik. The two Jedi dispatched the team to Telos to settle a civil war on the planet. After Xanatos challenged Yoda and the briefing was concluded, Giiett soberly and reflectivly asked if Xanatos was ready to become a Jedi Knight. Yoda replied by saying that if he was not ready then he could never become a Jedi. The mission saw Xanatos turn to the dark side and abandon the Jedi Order.\nDuring his tenure on the Jedi High Council, Giiett would embark on some missions in service to the Order. When he was away for long periods of time, the Jedi Knight Ki-Adi-Mundi would sit in for Giiett. At one stage, Qui-Gon Jinn's Jedi Padawan Obi-Wan Kenobi briefly left the Jedi to assist The Young on Melida/Daan in 44 BBY. When he returned, he appealed to the council to return, and it was Mundi that sat in for Giiett at this time. A couple of years later, Jinn was kidnapped by the scientist Jenna Zan Arbor. Giiett had returned from a mission and resumed his duties on the council. Jinn was rescued sometime later on Simpla-12.\nAt some point, Masters Giiett and Koon were assigned a mission to Ord Mantell. The famed chef, Slabba Drewl, had been captured by the notorious Corpo the Hutt and the Jedi were petitioned to send a rescue party. Bargaining with the Hutt, the Master Giiett entered into a cooking match with the Hutt's personal kitchen droid, MREM-02; if Giiett won the contest, Drewl would be freed from his cell. While Giiett prepared two small dishes of Squirmer Stew, the portly Jedi instructed Master Koon to sabotage the droid's ingredients. The Kel Dor secretly replaced the droid's seebo sauce with droid oil, and slipped gundark droppings, Rakririan Burnout Sauce and Bothan foot powder into the competition's pot. While Master Giiett's platters did not overwhelm the judges, the droid's ruined meals could not compete and the Jedi was declared victorious. Staying true to his word, Corpo released the imprisoned chef and the Jedi returned him to Coruscant.\nMaster Giiett was at the Temple when he selected a young woman to train as a Padawan; this Kuati native would go on to be his last apprentice, she was named Bultar Swan.\nIn 33 BBY Master Giiett was assigned by the Council to a mission that would see the end of the Yinchorri Uprising. One of several Masters assigned to the mission, Master Giiett left young Swan at the Temple and boarded one of three Consular-class cruisers along with Master Koon, Jedi Lilit Twoseas, and her Padawan K'Kruhk. Heading for Yibikkoror, Giiett demonstrated the lightsaber-resistant properties of cortosis vambraces to Twoseas' Padawan. Upon their ships arrival in orbit over Yibikkoror Giiett's cruiser was attacked by Yinchorri attack ships and they were forced to take extreme measures. Baiting their attackers with the launch of an empty escape pod, the Jedi managed to crash land their damaged ship on a floating residence platform, the Jedi fought their way through swarms of flutter-pack equipped Yinchorri. While Master Koon used the planet's gases to blind their assailants, Master Giiett contacted Master Adi Gallia's cruiser for immediate rescue.\nEscaping the planet with Masters Gallia, Eeth Koth, and Tsui Choi, the Yibikkoror group headed to Yinchorr to aid Master Mace Windu's team on the ground. Under the leadership of Master Koth, Masters Giiett, Koon, and Twoseas met up with Windu after fighting their way through the Yinchorri warriors. Covering their comrades' retreat, Masters Giiett and Koon joined with Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi in fighting back the savage warriors. As the fighting abated for a short period, the Jedi gathered to plan strategy when a lone warrior ambushed the group and mortally wounded Giiett. Bleeding profusely, Giiett ordered his comrades to drag him next to a downed tank and leave him. Warning off Jinn's feelings of revenge Giiett handed his life-friend Plo Koon one of his sabers to be memorialized in the Temple. Holding on to the other, he sent his friends away and waited for the Yinchorri to approach. As the brutal species surrounded the tank, Giiett lured them closer with promises of revealing the secrets of his Order. As they came close Giiett told them that Jedi knew the meaning of sacrifice and ignited his lightsaber against the tank's fuel cells, destroying the tank, the Yinchorri, and himself.\nWith Giiett's death, all of the remaining members of the High Council sensed his death and mourned him quietly. On Coruscant the mysterious Dark Lord of the Sith, Darth Sidious, also felt his passing, informing his apprentice, Darth Maul, of his plan's success.\nWhen the rest of the Jedi teams returned to Coruscant, Master Koon placed Giiett's surviving lightsaber on the Master's old seat in reverence to his fallen friend. Master of the Order Mace Windu led the vote on who was to replace Giiett on the Council; many of the Masters suggested Master Jinn though Windu thought Jedi Ki-Adi-Mundi would be a more suitable candidate. Having served as a substitute Councilor for Giiett in the past, the Council agreed to promote Mundi to the rank of Master and have him sit on the Council. Additionally, the process of reassigning Padawan Swan a new master was started, resulting in Giiett's friend, Master Koon, taking on the training of the Kuati woman to Knighthood.\nMany years later, after the fall of the Republic and the near-extermination of the Jedi Order, many of the surviving Jedi went into hiding. When Master Dass Jennir encountered Master Kai Hudorra in front of the burning Jedi Temple, he asked Hudorra what he was going to do with his life if not fight. Hudorra replied that Giiett had once said that a person skilled with the Force could make a successful living as a gambler.\nMaster Giiett was a portly man, with three thick rows of hair on his otherwise shaven head. A wise Jedi Master with an unusual style of teaching, Master Giiett's methods were unorthodox but followed closely with the Jedi teachings. While a follower of the will of the Force, Giiett did not cast off all other methods to success believing that many solutions could be found through common sense or common skill, rather then through reliance on the Force's power.\nA close friend with fellow Councilor Master Plo Koon, Giiett and the Kel Dor had a friendship that bewildered many of their colleagues. Engaging in a strange parlance, the two often hurled insults at each other or appeared to one-up the other throughout their constant banter. However the Masters described that this way of speaking lightened the mood on the many dangerous missions they were involved in and helped them fight through the terrors they faced.\nA master of lightsaber wielding, Master Giiett was an expert practitioner of the art of Jar'Kai, an accelerated version of the traditional Form VI of lightsaber combat which called for the use of two sabers. Building dual blades with yellow lightsaber crystals at their core, Master Giiett had chosen the path of the Sentinel which suited his belief that the Jedi should not be solely reliant on their Force abilities.\nThroughout several of Giiett's appearances his name is constantly misspelled, with the errors consisting of both \"Giett\" and \"Giiet\".\nIn the 44 BBY novel Jedi Apprentice: The Captive Temple, Ki-Adi-Mundi is seen as a member of the Jedi High Council. This runs counter to Jedi Council: Acts of War in 33 BBY as Mundi is not a member of the Council and succeeds Giiett. This was later fixed in Jedi Apprentice: The Evil Experiment, with Mundi confirmed as sitting in for Giiett when he was on missions.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Micah",
  "/wiki/33_BBY/Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Yinchorri_Uprising",
  "/wiki/Jedi_Sentinel/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Planet/Legends",
  "/wiki/K%27Kruhk",
  "/wiki/Cortosis/Legends",
  "/wiki/Vambrace",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_recruiter",
  "/wiki/Acquisition_Division/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Initiate_Clan/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/53_BBY/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Tahl",
  "/wiki/Padawan/Legends",
  "/wiki/Xanatos",
  "/wiki/Orykan_Tamarik",
  "/wiki/Telos_IV",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/The_Young",
  "/wiki/Melida/Daan",
  "/wiki/44_BBY/Legends",
  "/wiki/Jenna_Zan_Arbor",
  "/wiki/Simpla-12",
  "/wiki/Star_Wars_Tales",
  "/wiki/Star_Wars_Tales_1",
  "/wiki/Star_Wars_Tales_20",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Canon",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Chef/Legends",
  "/wiki/Slabba_Drewl",
  "/wiki/Corpo_(Hutt)",
  "/wiki/Hutt/Legends",
  "/wiki/MREM-02",
  "/wiki/Squirmer_Stew",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gundark/Legends",
  "/wiki/Rakririan_Burnout_Sauce",
  "/wiki/Bothan/Legends",
  "/wiki/Kuati/Legends",
  "/wiki/Consular-class_cruiser",
  "/wiki/Lilit_Twoseas",
  "/wiki/Mission_to_Yibikkoror",
  "/wiki/Yibikkoror",
  "/wiki/Yinchorri_attack_ship",
  "/wiki/Yibikkoror_floating_city",
  "/wiki/Yinchorri_flutter-pack",
  "/wiki/Yinchorri",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Eeth_Koth/Legends",
  "/wiki/Tsui_Choi",
  "/wiki/Death/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Dass_Jennir",
  "/wiki/Kai_Hudorra",
  "/wiki/Gambling/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Form_VI/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Jedi_Apprentice:_The_Captive_Temple",
  "/wiki/Jedi_Council:_Acts_of_War",
  "/wiki/Jedi_Apprentice:_The_Evil_Experiment",
  "/wiki/Category:Images_of_Micah_Giiett",
  "/wiki/Yaddle%27s_Tale:_The_One_Below",
  "/wiki/Star_Wars_Tales_5",
  "/wiki/Jedi%E2%80%94The_Dark_Side_1",
  "/wiki/Jedi%E2%80%94The_Dark_Side_5",
  "/wiki/Jedi_Chef",
  "/wiki/Star_Wars_Tales_7",
  "/wiki/Jedi_Council:_Acts_of_War_1",
  "/wiki/Jedi_Council:_Acts_of_War_2",
  "/wiki/Jedi_Council:_Acts_of_War_3",
  "/wiki/Jedi_Council:_Acts_of_War_4",
  "/wiki/Star_Wars_(1998)_32",
  "/wiki/Star_Wars_(1998)_39",
  "/wiki/Star_Wars_(1998)_41",
  "/wiki/Star_Wars:_Republic:_Into_the_Unknown",
  "/wiki/Dark_Times%E2%80%94Fire_Carrier_1",
  "/wiki/Star_Wars_Omnibus:_Rise_of_the_Sith",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Insider",
  "/wiki/Order_66:_Destroy_All_Jedi",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Visual_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Clone_Wars_Campaign_Guide",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Databank_(original)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_8",
  "/wiki/Republic_80",
  "/wiki/Tyvokka/Legends",
  "/wiki/Saesee_Tiin/Legends",
  "/wiki/Even_Piell/Legends",
  "/wiki/Yarael_Poof/Legends",
  "/wiki/Oppo_Rancisis/Legends",
  "/wiki/Yaddle/Legends",
  "/wiki/T%27un",
  "/wiki/Depa_Billaba/Legends"
 ]
}