{
 "name": "Mical",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "3976 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Lost Jedi"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Meetra Surik"
     ]
    }
   ]
  }
 ],
 "content": "Mical, or \"the Disciple\", was a Human male Jedi Master who had served as a diplomat for the Galactic Republic in the aftermath of the Jedi Civil War. A knowledgeable historian, he was one of several tasked with attempting to contact any remaining Jedi and convince them to return to the Republic. The Jedi Exile, Meetra Surik encountered him during her journey to gather the Lost Jedi, and he joined the crew of the Ebon Hawk, possibly due to the admiration he had for her since his youth. He became her informal Padawan, resuming the training he had begun in childhood, and becoming a Jedi Consular. After his travels with Surik, he devoted himself to rebuilding the Jedi Order and would eventually sit on the re-established Jedi High Council as a Master. He also became one of the Order's greatest historians.\nMical was a Force-sensitive child, possibly from a Mid Rim colony. He was brought to the Jedi Enclave on Dantooine to be trained in the ways of the Jedi. He became somewhat enamored of Meetra Surik after she taught his class of younglings to hear the Force sing within others. Comparing her with Master Vrook Lamar, Mical felt that while he was knowledgeable, he was not a natural leader or a mentor as was Surik.\nBy the time Mical came of age, the Mandalorian Wars were raging. Many Jedi had gone to war against the wishes of the Jedi Council, including Revan, Malak, and the Jedi that Mical had hoped would take him as a Padawan, Surik. Soon few masters remained and by the time that Mical was ready to begin apprenticeship there was no one left who was fit to train him. He was one of many who were denied the path of the Jedi at this time, in part due to the doubts he was having following the exile of his mentor, so he decided to serve the Republic instead.\nIn the aftermath of the Jedi Civil War, Mical was one of the few who maintained the distinction between the Jedi and the Sith. With the Jedi gone, he sought to preserve their history by studying their teachings and gathering artifacts. He had heard mention that one of the Jedi had gone to Dantooine, so he went to the ruins of the Jedi Enclave, but found no trace of them. He found Meetra Surik instead, who told him of her search for the remaining Jedi Masters, and welcomed his company when Mical offered to apply his knowledge and skills to her quest, which seemed compatible with his.\nAlthough history was Mical's specialty, he had some medical training as well, and served as a surrogate medic aboard the Ebon Hawk. He also taught Surik a meditation technique to replenish her personal Force reservoir.\nAt first Mical was not open about his past involvement with the Jedi, nor did he give out his true name, instead going by \"Disciple.\" After Surik had gained his trust, he confessed to having met her as a young student at the Jedi Enclave, and told of how his connection to the Force had faded since then. Surik offered to train him in the ways of the Force, and he gladly accepted the offer, becoming her Padawan at last and taking on the class of Jedi Consular.\nAs they traveled together, Mical was unable to hide his feelings for Surik. Though such things were forbidden to Jedi, Mical believed that the Jedi teachings were fundamentally flawed. He believed that the Jedi were too removed from everyday life, and from the very things that made them living, feeling beings. Still, though he never denied his forbidden love for Surik, it amounted to little more than flattery and innocent flirtation in the end. This placed him at odds with Atton Rand, who also desired Surik's feelings.\nWhile aboard the Ebon Hawk, Mical maintained clandestine communication with his Republic commanders, telling his true mission to no one—even Surik herself. When the party learned that Darth Nihilus was on his way to Telos IV, Mical sent a message to his Republic superiors warning them of the imminent threat.\nThroughout the journey, Mical pored over information about Revan and the Sith, discerning a pattern and strategy to Revan's attacks during the Jedi Civil War, and coming to the frightening conclusion that Revan's surgical strikes against the Republic were not meant to crush it into submission. Revan's tactics instead seemed more in line with conquering the galaxy to unite it under a single banner, possibly against an unseen threat. Kreia walked in on him just as he had made this analysis and ambushed him, forcing him to forget his discoveries until she felt the time was right for him to remember.\nAfter Surik met with the Council members, she separated herself from her companions. When she told Mical that the Council had informed her she was unknowingly forcing her companions to follow her, Mical comforted her. He told her that the Council made that judgment in arrogance because they denied what made them actual feeling beings. He also reassured her that he and all her other companions were following her because they chose to. He followed Surik to the end of their battle against the Sith. He was later left behind when Surik started her journey to find Revan.\nAfter her defeat at the hands of Surik, Kreia offered to share her vision into the future. She predicted that Mical would devote himself to rebuilding the Jedi Order, and would eventually one day sit on the new Jedi Council, though \"reluctantly, as all good men do.\" Kreia's vision was proven right, as Master Mical was considered as one of the greatest Jedi Historians during the time of the Cold War. His legacy was the archive he founded in the Cron Drift, which would be explored by adventurers and archaeologists, and Mical's holocron would be recovered and given to the Jedi Order.\nMical was created by Obsidian Entertainment as one of the companions for the 2004 Xbox and PC video game Star Wars: Knights of the Old Republic II: The Sith Lords. Like most companions, he was written by Chris Avellone. He was voiced by Greg Ellis.\nThe Disciple appears in cutscenes on Dantooine regardless of the player's gender, but he will be only available to join the player's party if the main character is female . Surik has a chance to train Mical, making him a Jedi Consular. \nThroughout the game, he is only referred to as \"Disciple\"; the name Mical is mentioned only if the Exile is male—during Mical's conversation with Admiral Carth Onasi . This cutscene will not be seen by the female Surik, since Mical has already joined her party, and therefore his name will not be heard by the player. In the MMO Star Wars: The Old Republic players with the crew skill of Archaeology can send their companion to explore Mical's legacy.\nIf Meetra Surik follows the path of the dark side , Mical will follow her and Darth Traya will predict that he will abandon all beliefs of the Jedi and instead devote himself to politics, becoming a wise and steady yet cold Senator of a Mid Rim colony . His dark image, as seen to the left, shows his blond hair growing gray, and his eyes are the yellow color of a Sith. Also if Surik has enough influence with Mical he can be trained to become a Dark Jedi Consular.\nAt some point in the original version of the dark side story Mical was supposed to be attacked by Atton Rand, who had been corrupted by the dark side. He was also supposed to guide Surik to hidden Jedi and Sith holocrons. Like a lot of other content, these ideas never made it into the final game, although they exist in the game files.\nAfter meeting Surik in the enclave, Mical returned to Khoonda and waited for the next transport off Dantooine. While still on the planet, he contacted Admiral Carth Onasi and reported that he had found Surik, whom the Admiral had been trying to track down since he escaped Citadel Station. It is possible that after Surik left known space, Mical was trained to be a Jedi when the Jedi Order began to rebuild.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3976_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lost_Jedi",
  "/wiki/Meetra_Surik",
  "/wiki/Kreia",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Jedi_historian",
  "/wiki/Jedi/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Mira",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Jedi_Enclave",
  "/wiki/Dantooine/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Vrook_Lamar",
  "/wiki/Mandalorian_Wars",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Jedi_Academy_(Ossus)",
  "/wiki/Ossus/Legends",
  "/wiki/Cron_Drift/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Arca_Jeth",
  "/wiki/Jolee_Bindo",
  "/wiki/Jolee_Bindo#Life_as_a_Padawan",
  "/wiki/Sith/Legends",
  "/wiki/Personal_Force_reservoir",
  "/wiki/Atton_Rand",
  "/wiki/Darth_Nihilus",
  "/wiki/Telos_IV",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Mical%27s_holocron",
  "/wiki/Champions_of_the_Force_(Star_Wars_Miniatures)",
  "/wiki/Obsidian_Entertainment",
  "/wiki/2004",
  "/wiki/Xbox",
  "/wiki/Personal_computer",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Chris_Avellone",
  "/wiki/Greg_Ellis",
  "/wiki/Brianna",
  "/wiki/Admiral/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Cede",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Senator/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Khoonda",
  "/wiki/Citadel_Station",
  "/wiki/Category:Images_of_Mical",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/November_11",
  "/wiki/March_1",
  "/wiki/2007",
  "/wiki/December_6",
  "/wiki/2019",
  "/wiki/December_8",
  "/wiki/Bao-Dur",
  "/wiki/Bao-Dur%27s_remote",
  "/wiki/G0-T0",
  "/wiki/HK-47",
  "/wiki/Visas_Marr",
  "/wiki/Canderous_Ordo",
  "/wiki/T3-M4"
 ]
}