{
 "name": "Michael Tandre",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Michael Tandre was a male Jedi Knight serving the Jedi Order.\nMichael Tandre was a Jedi Knight and geologist. Over two hundred years before the Galactic Civil War, Tandre crashed his starship Alpha Kentrum one the planet Orellon II. Surviving the crash, Tandre encountered the world's indigenous species and was welcomed into their society. Tandre served as a spiritual leader to the species and accepted that he was stranded indefinitely and began to teach the natives the principles of Sword, Plow, and Spirit. Crafting a series of computer programs from the Alpha Kentrum's wreckage, he hoped to preserve his message should he die or be rescued. His followers, calling themselves the Holy Order of the Je'ulajists, based on a mispronunciation of \"geologist\", tended to their spiritual guide throughout the rest of his life.\nWhile rescue never came for Tandre, the species, calling themselves the Kentra, preserved his teaching as the basis of their society. During the Galactic Civil War, a team of Alliance agent searching for a potential safe world fixed the computers that Tandre set up and discovered his final resting place, the wreck of the Alpha Kentrum, and his lightsaber known as the \"Sword of Honor.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Geologist/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Alpha_Kentrum",
  "/wiki/Planet/Legends",
  "/wiki/Orellon_II",
  "/wiki/Kentra",
  "/wiki/Sword,_Plow,_and_Spirit",
  "/wiki/Death/Legends",
  "/wiki/Holy_Order_of_the_Je%27ulajists",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Safe_world/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sword_of_Honor",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Prophecy",
  "/wiki/Star_Wars_Adventure_Journal_2",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}