{
 "name": "Mico_Haswell",
 "display_name": "Mico Haswell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lerct Historical Institute"
     ]
    }
   ]
  }
 ],
 "content": "Mico Haswell was a Human male researcher who worked for the Lerct Historical Institute. In 21 ABY, Haswell participated in an expedition on Yoturba. During the expedition, he came across a Kyber crystal that had been bled, which exploited his feelings of being underappreciated and not given enough authority by the Institute to possess him and make him attack his fellow researcher Kirs with the Dark side of the Force.\nJedi Master Luke Skywalker, who was present at the dig, attempted to stop Haswell, but instead Haswell and Skywalker had a shared vision of being on the hidden Sith world of Exegol. In the vision, Haswell moved unnaturally and inhumanly, developed sharp teeth and reptilian behaviors, and attempted to attack Skywalker. However, the vision broke and Skywalker restrained Haswell in the air with the Force and called a team of medics to sedate Haswell. They gave him a large dose of a sedative, but he remained conscious, only no longer under the influence of the dark side. Skywalker questioned Haswell as to what happened to him, but Haswell did not have much memory of what had happened, only telling Skywalker that he had seen a dark, dry, old, and lightning-filled planet and felt a shadow-like sentient presence on it. Haswell then passed out completely, and Skywalker told the medics to take him to Hosnian Prime to be monitored.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Lerct_Historical_Institute",
  "/wiki/21_ABY",
  "/wiki/Yoturba",
  "/wiki/Kyber_crystal",
  "/wiki/Bleeding",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Force_vision",
  "/wiki/Exegol",
  "/wiki/The_Force",
  "/wiki/Medic",
  "/wiki/Hosnian_Prime",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Mico_Haswell",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Shadow_of_the_Sith_(audiobook)",
  "/wiki/Template:ShadowoftheSithDate"
 ]
}