{
 "name": "Miim_Te%27Suub",
 "display_name": "Miim Te'Suub",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Genarius"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "SoroSuub Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Miim Te'Suub was the Director of Formal Activities for SoroSuub Corporation on Edic Bar, a city of Genarius. He was a cousin to the Executive Officer of SoroSuub, who gave Te'Suub the position because of a favor owed to Miim's mother. The position held little real authority. He met with those outsiders with whom the actual executives of Edic Bar did not want to meet with. The company taught Te'Suub a \"Formal Greeting\" to use with his guests, as a way to discourage them from contacting SoroSuub again.\nMiim Te'Suub was directed by his employers to give a speech when the first of SoroSuub's G-59 Cannibalizers came off the line, and to give the employees the day off. Te'Suub was aghast at the four-day party that followed , but the situation was not beyond what his employers expected when they told him to do it.\nDuring the Festival of 31 BBY, Te'Suub traditional annual speech was disturbed by the superimposition of the logo of the Metatheran Cartel. Te'Suub angrily challenged Cartel representative Thurm Loogg, being the argument heated enough to require the mediation of diplomats and Jedi consuls.\nMiim believed he was doing an important job for SoroSuub, and enjoyed his work. He dressed impeccably, and was small for a Sullustan.\nAt Gen Con Game Fair 2001, Te'Suub was played by Adam Norman.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Genarius",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Director_of_Formal_Activities",
  "/wiki/Edic_Bar",
  "/wiki/G-59_Cannibalizer",
  "/wiki/Festival",
  "/wiki/SoroSuub_Anniversary_celebration,_31_BBY",
  "/wiki/Metatheran_Cartel",
  "/wiki/Thurm_Loogg",
  "/wiki/Gen_Con_Game_Fair_2001",
  "/wiki/Blown_Away",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Wizards.com",
  "/wiki/The_Sivulliq_Is_Out_There_--_Somewhere",
  "/wiki/Celebrate_SoroSuub"
 ]
}