{
 "name": "Mij Gilamar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Cuy'val Dar",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Mij Gilamar was a Human male doctor and Mandalorian warrior who served the Cuy'val Dar during the Clone Wars.\nMij Gilamar was a male Human doctor who, at some time before 32 BBY, met and fell in love with a Mandalorian girl named Tani. The two were wed, and Gilamar joined the Mandalorian culture. At some point afterward, his wife was tragically murdered and Gilamar vowed to kill the man who did it, painting his armor the traditional sand-gold that marked a mission of vengeance in the Mandalorian community.\nGilamar was one of seventy-five Mandalorian warriors selected by bounty hunter Jango Fett to help train elite clone commandos on the planet Kamino, as part of the hundred-member force known as the Cuy'val Dar—\"Those Who No Longer Exist\". Gilamar greatly despised his fellow training sergeants Dred Priest and Isabet Reau, believing them to be as bad as the Death Watch in their radical views on Mandalorian superiority, and hated Priest for operating a secret fight club in which many clones were injured. During his time on Kamino, he befriended ARC trooper Alpha-Ø2, also known as Spar, when the clone would fake severe headaches, backaches, and to be hearing voices in order to spend time in the medical bay where Gilamar worked. Gilamar later facilitated Spar's defection from the Grand Army of the Republic and aided in his escape from Kamino, calling in a favor with Fett to smuggle him out in the cargo hold of the Slave I.\nDuring the Clone Wars, he worked alongside fellow former Cuy'val Dar Kal Skirata for the Grand Army of the Republic on an advisory level and, while so engaged, \"liberated\" medical and scientific equipment for use at Skirata's hidden home on Mandalore: Kyrimorut, a budding haven for clones who wished to desert from the Grand Army. He also assisted Skirata in locating scientists who could help find a cure to the clone troopers' accelerated aging; during the search, Gilamar met Dr. Reye Nenilin whom he subtly insulted by comparing him to the ancient Mandalorian scientist Demagol. He aided in the recovery of the wounded clone commando Fi on Mandalore, alongside ex-Jedi Bardan Jusik. When Order 66 was issued to all members of the Grand Army, Gilamar deserted to Mandalore with the rest of Clan Skirata, then rescued Arla Fett, and then recently kidnapped Separatist scientist, Dr. Ovolot Qail Uthan.\nWhile spending time with Doctor Uthan and working alongside her as she attempted to develop a solution to stop the clones' accelerating aging, Gilamar began to develop feelings for her. He also bonded with escaped Jedi Padawan Tallisibeth Enwandung-Esterhazy—known by the nickname Scout—who was taking refuge from the Galactic Empire at Kyrimorut's remote location, teaching her first aid, and developed a fatherly affection toward the girl. Following the Emperor's attack on Uthan's homeworld, Gibad, utilizing the FG36 nanovirus she'd developed personally for the Confederacy of Independent Systems, Gilamar comforted her at the loss of her world. Together, he helped her to create a countermeasure to the nanovirus and when the anti-virus was completed, Gilamar professed his feelings for Uthan and the two kissed. When Scout decided she wanted to stay on Mandalore with Gilamar and Uthan—who had become somewhat motherly toward the young girl—instead of being sent to live with the Altisian Jedi, Gilamar agreed to talk to Skirata on Scout's behalf, assuring her that she could stay despite the fact that she wished to continue being a Jedi.\nWhen it came time to disperse the anti-virus into the Mandalorian population at large, Gilamar joined several members of the Skirata clan in the capital, Keldabe. While there, he spotted his former Cuy'val Dar associates Reau and Priest—whom he'd seen earlier working with the Imperial occupation force—in a crowd and, upon noticing the Death Watch symbol on their armor, he lured Priest into a conversation that soon moved to an isolated alley. There, he learned that the Death Watch was still active under the leadership of Lorka Gedyc, and were planning to revitalize the splinter group. With this information, and unwilling to allow the brutality of the Death Watch to return, Gilamar attacked Priest, slashing Priest's femoral artery through the gap between Priest's armor plates and letting him bleed out. He then dumped the body into the Kelita River with the aid of Ordo Skirata to delay Reau from discovering it.\nMij Gilamar was created for an exclusive Entertainment Earth 14 action figure pack. This figure mixes new parts with pieces from existing Jango Fett figures. The figure has new legs, which it shares with B'arin Apma, as well as an all-new head and bits and pieces previously used to make various Jango Fett action figures.\nThis figure was first designed to be the Mandalorian training sergeant Kal Skirata, but Karen Traviss thought the head mold looked too young, so she asked Hasbro if they wouldn't mind changing the names. She named this figure after her good friend James Gilmer .",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Mij_Gilamar",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Brown",
  "/wiki/Gray",
  "/wiki/Mandalorian/Legends",
  "/wiki/Cuy%27val_Dar",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Tani",
  "/wiki/Death/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Dred_Priest",
  "/wiki/Isabet_Reau",
  "/wiki/Death_Watch/Legends",
  "/wiki/Alpha-class_Advanced_Recon_Commando",
  "/wiki/Spar",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Slave_I/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Mandalore/Legends",
  "/wiki/Kyrimorut",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Reye_Nenilin",
  "/wiki/Demagol",
  "/wiki/Fi_Skirata",
  "/wiki/Bardan_Jusik",
  "/wiki/Order_66/Legends",
  "/wiki/Clan_Skirata",
  "/wiki/Arla_Fett",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Ovolot_Qail_Uthan",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Tallisibeth_Enwandung-Esterhazy",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Gibad/Legends",
  "/wiki/FG36",
  "/wiki/Altisian_Jedi",
  "/wiki/Capital/Legends",
  "/wiki/Keldabe/Legends",
  "/wiki/Lorka_Gedyc",
  "/wiki/Kelita_River",
  "/wiki/Ordo_Skirata",
  "/wiki/B%27arin_Apma",
  "/wiki/Karen_Traviss",
  "/wiki/Hasbro_Inc.",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}