{
 "name": "Mika Anjiliac Chiera",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nal Hutta"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 ABY",
      "Varl"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Anjiliac kajidic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Toro Irana"
     ]
    }
   ]
  }
 ],
 "content": "Mika Anjiliac Chiera was a male Force-sensitive Hutt of the Anjiliac kajidic, one of the two offspring of Popara Anjiliac Diresto, and a crime lord. Mika owned an Esral'sa'Nikto aide named Orgamon.\nBorn on Nal Hutta years prior to the formation of the New Republic, Mika was the son of Anjiliac kajidic leader Popara Anjiliac Diresto, and the younger brother of Zonnos Anjiliac Priare. After his father found out that Mika was Force-sensitive, Mika and Popara kept it a secret. However, Mika also wanted to buy and train with a lightsaber, but his first attempts at building one failed, and due to his species' natural clannish tendencies, training options were few and far between. At some point, Mika created a super spice that was a variation of glitterstim and a virus from the Hutt home planet of Varl. He eventually named this new spice Tempest.\nAt some point, Mika coerced the Jedi Knight Toro Irana into training him, getting Irana addicted on Tempest as a means of controlling, as well as mind tricks to ensure his own safety and to manipulate others. Eventually, Irana died of a Tempest overdose and his former mentor, Jedi Knight Mander Zuma, came to the planet of Makem Te looking for answers. Around this time, Mika lost contact with his father Popara shortly after a plague out broke on the planet.\nEventually, Mander found Mika and returned Mika to Popara. Mander found that Mika was a peculiar Hutt, since he appeared to be polite, erudite, slim, and spoke Basic comfortably. Shortly after Mika returned to Nar Shaddaa, he had his father murdered, prompting his brother Zonnos to hire the Huttese bounty hunter Parella the Hunter of the Jiramma clan to find out who murdered Popara. Mika soon became Angela Krin's contact within the Anjiliac kajidic, and somehow convinced Krin to take up the job of finding the Tempest's creator and soon led her to Nar Shaddaa. Though, when Mander revealed that he thought Popara's \"explosive death\" and the Tempest incident were connected, Mika and company were attacked by Zonnos' mercenaries. Eventually, Mika and Reen Irana were knocked unconscious and kidnapped by the mercenaries.\nUltimately, Mika and Reen were rescued by Mander, killing Zonnos in the process. Mika was then set as the kajidii of the Anjiliac clan. Mika then departed for the devastated original Hutt homeworld of Varl, overseeing the Tempest spice creation. Mander, Reen, Eddey, and Krin took up leads to the case and found Mika to be the real mastermind on Varl. Mika then revealed to the group that he was Force-sensitive and how he successfully subdued Irana. A skirmish broke out, and Mika was subsequently killed.\nMika's use of deception kept many beings from knowing that he was the real mastermind behind Tempest smuggling.\nMika was capable of Force push, Force pull, mind tricks, and was starting to make some headway in lightsaber combat before he died. Being one of the few Force-sensitive Hutts, and due to his species natural clannish tendencies, training options were few and far between.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Mika",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/19_ABY/Legends",
  "/wiki/Varl/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Anjiliac",
  "/wiki/Kajidic/Legends",
  "/wiki/Toro_Irana",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Popara_Anjiliac_Diresto",
  "/wiki/Crime_lord/Legends",
  "/wiki/Esral%27sa%27Nikto/Legends",
  "/wiki/Orgamon",
  "/wiki/New_Republic/Legends",
  "/wiki/Kajidii",
  "/wiki/Zonnos_Anjiliac_Priare",
  "/wiki/Lightsaber/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Glitterstim/Legends",
  "/wiki/Tempest_(spice)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Mander_Zuma",
  "/wiki/Makem_Te/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Parella_Jiramma_Baco",
  "/wiki/Jiramma",
  "/wiki/Angela_Krin",
  "/wiki/Reen_Irana",
  "/wiki/Eddey_Be%27ray",
  "/wiki/Telekinesis/Legends#Force_Pull",
  "/wiki/Telekinesis/Legends#Force_Push",
  "/wiki/Mind_trick/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Tempest_Feud",
  "/wiki/Scourge_(novel)",
  "/wiki/Wizards.com",
  "/wiki/Larger_Than_Life_and_Twice_As_Ugly",
  "/wiki/Hutts_Are_Fun!",
  "/wiki/Before_the_Rise",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Lords_of_Nal_Hutta",
  "/wiki/Vago_Gejalli_Thokka"
 ]
}