{
 "name": "Mika  (Farghul)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Farghul"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Crimson Nova"
     ]
    }
   ]
  }
 ],
 "content": "Mika was a Farghul female and the daughter of death stick dealers. She was also a bounty hunter.\nLong ago, Mika's parents ran into Jedi trouble when she was very young. Rather than let their business be shut down and submit to capture, her parents tried to kill the Jedi and went down fighting. Mika held a grudge against the Jedi for the rest of her life. Eventually, she was brought into the bounty hunting business by Stroth. Over the years she rose to power in Crimson Nova, and became the group's leader. She developed a romantic bond with fellow Farghul Harll.\nDuring the Clone Wars, Mika accepted a bounty for several Jedi from Kh'aris Fenn. Officially she was in it for the credits but unofficially she was out for revenge. Jedi Masters Mace Windu, Agen Kolar, Kit Fisto, and Saesee Tiin came to her hideout to stop this contract, which led to Harll's death. Mika was stunned by Stroth when she refused to surrender to the Jedi, and was then arrested by the Jedi.\nMika's daughter, Breela, became a bounty hunter around the time of the Battle of Yavin. Like her mother, she specialized in hunting Jedi, whom she had a personal reason to loathe, and attempted to bring down Kai Justiss.\nInformation from Lucas Licensing originally identified Mika as a Cathar. Underworld: A Galaxy of Scum and Villainy later revealed her correct species to be Farghul.\nRyan Kaufman's original version of Underworld: A Galaxy of Scum and Villainy had Mika being eventually killed by the Jedi in prison after staging an escape and then fighting to the death after it went wrong. However, that segment was removed prior to printing.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mika",
  "/wiki/Farghul",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Crimson_Nova",
  "/wiki/Death_stick/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Stroth",
  "/wiki/Harll",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Kh%27aris_Fenn",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Agen_Kolar/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Saesee_Tiin/Legends",
  "/wiki/Breela",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Kai_Justiss",
  "/wiki/Lucas_Licensing",
  "/wiki/Cathar/Legends",
  "/wiki/Underworld:_A_Galaxy_of_Scum_and_Villainy",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_Republic:_Show_of_Force",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Republic_66",
  "/wiki/Jedi_Council_Forums",
  "/wiki/February_27",
  "/wiki/2013"
 ]
}