{
 "name": "Mikfa_Faaus",
 "display_name": "Mikfa Faaus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "Mikfa Faaus was a male Gungan who lived near the Lake Retreat on Naboo during the Galactic Civil War. He used to repair kitchen refrigerator units and other devices.\nIn 1 ABY he was approached by a spacer on the advice of the Ithorian chef Amyva Va'new. The spacer was looking for detailed information about Corellian fried ice cream fryers and how they worked. He planned to reverse-engineer a broken fryer and create a schematic that could be used to manufacture a new one.\nFaaus did not know much about such fryers, but he gave him the coordinates of a Devaronian named Eteto Topan on Tatooine that knew more about this device.\nMikfa Faaus is a Non-Player Character  in the MMORPG Star Wars Galaxies. In the game, he can be found near a shuttleport at the Lake Retreat. He is part of the quest line \"Find out more about the Cooker\"  that starts when the player inspects a broken ice cream fryer. The player then has to talk to several NPCs on different planets to gather more information about the fryer. When he finishes the quest, the player is rewarded with a schematic for a Corellian Fried Ice Cream Fryer.\nThe quest line was added to the game with Chapter 9 in April 2008",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Orange",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Varykino/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Chef/Legends",
  "/wiki/Amyva_Va%27new",
  "/wiki/Corellian_fried_ice_cream_fryer",
  "/wiki/Devaronian/Legends",
  "/wiki/Eteto_Topan",
  "/wiki/Tatooine/Legends",
  "/wiki/Sony"
 ]
}