{
 "name": "Miko Reglia",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "25 ABY",
      "Helska IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "New Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kyp Durron"
     ]
    }
   ]
  }
 ],
 "content": "Miko Reglia was a male Human Jedi Knight who had been the apprentice of Jedi Master Kyp Durron, and co-founder of the Dozen-and-Two Avengers. He was in love with fellow Jedi Knight Octa Ramis. Miko was a very quiet and humble man who kept mostly to himself. He was very adept at wielding a lightsaber and he spent much of his training time practicing with his blade. He was often given to sitting alone and staring at the stars.\nAt some point, Miko Reglia was discovered to be Force-sensitive. He studied at the Jedi Praxeum under Jedi Master Luke Skywalker himself. During his training, he became romantically involved with fellow student Octa Ramis. He was apprenticed to Kyp Durron and later graduated and became a Jedi Knight. Though some Jedi were under the impression that he and Ramis had ended their relationship after graduation, this was apparently not the case, as the couple continued to meet in private.\nAlong with his master, Kyp Durron, Miko Reglia co-founded an independent fighter squadron known as the Dozen-and-Two Avengers. The squadron consisted of twelve regular starfighter pilots and two Jedi from whence came their name. During the early stages of the Praetorite Vong invasion, Reglia flew as Durron's wing-man.\nEasily the second best pilot in the squadron, behind Durron, Reglia held no aspirations for command and was content to fly and fight wherever his master felt their presence was necessary. Mostly this duty consisted of minor engagements in hunting smuggler rings in the Outer Rim Territories, much to the disapproval of Luke Skywalker. However things turned more interesting when an observation buoy picked up the distress calls coming from the endangered scientists of ExGal-4 on Belkadan. When they noted a Spacecaster had left the scientific outpost for the fourth planet of the Helska system the Dozen-and-Two went in for investigation.\nUpon arrival at Helska IV the squadron encountered a formidable force of coralskippers using advanced organic technology. While flying wing for Durron, Reglia's state-of-the-art X-wing starfighter was stripped of its shields by way of an artificial gravity well. Without shields Reglia's ship was quickly disabled and he was taken to the icy home base of the Praetorite Vong on the planet below.\nBeaten, bruised, and stripped of all clothing save a tight pair of shorts, Reglia was thrown into an underwater holding cell with the former ExGal-4 scientist Danni Quee. As the first Jedi that the Yuuzhan Vong had been fortunate enough to capture, they were curious to test the willpower of the supposed super-beings. Therefore Reglia's mind would be put through a rigorous regimen designed to break his confidence and leave him stripped of all hope and will. Prefect Da'Gara claimed that Reglia was an unworthy warrior and that he would soon be sacrificed to the Yammosk.\nReglia proved resourceful upon awaking, however, and with the help of Quee, managed to best their Yuuzhan Vong guards and attempt an escape. The attempt was short-lived however as Da'Gara was able to immobilize the young Jedi using the strong adhesive blorash jelly right in his path.\nHe was then subjected to numerous mental anguishes, during which he was convinced that he was at the brink of death countless times, only to find that the nightmare had not released him and would continue to haunt him. The telepathic abilities of the Yammosk played these horrid memories in vivid detail through Miko's mind refusing to allow him a moment of peace, wholly intent on the breaking of the young Jedi's mind.\nWith the arrival of Jacen Solo and the New Republic Task Force above Helska IV, and the ensuing rescue attempt made by the young Solo, Miko was afforded his first glimmer of hope since his capture. However, this hope was not for him, and so he pulled two Yuuzhan Vong warriors into the icy depths below the planet's surface, sacrificing himself that Solo and Quee might escape.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Helska_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kyp%27s_Dozen",
  "/wiki/Octa_Ramis",
  "/wiki/Lightsaber/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Praetorite_Vong",
  "/wiki/Smuggler/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/ExGal-4",
  "/wiki/Belkadan/Legends",
  "/wiki/Spacecaster-class_shuttle",
  "/wiki/Helska_system",
  "/wiki/Yorik-et",
  "/wiki/T-65XJ_X-wing_starfighter",
  "/wiki/Dovin_basal",
  "/wiki/Danni_Quee",
  "/wiki/Prefect/Legends",
  "/wiki/Da%27Gara",
  "/wiki/Yammosk",
  "/wiki/Blorash_jelly",
  "/wiki/Death/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Warrior_caste",
  "/wiki/The_New_Jedi_Order:_Vector_Prime",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_I:_Conquest",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Droids,_Technology_and_the_Force:_A_Clash_of_Phenomena_(article)",
  "/wiki/StarWars.com",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}