{
 "name": "Mikos Argdran",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Mikos Argdran was a male Human who operated as an information broker during the reign of the Galactic Empire.\nMikos Argdran was a male Human who made a living as a con artist and an information broker in the Elrood sector during the Galactic Civil War. During the conflict, Argdran sold some information to the Rakaan crime lord Lud Chud regarding the delivery of a shipment of weapons to an Imperial transport, and Chud planned to attack the vessel and seize the armaments for himself. However, Argdran believed that Chud had underpaid him what the information was worth, so he warned Captain Tanda Pryl, the commanding officer of the Star Destroyer Thunderflare, about Chud's impending raid, and when the Rakaan's forces struck, the Thunderflare decimated them. Argdran also stole some data files from Chud's computer network and downloaded them onto some data disks, and when Chud learned that Argdran had both betrayed and stole from him, he dispatched several bounty hunters to kill the information broker. The hunters captured Argdran and ejected him from their airlock above the planet Korad, expecting him to plummet to his death. However, Argdran was saved by a group of Rebel Alliance agents who were searching for the missing Alliance operative Shondra Del, and Argdran agreed to help them find her.\nAt Argdran's suggestion, the Alliance agents traveled with him to the world Merisee, where he was sure he would be able to find Del. However, they were attacked on the planet by a team of Loag assassins hired by Chud to finish Argdran off, who had been able to track the information broker's movements via a weak signal emitted by his data disks. Argdran fled the attackers, and the Rebel agents defeated the assassins, with help from members of the Cult of Those Who Redeem. The agents departed Merisee to continue their search for Del, and Argdran accompanied them to the planet Torina. There, they contacted the Ithorian pet-shop owner Eeksa, who agreed to help them track down Del if, in return, they transported a farlek to the estate of one of her customers, the businessman Pelleo Thog. Argdran accepted the Ithorian's proposal, and they delivered the creature, but were attacked at Thog's residence by another group of Loag assassins sent to kill the information broker. Argdran and the Rebels fled and returned to Eeksa's shop, and the Ithorian informed them that she had learned that Shondra Del was being held prisoner by the Empire on the planet Derilyn.\nRealizing that the Loag were tracking Argdran's data disks, the Rebels had him transfer the information on the disks to a datapad and abandon them. Argdran then gained himself and the Rebels passage aboard the freighter Galax Titan to Derilyn. On arrival, Argdran and the Rebels rescued Del from the Arena of Games in the city Tekar, in which she had been sentenced to die, and afterward Argdran agreed to become a member of the Rebel Alliance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Con_artist/Legends",
  "/wiki/Elrood_sector/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Rakaan",
  "/wiki/Crime_lord/Legends",
  "/wiki/Lud_Chud",
  "/wiki/Transport/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Tanda_Pryl",
  "/wiki/Officer/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Thunderflare",
  "/wiki/Computer/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Death/Legends",
  "/wiki/Airlock/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Korad",
  "/wiki/Shondra_Del",
  "/wiki/Merisee",
  "/wiki/Loag",
  "/wiki/Assassin/Legends",
  "/wiki/Cult_of_Those_Who_Redeem",
  "/wiki/Torina",
  "/wiki/Ithorian/Legends",
  "/wiki/Eeksa",
  "/wiki/Farlek",
  "/wiki/Pelleo_Thog",
  "/wiki/Derilyn",
  "/wiki/Datapad/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Galax_Titan",
  "/wiki/Arena_of_Games",
  "/wiki/City/Legends",
  "/wiki/Tekar",
  "/wiki/Operation:_Elrood_(book)"
 ]
}