{
 "name": "Miktrull",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zeffo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "By 14 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zeffo"
     ]
    }
   ]
  }
 ],
 "content": "Miktrull was a powerful and prideful Force-sensitive Zeffo sage.\nDescribed by legend as having unending power in the Force, Miktrull was a venerated Sage of his people and a student of the Life Wind. In life, Miktrull demanded offerings in the form of candles encased in metal.\nAfter Miktrull's death, his sarcophagus was placed hanging in the air in a vast tomb on Zeffo Special torches called votive candles were placed in his tomb not only to honor him, but to represent his legendary power. A symbol of his pride, the temple complex contained magnetic motifs reminiscent of the planet's gravity.\nJedi Master Eno Cordova initially believed that the votive candles which adorned Miktrull's tomb were a gift to the Life Wind; however, he eventually began to think otherwise. Many statues in the tomb held a similarly round object, and were the targets of vandalism. Through further research, Cordova reached the conclusion that the symbols associated with Miktrull represented astriums, sacred artifacts that could open the Vault on Bogano.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zeffo",
  "/wiki/14_BBY",
  "/wiki/Zeffo_(species)",
  "/wiki/Force-sensitive",
  "/wiki/Zeffo_Sage",
  "/wiki/The_Force",
  "/wiki/Death",
  "/wiki/Tomb_of_Miktrull",
  "/wiki/Votive_candle",
  "/wiki/Jedi_Master",
  "/wiki/Eno_Cordova",
  "/wiki/Astrium",
  "/wiki/Bogano_Vault",
  "/wiki/Bogano",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Miktrull",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Template:JFODate",
  "/wiki/Standard_year"
 ]
}