{
 "name": "Milacass",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kerestian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Granse Confederacy"
     ]
    }
   ]
  }
 ],
 "content": "Milacass was a Kerestian bounty hunter and a member of the Granse Confederacy.\nA tall Kerestian with light yellow skin, he had thick brown double tails beginning at ridges along his forehead. His eyes were initially shining vibrant green, but they were damaged in the explosion of Clariv Shipyards; this seared both of Milacass's eyes and since he appeared to have no pupils.\nHe was known because of his violent temper and tendency to rage explosions, where he commonly damaged nearby equipment and people. A fight with a Gamorrean enforcer at the East Side of Luj City left Milacass with several missing teeth. In another occasion, he lost a Sabacc hand with a well-known gambler from the Oseon system; Milacass then exploded, destroyed thousands of credits in casino equipment and killed an innocent Bilar, but the gambler escaped.\nMilacass worked as a bounty hunter for Gotal crimelord Pari' Notgoth. A murder attempt against Notgoth on 3 BBY was tracked to Milacass. Even though he had been framed and was innocent, Milacass ran away and decided not to work again for crimelords.\nHe continued his career as a solo bounty hunter for the following six years. He became famous because of his efficiency: More than thirty bounties claimed, most of them to Imperial authorities.\nAround 2 ABY, Milacass joined the Granse Confederacy, a team of bounty hunters that commonly followed Rebel Alliance bounties. The Rebel Alliance nevertheless did not began looking for him them. However, at least two months after joining the Confederacy, Milacass stole the Waterspire, a Rebel Mon Calamari Simiyiar-class light freighter in Wilipiet, destroying Rebel property during the theft. The Waterspire since became one of the ships of the Confederacy . The Rebel Alliance has since began looking for Milacass and his accomplices.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kerestian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Granse_Confederacy",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Clariv_Shipyards",
  "/wiki/Gamorrean/Legends",
  "/wiki/Luj_City",
  "/wiki/Sabacc/Legends",
  "/wiki/Oseon_system",
  "/wiki/Bilar",
  "/wiki/Gotal/Legends",
  "/wiki/Pari%27_Notgoth",
  "/wiki/3_BBY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Waterspire",
  "/wiki/Simiyiar-class_light_freighter",
  "/wiki/Wilipiet",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}