{
 "name": "Milenec",
 "display_name": "Milenec",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Military",
      "Republic Military",
      "Order of Revan"
     ]
    }
   ]
  }
 ],
 "content": "Milenec was a male Human captain of the Galactic Republic living during the Galactic War. At some point he became part of the Order of Revan and defected from the Republic, joining with the Revanite forces on Rishi's Sky Ridge Island. There he commanded a group of other ex-Republic Revanites such as Sergeants Varn and Edrinu Zaya. Milenec was at odds with Sith Lord Ivress who commanded the ex-Imperial Revanite forces; despite being united by a common cause, he still did not trust his old enemy. After Revanites captured a Republic Strategic Information Service agent Theron Shan in Raider's Cove, Milenec was informed of his location in the main Revanite stronghold.\nThe fate of Milenec and his men varies greatly between light and dark side options for both sides. Republic characters can persuade Milenec and his men to take Ivress into custody, enabling them to return to the Republic, or\nabandon the Revanites altogether, leaving them with nowhere to go. Imperials can fool Milenec into betraying Ivress, again leaving him no future with either side, trick Ivress into detaining Milenec's men for treason, or simply kill him outright.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Order_of_Revan",
  "/wiki/Captain/Legends",
  "/wiki/Galactic_War",
  "/wiki/Rishi/Legends",
  "/wiki/Sky_Ridge_Island",
  "/wiki/Sergeant/Legends",
  "/wiki/Varn_(Zabrak)",
  "/wiki/Edrinu_Zaya",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Ivress",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Theron_Shan",
  "/wiki/Raider%27s_Cove",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan"
 ]
}