{
 "name": "Mill_Alibeth",
 "display_name": "Mill Alibeth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Mill Alibeth's Initiate Clan",
      "Mill Alibeth's Initiate Clan"
     ]
    }
   ]
  }
 ],
 "content": "Mill Alibeth was a Zabrak female Jedi Initiate who lived during the late Republic Era. As an Initiate, Alibeth possessed powerful empathic powers which she found difficult to control, resulting in her experiencing severe nausea whenever she was exposed to anything relating to combat or violence, even mere discussion of the subject. When the Clone Wars began in 22 BBY, the changed mood around the Jedi Temple made things so unpleasant for Alibeth that she attempted to cut herself off from the Force altogether on several occasions, which was noticed by older Padawan Anakin Skywalker as mysterious \"voids\" around the Temple which he could not discern the source of.\nSeveral weeks into the conflict, around the time Skywalker was knighted, Alibeth's Initiate Clan was set to go on the Gathering to the planet Ilum to retrieve kyber crystals so they could build their own lightsabers. Dreading the task, Alibeth was forced to stay behind after becoming sick and vomiting at the landing pad. Shortly thereafter, she was included in a group of younglings sent to accompany Jedi Knights Skywalker and D'urban Wen-Hurd on an aid mission to Langston. During the journey, Skywalker realized Alibeth was the source of the disturbances he had been sensing, and gave her some advice on how to control her abilities. When Skywalker subsequently set out to rescue his former Master Obi-Wan Kenobi on Cato Neimoidia, Alibeth insisted on accompanying him.\nMill Alibeth first appeared in the 2022 novel Brotherhood. Mike Chen, the book's author, stated in the acknowledgments that the Padawan was heavily inspired by the titular character from Hayao Miyazaki's film Nausicaä of the Valley of the Wind.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zabrak",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Mill_Alibeth%27s_Initiate_Clan",
  "/wiki/Jedi_Initiate",
  "/wiki/Republic_Era",
  "/wiki/Force_empathy",
  "/wiki/Force_power",
  "/wiki/Clone_Wars",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/22_BBY",
  "/wiki/Imperial_Palace",
  "/wiki/Sever_Force",
  "/wiki/The_Force",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Standard_week",
  "/wiki/Time",
  "/wiki/Anakin_Skywalker%27s_knighting_ceremony",
  "/wiki/The_Gathering",
  "/wiki/Planet",
  "/wiki/Ilum",
  "/wiki/Kyber_crystal",
  "/wiki/Lightsaber",
  "/wiki/Hangar",
  "/wiki/Youngling",
  "/wiki/Jedi_Knight",
  "/wiki/D%27urban_Wen-Hurd",
  "/wiki/Aid_mission_to_Langston",
  "/wiki/Langston",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/Mission_to_Cato_Neimoidia_(Kenobi_and_Skywalker)",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Cato_Neimoidia",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Mill_Alibeth",
  "/wiki/2022",
  "/wiki/Brotherhood",
  "/wiki/Mike_Chen_(author)",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}