{
 "name": "Milosh_Muhrlein",
 "display_name": "Milosh Muhrlein",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Wayland"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Milosh Muhrlein was a Human male who served the Galactic Republic and later the Galactic Empire during his lifetime. Obtaining the rank of colonel under the Empire, he was put in charge of Imperial Research Station 61 on the planet Wayland. There, he began selling the technology that his staff developed on the black market as a means of maintaining a luxurious lifestyle that he otherwise could not afford. Muhrlein's shady dealings were eventually discovered by Imperial Intelligence Agent Jahan Cross, who Muhrlein attempted to bribe into silence. When Muhrlein's efforts failed, he attempted to kill Cross, but he was unsuccessful and died in the attempt.\nMilosh Muhrlein was a Human male from a wealthy family who served the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. Following the end of the war in 19 BBY, Muhrlein's services were transferred to the Galactic Empire, the Republic's successor state, and he eventually attained the rank of colonel under the Empire. By the year 3 BBY, Colonel Muhrlein had been given command of Imperial Research Station 61 on the planet Wayland in the Mid Rim. However, his family's wealth had dried up by that time, leaving him unable to finance the luxurious lifestyle to which he had become accustomed. To supplement his Imperial pay, Muhrlein began auctioning off experimental technology and droid protocols from his station to the black market in secret, selling to the likes of Hutts, smugglers, and Rossum Droidworks. The Droidworks in particular were major clients of the Colonel, gifting him an Orchard vine and Novanian grog from the Corporate Sector as thanks for the sale of supplies for their Iron Eclipse computer virus project. As a precaution against intruders who might discover his misdeeds, Muhrlein had B-2A and B-2B, two of the station's newest models of experimental battle droid, installed in the walls of his office.\nIn 3 BBY, Muhrlein discovered Jahan Cross, an envoy of the Imperial Diplomatic Corps and an agent of Imperial Intelligence, searching through the station's files in his office with the aid of the Human replica droid IN-GA 44. Despite Muhrlein's protests at the search, Cross continued and accused the colonel of selling goods from the station on the black market, basing his accusations on both evidence from the files and the gifts from Rossum Droidworks, which were too expensive for the commandant to have bought on his own salary. Muhrlein unsuccessfully attempted to bribe the agent, and then ordered his battle droids to attack. IN-GA 44 dispatched the droids while Muhrlein attempted to shoot Cross, defending himself with an updated Verpine force field. Cross bypassed the field with a pair of devices hidden in the heels of his boots, which then released a large electrical surge that killed Muhrlein. Muhrlein's family and friends in Imperial Court complained after his death, but despite this Cross began an investigation into the Iron Eclipse project based on his findings in Muhrlein's files.\nMilosh Muhrlein had blue eyes and fair skin. By the time of his death, he had become accustomed to a luxurious lifestyle and was willing to betray the Empire to maintain it. Muhrlein had the foresight to install various defenses in case his treachery was discovered. When his treachery was revealed, he attempted to use bribes to save himself and considered Agent Cross a fool for having principles and not taking the bribe. While commandant, Muhrlein had gray hair.\nWhile commandant, Muhrlein wore an Imperial officer's uniform and an upgraded force field made by the Verpine species. He possessed a collection of blasters which he displayed on his wall, and he carried one on his person for self-defense in addition to his two battle droids.\nMilosh Muhrlein first appeared in the 2011 comic book Agent of the Empire – Iron Eclipse 1, which was written by John Ostrander as part of the \"Iron Eclipse\" story arc of the Star Wars: Agent of the Empire series. Muhrlein was illustrated by Stéphane Roux.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3_BBY/Legends",
  "/wiki/Wayland",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Imperial_Research_Station_61",
  "/wiki/Planet/Legends",
  "/wiki/Black_market/Legends",
  "/wiki/Mission_to_Imperial_Research_Station_61",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Jahan_Cross",
  "/wiki/Death/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Time/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Rossum_Droidworks",
  "/wiki/D%27ian_orchid_vine",
  "/wiki/Novanian_grog/Legends",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Iron_Eclipse",
  "/wiki/Computer_virus/Legends",
  "/wiki/B-2A",
  "/wiki/B-2B",
  "/wiki/Battle_droid/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Imperial_Diplomatic_Corps",
  "/wiki/Human_replica_droid",
  "/wiki/IN-GA_44",
  "/wiki/Verpine/Legends",
  "/wiki/Force_field/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Imperial_Court/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Species/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/2011",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_1",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Agent_of_the_Empire%E2%80%94Iron_Eclipse",
  "/wiki/Star_Wars:_Agent_of_the_Empire",
  "/wiki/St%C3%A9phane_Roux",
  "/wiki/Star_Wars_Insider",
  "/wiki/Classic_Moment",
  "/wiki/Star_Wars_Insider_153",
  "/wiki/The_New_Essential_Chronology"
 ]
}