{
 "name": "Miltin_Takel",
 "display_name": "Miltin Takel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gargon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Kessel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy",
      "Trioculus' Empire"
     ]
    }
   ]
  }
 ],
 "content": "Miltin Takel was a veteran fleet admiral who became one of the twelve original Imperial Grand Admirals appointed by Emperor Palpatine two years before the Battle of Yavin. Known for his strong vices, the Grand Admiral was a spice addict from the world of Gargon and used the resources of the Empire to obtain the highest-quality substances. In addition, Takel had a lust for non-Human women, something that would have been looked down upon by the Imperials who subscribed to Human High Culture had Takel's brother, Imperial Governor Griff Takel, not hid the Grand Admiral's improprieties. Despite these proclivities, Takel was a masterful commander, aided by the limited telepathy that was granted to him by the use of glitterstim.\nFollowing the Emperor's death during the Battle of Endor, Takel's influence quickly slipped away. The opposing Grand Admiral Josef Grunger used the Imperial fallout from Endor to bully Takel's forces out of his former holdings, causing a minor power struggle that ended with Takel's retreat. Desperate to get the better of Grunger, Takel fell in with the Slavelord Trioculus and the Central Committee of Grand Moffs, who promised to deal with the upstart Grand Admiral. However, the alliance proved to be Takel's downfall. In a state of spice-induced paranoia, Takel questioned the slavelord on his plan to take the Imperial throne. Tired of the Grand Admiral undermining his authority, Trioculus had Takel executed by his right-hand man, Grand Moff Hissa, with a single blast from his laser pistol.\nNative to the planet Gargon in the Mandalore sector, a world known for its spice production, the Human male Miltin Takel was a flamboyant, street-talking man with a taste for hobnobbing with the upper crust of society who loved to spread rumors and gossip among those who lived in the lap of luxury. Takel was well known for his carnal weaknesses, enjoying the pleasure of both spice and women, usually at the same time. However, only those persons close to the man knew that his passions fell outside the Imperial ideals of Human High Culture. Takel's penchant for females of other species was kept secret by his brother, Griff Takel, the Governor of the Core World Esseles, who had been promoted to that position during the Clone Wars in 21 BBY. The influence of his brother allowed Takel to pursue his depraved interests with impunity.\nDespite these issues, Takel possessed a keen strategic mind, which he augmented with the mind-reading abilities that glitterstim spice provided. By the time of the Galactic Empire, Takel's ties to the Imperial elite allowed him to procure the highest-quality spices. Wendell Wright-Sims, an importer with express permission from Emperor Palpatine to provide spice to Coruscant's elite, was Takel's personal spice dealer. Takel's spice habit gave him an edge that he needed to achieve victory at the Siege of Trasemene. This victory was highly celebrated by the Empire, and its inclusion in Plescinia Entertainments' CS-Mark 10 Imperial Command Combat Simulator was one of only twelve historical battles to be placed within the simulator's \"Great Battles of the Empire\" series.\nBy 2 BBY, Takel had built a reputation as a highly noted Imperial commander, who by then had years of service as a fleet admiral. As such, he was one of only twelve commanders promoted to the newly created rank of Grand Admiral in an elaborate ceremony during Coruscant's New Year Fete Week. This promotion also included a change in uniform. During his time as a Grand Admiral, Takel's flagship was the Star Destroyer Magic Dragon. In 0 ABY, Takel was one of several officers to make an appearance on Coruscant with the Emperor and Darth Vader for New Year Fete Week. Around the same time, Takel was involved in a ceremony in which he awarded the Distinguished Medal of Imperial Honor to Captain Sergus Lanox for keeping his Star Destroyer, the Imperial Hazard, out of Rebel hands. This ceremony was important enough to be broadcast over the HoloNet.\nIn 3 ABY, the people of Mandalore, bolstered by their victory at the Battle of the City of Bone, rallied behind their leader, Fenn Shysa, and rose up against Takel's forces, whose territory included his home Mandalore sector. Eventually, the rejuvenated Mandalorian Protectors were able to oust the Grand Admiral from Mandalorian space. Despite this unrest, Takel did not abandon his social engagements. He was one of a select few who were invited to the premier of The Kallea Cycle opera on Imperial Center in 3 ABY. At a gala commemorating the opening night of this performance, the subject of the Imperial defeat at the Battle of Yavin was still fresh in the minds of the patrons, and Takel was heard spreading a rumor of the late Grand Moff Wilhuff Tarkin's improprieties against his wife with a female aide. In 4 ABY, following the Zaarin insurrection, Takel was one of only a handful who knew of the secret promotion of the Chiss Mitth'raw'nuruodo to Grand Admiral after the death of his traitorous predecessor, Demetrius Zaarin. Later, at a meeting with Darth Vader, Palpatine, and Thrawn, Takel witnessed a holographic readout of the under-construction Death Star II battlestation.\nThe unrest in the Mandalore sector did not prevent Takel from being called away to the Forest Moon of Endor to take part in the Battle of Endor. Alongside several other Grand Admirals, including Nial Declann, Afsheen Makati, and Osvald Teshik, Takel was stationed aboard the second Death Star to witness the Empire's final destruction of the Rebel Alliance. During the battle, Takel was intoxicated with glitterstim, a decision that would ultimately save his life. The drug's ability to give the user telepathic abilities allowed Takel to sense the unease radiating from Declann, who was busy helping to coordinate the Imperial Fleet with battle meditation. Not waiting to determine the cause of his contemporary's fears, Takel fled the station, narrowly escaping the Death Star's destruction. Rather than attempt to rally the Fleet as Teshik did, Takel fled the ensuing battle, as did Makati.\nFollowing this defeat, Takel's fortunes rapidly deteriorated. Grand Admiral Josef Grunger, who was busy aiding Takel's forces in the search for \"albino-skinned marauders\" who had been reported near Takel's homeworld of Gargon, decided to take advantage of the death of the Emperor by making a bid for the throne. While Takel continued to defend his base of operations while awaiting orders from Palpatine's successor, Grunger opened fire on Takel's first officer immediately after hearing of the defeat at Endor, disabling his ship and taking control of the planet. Using his high rank and the sense of confusion surrounding the Emperor's death, Grunger quickly bullied Takel's forces out of Gargon.\nIn the aftermath of the loss of his home sector, Takel attached his banner to Director of Imperial Intelligence Ysanne Isard and attempted to retake his former holdings. However, Grunger's immense armada caused the campaign to end in failure. After Isard threatened to execute Takel for this defeat, the Grand Admiral decided to barter his allegiance to other upstarts who had made a bid for the throne. In this capacity, Takel fled to the convocation of Grand Moffs on Kessel, where the Central Committee of Grand Moffs presented the Slavelord Trioculus as the Son of Palpatine and the rightful heir to the throne. In a spice-induced haze, Takel somehow felt connected to the three-eyed slavelord. The feeling of connection was reinforced when Trioculus promised to deal with the upstart Grunger.\nNow with a passing attachment to Trioculus' cause, Takel was present at a closed meeting whose attendance included Grand Moff Hissa and a select group of Grand Moffs loyal to Trioculus. The group indulged in a meal of Whaladon meat before Trioculus addressed the small group. The slavelord demanded that the group use all their resources to retrieve the glove of Darth Vader, based on a proclamation by the false Supreme Prophet Kadann that only the owner of the glove would receive his blessing as the new Emperor. Following this, Trioculus asked for suggestions for a new home base. Takel offered the world of Dagobah as a suggestion, but the idea was quickly dismissed by the slavelord.\nDespite other suggestions, Trioculus decided on the ice planet of Hoth as a new base. However, Takel, on another of his spice binges, suddenly rose from the table to question Trioculus' order that all available equipment be shipped to Hoth. Paranoid over the vulnerability that this operation would put them in, the Grand Admiral became irate, claiming that Trioculus was being too hasty in his plans and that if Grunger found the glove, any future plans would be doomed. Before Takel could continue his rant, he was quickly executed by Hissa with a shot from his sidearm blaster pistol at Trioculus' unspoken order. At his death, Takel fell forward onto the meeting room's banquet table, a victim of Trioculus' bid for power.\nGrand Admiral Takel was a brilliant tactician and military commander, as well as a respected strategist whose promotion to Grand Admiral brooked little argument. However he was ultimately a slave to his many vices. His lust for the finer things made him a common presence at important Imperial events. Despite mingling with higher society, he did not abandon his less-savory aspects, continuing to talk in a street-wise manner and employing the services of non-Human females. Twi'lek dancers and Zeltron cafarel frequently shared Takel's private quarters aboard the Magic Dragon and the Grand Admiral was known to share his clothing with his non-Human companions. Takel's addiction to spice was both a blessing and a curse. Although it allowed him a great victory at Trasemene and prevented him from perishing aboard the second Death Star, frequent use caused him to become quite paranoid. His lack of tact due to the effects of the drug during an important meeting with Trioculus ultimately resulted in his demise.\nTakel acquitted himself with his sense of style and was infamous for his flamboyancy. To hold his spice supplies, Takel employed a gundark-hide bag. Takel often appeared at high-profile events, and he attended at least two New Year Fete Week events and the opening premier of The Kallea Cycle. Additionally, he presented the Distinguished Medal of Imperial Honor to worthy candidates, as he did with Captain Sergus Lanox.\nGrand Admiral Takel was created for the Star Wars Adventure Journal and was first mentioned in the Galaxywide NewsNets section of Star Wars Adventure Journal 5 in February 1995, in which he was noted to have attended a New Year Fete Week celebration alongside Darth Vader and Emperor Palpatine. Another Galaxywide NewsNets in Star Wars Adventure Journal 9 mentioned a \"Governor Takel\" of Esseles who was dealing with a terrorist attack by the Faceless mercenaries. Takel first appeared, as a hologram, once more in the Adventure Journal, when he was mentioned in the short story The Capture of Imperial Hazard in Star Wars Adventure Journal 10. Takel was also mentioned in the Shadows of the Empire Sourcebook, which revealed that the character was one of the customers of the spice dealer Wendell Wright-Sims.\nThe gaming magazine Star Wars Gamer was initially slated to release an article entitled Dirty Dozen: The Imperial Grand Admirals by Daniel Wallace and Abel G. Peña, which was set to give new information on the Grand Admirals, including Takel. However, the magazine was canceled before the article could be released. The article was eventually picked up by Star Wars Insider and released in Star Wars Insider 66 in 2003. The article revealed more information about Takel's backstory, including the revelation of his first name of Miltin and the clarification that \"Governor Takel\" from Star Wars Adventure Journal 9 was actually his brother. Additionally, the article retconned Takel as the unnamed Grand Admiral from Gargon who appeared in The Glove of Darth Vader. The cut content from the article initially prepared for Star Wars Gamer included roleplaying game stats and other additional information. Among this information was the name of Takel's personal Star Destroyer, Magic Dragon, a reference to his drug habit. Magic Dragon was not confirmed as the name of Takel's Star Destroyer until the release of Barely Tolerable: Alien Henchmen of the Empire in 2013, which also repeated the Grand Admiral's previously cut liaisons with Twi'lek and Zeltron women aboard his flagship.\nAs explained by Abel G. Peña on the Jedi Council Forums, in the article Who's Who: Imperial Grand Admirals, he intended Miltin Takel to be the Grand Admiral shocked with lightning by Trioculus in The Glove of Darth Vader. However, due to a miscommunication with illustrator Joe Corroney, Corroney drew Takel with the appearance of another Imperial seen in a later meeting with Trioculus.  As it is, which Grand Admiral was in this scene remains ambiguous. It may be Takel, with some artistic license assumed in the illustration, or it may be an entirely different one; Peña has proposed Rufaan Tigellinus as a possibility. The Grand Admiral who is shocked by Trioculus is not identified as being from Gargon, so it is possible that this man is separate from the Grand Admiral from Gargon who is executed by Hissa later in the book, as suggested.\nFollowing the release of the Who's Who article, Takel has been mentioned in passing in several other sourcebooks and articles. Two other Star Wars Insider articles, The History of the Mandalorians and Underworld: A Galaxy of Scum and Villainy, released in 2005 and 2006 respectively, mentioned Takel's rule of the Mandalore sector and his penchant for glitterstim. The reference to Takel in The History of the Mandalorians mentioned that Fenn Shysa's soldiers rose up against his rule. This hook was referenced in the 2009 sourcebook Galaxy at War, which clarified that the Mandalorians were successful in ousting Takel from Mandalorian space.\nGrand Admiral Takel had an unexplained ability to predict the maneuvers of the enemy, using his Star Destroyer, Magic Dragon. Some in his forces believed Takel to be somewhat Force-sensitive, though most believed that it was due to the telepathic abilities granted by his addiction to glitterstim. When Takel evacuated the second Death Star, he boarded the Star Destroyer Chimaera. He was able to speak Rodese and understand Lekku. Upon his death, the last thought that went through Takel's mind was, \"Prime.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Gargon/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Trioculus%27_Empire",
  "/wiki/Fleet_Admiral/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Human_High_Culture",
  "/wiki/Governor/Legends",
  "/wiki/Griff_Takel",
  "/wiki/Telepathy/Legends",
  "/wiki/Glitterstim/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Josef_Grunger",
  "/wiki/Endor/Legends",
  "/wiki/Supreme_Slavelord",
  "/wiki/Trioculus",
  "/wiki/Central_Committee_of_Grand_Moffs",
  "/wiki/Slavery/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Bertroff_Hissa",
  "/wiki/Laser/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Mandalore_sector/Legends",
  "/wiki/Species/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Esseles/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Time/Legends",
  "/wiki/Wendell_Wright-Sims",
  "/wiki/Coruscant/Legends",
  "/wiki/Drug_dealer",
  "/wiki/Siege_of_Trasemene",
  "/wiki/Plescinia_Entertainments/Legends",
  "/wiki/CS-Mark_10",
  "/wiki/Holosimulator",
  "/wiki/Standard_year/Legends",
  "/wiki/Fete_Week",
  "/wiki/Grand_Admiral_uniform/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Magic_Dragon",
  "/wiki/0_ABY/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Distinguished_Medal_of_Imperial_Honor/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Sergus_Lanox",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Imperial_Hazard",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Battle_of_the_City_of_Bone",
  "/wiki/Fenn_Shysa",
  "/wiki/Sector/Legends",
  "/wiki/Mandalorian_Protectors/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/The_Kallea_Cycle",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Thalassa_Tarkin",
  "/wiki/Natasi_Daala",
  "/wiki/4_ABY/Legends",
  "/wiki/Zaarin_insurrection",
  "/wiki/Chiss/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Demetrius_Zaarin",
  "/wiki/Darth/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battlestation",
  "/wiki/Nial_Declann",
  "/wiki/Afsheen_Makati",
  "/wiki/Osvald_Teshik",
  "/wiki/Death_Star/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Battle_meditation",
  "/wiki/Space_station/Legends",
  "/wiki/Nagai",
  "/wiki/Homeworld/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Unidentified_Imperial_first_officer",
  "/wiki/Starship/Legends",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Ysanne_Isard",
  "/wiki/Moff/Legends",
  "/wiki/Whaladon/Legends",
  "/wiki/Glove_of_Darth_Vader",
  "/wiki/Supreme_Prophet",
  "/wiki/Rajah_Ubooki",
  "/wiki/Dagobah/Legends",
  "/wiki/Water/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Zeltron/Legends",
  "/wiki/Cafarel",
  "/wiki/Gundark/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/February",
  "/wiki/1995",
  "/wiki/Star_Wars_Adventure_Journal_9",
  "/wiki/Terrorist/Legends",
  "/wiki/Faceless",
  "/wiki/Mercenary/Legends",
  "/wiki/The_Capture_of_Imperial_Hazard",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Dirty_Dozen:_The_Imperial_Grand_Admirals",
  "/wiki/Daniel_Wallace",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/2003",
  "/wiki/Retcon",
  "/wiki/The_Glove_of_Darth_Vader",
  "/wiki/Roleplaying_game",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Barely_Tolerable:_Alien_Henchmen_of_the_Empire",
  "/wiki/2013",
  "/wiki/Jedi_Council_Forums",
  "/wiki/Force_lightning/Legends",
  "/wiki/Joe_Corroney",
  "/wiki/File:Central_Committee.jpg",
  "/wiki/Rufaan_Tigellinus",
  "/wiki/The_History_of_the_Mandalorians",
  "/wiki/Underworld:_A_Galaxy_of_Scum_and_Villainy",
  "/wiki/2005",
  "/wiki/2006",
  "/wiki/Soldier/Legends",
  "/wiki/2009",
  "/wiki/Galaxy_at_War",
  "/wiki/Star_Wars",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Chimaera/Legends",
  "/wiki/Rodese",
  "/wiki/Lekku/Legends",
  "/wiki/West_End_Games",
  "/wiki/An_Old_Flame_in_Need...",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/Star_Wars_Insider_80",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_67",
  "/wiki/In_A_Galaxy_Far,_Far_Away",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/StarWars.com",
  "/wiki/CIS_Shadowfeed_Dispatch_14:9:15_Edition",
  "/wiki/Star_Wars_Insider_70",
  "/wiki/Galladinium%27s_Fantastic_Technology",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Forgotten_War:_The_Nagai_and_the_Tofs",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/January_28",
  "/wiki/Martio_Batch",
  "/wiki/Octavian_Grant",
  "/wiki/Ishin-Il-Raz",
  "/wiki/Danetta_Pitta",
  "/wiki/Peccati_Syn",
  "/wiki/Balanhai_Savit"
 ]
}