{
 "name": "Minas_Velti",
 "display_name": "Minas Velti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Minas Velti was a human female Jedi Master towards the end of the Clone Wars. Velti was killed by clone troopers of the 501st Legion during the siege of the Jedi Temple at the start of the Great Jedi Purge and the implementation of Order 66.\nMinas Velti served the Jedi Order as a Jedi Master at the end of the Clone Wars. In 19 BBY, as Velti led a group of Jedi Initiates — including Reva Sevander — through a training routine within the Jedi Temple on Coruscant, the Grand Army of the Republic executed Order 66—the command to eliminate the Jedi—under the authority of Supreme Chancellor Sheev Palpatine. As part of the siege of the Jedi Temple, clone troopers of the 501st Legion interrupted Velti's training and opened fire upon the Jedi Initiate Clan. Velti defended herself and the younglings before striking the troopers down. She then led her younglings through the Temple, protecting them along the way. Velti was soon overwhelmed by clone troopers and was killed in combat.\nThough Velti died in the escape, she protected the group of younglings, who were able to use her sacrifice to run. However, Velti's death only delayed the inevitable as Darth Vader found the younglings and slaughtered them all, except for Reva.\nMinas Velti was a human female. As a Jedi Master, she was involved in the training of younglings who composed the future generation of the Jedi. During the attack on the Jedi Temple, Velti protected her students, attempting to lead them to safety while fighting multiple clone troopers.\nVelti was a Force-sensitive who was skilled in the art of lightsaber combat, particularly its defensive aspects such as the deflection of blaster shots. As such, she was able to initially fend the clone troopers off, killing several clones with her lightsaber.\nVelti wielded a green lightsaber and wore brown Jedi robes.\nMinas Velti appeared in \"Part I,\" the first episode of the television series Obi-Wan Kenobi, which premiered on May 26, 2022. While unnamed in the episode, the credits identified her as \"Jedi Master Minas Velti\" and as portrayed by Ming Qiu.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/Clone_Wars",
  "/wiki/Death",
  "/wiki/Clone_trooper",
  "/wiki/501st_Legion",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Order_66",
  "/wiki/Jedi_Initiate",
  "/wiki/Reva_Sevander",
  "/wiki/Jedi_training",
  "/wiki/Imperial_Palace",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Jedi_Initiate_Clan",
  "/wiki/Youngling",
  "/wiki/Trooper",
  "/wiki/Jedi_temple",
  "/wiki/Cloning",
  "/wiki/Anakin_Skywalker",
  "/wiki/Force-sensitive",
  "/wiki/Lightsaber_combat",
  "/wiki/Blaster",
  "/wiki/Lightsaber",
  "/wiki/Jedi_robes",
  "/wiki/Part_I",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/May_26",
  "/wiki/2022",
  "/wiki/Ming_Qiu",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Part_V",
  "/wiki/Disney%2B"
 ]
}