{
 "name": "Mina Bonteri",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Onderon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.78 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Bonteri",
      "Galactic Republic",
      "Core Worlds educational reform committee",
      "Core Worlds educational reform committee",
      "Confederacy of Independent Systems",
      "Peace Faction",
      "Peace Faction"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Padmé Amidala"
     ]
    }
   ]
  }
 ],
 "content": "Mina Bonteri was a female human native to the planet Onderon. Prior to the Clone Wars, Bonteri represented Onderon in the Galactic Senate and served as a mentor to Padmé Amidala of Naboo. The two became close friends in the Senate, but their relationship deteriorated as Bonteri began to discreetly serve Count Dooku and the Separatist secessionist movement, where many worlds began to organize a breakaway from the Galactic Republic. Eventually, the two sides began the Clone Wars, and Bonteri joined the Separatist Senate, serving as the senator of the Japrael sector.\nOne year into the conflict, Bonteri was approached by her former friend Amidala, who still served in the Republic Senate, asking her to help negotiate a peace initiative. Bonteri and Amidala met secretly, and the two began to cooperate and see reason in ending the conflict. However, Darth Sidious became aware of their plans and, wanting to continue the war, orchestrated Bonteri's death. In the aftermath of a bombing on the Republic capital of Coruscant derailed the peace talks, the initiative was put to bed for good following Bonteri's death during a Republic attack. Although Dooku publicly pulled the Separatists out of negotiations, blaming Republic forces for Bonteri's demise, Separatist agents were responsible the deed. Bonteri's son Lux would fill her position in the Senate. However, he left the Confederacy when he learned that Dooku had arranged his mother's death.\nPrior to the outbreak of the Clone Wars, by at least 28 BBY, Mina Bonteri held the position of senator for the planet Onderon, her homeworld. Sometime before her appointment to senator, Bonteri and her husband had a son, Lux Bonteri, and by 28 BBY, had also secretly began to follow the orders of the Count of Serenno, Dooku, who had been making preparations for an approaching secessionist movement by recruiting worlds whose inhabitants preferred a populist government. As a result, Bonteri would often receive and answer calls from the Count within her office, which had later come to the attention of Galactic Republic Senators Bail Organa, Mon Mothma, and Onaconda Farr.\nShe met Padmé Amidala at a party being hosted by Chancellor Sheev Palpatine, being introduced to her by Senator Rush Clovis of Scipio. The two of them instantly hit it off as friends, and since she was the first politician to be nice to Padmé since Padmé joined the Senate six weeks earlier, Mina became something of a mentor to the younger senator. Their relationship soon began conflicting with Mina's loyalty to Dooku once Padmé began introducing legislation and motions counter to Dooku's goals. After the Bromlarch crisis, when Mina failed to help the Trade Federation take over the Mid Rim planet, she was forced to cut off her mentorship with Padmé. However, they remained friends up until the true beginning of the Separatist Crisis in 24 BBY, this being the last time Padmé would see Lux until the midpoint of the Clone Wars, a war between the Republic and the Separatists two years later.\nBy the time the Clone Wars broke out, Bonteri had joined Count Dooku's Confederacy of Independent Systems as a member of the Separatist Senate. She and her son relocated to the Confederacy's capital planet, Raxus Secundus where they had a home in Raxulon. Some time into the war, Bonteri's husband had been killed by Republic clone troopers during a battle on Aargonar.\nAlmost a year later, Bonteri was later contacted by Amidala, who wished to discuss a peace initiative between the Galactic Republic and Confederacy. Amidala and her friend, the Jedi Padawan Ahsoka Tano, secretly visited her on Raxus to discuss the proposed initiative. Bonteri was initially skeptical that the plan would work, but decided to do her best to convince the Separatist Senate to act on it. During a session of the Confederate Senate, Bonteri called for a vote to open the peace talks with Republic. However, Bonteri's efforts were thwarted by General Grievous's terrorist attack on Coruscant on the orders of Dooku.\nBonteri was killed in an apparent Republic attack that followed the failed peace initiative, but Republic spies confirmed that it was Dooku's agents who killed her. Her son tried to avenge his mother's death by briefly joining the Death Watch. He then returned to Onderon and joined the rebels in freeing the planet and return Ramsis Dendup to the throne. Impressed by the Jedi Order's efforts to liberate Onderon, Lux vowed to guide the people of Onderon back to the Republic as their new senator in the Galactic Senate.\nThe name and photo of Bonteri was featured in Star Wars Insider 121, released on October 26, 2010. She later appeared in the Star Wars: The Clone Wars television series episode \"Heroes on Both Sides,\" where she was voiced by Kath Soucie, who also voiced Republic Senator Mon Mothma.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mina_Bonteri",
  "/wiki/Mina_Bonteri/Legends",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Mina_Bonteri",
  "/wiki/Onderon",
  "/wiki/21_BBY",
  "/wiki/Human",
  "/wiki/Onderonian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/House_Bonteri",
  "/wiki/Galactic_Republic",
  "/wiki/Core_Worlds_educational_reform_committee",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Peace_Faction",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Senate",
  "/wiki/Naboo",
  "/wiki/Count_of_Serenno",
  "/wiki/Dooku",
  "/wiki/Separatist_Crisis",
  "/wiki/Separatist_Senate",
  "/wiki/Senator",
  "/wiki/Japrael_sector",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Darth_Sidious",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Coruscant",
  "/wiki/Death",
  "/wiki/Attack_on_Confederate_people",
  "/wiki/Lux_Bonteri",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/28_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Homeworld",
  "/wiki/Mina_Bonteri%27s_husband",
  "/wiki/Count",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Mon_Mothma",
  "/wiki/Onaconda_Farr",
  "/wiki/Supreme_Chancellor",
  "/wiki/Rush_Clovis",
  "/wiki/Scipio",
  "/wiki/Bromlarch",
  "/wiki/Trade_Federation",
  "/wiki/Mid_Rim_Territories",
  "/wiki/24_BBY",
  "/wiki/22_BBY",
  "/wiki/Time",
  "/wiki/Cloning",
  "/wiki/Capital",
  "/wiki/Raxus_Secundus",
  "/wiki/Mina_Bonteri%27s_house",
  "/wiki/Raxulon",
  "/wiki/Marriage",
  "/wiki/Clone_trooper",
  "/wiki/Battle_of_Aargonar_(Clone_Wars)",
  "/wiki/Aargonar",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Spy",
  "/wiki/Agent",
  "/wiki/Parent",
  "/wiki/Death_Watch",
  "/wiki/Onderon_rebels",
  "/wiki/Onderonian_Civil_War",
  "/wiki/Ramsis_Dendup",
  "/wiki/Jedi_Order",
  "/wiki/Star_Wars_Insider_121",
  "/wiki/October_26",
  "/wiki/2010",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Kath_Soucie",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Pursuit_of_Peace_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/A_Friend_in_Need",
  "/wiki/A_War_on_Two_Fronts",
  "/wiki/The_Soft_War",
  "/wiki/Tipping_Points",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_7",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Separatists",
  "/wiki/Databank_(website)"
 ]
}