{
 "name": "Mindiz",
 "display_name": "Mindiz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  }
 ],
 "content": "Mindiz was a young female human from the planet of Lothal. When the Galactic Empire conquered Lothal, the tyrannical government started taking over the local peasants' lands. Mindiz' parents tried to resist the Empire, but were taken away as a result, leaving their daughter on her own at a young age. By 4 BBY, Mindiz lived in the Lothalian slum of Tarkintown, where she was one of the youngest residents. In Tarkintown, she became acquainted with the Spectres, a band of freedom fighters who used to distribute food supplies to the poor. She developed a special relationship with Garazeb Orrelios, a Lasat warrior. She also found an ally in Mister Mulb, a Tarkintown resident who looked after her.\nOne day, the Spectres came to Tarkintown to distribute crates of fruits, and Mindiz turned up to have her share. However, after taking a bite of a jogan fruit that Orrelios had handed to her, she became suddenly ill and felt unconscious. It appeared that the crates had all been poisoned. Because the Lasat warrior felt responsible for what had happened to Mindiz, he decided to raid the medical facility of the Imperial Command Center in Capital City. A short time later, Mindiz was cured and she woke up with her Lasat friend at her side.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lothal",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/Parent",
  "/wiki/4_BBY",
  "/wiki/Lothal_re-settlement_camp_43",
  "/wiki/Spectres",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Lasat",
  "/wiki/Mulb",
  "/wiki/Jogan_fruit",
  "/wiki/Poison",
  "/wiki/Imperial_Complex_(Lothal)",
  "/wiki/Capital_City",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Sabotaged_Supplies",
  "/wiki/Star_Wars_Rebels_Magazine_7",
  "/wiki/Rebels_comics_timeline/Email_from_Martin_Fisher",
  "/wiki/Path_of_the_Jedi",
  "/wiki/Idiot%27s_Array_(episode)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}