{
 "name": "Minder of Weak Wills",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Yavin 4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cult of Exar Kun"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Exar Kun"
     ]
    }
   ]
  }
 ],
 "content": "The Minder of Weak Wills was a dark side Force user who was an unwilling follower of Exar Kun.\nThe Minder of Weak Wills was a former student at Corellia University. The Minder was enslaved after a archaeological dig on Yavin 4 in 1 ABY she was involved in had unknowingly tunneled into the burial chamber of the Temple of Exar Kun and released the ancient Sith Lord's spirit. The entire team was subsequently enslaved by the malevolent spirit and were ordered into the Cult of Exar Kun. Later, a Corellia University research outpost on Talus was invaded by the Cult and all its students and researchers were enslaved as well, afterward most were brought back to Yavin 4. Fearing why he had lost contact with the outpost, Professor Cornelius Wagglehorn hired a group of spacers to travel to Talus and investigate. The spacers learned what had transpired and informed the professor.\nHe provided them with the coordinates to the tomb and implored them to destroy the evil Sith Lord's spirit within. The Minder was the second major obstacle the spacers encountered within the tomb, having just triumphed over Open Hand of Hate. The Minder had been empowered with the Force by Kun's spirit, and she used it to bend various creatures to her will. Commanding an army of tomb flier bats and skreegs, she ordered them to attack the spacers. The spacers eventually killed her pets and she was forced to take matters into her own hands. After a relatively short fight, she was killed by the combined might of the group, her spirit freed from the grasp of the evil Exar Kun. Afterward, the spacers continued deeper into the tomb, eventually coming upon the Caretaker of the Lost Souls.\nThe Minder of Weak Wills was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Minder of Weak Wills was added to the game as part of the \"Exar Kun\" Heroic Encounter, introduced with the release of the \"Chapter 9\" update, on April 3, 2008.\nThe Minder of Weak Wills was a \"boss\" enemy NPC in the Temple of Exar Kun Heroic Encounter. She was the second encounter in the instance, coming after the Open Hand of Hate and before the Caretaker of Lost Souls.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Cult_of_Exar_Kun",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Corellia_University/Legends",
  "/wiki/Temple_of_Exar_Kun",
  "/wiki/Corellia_University_research_outpost",
  "/wiki/Talus/Legends",
  "/wiki/Cornelius_Wagglehorn",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Open_Hand_of_Hate",
  "/wiki/Caretaker_of_the_Lost_Souls",
  "/wiki/File:Minder_of_Weak_Wills_SWG.png",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/April_3",
  "/wiki/2008",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Galactic_Hunters",
  "/wiki/Template:SWGTCG",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}