{
 "name": "Minister_of_Intelligence_(Galactic_War)",
 "display_name": "Minister of Intelligence  (Galactic War)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dromund Kaas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireMinistry of IntelligenceImperial Intelligence",
      "Ministry of IntelligenceImperial Intelligence",
      "Imperial Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "A male Human spymaster was a member and subsequently leader of the Imperial Intelligence in the Sith Empire for many years. He held the rank of Keeper during the Cold War, but following the Eradication Day was promoted to the Minister of Intelligence, replacing his predecessor.\nThe man codenamed \"Keeper\" was the ultimate spymaster in the Sith Empire during the Cold War's final year. Charged with overseeing the Operations Division of Imperial Intelligence, Keeper approved every infiltration into enemy territory, every execution of an enemy of the state. He was responsible for the actions of his agents. If he failed in the eyes of the Minister of Intelligence or the Sith on the Dark Council, he could have been swiftly replaced. Having held his post for almost a decade, the Keeper was suspected of overseeing Projects \"Operation Morning Crest\" and \"Operation Starbender.\"\nRepublic counterintelligence believed he was once posted inside the Imperial Navy, but that he had lost any military idealism.\nIn 3643 BBY, Keeper dispatched a talented agent to Nal Hutta to infiltrate Suudaa Nem'ro's organization under the alias of the infamous pirate known as the Red Blade and convince the Hutt to align with the Empire. Keeper believed that they may have a sympathizer in Karrels Javis, Nem'ro's lieutenant. Unfortunately, he later learned that Javis' sons made a mistake of crossing a Sith. One son was killed while the other was crippled. Thus, he ordered his agent to assassinate Javis and place the blame on Nem'ro's rival, Voontara Fa'athra. Subsequently, Keeper also hired the services of Kaliyo Djannis, one of Nem'ro's hirelings and a known anarchist.\nAfter successfully gaining Nem'ro's allegiance, Keeper recalled the agent and Kaliyo to Dromund Kaas to deal with a rising terrorist movement. However, Keeper had to deal uncomfortably with Darth Jadus, a member of the Dark Council, who acknowledged his agent's talent. Keeper then transferred his position as the agent's liaison to Watcher Two, as the agent traveled about to stop the terrorists. Though the agent was able to thwart their plan to cause a blackout in Kaas City, the terrorists destroyed Jadus' flagship, the Dominator. Keeper then promoted the agent to the rank of Cipher Nine to track down the terrorist cells.\nAfter the defeat of Darth Jadus, Keeper was promoted to the position of Minister of Intelligence, thus letting Watcher Two replace him as Keeper. His wife said that the new position suited him. However, his position was limited, as he could barely make a move without being hassled by a Dark Lord. One of the hardest parts of his career was ordering Cipher Nine's brainwashing program to avoid executing the agent for opposing Jadus. Cipher later broke the brainwashing with aid from Watcher X.\nFollowing Cipher Nine's successful infiltration and elimination of Ardun Kothe's SIS strike team, the Minister met with Nine back on Dromund Kaas. After his astromech Remote performed a scan of his former office for listening devices, he ordered the droid to broadcast a white noise so he could speak with his agent in private. He explained that he was aware that Nine had broken into Intelligence's archives and discovered the brainwashing and had broke free from the control, though he has no intention of telling anyone. He also explained the justification behind activating the brainwashing program.\nThe Minister then changed the subject, stating that SIS should not have possessed Nine's brainwashing code. He then explains that Kothe's shuttle had been found adrift in space, with all information on the Shadow Arsenal erased. What's more, there was no record of an SIS agent codename Hunter, the only other surviving member of Kothe's team, who tricked an Imperial bombing squadron into destroying the Shadow Arsenal. He suspected Hunter to be working towards his own agenda, using Republic and Imperial resources. He sends Nine to the Republic mining colony of Isen IV, where a person matching Hunter's description was spotted, its governor peacefully surrendering to the Empire due to the colony's light defenses.\nWhen the agent returned to Dromund Kaas, the Minister was viewing a holo-broadcast from Supreme Chancellor Dorian Janarus, declaring that the Empire had broken the Treaty of Coruscant, officially reigniting war between the Republic and Empire. Nine reported that Hunter had using some sort of device derived of unknown technology, which turned the colony's own technology against its occupants, in an attempt to frame Empire for a massacre, before departing. The Minister then explained that the Fixers had identified the device to be the same technology used in Operation Starbender. Keeper was then brought to explain that she had checked other unresolved cases, including Operation Morning Crest, which included an audio recording of Hunter and his unidentified superior, detailing the ghost agent's infiltration of the SIS. She determined that this must be unknown group unaffiliated with either galactic power and had existed since before the Empire had revealed itself to the Republic. The Minister knew that they couldn't waste time on a conspiracy while fighting the Republic, but he had little choice but to assign Nine in uncovering the conspiracy, promising to keep the operation a secret for as long as possible.\nNine's investigations later identified the mysterious third party to be the Star Cabal. In their attempts to expose the conspiracy, the Star Cabal reacted by first incapacitating Intelligence's genetically enhanced Watchers and later dissolving the Operations branch, its agents drafted into the armies of various Sith Lords. Despite failing to stop his organization's dissolution, the Minister managed to request that Nine be transferred to Lord Razer's unit on Corellia, where the Star Cabal was plotting their grand plan.\nThe Minister was placed under house arrest in Kaas City but secretly escaped by calling on a few Moffs who owed him favors. Secretly, he gathered loyal ex-Intelligence officers to strike at the Star Cabal. With Keeper's aid, Nine was able to feed misinformation to the Star Cabal, upsetting their plan, allowing Intelligence to trace their transmissions to a space station in the Null Zone. Nine was then summoned to Intelligence flagship Tenebrous, where the Minister ordered the agent to eliminate any conspirators on the station and obtain their secrets so they can scour the galaxy for what's left of their membership.\nThough Cipher Nine managed to kill the inner circle of conspirators and acquired the Black Codex, the Minister states that Intelligence was not being rebuilt, for the Sith and the military have always coveted their resources and now that they possess them, things will change. As for himself, if the Dark Council show leniency, he retained the chance to retire, otherwise he'd be executed. Thankfully, the Sith suspected that he planned on releasing confidential documents upon his death, so he was granted a stay of execution and forced to retire.\nLater on in the war, the Minister secretly came out of retirement and contacted Cipher Nine on Rishi and asked to meet privately, getting the agent's attention by mentioning \"the Red Blade\", Nine's former cover identity from the Hutta mission. As extra insurance, the Minister activated an Umbaran jamming field. Upon meeting, the Minister asked his former agent a personal favor, revealing that Shara Jenn, formerly Watcher Two and Keeper, was captured by the Republic in the aftermath of Darth Malgus's uprising. He had already arranged for Shara to be carbonite-frozen and her prison transport attacked by raiders and brought to Rishi. The Minister planned on meeting with the raiders to negotiate her release while Nine sliced their databanks to give him leverage in the negotiations.\nHowever, the Minister had secretly misled Nine and instead of bringing Shara to his safehouse, he had to sent to a private medical facility, claiming he was unsure whether Nine would approve. He made arrangements for medics and doctors to repair the damage done to her brain and undo her loyalty programming. In addition he advised her not to rejoin the Empire and to make a new life for herself away from the conflict. He allowed Nine a moment to say their goodbyes to Shara via holo.\nAfterwards, the Minister informed Nine that Intelligence is rumored to be rebuilt and the agent would have a hand in its reformation. To file the new Intelligence's ranks, he gave files on military deserters, terrorist sympathizers and Malgus' alien insurgents, whom he considered \"untraditional\" recruits though he acknowledged their desire to reform the Empire. He then parted ways with Nine.\nThe \"Keeper\" was an efficient leader of Imperial Intelligence. He was described as being merciless in his eliminating of the agents that he saw as weak or inefficient. He maintained his power by knowing when to obey orders and when to take initiative. Nonetheless, he disliked overt cruelty and did show concern for the well-being of his agents.\nThe Keeper never took kindly to \"missions of mercy.\" He did not like seeing his agents taking \"unnecessary risks in order to avoid violence.\" However, this is mostly due to concern about the psychological well-being of agents and wishing to avoid having them traumatized by their work.\nKeeper despised the Star Cabal for their zealotry but admired them for staying invisible, operating independent of galactic powers.\nKeeper believed that many of his questionable actions would make the Empire a better place. But when war reignited, he acknowledged that he had failed.\nKeeper/Minister of Intelligence is a character in the 2011 Star Wars: The Old Republic video game, voiced by Francis Guinan.\nOn the Keeper's biography page on the official website, there are several phrases in Aurebesh. When translated, they read \"Watcher, Minder, Fixer, Cipher\", \"SIS note: higher ambitions?\", and \"strained Sith relations\".\nThe Minister's dialogue at the end of Chapter III of the Imperial Agent's story will differ depending on what the player does with the Black Codex:",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Keeper_(disambiguation)",
  "/wiki/Dromund_Kaas",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Ministry_of_Intelligence_(Sith_Empire)",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Eckard_Lokin",
  "/wiki/Cipher_Nine",
  "/wiki/Keeper_(Imperial_Intelligence)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Eradication_Day",
  "/wiki/Minister_of_Intelligence_(Sith_Empire)",
  "/wiki/Minister_of_Intelligence_(Cold_War)",
  "/wiki/Operations_Division",
  "/wiki/Sith/Legends",
  "/wiki/Dark_Council",
  "/wiki/Operation_Morning_Crest",
  "/wiki/Operation_Starbender",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Red_Blade",
  "/wiki/Hutt/Legends",
  "/wiki/Karrels_Javis",
  "/wiki/Voontara_Fa%27athra",
  "/wiki/Kaliyo_Djannis",
  "/wiki/Darth_Jadus",
  "/wiki/Shara_Jenn",
  "/wiki/Kaas_City",
  "/wiki/Dominator_(Harrower-class)",
  "/wiki/Keeper%27s_wife",
  "/wiki/Castellan_restraints",
  "/wiki/Watcher_X",
  "/wiki/Ardun_Kothe",
  "/wiki/Remote/Legends",
  "/wiki/Shadow_Arsenal",
  "/wiki/Hunter_(Star_Cabal)",
  "/wiki/Isen_IV",
  "/wiki/Dorian_Janarus",
  "/wiki/Star_Cabal",
  "/wiki/Watcher_(Imperial_Intelligence)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Razer",
  "/wiki/Black_Codex",
  "/wiki/Rishi/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/New_Empire",
  "/wiki/Carbonite/Legends",
  "/wiki/Red_Meteor_Consortium",
  "/wiki/Kavork",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Francis_Guinan",
  "/wiki/Aurebesh/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}