{
 "name": "Minos Fel'Kona",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Minos Fel'Kona was a male Human Jedi Master who served the Jedi Order and the Galactic Republic during the final years of the Republic Classic era. Fel'Kona was the son of the famed Jedi recruiter Master Jonas Fel'Kona.\nThe Force-sensitive son of the prominent Acquisition Division recruiter Jonas Fel'Kona, Minos was turned over to the Academy of Almas for training in the ways of the Force. Elevated to the rank of Jedi Knight, Fel'Kona became a wise investigator for the academy, following in his father's footsteps as a Sentinel.\nAs a Knight, Fel'Kona investigated the fortress of Darth Rivan on Almas during the Separatist Crisis that plagued the Republic. During the numerous investigations, Fel'Kona determined that the fortress had been built prior to 1,163 BBY. Among his discoveries were skeletons of krayt dragons and slabs of black marble recording the succession of Dark Lords of the Sith from Naga Sadow to Darth Rivan. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Fel'Kona remained in the Cularin system during the conflict, maintaining his normal duties on Almas. Participating in an interview by journalist Yara Grugara, Jedi Fel'Kona spoke directly with other interviewees regarding the growing Cularin-based opposition to the Thaereian military's presence in the system. The Thaereians had served as the protectors of the Cularin system as part of a protectorate agreement—an agreement some of the people of Cularin thought the Thaereians were abusing. Stating that the Cularin people could put in a plea to their Senator if they wanted the deal changed, Fel'Kona did not announce the Jedi's official stance.\nIn the final year of the war, the Almas Academy was destroyed by orbital bombardment orchestrated by the Dark Jedi Garth Ezzar. Escaping the attack, recently elevated Jedi Master Fel'Kona began searching for survivors. It wasn't long after this event that the command was issued to the Grand Army of the Republic to execute Contingency Order 66, a traitorous order by Supreme Chancellor Palpatine that effectively disbanded the Order. As noted in his datapad, Master Fel'Kona felt lost when confronted with the idea of a Galactic Empire in charge of the galaxy and could not conceptualize how the Order would continue to exist. He recognized the need to fight back against Palpatine's tyranny, but he also believed that Darth Sidious and Darth Vader would be ready for any attempt on their lives, and would utterly destroy any being who tried to harm them. He vowed to take any surviving Jedi he could find in the Cularin system and flee into the depths of the galaxy, where they could be relatively safe while contemplating their next course of action.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Jedi_recruiter",
  "/wiki/Jonas_Fel%27Kona",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Acquisition_Division/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Almas",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_investigator/Legends",
  "/wiki/Jedi_Sentinel/Legends",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Darth_Rivan",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Cularin_system",
  "/wiki/Yara_Grugara",
  "/wiki/Thaereian_military",
  "/wiki/Thaereian_system",
  "/wiki/Senator/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Garth_Ezzar",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/The_Eye_(roleplaying_adventure)",
  "/wiki/Wizards.com",
  "/wiki/The_Sith_Fortress",
  "/wiki/Jurisdiction",
  "/wiki/Conversations_With_Lanius",
  "/wiki/View_from_the_Roof",
  "/wiki/What_Are_We,_Then%3F",
  "/wiki/Destruction_(Living_Force_adventure)"
 ]
}