{
 "name": "Mira's father",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light tan"
     ]
    }
   ]
  }
 ],
 "content": "The father of Mira was a Zabrak male. He rescued Mira and her child from a desert planet after they were discovered by Darth Vader.\nAt some point in his life, he had a daughter called Mira. After Mira's husband, the former Jedi Master Eeth Koth, was confronted by Darth Vader, Mira took her newborn baby and met her father, who told her to board a Star Commuter 2000 shuttle. Before Mira could, her path was blocked by an Inquisitor. Mira begged the Inquisitor to let her go, which she did, being helped aboard the shuttle by her father. As the shuttle began to leave, the Inquisitor used the Force to pull Mira's baby out of the craft and back down onto the ground. While Mira wept for her lost child, her father consoled her, telling her that there was a chance that her baby would be kept alive because she didn't kill the baby and that someday they might meet her again. However, Mira grabbed him and asked what they wanted her for.\nMira's father had light brown eyes and light tan skin. He loved his daughter very much, as he consoled her after she lost her baby.\nMira's father appeared in Darth Vader  19, a 2017 canon comic written by Charles Soule and illustrated by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Zabrak",
  "/wiki/Iridonian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mira_(Zabrak)",
  "/wiki/Eeth_Koth%27s_daughter",
  "/wiki/Desert",
  "/wiki/Unidentified_planet_(Eeth_Koth)",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi_Master",
  "/wiki/Eeth_Koth",
  "/wiki/Hunt_for_Eeth_Koth",
  "/wiki/Star_Commuter_2000",
  "/wiki/Shuttle",
  "/wiki/Iskat",
  "/wiki/The_Force",
  "/wiki/Eye",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/2017",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli"
 ]
}