{
 "name": "Mira_(Zabrak)",
 "display_name": "Mira  (Zabrak)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eeth Koth's family"
     ]
    }
   ]
  }
 ],
 "content": "Mira was a female Zabrak who was married to former Jedi Master Eeth Koth.\nShe eventually gave birth to his daughter years after Order 66, an order that saw most of Koth's Jedi companions killed. Mere minutes after their child's birth, Darth Vader and his Inquisitorius confronted Koth. Mira was surprised when she realized that her husband was a Jedi, and told the nurse droid to give her the baby, despite it saying that she should rest. While Mira attempted to flee with her newborn child, Koth and Vader engaged each other in a lightsaber duel. Nearly making it to her father's hovercraft, Mira was stopped on the docks by an Inquisitor. Appealing to the Inquisitor's shared womanhood, Mira was permitted to board the craft with her daughter and believe they had escaped. As the craft departed the docks, the Inquisitor used the Force to rip the child from Mira's arms as the craft was mid-flight; robbing the new mother of her daughter and her trust of others. Mira begged her father to go back, but consoling her, he said that they still had hope that the baby was alive because they didn't kill her, which means that they wanted her, and that one day they might meet her again. Mira then asked what they wanted her for. They both fled the world, leaving her husband to die and her daughter to be abducted as part of Project Harvester, due to her possibly being Force-sensitive.\nMira cared deeply for her baby, as she begged the Inquisitor to not take her baby and also when she cried for it. Mira had black hair, light brown eyes, and light tan skin.\nMira first appeared in Darth Vader  19, a 2017 canon comic written by Charles Soule and illustrated by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mira_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Zabrak",
  "/wiki/Iridonian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Eeth_Koth%27s_family",
  "/wiki/Jedi_Master",
  "/wiki/Eeth_Koth",
  "/wiki/Reproduction",
  "/wiki/Eeth_Koth%27s_daughter",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Standard_minute",
  "/wiki/Anakin_Skywalker",
  "/wiki/Inquisitorius",
  "/wiki/Hunt_for_Eeth_Koth",
  "/wiki/Lightsaber_duel",
  "/wiki/Hovercraft",
  "/wiki/Iskat",
  "/wiki/Project_Harvester",
  "/wiki/Force-sensitive",
  "/wiki/Eye",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/2017",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Darth_Vader_(2017)_20",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Databank_A-Z"
 ]
}