{
 "name": "Miramir",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hyperkarn"
     ]
    },
    {
     "name": "Born",
     "values": [
      "6 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 ABY",
      "aboard the Bestoon Legacy",
      "Jakku system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Miramir's family",
      "Palpatine family"
     ]
    }
   ]
  }
 ],
 "content": "Miramir was a human female who worked as a junk trader during the New Republic Era. Her husband Dathan was the cloned \"son\"—an artificial Strand-Cast—of Darth Sidious, the Dark Lord of the Sith and Galactic Emperor. Miramir had a Force-sensitive child with Dathan, a daughter named Rey, who was born in 15 ABY. Though Miramir's husband lacked the ability to use the Force, Rey was born Force-sensitive as a result of her father's genetic connection to the Palpatine bloodline.\nDespite their family's connection to the Dark Lord of the Sith, Miramir and Dathan chose to live as anonymous junk traders on the desert planet of Jakku. They succeeded in hiding Rey from Sidious, who intended to use Rey as a vessel for his spirit, by leaving her on Jakku with Unkar Plutt. Miramir and her husband were subsequently captured and killed by the Sith assassin Ochi, whom the Emperor had sent to retrieve his granddaughter.\nMiramir was born on the planet Hyperkarn in 6 BBY. She lived with her grandmother, whom she was very close with.\nDuring the rise of the New Republic, Miramir married Dathan, the cloned \"son\"—a genetic strandcast—of Galactic Emperor Darth Sidious. The Emperor had not anticipated the relationship between his clone and Miramir, but through it he sought to continue his bloodline the natural way after genetic experimentation on his template failed to produce a viable host for his essence. When their daughter, Rey, was born in 15 ABY, she inherited her grandfather's connection to the Force, whereas her father had not.\nThe Emperor intended to transfer his spirit to his granddaughter's body, leaving the unstable cloned body that could not sustain his power in the dark side of the Force. However, his plan was thwarted by Rey's parents, who escaped into hiding along with their daughter. Sidious sent his devotee, the assassin Ochi, after them, determined to regain his granddaughter and \"punish\" her parents who, in his view, betrayed him. They eventually settled on Jakku, having elected to live in obscurity on a desert planet in order to keep their daughter safe.\nLife on Jakku was difficult for Rey's family, her mother and father struggling to survive as junk traders. Their efforts to hide Rey were nearly compromised when Ochi drew closer to locating them. In an act of desperation, they returned to Jakku aboard Ochi's ship, the Bestoon Legacy, and left their daughter with Unkar Plutt, paying Plutt with Dathan's Sith amulet. Miramir embraced her daughter for the last time, her face partly obscured by a blue shawl. Miramir also took some Aki-Aki beads that were in Plutts possession in hopes of using them to trick Ochi in case he caught them. Rey watched as the Bestoon Legacy departed from Jakku. Knowing her parents were onboard the transport, she tried to free herself from Plutt's grasp while screaming for her parents to not leave her behind.\nMiramir and Dathan were subsequently caught and taken as prisoners by Ochi. Ochi interrogated the couple regarding their daughter's whereabouts, Miramir tried to undermine Ochi's investigation with misinformation, claiming that Rey was not on Jakku and that she was simply gone. Her lie was unacceptable to Sidious' follower; acting on his master's command, he used his dagger to stab Dathan and then Miramir to death. As she had predicted, Ochi was tricked by the Aki-Aki beads and traveled to the planet Pasaana. Due to Ochi's subsequent death on Pasaana, Rey remained hidden from her grandfather and the Sith Eternal cult that supported him.\nThe bodies of Rey's parents were found stuffed in a crate and drifting in space by Lando Calrissian and R2-D2, who recovered them and took them to the frozen world of Neftali where they buried them with the help of Luke Skywalker and Komat. Having died holding the Aki-Aki beads she'd obtained from Plutt, Miramir successfully led Ochi to the incorrect conclusion that they had left Rey on Pasaana, leading him to go there in search of her. Upon landing there Ochi began seeing hallucinations of Miramir and Dathan, and his search for Rey on the world was short lived, soon sinking in the world's quicksand shortly after leaving his ship where he remained until his death.\nThough Rey had all but forgotten her past, she remained on Jakku for years in the hope of reuniting with her mother and father. During that time, she had nightmares of Miramir and Dathan abandoning her when she was a child. That memory resurfaced twice in her early adult years, once when she visited Takodana and again during her Jedi training on Ajan Kloss. Following the second occurrence, however, she remembered another forgotten moment from her childhood, in which she found herself in the warm embrace of a woman that she knew to be her mother.\nRey was captured on Takodana by the First Order warlord Kylo Ren, who learned about the scavenger's parents through the Force-bond that connected their minds. Based on what he saw of them through a Force vision, Ren concluded that Rey was sired by insignificant junk traders. The desperate conditions of their lives also convinced Ren that they abandoned their daughter, selling Rey for drinking money, and that they were dead and buried in a pauper's grave in the desert of Jakku.\nRey's mother was remembered by Sidious as the wife of his clone, whom he despised as a \"useless creature\" that he rejected due to its powerlessness in the Force. The Emperor revealed to Ren the secret of Rey's lineage as his granddaughter. The revelation did not change Ren's mind about Rey's parents; he still regarded them as nonentities. Nevertheless, he tried to turn Rey to the dark side by telling her that Sidious, her grandfather, ordered her parents' execution. Ren's actions caused Rey to rediscover forgotten memories of her childhood, including the last time she saw her parents. Though she possessed qualities of a Jedi, Rey struggled to resist the seduction of the dark side. The knowledge that her mother and father were killed on her grandfather's orders caused Rey to develop a desire to avenge them. Ultimately, though, the memory of her parents kept Rey entrenched in the light side of the Force. During the Battle of Exegol, Rey succeeded in destroying her grandfather, preventing the rebirth of the Sith.\nMiramir was a young human female who had brown hair, brown eyes, and light skin. Like her husband, she loved Rey and was willing to risk death by hiding her daughter from Darth Sidious. She chose to live in obscurity to keep Rey safe and bore the consequences of her choice, living day-to-day on the edge of desperation. With Ochi on her trail, she made the decision to sell her daughter, though not before embracing her one last time, telling Rey to be brave. Having to give her daughter away, even to keep her safe, drove Rey's mother to tears as they embraced for the final time, neither one wanting to let the other go. She remained defiant during her final moments, refusing to reveal her daughter's whereabouts to the Emperor's hunter even when her life and that of her husband were threatened.\nThough dismissed as unimportant and weak by Ren and Sidious, Miramir was remembered by Rey as someone who was strong enough to keep her daughter safe from her grandfather.\nMiramir was first mentioned, albeit indirectly, in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment of the Star Wars sequel trilogy. She first appeared in a flashback sequence of the 2019 film Star Wars: Episode IX The Rise of Skywalker, where she was portrayed by Jodie Comer.\nAdam Christopher, the author of the book Shadow of the Sith, named the character after Miramar, a suburb of Wellington, New Zealand. According to the author, he wanted a fantasy name to go with Miramir's homeworld Hyperkarn, which is mysterious and has a twilight forest. The author typed in the name and switched around some of the letters, and thought the name Miramir had a magical quality, almost Elven. According to the author, Miramir is pronounced \"Mirr - Ah - Meer\".",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Miramir",
  "/wiki/Hyperkarn",
  "/wiki/6_BBY",
  "/wiki/21_ABY",
  "/wiki/Bestoon_Legacy",
  "/wiki/Jakku_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Miramir%27s_family",
  "/wiki/Palpatine_family",
  "/wiki/Junk_dealer",
  "/wiki/New_Republic_Era",
  "/wiki/Marriage",
  "/wiki/Dathan",
  "/wiki/Cloning",
  "/wiki/Bioengineering",
  "/wiki/Strand-Cast",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Force-sensitive",
  "/wiki/Youngling",
  "/wiki/Rey_Skywalker",
  "/wiki/Reproduction",
  "/wiki/15_ABY",
  "/wiki/The_Force",
  "/wiki/Parent",
  "/wiki/DNA",
  "/wiki/Lord",
  "/wiki/Sith",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Jakku",
  "/wiki/Transference",
  "/wiki/Unkar_Plutt",
  "/wiki/Death",
  "/wiki/Sith_assassin",
  "/wiki/Ochi",
  "/wiki/Emperor",
  "/wiki/Miramir%27s_grandmother",
  "/wiki/New_Republic",
  "/wiki/Blood",
  "/wiki/Clone_template",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Assassin",
  "/wiki/Clothing",
  "/wiki/Aki-Aki",
  "/wiki/Transport",
  "/wiki/Prisoner",
  "/wiki/Blade_of_Ochi_of_Bestoon",
  "/wiki/Pasaana",
  "/wiki/Sith_Eternal",
  "/wiki/Sith_cultist",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/R2-D2",
  "/wiki/Neftali",
  "/wiki/Burial",
  "/wiki/Luke_Skywalker",
  "/wiki/Komat",
  "/wiki/Quicksand",
  "/wiki/Standard_year",
  "/wiki/Takodana",
  "/wiki/Jedi_training",
  "/wiki/Ajan_Kloss",
  "/wiki/Battle_of_Takodana",
  "/wiki/First_Order",
  "/wiki/Warlord",
  "/wiki/Ben_Solo",
  "/wiki/Scavenger",
  "/wiki/Force-bond",
  "/wiki/Brain",
  "/wiki/Force_vision",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Battle_of_Exegol",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Darth",
  "/wiki/Standard_day",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Jodie_Comer",
  "/wiki/Adam_Christopher",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Homeworld",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Miramir",
  "/wiki/Shadow_of_the_Sith_(audiobook)",
  "/wiki/Rey%27s_First_Flight",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_1",
  "/wiki/The_Force_Awakens_Adaptation_2",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_The_Last_Jedi_Graphic_Novel_Adaptation",
  "/wiki/The_Last_Jedi_Adaptation_3",
  "/wiki/The_Last_Jedi_Adaptation_4",
  "/wiki/The_Last_Jedi_Adaptation_5",
  "/wiki/Through_the_Turbulence",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Template:ShadowoftheSithDate",
  "/wiki/Star_Wars:_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/34_ABY",
  "/wiki/September_5",
  "/wiki/2022",
  "/wiki/September_7",
  "/wiki/May_19"
 ]
}