{
 "name": "Mirax_Terrik_Horn",
 "display_name": "Mirax Terrik Horn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.61 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "Galactic Federation of Free Alliances",
      "New Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Mirax Terrik Horn was the daughter of the smuggler Booster Terrik, wife of the Jedi Corran Horn, and mother of Valin and Jysella Horn.\nAs their families were close, young Mirax often stayed with the Antilles family. She developed a friendship with their son Wedge, who nicknamed her \"Myra\" and whom she nicknamed \"Veggies\". When her father was finally apprehended by CorSec and sentenced to five years of hard labor on Kessel, the still underage Mirax took control of his smuggling operation. Under her guidance, the organization maintained its profitability despite turning almost completely legitimate. Wedge occasionally performed maintenance on her ship before he defected full time to the Rebellion.\nSeveral years later, Mirax turned to smuggling herself, operating her father's ship, Pulsar Skate. Mirax encountered Rogue Squadron a number of times, including on Mrlsst, where she aided the Rogues in bargaining for the Phantom Project. When the negotiations went sour, she escaped along with some of the other Rogues on Wes Janson's repulsorlift hoversled. Eventually, she and some of the others made their way to a base in the asteroid where the project was being held, only to discover it was a fake. The asteroid exploded, but Mirax and the Rogues escaped in the Skate. She would later help Wedge again in his attempt to extract Sate Pestage from Ciutric IV, bringing the Skate and a load of R2 units in the Skate and serving as a decoy to allow the New Republic strike team to escape from the planet.\nIn 7 ABY, she came under attack by the Imperial ship, Black Asp, but was rescued by Rogue Squadron. In addition to her friend Wedge Antilles, the squadron also included Corran Horn—whose father Hal Horn had been responsible for arresting Mirax's father Booster Terrik. Needless to say, Mirax didn't enjoy being in debt to him, but her friendship with Wedge convinced her to aid the New Republic.\nMirax's smuggling was essential in supplying bacta to the newly-liberated Coruscant, which was suffering from the Krytos virus. In this time, she was partnered with Horn, whom she eventually forgave and befriended. By the time of the Bacta War they had fallen in love, and just before the final battle of that conflict, she agreed when he asked to marry her. Shortly after the battle, they were married onboard the captured Super Star Destroyer Lusankya by Wedge Antilles in his authority as acting ship's captain. Shortly thereafter, a larger and more official ceremony was held on Coruscant.\nFollowing their wedding, Mirax began a shipping business, although she returned to smuggling during the Thrawn campaign to supply resistance cells and smuggle refugees on planets conquered by Grand Admiral Thrawn.\nTwo years after Thrawn's death, she attempted to apprehend the rogue Moff Leonia Tavira, but was instead captured by her Invid pirates. She was imprisoned on the planet Suarbi, until her husband and Luke Skywalker could free her. In 13 ABY, she gave birth to a son, Valin, and later had a daughter, Jysella. By 19 ABY, she attended the wedding of Skywalker and Mara Jade; subsequently Mara and Mirax, both ex-smugglers, became good friends, and when Luke's duties kept him at the Jedi Praxeum for long periods, Mara crewed aboard the Pulsar Skate with her. On one trip, at some point prior to 25 ABY, they were charged with causing criminal damage after a run-in with rivals or enemies, though the exact circumstances are unknown, and both women were ultimately exonerated.\nBeing married to a Jedi Knight, Mirax soon took an interest in the New Jedi Order. She often monitored requests for courier runs, and gave special priority to Jedi requests. This led her to transport Luke and Mara Skywalker, Anakin Solo, and Chalco to Vortex, in pursuit of the rogue Twi'lek Jedi Daeshara'cor. Later, during the Yuuzhan Vong War, Mirax was with Corran several times at Eclipse—including during the Yuuzhan Vong assault on the Eclipse Station Jedi base. Later the two were attacked by voxyn while hiding on Corellia.\nIn 40 ABY, due to her husband's status as a Jedi, she was placed under house arrest by Thrackan Sal-Solo's government. Following the death of Sal-Solo, the house arrest was lifted. Mirax and Corran later aided the Solos and Wedge on Corellia after the three severed their ties with the Five Worlds. They took refuge on the Errant Venture, where Mirax finally acceded to years of her father's demands to learn the operations of the mobile smuggler's den - chiefly as she had very little else to do.\nIn 43.5 ABY, two years after the end of the Second Galactic Civil War, Mirax and her family suffered a very personal tragedy. With the beginning of the Open Alliance Talks, Mirax's entire family was on Coruscant, a rare occasion, and she had arranged for the family to stay together during the conference. While making breakfast one morning, Mirax was horrified when she was attacked by her son Valin. Mirax escaped injury due to the arrival of Corran but was forced to shoot her deranged son with a stun bolt to prevent him from killing what he perceived as a false Corran. She later learned that Valin was afflicted with a mysterious ailment that caused him to see everyone around him as impostors, even his parents. Mirax could do nothing as Valin eventually became a fugitive and was later captured and imprisoned in carbonite. She would later assist members of Darkmeld during the Raid on the Armand Isard Correctional Facility.\nThe Horns were struck once again, as their daughter, Jysella succumbed to the disease and was frozen in carbonite also. She would later accompany a group of Jedi Masters and Jaina Solo to the Galactic Justice Center, to execute a court-approved warrant to see her children. They found both their children suspended in carbonite above an aquarium, as a common decoration in the Center's barracks. Horrified and enraged at seeing her beloved children in this state, she angrily confronted the warden responsible before punching him right in the face, knocking him out.\nWhile the Rogue Squadron comics and Union have her eyes being blue, I, Jedi states them as being brown, with them being referred to as blue again in Legacy of the Force: Exile.\nMirax's friend Wedge Antilles named his youngest daughter, Myri Antilles after her. Myri's name derived from Mirax's childhood nickname Myra.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Mirax_(slave)",
  "/wiki/Corellia/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/New_Jedi_Order",
  "/wiki/Smuggler/Legends",
  "/wiki/Booster_Terrik",
  "/wiki/Jedi/Legends",
  "/wiki/Corran_Horn",
  "/wiki/Valin_Horn",
  "/wiki/Jysella_Horn",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Antilles_family/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Kessel/Legends",
  "/wiki/Pulsar_Skate",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Mrlsst/Legends",
  "/wiki/Phantom_Project",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Ciutric_IV",
  "/wiki/R2-series_astromech_droid",
  "/wiki/7_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Corusca_Rainbow",
  "/wiki/Hal_Horn",
  "/wiki/Bacta/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Krytos_virus",
  "/wiki/Bacta_War",
  "/wiki/Battle_of_Thyferra",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Lusankya/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/Planet/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Leonia_Tavira",
  "/wiki/Invids",
  "/wiki/Pirate/Legends",
  "/wiki/Suarbi_(star)",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Battle_of_Susevfi",
  "/wiki/13_ABY/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Wedding_of_Luke_Skywalker_and_Mara_Jade",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Jedi_Praxeum",
  "/wiki/25_ABY/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Solo",
  "/wiki/Chalco",
  "/wiki/Vortex/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Daeshara%27cor",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Eclipse_(planet)",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Eclipse",
  "/wiki/Eclipse_Station",
  "/wiki/Voxyn",
  "/wiki/40_ABY",
  "/wiki/Thrackan_Sal-Solo",
  "/wiki/Five_Worlds",
  "/wiki/Errant_Venture/Legends",
  "/wiki/43_ABY",
  "/wiki/Force_psychosis",
  "/wiki/Carbonite/Legends",
  "/wiki/Darkmeld",
  "/wiki/Raid_on_the_Armand_Isard_Correctional_Facility",
  "/wiki/Galactic_Justice_Center",
  "/wiki/Myri_Antilles",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/The_Shadow_Syndicate",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_The_Phantom_Affair",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Mandatory_Retirement",
  "/wiki/X-Wing:_Rogue_Squadron",
  "/wiki/X-Wing:_Rogue_Squadron_(unabridged_audiobook)",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/X-Wing:_The_Krytos_Trap",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/X-Wing:_Isard%27s_Revenge",
  "/wiki/I,_Jedi",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/Star_Wars:_Union",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_The_Final_Prophecy",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Legacy_of_the_Force:_Betrayal",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_8",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Reflections_II:_Expanding_the_Galaxy",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Rogue_Squadron",
  "/wiki/Star_Wars_Insider_59",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_126",
  "/wiki/Scum_and_Villainy_(sourcebook)",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Template:SWGTCG",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Suns_of_Fortune",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Category:Images_of_Mirax_Terrik_Horn",
  "/wiki/Horn_family",
  "/wiki/Terrik_family"
 ]
}