{
 "name": "Mira_T%27rani",
 "display_name": "Mira T'rani",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Turquoise"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Mira T'rani was a female Twi'lek entertainer who lived during the Galactic Civil War.\nMira T'rani resided for a while on the planet Corellia with her brother. During that time, she became one of the top entertainers in Coronet. However, after the death of her brother, she left the planet and moved to Tansarii Point Station, in the Bright Jewel system. By the time following the Battle of Yavin, Mira had become a renowned entertainer on Tansarii Point Station. She was working in the station's cantina and was a friend of Anvar Keyis, the manager of the cantina.\nIn 1 ABY, a spacer arrived on Tansarii Point Station along with Han Solo and Chewbacca. Since the spacer was herself an entertainer, Solo suggested her to meet Mira T'rani. The Twi'lek was glad to meet the spacer and proposed her to work for Anvar Keyis. The later was very pleased to greet the spacer since he really needed new entertainers for the cantina. Due to troubles on Tansarii Point Station, few people were coming to the cantina and Keyis wanted to change this situation. The spacer performed as a dancer and was very successful, bringing many customers to the cantina. After working for some time for Anvar Keyis, the spacer returned to Mira in order to perform other kinds of work. Once, Mira requested the spacer to play music in the medical center of the station to entertain the wounded there. Another time, T'rani tasked the spacer to dance for the Imperial officer commanding the Imperial detachment stationed on Tansarii Point Station. In fact, the woman was very interested about the Imperial presence on the station, a very uncommon situation. She was convinced that good entertainers performing their art could obtain any information from anybody, what she named the \"power of an Entertainer\". The spacer was indeed a skilled entertainer who effectively managed to inspire the Imperial Officer and convinced him to reveal information about his mission on the station, namely retrieve and escort a stolen high-value artifact back to Coruscant.\nMira T'rani appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Mira T'rani was added to the game as part of the \"New Player Tutorial\", introduced with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mira_(disambiguation)",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Green_(disambiguation)",
  "/wiki/O%27choa_Detera",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Entertainer",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Anvar_Keyis",
  "/wiki/1_ABY/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}