{
 "name": "Mirith Sinn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nez Peron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New RepublicNew Republic Intelligence",
      "New Republic Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Mirith Sinn was an agent of New Republic Intelligence and the leader of New Republic guerrilla forces on the planet Phaeda who met and fell in love with Kir Kanos. She later became Chief of Security of the Imperial Palace on Coruscant.\nFrom a young age, Sinn found herself attracted to men of \"greatness.\" However, Mirith eventually married a farmer named Jahren Sinn on Nez Peron during the early days of the Galactic Civil War. Jahren had business dealings with Baron Ragez D'Asta, and Mirith ended up befriending the Baron's daughter, Feena.\nThere was talk among the citizens of a Rebellion and an end to the Empire. However, Nez Peron remained an Imperial world despite its starving population. Jahren sought reform and justice and was elected to speak on behalf of Nez Peron's farmers. Jahren decided not to hand over their produce to the Empire. This was a doomed plan, as Darth Vader came to Nez Peron and smashed the blossoming resistance. Vader murdered Jahren Sinn himself, and his wife, Mirith, vowed her allegiance to the Rebel Alliance then and there, promising herself that she would keep fighting the Empire until it was no more.\nFor the remainder of the war, Sinn served with the Alliance through the Battle of Endor and the creation of the New Republic. She served as a soldier in the New Republic's liberation of Mokk IX, where she cared for an injured Trandoshan named Sish Sadeet. After he recovered, Sadeet joined the New Republic and served as her second-in-command, forming a strong loyalty to her.\nSinn—now a commander—led New Republic forces still actively fighting against the Empire. She had been found to be a natural-born leader, and would willingly lay her life down for the soldiers under her command. When Carnor Jax usurped the Imperial Interim Ruling Council, Sinn was stationed on Phaeda, leading an underground resistance force. It was then that Kir Kanos arrived.\nKanos, the former Imperial Royal Guard who sought revenge for the death of Palpatine against Carnor Jax and the Interim Ruling Council, found his way to Phaeda and was given sanctuary by Tem Merkon. Sinn was initially very skeptical of Kanos's intentions. Kanos would gain the trust of Sinn and her Trandoshan lieutenant, Sish Sadeet, upon Colonel Xexus Shev's attack. Kanos nearly single-handedly saved the New Republic base from Shev's forces.\nMeanwhile, Carnor Jax was en route to Phaeda to apprehend Kanos. Sinn and Sadeet learned that Tem Markon had revealed Kanos's presence to Jax, who began proactively searching Phaeda. In disguise, Sinn attempted to retrieve Kanos's ship, but was captured by Jax's stormtroopers, believing her to be Kanos. Jax tortured Sinn, seeking the whereabouts of Kanos. As carefully planned by Kanos and Sinn, she revealed his location to be Yinchorr. Jax released Sinn and set out for Yinchorr. Along with Sadeet, Sinn followed.\nUpon her arrival on Yinchorr, Kanos and Jax were locked in mortal combat on The Squall. When Kanos nearly killed Jax, Sinn and Sadeet demanded to take him alive—something Kanos refused to allow. In attempting to wrest Kanos away from Jax, Sadeet was impaled and killed. Sinn was outraged and swore her revenge against Kanos, who left shortly thereafter, leaving Jax dead.\nSinn went on to seek out Kanos in revenge for the death of Sadeet. However, she also became involved in the search for Feena D'Asta and found her way to the den of Grappa the Hutt on Genon. Meanwhile, Kanos had infiltrated Grappa's entourage as the bounty hunter Kenix Kil, as part of his own agenda to eliminate the members of the Interim Ruling Council. Sinn soon discovered Feena D'Asta and uncovered a Black Sun plot to replace Council members with clones. However, Sinn was found out by Grappa by a former subordinate of hers, Massimo. Massimo told Grappa what she was really up to, and he had them both sent to Xo, homeworld of the terrifying Zanibar.\nKir Kanos stole an A-wing and followed, intent on rescuing Sinn. Sure enough, he found her just in time—Massimo had already been sacrificed in the Zanibars' horrific ceremony. Kanos and Sinn fled from the Zanibar and crashed into the jungle, far from the Zanibar settlement. Together, they made their way through the jungle, fending off carnivorous plants and animals. Using an overcharged blaster to provide warmth, the two spoke with each other into the night. Sinn revealed to Kanos the story of her husband's death and asked whether the Empire Kanos believed in even existed. Despite their differences, they began to fall in love.\nThe next morning, they were attacked by the Zanibar. Sinn, however, was rescued by a friend of Kanos's, leaving him behind and leaving Sinn distraught. Having lost Kanos, Sinn returned to New Republic space and learned that Kanos would be brought to Grappa on Genon. Sinn geared up and led a direct assault on Grappa's base and infiltrated it to rescue Kanos. Reunited, Sinn and Kanos moved on to their final task.\nOn Ord Cantrell, Sinn and Kanos revealed Black Sun's cloning plot to Baron Ragez D'Asta, who had also been reunited—with his daughter Feena. Kanos nearly killed Feena for her part in the Ruling Council, but Sinn stayed his hand, demanding to be even for Sadeet's death. Along came Xandel Carivus, de facto Emperor and the final target of Kanos's vendetta. He ordered his personal guards to kill Sinn and Kanos, who made short work of them. Kanos then pursued Carivus and killed him. Even though a number of Council members were still at large, Kanos decided he had done enough killing and ended his crusade.\nSinn and Kanos returned to the New Republic battle fleet following the defeat of Xandel Carivus. Sinn had come to realize that Kanos had the same qualities of personality that had attracted her to Jahren. Despite Sinn's plea that Kanos remain with the New Republic—and with her—Kanos remained loyal to Palpatine's Empire. Before leaving in a borrowed X-wing, Kanos and Sinn shared one long, passionate, and final kiss.\nIn 13 ABY, Sinn applied for the position of Chief of Security for the New Republic Chief of State Leia Organa Solo.\nOne night, she was patrolling in the Palace when she discovered intruders. With the help of Leia Organa's Noghri bodyguards, she managed to eliminate them and save the Chief of State and her children.\nSoon after, she was contacted by Feena D'Asta, who proposed negotiations about a truce between the New Republic and the Imperial Remnant in the name of Admiral Pellaeon. Leia Organa Solo accepted this idea and agreed to let Mirith Sinn meet the Imperials. However, shortly before her departure, Kir Kanos arrived on Coruscant and was detained. Sinn met with Kanos in his cell, where he informed her of a plot by Devian to destroy the New Republic with a bomb of zinethium. Kanos and Sinn then informed Chief of State Leia Organa Solo and Luke Skywalker of the zinethium bomb. When Leia Organa Solo was reluctant to let Kanos leave, Sinn said she would meet with D'Asta under the condition that Kanos left with her. Leia agreed to her terms.\nKanos and Sinn arrived at the old mining operation where the meeting was being held. When the meeting began Basdor became angry that Kanos, who murdered Xandel Carivus, was there. Basdor left the meeting and immediately after D'Asta, Kanos, and Sinn were attacked by Stormtroopers. Sinn and Kanos were able to kill the Stormtroopers who Kanos discovered were Ennix Devian's men, but D'Asta had been killed in the attack. After informing Chief of State Leia Organa Solo of what had happened, they both proceeded to bring D'Asta's body to her father.\nUpon arriving on Nez Peron, Sinn informed Kanos of the fact that she didn't think she believed in anything anymore after both of them had lost everyone close to them. They then met with the Baron. They told the Baron of the attack and how it was Ennix Devian's men who had killed his daughter. Devian's plan of Gilad Pellaeon attacking Coruscant while he attacked the heart of the Empire then became clear to them. The Baron then came up with a plan to show Pellaeon there was no treachery, and he reintroduced them to the clone of his daughter.\nAs Pellaeon was being captured by Devian the Baron, the cloned Feena, Sinn, and Kanos entered. General Vota then tried to shoot Pellaeon but was killed by Sinn. A firefight erupted between Devian and Baron D'Asta/Pellaeon's men. Devian then tried to kill Pellaeon, but his blaster was shot by Sinn. Devian fled and Kanos went after him. When Sinn found Kanos, he had already killed Devian and been injured himself. Sinn told him how Pellaeon planned to detain Kanos due to the numerous warrants on his head and that Baron D'Asta had indicated to Sinn that he would shelter them. Sinn and Kanos went to take Devian's shuttle to meet with one of the Baron's warships when Kanos began to collapse due to his injury.\nLater on Coruscant, Sinn was questioned by Leia Organa Solo, Luke Skywalker, and three others about Kanos and the attempted bombing of the Palace. Sinn responded that Kanos had no idea the bomb was in the ship and that Kanos was dead. She then told them to accept her resignation and left. Kanos' \"death\" was Sinn's scheme to stop everyone from looking for him when in truth he had been hiding in the D'Astan system until he recovered.\nMirith Sinn was voiced by Nichole Pelerine for the audio drama version of Crimson Empire.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nez_Peron/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Carnor_Jax",
  "/wiki/Crimson_Empire",
  "/wiki/Planet/Legends",
  "/wiki/Phaeda/Legends",
  "/wiki/Kir_Kanos",
  "/wiki/Chief_of_Security/Legends",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Jahren_Sinn",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Ragez_D%27Asta",
  "/wiki/Feena_D%27Asta",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Battle_of_Mokk_IX",
  "/wiki/Mokk_IX",
  "/wiki/Trandoshan/Legends",
  "/wiki/Sish_Sadeet",
  "/wiki/Commander/Legends",
  "/wiki/Imperial_Ruling_Council/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Tem_Merkon",
  "/wiki/Lieutenant/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Xexus_Shev",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/The_Squall",
  "/wiki/Grappa_(Hutt)",
  "/wiki/Hutt/Legends",
  "/wiki/Genon",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Massimo",
  "/wiki/Xo",
  "/wiki/Zanibar",
  "/wiki/RZ-1_A-wing_interceptor/Legends",
  "/wiki/Mission_to_Xo",
  "/wiki/Blaster/Legends",
  "/wiki/Tav_Kennede",
  "/wiki/Attack_on_Grappa_the_Hutt%27s_fortress",
  "/wiki/Ord_Cantrell/Legends",
  "/wiki/Xandel_Carivus",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/13_ABY/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Restored_Empire",
  "/wiki/Noghri/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Nichole_Pelerine",
  "/wiki/Crimson_Empire_(audio)",
  "/wiki/Star_Wars_Handbook_2:_Crimson_Empire",
  "/wiki/Crimson_Empire_2",
  "/wiki/Crimson_Empire_3",
  "/wiki/Crimson_Empire_4",
  "/wiki/Crimson_Empire_5",
  "/wiki/Crimson_Empire_6",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_1",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_2",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_3",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_4",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_5",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_6",
  "/wiki/Hard_Currency",
  "/wiki/The_Third_Time_Pays_for_All",
  "/wiki/Crimson_Empire_III:_Empire_Lost_1",
  "/wiki/Crimson_Empire_III:_Empire_Lost_2",
  "/wiki/Crimson_Empire_III:_Empire_Lost_3",
  "/wiki/Crimson_Empire_III:_Empire_Lost_4",
  "/wiki/Crimson_Empire_III:_Empire_Lost_5",
  "/wiki/Crimson_Empire_III:_Empire_Lost_6",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_87",
  "/wiki/The_Official_Star_Wars_Fact_File_94",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jak_Bremen",
  "/wiki/7_ABY/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Kopri",
  "/wiki/25_ABY/Legends"
 ]
}