{
 "name": "Misha Quor-Din",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Misha Quor-Din was a female Human Padawan who served the the Jedi Order during the waning years of the Galactic Republic.\nA Force-sensitive Human, Misha Quor-Din became a Padawan in the Jedi Order and trained at the experimental Academy on the planet Almas. Under the guidance of Jedi Master and Academy battlemaster Kirlocca, Quor-Din and a group of other students went on an expedition into the Almas Wasteland in 31 BBY. However, some of the Jedi fell under the influence of the dark side of the Force and attacked Kirlocca. Quor-Din and the rest of the Jedi tried to defend Kirlocca, but were driven back by their deranged opponents. However, while she fled, she was captured by a group of Believers.\nShe was taken back to the Almas Sith fortress, where she was made the prisoner of Garvin Delquist, a researcher at the Forard research station who had been given dark side powers by a Sith amulet. He had fallen in love with Quor-Din, which was why he had ordered her capture, but she did not reciprocate his feelings and rejected his advances. She was eventually rescued by a group of agents sent by Master Lanius Qel-Bertuk and returned to the Academy unharmed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mistress_of_Lightsabers",
  "/wiki/Kirlocca",
  "/wiki/Almas_Wasteland",
  "/wiki/31_BBY/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Believers",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Garvin_Delquist",
  "/wiki/Forard_research_station",
  "/wiki/Sith_amulet",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/Desert_Cries",
  "/wiki/A_Dark_Fortress"
 ]
}