{
 "name": "Mish Paht",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Thaereian military"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Mish Paht was a Bothan male who served in the Thaereian military during the time of the Clone Wars. Around 21 BBY, Paht led a group of Thaereian troops to the planet Genarius to recover evidence of a virus fatal to the Caarite species that had been developed by the Believers Sith cult. In the Genarius manufacturing facility S-Ipsus, Paht and his soldiers accosted a group of freelance agents that had recovered a specimen of the contagion in an attempt to claim the viral sample for the Thaereian military. However, he was defeated by the freelance operatives and was unsuccessful at appropriating the specimen.\nMish Paht was a male Bothan who served as a lieutenant in the Thaereian military, the armed forces of the Thaereian system, during the time of the Clone Wars. Around 21 BBY, a concealed laboratory employed by the Believers Sith cult to refine a virus fatal to the Caarite species was uncovered by the Metatheran Cartel trading concern on the planet Genarius. Upon learning of the discovery, Paht determined to recover evidence of the Believer operation to advance his standing within the Thaereian military.\nTo that end, Paht led a Thaereian patrol to S-Ipsus, a manufacturing station on Genarius upon which the Believer laboratory was sited. Ostensibly, Paht and his troops investigated the virus in accordance with the Thaereian military's enfranchisement by the Galactic Republic as defenders of the Cularin system. In truth however, the Thaereians' presence on S-Ipsus was illegal due to the facility being the private property of the Naescorcom conglomerate and hence outside of the Thaereians' jurisdiction, a fact of which Paht was aware. As protection against the virus, Paht donned an EVA suit emblazoned with the insignia of the Thaereian military.\nPaht and his soldiers entered a thermal detonator production line on S-Ipsus beneath which the Believer laboratory was located. On arrival they crossed paths with a group of freelance agents investigating the cultists' activities who had recovered an active sample of the virus and captured the Believer Canduri. Paht accused the freelancers of trespassing on Naescorcom property, planning to use this pretence as a basis to arrest the group in order to gain custody of Canduri. He also claimed that it was not safe for the operatives on S-Ipsus, though refused to disclose what he knew of the Believers activities there. The standoff erupted into a firefight and the freelance agents defeated Paht and his compatriots and escapees with their Believer prisoner.\nFollowing the attack, the Thaereian military sought to disavow responsibility for Paht's unlawful actions on Genarius. The Bothan officer was accused of firing on innocent civilians on private property and removed from active service to await trial. In a public message published on the HoloNet, the Thaereian military apologized to the people of the Cularin system for Paht's crimes and claimed that he had acted without authority.\nMish Paht was an ambitious and believed he would progress far within the Thaereian military. He was corrupt and antagonistic by nature and he was willing to perform acts of violence to advance his career. Paht's arrogance led to him overreaching himself when investigating the Believers' presence on Genarius and he wanted to recover evidence of the anti-Caarite virus at any cost.\nMish Paht was created by Morrie Mullins and featured as a non-player character in Open Aarms, a 2003 Star Wars Legends roleplaying module that formed part of the Metatheran Caution trilogy of RPGA's Living Force campaign.\nIn the roleplaying adventure, the players roleplay as the freelance agents that Paht encounters on Genarius and his encounter with them can play out in a number of ways. If any of the player characters are equipped with restricted weapons, Paht demands to see a permit. He also offers to allow the agents' possession of any unauthorized weapons to go unpunished if the freelance operatives surrender their arms to him, though it is possible for the player characters to bribe Paht or otherwise convince him into allowing them to keep any illegal weapons. If Paht is told by the player characters that he has no authority on S-Ipsus to arrest them, he desists from attempting to detain the freelance agents but continues to demand that the agents relinquish Canduri and any other evidence the player characters gathered concerning the anti-Caarite virus to the Thaereians.\nIt is possible for the encounter between Paht and the player characters to be resolved via non-violent means by the freelance agents handing over Canduri or convincing Paht to let them leave unhindered. If the player characters deceive Paht and he realizes they are lying to him, he orders his troops to open fire on the agents and it is then possible for Paht to be defeated or killed. Afterward, if Paht and his troops opened fire on the freelance agents the Bothan officer is reprimanded by the Thaereian military and a public statement is issued by the Thaereians to apologize for his actions.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Thaereian_military",
  "/wiki/Lieutenant/Legends",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Thaereian",
  "/wiki/Soldier/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Genarius",
  "/wiki/Anti-Caarite_virus",
  "/wiki/Death/Legends",
  "/wiki/Caarite",
  "/wiki/Species/Legends",
  "/wiki/Believers",
  "/wiki/Sith_cult/Legends",
  "/wiki/Factory/Legends",
  "/wiki/S-Ipsus",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Thaereian_system",
  "/wiki/S-Ipsus_Believers_laboratory",
  "/wiki/Metatheran_Cartel",
  "/wiki/Thaereian_Navy_charter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cularin_system",
  "/wiki/Naescorcom/Legends",
  "/wiki/Enviro-suit",
  "/wiki/Open_Aarms",
  "/wiki/Canon",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Sith_Cultist",
  "/wiki/Canduri",
  "/wiki/Prisoner/Legends",
  "/wiki/Officer/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Morrie_Mullins",
  "/wiki/2003",
  "/wiki/Roleplaying_game",
  "/wiki/Metatheran_Caution_trilogy",
  "/wiki/RPGA",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Wizards.com",
  "/wiki/Over_Thaere",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance"
 ]
}