{
 "name": "Missira",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Mother Missira was the Mother of the informal \"irstat\" of Tarasin students studying at the Almas Academy. When young Tarasin started going to the academy, the elders were concerned that they would not cope well with life away from Cularin and the tribes. Mother Missira was chosen to go to Almas and gather the students into a tribe to ease their transition into the greater galaxy. It proved to be a successful strategy.\nAfter the academy's chef droid, O2-C4, was accidentally destroyed, Mother Missira took upon herself the role of head chef for the academy. Although another droid was ordered, everybody was so happy with her cooking that nobody wanted it to arrive.\nMissira was fond of children, and enjoyed being able to teach them their cultural heritage while they studied the Jedi's way of the Force. Missira had developed her own quirky sense of humor after coming to Almas. She had a sort of friendship with E1-6RA, helping the droid out with its administrative duties, although she found E1's attempts at humor to be lacking.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Galaxy/Legends",
  "/wiki/Droid/Legends",
  "/wiki/O2-C4",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/E1-6RA",
  "/wiki/Philology",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Wizards.com",
  "/wiki/Into_the_Academy",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}