{
 "name": "Mist_(bounty_hunter)",
 "display_name": "Mist  (bounty hunter)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kal'Shebbol"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Just short of two meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Moff Kentor Sarne"
     ]
    }
   ]
  }
 ],
 "content": "Mist was a Human female bounty hunter operating during the early years of the New Republic. Born Shella Inion on the planet Kal'Shebbol, she was a minor actress who disappeared from public view after the death of her family and her own partial disfigurement following a suspected Rebel attack on her hometown. Moff Kentor Sarne, the Imperial warlord controlling Kal'Shebbol, had planned and staged the attack to further his own agenda, and to reduce popular support for the Rebel Alliance. Inion reinvented herself as the bounty hunter known only as Mist, utilizing a highly modified suit of Krail Armory's Model 1010 Photo-reactive Personal Armor to disguise both her appearance and gender.\nMist was regarded as a capable individual, and she allied herself with Moff Sarne, blaming the Rebellion for the death of her family. When the planet Kal'Shebbol was taken by the New Republic in 8 ABY, Mist was off-planet on an assignment, and was subsequently separated from Sarne. The Moff managed to escape his capital with the bulk of his fleet, and Mist spent several weeks trying to regroup with him and his forces, tracking his movements through the Kathol sector and the Kathol Outback. Eventually succeeding, she led several military missions that encountered the crew of the New Republic CR90 corvette FarStar, which was on a mission to locate Sarne.\nMist traveled with Sarne to the planet Kathol, and defended him throughout the Battle of DarkStryder's Fortress, escaping with him to the hyperspace launch gate in orbit around the planet. Sarne planned to activate the launch gate and destroy the New Republic forces battling his own ships in orbit of the planet as part of his plan to reconquer the Kathol sector. Wounded during the engagement, Mist was captured by members of the FarStar's crew. Jessa Dajus, a member of the FarStar crew and a former Intelligence officer in Sarne's Imperial regime, told her that the attack that had claimed the lives of her family had actually been planned and staged by the Moff to incriminate the Rebels. Enraged at having been lied to, Mist switched her allegiances and assisted the crew of the FarStar in defeating Sarne.\nThe Human female Shella Inion was a minor actress from the planet Kal'Shebbol in the Kathol sector. Some time before the Battle of Endor, she disappeared from public view after she was facially scarred and her family was killed in a supposed Rebel attack on her hometown. The attack had actually been planned and staged on the orders of Kentor Sarne, the Imperial Moff ruling the sector, as a way of eroding popular support for the Rebellion. Reinventing herself as the bounty hunter known as \"Mist,\" she began plying her trade shortly before the Imperial defeat at Endor in 4 ABY and soon became an enigmatic figure in the Kathol sector's criminal underworld. Her new persona hid the details of her former life and, due to the heavily modified personal armor she wore, many were convinced that \"Mist\" was actually a male. Believing in Sarne's propaganda that Rebels had been responsible for the attack that had killed her loved ones, she threw in her lot with the Moff, acting as his personal enforcer.\nMist built up an impressive and violent reputation throughout the underworld of the Kathol sector, and seldom appeared in public throughout Moff Sarne's reign, who had subsequently taken over the sector as an independent warlord following the fragmentation of Imperial command authority following the death of Emperor Palpatine at Endor. She worked almost exclusively for the Imperial warlord, and enjoyed the work. The money was good and the jobs were challenging and interesting.\nIn 8 ABY, Mist was off-planet on assignment for Sarne when Kal'Shebbol fell to the New Republic. Left behind in Sarne's retreat from the sector, Mist began searching for the Moff, tracking down clues from her Imperial sources. While searching for Sarne's location, she returned to traditional bounty hunting activities. Several weeks after the Battle of Kal'Shebbol, Mist was on the planet Danoor. While in the capital city of Eror Zeen, she assisted the crew of the New Republic vessel FarStar, dealing with two government soldiers that had tried to kill a landing party that was searching for the navigator, Makezh.\nFollowing her adventure on Danoor, Mist managed to regroup with Sarne's forces. Mist was put in command of a Gamma-class assault shuttle with a complement of stormtroopers and spacetroopers. While investigating a strange alien construct within the Kathol Rift—a volatile area of space filled with dense nebulaic material and lightstorms—the assault shuttle was captured by docking tendrils from the station and drawn into one of its docking domes. Trapped on the construct, Mist and the stormtroopers explored the alien station and discovered how to release their ship by finding the override controls that managed the docking tendrils. During her exploration of the construct, she discovered a piece of DarkStryder technology, an artifact that created a fire creature. Just before they were due to leave, one of the stormtrooper patrols encountered a boarding party from the FarStar. The New Republic ship was being ensnared just as Mist's assault shuttle had been, and Captain Kaiya Adrimetrum, commander of the FarStar, had sent a mission to the station to free the ship.\nThis time, however, Mist was not interested in assisting them, and ordered the stormtroopers under her command to fire on the New Republic crew members once they had reached the docking dome where her shuttle was being held. During the firefight, Mist used her jetpack to gain altitude and a tactical advantage, then unleashed the fire creature within the DarkStryder artifact. Controlled by a device on her armor, Mist had the creature clear a path to her ship and she prepared to escape. Mist intended for the FarStar's crew to be in the docking dome when she depressurized it to leave, killing them in the process, but they managed to escape in time. Successfully launching from the construct, Mist briefly engaged the FarStar with the Gamma-class assault shuttle while waiting for a micro-jump to be plotted. During the brief engagement, she launched four spacetroopers to deal with the FarStar, but left them behind once the shuttle was able to jump.\nSeveral weeks later, Mist led a unit of stormtroopers, backed by an AT-ST and an AT-PT, in setting up an ambush for the FarStar on the planet Demonsgate on the edge of the Kathol Rift. Posing as a downed Imperial survey mission unable to rendezvous with Sarne, they sent out a distress signal that the FarStar intercepted. A mission was organized, but before it was launched, the FarStar's navigator, Makezh, stole an artifact that the crew had recovered on the alien construct, and fled to the planet. The mission intended to investigate the Imperial signal was re-tasked to recover Makezh and the Codex, and they tracked him to a geyser field on the surface. There, Mist and the Imperial forces ambushed them, taking Makezh prisoner. Mist ordered the FarStar crewmembers to surrender or she would kill Makezh. The navigator unexpectedly erupted into action, knocking Mist to the ground and running off. Hitting the ground, Mist ordered the stormtroopers to open fire. The ensuing battle favored the Imperial forces, but they were attacked in turn by the mysterious Aing-Tii monks since they had threatened Makezh. Makezh was carrying their sacred artifact, the Codex, which he had been preprogrammed to retrieve for them. The Aing-Tii abducted the Imperial soldiers, but Mist escaped their clutches.\nMist left Demonsgate and rendezvoused with Sarne's forces, accompanying them to Kathol. During the Battle of DarkStryder's Fortress, Mist remained with Sarne, and escaped the battle with him to the orbiting hyperspace launch gate. The launch gate was an ancient piece of technology created by the extinct Kathol species to propel their spacecraft into hyperspace. Sarne planned to use the launch gate to destroy the New Republic forces arrayed against him in one fell swoop, believing that this would allow him to reconquer the sector and retake his capital of Kal'Shebbol. On the launch gate, Mist was wounded by members of the FarStar's crew who had followed them while she was defending Sarne, and was subsequently captured. Unmasked and recognized by Jessa Dajus, a member of the FarStar's crew and a former Intelligence officer who had served under Moff Sarne, she was told the truth about the attack that had killed her family—an attack that Dajus herself had helped to plan. Aware of the truth, and that Sarne had lied to her, Mist switched her allegiance and assisted the FarStar crew in stopping Sarne.\nMist was an attractive woman—although her face was marred by a scar on the left side—with sharp features and curly blonde hair. She spoke infrequently, usually in clipped and curt phrases. Her female voice was disguised by the voice amplification system built into her armor's helmet. Mist maintained a hatred of the Alliance to Restore the Republic and its successor, the New Republic, believing that they were responsible for both the deaths of her family, and her own facial scarring. However, this hatred was only directed at them because she believed in Sarne's propaganda surrounding the incident. Once she learned the truth, that Sarne had planned and authorized the attack himself, she turned her anger towards Sarne and even allied herself with the FarStar's crew during their assault on the Moff on the hyperspace launch gate.\nMist was considered to be both capable and violent. An accomplished warrior, she was trained to use blasters, grenades and missile weapons, and was skilled in melee combat. Mist showed battlefield prowess and tactical command abilities against the FarStar crew on several occasions, and even managed to escape from the clutches of the Aing-Tii on Demonsgate. Mist was also practical and callous, and would not hesitate in spending troopers' lives to achieve her goal. During a skirmish with the FarStar above the alien construct, she ordered spacetroopers into battle despite knowing that they would be left behind once a micro-jump had been plotted.\nAs a bounty hunter, Mist had survival talents, and was able to track targets. She also had knowledge of alien species, other languages and planetary systems, and bureaucracy. Mist was qualified to fly space transports and navigate through hyperspace, and could also operate repulsorlift vehicles. She was also trained to use a starship's weapons and shield systems, and had a working knowledge of security equipment. Encased in body armor while working as a bounty hunter, Mist was proficient in the use of jet packs and powersuits, and was able to repair her own armor and weapons.\nMist carried a veritable arsenal of weapons to allow her to pursue both her trade as a bounty hunter, and as Moff Sarne's personal enforcer. Her primary weapons included a heavy blaster pistol, and a blaster rifle mounted with a bayonet blade, along with a hold-out blaster for emergencies. Mist also carried two smoke grenades and two paralysis grenades, and also utilized a DarkStryder artifact that released a fire creature that she discovered while on the alien construct within the Kathol Rift. As a licensed bounty hunter, Mist was required to carry an Imperial Peace Keeping Certificate, and carried binders and a man trap to deal with live captures.\nMist wore a heavily modified suit of Krail Armory Model 1010 Photo-reactive Personal Armor. Bulky and intimidating in appearance, the armor served to disguise Mist's gender, and she was often mistaken for a man. The suit was covered in a coating of photosensitive microscopic crystals that reflected the ambient colors of any area, making the armor difficult to see. Combined with sensor-absorbing reflec plating, Mist's armor was virtually undetectable and gave her an edge over most opponents. The armor also boasted a sealed enviro filter with a three-hour supply of oxygen. The filter contained a voice disguiser that made Mist's voice impossible to identify as female. Mist had also incorporated a jetpack into her armor, and an integral flechette launcher. The suit offered basic protection to Mist from weapons fire and melee attacks. An integrated sensor package gave Mist enhanced senses, and the suit also augmented her strength.\nThe character of Mist was created by West End Games for The Kathol Outback, a supplement for Star Wars: The Roleplaying Game and part of The DarkStryder Campaign. In the notes for the gamemaster, it was suggested that the bounty hunter was to be encountered by the player characters on several occasions, but observed from a distance to preserve the mystery of the character since they would play an important part in future DarkStryder adventures. Mist was a minor antagonist in The Kathol Rift, directly confronting the player characters, while her true name and background was revealed in the final book of the DarkStryder series, Endgame. Mist earned two entries in The Complete Star Wars Encyclopedia under both her true name, and her assumed identity.\nMist's helmet appears to be based on an early concept design for Boba Fett's for Star Wars: Episode V The Empire Strikes Back. Concept art published on page 145 of The Art of Star Wars Episode V: The Empire Strikes Back shows several different helmet designs by Ralph McQuarrie and Joe Johnston. The image on the right hand side of the top row shows a helmet similar in appearance to Mist's, including the pronounced visor and helmet mounted antenna.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Mist",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Actor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Attack_on_Shella_Inion%27s_hometown",
  "/wiki/Shella_Inion%27s_hometown",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Krail_Armory",
  "/wiki/Model_1010_Photo-reactive_Personal_Armor",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/8_ABY/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Moff_Sarne%27s_forces",
  "/wiki/Standard_week/Legends",
  "/wiki/Kathol_sector",
  "/wiki/Kathol_Outback",
  "/wiki/CR90_corvette/Legends",
  "/wiki/FarStar",
  "/wiki/DarkStryder_Campaign",
  "/wiki/Kathol_(planet)",
  "/wiki/Battle_of_DarkStryder%27s_Fortress",
  "/wiki/Hyperspace/Legends",
  "/wiki/Launch_gate",
  "/wiki/Orbit/Legends",
  "/wiki/Battle_of_Kathol_System",
  "/wiki/Sector/Legends",
  "/wiki/Jessa_Dajus",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Time/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Imperial_High_Command/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Danoor",
  "/wiki/City/Legends",
  "/wiki/Eror_Zeen",
  "/wiki/Starship/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Mission_group",
  "/wiki/Makezh",
  "/wiki/Alien_construct",
  "/wiki/Gamma-class_assault_shuttle/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Zero-G_assault_stormtrooper",
  "/wiki/Kathol_Rift/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Nebula/Legends",
  "/wiki/Lightstorm",
  "/wiki/Shuttle/Legends",
  "/wiki/DarkStryder_technology",
  "/wiki/DarkStryder_fire_creature",
  "/wiki/Captain/Legends",
  "/wiki/Kaiya_Adrimetrum",
  "/wiki/Commander/Legends",
  "/wiki/Skirmish_on_the_Alien_Construct",
  "/wiki/Jetpack/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Precision_hyperspace_jump",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/All_Terrain_Personal_Transport/Legends",
  "/wiki/Demonsgate",
  "/wiki/Distress_signal/Legends",
  "/wiki/Codex",
  "/wiki/Geyser/Legends",
  "/wiki/Skirmish_on_Demonsgate",
  "/wiki/Aing-Tii/Legends",
  "/wiki/Kathol_(species)",
  "/wiki/Species/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Missile/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Powersuit",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Bayonet/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Smoke_grenade",
  "/wiki/Paralysis_grenade",
  "/wiki/Imperial_Peace-Keeping_Certificate/Legends",
  "/wiki/Stun_cuffs",
  "/wiki/Reversed_repulsorfield",
  "/wiki/Photosensitive_microscopic_crystal",
  "/wiki/Sensor/Legends",
  "/wiki/Reflec/Legends",
  "/wiki/Enviro_filter",
  "/wiki/Standard_hour/Legends",
  "/wiki/Oxygen/Legends",
  "/wiki/Voice_disguiser",
  "/wiki/Flechette_launcher/Legends",
  "/wiki/West_End_Games",
  "/wiki/The_Kathol_Outback",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/The_Kathol_Rift",
  "/wiki/Endgame",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/The_Art_of_Star_Wars_Episode_V:_The_Empire_Strikes_Back",
  "/wiki/Ralph_McQuarrie",
  "/wiki/Joe_Johnston",
  "/wiki/Galaxy%27s_Edge",
  "/wiki/Waystation",
  "/wiki/Showdown_(RPG_adventure)",
  "/wiki/Endgame_(RPG_adventure)",
  "/wiki/The_DarkStryder_Campaign,_Deluxe",
  "/wiki/The_DarkStryder_Campaign"
 ]
}