{
 "name": "Mitth_family",
 "display_name": "Mitth family",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Family type",
     "values": [
      "Ruling Family"
     ]
    },
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Patriarch(s)",
     "values": [
      "Mitth'omo'rossodo",
      "Mitth'oor'akiord",
      "Mitth'urf'ianico"
     ]
    },
    {
     "name": "Planet(s) of origin",
     "values": [
      "Csilla"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "Mitth family homestead",
      "Csaplar",
      "Csilla",
      "Mitth family compound",
      "Avidich"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation",
     "values": [
      "Chiss Ascendancy",
      "Nine Ruling Families",
      "Nine Ruling Families"
     ]
    }
   ]
  }
 ],
 "content": "The Mitth family was a powerful Chiss family and a member of the Nine Ruling Families of the Chiss Ascendancy. The Mitth family was rivaled with their fellow Ruling Irizi and Ufsa families, and allied with the Ruling Obbic family.\nAs a young Chiss, future Imperial Grand Admiral Thrawn was adopted into the family.\nThe Mitth family's true history was kept secret from all but the most important family members, such as the Patriarch. The family's history involved an alien weapon called the Starflash.\nThe Mitth family originated on the Chiss homeworld of Csilla. Long after the planet froze and most of Csilla's population emigrated to other worlds in the Ascendancy, the Mitth family maintained its headquarters at the Mitth family homestead beneath their ancestral lands of Csilla's capital city, Csaplar.\nDuring the Final Assault on Csilla, the Chiss Ascendancy was about to be annihilated by its enemy when the Stybla Patriarch remembered the existence of a superweapon called Starflash. 20 Mitth warriors volunteered to operate it, including Mitth'omo'rossodo's four sons. Starflash was fired at Csilla's star which caused a return blast that destroyed both the attacking fleet and the weapon, killing everyone who operated it. Because of this sacrifice, the Mitth were made a Ruling Family and Thomoro was granted the Stybla honorific \"odo\". Furthermore, the Mitth family emblem became a blazing sun.\nPrior to the Lioaoin pirate campaign, the Mitth family adopted a young Chiss named Kivu'raw'nuru into their family as a merit adoptive from his homeworld of Rentor. Unbeknownst to Mitth'urf'ianico, the Aristocra tasked with recruiting Vurawn, Vurawn was to be rematched into the Mitth family at the personal request of Patriarch Mitth'oor'akiord himself. When Vurawn, now Thrawn, was a cadet, Patriarch Thooraki also insisted on recruiting former sky-walker Al'iastov into the Mitth.\nAt the time of the attack on Csilla near the end of the Clone Wars, the Mitth family was in competition against the Ufsa family to establish a mining operation on Thearterra.  At this time, the Mitth family was led by Patriarch Mitth'oor'akiord, who took great interest in recruiting and adopting promising Chiss into the Mitth.\nPatriarch Thooraki was present at the Mitth family homestead when Mitth'ali'astov undertook her Trials, and personally congratulated the caregiver as a Trial-born of the Mitth. When she had nearly climbed the mountain marking the end of the Trials, Thalias encountered an old man whose skin was pale with age. Gathered about the mountain's summit were memorial staffs memorializing deceased Mitth family Syndics, Speakers, and Patriarchs; their accomplishments, and those they recruited and/or elevated within the family. The elderly man asked the caregiver her opinion on a particular memorial staff adorned with many smaller staffs nearby, to which she responded that it was impressive. The elder laughed and responded that such displays were only impressive to those impressed by pure numbers, and that quality of recruits was more important than quantity. At that point, Thalias recognized the elder as Patriarch Thooraki. The Patriarch told the caregiver that Thrawn would bring great glory and renown to the Mitth and someday be his crowning jewel, and Thrawn's staff would stand next to Thooraki's own adorned memorial staff one day. He told Thalias that he personally arranged for both Thrawn and her to be rematched into the Mitth family, and asked Thalias to look after Thrawn and protect the officer from enemies within the Ascendancy and possibly the Mitth family itself. Thooraki worried that an enemy of Thrawn might try to succeed him as Patriarch once he died.\nIndeed, Thrawn had enemies within the Mitth. Syndic Prime Mitth'urf'ianico, the very Aristocra who recruited Vurawn to the Mitth from Rentor, had a vendetta against Thrawn. Working with Irizi family Syndic Zistalmu, Syndic Thurfian plotted to sabotage Thrawn's career. During his official duties in the Syndicure, Thurfian sought to advance Mitth interests but also sabotage Thrawn. Thurfian was promoted to Syndic Prime by ingratiating himself to the political establishment of the Mitth family and the Syndicure, and had an eye on the Speakership, then held by Mitth'ykl'omi. During the Nikardun campaigns, Syndic Prime Thurfian arranged to send Mitth family spies to learn the secrets of the Great Stybla family, renowned as merchants and shippers.\nUpon the death of Patriarch Thooraki, Syndic Prime Thurfian was chosen by the Patriels and Speaker as his successor. Thurfian had not even set his sights on the Office of the Patriarch, and believed that perhaps Speaker Thyklo may have succeeded Thooraki. Nevertheless, Patriarch Mitth'urf'ianico was highly pleased with his new role and powers.\nExcept for the individual character Mitth'raw'nuruodo , the Mitth family first appeared in the 2020 novel Thrawn Ascendancy: Chaos Rising, the first book of The Ascendancy Trilogy by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mitth_family",
  "/wiki/Mitth_family/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chiss",
  "/wiki/Mitth%27omo%27rossodo",
  "/wiki/Mitth%27oor%27akiord",
  "/wiki/Mitth%27urf%27ianico",
  "/wiki/Csilla",
  "/wiki/Mitth_family_homestead",
  "/wiki/Csaplar",
  "/wiki/Mitth_family_compound",
  "/wiki/Avidich",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Chiss_family",
  "/wiki/Irizi_family",
  "/wiki/Ufsa_family",
  "/wiki/Obbic_family",
  "/wiki/Galactic_Empire",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Rematching",
  "/wiki/Patriarch",
  "/wiki/Starflash",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Final_Assault_on_Csilla",
  "/wiki/Unidentified_enemy_of_the_Chiss",
  "/wiki/Stybla_family",
  "/wiki/Superweapon",
  "/wiki/Csilla%27s_star",
  "/wiki/Mitth_family_emblem",
  "/wiki/Lioaoin_pirate_campaign",
  "/wiki/Merit_adoptive",
  "/wiki/Gender",
  "/wiki/Rentor",
  "/wiki/Aristocra",
  "/wiki/Cadet",
  "/wiki/Ozyly-esehembo",
  "/wiki/Mitth%27ali%27astov",
  "/wiki/Attack_on_Csilla",
  "/wiki/Clone_Wars",
  "/wiki/Mining",
  "/wiki/Thearterra",
  "/wiki/Time",
  "/wiki/Trials",
  "/wiki/Caregiver",
  "/wiki/Trial-born",
  "/wiki/Unidentified_mountain",
  "/wiki/Memorial_staff",
  "/wiki/Death",
  "/wiki/Syndic",
  "/wiki/Speaker_(Chiss_Ascendancy)",
  "/wiki/Irizi%27stal%27mustro",
  "/wiki/Syndic_Prime",
  "/wiki/Mitth%27ykl%27omi",
  "/wiki/Nikardun_campaigns",
  "/wiki/Great_Families",
  "/wiki/Patriel",
  "/wiki/Office_of_the_Patriarch",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Boadil_family",
  "/wiki/Chaf_family",
  "/wiki/Clarr_family",
  "/wiki/Dasklo_family",
  "/wiki/Plikh_family",
  "/wiki/Coduyo_family",
  "/wiki/Erighal_family",
  "/wiki/Pommrio_family",
  "/wiki/Xodlak_family",
  "/wiki/Droc_family",
  "/wiki/Tahmie",
  "/wiki/Ranking_distant",
  "/wiki/Cousin",
  "/wiki/Blood_(rank)",
  "/wiki/Chiss_Syndicure",
  "/wiki/Councilor_(Chiss_Ascendancy)",
  "/wiki/Family_emergency",
  "/wiki/Homestead"
 ]
}