{
 "name": "Mitth%27oor%27akiord",
 "display_name": "Mitth'oor'akiord",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 18 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Mitth family",
      "Mitth family"
     ]
    }
   ]
  }
 ],
 "content": "Mitth'oor'akiord, known by the core name Thooraki, was a Chiss male who held the title of Patriarch of the Mitth family. Thooraki invested time in recruitment for the Mitth, seeking out and arranging for invitations to be offered to talented prospective family members.\nPatriarch Thooraki personally asked his friend General Ba'kif to point the Mitth family to recruit Kivu'raw'nuru, who would later become Senior Captain Mitth'raw'nuruodo, core name, \"Thrawn\" of the Chiss Expansionary Defense Fleet. He also personally made the decision to invite the former ozyly-esehembo or skywalker Ali'astov, whose powers of Second Sight had faded, into the Mitth.\nPatriarch Thooraki was present when Mitth family merit adoptive Mitth'ali'astov  performed her family Trials. He considered her solutions to be highly elegant and congratulated her, welcoming her as a Trial-born of the Mitth. Thooraki considered Trial-born Mitth'raw'nuruodo to be extremely talented and have the potential to bring greatness to the Mitth family and the Chiss Ascendancy on the whole, but was cognizant that others thought Thrawn might bring them to ruin. He entrusted Thalias to watch over and protect Thrawn from his enemies, as Thrawn was always weak at politics.\nMitth'orr'akiord or Thooraki observed how merit adoptive of the Mitth, Mitth'ali'astov, core name, \"Thalias\" performed the family Trials. Thooraki considered Thalias's solutions to be highly elegant, such as her solution to the water-channel challenge. After informing Thalias that he had been watching her since she arrived, he asked the woman to explain how she solved the water-channel challenge.\nThe woman then replied, that the channel was only about a meter deep, so she took two boarterds, placed their ends together in the middle of the channel, then pushed one board to the opposite side and lowered the other to her side. With the two of them angled up against the channel's edges, she laid another board horizontally across them. Then, she added two final angled boards, set into the center of the horizontal and placed one final horizontal across them.\nAfter the woman explained her solution, Thooraki explained that one trial-born that began as she did, but simply laid more boards across the first horizontal until the stack was above the water level. Adding that it wasn't nearly as elegant, he then added that he had brought her to the Mitth personally, the women replied that she was honored and that she hoped to live up to his trust in her. Thooraki then explained she already was living up to his trust in her, that she had already repaid his trust many times and that she had stood guard between his greatest achievement and those determined to destroy it. The shocked woman asked the patriarch that if he meant his achievement was Senior Captain Thrawn, he then confirmed her theory. He then continued to explain why Thrawn was his greatest achievement, that he saw greatness in him, that he could bring greatness to the Mitth family, and to the Chiss Ascendancy itself.\nMitth'orr'akiord then told Thalias that there were people determined to destroy him, because the greatness he could bring to the Mitth came with a risk, which they feared, as they wished to have a steady path witho no risks. He then told her that his life was coming to an end, and that she had to help Thrawn to gather his allies, which Thrawn didn't know were allies, when he needed them most. Thalias assured the Patriarch she would do her best. And left.\nIn 18 BBY, Thooraki died because of his advanced age. After his death, Speaker Mitth'ykl'omi informed Syndic Thurfian, now Syndic Prime, of the patriarch's death. The Syndic said he was sorry of Thooraki's passing, however, he asked Thyklo if a new patriarch had been chosen. The Speaker then announced that they had in fact chosen Thurfian to be Patriarch. Thyklo then acknowledged the tradition of the patriarch being chosen from the ranks of the patriels, however, after the incident, the confusion surrounding the event had underscored the need to keep firm control of the family dealings in a planetary level, none of the patriels felt confident enough that they could leave the matters in their hands while new patriels were being chosen.\nThooraki's achievement, Thrawn, was eventually exiled from the Chiss Ascendancy because of one of his most recent victories, however, the Chiss continued serving the Ascendancy, in an attempt to assure the Galactic Empire would never attack the Ascendancy, and in an attempt of knowing more about the newly formed order, Thrawn reached the pinnacle of the Empire, and eventually reached the rank of Grand Admiral, which assured his people wouldn't be attacked by the Empire.\nAs Mitth family Patriarch, Mitth'oor'akiord showed keen interest in attracting, recruiting and retaining talented Chiss individuals into the family. Thooraki personally arranged for Senior Captain Mitth'raw'nuruodo and Caregiver Mitth'ali'astov to be invited to the Mitth family, seeing their potential to benefit and benefit from the Mitth family.\nPatriarch Thooraki was very protective of Thrawn, knowing the officer was a brilliant tactician and strategist but also aware of Thrawn's fatal flaw of low political acumen. Thooraki correctly surmised that Thrawn had enemies within the upper echelons of not only the Ascendancy, but also the Mitth family itself. Thooraki knew he was old and close to death, and feared that members of the Mitth family who opposed Thrawn may seek to succeed him as Patriarch.\nSyndic  Mitth'urf'ianico was one such high-ranking anti-Thrawn official of the Mitth. After Thooraki's passing, Thurfian succeeded the elder as the Mitth family Patriarch; vindicating Thooraki's fears that a Patriarch determined to destroy Thrawn might succeed him.\nThooraki first appeared on the novel Thrawn Ascendancy: Chaos Rising by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/18_BBY",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Mitth_family",
  "/wiki/Core_name",
  "/wiki/Patriarch",
  "/wiki/Rematching",
  "/wiki/Ba%27kif",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Senior_Captain",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Sky-walker",
  "/wiki/Mitth%27ali%27astov",
  "/wiki/Precognition",
  "/wiki/Merit_adoptive",
  "/wiki/Trials",
  "/wiki/Trial-born",
  "/wiki/Water",
  "/wiki/Mitth%27urf%27ianico",
  "/wiki/Speaker",
  "/wiki/Mitth%27ykl%27omi",
  "/wiki/Hoxim_incident",
  "/wiki/Exile",
  "/wiki/Sunrise_incident",
  "/wiki/Galactic_Empire",
  "/wiki/Grand_Admiral",
  "/wiki/Death",
  "/wiki/Syndic",
  "/wiki/Syndic_Prime",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Template:GreaterGoodDate",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Standard_year",
  "/wiki/Attack_on_the_Paataatus",
  "/wiki/Thrawn_(novel)"
 ]
}