{
 "name": "Mitth'ali'astov",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Colonial Station Camco"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 52 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Sky-walker corps",
      "Mitth family",
      "Sky-walker corps",
      "Mitth family"
     ]
    }
   ]
  }
 ],
 "content": "Mitth'ali'astov, known by the core name of Thalias, raised as Al'iastov, was a Chiss female Caregiver and former Force-sensitive sky-walker. She was born on Colonial Station Camco to a poor and unrenowned family, and was brought to The Expansionary Fleet complex on Naporar for sky-walker training when she was young. She started navigating when she was seven. At one point, she served as a navigator aboard the Tomra, where she met Thrawn. Her Third Sight only lasted until she was thirteen, a year earlier than a typical sky-walker. She was adopted by the Chiss Ascendancy's Mitth family as a merit adoptive. She then became sky-walker Che'ri's Caregiver, assigned to take care of, teach, supervise, and parent the young navigator. She later became a Trial-born after completing the Trials, with Mitth family Patriarch Mitth'oor'akiord personally welcoming her as a Trial-born of the Mitth. Thalias was born around 52 BBY.\nThalias accompanied Thrawn on many missions, pretending to be a family hostage, multiple times. She found it hard to leave Che'ri behind, as she remembered how hard it was without a caretaker while she was a sky-walker. As the first caretaker in decades who had been a sky-walker herself, Thalias had a much closer relationship to Che'ri than was usual.\nWhen the Springhawk came upon the refugees led by the Magys on Rapacc, the Magys insisted on speaking only with Caregiver Thalias, as Thalias had once touched \"The Beyond.\" The Magys, a Force-sensitive of an unnamed species, sought suicide of the remaining two hundred members of her species so they could \"join the Beyond\" and heal their homeworld, which had been devastated by a civil war. Thalias sought to prevent the mass suicide of what may be the last survivors of an otherwise extinct species, and sought to provide hope of rebuilding to the Magys. She convinced Thrawn to bring the Springhawk, with Magys and an escort aboard, to the Magys' homeworld, where they were attacked by forces affiliated with the Grysk Hegemony.\nAl'iastov was an ozyly-esehembo until she was thirteen, when she lost Third Sight. While she was a Skywalker, Thalias met Cadet Mitth'raw'nuru, core name, \"Thrawn\", when she had lost most of her Third Sight, and when she didn't know what going to happen with her after she lost her Third Sight, the latter asked her if she was alright, and tried to help Al'iastov to feel better, however, Captain Vorlip stopped Thrawn from talking with her before he could continue. At that point, Al'iastov decided she would request to join the Mitth, to meet Thrawn, one of the few persons who had cared about her.\nMitth'ali'astov joined the Mitth family as a merit adoptive and later requested to be a caregiver on the Springhawk, the ship Mitth'raw'nuru was commanding as a Senior Captain. However, an unidentified personnel officer denied her request, as she had filled some papers four days after she should have, however, Syndic Mitth'urf'ianico arrived just on time and requested Thalias was accepted, she was later accepted, however, Thurfian later told her that as he had done something for her, she would do something for him. The syndic told her what she was supposed to do while she boarded a shuttle to the Springhawk, and later, met her Skywalker, Che'ri, a young girl.\nAfter meeting her new Skywalker, or ozyly-esehembo, Thalias asked the young girl what game was she playing, to which she replied that it wasn't a game, that she was drawing. The woman asked her if she could see the young one's art, however Che'ri rejected her offer and said it wasn't art, and asked her new caregiver if she drew, Thalias then told the young girl that she liked looking at art, that having the talent to draw was excellent, and that Che'ri's last caregiver was wrong at saying drawing was stupid. Then, the merit adoptive of the powerful Mitth family, revealed that she was previously a Skywalker, that she understood the young girl.\nAfter Che'ri understood that this caregiver, or how she called her caregivers, momishes, was different. Che'ri told Thalias that she was nine and three quarters, Thalias was shocked at hearing that, and afterwards told her she started navigating ships when she was seven and that she was thirteen when she navigated the last. Che'ri then asked if they were going to battle, to which Thalias replied that she didn't think so, and that if that was the case, Senior Captain Thrawn would get them through it.\nThrawn, Che'ri and Mitth'ali'astov traveled aboard the Springhawk to the Rapacc system, a box system where they saw two unidentified naval forces, Che'ri moved to Admiral Ar'alani's Vigilant. Thalias and Thrawn traveled to an abandoned asteroid mining station. Aboard the station, Thrawn and Thalias activated the lights to invite any locals to meet them. The mining station was equipped with several docking ports, Thrawn docked their shuttle to one of them. Thrawn discovered that this place was the one where the refugees came from.\nAli'astov lost her Third Sight at age thirteen, one year prior to the typical age at which sky-walkers lost that ability. As an adult merit adoptive of the Mitth, Mitth'ali'astov was proficient with computers.\nMitth'ali'astov first appeared in the 2020 novel Thrawn Ascendancy: Chaos Rising, written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Mitth%27ali%27astov",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Colonial_Station_Camco",
  "/wiki/52_BBY",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Sky-walker_corps",
  "/wiki/Mitth_family",
  "/wiki/Core_name",
  "/wiki/Caregiver",
  "/wiki/Force-sensitive",
  "/wiki/Sky-walker",
  "/wiki/Mitth%27ali%27astov%27s_original_family",
  "/wiki/Expansionary_Fleet_complex",
  "/wiki/Naporar",
  "/wiki/Navigator",
  "/wiki/Tomra",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Precognition",
  "/wiki/Merit_adoptive",
  "/wiki/Che%27ri",
  "/wiki/Trial-born",
  "/wiki/Patriarch",
  "/wiki/Mitth%27oor%27akiord",
  "/wiki/Chiss_family_hostage",
  "/wiki/Springhawk",
  "/wiki/Refugee",
  "/wiki/The_Magys",
  "/wiki/Rapacc",
  "/wiki/The_Force",
  "/wiki/The_Magys%27s_people",
  "/wiki/Sunrise",
  "/wiki/Sunrise%27s_civil_war",
  "/wiki/Species",
  "/wiki/First_skirmish_over_Sunrise",
  "/wiki/Grysk_Hegemony",
  "/wiki/Cadet",
  "/wiki/Captain",
  "/wiki/Vorlip",
  "/wiki/Senior_Captain",
  "/wiki/Unidentified_personnel_officer",
  "/wiki/Syndic",
  "/wiki/Mitth%27urf%27ianico",
  "/wiki/Shuttle",
  "/wiki/Art",
  "/wiki/Standard_year",
  "/wiki/Rapacc_system",
  "/wiki/Box_system",
  "/wiki/Admiral",
  "/wiki/Ar%27alani",
  "/wiki/Vigilant_(Nightdragon_man-of-war)",
  "/wiki/Unidentified_Paccosh_mining_station",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Rematching",
  "/wiki/Taharim_Academy",
  "/wiki/Mitth%27ras%27safis",
  "/wiki/39_BBY",
  "/wiki/19_BBY",
  "/wiki/Template:ChaosRisingDate",
  "/wiki/Standard_decade",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/General",
  "/wiki/Ba%27kif",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Rematching_dinner",
  "/wiki/Avidich",
  "/wiki/Reproduction",
  "/wiki/Del_Rey"
 ]
}