{
 "name": "Mitth'ras'safis's father",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unidentified minor Chiss family"
     ]
    }
   ]
  }
 ],
 "content": "A male Chiss individual was the father of Mitth'ras'safis. He and his wife were members of a minor family of the Chiss Ascendancy, and having grown up among the Mitth their son could not recall the name of his parent's original family. Just a week before his son's birth Mitth'ras'safis's father was killed while thwarting an assassination attempt on Mitth Patriarch Mitth'oor'akiord, who was travelling incognito. Impressed by his sacrifice, the Patriarch offered to rematch his wife and son to the Mitth, going even so far as to make Thrass's mother a ranking distant and fudging the date of rematching to have their son officially marked into the family as a cousin. Years later, after declaring Mitth'raw'nuruodo as his brother, Thrass told the story of his birth to Thrawn in order to make him more comfortable with their new kinship. Thrawn expressed appreciation for the honorable sacrifice made by Thrass's father, and Thrass confirmed that his father indeed had been an honorable man. Just before his own death aboard the Lesser Space starship, Thrass recalled his father's memory and drew comparison between his father's sacrifice in order to save a stranger and his own willingness to lay down his life to protect the innocent strangers who were still aboard the ship.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Unidentified_minor_Chiss_family",
  "/wiki/Mitth%27ras%27safis",
  "/wiki/Mitth%27ras%27safis%27s_mother",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Mitth_family",
  "/wiki/Parent",
  "/wiki/Standard_week",
  "/wiki/Reproduction",
  "/wiki/Death",
  "/wiki/Assassin",
  "/wiki/Patriarch",
  "/wiki/Mitth%27oor%27akiord",
  "/wiki/Rematching",
  "/wiki/Ranking_distant",
  "/wiki/Cousin",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Unidentified_Lesser_Space_starship",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)"
 ]
}