{
 "name": "Mitth%27ras%27safis",
 "display_name": "Mitth'ras'safis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "By 19 BBY",
      "a Lesser Space starship"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Mitth family",
      "Chiss Syndicure",
      "Mitth family",
      "Chiss Syndicure"
     ]
    }
   ]
  }
 ],
 "content": "Mitth'ras'safis, also known by his core name Thrass, was a Chiss male syndic of the Chiss Ascendancy's Syndicure and held a rank of a cousin within the Mitth family. Around 39 BBY he held a title of Aristocra and became acquainted with newly rematched Cadet Mitth'raw'nuru, also known as Thrawn, who would become his good friend and over the years grow as close to Thrass as a brother would. Mitth Patriarch Mitth'oor'akiord observed and quietly encouraged the relationship with the support of Supreme General Ba'kif and Stybla family Patriarch Stybla'mi'ovodo. Thrass and Thrawn worked well as a team, Thrass rising through the Mitth family's political structure while Thrawn similarly excelled within the Expansionary Defense Fleet, and between the two mastering a considerable amount of political and military skill.\nThrass, along with Thrawn, was at one point sent to assist the Stybla family to recover a part of a Starflash weapon that had been stolen by a group of hijackers. During the mission, Thrass declared Thrawn as his brother, as his rank as a cousin allowed him to create his own family relationships. The mission was successful, and the two Mitths were taken into Patriarch Lamiov's confidence as he and Senior Aide Stybla'ppin'cykok shared with them the whole story of the Starflash and its relation to the history of the Mitth family. Thrass and Thrawn took an oath of secrecy, to keep the information to themselves to their graves and beyond.\nBy 19 BBY, Thrass had become involved with Thrawn's operations against Vagaari pirates. During the operations, Thrawn recovered a gravity well projector from the Vagaari, but Thrass and a massive Lesser Space starship were lost after the syndic attempted to hide the ship from a Chaf family taskforce. Thrass, along with a human woman, died to protect a group of survivors, who were still aboard the ship. Thrass's death and the loss of the Lesser Space starship were a serious blow to Thrawn's reputation and the Defense Hierarchy Council as well as the Aristocra were displeased with the events.\nMitth'ras'safis, known by his core name of Thrass, was born to parents that belonged to a very minor family. His father died about a week before Thrass's birth in order to prevent an assassination attempt against the Patriarch of the Mitth family, Mitth'oor'akiord, who was travelling incognito. After returning home, the grateful Patriarch invited Mitth'ras'safis's mother to Csilla, the Chiss homeworld, and offered to rematch her to the Mitth with the highest family rank that could be offered to a commoner, as a ranking distant. She accepted the offer.\nAs Thrass had already been born before his mother's rematching, he should have also been a ranking distant, but the Patriarch fudged the date of the rematching, making it appear that Thrass's mother had been rematched before his birth, so officially Thrass was born as a Mitth cousin. The discrepancy bothered Thrass during the first few times he introduced himself with his family rank, but later he got used to it. During his childhood, Thrass saw Patriarch Mitth'oor'akiord twice from a distance, when he was visiting the family homestead. Later, as a midager, he had a third opportunity to catch a glimpse of the head of the family, while he was learning the protocols for transporting documents between Avidich, a major Chiss colony world with a strong Mitth presence, and Csilla. During two of his visits to Csilla, Thrass also had opportunities to visit the official family art collection that was stored in the homestead.\nAs a low-ranking member of the Mitth family, one of the duties given to Thrass was to welcome new merit adoptives to their rematching dinners, a service that most higher-ranking members would opt out of performing. Around 39 BBY Thrass had been performing that duty for three years and in that time he had welcomed eleven merit adoptives. Unlike most of his friends, Thrass enjoyed the duty because he was curious to see, if he would be able to figure out what traits the merit adoptive possessed that made them worth rematching to the family. By that time, Thrass had attained the rank of an Aristocra within the Mitth.\nThrass's next assignment was Mitth'raw'nuru,  a merit adoptive who had been rematched from the Kivu family on the planet Rentor and transferred into the Taharim Academy as a cadet of the Chiss Expansionary Defense Fleet. Before the rematching dinner on Avidich, Thrass approached Thrawn in the reception room, assuming the new merit adoptive felt lost. Thrass greeted the cadet and welcomed him to Avidich, introducing himself and his role and assuring Thrawn not to be overwhelmed. Thrawn, however, disproved the Aristocra's suspicions, instead revealing that he had been analyzing the art placed throughout the reception room, having determined that one artist had created three landscape paintings and two statuettes despite the displayed artworks being frequently rotated and possessing no identifiers. Thrass was doubtful, but to his surprise, discovered Thrawn's deduction to be true; the works had been created by the legendary Patriarch Mitth'omo'rossodo, who had lost all four of her sons in a battle. The two reflected upon the tragedy, with Thrass suspecting that Thrawn had experienced such a deep loss, but the Aristocra merely apologized, resuming the welcoming procedures.\nDuring the dinner and official ceremonies Thrass kept an eye on Thrawn, noticing that while the younger man performed his part with proper deference, he was somewhat awkward in social situations. Thrass also noticed that Thrawn's attention tended to wander into the artworks displayed on the walls of the grand banquet hall, and he wondered what the young cadet deduced from them. During the open conversation time, after the ceremony, Thrass had another opportunity to speak with Thrawn and offered to show him the artworks the Mitth Patriel of Avidich had collected. Unfortunately, there was not enough time for a tour, because Thrawn was scheduled to return to the Taharim Academy on Naporar, the planet that housed the headquarters of the Expansionary Defense Fleet, early next morning, and since the young cadet was already working off fifty downmarks, he could not afford to be late. Thrass then explained to Thrawn that the Mitth had wanted to unveil three new military merit adoptives, the young cadet among them, as a way to impress the Irizi Patriel of Avidich, who were rivals to the Mitth and were always eager to add new and promising officers to the ranks of their own family. After promising to look Thrawn up if he happened to visit Naporar during Thrawn's training, Thrass wished the younger man good night and returned to his duties to socialize with the other guests.\nDuring the next two years Thrass occasionally pulled up Thrawn's Taharim records to see how the young cadet was progressing, and he took a note of a cheating charge raised against the younger man and how skillfully the cadet managed to prove his innocence, with the help of General Ba'kif and Senior Cadet Irizi'ar'alani. Overall, Thrass's assessment of Thrawn's records led him to believe that he had great potential and that he would make a fine officer one day.\nAround the time of Thrawn's graduation in 37 BBY, Thrass was visiting his mother when he was unexpectedly invited to a meeting with Patriarch Thooraki. The Patriarch had heard a rumor that the Stybla family was planning to steal Thrawn away from the Mitth and he wanted Thrass to go to Naporar to meet with Thrawn and make sure the freshly minted lieutenant stayed with the Mitth. When Thrass asked if he was authorized to offer any additional incentives to Thrawn to stay with his current family, Thooraki refused, suggesting that he simply reminded Thrawn that Mitth friendship was worth having. Despite the rather lean offer he was allowed to make, Thrass took the assignment seriously, although he wondered why it was worth sending someone all the way to Naporar to block another family's advances toward a mere merit adoptive, especially advances from a relatively low-ranking family like the Stybla.\nThrass set up a meeting with Thrawn in a bistro. A few minutes before Thrawn was set to arrive, Thrass was joined by Stybla'ppin'cykok, the Senior Aide to Patriarch Stybla'mi'ovodo, who was also there to meet Thrawn and make him an offer to join the Stybla. Thrass mocked the Stybla for their descent from the status of the first Ruling Family, but Lappincyk countered that they had graciously chosen to step down, and compensated for their lack of influence by being well informed of the successes of the other families. The two discussed about what either family could offer Thrawn and what they saw in him, and finally, Thrass claimed that the Stybla only saw Thrawn as a prize to be won, while he saw the young officer as his friend. Hearing Thrass's declaration of friendship, Lappincyk chose to back out and only introduced himself politely to Thrawn when the younger man arrived, leaving the two rather bewildered Mitth to enjoy their lunch together.\nAfter Lappincyk's departure, Thrass briefly wondered if the Stybla had been at all serious about trying to steal Thrawn from the Mitth, or had the whole thing just been some kind of an elaborate political scheme the other family had spun for Patriarch Thooraki. Years later Thrass asked directly from Thooraki, if the scheme had been to Thrass's own benefit and if the Patriarch had been in cahoots with the Stybla to maneuver Thrass and Thrawn to become close friends. At the time, though, Thrass quickly dismissed the thought. Instead, he was interested to hear more details about the way Thrawn and Ziara had defeated the cheating charge raised against Thrawn during his training. He was planning to use the story to show that the Mitth were the finest of the Ruling Families, but Thrawn pointed out that all the details might not support such a slanted statement.\nWhile Thrawn rose rapidly in ranks among the Expansionary Defense Fleet, Thrass likewise gained prestige among the Mitth, eventually reaching the rank of syndic. Four months after the pirate attack at Stivic Thrass was still the newest addition to the Mitth complement in the Syndicure, and consequently, the other syndics handed any unpleasant tasks to him. Among those tasks handed down the line, was an order from syndic Mitth'urf'ianico to analyze data gathered from the patrol cruiser Parala during the Stivic incident. Thrass's usual line of work involved with agricultural production and distribution and the military matters were outside that scope, but he had already taken a note of the event because both Thrawn and Ziara had been involved. Thrass's co-worker, who handed the assignment to him, informed him that he needed to have his report ready before lunch and that the task could not be given to the techs, who would have otherwise been more suited to it, because Thurfian wanted to keep anyone but the syndics from knowing that he even had the data from the Parala. Thrass had previously noticed that Thurfian did not seem to like Thrawn very much and privately wondered if the higher ranking syndic wanted the data to vindicate or condemn Thrawn, and if he should try and slant his own analysis in either direction.\nWhen he presented his findings to Thurfian, Thrass blamed the whole incident on Mid Captain Clarr'os'culry's imagination as the modulations in the ranging lasers did not correspond to the trade languages, Taarja and Sy Bisti, Thrass compared them with. Also, the laser's modulator disk was replaced shortly after the incident, which suggested that the disk had in fact been faulty during the pirate attack. In his analysis Thrass had purposefully started with the two most used trade languages and avoided comparing the modulations with other local trade languages, such as Minnisiat or Meese Caulf, as the Garwians defending the planet Stivic had initially hailed the Chiss using the former. Thrass's lackluster report and verbal deflection of Thurfian's accusations against Thrawn finally annoyed the older syndic enough to start throwing insults at Thrass's skill to manage his position in the Syndicure and finally to dismiss the younger man from his office.\nOn his way back to his own workstation, Thrass wondered if it was him or Thurfian whose loyalties were clouded by their feelings. In the end, he decided that his decision to cover up for Thrawn was loyalty to the Mitth family in general, as he, and maybe even more importantly Patriarch Thooraki, believed that the young officer had a bright future ahead of him and that Thrawn would yet bring great honor to the family. Seeing that it was about lunchtime and Thrawn should have completed his report to the Defence Council, Thrass decided to invite his friend for a meal.\nWhen their duties allowed Thrass and Thrawn met, often in one of the bistros located conveniently near the Defense Force headquarters. During one of their meetings, Thrawn began to teach Thrass to play Tactica, a board game that according to Thrass's rather rueful statement played to Thrawn's strengths and against his own. Nevertheless, Thrass became to enjoy the game. Eight weeks after Thrass's first introduction to the game, the two of them had another opportunity to play together, and Thrawn complimented Thrass on his developing skills in understanding the game. While they played they discussed how theatrics could be useful in Thrass's political field in the Syndicure but Thrass also pointed out that they had their uses in other lines of work as well when applied with moderation.\nTheir game was interrupted by a scream from another table, where one of the occupants pretended to have some kind of a medical crisis and which drew every eye in that direction. When Thrawn pointed out that one of the other occupants of that particular table was absent, Thrass noticed the man sneaking behind the café's counter with clear intention to rob the place while the cashier was busy trying to help the man suffering from the attack. Since only Thrass and Thrawn had noticed what the diversion was all about, they decided that it was up to them to prevent the thieves as the patrollers would not get there quickly enough. Thrass decided to give his friend a demonstration of how to use theatrics to turn people's attention to a new direction and stood up, calling to the man hiding behind the counter, asking if he had a spare jector that could be used to help. Having now exposed the thieves, Thrass took position between the man behind the counter and the door, while behind his back Thrawn likewise took a position where he could prevent the initial diversion team from running.\nWhen the robber pulled a knife to attack Thrass, he was prepared to use one of the chairs as a shield, but that turned out not to be necessary as the thief saw how Thrawn beat down the man who had pretended to be sick and decided that he did not want to engage the two Mitth. With the situation defused Thrass asked if one of the other patrons at the café could call the patrollers to collect the thieves and return the stolen money. After all the hustle died down, the two Mitth returned to their table to find a fresh platter of food as a thank you gift from the café's manager. Before returning to their game Thrass asked Thrawn about his combat moves and if he had learned them from his training with the fleet or if he had picked them up on his own. Thrawn answered that the fleet had given him the basics but he had later developed them further independently. Thrawn also complimented Thrass on the way he had used theatrics to do his part in dealing with the situation. As they continued their game of Tactica, Thrawn instructed Thrass in the use of a sortie option that could be employed at the game if the player's main strategy failed.\nThrass was on Naporar for a meeting in the Expansionary Defense Fleet headquarters following Thrawn's demotion to Mid Commander after the skirmish above Solitair as well as Thrawn's elevation to a Trial-born within the Mitth, and the Springhawk's assignment to him, when his return trip to Csilla was delayed and he was instead summoned to an emergency meeting within the Stybla stronghold. He was welcomed by Senior Aide Lappincyk and quickly escorted to the office of Patriarch Lamiov, where Thrawn and the head of the Stybla family were already waiting for them. Lamiov explained to the two Mitth that about five hours before their meeting, a Stybla cargo ship had been hijacked en route to Sposia and that Patriarch Thooraki had offered Thrass and Thrawn to help retrieve the wayward ship. When studying the records made of the hijacking, Thrawn concluded that the thieves were most likely from the Clarr family and Thrass suggested that Lamiov should contact Patriarch Clarr'ivl'exow to join forces in tracking down the culprits. During the meeting, Thrass noticed that Thrawn was somewhat put out by Lamiov's and Lappincyk's lack of quick observational skills. While the two Patriarchs conversed, Lappincyk escorted the two Mitth to a lounge where they could rest and work, and Thrass asked about Thrawn's reaction. Thrawn corrected that he had not been put out but disappointed in the Styblas, but Thrass pointed out that most of the other people were nowhere near as observant as Thrawn was.\nThe two Mitth then set to work in figuring out what in the ship's cargo was of particular interest to the Stybla Patriarch, and where it had come aboard, and if it also was why the hijackers had attacked the ship in the first place. They were left to work on their own for three hours, during which Thrawn mostly left the cargo tracking for Thrass, while he began to pursue another line of thought and ignored Thrass's attempts to engage him in conversation. When Patriarch Lamiov finally returned to the two Mitth, Thrass had made only a little progress in his analysis of the cargo manifests, but Thrawn in the meantime had discovered that at least one of the hijackers was a high ranking member of the Clarr and that the Stybla leader intended to sent a patrol ship to pursue them and had ordered Senior Aide Lappincyk to prepare it for their use. Thrawn promised to deliver the lost cargo to the Stybla Patriarch and Thrass realized that their mission did not only have their own Patriarch's blessing, but it had in fact been Thooraki who had suggested to Lamiov that the Stybla should employ his and Thrawn's skills in the matter. With the alliance between the Patriarch and the two Mitth confirmed, Thrawn revealed he believed that he knew where the hijackers were going and he, Thrass and Lappincyk set out in pursuit.\nTheir patrol ship, the Jandalin, arrived to Glastis 3 system twenty-seven hours after the hijackers had left it and began to search for the Stybla cargo ship that had been left drifting toward the Defense Force blackdock because the hijackers could not afford to risk any of their victims to die in fear of the terrible punishments written down to the family accords between the Clarr and the Stybla. Seeing that there was a lot of space where a partially derelict ship could be floating, Thrawn devised a plan to try and contact the Stybla freighter and instruct them to open both fuel and oxygen tanks and then ignite the mixture in order to create enough of a plume to reveal their position. Thrawn's location trick worked and soon the two Mitth along with Senior Aide Lappincyk were on board the freighter and interviewed its captain. To Lappincyk's dismay the group discovered that the the hijackers had taken every crate of cargo from the freighter, even the special cargo that had the Stybla so worried. Having listened to the captain's story, Thrawn assured the Senior Aide that he believed that he knew where the hijackers were going. The discovery, however turned out to be somewhat disconcerting as the probable target system, Pleknok, was of some interest both to the Chiss and to the Paataatus, who had fought a brief battle over the survey rights of the system nineteen years previously. Realizing that they were no longer racing only the Clarr to the system, but also Paataatus, Lappincyk hurried their departure from Glastis 3, even threatening to leave the two Mitth behind if they could not keep up with him.\nIt took thirty-two hours for the Jandalin to reach Pleknok, but since their patrol ship was much faster than the transport the hijackers used, they arrived slightly ahead of their quarry. They were also joined by a Clarr light cruiser, Orisson, commanded by Thrawn's former shipmate from Parala, Captain Roscu, who was still harboring grudge against the Mid Commander for the way he had been circumventing the Chiss non-intervention policy during the events at Stivic. Roscu attempted to order the Jandalin away, but the Senior Aide absolutely refused to leave without their cargo. Since Senior Aide Lappincyk's status was not impressive enough to pull rank on Captain Roscu, Thrass pointed out to the Stybla that since Thrawn was an active member of the Expansionary Defense Fleet as well as a member of a Ruling Family, he might be able to do so. To Thrass's surprise Lappincyk did not simply allow Thrawn to speak with Roscu, but officially relinquished the command of Jandalin to him. However, because their earlier relationship had been sour, Roscu was not willing to work with Thrawn and refused to let the Stybla take the cargo before handing the hijackers to the Clarr for punishment.\nWhen the hijackers arrived to the system, Thrawn initially wanted to observe which of the ships already in orbit they were planning to rendezvous, but a group of six Paataatus warships arrived and headed for the hijackers, whose ship had been disabled by Orisson's plasma sphere. While the presence of aliens greatly alarmed the Stybla representative, the Clarr cruiser started to back away from the situation, claiming that the only thing they could do was to destroy the hijackers's ship to prevent the Paataatus from getting the cargo, but Lappincyk did not see that as an option. Thrass was unsure if they could face a Paataatus light cruiser and five gunboats with their small patrol ship that was armed with only three spectrum lasers and two Crippler nets. Quickly Thrawn plotted a course for Jandalin that would enable them to deploy the Crippler nets in front of the approaching Paataatus ships and then lure the enemy to fly straight into them, knocking out their systems. Seeing the tricky path Thrawn had ordered for the patrol ship, Thrass was reminded of the complex maneuvering his friend had used during his time in Taharim Academy and which had led him to be accused of cheating in a training exercise.\nThrawn used the lasers from the Jandalin to take out some of the Paataatus gunboats by damaging their main drives, but did not bother to completely destroy them, while the Paataatus light cruiser and one of the remaining gunboats were taken out by the Crippler nets. When the Paataatus ships got enough and turned to run, Thrass realized that Thrawn must have anticipated all the twists and turns that had been needed to deploy the nets and take out the other gunboats, and he wondered how it was even possible to predict the course of a battle so far ahead. It was even more impressive feat because it was based only on intuition and some knowledge about a battle that had taken place some nineteen years earlier. With the Paataatus force dealt with, Captain Roscu was again on the move toward the disabled hijacker transport and with her superior firepower and larger crew to work with, the Stybla patrol ship was in a weak position to face off against the Clarr demands.\nWhile the Jandalin was poised to reach the hijackers first, Thrawn knew that Captain Roscu was ready to try anything to get her Orisson to the criminals ahead of the Stybla. The race became serious, that the Orisson launched a plasma sphere to disable the Stybla craft, but Thrawn anticipated that and ordered the pilot to execute emergency breaking to allow the plasma sphere to pass harmlessly in front of the Jandalin, before they resumed their race toward the target. Captain Roscu's decision to fire on the Stybla ship was deemed illegal by Thrass, as he was a member of a Ruling Family and part of the Syndicure, and as such held a great deal of influence. He warned Roscu to back off, but the Clarr captain was not initially ready to believe there was a Mitth Syndic on board a Stybla ship. Thrass informed the Clarr that he and Thrawn were there on the behest of Patriarch Thooraki and in the same sentence casually referred to Thrawn as his brother, indicating that Thrawn's rank among the Mitth family might be considerably higher than the merit adoptive most of the military officers were, as the Syndics in turn were never below the family status of a ranking distant. Thrass's declaration took both Roscu and Thrawn by surprise, but it had the desired effect and Roscu finally allowed the Stybla patrol ship to retrieve their stolen cargo, when Senior Aide Lappincyk in turn promised that the Clarr would be then allowed to take the hijackers and their ship and do with them as they pleased. With the reluctant deal with the Clarr finally struck, Thrass, Thrawn and Lappincyk worked with the patrol ship crew to transfer all of the Stybla's stolen cargo to Jandalin, while Roscu and the Orisson waited on the side, ready to take possession of the transport and the criminals once the cargo was back with its rightful owners. Their mission then completed, Senior Aide Lappincyk sent a report back to Patriarch Lamiov and the Jandalin turned back home, returning the stolen cargo to Naporar.\nOnce safely back in the Stybla stronghold on Naporar, Patriarch Lamiov, Senior Aide Lappincyk and the two Mitths had another meeting in the Partiarch's private office with the essentially important piece of equipment sitting in its protective cargo crate on the Patriarch's desk. For their reward Thrawn requested a permission to learn what exactly it was that they had saved, claiming that it had to be a weapon of some kind as nothing else falling into alien hands would be terrifying enough to spark as strong reaction as Senior Aide Lappincyk had demonstrated when there had been a risk of the Paataatus getting their hands on it, while at the same time being small enough to be stored in such a small box. Thrawn further pointed out that, as a warrior he worked better when he knew what kind of weaponry was available to be used. Thrass further realized that it had to be of alien making, as the cargo ship's route had been to Sposia, where the Universal Analysis Group had their headquarters and where they were specialized in studying alien artifacts, trying to reverse engineer them into something that could be used to improve the Chiss technology. At first Patriarch Lamiov was reluctant to grant their wish, but changed his mind when Senior Aide Lappincyk pointed out that the two Mitth were naturally inquisitive, and it would be much safer to tell them the whole story than let them go off and start poking at the topic on their own, where they might inadvertently break down UAG security walls the Stybla had worked so hard to build.\nLamiov then explained that thousands of years ago, when the Chiss had first explored the wider galaxy and the Stybla had been the only Ruling Family guiding the entire fledgling Ascendancy, some of their explorers had brought home a weapon known as the Starflash as well as the instructions how to use it and information about what it did. The Stybla had deemed the weapon far too dangerous to be ever used and hid it away to the Bastion, that was specifically build to protect such items and that later developed into the Universal Analysis Group. The weapon then sat quietly in the vaults for centuries, until a devastating alien attack threatened the Chiss with extinction and in desperation the Stybla turned to the weapon that had been hidden away for a long time. It was a single-use weapon and activating it would be a suicide for those operating it, but the Mitth rose to the occasion and volunteered their warriors for the task. Hearing the story explained to Thrawn what had happened to Patriarch Mitth'omo'rossodo's four sons and what had been the tragedy in her life he and Thrass had wondered so many years earlier, when they had studied her artworks in Mitth's Avidich reception room. Lamiov further explained that the success of the operation and the willing sacrifice of the Mitth were the reason their family was raised among the Ruling Families and that the event also had led to the selection of their family symbol, the blazing sun. Thrass found it both ironic and painful that the event had in fact led to the diminishing of energy output from Csilla's star, making the actual star less blazing, and then commemorating it in their family crest.\nThrawn then wanted to see the actual item they had saved and Lamiov allowed it, explaining that the Stybla had salvaged what they could of the Starflash and studied its pieces on occasion, trying to find less devastating uses for it. Thrass accepted the Patriarch's word for it, but Thrawn pointed out that the piece they had in front of them had not come from anything torn apart by violence and that the broken down outer bits were nothing but camouflage hiding the fact that the actual item was still fully functional. Lamiov admitted that the Mid Commander was correct and that the Stybla were indeed in possession of a second Starflash, and that the tachyon flow synchrotron accelerator the group had recovered had indeed come from that. The Patriarch then explained that while all the Patriarchs of the Ruling Families and their Senior Aides knew about the history of the Starflash, the only people who knew about the existence of the second weapon, that they strictly referred to only as \"the second item\", were the Stybla Patriarch and his Senior Aide as well as the very top of the Defense Force personnel, at the current time those being Supreme General Ba'kif and Supreme Admiral Ja'fosk. So with Thrass and Thrawn now included in the secret, there where total of six people in the entire Chiss Ascendancy who knew about the functional Starflash hidden away in the most secure of UAG vaults.\nWith their mission completed, Thrawn was preparing to head to the Springhawk, which had been forced to wait on its new commander for a long time, but Patriarch Lamiov asked the two of them to remain a few hours longer as the Stybla Patriels and couple of other dignitaries were gathering for a special ceremony to reward Thrawn for his part in recovering the wayward piece of important technology. Lamiov explained that the Stybla were prepared to offer Thrawn to add appellation odo to his name, which in Tybroic, the old family language of the Stybla, meant a guardian or protector. While Thrawn understood the honor involved, he was somewhat unsure if the Mitth leadership would approve such a name change, but the Patriarch assured him he would have an opportunity to learn that from Mitth Patriarch Thooraki himself, as he was one of the guests who would be attending the ceremony.\nWhile waiting for the ceremony to begin, Thrass asked Senior Aide Lappincyk how many others had been granted the right to use the odo appellation in their name and was told that Thrawn was the ninth non-Stybla who had earned such a rare honor, and that the appellation was not that common even among the Stybla themselves. The ceremony itself Thrass found to be far deeper than any of the other ceremonies he had attended over the years, while it still reminded him of the welcoming rituals the Mitth performed. The number of guests was also very limited, the entire group consisting of only eighteen people. After the official proceedings were over Thrass noticed that the Stybla Patriels, who had arrived for the ceremony while outwardly polite, did not really care about who he was or why he was there. He was then joined by Patriarch Thooraki, who inquired after Thrass's mother's well-being and consequently reminding him that Thrass had been somewhat neglecting his mother, only talking with her for brief moments. Nevertheless Thrass promised to pass on Thooraki's greeting when he was next in contact with her.\nThooraki then asked if Thrass was wondering why it had been only Thrawn and not Thrass as well, who had been granted the odo appellation, but Thrass confessed that such a thought had not even occurred to him as he felt that he had done very little. Thooraki showed appreciation for Thrass's humility, but pointed out that he and Lamiov had in fact considered it. Thrass initially thought that his status in the Syndicure and as a Mitth cousin were the reason, why the two Patriarchs had decided not to do so, but Thooraki pointed out that if one of the most legendary Mitth Patriarchs, Mitth'omo'rossodo the Tragic, could carry a Stybla honorific in her name there was no reason for a Mitth cousin to fear adding it to theirs. The Patriarch then further explained that the reason Thrass had not been included, was that he and Lamiov did not want to draw too much attention to the fact that Thrawn and Thrass were working as a team. Thooraki then further expressed his approval of Thrass's decision to declare Thrawn as his brother, although it led to Thrass suspecting that the two Patriarchs had been pulling his strings from the start, all the way back when Thooraki had sent him to block Lappincyk's attempt to rematch Thrawn to the Stybla. While the Patriarch confessed that he had been trying to give Thrass a little nudge toward Thrawn, he also pointed out that no one could force others to build bonds of friendship or brotherhood, like the one that had formed between the two young men.\nSeeing that Thrawn had been cornered by some Stybla Patriels and was clearly becoming uncomfortable with their attention, the Mitth Patriarch sent Thrass to the rescue and offered his own shuttle to take Thrawn up to the Springhawk and return Thrass to his duties on Csilla. As a way of goodbye to the young Syndic, the Patriarch expressed his belief that Thrass and Thrawn could carry the Mitth family to new heights they had never enjoyed before. Thrass then collected his team mate and the two of them said their goodbyes to Lamiov and Lappincyk before walking to the landing field where Thooraki's shuttle was waiting for them.\nThrass recognized that something was bothering his friend, and knowing that since Thrawn's mission would take him far away they might not have an opportunity to speak privately for a long time, decided to ask what it was that was weighing on Thrawn's mind. His first guess, that it was the name change to Mitth'raw'nuruodo, turned out to be inaccurate as was his second assumption that Thrawn was worried about the Starflash sitting in the UAG headquarters on Sposia. Thrawn's problem, it turned out, was Thrass's casual naming of him as his brother during their standoff with Roscu, as it was not proper protocol for a family cousin to select a newly minted Trial-born as such close relative. Thrawn tried to explain the whole thing away by calling it a convenient lie for tactical advantage, but Thrass stood firm in his decision to recognize the family link between them. He then offered to trade secrets with his new brother, telling Thrawn what sort of a special arrangement had surrounded his birth and how Thooraki had falsified the documents in order to make Thrass a cousin instead of a ranking distant he should have been.\nHaving told his story, Thrass asked Thrawn to tell him, what dark memories had haunted the young cadet on the day they first met, as Thrass had noticed that there had been some kind of hidden pain lurking somewhere just under the surface. Thrawn then told him about his sister, who had mysteriously disappeared when Thrawn had been three years old and she had been five, and that Thrawn's rematching dinner had simply been arranged for the same day that had been her starday, and that was why her memory had been so close to his mind on that particular occasion. When Thrass asked if she had died, Thrawn replied that he believed that had not been the case, but did not express his suspicion that she had been taken away to skywalker-training. Thrass then offered to use his position in the Syndicure to try and track down Thrawn's sister as there had to be records somewhere about what happened to her, but the officer refused the offer, stating that one day he would find the time to make the attempt himself. The two of them then briefly discussed about what the Defense Council expected Thrawn and the Springhawk to find out in the Chaos. Thrass was privately amused by the thought of them as \"brothers-in-arms\" working together to increase Mitth's influence both in Syndicure and among the military, as well as working to make the Ascendancy a better place for all.\nDespite Thrawn's request to leave the matter alone, Thrass began to collect information about Thrawn's sister. His search finally led him to a woman named Irizi'rik'ardok, who had been born as Kivu'rik'ardok and who had been adopted to the Irizi family after her tenure in the Sky-walker corps. His search also uncovered some rather unsavory details about the way the sky-walkers were trained, all of which he stored on a data cylinder. After his meeting with Irizi'rik'ardok, Thrass kept an eye on her movements, making a note of her marriage to Bomarmo and her relocation to Ardok Ranch on the Chiss Ascendancy farming world Ool, that served as a cover for a Seekers' Shadehouse, one of the secret locations where the sky-walkers were trained.\nIn the Syndicure, Thrass also worked directly under the Mitth Speaker. When conversing with Syndic Prime Thurfian, Speaker Mitth'ykl'omi later compared Thurfian to Thrass, saying that both of them were skilled at appearing to give people what they wanted, while at the same time actually doing what needed to be done. Thyklo pointed out that in her opinion Thurfian was even better at giving that appearance than Thrass had been.\nWhile Patriarchs Thooraki and Lamiov had chosen not to draw attention to Thrass's close friendship with Thrawn by giving them both the odo honorific, the information about the bond between them spread at least as far as to the Irizi and Syndic Irizi'stal'mustro was aware of it. During one of their clandestine meetings in the March of Silence, Zistalmu referred to it when speaking with his fellow conspirator, Thurfian. Thurfian responded that he had also heard the rumors, but could not recall ever having seen Thrass and Thrawn together as their duties in the Syndicure and Expansionary Defense Fleet did not overlap.\nAt some point before 19 BBY Thrass became involved with Thrawn's operations against Vagaari pirates. Before his departure, Thrass delivered the data cylinder containing the information he had gathered about the sky-walker program to Patriarch Thooraki for safe-keeping. During the operations Thrawn succeeded in capturing a gravity-well generator, which was delivered to the UAG for study, but the operations also led to Thrass's demise.\nWhen a task force part of the Chiss Chaf family attempted to lay claim on a massive starship from Lesser Space that had gotten involved in the action, Thrass helped a human pilot to spirit the ship away. Their initial plan had been to hide the ship away to an uninhabited system and then offer its technology to the Hierarchy Defense Council, but the severe damage the ship had suffered prevented them from reaching their hoped goal, and the discovery of a group of survivors that were still aboard had made the matters more complicated. The only option Thrass and his companion had left was to crash the ship, which would result in both of them dying in order to protect the other people that were still aboard. The pilot offered to help Thrass escape the devastation, but they soon realized that the suggestion would not work and both of them accepted their inevitable death.\nBefore his death, Thrass thought about his father, who had sacrificed his life to save a man he did not know, and how he would be sacrificing his own in a similar manner in order to save people who did not know him. He knew that his actions, while honorable, would bring no glory to the Mitth or to the Ascendancy. He also thought about the words of the oath of secrecy he and Thrawn had been demanded to give to the Stybla, and wondered if there was indeed something beyond the grave. In his last moments Thrass expressed a wish that one day humans and Chiss might find a way to work together in peace. When the ship approached the stone-filled valley they had deemed to be the least destructive crash site, Thrass saved his last thought for his brother, hoping that the warrior's fortune would smile on him.\nThrass's death, combined with the loss of the Lesser Space starship and the unauthorized nature of Thrawn's actions against the Vagaari, angered the Hierarchy Defense Council as well as the Syndicure, and consequently Thrawn was removed as the commander of the Springhawk, and the ship was handed to Mid Captain Ufsa'mak'ro. Some members of the Aristocra, including Thurfian, openly blamed Thrawn for Thrass's death, while others, like Thyklo, saw his loss being more due to circumstances than on any failure on Thrawn's part. Even by the following year, the memory of Thrass was fresh in the minds of many of the Aristocra's members, and while plotting to take down Thrawn with Syndic Prime Thurfian even Zistalmu recognized the loss the Mitth had suffered when Thrass disappeared.\nAfter speaking with Caregiver Mitth'ali'astov  during her Trials, Patriarch Thooraki was very impressed by the young woman, and before his death, the Patriarch instructed his Senior Aide, Mitth'iv'iklo, to hand over the sky-walker data Thrass had compiled to Thalias, who herself was a former ozyly-esehembo or sky-walker. She followed Thrass's data to Ool, where she met with Thrawn's sister, Borika, and learned how the girls taken from their families to become sky-walkers had their family memories removed during the training, and how each new Patriarch had to give their approval to the process for it to continue. Thalias later used that knowledge to threaten Patriarch Thurfian with exposure and public anger over the issue to get him to listen to Thrawn's plea of assistance for his last stand over the planet Sunrise. The preemptive action against the Grysks Thrawn took over Sunrise violated the laws of the Chiss Ascendancy and while a number of military officers of the Expansionary Defense Fleet saw them as necessary, Thrawn was brought up on charges.\nSupreme General Ba'kif came up with the idea to send Thrawn into exile, while the Senior Captain himself suggested that the Ascendancy military could use that as a cover story to send him to gather information about the new Galactic Empire that had recently risen into prominence in the Lesser Space. Thrawn was publicly stripped of his military rank and family status, although he was allowed to remain as a member of the Mitth family, and then given two days on Csilla to set his affairs into order before he would be taken to the planet that had been chosen for his exile. On his last day on Csilla, Thrawn had a private meeting with Admiral Ar'alani and General Ba'kif, during which the admiral was filled in on the plan, so she would not make any protests or demands to get Thrawn back to the Ascendancy. After Ar'alani's departure, Ba'kif offered Thrawn back the medal he had gotten from the Stybla during the odo ceremony as well as the Marocsaa subclan ring Thrawn had received from Uingali foar Marocsaa, a Paccosh leader who had become Thrawn's ally in the battles against the Grysks. Thrawn asked the general to keep the medal safe for him, but accepted the ring as a keepsake. Ba'kif then asked if Thrawn would like to share one last meal with him, but he refused, stating that he would rather spend the time alone in the bistro, where he had often gone with Thrass and dedicate the time to remembering his brother. He also complimented the general of the exile plan, stating that it used theatrics as a diversion as well as to direct the opponent's attention elsewhere in a way Thrass would have found laudable.\nA Chiss male, Mitth'ras'safis had black hair, red eyes, and blue skin. In his youth Thrass was very self-conscious of his family status, and felt guilty when introducing himself as a cousin, but by 39 BBY he had gotten used to it. He was eager to prove himself useful to the Mitth and willing to accept reprimands for his failures. Unlike most of his friends, Thrass enjoyed the task of welcoming new merit adoptives and was interested to see if he could figure out why a given merit adoptive had been deemed worthy to be added to the family. Even a bit against his will, Thrass found himself impressed by Thrawn's ability to make accurate deductions from artworks. After confirming that the young cadet's reading of the art was correct, Thrass was curious to see what else Thrawn would have been able to tell him about the other pieces of art displayed at Avidich compound.\nThrass was modest of his own contributions to the mission to retrieve the tachyon flow synchrotron accelerator and expressed surprise when Patriarch Thooraki suggested that he might be wondering why he had not received the odo honorific the Stybla had rewarded to Thrawn. He also had rather ironic sense of humor, mocking himself for allowing Thrawn to talk him into learning to play Tactica, which was better suited for Thrawn's military skills than Thrass's political abilities.\nThrass was skilled at employing theatrics to distract an opponent or to direct their attention elsewhere, he found a use for it during his service in the Syndicure but believed that it could be useful for any line of work with moderation. He was also good at appearing to give people what they wanted, while at the same time doing what he believed needed to be done. He used the skill to blunt Syndic Thurfian's attempt to prove Thrawn had acted inappropriately during the Stivic incident.\nThrass was good at reading people's moods and knew when it was good time to use persuasion and when it was better to remain silent and let the others make up their own mind. He also knew when not to intrude upon others' privacy, like when he recognized a hidden pain of loss Thrawn was carrying during their first meeting, but chose not to press the new acquaintance for information.\nAt the time that he knew Thrawn, Thrass wore clothing that was colored dark grey and yellow, as well as a red belt. He carried a questis data-link reader.\nIn the new Star Wars canon, Mitth'ras'safis was first mentioned in the 2020 novel Thrawn Ascendancy: Chaos Rising, the first instalment of Star Wars: The Ascendancy Trilogy written by Timothy Zahn. The character's core name of Thrass was revealed in the second installment, Thrawn Ascendancy: Greater Good, released in 2021. He first appeared in the final novel of the series, Thrawn Ascendancy: Lesser Evil, which was released on November 16, 2021. Thrass was pictured in a poster included in the Barnes \u0026 Noble exclusive edition of Lesser Evil, which was created by Jeremy Wilson and revealed in the leadup to the book's release on October 15.\nFollowing Chaos Rising, the possibility of the series continuing the \"Memories\" flashback chapters was undecided; however, after they were brought back for Greater Good, it was determined that the trilogy would furthermore need to close with them, and Zahn suggested Thrass as the subject of the chapters in Lesser Evil.\nIn the Star Wars Legends continuity, the unidentified remains of Mitth'ras'safis appeared in Zahn's 2004 novel Survivor's Quest aboard the Outbound Flight, a Central Storage Core and six Dreadnaught-class heavy cruisers, while the 2006 novel Outbound Flight, also written by Zahn, identified and formally introduced the character. That novel also established Thrass as the brother of Thrawn's Legends counterpart. Many elements of Thrass' Legends biography were adopted into Canon, including Thrass dying aboard a starship from coreward of the Unknown Regions in the aftermath of a battle involving the Vagaari and Thrawn's task force, as well as Thrawn's acquisition of a gravity well projector from the campaign.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mitth%27ras%27safis",
  "/wiki/Mitth%27ras%27safis/Legends",
  "/wiki/Chiss",
  "/wiki/Thrass",
  "/wiki/19_BBY",
  "/wiki/Unidentified_Lesser_Space_starship",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Mitth_family",
  "/wiki/Chiss_Syndicure",
  "/wiki/Core_name",
  "/wiki/Syndic",
  "/wiki/Cousin",
  "/wiki/39_BBY",
  "/wiki/Aristocra",
  "/wiki/Rematching",
  "/wiki/Cadet",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Standard_year",
  "/wiki/Patriarch",
  "/wiki/Mitth%27oor%27akiord",
  "/wiki/Supreme_General",
  "/wiki/Ba%27kif",
  "/wiki/Stybla_family",
  "/wiki/Stybla%27mi%27ovodo",
  "/wiki/Politics",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Tachyon_flow_synchrotron_accelerator",
  "/wiki/Starflash",
  "/wiki/Weapon",
  "/wiki/Senior_Aide",
  "/wiki/Stybla%27ppin%27cykok",
  "/wiki/Vagaari_pirate_operations",
  "/wiki/Vagaari",
  "/wiki/Pirate",
  "/wiki/Gravity_well_projector",
  "/wiki/Lesser_Space",
  "/wiki/Starship",
  "/wiki/Chaf_family",
  "/wiki/Unidentified_human_female_(Lesser_Space)",
  "/wiki/Death",
  "/wiki/Defense_Hierarchy_Council",
  "/wiki/Aristocra_(organization)",
  "/wiki/File:Mitth_symbol.svg",
  "/wiki/Reproduction",
  "/wiki/Parent",
  "/wiki/Unidentified_minor_Chiss_family",
  "/wiki/Mitth%27ras%27safis%27s_father",
  "/wiki/Standard_week",
  "/wiki/Assassin",
  "/wiki/Mitth_family_homestead",
  "/wiki/Mitth%27ras%27safis%27s_mother",
  "/wiki/Csilla",
  "/wiki/Homeworld",
  "/wiki/Ranking_distant",
  "/wiki/Avidich",
  "/wiki/Mitth_family_artworks",
  "/wiki/Merit_adoptive",
  "/wiki/Rematching_dinner",
  "/wiki/Time",
  "/wiki/File:LesserEvil-BN.jpg",
  "/wiki/Kivu_family",
  "/wiki/Rentor",
  "/wiki/Taharim_Academy",
  "/wiki/Artist",
  "/wiki/Mitth%27omo%27rossodo",
  "/wiki/Final_Assault_on_Csilla",
  "/wiki/Patriel",
  "/wiki/Naporar",
  "/wiki/Irizi_family",
  "/wiki/Unidentified_Irizi_Patriel",
  "/wiki/Mitth%27raw%27nuru%27s_cheating_charge",
  "/wiki/General",
  "/wiki/Senior_Cadet",
  "/wiki/Ar%27alani",
  "/wiki/Officer",
  "/wiki/File:Chaos-Rising-OOP-Art.png",
  "/wiki/37_BBY",
  "/wiki/Lieutenant",
  "/wiki/Unidentified_bistro_(Naporar)",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Standard_month",
  "/wiki/Pirate_attack_at_Stivic",
  "/wiki/Mitth%27urf%27ianico",
  "/wiki/Patrol_cruiser",
  "/wiki/Parala",
  "/wiki/Unidentified_Mitth_syndic",
  "/wiki/Mid_Captain",
  "/wiki/Clarr%27os%27culry",
  "/wiki/Modulated_laserfire",
  "/wiki/Laser",
  "/wiki/Trade_language",
  "/wiki/Taarja",
  "/wiki/Sy_Bisti",
  "/wiki/Minnisiat",
  "/wiki/Meese_Caulf",
  "/wiki/Garwian",
  "/wiki/Stivic",
  "/wiki/Unidentified_bistro",
  "/wiki/Chiss_Defense_Force",
  "/wiki/Tactica",
  "/wiki/Jaraki",
  "/wiki/Pontriss",
  "/wiki/Med-relief_jector",
  "/wiki/Knife",
  "/wiki/Foodstuff",
  "/wiki/Skirmish_above_Solitair",
  "/wiki/Trial-born",
  "/wiki/Springhawk",
  "/wiki/Stybla_stronghold",
  "/wiki/Standard_hour",
  "/wiki/V-484",
  "/wiki/Sposia",
  "/wiki/Mission_to_Pleknok",
  "/wiki/Clarr_family",
  "/wiki/Clarr%27ivl%27exow",
  "/wiki/Patrol_ship",
  "/wiki/Jandalin",
  "/wiki/Glastis_3",
  "/wiki/Blackdock",
  "/wiki/Fuel",
  "/wiki/Oxygen",
  "/wiki/Unidentified_Stybla_freighter_captain",
  "/wiki/Pleknok",
  "/wiki/Paataatus",
  "/wiki/Skirmish_in_the_Pleknok_system",
  "/wiki/File:LesserEvil-OOP-Art.jpg",
  "/wiki/Transport",
  "/wiki/Light_cruiser",
  "/wiki/Orisson",
  "/wiki/Non-intervention_policy",
  "/wiki/Warship",
  "/wiki/Plasma_sphere",
  "/wiki/Alien",
  "/wiki/Gunboat",
  "/wiki/Spectrum_laser",
  "/wiki/Crippler_net",
  "/wiki/Unidentified_Stybla_pilot",
  "/wiki/Universal_Analysis_Group",
  "/wiki/The_galaxy",
  "/wiki/Bastion_(Chiss)",
  "/wiki/Csilla%27s_star",
  "/wiki/Supreme_Admiral",
  "/wiki/Ja%27fosk",
  "/wiki/Vault_Four",
  "/wiki/Tybroic",
  "/wiki/Cohbo%27rik%27ardok",
  "/wiki/Starday",
  "/wiki/Sky-walker",
  "/wiki/Chaos",
  "/wiki/File:ChissAscendancyCanonSymbol.svg",
  "/wiki/Sky-walker_corps",
  "/wiki/Code_cylinder",
  "/wiki/Bomarmo",
  "/wiki/Ardok_Ranch",
  "/wiki/Ool",
  "/wiki/Seekers%27_Shadehouse",
  "/wiki/Speaker_(Chiss_Ascendancy)",
  "/wiki/Syndic_Prime",
  "/wiki/Mitth%27ykl%27omi",
  "/wiki/Irizi%27stal%27mustro",
  "/wiki/March_of_Silence",
  "/wiki/Unidentified_Chaf_task_force",
  "/wiki/Human",
  "/wiki/File:GreaterGood-OOP-Art.jpg",
  "/wiki/Ufsa%27mak%27ro",
  "/wiki/18_BBY",
  "/wiki/Caregiver",
  "/wiki/Mitth%27ali%27astov",
  "/wiki/Trials",
  "/wiki/Mitth%27iv%27iklo",
  "/wiki/Senior_Captain_Thrawn%27s_last_stand",
  "/wiki/Planet",
  "/wiki/Sunrise",
  "/wiki/Grysk",
  "/wiki/Exile_(punishment)",
  "/wiki/Senior_Captain",
  "/wiki/Galactic_Empire",
  "/wiki/Unidentified_planet_(Thrawn%27s_exile)",
  "/wiki/Admiral",
  "/wiki/Marocsaa_subclan_ring",
  "/wiki/Uingali_foar_Marocsaa",
  "/wiki/Paccosh",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Questis_data-link_reader",
  "/wiki/File:Outboundship.jpg",
  "/wiki/Star_Wars",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/November_16",
  "/wiki/Jeremy_Wilson",
  "/wiki/October_15",
  "/wiki/Star_Wars_Legends",
  "/wiki/2004",
  "/wiki/Survivor%27s_Quest",
  "/wiki/Outbound_Flight",
  "/wiki/Central_Storage_Core",
  "/wiki/Dreadnaught-class_heavy_cruiser",
  "/wiki/2006",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Battle_of_the_Geroon_homeworld",
  "/wiki/Vagaari/Legends",
  "/wiki/Picket_Force_Two/Legends",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Mitth%27ras%27safis",
  "/wiki/Template:ChaosRisingDate",
  "/wiki/Standard_decade",
  "/wiki/Navigator",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Tomra",
  "/wiki/Template:WhenThrassMetThrawn",
  "/wiki/Tom_Hoeler"
 ]
}