{
 "name": "Mixer",
 "display_name": "Mixer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "aboard the Coronet"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Mixer\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars. In 21 BBY, Mixer joined fellow trooper Redeye as part of a Republic escort team assigned to protect the Mandalorian Duchess Satine Kryze aboard her Nau'ur-class yacht, the Coronet. Mixer was ordered to prevent any attempt on Kryze's life by the Mandalorian Death Watch. While patrolling the Coronet's cargo hold, both clones were killed by an assassin droid as part of Senator Tal Merrik's failed plot to kill Kryze.\n\"Mixer\" was the nickname of a clone trooper who was created on the planet Kamino to serve the Galactic Republic's Grand Army during the Clone Wars against the Confederacy of Independent Systems. In 21 BBY, Mixer was part of a Republic escort team led by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker that was tasked with guarding Duchess Satine Kryze of the planet Kalevala due to concerns of an assassination attempt on her by the Mandalorian terrorist organization known as Death Watch. Kryze was traveling aboard her Nau'ur-class yacht, the Coronet, to plead her people's neutrality in the war before the Galactic Senate. The escort team was placed on high alert and assigned to various patrol routes aboard the yacht. Mixer and his partner, Redeye, monitored the cargo area, and they began their sweep accompanied by Skywalker's astromech droid, R2-D2.\nThe two clones separated as Redeye began checking the cargo bay's south quadrant while Mixer surveyed the opposite side. As Redeye began his search, a SD-K4 assassin droid, smuggled aboard the yacht by the traitorous senator and Death Watch agent Tal Merrik in an attempt on Kryze's life, attacked and killed the clone. When Mixer attempted to contact his friend via comlink to check in, he received no response. Just then, Redeye's abandoned DC-15A blaster carbine suddenly fell to the ground at Mixer's feet. Mixer picked up the weapon in perplexity, only to be ambushed from behind by the spiderlike assassin droid and killed as well.\nR2-D2 soon happened upon Mixer's empty helmet lying on the cargo bay's ground and then ran into clones Rex and Cody, who had come to investigate. Finding that contact with Mixer and Redeye had been lost, the Republic escort team realized that something was amiss and soon uncovered Merrik's assassination plot, which it proceeded to foil.\nAs a human clone of the bounty hunter Jango Fett, Mixer stood 1.83 meters tall. He displayed a wry sense of humor when patrolling the Coronet's cargo bay with Redeye, teasing his friend about not being afraid of the dark.\nAs a trooper in the Grand Army of the Republic, Mixer wore a set of Phase I clone trooper armor. His helmet was customized with blue crescent markings, while his arm plates bore blue stripes. While patrolling the Coronet's dark cargo bay, he utilized the pair of flashlights affixed to his helmet and also attempted to communicate with his friend Redeye with the wrist comm attached to his left arm plate. Mixer carried a DC-15A blaster carbine.\nMixer appeared in \"Voyage of Temptation,\" the thirteenth episode in Season Two of the Star Wars: The Clone Wars animated television series. The episode aired on February 5, 2010. Like all clone troopers in the series, Mixer was voiced by Dee Bradley Baker. Mixer's armor design was also used briefly on several clone troopers in the episode \"ARC Troopers\" in the third season of Star Wars: The Clone Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Mixer",
  "/wiki/Mixer/Legends",
  "/wiki/Kamino",
  "/wiki/21_BBY",
  "/wiki/Coronet",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/File:AnakinMissingDinner-VoT.ogg",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Wars",
  "/wiki/Trooper",
  "/wiki/Redeye",
  "/wiki/Mandalorian",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Nau%27ur-class_yacht",
  "/wiki/Death_Watch",
  "/wiki/Death",
  "/wiki/SD-K4_assassin_droid",
  "/wiki/Senator",
  "/wiki/Tal_Merrik",
  "/wiki/Skirmish_aboard_the_Coronet",
  "/wiki/File:RedeyeDoYouCopy-VoT-Updated.ogg",
  "/wiki/Planet",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Kalevala",
  "/wiki/Terrorist",
  "/wiki/Galactic_Senate",
  "/wiki/Yacht",
  "/wiki/R2_series_astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Treason",
  "/wiki/Comlink",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Limb",
  "/wiki/Spider",
  "/wiki/Assassin",
  "/wiki/Droid",
  "/wiki/Rex",
  "/wiki/CC-2224",
  "/wiki/File:VeryFunnyMixer-VoT.ogg",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Armor",
  "/wiki/Color",
  "/wiki/Plastoid",
  "/wiki/Glowrod",
  "/wiki/Wrist_comm",
  "/wiki/Blaster_carbine",
  "/wiki/Voyage_of_Temptation",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/February_5",
  "/wiki/2010",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/ARC_Troopers",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/StarWars.com",
  "/wiki/Category:Audio_files_of_Mixer",
  "/wiki/Category:Images_of_Mixer",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Lethal_Trackdown",
  "/wiki/Standard_year",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Starships_and_Speeders"
 ]
}