{
 "name": "Moa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Moa was a Human male who lived during the Galactic Civil War. He was present in Mos Eisley, on the planet Tatooine, after the Battle of Yavin.\nMoa was a non-player character  in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Moa was added to the game with the release of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005.\nMoa was intended to be part of the cancelled Valarian Themepark. This questline was initially planned to be introduced in the game with the \"Publish 23\" to replace the original \"Valarian Quest Series.\" Although the old \"Valarian Quest Series\" was deactivated with the release of Publish 23 on August 31, 2005, the new Themepark was never activated. NPCs of the Valarian Theme Park such as Moa were implemented into the game but they were not involved in any quest. Unused game files pertaining to this questline indicated that Moa was intended to be part of a new quest named \"Parry.\" In this quest, Lady Valarian's henchman Moa tasked a spacer with crafting CDEF blaster pistols for the Valarian gang.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Mighty_Oak_Apocalypse",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/August_31",
  "/wiki/Lord/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/CDEF_blaster_pistol",
  "/wiki/Valarian_Syndicate",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit"
 ]
}