{
 "name": "Moebin Faltus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "Moebin Faltus was a Togruta male who worked as a smuggler on the black market, smuggling fugitives of the First Order military regime for a high price. Between 34 ABY and 35 ABY, Faltus was hired by the Resistance military force to provide contacts in exchange for safe passage to Prahvin. Faltus rode on the Millennium Falcon, alongside Rey, Finn, BB-8, and Chewbacca on the way to Prahvin.\nMoebin Faltus was a Togruta male who smuggled fugitives of the First Order for a high price on the black market. Between 34 ABY and 35 ABY, Faltus was offered safe passage to Prahvin in exchange for contacts by the Resistance. Faltus' passage was on the Millennium Falcon alongside Rey, Finn, BB-8, and Chewbacca.\nWhile riding on the Falcon, the freighter began to experience difficulties which Rey diagnosed as a misalignment with the engine coupling. Faltus did not like the Falcon, believing it to be too old and ugly but was reprimanded by Finn and Rey on multiple occasions.\nRealizing the problem to be more serious than previously thought, Rey decided to make an immediate repair stop on the planet Choss, much to the annoyance of Faltus. After landing, Finn and Chewie stayed back on the starship while Faltus, Rey, and BB-8 went to a city to locate a new static charge dissipator.\nWalking through the city, Faltus asked multiple vendors if they had they tool the Falcon needed but was turned away each time. Faltus got into an argument with a Talz vendor, causing him to storm off. Rey told Faltus to wait, sensing something was wrong. Rey realized that the duo was being watched and went to locate who it was while Faltus followed. Rey was stopped by the bounty hunter Kief Varris, who was hired by the First Order to capture Faltus.\nA chase ensued throughout the city with Rey and Faltus evading the Varris throughout the market. The chase continued on the roofs of the city as Varris began to catch up. Varris then grappled across the street and intercepted Rey, Faltus, and BB-8. Varris used his grappling hooks to throw Rey aside and then tied Faltus up, taking him captive.\nRey then recovered and confronted Varris. Rey attempted to distract Varris with lies about Faltus escaping many legendary bounty hunters, while BB-8 but Faltus loose. Faltus then got up and tackled Varris to the ground but Varris recovered and grabbed his face. Rey then came up with a new idea and allowed for Varris to capture Faltus. Varris marched Faltus through the city and to his starship with Rey and BB-8 closely following behind. The two barely made it on the ship as it took off.\nRey met with Faltus who was tied up and began to untie him. Faltus was Rey to stun Varris with her blaster because Varris had taken his. But just then Varris confronted Rey and considered bringing them to the Hutts. Just then BB-8 ripped out the static charge dissipator which caused the ship to crash into the forest below. Faltus was able to escape the ship before its crash.\nThe trio eventually met up with the Falcon but without the dissipator the ship could not make it to Prahvin. But BB-8 had taken the part from Varris' ship, allowing for the Falcon to complete its repairs and for the trip to Prahvin to continue.\nFaltus had orange skin with white markings and purple montrals and lekku. Faltus could get annoyed very easily as seen when he learned about the needed repair stop.\nThe smuggler wore a hand stitched red suit with white on the sides and yellow on the collar. Along with white gloves, Faltus also wore black boots.\nFaltus appeared in the comic story \"Repair Stop\" in the thirteenth issue of the 2020 Star Wars Adventures comic series. It was written by George Mann, illustrated by Butch Mapa and Charlie Kirchoff, and published by IDW Publishing on December 29, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Togruta",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Smuggler",
  "/wiki/Black_market",
  "/wiki/First_Order",
  "/wiki/34_ABY",
  "/wiki/35_ABY",
  "/wiki/Resistance",
  "/wiki/Prahvin",
  "/wiki/Millennium_Falcon",
  "/wiki/Rey_Skywalker",
  "/wiki/Finn",
  "/wiki/BB-8",
  "/wiki/Chewbacca",
  "/wiki/Freighter",
  "/wiki/Engine_coupling",
  "/wiki/Planet",
  "/wiki/Choss",
  "/wiki/Starship",
  "/wiki/Unidentified_city_(Choss)",
  "/wiki/Static_charge_dissipator",
  "/wiki/City",
  "/wiki/Talz",
  "/wiki/The_Force",
  "/wiki/Bounty_hunter",
  "/wiki/Kief_Varris",
  "/wiki/Grappling_hook",
  "/wiki/Stun",
  "/wiki/Hutt",
  "/wiki/Forest",
  "/wiki/Montral",
  "/wiki/Lekku",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Repair_Stop",
  "/wiki/Star_Wars_Adventures_(2020)_13",
  "/wiki/2020",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/George_Mann",
  "/wiki/Butch_Mapa",
  "/wiki/Charlie_Kirchoff",
  "/wiki/IDW_Publishing",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/Repair_Stop,_Part_II",
  "/wiki/Star_Wars_Adventures_(2020)_14",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year"
 ]
}