{
 "name": "Moggee",
 "display_name": "Moggee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "A sentient species"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink",
      "blueish"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gatto Gang"
     ]
    }
   ]
  }
 ],
 "content": "Moggee was a member of a sentient species who was part of the criminal trio known as the Gatto Gang alongside Sylvestarr and Ziggee. During the Imperial Era, the trio owed money to Duke Blazor of Black Sun and was subsequently hunted by the bounty hunter assassin droid IG-88. Moggee attempted to set a trap for IG-88 with energy binders, but the droid did not fall for the trick, capturing Moggee along with the rest of the gang.\nMoggee was a member of a sentient species who, along with Sylvestarr and Ziggee, formed a trio of criminals known as the Gatto Gang. During the reign of the Galactic Empire, the gang owed a large sum of money to Duke Blazor of the Black Sun criminal syndicate. The duke thus hired the assassin droid bounty hunter IG-88 to capture them for him on a rocky astronomical object.\nAfter locating the gang, IG-88 chased them through a busy market until he singled out Moggee. Realizing that IG-88 was on their tail, Moggee ran into a building, bragging about their plan to shock the bounty hunter and referring to him to as \"iron pants.\" Inside, Moggee moved energy binders close together in order to slow down IG-88. Unbeknown to Moggee, a piece of metal laid on the ground in front of the energy binders. As IG-88 entered the building, Moggee went to a hiding place to activate the energy binders while continuing to call the droid names.\nIG-88 discovered the metal and left the area as Moggee activated the binders. When the binders did not work as planned, Moggee went out from the hiding spot to investigate, believing IG-88 to be gone. However, IG-88 sneaked by and activated the binders, shocking Moggee and knocking the criminal unconscious. Moggee eventually woke up after the droid collected the remaining members of the Gatto Gang. At some point between 34 ABY and 35 ABY, the monster droid CR-8R told the cartographer Emil Graf of IG-88's hunt for the criminal trio.\nMoggee had pink and blueish skin and yellow eyes. The criminal had an overconfident attitude, which led them to underestimate IG-88 and ultimately allowed for him to capture them.\nWhile hunted by IG-88, Moggee wore a long-sleeved blue shirt and pants paired with black boots and a black vest over the shirt. The criminal also donned a hat with light and dark blue stripes.\nMoggee appeared in the story \"Tales from Wild Space: IG-88 vs. the Gatto Gang,\" which was featured in the ninth issue of the anthology comic-book series Star Wars Adventures. The story was written and illustrated by Nick Brokenshire and published by IDW Publishing on April 18, 2018. Moggee's name was identified via the Aurebesh writing system in the comic story.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_species_(IG-88)",
  "/wiki/Color",
  "/wiki/Gatto_Gang",
  "/wiki/Sentience",
  "/wiki/Sylvestarr",
  "/wiki/Ziggee",
  "/wiki/Imperial_Era",
  "/wiki/Currency",
  "/wiki/Duke",
  "/wiki/Blazor",
  "/wiki/Black_Sun",
  "/wiki/Bounty_hunter",
  "/wiki/IG-88_assassin_droid",
  "/wiki/IG-88B",
  "/wiki/Energy_binder",
  "/wiki/Droid",
  "/wiki/Galactic_Empire",
  "/wiki/Gender",
  "/wiki/Unidentified_astronomical_object_(IG-88)",
  "/wiki/Unidentified_market",
  "/wiki/Bounty",
  "/wiki/Iron",
  "/wiki/Metal",
  "/wiki/34_ABY",
  "/wiki/35_ABY",
  "/wiki/Monster_droid",
  "/wiki/CR-8R",
  "/wiki/Cartographer",
  "/wiki/Emil_Graf",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Hat",
  "/wiki/Tales_from_Wild_Space:_IG-88_vs._the_Gatto_Gang",
  "/wiki/Star_Wars_Adventures_(2017)_9",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Nick_Brokenshire",
  "/wiki/IDW_Publishing",
  "/wiki/April_18",
  "/wiki/2018",
  "/wiki/Aurebesh",
  "/wiki/Writing",
  "/wiki/Category:Images_of_Moggee",
  "/wiki/Template:WildSpaceDate"
 ]
}