{
 "name": "Moghra",
 "display_name": "Moghra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Moghra's criminal cartel"
     ]
    }
   ]
  }
 ],
 "content": "Moghra was a Hutt male who worked as a crime lord from a palace on the moon Nar Shaddaa. The freighter pilot Lantra Tan stole thousands of credits from Moghra, but her cousin Jonal, a dancer in Moghra's employ, informed the Hutt about his cousin's heist. Moghra then placed a bounty on Tan.\nMoghra was an old Hutt crime lord who led a criminal cartel from his palace on the moon Nar Shaddaa. The Hutt's employee's included his majordomo, a retired assassin, and Jonal, a dancer at the palace who was in huge amounts of debt to Moghra and paying it off slowly through labor in what was effectively indentured servitude. Looking to provide funds to the Alliance to Restore the Republic and punish Moghra for Jonal's predicament, the dancer's cousin, freighter pilot Lantra Tan, stole thousands of credits from the Hutt during a heist.\nWhen Jonal learned of the heist he informed Moghra of Tan's involvement out of fear of punishment by the Hutt, souring his relationship with his cousin. Moghra then placed a bounty on Tan and sent his majordomo, who felt personally slighted by the heist, to track down her local associates, a slicer, a mercenary, and a thief.\nMoghra gave the bounty contract for Tan to a group of spacers, although he was unwilling to let them look into his financial dealings or bother Jonal, who was afraid of further repercussions from the Hutt and so avoided them. The spacers eventually tracked Tan to the Chardaan Orbital Yards in the Chardaan system, where she was hiding out with Alliance allies.\nMoghra first appeared in \"A Bounty Hunt\", an example scenario for the Star Wars: Edge of the Empire roleplaying game given in the 2017 supplement No Disintegrations. The scenario is designed to show the thought process that goes into designing an investigative scenario, and includes additional suggestions concerning Moghra that might be included in the scenario.\nThese include Jonal petitioning Moghral for a group of enforcers to protect him following the heist, Moghra sending enforcers after the players if they bother Jonal or look into the Hutt's dealings, and Moghra sending a second competing group to hunt down Tan who confront the players at the Orbital Yards. The scenario gives multiple possible outcomes of the hunt, which include the players turning Tan over to Moghra, the Galactic Empire, or letting her go free. It is also suggested that dependent on the outcome and whether any of the player's other actions angered the Hutt, Moghra could become a new enemy for the group.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hutt",
  "/wiki/Gender",
  "/wiki/Crime_lord",
  "/wiki/Moghra%27s_palace",
  "/wiki/Moon",
  "/wiki/Nar_Shaddaa",
  "/wiki/Freighter",
  "/wiki/Pilot",
  "/wiki/Credit",
  "/wiki/Dancer",
  "/wiki/Bounty",
  "/wiki/Assassin",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Majordomo",
  "/wiki/Slicer",
  "/wiki/Mercenary",
  "/wiki/Thief",
  "/wiki/Star_Wars_Legends",
  "/wiki/Spacer",
  "/wiki/Chardaan_Orbital_Yards",
  "/wiki/Chardaan_system",
  "/wiki/Star_Wars:_Edge_of_the_Empire",
  "/wiki/2017",
  "/wiki/No_Disintegrations_(Fantasy_Flight_Games)",
  "/wiki/Galactic_Empire"
 ]
}