{
 "name": "Mok_Shaiz",
 "display_name": "Mok Shaiz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Translator collar"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pyke Syndicate",
      "Fett gotra"
     ]
    }
   ]
  }
 ],
 "content": "Mok Shaiz was an Ithorian male who was the mayor of the city of Mos Espa on the planet Tatooine around 9 ABY. Following Boba Fett's takeover of the palace and criminal empire of Jabba the Hutt, Shaiz and Fett came into conflict after the latter failed to pay him tribute, instead having expected the Mayor to do the same to him. When Fett was subsequently attacked in an assassination attempt, the new crime lord visited Shaiz, believing he was responsible, though the Mayor deflected both the accusation and the threats made by Fett. In reality, Shaiz had offered Fett's territory on Tatooine to the Pyke Syndicate. He was killed by Master Assassin Fennec Shand while in hiding with the other crime bosses of Mos Espa.\nThe Ithorian male Mok Shaiz governed as the mayor of the city Mos Espa and its surrounding plateaus on the planet Tatooine. Shaiz resided in a city hall within Mos Espa, where he was served by a Twi'lek majordomo and several guards, as well as a desk clerk. He took visitors' appointments from within his chambers in the city hall.\nAfter the death of the crime lord Jabba the Hutt in 4 ABY, his majordomo, Bib Fortuna, took his place amid the newly-created power vacuum. Mos Espa subsequently became divided between three families—the Trandoshans, the Aqualish, and the Klatooinians. As Fortuna possessed less power than Jabba had, he had to rely on uneasy alliances, providing Shaiz with payment.\nAround the year 9 ABY, the former bounty hunter Boba Fett, assisted by Master Assassin Fennec Shand, killed Fortuna, taking over his palace. Unknown to Fett, Shaiz had been bribed by the Pyke Syndicate, who the Mayor promised the territory that Fett had claimed. As Fett tried to rebuild the Hutt's criminal empire as his own, receiving tributes from many of those who formerly served under Jabba, Shaiz dispatched his majordomo to Fett's palace. Though Fett and Shand believed Shaiz himself would be visiting to pay tribute, the majordomo only offered his employer's welcome, informing the new Daimyo that the Mayor was occupied with pressing matters and instead requesting that Fett pay tribute to Shaiz. Fett did not provide any tribute for the Mayor, but allowed the majordomo to depart alive. Before leaving, the majordomo informed the two that Shaiz may take Fett's response differently, threatening the possibility of a further delegation in the near future.\nAfter Fett and Shand were attacked by assassins of the Order of the Night Wind, they captured one, who alleged that he had been sent by the Mayor. Fett and Shand subsequently took the prisoner to the city hall, and the majordomo attempted to turn them away, claiming Shaiz was indisposed for the remainder of the week. Fett nonetheless forced his way into the Mayor's quarters as the majordomo apologized to Shaiz.\nThe Mayor questioned the identity of the unnannounced visitor, though Fett was doubtful that the Ithorian did not know who he was. Fett threw the Night Wind assassin to the ground in front of Shaiz, accusing the Mayor of being behind the attack. The majordomo insisted that the Mayor was not responsible, but Shaiz silenced him, identifying the assassin's allegiance to the Night Wind. Though Fett took the Mayor's comment as admission, Shaiz silently signaled one of his guards, who shot and killed the assassin; the act led to a standoff between Fett's forces and the Mayor's guards, but Shaiz continued with acknowledgement of the Night Wind's illegal nature outside Hutt Space, thanking Fett for turning the assassin in.\nAs the majordomo rewarded Fett at the Mayor's request, Fett declared he was no longer a bounty hunter, but Shaiz challenged his claim. Fett asserted that he would take the payment in place of the tribute he had expected from Shaiz, threatening that the Mayor only served as the Daimyo deemed. Shaiz, unfazed by the threat, suggested that Fett reconsider who was behind the Night Wind attack, claiming that he had no motive and that he served at Fett's pleasure, though the crime lord was unconvinced. Offering advice to Fett as his tribute, along with the currency provided earlier, Shaiz told him that running a family was a more complicated endeavor than bounty hunting; when Fett questioned him, the Mayor instructed the Daimyo to visit Madam Garsa Fwip's Sanctuary, where Fett learned that his position was disputed by the Hutts known as the Twins, a brother and sister who were cousins of Jabba.\nSome time later, the Twins learned that Shaiz had promised Tatooine to the Pyke Syndicate, informing Fett, who was doubtful of their claims. The crime lord attempted to confront the Mayor in the city hall, but Shaiz had already departed to join the Pykes, who had begun to gather their troops in Mos Espa. After Fett, helped by a gang of Mods, chased down Shaiz's majordomo when he attempted to flee the city hall, the majordomo told him that Shaiz had gone. The Mayor's majordomo was captured and questioned by Fett and Shand, but Shaiz himself could not be found, though the Mods were dispatched to search the streets of Mos Espa for him. Eventually, following the Pyke Syndicate expansion on Tatooine, the majordomo believed Shaiz had fled offworld. The Twi'lek claimed that it was a scheduled vacation.\nIn truth, the mayor had gone into hiding with the Pykes in Mos Eisley, holing up in the Desert Survey Office. Shaiz was conversing with the Pyke boss in charge of the Syndicate's Tatooinian operations when the Duros Cad Bane reported in on the state Freetown's involvement. Shaiz questioned whether the Tusken Raider tribe Fett was accepted into would be a problem, leading the Pyke boss to confess that the Syndicate arranged their massacre and framed it on a Nikto biker gang. At the revelation, Shaiz expressed his frustration with the complicating events, citing the bombing of the Sanctuary earlier in the night, and reiterated he had only agreed to \"surgical strikes\" that wouldn't leave his city destroyed.\nFollowing the Syndicate's defeat at the Battle for Mos Espa, Shaiz was sat with the dons of the Mos Espa crime families as the Pyke boss announced their withdrawal from Tatooine due to the inhospitality for their spice trade. Shaiz began to argue that Tatooine was hospitable, only for the Pyke to shut him up by rhetorically asking if half of his men getting shot or eaten by a rancor was what he considered \"hospitable.\" Shaiz paused along with the room's occupants when they heard the sound of two gunshots from outside, and stood up when everyone else drew their weapons in defense. Within a span of seconds, sniper fire came in through the windows, killing the three dons and the pair of Pyke sentinels. Shaiz began hyperventilating, looking for a way out, when a loop of cable fed down from the ceiling and slipped around the base of his neck. The Ithorian fought to pull at the thin noose, but the cable winched up, strangulating him until his neck broke. Shaiz's body hung limply in the middle of the office, leaving the cornered Pyke officiate frantically firing through the ceiling of a room littered with six corpses.\nThough Mok Shaiz hid his true affiliation, he asserted that he had no motive against Fett, claiming to Fett that he served at the crime lord's pleasure, while the Mayor's majordomo greeted Boba Fett with what he said was Shaiz's heartfelt welcome. Nevertheless, the Mayor expected the crime lord to pay him tribute rather than the opposite, also acting as if he was unaware of Fett's identity when they met. When Fett brought the captured Night Wind assassin to Shaiz along with an accusation, the Mayor instead responded as if Fett was still operating as a bounty hunter. The Mayor was referred to as \"spineless\" by one of the Twins.\nMok Shaiz had dark green eyes and pale skin.\nAs an Ithorian, Mok Shaiz spoke the Ithorese language.\nMok Shaiz made use of a translator collar that translated his Ithorese speech into Galactic Basic. The Mayor wore a long green garment that was adorned with gold.\nMok Shaiz is a character that created for the television series The Book of Boba Fett. Shaiz was portrayed by performance artist John Rosengrant and was one of two characters voiced by co-showrunner and director Robert Rodriguez, alongside Dokk Strassi. He first featured in the series' trailer on November 1, 2021 and was later mentioned by name in the first episode of the series, \"Chapter 1: Stranger in a Strange Land,\" which aired on Disney+ on December 29, 2021. Shaiz first appeared in the following episode, \"Chapter 2: The Tribes of Tatooine,\" which aired on January 5, 2022.\nConcept art of Shaiz's meeting with Fett in Chapter 2 was created by Anton Grandert. The Mayor's depiction in the concept art differs slightly from his final appearance, featuring different clothing and sporting a beard.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Ithorian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Translator_collar",
  "/wiki/Pyke_Syndicate",
  "/wiki/Fett_gotra",
  "/wiki/8D8",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Planet",
  "/wiki/Boba_Fett",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Mayor",
  "/wiki/Ambush_outside_of_the_Sanctuary",
  "/wiki/Crime_lord",
  "/wiki/Assassination_of_the_Pyke_Syndicate_leaders",
  "/wiki/Master_Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Mos_Espa_City_Hall",
  "/wiki/Unidentified_Twi%27lek_majordomo",
  "/wiki/Unidentified_clerk",
  "/wiki/Death",
  "/wiki/4_ABY",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Trandoshan_family",
  "/wiki/Aqualish_crime_family",
  "/wiki/Tatooine_Klatooinian_family",
  "/wiki/Standard_year",
  "/wiki/Bounty_hunter",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Hutt",
  "/wiki/Daimyo",
  "/wiki/Assassin",
  "/wiki/Order_of_the_Night_Wind",
  "/wiki/Unidentified_Night_Wind_assassin",
  "/wiki/Prisoner",
  "/wiki/Standard_week",
  "/wiki/Hutt_Space",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Garsa_Fwip",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/The_Twins_(Hutts)",
  "/wiki/Unidentified_Hutt_brother",
  "/wiki/Unidentified_Hutt_sister",
  "/wiki/Pyke",
  "/wiki/Troop",
  "/wiki/Mods",
  "/wiki/Mos_Eisley",
  "/wiki/Desert_Survey_Office",
  "/wiki/Unidentified_Pyke_boss",
  "/wiki/Duros",
  "/wiki/Cad_Bane",
  "/wiki/Freetown",
  "/wiki/Tusken_Raider",
  "/wiki/Unidentified_Tusken_Raider_tribe",
  "/wiki/Nikto",
  "/wiki/Kintan_Striders_Gang",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/Spice",
  "/wiki/Boba_Fett%27s_rancor",
  "/wiki/Pyke_sentinel",
  "/wiki/Eye",
  "/wiki/Ithorese",
  "/wiki/Language",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Clothing",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/John_Rosengrant",
  "/wiki/Robert_Rodriguez",
  "/wiki/Dokk_Strassi",
  "/wiki/November_1",
  "/wiki/2021",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Disney%2B",
  "/wiki/December_29",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/January_5",
  "/wiki/2022",
  "/wiki/Anton_Grandert",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Mok_Shaiz",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Krrsantan",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/December_16"
 ]
}