{
 "name": "Momi_Andrell",
 "display_name": "Momi Andrell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Momi Andrell was a wealthy Human female who was the daughter of Senator Wain Andrell and part of a group of animal rights activists that served the Galactic Republic during the Cold War.\nIn 3643 BBY, she went on a mission to the planet Nar Shaddaa to save the Shanjaru, a race of non-sentient creatures that were driven to near extinction. Momi was upset to learn how Drooga the Hutt was planning on using the shanjaru as part of his feast. She violently opposed him and all those who abused the shanjaru. In order to save the last of these species, she began to spend her father's wealth by hiring mercenaries, including her friend Tyrka, to save the Shanjaru and repopulate them, leaving Drooga a three-hour long holorecording diatribe. She then went to meet with Doctor Lazhae, believing he would help her smuggle the shanjaru offworld, but the doctor betrayed her, desiring to experiment on the shanjaru, believing it be evidence of evolving sapience.\nDuring her imprisonment by the mad doctor, Momi was used for horrifying experiments, so as to avoid experimenting on Lazhae's \"smart\" vrblthers. As a smuggler came to stop the doctor and find the male shanjaru to deliver to Drooga, Momi was injected by incurable diseases. The smuggler promised to save her and end the Doctor's experiments, but Momi didn't care about revenge since she wanted to die for everything that has happened to her. The Doctor was willing to pay the smuggler in order to keep the samples, but Momi begged the smuggler to recover them from the mad doctor. The smuggler ordered the doctor to hand the samples and asked him to run. After the doctor, Momi thanked the smuggler for everything and asked the spacer to deliver the samples to the Senate Tower on Coruscant where Daru'da can clone the shanjaru. She then begged the smuggler to end her life since she wanted to be put out from her misery. The smuggler told her not to lose hope since Momi's father could offer treatment to her. Momi accepted and would try to make it back.\nMomi's father later sent a message to the smuggler that she is being treated by the best scientists in the galaxy in hopes of curing her, while simultaneously her extremist goals were put on hold.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Wain_Andrell",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Planet/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Shanjaru",
  "/wiki/Sentience/Legends",
  "/wiki/Drooga",
  "/wiki/Hutt/Legends",
  "/wiki/Tyrka",
  "/wiki/Doctor/Legends",
  "/wiki/Lazhae",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Vrblther/Legends",
  "/wiki/Voidhound",
  "/wiki/Coruscant/Legends",
  "/wiki/Daru%27da",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}