{
 "name": "Mongorrt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vinsoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chev"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Raff Syndicate"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Nunk Plaarvin"
     ]
    }
   ]
  }
 ],
 "content": "Mongorrt was a male Chev, who was a slave to his Chevin master Nunk Plaarvin, and a member of the Raff Syndicate. He was the head of the security forces on Metellos 3, when Marn Hierogryph, under alias of \"Professor Gryphomarn\", tried to run a con there, using Jarael and Rohlan Dyre as his accomplices. Plaarvin, however, had cracked the con and ordered Mongorrt to capture Hierogryph and his companions. The Chevs managed to capture Jarael and Rohlan with the Energy bolas, but Hierogryph was saved by the timely arrival of Zayne Carrick. Mongorrt, under Plaarvin's orders, had brought Jarael and Rohlan in the observation dome of Metellos solar observatory for execution. Later that day Marn Hierogryph and Zayne Carrick attempted another con - this time in an attempt to save their friends. Disguising Slyssk as a Raff Syndicate representative, they fooled Plaarvin into thinking that the Syndicate knows about him hiding part of his profits from them. After that they sent him to a \"rendezvous\" with the Syndicate on the planet Jebble, which, unknown to Plaarvin, was devastated several months ago. Pointing to Mongorrt and other Chevs that they were now free, Hierogryph suggested them to keep running operations for Syndicate, to which they agreed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vinsoth/Legends",
  "/wiki/Chev",
  "/wiki/Gender/Legends",
  "/wiki/Raff_Syndicate",
  "/wiki/Nunk_Plaarvin",
  "/wiki/Chevin/Legends",
  "/wiki/Metellos_3",
  "/wiki/Marn_Hierogryph",
  "/wiki/Jarael",
  "/wiki/Rohlan_Dyre",
  "/wiki/Energy_bola",
  "/wiki/Zayne_Carrick",
  "/wiki/Slyssk",
  "/wiki/Planet/Legends",
  "/wiki/Jebble",
  "/wiki/Battle_of_Jebble",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Mongorrt",
  "/wiki/Knights_of_the_Old_Republic_36",
  "/wiki/Knights_of_the_Old_Republic_37"
 ]
}