{
 "name": "Monnk",
 "display_name": "Monnk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Monnk's company",
      "Monnk's company"
     ]
    }
   ]
  }
 ],
 "content": "\"Monnk\" was the nickname of the Clone SCUBA trooper who served in the Clone Wars as a Clone Commander under the leadership of Jedi Master Kit Fisto. During the Battle of Mon Cala, he served as Red Leader and commanded a company of Grand Army SCUBA troopers against the Separatist aqua droids of Commander Riff Tamson and his Quarren allies.\nWhen the Separatist-backed Quarren declared war on the Mon Calamari, Commander Monnk joined his Jedi General Kit Fisto and Commander Ahsoka Tano in leading a company of SCUBA troopers to reinforce the Mon Calamari troops. Once there, they joined General Anakin Skywalker, Senators Padmé Amidala and Meena Tills, Prince Lee-Char, and Captain Ackbar in leading the battle against the Separatist aqua droids and Quarren. After losing the first round of combat, the Separatists sent in their Hydroid Medusas, which overwhelmed the Republic troops.\nMost of the Republic-allied officers retreated to a system of caves deeper underwater, but Monnk and many other clone troopers were taken prisoner. When the Jedi and Mon Calamari leaders decided to head to the surface and evacuate using the Jedi's ship, Kit Fisto freed Monnk and a few other clones while creating a diversion to aid in their escape. However, as Kit and Monnk went to regroup with the others, they found them descending back towards the seafloor amid the remains of the ship, which had been destroyed by the Separatists.\nCaptain Ackbar and Prince Lee-Char decided it would be best to split into two groups, and Monnk was assigned to go with Kit Fisto, Ahsoka, the Prince, and the other clones. Kit led them into another cave, then ordered Monnk to stand watch at the entrance. Monnk soon alerted the others when he spotted a large number of Mon Calamari and clone prisoners being escorted past their hiding place. The Jedi tried to convince the Prince that they needed to continue laying low, but he insisted on getting the prisoners' attention to give them hope, which also revealed their position to the Quarren and droid guards. Just as Monnk and the others came under attack, the Republic reinforcements arrived in the form of an army of Gungans sent from Naboo. The Separatists then unleashed another weapon from their arsenal, using Trident-class assault ships to create massive whirlpools.\nIn the ensuing battle, Monnk was taken prisoner once again, along with nearly all of the Republic troops. The Prince and Ahsoka managed to escape capture, and snuck into one of the Separatists' prisoner holding areas. Once they were inside, Monnk found them, and led them to where Senator Tills was tending to a wounded Captain Ackbar. The Prince outlined his plan to convince the Quarren to help them drive out the Separatists, and Monnk said he would get the remaining clone and Gungan troops ready.\nAs Riff Tamson prepared to publicly execute Prince Lee-Char, the Quarren discreetly handed weapons to Monnk and the other Republic troops. Nossor Ri, chieftain of the Quarren, gave the signal to attack, and the Separatist forces were soon defeated by their combined efforts.\nMonnk shared a rapport with Jedi Master Kit Fisto, working closely with him throughout the battle.\nMonnk wore standard clone SCUBA armor with yellow markings as well as darker markings on his helmet, torso, and thighs. He utilized a DC-12U beam rifle during the battle.\nMonnk first appeared in \"Water War,\" the first episode in Season Four of Star Wars: The Clone Wars. He was voiced by Dee Bradley Baker, who voiced all clones for the series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Monnk",
  "/wiki/Monnk/Legends",
  "/wiki/Monk",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Galactic_Republic",
  "/wiki/Monnk%27s_company",
  "/wiki/Clone_SCUBA_trooper",
  "/wiki/Clone_Wars",
  "/wiki/Clone_Commander",
  "/wiki/Jedi_Master",
  "/wiki/Kit_Fisto",
  "/wiki/Battle_of_Mon_Cala",
  "/wiki/Red_Leader",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Commander",
  "/wiki/Riff_Tamson",
  "/wiki/Quarren",
  "/wiki/Mon_Calamari",
  "/wiki/Ahsoka_Tano",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Meena_Tills",
  "/wiki/Prince",
  "/wiki/Lee-Char",
  "/wiki/Gial_Ackbar",
  "/wiki/Hydroid_Medusa",
  "/wiki/Consular-class_space_cruiser",
  "/wiki/Gungan",
  "/wiki/Naboo",
  "/wiki/Trident-class_assault_ship",
  "/wiki/Nossor_Ri",
  "/wiki/Color",
  "/wiki/DC-12U_beam_rifle",
  "/wiki/Water_War",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Gungan_Attack",
  "/wiki/Prisoners",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!"
 ]
}