{
 "name": "Monnda_Tebbo",
 "display_name": "Monnda Tebbo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "aboard Flurry"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Monnda Tebbo was a male Duros Chief Navigator who served onboard the Flurry during the Galactic Civil War. He was killed with the rest of the Flurry crew during the battle over Bakura.\nBefore entering the Alliance, Tebbo served as navigator on the Ill Wind, a spice-smuggling vessel that made runs through the Kessel and Drualkiin systems, for five years. While serving on the Ill Wind, Tebbo was mentored by the former navigator and covert rebel, Sumok, who taught Tebbo everything he possibly could. The Ill Wind was attacked by an Imperial Customs vehicle above the pirate haven of Uogo'cor, where the ship was severely damaged and Sumok was killed. Tebbo saved the vehicle from complete destruction when it spiraled towards the planets surface by using the ship's shields as an unorthodox brake.\nTebbo was marooned after the crash, but managed to use the damaged ship's emergency power systems to transmit a distress call to Sumok's Rebel contact. Tebbo and the other four surviving crew members of the Ill Wind hid from Imperials for four days as the crash site was studied and surveyed. Tebbo and his shipmates ambushed a team of stormtroopers scouring the countryside searching for survivors, capturing their weapons and their landing craft. After lifting off in the captured vehicle, Tebbo unsuccessfully attempted to avoid the Customs ship's tractor beam. After being forced to dock with the Customs vessel, a squadron of X-wings emerged from hyperspace and attacked the Imperial ship. Boarding the Customs ship, Tebbo and the smugglers managed to make their way to the engine room, deactivating all of the Imperials' weapons systems. After their actions aboard the Customs cruiser, Tebbo and the crew of the Ill Wind were welcomed into the Rebel Alliance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Flurry",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Chief_Navigator",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Invasion_of_Bakura",
  "/wiki/Bakura/Legends",
  "/wiki/Ill_Wind_(smuggler_ship)",
  "/wiki/Kessel/Legends",
  "/wiki/Drualkiin_system",
  "/wiki/Sumok",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Uogo%27cor/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/The_Truce_at_Bakura",
  "/wiki/The_Truce_at_Bakura_Sourcebook"
 ]
}