{
 "name": "Montross_(bounty_hunter)",
 "display_name": "Montross  (bounty hunter)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Kohlma"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White",
      "formerly brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "True Mandalorians",
      "True Mandalorians"
     ]
    }
   ]
  }
 ],
 "content": "Montross was a Mandalorian–turned–bounty hunter who competed with Jango Fett to become the template for the clone troopers of the Galactic Republic. Originally one of Jaster Mereel's True Mandalorians, Montross fought in the Mandalorian Civil War, where he was known for his brutal tactics and acts of recklessness. When a young boy called Jango Fett joined the Mandalorians and was treated like a son by Mereel, Montross was angered by Mereel's favoritism of Fett and became contemptuous of him. In an engagement on Korda Six, Montross left Mereel to die. He attempted to claim the title of Mandalore, but was thwarted by Fett, who told the true story of Mereel's death to the other Mandalorians, took over, and banished Montross.\nMontross became a bounty hunter; known for his ruthlessness, he almost never took a live bounty. In 32 BBY, he and Fett, now also a bounty hunter, were selected by the ex-Jedi Count Dooku to participate in a hunt to capture or kill the leader of the Bando Gora cult, Dooku's former apprentice Komari Vosa. Montross did battle with Fett on Coruscant and Malastare, then later set about tracking the other bounty hunter to lead him to Vosa's lair. After killing Fett's friend and contact Rozatta, Montross learned that the Bando Gora headquarters was on the graveyard moon of Kohlma. On that world he once again fought with Fett and was defeated, before being torn to shreds by the Bando Gora.\nMontross was a member of the Mandalorians, a centuries-old mercenary group. A brutal man, he was feared by his enemies and allies alike. In approximately 60 BBY, the Mandalorian Civil War broke out, a conflict between a splinter faction known as the Death Watch, led by a man called Tor Vizsla who believed the Mandalorians should conquer the galaxy, and the True Mandalorians led by Jaster Mereel. Montross sided with the True Mandalorians, and though he followed Mereel, he was often at odds with the man over issues of tactics and his own tendency to inflict levels of collateral damage that Mereel found unacceptable. In 58 BBY Montross was on Concord Dawn, Mereel's homeworld, when the Death Watch struck. Mereel and his fellow Mandalorians only escaped Vizsla's squads with the help of a local boy, Jango Fett, whose family had been killed by the Death Watch. From his family's farm Fett led them to the closest town, where the Mandalorians expected Vizsla to go to resupply; Montross joined up with Mereel's band in town, and they prepared to ambush the Death Watch. As Mereel and the others hit the Death Watch at street level, Montross sniped them from an upper-story window. With Fett's help, they were able to eliminate most of the Death Watch there; Mereel recruited Fett on the spot and the Mandalorians pulled out, Montross shooting down Death Watch stragglers as Mereel's group retreated.\nSix years later, the Mandalorians received an assignment from the Korda Defense Force; a rookie security squad of theirs was pinned down on the world of Korda Six by hostile natives—who were initially believed to be presenting only minimal resistance—and needed extraction. Montross, who handed out the assignments at the mission briefing, would lead Vertigo Squad, a group composed of those with jetpack flight experience who would be hitting the enemy from on high. Headhunter Company, led by Mereel, would retrieve the security team, while a squad led by Fett—in his first mission as a squad commander—would hold down the extraction point. Montross did not care for the way Mereel treated Fett as a son and made his feelings clear to Fett before the mission, reminding the younger man that Mereel would some day need to pick a successor.\nWhen they arrived, the resistance proved to be greater than they had been told. The firepower of the amassed natives cut down the Mandalorians quickly, forcing Fett's squad to take cover in a system of trenches. Mereel followed Fett, ordering Montross to abort his run and do the same. Montross, however, continued his flight, not wanting this to be his first abandoned mission, and told Mereel to bring his squad up behind them. Attempting to take a heavy gun emplacement on a nearby ridge, many of his squad were shot down. A grenade thrown by one of the natives knocked Montross down, but he was saved by the arriving Mereel. Fett, meanwhile, used Montross' attack as a diversion to take his own squad to where the security team supposedly awaited. Upon arriving, though, they were ambushed by the Death Watch, and Fett realized that the supposed job from the Kordans had in fact been intended as a trap for the Mandalorians. As Fett fought them, Vizsla appeared in an armored vehicle on a ridge above Montross and Mereel. Mereel told Montross that they would have been off the planet by then were it not for Montross' charge, and if they survived Montross would no longer be a Mandalorian. Vizsla began firing on Mereel, who called to Montross for an airlift out. Montross flew away and left Mereel to die, telling him he would take care of the Mandalorians.\nMontross returned to the other Mandalorians, ordering them to retreat and telling them that Fett had died trying to save Mereel. Just then, Fett appeared with Mereel's body; Montross tried to persuade Fett to let him take over the Mandalorians, but Fett told those gathered that Montross had left Mereel to die. Fett's friend Silas backed up Fett's claim to the title of Mandalore with his blaster. Montross tried to persuade the other Mandalorians not to follow his rival, but the only reaction was more blasters being drawn on him. With a parting shot at Fett that he'd lead the others to their deaths, Montross left the Mandalorians and disappeared for a time. He took Mereel's armor from the dead man and mounted it in his home as a trophy.\nIn the wake of his banishment, Montross became a bounty hunter, using the brutality he had exemplified as a Mandalorian and the acts he committed as a hunter to strike fear into his targets. Montross exclusively killed his bounties, hunting them not for the money they paid but for the sport of the hunt. From one of his targets, a land baron with a large price on his head, Montross acquired his starship Hell's Anvil after killing him. He stripped the interior, removed the stations for the copilot and navigator, and installed a hydraulic pilot's seat that would allow him to access the ship's large computer array.\nIn 32 BBY, Montross pursued one of his targets to a backwater world. The other man pleaded for his life, offering to pay Montross more than the bounty on his head; deciding that his prey was worth enough dead, Montross killed him and collected the five thousand credit bounty back aboard the Hell's Anvil. Shortly thereafter, the bounty hunter received a message from a man calling himself Tyranus. Tyranus offered Montross a chance to hunt the rogue Jedi Komari Vosa, leader of the Bando Gora cult, for a bounty of five million credits. He was not the only one to receive the offer, though, and amongst his competitors was Jango Fett, who had become a bounty hunter himself in the intervening years. Unknown to either of them, the winner of the competition would also be the prime clone for a clone army that Tyranus was building.\nSince the Bando Gora were involved in the production and distribution of narcotic death sticks, Montross and Fett both set their sights on the death stick market. Montross tracked traffic of the drugs to a supplier on Coruscant called Groff Haugg. He found Haugg in one of Coruscant's industrial districts and interrogated the drug dealer. Haugg, more scared of the Bando Gora than Montross, lied to the bounty hunter and directed him to the Gazzari system. To silence Haugg, Montross froze him in carbonite, which killed him. Fett arrived not long after, also in pursuit of Haugg, and the two bounty hunters battled. After being beaten back, Montross escaped through a hatch in the freezing chamber and sealed it behind him. Fett did not pursue, instead following leads of his own, and Montross set off for the Gazzari system in the Hell's Anvil.\nUpon arriving in the system, Montross learned from his ship's computer that death stick traffic had been stopped by the Galactic Republic some time ago and realized that he had been lied to. He also learned that some of the smugglers who had been arrested had turned over information in exchange for reduced prison sentences; amongst them was one Bendix Fust, who was also wanted alive by the Dug crime lord Sebolto. Fust, Montross learned, was serving time in the Republic prison on Oovo IV; a prison riot had just taken place there, cutting off all communication with the asteroid. Montross connected the two and realized Fett was involved, then set off for Sebolto's lair on Malastare.\nFett was also on Malastare and found Sebolto first, causing the Dug to panic and accidentally fall into a vat of chemicals, killing him. Riding a skiff, Montross ambushed the other bounty hunter as Fett escaped through Sebolto's death stick factory. They fought again, but it was cut short as Fett's new temporary partner Zam Wesell arrived in Fett's ship, Slave I, and unloaded its missiles into Montross' skiff. Wesell and Fett made their escape, but Montross followed, activating a listening device he had planted aboard Slave I. As Fett and Wesell headed to Tatooine, following Huttese markings in one of Sebolto's ships, Montross overheard Fett communicate with his friend and informant Rozatta on Outland Station. While Fett occupied himself on Tatooine, Montross headed to the station. Jamming communications so no signal could get out, he boarded Outland Station. Rozatta attempted to bargain with Montross as he landed, but the bounty hunter would have none of it and tortured her to near-death for the information she had acquired on Vosa's whereabouts. He learned that Vosa was hiding on the moon of Kohlma, and when Fett attempted to contact Rozatta after leaving Tatooine, Montross answered him. Mocking the other bounty hunter, Montross told him that she was still alive, but he had the information now. Before leaving, Montross planted thermal charges around the station to kill Fett. Fett escaped the trap, learning from the dying Rozatta where Montross had gone.\nAs Montross headed for Kohlma, Vosa decided that the time had come to end the threat of the bounty hunters and ordered both their deaths. On Kohlma, a graveyard moon of the planet Bogden, Montross landed the Hell's Anvil in a swamp and, cladding himself in his full set of Mandalorian armor, set out for Vosa's lair. At last Fett arrived at the gates of the lair where Montross waited, and the two agreed to do battle like Mandalorians, one-on-one, to the death. They fought a fierce duel until Montross, wounded, was knocked into the center of an ancient ceremonial arena. Though he remained defiant towards Fett, asking for a warrior's death, Montross soon found himself at the center of an approaching group of cultists. Fett ignored Montross' request and left him to be torn apart by the Bando Gora.\nMontross was a brutal man, exceptionally so even by Mandalorian standards, and often inflicted a good deal of collateral damage in engagements. His tactics made him feared by his enemies, his fellow soldiers, and in his career as a bounty hunter, his targets. Montross enjoyed hunting and killing his bounties, doing so for sport and not the money they paid, and the cruelties he inflicted only increased his reputation amongst them. He always left his prey dead, even when a bounty would pay more alive. When angry, Montross had violent outbursts. He was not adverse to using torture to extract information. Montross was quite capable in his work; during the hunt for Vosa, he beat Fett to his targets three times, sometimes tracking him by indirect clues that the other bounty hunter left behind and sometimes directly listening in on his conversations.\nAs a Mandalorian, Montross often exhibited reckless displays of bravado that placed his own allies in danger. He did not like to leave battles unfinished, and sometimes had to be reminded that his group was pulling out while busy killing stragglers. In extreme cases, Montross would disobey orders to fall back, priding himself in the fact the Mandalorians had never abandoned a mission and refusing to end that unblemished record. However, Montross was cowardly; after letting Mereel die in the ambush at Korda Six, he was quick to order that Mereel's last order of a retreat be carried out. After leaving the Mandalorians, he continued to think of himself as a warrior, engaging in his final duel with Jango Fett as if the two were both Mandalorians and, once defeated, asking for a warrior's death.\nWhen Jaster Mereel recruited Jango Fett to join the Mandalorians, Montross took a disliking to the young man. He grew enraged at the attention Mereel showed Fett, as well as the fact that Mereel considered himself a surrogate father to the boy, believing that it clouded Mereel's judgment. Montross was contemptuous of Fett, considering him a child and believing him to be a coward. As an opportunist, he also believed that Mereel's attachment would interfere with his picking of a successor. Montross' desire to lead the Mandalorians led him to betray Mereel at Korda Six and immediately attempt to assume the dead man's position. He took pleasure in his victories over Fett during their time as bounty hunters, mocking the other man and passing off their rivalry as \"just business.\" As of 27 BBY, Fett considered Montross to be the hardest opponent he had ever faced.\nMontross wore a suit of blue Mandalorian armor, with the arms cut off above the elbows. He equipped himself with a jetpack when a mission required one, as well as a blue cape. As a Mandalorian, he used a number of blaster pistols and rifles, both in close-up combat and from a sniper's position. He kept his armor after leaving the Mandalorians, though he was not usually known to have worn the helmet, except when facing Jango Fett in a Mandalorian duel. Along with his blasters, Montross used cluster missiles in combat. He kept his jetpack as well.\nMontross acquired his starship, the KR-TB \"Doomtreader\" Hell's Anvil, in the course of his bounty hunting, considering it a bonus for killing his target. He gutted the interior, rearranging it to suit his tastes. Equipped with powerful engines, strong shields, and solar ionization cannons that ignored shields and melted durasteel, the Hell's Anvil was a dangerous vessel. The ship had a large cargo hold, with cells used to store prisoners and corpses; these were located close to the hatch of the engine room, which made them uncomfortably hot.\nSeveral characters were given the name Montross in early versions of the script to Star Wars: Episode IV A New Hope. In a rough draft from May 1974, Montross is an aide to General Skywalker on Aquilae. In a scene in a war room, Montross places everyone on alert and later reports a giant asteroid or moon—an early version of the Death Star—approaching Aquilae. A character named Montross Holdaack appears in the second screenplay draft of The Star Wars from January 28, 1975. This Montross is the science officer on board a ship run by Jabba the Hutt and Oxus, and is friends with Han Solo. Solo steals the ship by faking a reactor overload, causing everyone to flee, and keeps Montross and Chewbacca on as his crew; they later help transport Luke Starkiller and his two droids, coming to his rescue in the film's climax. In this draft, Montross is almost all robotic, with only his right arm and head organic; the name of an Imperial officer from the rough draft, Crispin Hoedaack, was slightly altered to make his surname. By the third draft of August 1975, Solo has his own ship, which is nonetheless paid for by Jabba. Again he fakes a reactor problem and everyone leaves, except for Montross, but Solo outdraws him and forces him to leave too. The fourth draft, dated January 1, 1976, sees larger changes. Montross is now an Imperial bureaucrat, replacing the character of Jabba, who tells Solo that the Mos Eisley spaceport is closed under Imperial decree; Solo has to outwit him to take off. Actor Richard LeParmentier was originally considered for that part, but Montross was ultimately cut from the script, and LeParmentier received the role of Admiral Conan Antonio Motti.\nWhile the making of Star Wars was being negotiated with Twentieth Century Fox in 1976, a budget was drawn up. Due to confusion in the process, a number of items from earlier drafts were budgeted for; a £150 pirate outfit for Montross was one of them. Bill Bailey was also listed as having been cast for the part of Montross.\nThe name was brought into canon, and the actual character of Montross created, for the dual project of Jango Fett: Open Seasons and Star Wars: Bounty Hunter, written by Haden Blackman. Released as part of the Expanded Universe tie-in to Star Wars: Episode II Attack of the Clones, the comic series and game together told the story of how Jango Fett came to be a bounty hunter and the clone donor for the Grand Army of the Republic. Montross' background with Fett was established in flashbacks in Open Seasons, while the conclusion of their story was given in Bounty Hunter. In the game, Montross was voiced by Clancy Brown.\nIn an alternate ending to Bounty Hunter, if the player loses to Montross in their final fight, Montross stands over Jango Fett's dead body, claiming that Vosa's bounty is now his, and tells Fett to save a place in hell for him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Montross_(disambiguation)",
  "/wiki/32_BBY/Legends",
  "/wiki/Kohlma",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/True_Mandalorians",
  "/wiki/52_BBY/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Prime_clone",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jaster_Mereel",
  "/wiki/Mandalorian_Civil_War_(True_Mandalorians)",
  "/wiki/Battle_of_Korda_Six",
  "/wiki/Death/Legends",
  "/wiki/Mandalore_(title)",
  "/wiki/Bounty/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Bando_Gora/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Komari_Vosa",
  "/wiki/Coruscant/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Rozatta",
  "/wiki/Moon/Legends",
  "/wiki/Jango_Fett:_Open_Seasons",
  "/wiki/Mercenary/Legends",
  "/wiki/60_BBY/Legends",
  "/wiki/Death_Watch/Legends",
  "/wiki/Tor_Vizsla",
  "/wiki/The_galaxy/Legends",
  "/wiki/58_BBY",
  "/wiki/Concord_Dawn/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Battle_of_Concord_Dawn",
  "/wiki/Sniper/Legends",
  "/wiki/Korda_Defense_Force",
  "/wiki/Planet/Legends",
  "/wiki/Korda_Six",
  "/wiki/Vertigo_Company",
  "/wiki/Jetpack/Legends",
  "/wiki/Headhunter_Company",
  "/wiki/Grenade/Legends",
  "/wiki/Silas_(Mandalorian)",
  "/wiki/Blaster/Legends",
  "/wiki/File:Montrossoffer.ogg",
  "/wiki/Hell%27s_Anvil",
  "/wiki/Pilot/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Death_stick/Legends",
  "/wiki/Groff_Haugg",
  "/wiki/Gazzari_system",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Bendix_Fust",
  "/wiki/Dug/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Sebolto",
  "/wiki/Oovo_IV/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Skiff/Legends",
  "/wiki/Zam_Wesell/Legends",
  "/wiki/Slave_I/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Outland_Transit_Station",
  "/wiki/Torture/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Bogden/Legends",
  "/wiki/File:MontrossShootsSomeGuy-03CH1OUT-BH.ogg",
  "/wiki/27_BBY/Legends",
  "/wiki/Mandalorian_armor/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Cluster_missile/Legends",
  "/wiki/KR-TB_%22Doomtreader%22",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Solar_ionization_cannon",
  "/wiki/Durasteel/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/May",
  "/wiki/1974",
  "/wiki/General/Legends",
  "/wiki/Skywalker_family/Legends",
  "/wiki/Aquilae_(The_Star_Wars)",
  "/wiki/Death_Star/Legends",
  "/wiki/January_28",
  "/wiki/1975",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Oxus",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Crispin_Hoedaack",
  "/wiki/August",
  "/wiki/January_1",
  "/wiki/1976",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Richard_LeParmentier",
  "/wiki/Conan_Antonio_Motti/Legends",
  "/wiki/20th_Century_Studios",
  "/wiki/Pirate/Legends",
  "/wiki/File:1montross.ogg",
  "/wiki/Canon",
  "/wiki/Star_Wars:_Bounty_Hunter",
  "/wiki/W._Haden_Blackman",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Clancy_Brown",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Jango_Fett:_Open_Seasons_1",
  "/wiki/Jango_Fett:_Open_Seasons_2",
  "/wiki/Star_Wars:_Zam_Wesell",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Category:Audio_files_of_Montross",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars:_Bounty_Hunter_(article)",
  "/wiki/Star_Wars_Gamer_10",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider",
  "/wiki/Gamescape",
  "/wiki/Star_Wars_Insider_63",
  "/wiki/Star_Wars:_Bounty_Hunter:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_New_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/The_History_of_the_Mandalorians",
  "/wiki/Star_Wars_Insider_80",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Bounty_Hunter_Code:_From_the_Files_of_Boba_Fett",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_Special_Edition_2014",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_14",
  "/wiki/Lords_of_Nal_Hutta",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com"
 ]
}