{
 "name": "Montross  (Aquilae)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Montross was an aide to General Luke Skywalker on Aquilae. In a war room, Montross placed everyone on alert and later reported a giant asteroid or moon—an early version of the Death Star—approaching Aquilae.\nA character named Montross Holdaack appears in the second screenplay draft of The Star Wars from January 28, 1975. This Montross is the science officer on board a ship run by Jabba the Hutt and Oxus, and is friends with Han Solo. Solo steals the ship by faking a reactor overload, causing everyone to flee, and keeps Montross and Chewbacca on as his crew; they later help transport Luke Starkiller and his two droids, coming to his rescue in the film's climax. In this draft, Montross is almost all robotic, with only his right arm and head organic; the name of an Imperial officer from the rough draft, Crispin Hoedaack, was slightly altered to make his surname. By the third draft of August 1975, Solo has his own ship, which is nonetheless paid for by Jabba. Again he fakes a reactor problem and everyone leaves, except for Montross, but Solo outdraws him and forces him to leave too. The fourth draft, dated January 1, 1976, sees larger changes. Montross is now an Imperial bureaucrat, replacing the character of Jabba, who tells Solo that the Mos Eisley spaceport is closed under Imperial decree; Solo has to outwit him to take off.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Montross_(disambiguation)",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/General/Legends",
  "/wiki/Luke_Skywalker_(The_Star_Wars)",
  "/wiki/Aquilae_(The_Star_Wars)",
  "/wiki/Asteroid/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/January_28",
  "/wiki/1975",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Oxus",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Crispin_Hoedaack",
  "/wiki/August",
  "/wiki/January_1",
  "/wiki/1976",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/The_Star_Wars_1",
  "/wiki/The_Star_Wars_2",
  "/wiki/The_Star_Wars_3",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film"
 ]
}