{
 "name": "Moorint",
 "display_name": "Moorint",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pilgrims"
     ]
    }
   ]
  }
 ],
 "content": "Moorint was a male Twi'lek who served as the Scout Chief for the Pilgrims of Kalikori village on the planet Tython, during the Cold War between the Galactic Republic and the Sith Empire. A skilled tracker, Moorint served as the lieutenant of Matriarch Sumari during the conflict with the native Flesh Raiders of Tython. When Sumari died from illness, he served Sumari's daughter, Ranna Tao'Ven, faithfully until approached by the Dark Jedi Bengel Morr, who was controlling the Flesh Raiders, with an offer of peace. After capturing the Jedi Master Orgus Din and delivering the Human to Morr's clutches as part of their agreement, Moorint and the villagers failed in their attempt to capture Din's apprentice but were forgiven by the Jedi. Moorint and his people continued to live on Tython alongside the Jedi Order as the galaxy erupted into renewed war.\nA male Twi'lek, Moorint was one of many who joined the Pilgrims, a religious group founded by Matriarch Kolovish on the planet Ryloth during the Great Galactic War between the Republic and the Sith Empire. When the planet's rulers began to discriminate against the group for their adherence to the Pilgrim religion, Kolovish led the Pilgrims to visit other Twi'lek colonies, and Moorint joined the Pilgrims during this time sometime before the Pilgrims discovered the Deep Core world of Tython, the homeworld of the Jedi Order. However, as the Jedi had only recently rediscovered the world the year before, the Senate refused the group settlement rights, but the Pilgrims refused to depart. In the Tythos Ridge mountains near the location where the new Jedi Temple was being built in 3650 BBY, the group established the village of Kalikori in the small valley where they had arrived.\nThere, the Pilgrims spent the next seven years during the Cold War fending off attacks by the Flesh Raiders, the vicious natives of the planet, and Moorint became the village's Scout Chief. His scouts would gather information on the natives' movements, working with the Pilgrim militia captain Bashenn to prepare the village's defenses accordingly, and Moorint quickly gained experience and knowledge of the Flesh Raiders' tactics and movements. Kolovish retired at some point during the Cold War, and Moorint served her successor, Sumari, as the Matriarch's lieutenant alongside Sumari's daughter, Ranna Tao'Ven. The Jedi Order was forbidden by their Council to actively aid the villagers out of respect for the Senate's wishes, fostering a deep resentment of the Order amongst the villagers.\nAround the year 3643 BBY, the Flesh Raiders began to move in greater numbers against both the Jedi Order and the villagers, and Moorint's scouts heard sounds of conflict from the nearby Tythonian Gnarls region. There, they witnessed a Flesh Raider invasion force be turned back by Jedi after their commander, the Dark Jedi Callef, was killed by a young Jedi apprentice, and the passageway they were using to enter the Gnarls was sealed. Not long afterward, the Jedi Master Orgus Din sent the apprentice—now his official Padawan—to meet with the Matriarch and learn what the villagers knew of the Flesh Raiders.\nHowever, Sumari had recently fallen ill, and her daughter took over more and more of her mother's duties to help the woman cope. The Matriarch was forced to retire early into the conversation, causing Moorint and Tao'Ven to take over and explain Sumari's offer: if the apprentice would deal with the Flesh Raiders' weapons, the villagers would give the Jedi their knowledge of the natives' movements. Tao'Ven wished for the Padawan to recover the weapons for the villagers, but Moorint believed that it would be more effective to sabotage the weaponry and inflict casualties amongst the enemy. The apprentice ventured into the cave system known as the Upper Hollows in the Tythos Ridge to retrieve the weapons and managed to rescue an astromech droid named T7-O1 in the process. In exchange, Moorint revealed that his scouts had witnessed a great deal of activity near the ancient Jedi temple Kaleth.\nUsing the Scout Chief's information, the apprentice investigated and battled Force-sensitive Flesh Raiders. As the Jedi Order learned that Din's former student, Bengel Morr, had become a Dark Jedi and was leading the natives, it began to make war upon the Flesh Raiders with help from Moorint's scouts. Using information gathered by the scouts to locate one of the Flesh Raiders' command bases, a team of Jedi Masters and Knights attacked the compound after Din's apprentice disabled the base's shield generator. However, even after the Padawan saved the village from a surprise attack, Moorint and the other villagers remained resentful of the Jedi and leapt at a chance to save themselves at the expense of the Order when Morr approached them with an offer: give him Din, and they would be safe from harm.\nBroadcasting a fake distress signal, the villagers lured Din and his student back to the village, where Din was subdued by Morr's forces. However, Morr changed the terms of their agreement and demanded the life of Din's new apprentice as well, forcing Moorint and two other villagers named Eseni and Saylew to try and kill the Padawan when the young Jedi arrived. The newly appointed Matriarch Tao'Ven, whose mother had passed away before Morr had approached the village, attempted to stop Moorint, Eseni, and Saylew from killing the apprentice, giving the Jedi time to persuade the villagers with the Force to depart in peace. The Padawan went on to defeat Morr and rescue Din, ending the conflict with the Flesh Raiders by depriving the natives of their leader. At the apprentice's behest, the Order did not seek any disagreement with the village over its betrayal and instead began to work together more closely with Moorint and the other Pilgrims. With the restrictions placed by the Council loosened, the Jedi and the Pilgrims coexisted peacefully on Tython as the galaxy descended into renewed war.\nA yellow-skinned Twi'lek male with gray eyes, Moorint was fiercely protective of his people and loyal to the Matriarch. However, years of fighting the Flesh Raiders gave him a deep hatred of the natives, and he believed that it was better to strike against one's enemy than to strengthen oneself. Resentment of the Jedi drove Moorint and the villagers to sacrifice Orgus Din and his apprentice, but the Scout Chief did not enjoy betraying the Jedi who had aided his people. He was also a skilled scout and tracker, achieving the post of Scout Chief in his village and commanding the Pilgrims' scouts at the behest of the Matriarch.\nMoorint first appeared in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare and LucasArts on December 20, 2011. He appears in the Prologue of the Jedi Knight storyline on Tython, during several of the cutscenes in various missions. In the mission \"High-Tech Savages,\" Moorint suggests that the player destroy the weapons cache, a dark side option, while Tao'Ven asks the player to recover the weapons for the villagers . Moorint can later be killed in \"Dark Temptations\" along with Eseni and Saylew for dark side points, while the light side option is to Force-persuade the villagers to leave in peace. This article assumes that the player chooses only the moral light side options as a Republic Jedi Knight character, and therefore assumes that Moorint and the others survive.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Tython/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pilgrims",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Scout_Chief",
  "/wiki/Kalikori_village",
  "/wiki/Planet/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Scout/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Matriarch",
  "/wiki/Sumari",
  "/wiki/Flesh_Raider_uprising",
  "/wiki/Flesh_Raider",
  "/wiki/Death/Legends",
  "/wiki/Ranna_Tao%27Ven",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Bengel_Morr",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Human/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_War",
  "/wiki/Kolovish",
  "/wiki/Ryloth/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Time/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/3651_BBY",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Tythos_Ridge",
  "/wiki/Mountain/Legends",
  "/wiki/Jedi_Temple_(Tython)/Legends",
  "/wiki/3650_BBY",
  "/wiki/Standard_year/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Bashenn",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/3643_BBY",
  "/wiki/Tythonian_Gnarls",
  "/wiki/Callef",
  "/wiki/Gnarls_cave",
  "/wiki/Padawan/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Parent/Legends",
  "/wiki/Upper_Hollows",
  "/wiki/T7-series_astromech_droid",
  "/wiki/T7-O1",
  "/wiki/Kaleth",
  "/wiki/Skirmish_at_the_ancient_shrine",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Flesh_Raider_command_base",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Assault_on_the_Flesh_Raider_command_base",
  "/wiki/Raid_on_the_Tythos_Ridge_shield_generator",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Skirmish_in_the_Kalikori_village_fields",
  "/wiki/Distress_signal/Legends",
  "/wiki/Eseni",
  "/wiki/Saylew",
  "/wiki/Mind_trick/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Battle_of_the_Forge",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}