{
 "name": "Morad Sumar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    },
    {
     "name": "Died",
     "values": [
      "2 BBY",
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.84 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "75 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Copper"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Lothal resistance group"
     ]
    }
   ]
  }
 ],
 "content": "Morad Sumar was a human farmer on Lothal, and an old friend of Ezra Bridger's parents. During the reign of the Galactic Empire, he struggled to keep his land from Imperial hands, refusing to sell it to them. Finally forgoing Sumar's refusal to sell, Supply Master Yogar Lyste destroyed a portion of the farm and had Sumar and his wife Marida arrested. However, Bridger and the Lasan High Honor Guardsman Zeb Orrelios, who had stolen an Imperial TIE fighter, came to their rescue.\nMorad Sumar was a human male who lived on the planet Lothal during the Age of the Empire. In 4 BBY, he owned a farm on the outskirts of Kothal city and was an old friend of the rebel Ezra Bridgers parents. While on a grocery shopping trip, Ezra encountered Morad, who operated a fruit stall in the Kothal market. Morad gave Ezra a jogan fruit but was unable to sell the boy a Meiloorun fruit since the species did not grow on Lothal.\nShortly later, Morad was visited by the Imperial Supply Master Yogar Lyste, who wanted to buy his farm. However, Sumar refused to sell his land to the Empire. Unwilling to let the matter rest, Lyste revisited the farm with three Imperial Troop Transports and a contingent of stormtroopers. When Morad protested that he was not changing his mind, Lyste smugly responded that the Empire was no longer interested in buying his farm and ordered his men to raze the farm. Morad, his wife Marida Sumar, and their Aqualish helper were then arrested and loaded into the side compartments of a Troop Transport.\nWhile traveling on the plains of Lothal, the Imperial transports encountered a stolen TIE fighter, that had been stolen by Ezra and his rebel companion Garazeb Orrelios. When the transports opened fire on the TIE fighter, Ezra managed to leap onto the central transport. Using the Force, the young Jedi apprentice managed to free Morad, his wife, and their helper from their restraints. At Ezra's instruction, the trio jumped into the grassy plains and fled. Meanwhile, Ezra stole a crate of meiloorun fruit and escaped with Zeb.\nBy 2 BBY, Morad and his wife Marida had joined a rebel cell led by Ryder Azadi, the former Governor of Lothal. By then, Morad had found work as a factory worker at the Imperial Armory Complex, which manufactured vehicles for the Imperial Military. There, he was referred to by the call sign Worker 5473. Under Ryder's direction, Morad sabotaged Imperial vehicles, leading to a high rate of accidents. That year, Morad, his wife, and the Ithorian bartender Jho attended a night meeting at Ryder's stone circle in Lothal's wilderness. The rebels were joined by Ezra Bridger, Kanan Jarrus, and the astromech droid Chopper, members of the Spectres who had since joined the Phoenix Cell, which was part of the galactic-wide rebellion against the Empire.\nUpon seeing Ezra, Morad observed that the boy had grown and told him that his late parents would be proud. Morad and his comrades soon learned that Ezra and his companions were on Lothal to enlist help from another Rebel cell to take out the Imperial factory on Lothal. Morad and his wife cheered upon hearing this news. Ezra also informed Morad and Ryder that their contact Fulcrum had provided them with intelligence that the Empire was building a new type of weapon and that the Phoenix Squadron needed to know what it was before committing any attack. Morad suspected that the tightening of security in the factory's Section A2 was linked to the weapon and agreed to help Ezra and his rebels comrades infiltrate the factory.\nThe following day, Morad managed to obtain workers' overalls and hoods for Ezra and Kanan. Chopper was also disguised as an Imperial courier droid. After arriving, Morad and his rebel allies were summoned for an assembly convened by Governor Arihnda Pryce, Agent Kallus, and Lieutenant Yogar Lyste. The factory was visited by Grand Admiral Thrawn, who had been dispatched by Imperial High Command to investigate the high rate of malfunctioning vehicles produced by the Lothal factory. Thrawn gave a speech berating the workers for their poor craftsmanship and then summoned Morad for a test demonstration on a 614-AvA speeder bike.\nWhen Thrawn asked Morad if he had been pressed into the Empire's service, Sumar confirmed that this was the case after losing his farm. Sumar also professed to take pride in his craftsmanship. Since the speeder bike had been the last vehicle that Morad personally inspected, Thrawn ordered him to demonstrate how quickly it could reach maximum speed. With little choice, Morad got on the speeder and powered up the engine. As he began to accelerate, the speeder slowly began to overheat. Morad recommended they shut it down but Thrawn urged him to keep going and accelerated the stimulator. This caused the overheating engine to explode, destroying the bike and killing Morad.\nMorad's death horrified Ezra, Kanan, the other workers and even Agent Kallus and Lieutenant Lyste. Having sufficiently intimidated the workers, Thrawn then warned the workers that they would personally test each machine that they built. Thrawn also ordered his subordinates to lock down the factory and question the workers. Not wanting Morad to have died in vain, Ezra and his rebel comrades continued their mission and managed to obtain the blue prints for the Imperial weapon, which turned out to be a TIE Defender. With the help of a disillusioned Kallus, the Spectres managed to escape and escape with Ryder's group into the wilderness. Ezra also informed Marida of her husband's death.\nMorad Sumar was a human male Lothalian farmer who owned a farm outside Kothal. He specialized in growing fruits including jogan fruits. He was a friend of the Bridger family. Sumar was opposed to selling his farm to the Empire, who retaliated by razing it to the ground and seizing the land. This incident turned Morad and his wife Marida against the Empire. The two then joined a rebel cell led by the former Lothalian Governor Ryder Azadi. Morad used his position as a factory worker at the Lothal City Imperial Armory Complex to sabotage Imperial vehicles, thus hampering the Imperial war effort.\nMorad had a deep respect for Ezra and his parents and praised the Bridgers for their work in the rebellion. Morad was visibly intimidated by the Chiss Grand Admiral Thrawn but nevertheless complied with his orders in order to avoid blowing his rebel cover and exposing his comrades. Due to his work as a factory worker, Morad had some experience with operating and inspecting speeder bikes. He was aware that the speeder bikes tended to overheat when reaching maximum speed.\nMorad Sumar first appeared as as supporting character in the Star Wars Rebels Season One episode \"Fighter Flight,\" which premiered on October 13, 2014. He was voiced by Liam O'Brien, who also voiced the antagonistic Yogar Lyste and a stormtrooper in the same episode. O'Brien reprised his role as Morad Sumar in the Season Three episode \"An Inside Man,\" which premiered on Disney XD on December 3, 2016.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Lothal",
  "/wiki/2_BBY",
  "/wiki/Human",
  "/wiki/Lothalite",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Lothal_resistance_group",
  "/wiki/Farmer",
  "/wiki/Ezra_Bridger",
  "/wiki/Parent",
  "/wiki/Morad_Sumar%27s_farm",
  "/wiki/Supply_Master",
  "/wiki/Yogar_Lyste",
  "/wiki/Marriage",
  "/wiki/Marida_Sumar",
  "/wiki/Lasan",
  "/wiki/Lasan_High_Honor_Guard",
  "/wiki/Garazeb_Orrelios",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Attack_on_Imperial_Troop_Transports",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/4_BBY",
  "/wiki/Kothal",
  "/wiki/City",
  "/wiki/Kothal_market",
  "/wiki/Jogan_fruit",
  "/wiki/Meiloorun_fruit",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Stormtrooper",
  "/wiki/Aqualish",
  "/wiki/Rebels_TIE_fighter",
  "/wiki/The_Force",
  "/wiki/Padawan",
  "/wiki/Ryder_Azadi",
  "/wiki/Governor",
  "/wiki/Imperial_Armory_Complex",
  "/wiki/Imperial_Military",
  "/wiki/Ithorian",
  "/wiki/Jho",
  "/wiki/Stone_circle",
  "/wiki/Kanan_Jarrus",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Spectres",
  "/wiki/Phoenix_Cell",
  "/wiki/Fulcrum",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/R4_courier_droid",
  "/wiki/Arihnda_Pryce",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Lieutenant",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Imperial_High_Command",
  "/wiki/614-AvA_speeder_bike",
  "/wiki/Bridger_family",
  "/wiki/Chiss",
  "/wiki/Star_Wars_Rebels_Season_One",
  "/wiki/Fighter_Flight",
  "/wiki/October_13",
  "/wiki/2014",
  "/wiki/Liam_O%27Brien",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/An_Inside_Man",
  "/wiki/Disney_XD",
  "/wiki/December_3",
  "/wiki/2016",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Star_Wars_Rebels",
  "/wiki/TIE_Fighter_Trouble",
  "/wiki/Star_Wars_Rebels:_Recon_Missions",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Star_Wars_Rebels:_Head_to_Head",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Databank_A-Z",
  "/wiki/Databank_(website)",
  "/wiki/Death",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Mon_Mothma",
  "/wiki/Declaration_of_the_Rebel_Alliance",
  "/wiki/Battle_of_Yavin"
 ]
}