{
 "name": "Morai",
 "display_name": "Morai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mortis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Convor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "0.2 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Feathers",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Daughter",
      "The Force"
     ]
    }
   ]
  }
 ],
 "content": "Morai was a female convor with spiritual ties to the Daughter, a Force wielder from Mortis. She appeared in various depictions of the Force wielders alongside the Daughter. It was believed by some that the convor in these depictions was a servant of the Daughter or even a manifestation of the Daughter herself in another form. Morai became a friend of former Jedi Padawan Ahsoka Tano, whom the Daughter transferred her life essence into prior to her death, and came to accompany and watch over her. Tano claimed that she owed the convor her life.\nMorai was a female convor known to have spiritual ties to the Daughter, one of the Force wielders of Mortis. She was shown alongside the Daughter in various depictions of them, such as the painting of the Mortis gods in the Lothal Jedi Temple. Some believed that Morai was a servant of the Daughter, or even a manifestation of the Daughter herself in another form. In 20 BBY, the Jedi Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano visited Mortis, as the Father had wanted to test whether Skywalker was the Chosen One of prophecy. During the events that followed, Tano was killed by the Son, who later stabbed his sister with the Dagger of Mortis when she jumped in front of it to protect her father. Dying, the Daughter sacrificed her remaining life force to revive Tano. The Father later killed himself and the Son before the three Jedi were returned to the normal universe.\nIn time after the life force transferal, Morai became a friend of Tano, coming to watch over her. According to Tano, she owed Morai her life. A few years after the rise of the Galactic Empire, Skywalker, now the Sith Lord Darth Vader, visited the moon where the Venator-class Star Destroyer Tribunal had crashed during Order 66, as it had been carrying Tano and Rex at the time, although they had escaped. Vader found the abandoned lightsaber of his former apprentice in the wreckage, and looked up to see Morai circling above him in the sky before he left the scene.\nDuring the establishment of Chopper Base on Atollon, Morai was present and watched the conflict between the crew of the Ghost and the krykna. Later, Ezra Bridger watched Morai fly overhead before Tano arrived so she, Bridger, and Kanan Jarrus could travel to Malachor. When Bridger entered the World Between Worlds, Morai was present and encouraged him to save Tano by pulling her out of a portal. After reuniting with Tano, she was present when Tano and Bridger fought against Emperor Palpatine. Morai accompanied Tano when she returned through the portal to the ruined Malachor Sith Temple. As Tano returned to the temple interior, Morai overlooked an injured Darth Vader as he limped away from the scene.\nMorai was later present for the meeting of the Mandalorian Din Djarin and Tano in 9 ABY on the planet Corvus.\nMorai was a female convor with green and white feathers and green eyes. Associated with the Daughter, Morai was attuned to the light side of the Force.\nMorai first appeared in the Star Wars Rebels season two episode \"The Mystery of Chopper Base,\" and was first identified in the fourth season episode \"A World Between Worlds.\"\nAccording to Star Wars: The Clone Wars supervising director Dave Filoni, Morai's appearance during the final moments of \"Victory and Death\" went through different versions, including one in which Morai perched on the BTL-B Y-wing starfighter/bomber. However, besides having to take into consideration how much time and budget he had for the episode, Filoni felt that the scene was not playing right, which led to the final version of the convor's appearance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Morai",
  "/wiki/Mortis",
  "/wiki/Convor",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Daughter",
  "/wiki/The_Force",
  "/wiki/Force_wielder",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Death",
  "/wiki/Painting_of_the_Mortis_gods",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/20_BBY",
  "/wiki/Anakin_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mission_to_Mortis",
  "/wiki/Father_(Mortis)",
  "/wiki/Chosen_One",
  "/wiki/Son",
  "/wiki/Dagger_of_Mortis",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Unidentified_moon_(Tribunal)",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Tribunal",
  "/wiki/Order_66",
  "/wiki/Rex",
  "/wiki/Skirmish_aboard_the_Tribunal",
  "/wiki/Ahsoka%27s_lightsabers",
  "/wiki/Chopper_Base",
  "/wiki/Atollon",
  "/wiki/Spectres",
  "/wiki/Ghost",
  "/wiki/Krykna",
  "/wiki/Ezra_Bridger",
  "/wiki/Kanan_Jarrus",
  "/wiki/Mission_to_Malachor",
  "/wiki/Malachor",
  "/wiki/Mission_to_the_Lothal_Jedi_Temple",
  "/wiki/World_Between_Worlds",
  "/wiki/Portal",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Malachor_Sith_Temple",
  "/wiki/Sith_temple",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/9_ABY",
  "/wiki/Corvus",
  "/wiki/Eye",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/The_Mystery_of_Chopper_Base",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/A_World_Between_Worlds",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/Victory_and_Death",
  "/wiki/BTL-B_Y-wing_starfighter/bomber",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Wolves_and_a_Door",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/The_Mandalorian",
  "/wiki/Chapter_13:_The_Jedi",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWars.com",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Premium_Format_Figures",
  "/wiki/Star_Wars_Inside_Intel:_Religions_of_the_Force",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Overlords",
  "/wiki/Altar_of_Mortis_(episode)",
  "/wiki/Ghosts_of_Mortis",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/4_ABY"
 ]
}