{
 "name": "Morad%27Ka",
 "display_name": "Morad'Ka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jaraana irstat"
     ]
    }
   ]
  }
 ],
 "content": "Morad'Ka was a female Tarasin who lived on Cularin during the time of the Clone Wars. She was the leader of the Jaraana irstat, a Tarasin tribe.\nDuring the time of the Clone Wars, the Dark Jedi Raik Muun visited the village where the Jaraana irtsat lived, in disguise as a Jedi. She tried to persuade Moraad'Ka to travel with her to the Cloud Mountain cavern, as she hoped to trick the Tarasin into helping her free to the t'salak, a dangerous creature that was imprisoned there. Morad'Ka refused, as she sensed that something was not right.\nA short time afterward, Morad'Ka was contacted by the Jedi of the Almas Academy, who asked her if she could give them the t'salak, so that they could study it. Morad'Ka agreed and contacted the Jedi Knight Nek Lawsirk, telling him that he could come and collect the creature from her. However, Muun had captured Lawsirk and disguised herself as him, so came to collect the creature instead. Morad'Ka gave her the creature, but afterward suffered a number of disturbing visions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Jaraana_irstat",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Raik_Muun",
  "/wiki/Jedi/Legends",
  "/wiki/Cloud_Mountain_cavern",
  "/wiki/T%27salak",
  "/wiki/Almas_Academy",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Nek_Lawsirk",
  "/wiki/Force_Concession",
  "/wiki/Force_Contention",
  "/wiki/Force_Convention"
 ]
}