{
 "name": "Moradmin Bast",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Officer Corps",
      "Imperial Army",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Moradmin Bast was a human male officer in the Imperial military during the Galactic Civil War. An Imperial general, he served as a chief aboard the Death Star prior to the Battle of Yavin. Bast was present in a command meeting aboard the Death Star, in which various high-ranking military officers, including the station's commander, Grand Moff Wilhuff Tarkin, discussed the threat posed by the Alliance to Restore the Republic. When the Rebels ultimately attacked the battle station, Bast encouraged Tarkin to evacuate, but the Grand Moff refused. Shortly thereafter, the Rebels destroyed the Death Star and killed Bast.\nMoradmin Bast was a general in the ground forces of the Galactic Empire, and he was stationed as a chief aboard the Death Star during the Galactic Civil War. Early in the war, the Alliance to Restore the Republic was able to steal the plans to the Death Star, hoping to find a weakness in the battle station and destroy it. Bast was present in a meeting aboard the Death Star that included several high-ranking officers, including General Cassio Tagge, Admiral Conan Antonio Motti, Darth Vader, and the station's commander, Grand Moff Wilhuff Tarkin. The Imperials discussed the potential threat posed by the Rebellion, and multiple opinions were expressed. Motti believed that the Rebel Alliance did not pose a threat, while Tagge expressed concerns that the Rebellion was more powerful than other Imperials realized. It was also in this meeting that the assembled officers learned that the Emperor, Darth Sidious, had dissolved the Imperial Senate and given direct territorial control to the regional governors, including Tarkin himself.\nShortly thereafter, the Millennium Falcon was captured by the Death Star after it entered the remains of Alderaan, which had been destroyed by the Death Star. The ship carried the stolen plans, along with Jedi Master Obi-Wan Kenobi—Vader's former master. The crew of the ship rescued Princess Leia Organa from the station's prison. During the rescue, Kenobi and Vader engaged in a lightsaber duel. Kenobi allowed Vader to kill him, giving the other Rebels a chance to escape, and the Jedi Master's body disappeared upon being struck by Vader's lightsaber. As the Rebels escaped, Bast approached Vader, who inspected the empty robes that Kenobi left behind. Bast asked who the man was, and Vader brushed the Jedi Master off as an old man who wrongly thought he could help gifted children.\nBefore the Rebels had escaped, the Empire placed a tracking device on the Millennium Falcon. The Death Star followed the ship to the Great Temple, the Rebel base on Yavin 4, where Tarkin intended to use the station's planet-destroying capabilities to destroy Yavin 4 and, with it, the Rebellion. The Death Star's arrival led to the Battle of Yavin, with the Rebels attacking after finding a weakness in the station's design. Imperials aboard the Death Star analyzed the Rebel attack and learned that the station could be in danger. Bast presented this information to Tarkin and asked whether the Grand Moff wanted to evacuate. Tarkin rejected the offer, chastising Bast for what Tarkin saw as the chief overestimating the chances of the Rebellion. Bast's concerns were proven correct when Rebel pilot Luke Skywalker fired a proton torpedo into one of the station's exhaust port and hit the main reactor, thanks to the Millennium Falcon, piloted by Han Solo, and Chewbacca, showing up late in the battle. The attack set off a chain reaction within the station, and the Death Star was destroyed in a massive explosion which killed everyone on board including Bast.\nBast was a human male. He had brown hair, light-colored eyes, and brown sideburns on the sides of his face. By the time of the Battle of Yavin, Bast came to see the Rebels as a potential threat to the security of the Death Star, and unsuccessfully encouraged Tarkin to leave the doomed station before its destruction.\nChief Bast first appeared in the 1977 film Star Wars: Episode IV A New Hope, where he was portrayed by Leslie Schofield and credited only as \"Commander #1.\" One scene depicting Chief Bast was deleted from the film. In that scene, Bast provides Darth Vader with an update regarding the search for the Death Star plans on Tatooine. Vader tells Bast to send more Imperial forces to Tatooine if they are needed, as he believes finding the Death Star plans is the key to getting Princess Leia to succumb to the pressures of her interrogation aboard the Death Star and reveal the location of the Rebel base. Footage of the scene was used, with its dialogue altered, in 1978 for The Star Wars Holiday Special. The scene was released in 2011 as part of the Star Wars: The Complete Saga Blu-ray set.\nThe character's name of Bast originated in 1991 as part of the Star Wars Legends book Death Star Technical Companion, a sourcebook for West End Games. His first name, his importance to the Imperial Army, and his rank of general were mentioned in Star Wars: Card Trader.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Moradmin_Bast",
  "/wiki/Moradmin_Bast/Legends",
  "/wiki/Age_of_Rebellion_-_Grand_Moff_Tarkin_1",
  "/wiki/0_BBY",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/File:BastTarkin.ogg",
  "/wiki/Imperial_Military",
  "/wiki/Galactic_Civil_War",
  "/wiki/General",
  "/wiki/Chief",
  "/wiki/Battle_of_Yavin",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_station",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Cassio_Tagge",
  "/wiki/Admiral",
  "/wiki/Conan_Antonio_Motti",
  "/wiki/Anakin_Skywalker",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Imperial_Senate",
  "/wiki/Governor",
  "/wiki/Millennium_Falcon",
  "/wiki/Alderaan",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Lightsaber",
  "/wiki/Force_spirit",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Planet",
  "/wiki/Rebel_pilot",
  "/wiki/Luke_Skywalker",
  "/wiki/Proton_torpedo",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Leslie_Schofield",
  "/wiki/Tatooine",
  "/wiki/1978",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/1991",
  "/wiki/Star_Wars_Legends",
  "/wiki/Death_Star_Technical_Companion",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/An_Incident_Report",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Databank_(website)"
 ]
}