{
 "name": "Moregi%27s_son",
 "display_name": "Moregi's son",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pantora"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "The son of Moregi was a male Rodian who lived on Pantora and was the adopted child of the Volpai Moregi during the Clone Wars. His biological mother was a Rodian woman who had produced the child through a relationship with an unidentified Rodian male. Later, his mother met the Volpai named Moregi and the two married despite coming from different species. To support his struggling family, Moregi embezzled funds from the Rang Clan, leading the crime syndicate to place a bounty on his head. Following a lengthy pursuit, the Dathomirian bounty hunter Asajj Ventress and her partner Quinlan Vos tracked Moregi down to his apartment and apprehended him following a struggle.\nThe male Rodian youngling lived on the Pantoran homeworld of Pantora with his mother and adopted father Moregi. Despite not being sired by Moregi and coming from a different species, Moregi still loved the youngling as his own. As an infant, the Rodian child had to be carried by his mother and had at least one small stuffed toy. He and his parents lived in a four-storey apartment room with a bell-shaped window covered in blue and yellow curtains. His family's financial situation was poor and led his adoptive father Moregi to embezzle funds from the Rang Clan.\nThe Rang Clan hired the Dathomirian bounty hunter Asajj Ventress to apprehend Moregi. Following four unsuccessful attempts, Ventress managed to locate Moregi's home with the help of Quinlan Vos, an undercover Jedi Master who had been sent to recruit Ventress for a mission to assassinate Count Dooku. Using his psychometric powers, Vos learned that Moregi had a Rodian wife and child. They tracked Moregi down to his apartment where they managed to take the Volpai into custody following a prolonged struggle and pursuit.\nMoregi's son had blue skin and at least one small stuffed toy. He was loved by both his parents including his adoptive father Moregi, a Volpai who had met his mother. Due to his young age, the Rodian child still had to be carried by his mother. His father liked to caress the Rodian child. As a result of his young age, Moregi's child was unaware of his adoptive father's financial problems and troubles with the Rang Clan and bounty hunters.\nMoregi's son first appeared as an unidentified minor character in Christie Golden's 2015 novel Dark Disciple, which was based on eight unproduced screenplays from the canceled Cartoon Network TV series Star Wars: The Clone Wars. Dark Disciple is part of the Canon The Clone Wars Legacy, an ongoing multimedia project using material from the canceled series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pantora",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Moregi",
  "/wiki/Volpai",
  "/wiki/Clone_Wars",
  "/wiki/Moregi%27s_wife",
  "/wiki/Rang_Clan",
  "/wiki/Bounty",
  "/wiki/Dathomirian",
  "/wiki/Bounty_hunter",
  "/wiki/Asajj_Ventress",
  "/wiki/Quinlan_Vos",
  "/wiki/Youngling",
  "/wiki/Pantoran",
  "/wiki/Homeworld",
  "/wiki/Parent",
  "/wiki/Species",
  "/wiki/Capture_of_Moregi",
  "/wiki/Jedi_Master",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/Assassin",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Psychometry",
  "/wiki/Force_power",
  "/wiki/Christie_Golden",
  "/wiki/2015",
  "/wiki/Dark_Disciple",
  "/wiki/Cartoon_Network",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars_Legacy",
  "/wiki/Dark_Disciple_(audiobook)"
 ]
}