{
 "name": "Moreena_Krai",
 "display_name": "Moreena Krai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Moreena Krai, sometimes shortened to just Mo, was a female human who lived on the planet Lothal during the early years of the Galactic Empire's reign. She and her family left the planet after the Empire condemned their farm and took the land from them. She was a close friend of the street urchin Ezra Bridger and said goodbye to him before leaving.\nThe human female Moreena Krai was born on the planet Lothal, where she and her younger sister lived with their parents on their family's farm during the early years of the Galactic Empire's reign. During her childhood she became good friends with another Lothal native, the street urchin Ezra Bridger, who was the same age as her. When Krai was fourteen, the Empire condemned her family's farm and took it from them, as the Imperials needed the land for an extension of their mining operation. Krai's parents swiftly decided to leave Lothal, and arranged for the whole family to move to the planet Alderaan to live with Krai's grandmother.\nThe move happened so fast that Krai did not have time to contact Bridger, but she ran into him at Capital City spaceport as she was queuing to board a transport offworld. She explained to her friend what had happened and asked why he was at the spaceport and if he wanted to leave Lothal. The urchin explained that he was there selling tickets for a gladiatorial event and that he did not plan on leaving, then the pair said their goodbyes and Krai was called back to the ship by her father.\nKrai became upset when saying goodbye to Bridger and began to cry; however, he cheered her up again before she left. Thinking of her friend alone on Lothal without his parents made her sad, and she asked if he had ever considered leaving Lothal as well. She had red hair, blue eyes and fair skin.\nMoreena Krai first appeared in Ezra's Gamble, a junior novel written by Ryder Windham and published in 2014.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lothal",
  "/wiki/Human",
  "/wiki/Lothalite",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/Galactic_Empire",
  "/wiki/Krai_family_farm",
  "/wiki/Ezra_Bridger",
  "/wiki/Reproduction",
  "/wiki/Moreena_Krai%27s_sister",
  "/wiki/Parent",
  "/wiki/Imperial_Era",
  "/wiki/Farm",
  "/wiki/Mining",
  "/wiki/Alderaan",
  "/wiki/Moreena_Krai%27s_grandmother",
  "/wiki/Time",
  "/wiki/Capital_City",
  "/wiki/Capital_City_spaceport",
  "/wiki/Transport",
  "/wiki/Spaceport",
  "/wiki/Gladiator_Night",
  "/wiki/Moreena_Krai%27s_father",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Ezra%27s_Gamble",
  "/wiki/Ryder_Windham",
  "/wiki/2014",
  "/wiki/Rebel_Journal_by_Ezra_Bridger"
 ]
}