{
 "name": "Morgan Elsbeth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corvus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.65 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy",
      "Morgan Elsbeth's army"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Thrawn"
     ]
    }
   ]
  }
 ],
 "content": "Morgan Elsbeth was a human female who was instrumental in the construction of the Imperial Navy during the reign of the Galactic Empire. By around 9 ABY, she served as magistrate of Calodan on the planet Corvus. Elsbeth was in possession of a spear made of pure beskar, and offered it as payment to the Mandalorian Din Djarin if he killed the former Jedi Ahsoka Tano. At that time, her army wore stylized versions of a chimaera, the personal symbol of her patron, Grand Admiral Thrawn, and the emblem of the 7th Fleet. However, Djarin and Tano banded together and ended up defeating Elsbeth and her forces. Upon besting the magistrate in combat, Tano demanded Elsbeth reveal the location of her master, Thrawn.\nDuring the Clone Wars, Morgan Elsbeth's people were massacred, embittering her and eventually pushing her to assist in strengthening the Imperial Navy during the reign of the Galactic Empire by plundering entire worlds of their natural resources. At some point in her life, she also acquired a pure beskar staff, which she gained proficiency in wielding.\nSometime prior to circa 9 ABY Elsbeth had obtained the position of magistrate of the city of Calodan, a walled-in city located on the forest planet of Corvus, her homeworld. She employed Lang, a human male ex-military mercenary, to act as both her personal enforcer and the leader of her army.\nAround 9 BBY, Elsbeth encountered former Jedi Ahsoka Tano on the city of Calodan, who confronted the magistrate and demanded that she give her the information she was privy to regarding the whereabouts of Elsbeth's master, Grand Admiral Thrawn. As Tano had began her search for Thrawn and Jedi Padawan Ezra Bridger after they were driven from Lothal by Purrgil to an unknown location. The Magistrate refused to give the Togruta the whereabouts of the Chiss naval commander and threatened to execute the city's inhabitants unless peace was reached, Elsbeth also asked Tano how many lives what the knowledge she possessed was worth to her, and later told her that thanks to her, Calodan's people would suffer. Tano told Elsbeth that they already suffered under her rule, and that she had one day to decide if she would tell Tano what she knew about Thrawn's whereabouts.\nDin Djarin, a Mandalorian bounty hunter, later arrived on Corvus in search of Tano, as Bo-Katan Kryze had previously told him she was in Calodan, he approached Elsbeth's villa—after Lang interrogated him at the city's gate—where she offered Djarin a contract to kill Tano in exchange for her pure beskar spear. Djarin inquired where she was located as he was actually searching for Tano so she could train the youngling Grogu as a Jedi, though this was unknown to Elsbeth, The magistrate gave the Mandalorian gunslinger the coordinates in which she should be located. When Din located Tano, they teamed up to overthrow Elsbeth, ending her rule over Calodan, and obtaining what each of them wanted, the pure beskar spear and the location of Thrawn.\nAs part of the ploy, Ahsoka returned to the town, with one of Djarin's pauldrons as proof of having seemingly killed him, and asked Elsbeth once again to reveal the whereabouts of her hidden master, Thrawn. The magistrate merely dispatched her enforcer and forces to deal with the Togruta, before instructing the guards to execute the tortured civillians and then go door to door. After dealing with the thugs, Ahsoka dueled with Elsbeth herself, who brandished the beskar spear in combat. The magistrate even disarmed the former Jedi of one of her lightsabers. However Tano succeeded in outmatching Elsbeth, and asked her about the location of Thrawn. Meanwhile, Djarin made Lang surrender his weapon, until the mercenary attempted to shoot the Mandalorian with his hold-out blaster, which was unsuccessful and resulted in his death. Djarin had both eliminated Elsbeth's army and rescued the citizens that were being tortured while Tano had defeated Elsbeth herself, ending her despotic rule over Calodan and liberating the citizens from her yoke. Wing received Elsbeth's cape and became the Governor of Calodan while the citizens celebrated their new ruler and their newfound freedom.\nElsbeth was a vindictive and ruthless individual, a personality molded by the pain of losing her own people in a massacre. Her vengeance and anger led her to a life dedicated to the conquest of numerous worlds, for the sole benefit of the Imperial Navy. The embittered magistrate was willing to sacrifice innocent civilians, resorting to torturing them and using them as leverage against her enemies, openly admitting that their lives meant nothing to her, which she did at Calodan. Elsbeth was also an opportunist, quickly reaching the conclusion Din Djarin's position as a Mandalorian bounty hunter could be employed to her advantage, in an attempt to rid herself of the former Jedi Ahsoka Tano. Elsbeth also seemed to hold genuine allegiance to her concealed master, Thrawn, being very protective of her knowledge of the Grand Admiral's whereabouts.\nElsbeth made her first appearance in \"Chapter 13: The Jedi,\" the fifth episode of the season two of the television series The Mandalorian, written and directed by Dave Filoni and released on Disney+ on November 27, 2020. She was portrayed by Diana Lee Inosanto, with Lauren Kim serving as a stunt double. Inosanto's hair and makeup were done by Maria Sandoval and Alexei Dmitriew, respectively.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corvus",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Morgan_Elsbeth%27s_army",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Imperial_Era",
  "/wiki/9_ABY",
  "/wiki/Magistrate",
  "/wiki/Calodan",
  "/wiki/Beskar_spear",
  "/wiki/Beskar",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Death",
  "/wiki/Jedi",
  "/wiki/Ahsoka_Tano",
  "/wiki/Chimaera_(symbol)",
  "/wiki/Chimaera_(creature)",
  "/wiki/Grand_Admiral",
  "/wiki/7th_Fleet",
  "/wiki/Clone_Wars",
  "/wiki/Morgan_Elsbeth%27s_people",
  "/wiki/Planet",
  "/wiki/Staff",
  "/wiki/Hand-to-hand_combat",
  "/wiki/City",
  "/wiki/Forest",
  "/wiki/Lang",
  "/wiki/Military_rank",
  "/wiki/Mercenary",
  "/wiki/Captain_of_the_Guard",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Search_for_Ezra",
  "/wiki/Padawan",
  "/wiki/Ezra_Bridger",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Lothal",
  "/wiki/Purrgil",
  "/wiki/Togruta",
  "/wiki/Chiss",
  "/wiki/Navy",
  "/wiki/Commander",
  "/wiki/Standard_day",
  "/wiki/Bounty_hunter",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Jedi_Training",
  "/wiki/Youngling",
  "/wiki/Grogu",
  "/wiki/Gunslinger",
  "/wiki/Lightsaber",
  "/wiki/Despot",
  "/wiki/Wing",
  "/wiki/Governor",
  "/wiki/Chapter_13:_The_Jedi",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/The_Mandalorian",
  "/wiki/Dave_Filoni",
  "/wiki/Disney%2B",
  "/wiki/November_27",
  "/wiki/2020",
  "/wiki/Diana_Lee_Inosanto",
  "/wiki/Lauren_Mary_Kim",
  "/wiki/Maria_Sandoval",
  "/wiki/Alexei_Dmitriew",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Melee_and_Ranged_Weapons",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Mando_Mania",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/%22Show_Yourself,_Jedi.%22",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_Two)",
  "/wiki/Sideshow_Collectibles",
  "/wiki/1:10_Scale_Statues",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Time",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell"
 ]
}