{
 "name": "Morgana Onasi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Telos IV"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3958 BBY",
      "Telos IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Morgana Onasi was the wife of Carth Onasi and the mother of Dustil Onasi.\nCarth served in the Galactic Republic military during the Mandalorian Wars, leaving Morgana and Dustil on their own. At the end of the war, Carth came back to Telos with the intention of forever being with his family. However, at the outset of the Jedi Civil War Carth reenlisted, feeling that the Republic needed him. Morgana hated this choice, but accepted it.\nDuring the war, Telos came under attack by the Sith fleet. Admiral Saul Karath, ordered by Darth Malak, bombarded the planet from orbit as proof of his change of allegiance. Carth arrived with a Republic contingent soon after the bombing to find Morgana near death and Dustil missing. He held her and screamed for the medics, but she died before they arrived.\nWhen Carth and Dustil met two years later in the Sith Academy on Korriban, Dustil cited the failure of the Republic in general, and Carth in specific, to protect Morgana as a reason for his turn to the dark side.\nAccording to Carth, Morgana was courageous and stubborn. Carth said that he could never talk her out of anything she set her mind to.\nIn Star Wars: Knights of the Old Republic, Carth Onasi's wife went unnamed. David Gaider, who worked on the game as a writer, was the first to identify her as \"Morgana,\" and this name was later canonized in the  Knights of the Old Republic Handbook.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Telos_IV",
  "/wiki/3958_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Dustil_Onasi",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Onasi_family",
  "/wiki/Jedi_Civil_War",
  "/wiki/Bombing_of_Telos_IV",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Admiral/Legends",
  "/wiki/Saul_Karath",
  "/wiki/Darth_Malak",
  "/wiki/Planet/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/David_Gaider",
  "/wiki/Canon",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook",
  "/wiki/Timeline_9:_The_Mandalorian_Wars",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/March_14",
  "/wiki/2009"
 ]
}