{
 "name": "Morley",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lotho Minor"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Darth Maul's lair",
      "Lotho Minor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anacondan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "4.7 meters long"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    }
   ]
  }
 ],
 "content": "Morley was an Anacondan male native to Lotho Minor who lived during the Clone Wars, a conflict between the Galactic Republic and the Confederacy of Independent Systems. Morley helped provide the Sith Lord formerly known as Darth Maul with food during his exile in return for the \"leftovers,\" the food Maul did not consume.\nIn 20 BBY, the Anacondan encountered Maul's brother, Savage Opress, whom the Anacondan tricked into finding Maul without realizing that Opress intended to in fact find and help his brother. When Morley found that Maul had not killed Opress, he retreated from the scene. However, before he could escape, Opress grabbed Morley and strangled him as punishment for setting him up. He then threw Morley's corpse into a fire.\nMorley was an Anacondan male who lived on the junk planet Lotho Minor during the time of the Galactic Republic. Sometime between 32 BBY and 20 BBY, the fallen Sith apprentice Darth Maul was dumped on Lotho Minor and found by Morley. He brought the fallen Sith victims as food from which the serpentine alien got the leftovers. In 20 BBY, he observed the arrival of the Dathomirian Zabrak Savage Opress, Maul's brother, as Opress landed on the planet in a Terrapin-class Bulk Tanker in search of Maul. Morley greeted the Zabrak, who stamped on and choked the Anacondan. While being choked, Morley offered to guide Opress through the treacherous junk world, but the Zabrak rejected and continued his search for his brother.\nDespite Opress' rejection, Morley accompanied him and warned him about the many threats of Lotho Minor. As Morley mentioned the \"fire-breathers,\" massive droids that incinerated garbage on the planet, the pair were encountered by some of the droids and Opress had to follow the Anacondan to get to safety. After they got away from the \"fire-breathers,\" they ran into a group of fiercely territorial junkers, which Morley was not to keen about. As the pair moved further into the junkers' territory, the natives attacked. While Opress cut through most of the native scavengers with his lightsaber, Morley attacked one that was aiming at the unaware Zabrak.\nAfter Opress was finished with most of the junkers, the remaining fled. Morley then asked the Zabrak who he is looking for. Opress reluctantly answered that he was looking for his brother. In response, Morley asked if Opress' brother looked like him, and Opress asked if the Anacondan had seen him. Morley claimed to have heard stories of a horned man like Opress, which prompted the Zabrak follow the snake-like alien in suspicion that the horned man could be Maul. Shortly afterward, acid rain began to fall and Morley advised Opress to seek shelter. After a quick look around, Opress spotted a place with cover, which both took refuge at.\nIn the shelter, Morley pretended to be surprised by some dead bodies. Opress, believing to have been betrayed by Mother Talzin, stepped on a trap in his rage, which Morley sprung, and that dropped the Zabrak into a deep pit. Morley chuckled as he had lured another victim into his master's lair to be eaten. As Opress fell, Morley relished the thought of his master letting him feed on the leftovers. After some time, Morley came to his master's lair to eat on Opress' leftovers, but when he arrived, he realized that Opress was still alive. Morley tried to get away, but was grabbed by Opress and questioned about the state of his brother. But the Zabrak eventually choked the serpent to death and threw him into the fire.\nBecause of the harsh conditions on Lotho Minor and his believe in self-preservation, Morley needed cunning and would do anything to survive. Morley possessed two white eyes and brown skin with occasional gray stripes and was 4.7 meters  long.\nDuring the attack of the junkers on him and Opress, Morley used his body as a whip to disturb an aiming junker. He was also able to climb steep surfaces and coil around objects. The Anacondan was able to guide visitors through Lotho Minor, and could scavenge Lotho Minor's territories while surviving the planet's threats with his guile.\nMorley, who was voiced by Ben Diskin, first appeared in Brothers, the twenty-first episode of season four of the Star Wars: The Clone Wars television series, and first aired on March 9 2012. In the original script Morley was killed by Maul and not by Opress. Morley's mouth and animation design is a throwback to a time when creature effects were made with hand puppets. Morley also possessed the trait of cunning, which was common for snakes or snake-like beings and roots on a biblical creature, the serpent of Eden, who managed to tempt Eve to taste the forbidden fruit in the garden of Eden.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Morley",
  "/wiki/Morley/Legends",
  "/wiki/Morley_(disambiguation)",
  "/wiki/Lotho_Minor",
  "/wiki/20_BBY",
  "/wiki/Darth_Maul%27s_lair",
  "/wiki/Anacondan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Homeworld",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Foodstuff",
  "/wiki/Exile_(punishment)",
  "/wiki/Maul%27s_family",
  "/wiki/Savage_Opress",
  "/wiki/Death",
  "/wiki/Fire",
  "/wiki/File:Lotho_Minor_4.ogg",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/32_BBY",
  "/wiki/Sith_apprentice",
  "/wiki/Sith",
  "/wiki/Alien",
  "/wiki/Dathomirian",
  "/wiki/Zabrak",
  "/wiki/Terrapin-class_Bulk_Tanker",
  "/wiki/Refuse_incinerator_droid",
  "/wiki/Droid",
  "/wiki/Junker",
  "/wiki/Lightsaber",
  "/wiki/Snake",
  "/wiki/Acid_rain",
  "/wiki/Talzin",
  "/wiki/Time",
  "/wiki/Eye",
  "/wiki/Scavenger",
  "/wiki/Ben_Diskin",
  "/wiki/Brothers",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/March_9",
  "/wiki/2012",
  "/wiki/Revival_(episode)",
  "/wiki/Category:Audio_files_of_Morley",
  "/wiki/Category:Images_of_Morley",
  "/wiki/StarWars.com",
  "/wiki/Drawing_from_the_Imagination:_Mythological_Creatures_in_Star_Wars",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Massacre",
  "/wiki/Revenge_(episode)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace"
 ]
}