{
 "name": "Morlimur_Snugg",
 "display_name": "Morlimur Snugg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cybloc XII"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Snivvian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.88 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "InterGalactic Banking Clan"
     ]
    }
   ]
  }
 ],
 "content": "Morlimur Snugg was a Snivvian male superintendent who worked aboard the InterGalactic Banking Clan's Cybloc Transfer Station. After the station was raided by the renegade Sith Lords Maul and Savage Opress, Snugg relayed details of the heist to Jedi Masters Obi-Wan Kenobi and Adi Gallia, who had arrived at the station in response to a distress signal sent from it.\nMorlimur Snugg was a Snivvian male from the astronomical object Cybloc XII who held the position of superintendent aboard the InterGalactic Banking Clan's Cybloc Transfer Station, located in the Outer Rim Territories' Cybloc system. In 19 BBY, the station was raided by the Sith Lord Maul and his brother Savage Opress as part of their scourge across the Outer Rim. The Nightbrothers destroyed multiple squads of police droids and seized a fortune in credit chips as well as Snugg's cargo ship. Following the attack, Jedi Masters Obi-Wan Kenobi and Adi Gallia traveled to the station in order to investigate a distress signal sent from it.\nThe two Jedi met with Snugg in one of the station's main offices, where the warehouse supervisor informed them of the Zabraks' heist and that the credits they stole could not be traced. Snugg asked if the thieves were rogue Jedi, which Kenobi denied. The superintendent then requested that Kenobi ignite his lightsaber, and after seeing its blue blade, Snugg stated that the droids who had been attacked observed Maul's and Opress's sabers to be red. Kenobi told Snugg that the pair were Sith and stressed the importance of locating the brothers before their next attack. Snugg thus told the Jedi that the two had stolen his freighter, and the droid survivor of the raid had heard the Sertar sector mentioned. Having acquired a lead, Kenobi and Gallia left for the sector as Snugg examined the office.\nCapable in logistics and bureaucracy, Morlimur Snugg was no-nonsense and kept order aboard the Cybloc Transfer Station. He had brown hair, red eyes, and pale skin, and stood at 1.88 meters, or 6 feet, 2 inches. Due to a limited exposure to the Jedi and Sith, Snugg incorrectly assumed that Maul and Opress were rogue Jedi.\nSnugg wore silver boots and a blue jumpsuit, over which at his waist was a large black belt bearing a silver emblem. He also possessed a YV-865 Aurore-class freighter until it was stolen by Maul and Opress.\nMorlimur Snugg first appeared in \"Revival,\" the first episode of the animated television series Star Wars: The Clone Wars' fifth season, which aired on September 29, 2012. Credited simply as \"Warehouse Supervisor,\" the character was voiced by Jim Cummings.\nIn the new Star Wars canon, the name \"Morlimur Snugg\" was given in the 2021 reference book Star Wars: The Clone Wars: Character Encyclopedia - Join the Battle!, written by Jason Fry. The name originated in the Star Wars Legends 2013 young reader's book The Clone Wars: Darth Maul: Shadow Conspiracy, which was also written by Fry and adapted \"Revival\" as well as the other episodes featuring Darth Maul in The Clone Wars' fifth season.\nConcept art of Snugg by Carlos Sanchez was included as a slide in the Trivia Gallery of the StarWars.com Episode Guide for \"Revival.\" The slide stated that the episode's script described Snugg simply as having a \"slight build with a frontier twang.\" Ultimately, the character was made a Snivvian and given the same outfit as that of the \"Blue Snaggletooth\" Kenner action figure that was exclusive to the 1978 cantina playset available through the Sears catalog.\nA first pass character concept of Snugg for The Clone Wars revealed that the character's lower body and head were sourced from the Snivvian Katt Mol, who had appeared in the third season episode \"Padawan Lost.\" Snugg's upper body, hands, and boots, however, would be new assets.\nThe first pass concept art displayed three possible designs for the Snivvian supervisor, the first of which was a direct interpretation of the Blue Snaggletooth toy and was the one eventually utilized in the final episode. The second design gave Snugg a communication device above his left breast and several other pieces of technology to give him a \"warehouse feel,\" while the third opted for a yellow vest and shin guards as well as a different device strapped to his waist.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Morlimur_Snugg",
  "/wiki/Morlimur_Snugg/Legends",
  "/wiki/Cybloc_XII",
  "/wiki/Snivvian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Superintendent",
  "/wiki/Cybloc_Transfer_Station",
  "/wiki/Space_station",
  "/wiki/Raid_on_the_Cybloc_Transfer_Station",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Savage_Opress",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Adi_Gallia",
  "/wiki/Distress_signal",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Cybloc_system",
  "/wiki/19_BBY",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Nightbrothers",
  "/wiki/Squad",
  "/wiki/Police_droid_(spaceport_model)",
  "/wiki/Credit_chip",
  "/wiki/Unidentified_YV-865_Aurore-class_freighter",
  "/wiki/Jedi",
  "/wiki/Supervisor",
  "/wiki/Zabrak",
  "/wiki/Credit",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Droid",
  "/wiki/Lightsaber",
  "/wiki/Sith",
  "/wiki/YV-865_Aurore-class_freighter",
  "/wiki/Sertar_sector",
  "/wiki/Sector",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Boot",
  "/wiki/Jumpsuit",
  "/wiki/Belt",
  "/wiki/Freighter",
  "/wiki/Revival_(episode)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/September_29",
  "/wiki/2012",
  "/wiki/Jim_Cummings",
  "/wiki/Star_Wars",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Jason_Fry",
  "/wiki/Star_Wars_Legends",
  "/wiki/2013",
  "/wiki/The_Clone_Wars:_Darth_Maul:_Shadow_Conspiracy",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Carlos_Sanchez",
  "/wiki/StarWars.com",
  "/wiki/The_Clone_Wars_Episode_Guides",
  "/wiki/Zutton/Legends",
  "/wiki/Kenner_Products",
  "/wiki/1978",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Katt_Mol",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Padawan_Lost",
  "/wiki/Limb",
  "/wiki/Breast",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Five",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Morlimur_Snugg",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Onderonian_Civil_War",
  "/wiki/Standard_year",
  "/wiki/Rogue_One",
  "/wiki/Battle_of_Scarif",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Tipping_Points",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Eminence_(episode)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide",
  "/wiki/Star_Wars_(toy_line)"
 ]
}