{
 "name": "Morna Kee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Morna Kee was a loyal human female pilot and officer in the Galactic Empire, one of few remaining after the destruction of the Second Death Star. She was the pilot for Admiral Rae Sloane, and the two shared a good relationship. She was present on Akiva while the Imperial Future Council met to determine the fate of the Empire. When the meeting failed to come to a conclusion and Akiva began to revolt against the Imperial occupation, she flew the Golden Harp, a large yacht, in an attempt to flee. The ship was shot from the ground and heavily damaged, but she was able to fly through the Rebellion on Akiva safely and crash land on the Vigilance. She and Sloane then switched ships to a Lambda-class T-4a shuttle and fled to the Vanquish before making their escape into hyperspace. She was at one point in command of a VT-49 Decimator.\nMorna Kee was an Imperial Military pilot who lived during the Age of the Empire. At some point in her career, she was honored with command of a VT-49 Decimator. While piloting the ship, she came under attack by a pair of T-65 X-wing starfighters. Following the Battle of Endor, Morna accompanied her commander Admiral Rae Sloane, the aide Adea Rite, and several stormtroopers for an Imperial emergency summit on the Outer Rim planet Akiva to discuss the future of the Galactic Empire. They were also accompanied by the captured New Republic starfighter pilot Wedge Antilles, who had been taken prisoner during a recon mission above Akiva. While descending into the capital city Myrra, Sloane used the Lambda-class shuttle's weapons systems to shoot a Zabrak bounty hunter who had been spying on the Imperial ships from a nearby comm tower. This bounty hunter turned out to be Jas Emari, who later joined a rebel cell headed by the New Republic pilot Norra Wexley.\nDuring the Imperial Future Council's summit, Sloane instructed Adea to tell Morna to have the shuttle ready to take off after dinner in order to bring more delegates to the meeting. Before Adea could proposed getting Morna to plot hyperspace calculations into the shuttle computer, they received news that a New Republic freighter had entered Akiva's atmosphere. The freighter was shot down but one New Republic Special Forces soldier Jom Barell managed to land in Akiva's atmosphere.\nAfter Norra disrupted the Imperial summit by inspiring a rebellion on Akiva and destroyed several Imperial shuttles, Morna was wounded when a TIE fighter hijacked by Norra crashed into the Satrap's Palace. After getting her injuries treated, Morna complied with Sloane's orders to seize control over the Imperial financier Arsin Crassus' luxury yacht Golden Harp. When Crassus' pilot fought her, she overpowered him and locked him in one of the yacht's bedrooms. She and Admiral Sloane then flew the shuttle. Their passengers included Adea, Crassus, Grand Moff Valco Pandion, General Jylia Shale, Imperial Adviser Yupe Tashu, several stormtroopers and Emperor's Royal Guards. They were also accompanied by the rebel captives Norra, Jas Emari, and the former Imperial loyalty officer Sinjir Rath Velus. Norra's teenage son Temmin Wexley also managed to sneak aboard the ship and free his mother and her fellow rebels.\nAs they flew to Sloane's Imperial Star Destroyer Vigilance, the Golden Harp was struck by a turbolaser that had been hijacked by Jom. With much difficulty, Morna and Sloane managed to land the Golden Harp inside the Vigilance's hangar. During the crash-landing, Crassus and several Imperial passengers were killed. However, Norra and her rebel team survived and managed to capture Adea, General Shale, and Tashu. Morna and Norra then fled aboard another Imperial shuttle as the Vigilance came under attack from a New Republic fleet.\nAs they were flying their shuttle to the Star Destroyer Vanquish, Morna and Sloane were accosted by Grand Moff Pandion, who had managed to sneak aboard their ship. He demanded that Admiral Sloane take him to the Super Star Destroyer Ravager so that he could take control of the Empire's last Super Star Destroyer. Sloane rejected his demand and revealed that she was serving Fleet Admiral Gallius Rax.\nWhen Morna informed them that they were being pursued by a lone TIE fighter and New Republic ships, Sloane told Pandion to buckle in. When he refused and attempted to hijack the ship, Sloane grabbed the flight stick out of Morna's grip and pushed the ship into a quick spin. This caused Pandion to lose his footing. While Morna righted the shuttle, Sloane fired her blaster at Pandion and threw him out of the cockpit. Under Sloane's orders, she detached the cockpit from the shuttle while Rae set the shuttle's hyperdrive matrix to self-destruct. Pandion was killed during the ensuing explosion while Norra, who was flying the TIE fighter, was wounded. Meanwhile, Morna and Sloane traveled to the Vanquish and returned to the Ravager in the Vulpinus Nebula.\nMorna Kee was a loyal and competent Imperial pilot who served Admiral Rae Sloane following the Battle of Endor. She could fly several different ships including the Lambda-class shuttle and the yacht Golden Harp. Morna was familiar with the operating systems of Imperial starships. She was also knowledgeable of physical combat and used her combat skills to subdue Arsin Crassus' pilot in order to take control of his yacht.\nMorna Kee first appeared in Chuck Wendig's 2015 novel Aftermath, the first installment in The Aftermath Trilogy and part of the multimedia Journey to Star Wars: The Force Awakens multimedia franchise.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Officer",
  "/wiki/Battle_of_Endor",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Akiva",
  "/wiki/Imperial_Future_Council",
  "/wiki/Emergency_summit_on_Akiva",
  "/wiki/Golden_Harp",
  "/wiki/Yacht",
  "/wiki/Starship",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Vigilance_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Vanquish",
  "/wiki/Hyperspace",
  "/wiki/VT-49_Decimator",
  "/wiki/Imperial_Military",
  "/wiki/Pilot",
  "/wiki/Imperial_Era",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Adea_Rite",
  "/wiki/Stormtrooper",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/New_Republic",
  "/wiki/Starfighter",
  "/wiki/Wedge_Antilles",
  "/wiki/Mission_to_Akiva",
  "/wiki/Myrra",
  "/wiki/Zabrak",
  "/wiki/Bounty_hunter",
  "/wiki/Jas_Emari",
  "/wiki/Norra_Wexley",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/Jom_Barell",
  "/wiki/Arsin_Crassus",
  "/wiki/Grand_Moff",
  "/wiki/Valco_Pandion",
  "/wiki/General",
  "/wiki/Jylia_Shale",
  "/wiki/Yupe_Tashu",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Temmin_Wexley",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Hangar",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Ravager",
  "/wiki/Fleet_Admiral",
  "/wiki/Gallius_Rax",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Hyperdrive",
  "/wiki/Vulpinus_Nebula",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(novel)",
  "/wiki/Star_Wars:_The_Aftermath_Trilogy",
  "/wiki/Journey_to_Star_Wars:_The_Force_Awakens",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Imperial_Fighter_Squadrons_II_Expansion_Pack",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Hotshots_and_Aces_Reinforcements_Pack",
  "/wiki/Aftermath:_Life_Debt"
 ]
}