{
 "name": "Morrax Nabin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Morrax Nabin was a male Human and avid holochess player who served as Imperial governor in the years following the end of the Clone Wars. Around 17 BBY, Nabin attended a gala on the planet Alderaan to mark the launch of a new luxury hovertrain. After the train was attacked by Trandoshan mercenaries, Nabin sheltered in the hovertrain's casino car with his stormtrooper bodyguards.\nMorrax Nabin was a male Human who, having reached an advanced age, served the Galactic Empire as a governor during the years following the Clone Wars. Nabin had a penchant for holochess and on occasion played the Imperial leader Emperor Palpatine at the game. Circa 17 BBY, Nabin was among over one hundred members of the galactic elite invited to the planet Alderaan for the maiden journey of the luxury hovertrain Gem of Alderaan. Nabin attended a lavish opening party held at a hoverstation in the city Aldera and journeyed on the train as it departed on a six hour trip. Nabin was accompanied to the event by a detail of elite stormtrooper bodyguards that escorted him everywhere throughout the excursion.\nIn hope that someone would join him for a game, Nabin took up a spot at a holochess board in the train's lounge car. While he waited, the governor supped on Alderaanian brandy and conversed with the Sullustan executive Dien Suub and several the other guests, discussing subjects ranging from history to politics and financial markets. Eventually, Nabin was challenged at holochess by one of several Alderaanian Resistance agents that had infiltrated the event posing as aides of the Imperial Senator Bail Organa. The governor was defeated in the game and he felt favorably toward his chess opponent as a result. Nabin also ventured to the hovertrain's restaurant car and attended a banquet where he enjoyed some fine dining. While he ate, he conversed with the rebel agents regarding the quality of the food on offer.\nThe Gem of Alderaan fell under assault from Trandoshan mercenaries that sought to capture Bail Organa and incorrectly believed the senator to be traveling on the train. Nabin suffered minor injuries in the attack and took shelter in the train's casino car, where his stormtrooper guards repelled several Trandoshan attackers and an SD-6 \"Hulk\" infantry droid with assistance from the Alderaanian Resistance operatives. The mercenaries were driven from the casino and, convinced by the agents' credentials as aides of Bail Organa, Nabin temporarily transferred command of his stormtroopers to the group. The rebels and the stormtroopers then forced the Trandoshans from the rest of the hovertrain.\nNabin had graying hair, brown-colored eyes and a moustache. He was introverted and had a love for holochess; he enjoyed simultaneously engaging multiple Imperial colleagues of his in holochess matches, playing against them remotely, sharing over a matter of weeks details of his next moves in the game. When engaging in a game of holochess, he felt intimidated if has opponent made their moves in the game particularly rapidly. During the raid on the Gem of Alderaan by the Trandoshan mercenaries, Nabin felt shaken by the attack and wanted his stormtrooper security detail to remain by his side to protect him.\nMorrax Nabin appeared within The Gem of Alderaan a roleplaying module set with Star Wars Legends continuity by Gary M. Sarli and published on Wizards.com on February 5 2009 as the eight adventure in Wizards of the Coasts' Dawn of Defiance roleplaying campaign.\nIn the adventure, the players roleplay as the Alderaanian Resistance agents that infiltrate the Gem of Alderaan hovertrain and the players attempt to gain the favor of Nabin and the other major guests at the launch party so as to gain the attention of the event's patron, Lady Alya Aldrete. The players can improve Nabin's level of goodwill toward them by defeating him at holochess and by engaging him in refined conversation in the train's dining car. After the train is attacked by Trandoshan raiders, the players attempt to convince Nabin to let them take charge of the governor's stormtrooper detail. If sucessfully persuaded, Nabin agrees to release his guards to assist the rebel agents. It is alternately possible for Nabin to decline to release his bodyguards to the rebels' command but to instead share with them weapons and equipment, or for Nabin to refuse to aid the player characters at all, in which case he retreats to the hovertrain's nightclub Decadence with his stormtroopers.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Holochess/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/17_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Gem_of_Alderaan",
  "/wiki/Train/Legends",
  "/wiki/Battle_of_the_Gem_of_Alderaan",
  "/wiki/Trandoshan/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Hovertrain/Legends",
  "/wiki/Casino/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Train_station/Legends",
  "/wiki/City/Legends",
  "/wiki/Aldera/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/The_Gem_of_Alderaan",
  "/wiki/Canon",
  "/wiki/Alderaanian_brandy",
  "/wiki/Sullustan/Legends",
  "/wiki/Dien_Suub",
  "/wiki/Alderaanian_Resistance",
  "/wiki/Aide/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/SD-6_Hulk_infantry_droid",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Gary_M._Sarli",
  "/wiki/Wizards.com",
  "/wiki/February_5",
  "/wiki/2009",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Dawn_of_Defiance",
  "/wiki/Lord/Legends",
  "/wiki/Alya_Aldrete",
  "/wiki/Nightclub",
  "/wiki/Decadence_nightclub",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vhiin_Thorla",
  "/wiki/Almas_Academy",
  "/wiki/Order_66/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Dawn_of_Defiance:_Gamemaster_Primer"
 ]
}