{
 "name": "Moruth_Doole",
 "display_name": "Moruth Doole",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Kessel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rybet"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Whitish"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kessel Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Moruth Doole was a male Rybet who was the administrator of the spice mines of Kessel and de facto ruler of the planet after the revolt against Imperial rule.\nDoole began his career on Kessel as an administrator in the spice mines. He was a corrupt official who brokered deals for various smuggling gangs, particularly by selling the Hutts illegal shipments of glitterstim. Imperial Customs officer Hewat was determined to expose Doole's illegal spice distribution operation. Han Solo was a frequent visitor to Kessel when he worked for Jabba the Hutt to smuggle spice. Doole was a glitterstim user, using its abilities to boost his mental powers. However, excessive glitterstim usage causes paranoia in the user and he became excessively paranoid about Solo. Thus, Doole tipped the Imperials off about Solo. This deeply angered Jabba the Hutt, as the crime lord then planned to kill Doole. Doole pleaded with Jabba's henchmen to take only his eye instead, which they did, though they would have done more, had Arb Skynxnex not stepped in and killed them.\nAfter the death of Palpatine at Endor in 4 ABY, Doole staged a revolt against Imperial control of Kessel; overthrowing the guards and successfully taking control of the planet. He then installed Skynxnex as his second-in-command. After the revolt, Doole discovered a dead rancor in the prison which had been starved to death. Doole pitied the fate of the creature and of his plans for it, as he planned to feed the Imperials to it. He sent them to the mines but tortured the former head of the prison and froze him in carbonite, displaying the man's desiccated corpse in his office. Also around this time, 5 ABY, Doole was responsible for the deaths of Kyp Durron's parents, an act that would come back to haunt him.\nHaving cemented his control, Doole had a number of female Rybets shipped over to Kessel so he could exclusively mate with them. He used his offspring as a form of cheap labor while they were in the larval stage before he killed them. As a result of the murder of their children, his concubines bore him tremendous ill-will.\nIn 6 ABY, Doole made a deal with Wedge Antilles and Rogue Squadron over prisoners in his care. Doole would release various political prisoners who were captured during the height of the Galactic Civil War in exchange for Antilles taking several \"problem prisoners\" off Doole's hands. In this way, Doole rid himself of some powerful Black Sun members like Zekka Thyne and Fliry Vorru. Top of the list was Arb Skynxnex but Doole utterly refused to let him go. Rogue Squadron wrecked most of Kessel's defenses during the mission so Doole put priority on building a fleet to defend the planet.\nIn 11 ABY, Han Solo and Chewbacca were sent on a mission to Kessel to reopen relations with the planet and to possibly negotiate the release of the remaining political prisoners there. Han Solo broadcast a greeting when he was met by Doole's fleet, but he was shot down and taken prisoner. Doole initially wanted to kill him but instead threw him in the mines. Leia Organa Solo began looking for her husband so he sent Skynxnex to kill Solo and Chewbacca. They were already planning an escape and fled with a shuttle to The Maw, with a new-found friend named Kyp Durron. Skynxnex was killed and eaten by a Spice spider.\nLeia sent Luke Skywalker and Lando Calrissian to Kessel to find out what became of Han. Calrissian posed as a potential investor while Luke was his assistant. During a tour, they noticed a repaired Millennium Falcon sitting alongside Doole's fleet. They recaptured the ship and fled the planet. At the same time, Admiral Daala's complement of Star Destroyers from the hidden Maw Installation made an appearance chasing the Sun Crusher. She saw Doole's fleet, thought it a Rebel trap and battled the fleet, destroying it.\nChewbacca spoke to the Galactic Senate, proposing a mission to rescue prisoners on Kessel and in the Maw Installation. A fleet was dispatched and the New Republic forces tried to arrest Doole. However, once his concubines and his children were released, they chased him into the mines and like Skynxnex, he was attacked, killed, and eaten by many energy spiders.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Rybet/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Doole%27s_Defense_Fleet",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Glitterstim/Legends",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Hewat",
  "/wiki/Han_Solo/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Arb_Skynxnex",
  "/wiki/Palpatine/Legends",
  "/wiki/Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Reskell_Twane",
  "/wiki/Carbonite/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Carbon_freeze",
  "/wiki/6_ABY/Legends",
  "/wiki/Mission_to_Kessel_(Galactic_Civil_War)",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Zekka_Thyne",
  "/wiki/Fliry_Vorru",
  "/wiki/Chewbacca/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/The_Maw/Legends",
  "/wiki/Energy_spider",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Maw_Installation",
  "/wiki/Sun_Crusher",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Skirmish_in_the_Maw",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Rebel_Dawn",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Trouble_Brewing",
  "/wiki/Star_Wars:_Edge_of_the_Empire_Core_Rulebook",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Crimson_Bounty",
  "/wiki/Star_Wars_Adventure_Journal_14",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/The_Last_Command",
  "/wiki/The_Last_Command_(unabridged_audiobook)",
  "/wiki/Jedi_Search",
  "/wiki/Champions_of_the_Force",
  "/wiki/I,_Jedi",
  "/wiki/Simple_Tricks",
  "/wiki/Tales_from_the_New_Republic",
  "/wiki/Young_Jedi_Knights:_Return_to_Ord_Mantell",
  "/wiki/The_New_Jedi_Order:_Vector_Prime",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/Cynabar%27s_Fantastic_Technology:_Droids",
  "/wiki/Cynabar%27s_Droid_Datalog_(article_series)",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Unseen_Planets_of_Star_Wars",
  "/wiki/Star_Wars_Insider_36",
  "/wiki/InQuest_Gamer",
  "/wiki/Star_Wars_Episode_VII:_Rise_of_the_New_Republic",
  "/wiki/InQuest_Gamer_50",
  "/wiki/Star_Wars_Kids_(1997)",
  "/wiki/Star_Wars_Kids_12_(1997)",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/Wizards.com",
  "/wiki/Kessel:_Hell_in_Space",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Underworld_Appendix:_Swoops,_Spice,_and_Wretched_Rogues",
  "/wiki/StarWars.com",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_89",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Barely_Tolerable:_Alien_Henchmen_of_the_Empire"
 ]
}