{
 "name": "Mosara_Thiirn",
 "display_name": "Mosara Thiirn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Hydrospeare Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Mosara Thiirn was a Human female Rebel technician, and later a field engineer for Hydrospeare Corporation. She began working as a Rebel SpecForce technician, stationed aboard a technical frigate.\nThiirn took part in the Battle of Archais, where the Rebel Alliance SpecForces  fought the Imperial forces in the oriental seas of the planet Archais.\nDuring the battle, and with the Rebel forces in danger, she chose to desert her position and surrender herself and her ship to the Imperial commander, Lieutenant Colonel Freja Covell. This led her to be particularly disliked among the Rebel survivors of the battle, who blame her for the death of many of their friends.\nHowever, Covell soon found that Thiirn's desertion was of little use for the Empire: Being on a mobile base, Thiirn was unaware of the location of any Rebel base, and all the Rebel officers she knew were already on Imperial Intelligence's most wanted lists. Although her desertion only served for immediate purposes related to the battle, they could not use her to damage the Alliance any further—even if she wanted to.\nThiirn became a field technician for Imperial-aligned Hydrospeare Corporation, and she even became a field engineer for the elite Design Team Beta. She mistakenly thought she was an essential part of the Team. A lithe, light-skinned woman, Thiirn braided her dark hair in the Imperial military fashion required of women officers aboard fleet ships, although she was not an Imperial officer.\nRebel veteran of Archais Akul Witig wrote a report on Thiirn, specifying that the Eclipse Team would kill Thiirn if they could find her. General Airen Cracken would rather capture her, but he understood it would be impossible if Witig or P. Essex Yerac found her first.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Hydrospeare_Corporation",
  "/wiki/Eclipse_Team",
  "/wiki/Lieutenant/Legends",
  "/wiki/Akul_Witig",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Technician/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Battle_of_Archais",
  "/wiki/Shroud_Team",
  "/wiki/Midnight_Squadron",
  "/wiki/Storm_Squadron_(Rebel)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Archais",
  "/wiki/Starship/Legends",
  "/wiki/Lieutenant_Colonel/Legends",
  "/wiki/Freja_Covell",
  "/wiki/Death/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Design_Team_Beta",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Palpatine_Essex_Yerac"
 ]
}