{
 "name": "Mosep Binneed",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nimban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nimbanel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire",
      "Sturg Ganna"
     ]
    }
   ]
  }
 ],
 "content": "Mosep Binneed was a Nimbanel male who worked as an accountant for various criminals throughout his life. During the Galactic Civil War, he spent time in Chalmun's Spaceport Cantina in Mos Eisley in the year 0 BBY.\nIn 4 ABY, Binneed was in the palace of the crime lord Jabba Desilijic Tiure when Princess Leia Organa arrived in disguise as the bounty hunter Boushh with the Wookiee Chewbacca as her prisoner. Their arrival was part of a plan to rescue the smuggler Han Solo from Jabba's clutches, and soon after Organa's arrival Jabba and many of his courtiers were killed over the Great Pit of Carkoon.\nBy 34 ABY, the Nimbanel account was working on the planet Cantonica in the city of Canto Bight for a new crime lord, \"Big\" Sturg Ganna. On Ganna's orders he provided the Heptooinian gambler Kaljach Sonmi with eight hundred thousand credits to use at the Canto Casino. When Sonmi ran out of funds, Binneed had Orisha Okum—another gambler in Ganna's employ—tell the Heptooinian that he had to pay Ganna back by sunrise the next day.\nSonmi made efforts to earn back what he owed, but had failed to gather enough by three hours to dawn. Binneed had Okum bring Sonmi to him in a private viewing box at the Canto Bight racetrack and then ordered one of his Wookiee bodyguards to drop the gambler over the box's edge to his death. Before the Wookiee could complete the order though, Time for Flatcakes—a fathier that Sonmi had bought—won a race. Seeing this, Binneed spared the Heptooninian who then managed to earn back the full amount he owed in the next three hours and repay Binneed and Ganna.\nMosep Binneed was a Nimbanel male from the planet Nimban who worked as an accountant and henchman for the Hutt crime lord Jabba Desilijic Tiure at he begining of the Galactic Civil War. In the year 0 BBY, he spent time in the spaceport of Mos Eisley and was in Chalmun's Spaceport Cantina, where he witnessed the Jedi Master Obi-Wan Kenobi cut down the criminals Ponda Baba and Doctor Cornelius Evazan during a confrontation. He then sat at a table with the Snivvian Zutton when the smuggler Han Solo shot the bounty hunter Greedo in one of the cantina's other booths.\nBinneed then left the establishment and stood by an X-34 landspeeder as its owner Luke Skywalker sold it. A short time later he walked behind Skywalker and Kenobi as they approached Docking Bay 94.\nFour years later, Binneed was in one of the booths of the throne room of Jabba's Palace on Tatooine during a performance of the song \"Jedi Rocks\" by the Max Rebo Band for the Hutt and his court. When the song finished, Jabba demanded it be repeated, but the Hutt interrupted the second performance by dropping the enslaved Twi'lek dancer Oola into the pit below his throne room after she refused the Hutt's advances. Binneed stood within the booth and craned to see while the court rushed forward to watch as Oola was eaten by Jabba's pet rancor, Pateesa.\nWhen the spectacle was over, the courts attention was drawn by blaster fire to the throne room's entry way, where Princess Leia Organa of the Alliance to Restore the Republic arrived in disguise as the bounty hunter Boushh. Organa and her Wookiee ally Chewbacca were there to rescue Solo from Jabba's clutches, and as part of their plan she delivered Chewbacca in chains to the Hutt and asked for the bounty the crime lord had placed on the Wookiee's head.\nDuring negotiations over the size of the bounty for Chewbacca, Organa activated a thermal detonator as a threat, causing Binneed and the other occupants of the throne room to duck for cover and cower in fear. Once Jabba settle on a compromise, she deactivated the detonator and the court relaxed while Chewbacca was taken away.\nLater that night, Organa was captured after freeing Solo and the court celebrated late into the night. The following morning, Binneed was resting in one of the throne room's booths when Skywalker arrived to try and negotiate for the release of Solo, Organa and Chewbacca. Skywalker's negotiations were unsuccessful, and the Hutt dropped him into a pit containing the rancor Pateesa; however, he was able to kill the beast. Jabba then ordered that Skywalker and the other prisoners be taken to the Great Pit of Carkoon to be executed. Above the pit, Skywalker and the others freed themselves and managed to kill Jabba and many of his courtiers.\nBy the year 34 ABY, Binneed was working on the planet Cantonica as an accountant for the crime lord Sturg Ganna in the city of Canto Bight. The Nimbanel lent eight hundred thousand credits to the Heptooinian gambler Kaljach Sonmi because he and Ganna believed that Sonmi's starship might be worth something; however, when the Heptooinian later became a proposition player at Canto Casino they decided he could be useful as an insider. They later had professional gambler Orisha Okum take a look at a strategy Sonmi was developing for the game zinbiddle to see if it had potential, and when she said it might this bought the debtor more time.\nAfter eighteen months, Sonmi lost the last of his credits on zinbiddle, so Binneed sent Okum to inform him that Ganna wanted his money back. The gambler had until dawn the next day to repay Binneed the full amount that had been given to him, or he would face the consequences. The Heptooinian, who had thought that Binneed was a wealthy eccentric who was gifting him credits, panicked and attempted to earn back his money through more gambling, teaming up with the three Suertons known as the Lucky Three.\nSonmi did well with the time he had, but at three hours to dawn he lost it all when two of the Suertons misunderstood his wishes and spent all his earnings on purchasing the fathier Time for Flatcakes. Binneed had Okum bring the Heptooinian to him while he waited with two Wookiee bodyguards in a private box at the Canto Bight racetrack. He then discussed Sonmi's debt with him before ordering one of the Wookiees to throw the gambler to his death over the side of the box.\nThe debtor was only spared at the final moment when it was announced that Time for Flatcakes had won the race it was participating in. Surprised, Binneed had the Wookiee spare Sonmi and warned the Heptooinian that he still only had three hours to make up the rest of what he owed. Somni left the box and was able to make the money he needed by beating Okum in a game of pazaak, allowing him to pay off his debt to Binneed and Ganna and survive to see another day. Binneed was mentioned in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY.\nBinneed was a small creature, but like most Nimbanel he had big ideas about becoming a bureaucrat.\nMosep Binneed first appeared in the 1977 film Star Wars: Episode IV A New Hope and later in the 1983 film Star Wars: Episode VI Return of the Jedi. Annette Jones portrayed the character in A New Hope, but in Return of the Jedi he was portrayed by Richard Bonehill. The character's name was first used in canon in the 2017 short story \"The Ride\" by John Jackson Miller.\nBineed's listing in Star Wars: Geektionary: The Galaxy from A - Z, a canon reference book published in 2018, tells that he perished during the Rescue of Han Solo, which was in 4 ABY. However, he appears alive in the \"The Ride\", a short story set in 34 ABY. The discrepancy has not yet been resolved by Lucasfilm Story Group.\nThe name Mosep Binneed originated in Star Wars Legends, with the character's forename first being used by the Star Wars Customizable Card Game in 1996 to identify a separate red-haired Nimbanel in A New Hope. This Nimbanel was later re-identified as Tawss Khaa, with the white haired Nimbanel being changed to Mosep by a \"Rogues Gallery\" article written by Leland Chee and published in Star Wars Insider 130. The character having the surname Binneed originates in the 2003 Star Wars Roleplaying Game supplement Ultimate Alien Anthology produced by Wizards of the Coast.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mosep_Binneed",
  "/wiki/Mosep_Binneed/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Nimban",
  "/wiki/Nimbanel",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Sturg_Ganna",
  "/wiki/Accountant",
  "/wiki/Galactic_Civil_War",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/4_ABY",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Bounty_hunter",
  "/wiki/Boushh",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Death",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/34_ABY",
  "/wiki/Planet",
  "/wiki/Cantonica",
  "/wiki/City",
  "/wiki/Canto_Bight",
  "/wiki/Heptooinian",
  "/wiki/Gambling",
  "/wiki/Kaljach_Sonmi",
  "/wiki/Credit",
  "/wiki/Canto_Casino_and_Racetrack",
  "/wiki/Orisha_Okum",
  "/wiki/Standard_hour",
  "/wiki/Time_for_Flatcakes",
  "/wiki/Fathier",
  "/wiki/Hutt",
  "/wiki/Time",
  "/wiki/Spaceport",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Ponda_Baba",
  "/wiki/Doctor",
  "/wiki/Cornelius_Evazan",
  "/wiki/Snivvian",
  "/wiki/Zutton",
  "/wiki/Greedo",
  "/wiki/Cantina",
  "/wiki/X-34_landspeeder",
  "/wiki/Luke_Skywalker",
  "/wiki/Docking_Bay_94/Legends",
  "/wiki/Throne",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Max_Rebo_Band",
  "/wiki/Slavery",
  "/wiki/Twi%27lek",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Blaster",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Bounty",
  "/wiki/Thermal_detonator",
  "/wiki/Prisoner",
  "/wiki/Gambler",
  "/wiki/Starship",
  "/wiki/Zinbiddle",
  "/wiki/Standard_month",
  "/wiki/Standard_day",
  "/wiki/Currency",
  "/wiki/Suerton",
  "/wiki/The_Lucky_Three",
  "/wiki/Bodyguard",
  "/wiki/Pazaak",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Annette_Jones",
  "/wiki/Richard_Bonehill",
  "/wiki/2017",
  "/wiki/The_Ride",
  "/wiki/John_Jackson_Miller",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/2018",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1996",
  "/wiki/Tawss_Khaa/Legends",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_130",
  "/wiki/2003",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Canto_Bight_(novella_collection)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Yavin",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/April_11",
  "/wiki/2010",
  "/wiki/A_New_Hope_Limited"
 ]
}