{
 "name": "Moteé",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Naboo Royal Handmaidens",
      "Naboo Royal Handmaidens",
      "Galactic Republic",
      "Naboo delegation",
      "Naboo delegation"
     ]
    }
   ]
  }
 ],
 "content": "Moteé was a human female. She served as a member of the Naboo Royal Handmaidens protecting Padmé Amidala during the final days of the Clone Wars.\nThe human female from Naboo eventually known as Moteé graduated from the political academy in Theed in 22 BBY. In that year, shortly before the beginning of the Clone Wars between the Galactic Republic and Confederacy of Independent Systems, Naboo Senator Padmé Amidala had been the subject of an assassination plot. In the first attempt on her life on Coruscant, the Republic's capital planet, Cordé and Versé, two of Amidala's three handmaidens, were killed. In the search to recruit new handmaidens, Amidala and her remaining handmaiden, Dormé, decided that the new recruits would serve more as traditional Senatorial aides, and Dormé focused her search in that direction.\nWhile Amidala was privately recuperating on Naboo in the aftermath of the Battle of Geonosis, Dormé interviewed multiple candidates, eventually selecting two: Elleen, a former aide to Governor of Naboo Sio Bibble, and Moteé. Upon accepting the position, Moteé and Elleen chose to follow the tradition established by their predecessors in Amidala's service by changing their names to match Amidala's given one, with Elleen becoming Ellé.\nDuring the conflict, Moteé accompanied Amidala and Dormé on a diplomatic mission to the planet Clabron. Upon their arrival, they were ambushed by an assassin, with Moteé hit in the shoulder. They escaped inside the building, where Amidala was able to work out an agreement with the new minister. They then counter-ambushed the sniper, capturing her so they could return to Coruscant.\nShe attended the Senate meeting in which Supreme Chancellor Sheev Palpatine announced that the Galactic Republic was to be reorganized as the Galactic Empire.\nMoteé had brown hair, brown eyes, and fair skin. She was discreet, able to keep the secret of the relationship between Amidala and the Jedi Anakin Skywalker.\nMoteé wore a short, hooded, mauve-colored cape over a purple pleated dress.\nMoteé was played by the Australian actress Kristy Wright in the 2005 film Star Wars: Episode III Revenge of the Sith, the final installment of the Star Wars prequel trilogy. The character's name was given in the film's closing credits.\nIn the Star Wars: The Prequel Trilogy – A Graphic Novel, the speech bubble with Palpatine's speech about the reorganization of the Galactic Republic into the Galactic Empire is directed towards her. This is most likely an error.\nUnlike the other Naboo Royal Handmaidens who appear in E. K. Johnston's Padmé trilogy—Queen's Shadow, Queen's Peril, and Queen's Hope—Moteé does not have her original name mentioned.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mote%C3%A9",
  "/wiki/Mote%C3%A9/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Naboo",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Galactic_Republic",
  "/wiki/Naboo_delegation",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Standard_day",
  "/wiki/Clone_Wars",
  "/wiki/Political_academy",
  "/wiki/Theed",
  "/wiki/22_BBY",
  "/wiki/Standard_year",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Senator",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Coruscant",
  "/wiki/Capital",
  "/wiki/Planet",
  "/wiki/Cord%C3%A9",
  "/wiki/Vers%C3%A9",
  "/wiki/Death",
  "/wiki/Dorm%C3%A9",
  "/wiki/Aide",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Ell%C3%A9",
  "/wiki/Governor_of_Naboo",
  "/wiki/Sio_Bibble",
  "/wiki/Mission_to_Clabron",
  "/wiki/Clabron",
  "/wiki/Galactic_Senate",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Jedi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cloak",
  "/wiki/Kristy_Wright",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/E._K._Johnston",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Hope",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Age_of_Republic_-_Padm%C3%A9_Amidala_1",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/StarWars.com"
 ]
}