{
 "name": "Mother_Queen",
 "display_name": "Mother Queen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Urnsor'is"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "The Mother Queen was a female urnsor'is who lived on the planet Kashyyyk during the Galactic Civil War. A spacer was hired by two Wookiee members of the Myyydril tribe to kill the best, and this spacer was successful in this mission.\nThe Mother Queen was a female member of the urnsor'is species, and had four eyes and a set of large teeth on her head. The head was attached to an abdomen that had two patches that were colored light blue. The beast also possessed six limbs and a tail, and her body contained a special healing salve.\nThe Mother Queen was the source of the species' infestation within the Myyydril Caverns on the Wookiee homeworld of Kashyyyk during the Galactic Civil War, sometime after the Battle of Yavin. She was protected by her urnsor'is guardians and always had juvenile members of her species surrounding her. Chief Kallaarac and Nurse Yraka Nes of the Myyydril tribe both wished the creature's death. Nes required the salve from her body, while Kallaarac wished the beast destroyed so that the tribe could finally live in peace. The spacer they contracted to perform the deed for them was successful in slaying the parasite. Kallaarac and Yraka rewarded the spacer for their efforts.\nThe Mother Queen appeared as an enemy creature in the Star Wars Galaxies expansion pack, Rage of the Wookiees, released in 2005. She also appeared in the artwork for the \"Quest\" card titled \"Queen's Healing Touch\"—which was also the name of the quest Yraka Nes gave the player to kill the Queen—in the Star Wars Galaxies Trading Card Game set Champions of the Force. Star Wars Galaxies was shut down on December 15, 2011.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Urnsor%27is",
  "/wiki/Queen_Mother",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Myyydril",
  "/wiki/Species/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Color/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Salve",
  "/wiki/Myyydril_Caverns",
  "/wiki/Homeworld/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Kallaarac",
  "/wiki/Nurse/Legends",
  "/wiki/Yraka_Nes",
  "/wiki/Death/Legends",
  "/wiki/Parasite/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Template:SWGTCG"
 ]
}