{
 "name": "Motta",
 "display_name": "Motta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Motta was a Hutt who took up residence on Tatooine during the Jedi Civil War.\nLike most of his species, Motta was a powerful and influential figure on the planet he chose to call home. However, his planet was Tatooine, a dune-covered wasteland sparsely populated by only a handful of miners and hunters. Because of this, few people outside of Tatooine had even heard of Motta the Hutt, and those who had thought little of him.\nStill, the ambitious Hutt tried to change his reputation as a small-time operator. He had complete control over the  swoop track circuit on Tatooine, hoping to capitalize on the destruction of Taris, and rumors abounded that he was trying to increase his wealth and power by delving into a popular Huttese pastime: smuggling.\nRevan may have raced for Motta during his search for the Star Forge. Motta also wanted Revan to help in his business by persuading another swoop racer called Nico Senvi sign a contract, but the very reason why Nico was unwilling to sign was that it would give Motta most of his winnings. However, Revan persuaded him to give Nico Senvi a better contract. Revan also later delivered a Rakatan Prison to Motta, given to him by Lurze Kesh.\nThe Hutt species are particularly resistant to the Mind trick, but the player  can Force Persuade Motta to give Nico Senvi a better contract, indicating a great deal of skill on Revan's part or that Motta was a particularly weak-willed Hutt. The latter seems more likely: if Jolee is in the player's party when the player threatens Motta, the Hutt simply decides to acquiesce to his demands just so the Jedi would leave, fearing the persuasive powers of his \"waving hands\".\nAlternatively, the player can threaten Motta into give Nico a better contract, but Revan alone may not be enough. Instead, if the player has either Jolee, Zaalbar, Canderous Ordo or HK-47 in the party, then they will add their own threats which will convince Motta to give the other racer a better contract.\nIf the player takes the dark side option and convinces Nico Senvi, then Motta will give the player 20 racing bonds .\nHis voice is provided by Neil Kaplan in the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Species/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Swoop_racing/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Star_Forge",
  "/wiki/Nico_Senvi",
  "/wiki/Mind_prison",
  "/wiki/Lurze_Kesh",
  "/wiki/Mind_trick/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Jolee_Bindo",
  "/wiki/Zaalbar",
  "/wiki/Canderous_Ordo",
  "/wiki/HK-47",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Neil_Kaplan",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}