{
 "name": "Mox Slosin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Entuur"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Intelligence",
      "Inquisitorius",
      "Imperial Intelligence",
      "Inquisitorius"
     ]
    }
   ]
  }
 ],
 "content": "Mox Slosin was a member of the Inquisitorius and one of the Emperor's distinguished High Inquisitors.\nA Human from Entuur, he accepted his native Entuuran culture, giving a high value to pain and suffering. As a High Inquisitor, Slosin was known for his sadistic nature, making his reputation rival that of even notorious High Inquisitor Antinnis Tremayne. He was famous for programming his tendencies into the IT-O Interrogator droids, although he personally did not use droids for interrogation.\nA very effective interrogator, he however sometimes got too enthusiastic and killed the victim before extracting information. During the subjugation of Fitca Prime, Slosin, who was then only an Imperial Intelligence interrogator, killed Alliance Colonel Shanda Dok when she refused to betray the Alliance. However, as the subjugation was a success, Slosin was transferred to Urce.\nIn 1 BBY, Slosin interrogated Rebel agent Tirranna, a Wookiee. Although Tirrana survived the interrogation, she would keep physical and psychological scars for the rest of her life, as well as an important hatred towards Slosin. Due to her first-hand experience, Tirranna was assigned to write a report on Slosin for the rest of the Rebel Alliance.\nSlosin's flagship was a Trenchant-class cruiser named the Ironhand. Slosin was basically unsupervised as he patrolled the Lesser Plooriod Cluster. Contrarily to other Inquisitors, he actively sought Rebel operatives in the area, commonly traveling through the Burna Trade Route and Entana Run.\nIn 2 ABY, Slosin was in his mid-50s, but he appeared to be much older due to his prematurely white and scarce hair, to his long and thin beard and to his darker-than-normal wrinkled skin.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/High_Inquisitor",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Mox_Freedan",
  "/wiki/Entuur",
  "/wiki/Human/Legends",
  "/wiki/Entuuran",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Tirranna",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Antinnis_Tremayne",
  "/wiki/IT-O_Interrogator",
  "/wiki/Droid/Legends",
  "/wiki/Subjugation_of_Fitca",
  "/wiki/Fitca_Prime",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Shanda_Dok",
  "/wiki/Urce/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Trenchant-class_cruiser",
  "/wiki/Ironhand_(Trenchant-class)",
  "/wiki/Lesser_Plooriod_Cluster/Legends",
  "/wiki/Operative",
  "/wiki/Burna_Trade_Route",
  "/wiki/Entana_Run",
  "/wiki/2_ABY/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}