{
 "name": "Mrrov",
 "display_name": "Mrrov",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Togoria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White with Orange stripes"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Muuurgh"
     ]
    }
   ]
  }
 ],
 "content": "Mrrov was a Togorian female and the betrothed mate of Muuurgh. She had fur that was creamy white in color with orange stripes and sported vivid yellow eyes; this was considered a particularly striking appearance among her species.\nSeeking meaning in her life, Mrrov partook in a religious revival presented by t'landa Til priests visiting Togoria. Consumed by the pleasurable Exultation, Mrrov joined the pilgrims bound for Ylesia. Little did she know that, like all the others, she had been deceived into slavery in the spice refineries on that world. However she soon figured out that the Ylesian operation was a sham; when she asked to leave the priests showed her Muuurgh's picture and threatened to kill him if she tried to escape.\nMrrov was rescued by Muuurgh when he made his escape from Ylesia with Han Solo and Bria Tharen. She and Muuurgh, along with the two Human escapees, returned to Togoria and were married. Their relationship would continue, with Mrrov bearing three female kits. She later returned to Ylesia as part of a small Togorian contingent working with the Rebel Alliance force that conquered Ylesia; during the battle she lost an eye and possibly a paw from a Force pike wound inflicted by one of the Gamorrean guards.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Togoria/Legends",
  "/wiki/Togorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Muuurgh",
  "/wiki/Species/Legends",
  "/wiki/T%27landa_Til",
  "/wiki/Exultation",
  "/wiki/Ylesia/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Bria_Tharen",
  "/wiki/Human/Legends",
  "/wiki/Battle_of_Ylesia",
  "/wiki/Force_pike/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/The_Paradise_Snare",
  "/wiki/Rebel_Dawn",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}