{
 "name": "Muchi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rancor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Roughly 1.82 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Owner(s)",
     "values": [
      "Jabba Desilijic Tiure"
     ]
    }
   ]
  }
 ],
 "content": "Muchi was an adolescent female rancor owned by crime lord Jabba the Hutt. At some point, she was captured by Zygerrian slavers and taken to the Mid Rim planet Ord Mantell. Around 19 BBY, Jabba's majordomo, Bib Fortuna, hired the former Jedi informant Cid to return the rancor to them. Cid, in turn, hired Clone Force 99 to complete the job. Muchi was released by Omega, and returned to Bib Fortuna, who cared about the rancor and called her his \"sweet girl.\"\nMuchi was an adolescent female rancor owned by the Hutt gangster and crime lord Jabba Desilijic Tiure. During or prior to 19 BBY, Muchi was captured by Zygerrian slavers led by Raney and she was taken to Old Ord Mantell City on the planet Ord Mantell. Bib Fortuna, Jabba's majordomo, hired Trandoshan parlor owner Cid to return Muchi to Jabba. Cid then hired rogue clone commando unit Clone Force 99 to bring Muchi to her in exchange for some information they required, but failed to add that Muchi was a rancor. They also agreed to split the bounty for Muchi between them, with Cid receiving a larger portion. With arrangements made, Cid threw an intel stick at Clone Force 99's leader, Hunter, that contained the details on the bounty.\nClone Force 99 traveled to the ruins of Old Ord Mantell City in their personal attack shuttle, the Marauder, and used their macrobinoculars to observe several slaves, including a green Falleen child they mistook to be Muchi. However, before they could attack, they were ambushed by a large brezak and captured in a stun net fired from an electrified net gun by the Zygerrians.\nDuring Clone Force 99's mission, Fortuna contacted Cid to inquire about the delay as his master was becoming impatient. Cid told Fortuna to reassure his master that he will be reunited with Muchi soon.\nIn an effort to rescue the prisoners, Clone Force 99's young companion, Omega, unlocked the cage that Muchi was kept in, but in the process was grabbed by a Zygerrian guard. Despite the Zygerrians' efforts to lock the cage, Muchi broke out of her chains and escaped. The slavers then fired their weapons at Muchi, causing her to throw a large boulder at them, while the clones used the distraction to break free of their chains and rip off their shock collars. Muchi tried to attack Raney, but a brezak flew the Zygerrian away. Omega told the Falleen child whom she believed to be Muchi that they would take her home. However, a Falleen prisoner quickly informed her that the rancor was in fact Muchi, much to Echo's surprise.\nMuchi quickly defeated several of the Zygerrians before battling Raney and the brezak. Though outmatched by the lizard while it was mounted, Muchi gained the advantage after Hunter threw Raney to the ground. The brezak gave chase when Muchi attempted to flee, with the two creatures engaging in a fight, which Muchi won by biting the brezak's tail. Following this, Wrecker challenged Muchi to a fight due to the fact that rancors adhered to a social hierarchy, in which the strongest contender was the group alpha. After a lengthy duel, both dropped from exhaustion.\nClone Force 99 brought Muchi to Ord Mantell City, where she was greeted by Fortuna and two Gamorrean guards, with one of Gamorreans paying Cid for Muchi's rescue. The rancor bid the clones farewell and was taken home by Fortuna. In exchange for completing the mission, Cid told Hunter that the bounty hunter the group had encountered before was Fennec Shand, and that she was working on a direct commission. Cid then gave Hunter his share of the payment.\nMuchi was a female rancor in an adolescent stage of development, who was roughly 1.82 meters tall. She had brown skin and green eyes. Muchi disliked the Zygerrian slavers, particularly Raney, due to their kidnapping of her. Muchi was a formidable opponent who fought until she was exhausted and docile, though she could also be tamed and ridden. Muchi enjoyed the affection of Bib Fortuna and later Omega and Clone Force 99.\nMuchi appeared in \"Rampage,\" the fifth episode of the first season of Star Wars: The Bad Batch. LEGO Star Wars: The Skywalker Saga identified Jabba's rancor in Star Wars: Episode VI Return of the Jedi as \"Pateesa Muchi.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Rancor",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Crime_lord",
  "/wiki/Zygerrian",
  "/wiki/Slaver",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Ord_Mantell",
  "/wiki/19_BBY",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Jedi",
  "/wiki/Information_broker",
  "/wiki/Cid",
  "/wiki/Clone_Force_99",
  "/wiki/Mission_to_Ord_Mantell_(Clone_Force_99)",
  "/wiki/Omega",
  "/wiki/Hutt",
  "/wiki/Gangster",
  "/wiki/Raney",
  "/wiki/Old_Ord_Mantell_City",
  "/wiki/Trandoshan",
  "/wiki/Cid%27s_Parlor",
  "/wiki/Clone_commando",
  "/wiki/Bounty",
  "/wiki/Hunter",
  "/wiki/Shuttle",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Macrobinoculars",
  "/wiki/Slavery",
  "/wiki/Falleen",
  "/wiki/Unidentified_Falleen_child",
  "/wiki/Brezak",
  "/wiki/Stun_net",
  "/wiki/Electrified_net_gun",
  "/wiki/Prisoner",
  "/wiki/Youngling",
  "/wiki/Zygerrian_royal_guard",
  "/wiki/Cloning",
  "/wiki/Shock_collar",
  "/wiki/Unidentified_Falleen_prisoner",
  "/wiki/Echo",
  "/wiki/Lizard",
  "/wiki/Wrecker",
  "/wiki/Ord_Mantell_City",
  "/wiki/Gamorrean",
  "/wiki/Bounty_hunter",
  "/wiki/Chase_on_Pantora",
  "/wiki/Fennec_Shand",
  "/wiki/Eye",
  "/wiki/Rampage_(episode)",
  "/wiki/The_Bad_Batch_Season_1",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Pateesa",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Stormtrooper_Corps",
  "/wiki/War-Mantle",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Return_to_Kamino",
  "/wiki/Kamino_Lost",
  "/wiki/Disney%2B"
 ]
}