{
 "name": "Muftak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Orto Plutonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Talz"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.1 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Muftak, known erroneously to many as the Muftak, was a male Talz abandoned on the planet Tatooine as a newborn. Along with his partner Kabe, he was a pickpocket in the spaceport of Mos Eisley spaceport, as well as a low-level spice dealer and a regular patron of Chalmun's Spaceport Cantina.\nA male Talz from Orto Plutonia, Muftak was abandoned in Mos Eisley, a spaceport located on the planet Tatooine, as a newborn. He grew up knowing he was different from other species, but had little knowledge of the Talz or his icy homeworld; he remembered only Orto Plutonia's contrast with the blazing Tatooine desert and had never seen another Talz. The Abyssin Myo erroneously assumed that \"Muftak\" was the name of his species, causing the denizens of Mos Eisley to refer to him as \"the Muftak\"\nMuftak became a pickpocket, partnering with Kabe, a female Chadra-Fan. The two planned robberies in the spaceport and in Chalmun's Spaceport Cantina, which he frequented to avoid overheating. The two took up residence in the abandoned tunnels beneath Docking Bay 83, where they paid rent to Ackmena, the night-shift bartender who was aware of their illicit activities; Ackmena, in turn, gave a part of the proceeds to Chalmun, the owner of the cantina. During this time, Muftak was also a low-level spice dealer, providing Dr. Cornelius Evazan with narcotics supplied by the smuggler Han Solo.\nBy the year 0 BBY, Muftak and Kabe were in serious financial straits. At the cantina, the two often sat at a table with Myo and the Sakiyan bounty hunter Djas Puhr; Muftak regularly lost his money drinking or gambling at sabacc.\nOne night, Muftak was drinking heavily during a game of sabacc and lost most of his and Kabe's rent money to Puhr. Aware that Myo was in debted to both Kabe and himself, Muftak stole a kloo horn from the intoxicated Abyssin . As Muftak slept, Kabe took the horn and sold it to the Scrapper in exchange for enough rent money to appease Ackmena—leaving Muftak and Kabe to fear Myo's wrath. Unbeknownst to any of them, the horn had actually belonged to Car'n's father, the great musician Lirin D'avi; the theft of such a valuable instrument set off a hunt, with Myo hiring Djas Puhr to secure it.\nMuftak went to the cantina to receive his shipment of narcotics from Han Solo and his first mate, Chewbacca, only to be told that his cargo had been dropped after a run-in with an Imperial patrol. Shortly afterwards, he was stopped by Puhr, Myo, and Car'n, who had all gathered at their regular table. In the course of their heated conversation, it became clear that the group's various problems stemmed from Solo's failure to deliver his smuggled cargo of narcotics to Muftak. Knowing the bounty hunter Greedo was attempting to collect on Solo's bounty that same day, Puhr made a wager on the smuggler's life, promising to pay off the group's various debts himself should Solo live.\nMeanwhile, a wary Muftak, relying on Chewbacca as backup should the situation turn violent, went to explain the narcotics situation to the unpredictable Dr. Evazan. However, before he got the chance to speak with the mad doctor, Evazan's companion, Ponda Baba, attacked an individual who Muftak believed to be a \"teenage girl\"—in reality a local farmboy named Luke Skywalker who had arrived in search of a pilot to take him to the planet Alderaan. The altercation ended with Skywalker's companion, Jedi Master Obi-Wan Kenobi, dismembering Baba and wounding Evazan with his lightsaber. Muftak was now relieved of his debt to Evazan. With the death of Greedo at the hands of Solo, Djas Puhr produced Car'n's kloo horn, which he had bought from the Scrapper, defusing the situation.\nA giant Talz, Muftak was 2.1 meters in height, with four black eyes and gray skin covered in thick, white fur. Though he was aware of his heritage and homeworld, he did not feel particularly connected to it on Tatooine and had never seen another of his species. He made little effort to correct those around him who assumed the was \"a Muftak\" rather than a Talz, largely because he got tired of fighting the description.\nDespite the Talz's galactic reputation for primitivity, Muftak was intelligent, erudite, and contemplative. As a spice dealer, he was able to calculate the effects of surcharges, tariffs, consideration taxes, delivery costs, and gratuities. Nevertheless, he had a somewhat fatalistic personality, stemming from his own financial insecurities. He considered himself particularly unlucky, and constantly worried about his and Kabe's living situation and their ability to pay rent.\nMuftak enjoyed a close relationship with his partner, Kabe. Despite at times becoming irritated with her, he would use his great strength to keep the young and impetuous Kabe out of too much trouble.\nNicknamed \"Four Eyes\" and \"Spider-Man\" during production due to his many eyes and furry face, Muftak was built for the booth inserts shot well after the main stage photography for the cantina sequences of the 1977 film Star Wars: Episode IV A New Hope, where he was portrayed by mold maker Laine Liska.\nAccording to a 1978 memo, he was originally going to be named \"Cullatran\", but more than a decade later, the name \"Muftak\" was used by writers Michael Stern and Grant S. Boucher in their 1989 Star Wars Legends supplement for Star Wars: The Roleplaying Game, Galaxy Guide 1: A New Hope. This name became canon when it was used in the Star Wars: Card Trader digital app, on a card released in September 1, 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Muftak",
  "/wiki/Muftak/Legends",
  "/wiki/Born_in_the_Storm",
  "/wiki/The_Kloo_Horn_Cantina_Caper",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Databank_A-Z",
  "/wiki/Orto_Plutonia",
  "/wiki/Talz",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Kabe",
  "/wiki/Thief",
  "/wiki/Spaceport",
  "/wiki/Mos_Eisley",
  "/wiki/Spice_dealer",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Abyssin",
  "/wiki/Myo",
  "/wiki/Chadra-Fan",
  "/wiki/Docking_Bay_83",
  "/wiki/Ackmena",
  "/wiki/Chalmun",
  "/wiki/Doctor",
  "/wiki/Cornelius_Evazan",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Sakiyan",
  "/wiki/Bounty_hunter",
  "/wiki/Djas_Puhr",
  "/wiki/Sabacc",
  "/wiki/Kloo_horn",
  "/wiki/Lirin_Car%27n",
  "/wiki/The_Scrapper",
  "/wiki/Musician",
  "/wiki/Lirin_D%27avi",
  "/wiki/First_mate",
  "/wiki/Chewbacca",
  "/wiki/Galactic_Empire",
  "/wiki/Greedo",
  "/wiki/Ponda_Baba",
  "/wiki/Farm",
  "/wiki/Luke_Skywalker",
  "/wiki/Pilot",
  "/wiki/Alderaan",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Laine_Liska",
  "/wiki/1978",
  "/wiki/Michael_Stern",
  "/wiki/Grant_S._Boucher",
  "/wiki/1989",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Galaxy_Guide_1:_A_New_Hope",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/September_1",
  "/wiki/2015",
  "/wiki/Category:Images_of_Muftak",
  "/wiki/Bounty_Hunt",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/A_New_Hope_(Little_Golden_Book)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Eyes_Have_It",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com"
 ]
}