{
 "name": "Mul Sanaka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Club Deeja"
     ]
    }
   ]
  }
 ],
 "content": "Mul Sanaka was a human male who owned and managed the entertainment establishment Club Deeja in the city of Keren on the planet Naboo. During the Galactic Civil War, he employed the Melodic Order, a band of Alderaanian musicians managed by Uwa Pareece. After the band's homeworld of Alderaan was destroyed by the Galactic Empire, Sanaka persuaded Pareece not to inform the musicians so that their performance at the club would not be affected.\nWhen Princess Leia Organa of Alderaan arrived on Naboo in 0 ABY hoping to rescue the Melodic Order from Imperial persecution, Sanaka and an old acquaintance of Organa's, Lord Junn, hatched a scheme to kill her. They were ultimately foiled when Pareece turned against Sanaka and shot him after his thugs had been defeated by Organa and her allies.\nMul Sanaka owned the entertainment venue Club Deeja in the Marina District of the city of Keren on the idyllic planet Naboo. During the war between the Galactic Empire and the Alliance to Restore the Republic, Sanaka employed a group of cloistered musicians from the planet Alderaan known as the Melodic Order, who performed in his club via hologram. In the year 0 BBY, the Empire destroyed the Alderaanians' homeworld, but Sanaka persuaded the Melodic Order's manager, Uwa Pareece, to keep the devastating news from them, as he feared it would impact their performances in the club and so reduce his profits.\nIn 0 ABY, shortly after the Battle of Yavin, Princess Leia Organa of Alderaan traveled to Naboo in search of the Order. She was aiming to gather together those Alderaanians who had survived the loss of their homeworld, since the Empire was now attempting to hunt them down. Upon arriving on Naboo, she encountered Lord Junn, an old acquaintance whom she had known during her childhood. Junn then contacted the club owner, as the two men had previously done business together and Sanaka was in his debt. He warned the club owner of Organa's arrival so that Sanaka could prepare an ambush to kill her, then directed Organa to Sanaka and the band.\nUpon arriving at Club Deeja, Organa pretended to be an Imperial official under the false name \"First Minister Solo,\" and Sanaka, despite knowing her true identity, played along with the charade. He agreed to hand over the musicians, claiming he was sick of paying them, but then declared that his Besalisk enforcer Snes would bring Organa to the Alderaanians while he got a drink.\nAs Sanaka left, Snes disarmed Organa and her companions, the pilot Evaan Verlaine and the astromech droid R2-D2. While taking their weapons, the Besalisk unwittingly revealed to the group that she knew Organa's true identity by calling her princess. Realizing that the meeting was a trap, Organa and her companions attacked Snes, while two other Besalisk thugs who had been waiting inside the club rushed out to aid Snes in the fight. Nevertheless, Organa and her companions were able to defeat all three assailants.\nHis plan ruined by his thugs' incompetence, Sanaka was forced to step in himself. Armed with a blaster rifle, he prepared to shoot Organa, who was unaware of his approach. However, Pareece had witnessed the princess's battle with the Besalisks and recognized her as Alderaanian royalty. Tired of betraying her own people, Pareece had a change of heart and shot Sanaka in the back with the princess's blaster pistol, surprising the club owner and killing him.\nPareece then pleaded with Organa for forgiveness, and together they informed the Melodic Order of Alderaan's fate. All of the Alderaanians then left Naboo together in a starship provided to them by the traitorous Junn under duress from Organa.\nMul Sanaka was a human with dark skin, blue eyes, and black hair, including a beard. He was willing to keep news of the destruction of Alderaan from his employees for fear that it would hurt his profits if they knew, believing they played better when happy.\nDespite knowing that the Melodic Order would have to break its vow to avoid outside influences on their music if they played in person, he attempted to persuade Uwa Pareece to have them perform on stage at Club Deeja. He considered several of their members attractive and thought their live presence would draw in greater crowds, earning him more credits.\nWhen Pareece momentarily forgot that Alderaan was gone, Sanaka offered comfort, reminding her of the incentives for keeping secrets from the band. When he later learned of a potential reward for capturing Princess Leia Organa and handing her and the band over to the Empire, he was willing to part ways with them for a greater profit. After Snes and her thugs were defeated by the Alderaanians, Sanaka complained to himself about their incompetence and then prepared to shoot the princess himself.\nSanaka wore blue robes with a cloak and hat, along with a golden necklace. When trying to kill Princess Leia Organa, he used a blaster rifle.\nMul Sanaka first appeared in the comic book Princess Leia 2, which was released on March 18, 2015. The story is part of the Star Wars: Princess Leia comic series, written by Mark Waid and illustrated by Terry Dodson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/0_ABY",
  "/wiki/Naboo",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Club_Deeja",
  "/wiki/City",
  "/wiki/Keren",
  "/wiki/Planet",
  "/wiki/Galactic_Civil_War",
  "/wiki/Melodic_Order",
  "/wiki/Band",
  "/wiki/Alderaanian",
  "/wiki/Musician",
  "/wiki/Uwa_Pareece",
  "/wiki/Homeworld",
  "/wiki/Alderaan",
  "/wiki/The_Disaster",
  "/wiki/Galactic_Empire",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mission_to_rescue_the_survivors_of_Alderaan",
  "/wiki/Lord",
  "/wiki/Junn",
  "/wiki/Death",
  "/wiki/Marina_District",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Hologram",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Battle_of_Yavin",
  "/wiki/Besalisk",
  "/wiki/Snes",
  "/wiki/Alcohol",
  "/wiki/Rebel_pilot",
  "/wiki/Evaan_Verlaine",
  "/wiki/R2_series_astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Blaster_rifle",
  "/wiki/Monarchy",
  "/wiki/Heart",
  "/wiki/Satine%27s_Lament",
  "/wiki/Lord_Junn",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Music",
  "/wiki/Credit",
  "/wiki/Robe",
  "/wiki/Cloak",
  "/wiki/Hat",
  "/wiki/Necklace",
  "/wiki/Blaster",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Princess_Leia_2",
  "/wiki/March_18",
  "/wiki/2015",
  "/wiki/Star_Wars:_Princess_Leia",
  "/wiki/Mark_Waid",
  "/wiki/Terry_Dodson",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Marvel_Comics"
 ]
}