{
 "name": "Mulus Cheems",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later white"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Dr. Mulus Cheems was a male mineral analyst who was held captive by Imperial Admiral Kosh Teradoc in 13 ABY on the world of Ryvester. Cheems was held by Teradoc to research methods of remotely disabling the gems in Jedi lightsabers via a sonic device. Though his research revealed that the hilts were too insulated, he did not disclose that information to Teradoc, as that would have meant the end of his usefulness to the admiral. He was freed from Teradoc's grip in one of Ryvester's bars by Wraith Squadron, who had lured the admiral out with a false, apparently-valueless artifact, which Cheems said was real even though he knew it wasn't. At the bar, Teradoc double-crossed Wraith Leader, Garik Loran, who was posing as a smuggler offering a valuable artifact in exchange for Teradoc's help in retrieving more from the Palace of Piethet Brighteyes hoard. In response, Loran called in the rest of the Wraiths and set off a small explosive containing an eye irritant. The Wraiths subdued Teradoc's men and cleared an escape route, bringing Cheems with them to a yacht of Teradoc's, which they stole.\nAfter Cheems was freed, the members of Wraith Squadron explained not only was their mission to save him, but also to assassinate Teradoc with the false artifact, which was really a series of explosives wired together, set to go off once it was secure in the admiral's base. The explosives were successful in destroying Teradoc, along with a vault full of bioweapons.\nCheems later aided the reformed Wraiths years later in 44 ABY by providing gems to decorate a disguise made for Clawdite actor Turman Durra. The Wraiths were planning a ruse to draw out traitorous General Stavin Thaal to Kuratooine. Cheems' adopted Yuuzhan Vong son, Viull Gorsat, was part of the Wraiths at this time, and engineered the disguise for Durra so the actor could emulate a local sentient species that had woken up from a long hibernation and was ostensibly interested in a lucrative trade in valuable gem-encrusted 'art' with the general. Thaal was lured to Kuratooine by Durra's ploy and promise of gems and the Wraiths were able to collapse his numerous illicit enterprises. The ruse was successful and ultimately resulted in Thaal's exposure, disgrace, and capture.\nCheems was created by Aaron Allston for the tenth installment of the X-wing novel series, X-Wing: Mercy Kill.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Mulus_Cheems",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Mulus_Cheems",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Kosh_Teradoc",
  "/wiki/13_ABY/Legends",
  "/wiki/Ryvester",
  "/wiki/Jedi",
  "/wiki/Lightsaber",
  "/wiki/Wraith_Squadron",
  "/wiki/Garik_Loran",
  "/wiki/Palace_of_Piethet_Brighteyes",
  "/wiki/44_ABY",
  "/wiki/Clawdite",
  "/wiki/Turman_Durra",
  "/wiki/General",
  "/wiki/Stavin_Thaal",
  "/wiki/Kuratooine",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Viull_Gorsat",
  "/wiki/Aaron_Allston",
  "/wiki/Star_Wars:_X-Wing_(novel_series)",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)"
 ]
}