{
 "name": "Munduri",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bravais"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bravaisian"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Munduri and Sonsigo were Bravaisian podmates who worked together due to their attraction toward glittering gems and metals. Their services also included appraisal of precious stones harvested on newly catalogued worlds, and they would pay top prices for what they sought. Both were present in the castle of the pirate Maz Kanata on the planet Takodana when the smuggler Han Solo arrived with the scavenger Rey, the former stormtrooper Finn and the astromech droid BB-8. Soon after the groups arrival, many of the establishment's occupants rushed outside to witness the destruction of the Hosnian system by the First Order's Starkiller Base superweapon. The castle itself was soon attacked and destroyed by the forces of the First Order. Munduri had blue skin and sensitive eyes that required protective goggles while the Bravaisian was on Takodana.\nMunduri first appeared in the film Star Wars: Episode VII The Force Awakens, which was released in North America on December 18, 2015. Creature and droid performer Damian Farrell was responsible for controlling the character, whose costume consisted of a hand puppet that Farrell controlled from beneath the bench Sonsigo was sat on. During the production of the film Munduri and Sonsigo were known as the \"snooty pirates\" and were not identified in the movie. Their names were instead revealed in the reference book Star Wars: The Force Awakens: The Visual Dictionary, which was written by Pablo Hidalgo and released in conjunction with the film.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bravais",
  "/wiki/Bravaisian",
  "/wiki/Color",
  "/wiki/Sonsigo",
  "/wiki/Takodana_Castle",
  "/wiki/Pirate",
  "/wiki/Maz_Kanata",
  "/wiki/Planet",
  "/wiki/Takodana",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Scavenger",
  "/wiki/Rey_Skywalker",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Finn",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Hosnian_system",
  "/wiki/First_Order",
  "/wiki/Starkiller_Base",
  "/wiki/Superweapon",
  "/wiki/Battle_of_Takodana",
  "/wiki/Eye",
  "/wiki/Goggles",
  "/wiki/Neal_Scanlan",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/December_18",
  "/wiki/2015",
  "/wiki/Damian_Farrell",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Databank_(website)"
 ]
}