{
 "name": "Murk_Lundi",
 "display_name": "Murk Lundi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ploo II"
     ]
    },
    {
     "name": "Died",
     "values": [
      "29 BBY",
      "Ploo system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quermian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Believers"
     ]
    }
   ]
  }
 ],
 "content": "Murk Lundi was a male Quermian from the planet of Ploo II, and an expert on the history of the Sith. Working as a teacher on Coruscant, he gave lectures on the mysterious darksiders, and was considered one of Coruscant's most knowledgeable beings on the Sith. In 39 BBY, Lundi, having researched the dark side for years, set out to recover a holocron on Kodai. He was tailed by the Jedi Qui-Gon Jinn and Obi-Wan Kenobi, yet despite this, he almost got the holocron. Only the interference of his power-hungry student Norval prevented him from gaining the artifact. However, Lundi was driven insane by the holocron's power and was arrested by the Jedi and placed in Republic custody.\nIn 29 BBY, Kenobi and Anakin Skywalker freed him so that he might help them locate the holocron. Although the professor continually antagonized the two Jedi, he did help them look for it. However, the holocron was no longer on Kodai. Norval had already recovered it, so they went after him. Even though they gained the object and Norval was killed, betrayed by an ally of his, Lundi died. However, as he was dying, he expressed remorse for attempting to recover the Sith holocron.\nLundi was the author of The Lundi Series, which Jedi Master Luke Skywalker utilized decades later to learn about the Sith.\nMurk Lundi was a one-eyed male Quermian from Ploo II, who earned his living as a professor on Coruscant in the years prior to the Battle of Naboo. He taught history at the University of Coruscant, specializing in little-known organizations and events that had had an impact on the galaxy. Some of his topics were Xim the Despot, a ruler who formed a powerful empire over 25,000 years earlier, and the Atrisian Empire, another powerful dynasty. Regarded as a good teacher but poor researcher, he was in danger of losing his job as other teachers began to study formerly obscure subjects Lundi had concentrated on. Desperate, he began to study the cryptic Sith, making contact with a number of Sith cults. Soon, his popularity grew, and his classes were quickly filled up, as students found him to be a fascinating teacher. His primary focus was the study of Sith history. Lundi lectured about the mythical group of dark-side Force users, informing students of their ways. One topic he frequently spoke about was Sith holocrons. Lundi began communicating with various sects, and while researching the Sith, he came in contact with the Sith cult known as the Believers based in the Cularin system, and he helped the group expand.\nIn 39 BBY, the Jedi Kit Fisto and his Padawan, Bant Eerin, found a cache of Sith artifacts on Korriban, the Sith homeworld. Even more troubling to the Jedi was that an image of a Sith holocron had been found at the same location, with the words \"location known. Follow the leader.\" As Lundi had recently gained prominence due to the popularity of his teachings, the Jedi Council held him under suspicion, and sent Jedi Master Qui-Gon Jinn and his apprentice, Obi-Wan Kenobi, to one of his lectures in an attempt to ascertain what they could, and to see if any of his students could have collected the Sith artifacts.\nKenobi found Lundi to be an excellent speaker. Lundi's class, as usual, was packed, and the apprentice was just one of many enthralled by his lecture. Lundi spoke about Sith holocrons, among other topics, and Kenobi believed him to be very educated in a topic about which precious little was known. During the lecture, Lundi was stopped by a student, who wished to ask a question. Lundi was initially angry about being interrupted, but when he saw that the student was Norval, a favorite of his, he allowed the student to continue with his question. Norval asked about the power of the Sith in comparison to that of the Jedi. Lundi replied that the Sith were more powerful, as he believed vengeance and power always trumped peace.\nAt the end of class, Lundi told his students that he would be gone for the next several weeks, but when he returned, he would hopefully have something exciting to show them. Jinn and Kenobi followed him to a starship that was preparing to take off for Lisal. They boarded, but did not see Lundi, leading them to conclude that he had a private cabin. Right before takeoff, a young man tried to board, screaming for Professor Lundi. Jinn recognized him as Norval. Lundi appeared at the door, telling Norval to leave. The boy insisted that Lundi would need his help, but Lundi refused to listen, and Norval was thrown off the ship. As Jinn and Kenobi suspected, Lundi was going after a Sith holocron.\nWhen Lundi believed all other passengers to be asleep, he spoke to the ship's captain, attempting to convince him to drop him off at Nolar. Though the captain refused at first, he acquiesced when presented with some valuable jewelry. When Lundi got off the ship, the two Jedi—who had been listening to his conversation—disembarked at Nolar as well, and followed him to the capital city of Nolari. There they found him attempting to buy a Nolarian 6000 drill. However, when the dealer informed Lundi that he did not have one, the Quermian became very angry. Kenobi could feel his hatred, and was shocked when Lundi marched away, screaming that soon he would not need such a machine. The dealer was left dumbfounded at the unexpected outburst.\nLundi later stole a ship from a pilot he had hired to fly him to Kodai. Kodai was covered in a vast ocean, which receded every ten years, allowing the natives to spend a few hours exploring the exposed sea floor. The Jedi followed him to the Outer Rim planet, renting a room in the same hotel as Lundi, intending to watch him and follow his every move.\nIn the middle of the night, Lundi left the hotel and made his way to a dark chasm where he had learned the holocron, which had been made by the Sith Adas millennia ago, was located. Though he dug it up, he was stopped before he could leave. His student Norval, desperate for power and knowledge, had followed him to Kodai. Norval attacked the Quermian, although Norval was then confronted by Omal, another student of Lundi's who had also followed the teacher. Omal believed that Norval should not have the power offered by the Sith object. The three fought, and in the scuffle, Lundi lost the holocron, and it fell further into the pit. The two students then fled.\nMeanwhile, the Jedi discovered his disappearance and, using the Force, followed his trail to another chasm located on the ocean floor, which was now uncovered. In the pit, they sensed a dark essence. They also discovered Lundi in the pit, screaming about the holocron. He claimed to have held the object, before losing it. The Jedi believed that it had fallen deeper into the lower levels of the chasm. As the water was rising, they were forced to leave, taking Lundi with them. However, the professor had been changed. The power of the holocron had apparently driven him insane, as he would not cease his rantings and attempted to harm the Jedi. They managed to subdue him, and had him placed in Republic custody once they returned to Coruscant.\nDuring his trial, Lundi freely admitted to attempting to recover a Sith holocron and use it for sinister purposes, crimes that the Republic strongly punished. Even Lundi's insanity did not save him. He would rant about the holocron at all times, and cursed Kenobi whenever he saw him. Lundi was ultimately found guilty of attempting to recover a Sith holocron—a very dangerous object in the eyes of the Jedi and the Republic—and imprisoned in a mental hospital.\nIn 29 BBY, Lundi was freed by Kenobi, now a Jedi Knight following the death of Qui-Gon Jinn three years earlier, and his Padawan, Anakin Skywalker. The Jedi had received information suggesting that someone was planning to retrieve the Sith holocron from Kodai, and as Kenobi had experience with it, he was dispatched along with Skywalker to locate it first. Since the Jedi had recently learned that the Sith had returned and were plotting in the shadows, they were anxious to find the holocron before anyone else. Kenobi and Skywalker were allowed to free Lundi and bring him along, hoping that the professor would aid them, his desire of recovering the holocron overcoming his hatred of the Jedi.\nThe Jedi kept Lundi caged on their rented ship, afraid he would hurt himself or attempt to escape. Lundi insulted Kenobi a great deal, as the Quermian blamed the Jedi for his loss of the holocron. After the two Jedi visited Omal and Dedra, two former students of Lundi's, Kenobi questioned Lundi on what had happened that had caused him to lose the holocron. He revealed that Norval had interfered, causing him to drop it. After taunting the Jedi for their fear of the Sith, he agreed to help the duo find the Sith holocron.\nThey made it to Kodai, and there, traveled to the chasm on a gravsled, with Lundi still in his cage. As the waters had not yet receded, the Jedi dove down. However, all they found was an empty box, and they realized someone, likely Norval, had already recovered the holocron. Lundi mocked them, saying he wouldn't help them any further. However, Skywalker, fed up with Lundi, snapped at the Quermian, threatening him by saying that if the Sith did return, the Jedi would not be the only ones to be killed.\nThis outburst quieted the professor, and he agreed to once again help them find the holocron, and Norval. The Jedi learned that the only ship to depart recently had gone to Ploo II, and, using a Jedi mind trick, they borrowed a ship. When Skywalker wondered why Norval had gone to Ploo II, Lundi explained that he had been offered a large reward for finding the holocron, and the interested party was located on Ploo II, Lundi's homeworld. He also told them that Norval's desire for power was surpassed only by his lust for wealth.\nThe three hurried to Ploo II. Once there, they were met by another ship in space. Kenobi boarded the vessel, which he believed to be Norval's. Indeed it was, and Lundi's former student had the holocron. After a brief lightsaber duel, Kenobi defeated the aspiring Sith  and reclaimed the holocron, flying back to their ship in a small shuttle. There, he found Skywalker comforting Lundi, who had grown increasingly frail throughout the course of the journey. The old Quermian was dying, and Skywalker had let him out of his cage for his last moments. With a few final words of regret for his actions in locating the holocron, he passed away. Norval's ship was destroyed by another mysterious vessel belonging to an ally of his under secret employ, who had fired on the ship after learning that Norval no longer had the holocron. Kenobi and Skywalker returned to Coruscant, where Adas's holocron was safely secured in the archival vaults at the Jedi Temple.\nYears later, when Luke Skywalker was seeking information on the Sith and the dark side, he relied heavily on Professor Lundi's texts. These texts contained information on the Sith, such as the fact that Darth Ruin, an ancient Dark Lord of the Sith, was originally a Jedi Master named Phanius. One of Skywalker's students, Tionne Solusar, used Lundi's texts when compiling records of the Old Republic.\nMurk Lundi was easily angered; when he was unable to obtain a drill on Nolar, he became enraged. He also lost his temper on other occasions, for things as trivial as being interrupted while speaking. Lundi had a softer side, however, which was shown when dealing with his favorite student Norval. Following the discovery of the holocron on Kodai, he became insane, and his personality completely changed. He was frequently angry, especially toward the Jedi, whom he blamed for the loss of the holocron. Specifically, Lundi bore a hatred for Obi-Wan Kenobi, who had interfered on Kodai when he first attempted to find it. However, when he was on his deathbed, Lundi felt remorse for his actions. He expressed a disappointment in himself, and told the Jedi that he hoped they could keep the holocron safe.\nLundi was fascinated with the Sith. This interest sprung from a time when, in danger of being fired, he studied the enigmatic order, hoping to learn enough to save his job. His goal was to recover a Sith holocron, which he nearly did. He knew enough about the Sith to be considered an expert. Many people found him to be a fascinating speaker, and his classes were packed and his textbooks difficult to obtain. Lundi was known as an excellent teacher, but a subpar researcher.\nLike many Quermians, Lundi suffered from mental disorders, particularly obsessive-compulsive disorder, which led to him having an unnatural obsession with locating a Sith holocron. This disorder was triggered by his confinement.\nMurk Lundi was created for the book The Followers, a special edition of the Jedi Apprentice series. He was later given a mention in The New Essential Guide to Alien Species, the article Evil Never Dies: The Sith Dynasties, and Jedi vs. Sith: The Essential Guide to the Force, where the The Lundi Series, texts written by Lundi and used by Luke Skywalker for information on the Old Jedi Order, were introduced.\nThe holocron Lundi sought was retconned into being the holocron of Adas, an ancient Sith, in Evil Never Dies, which also revealed some background information about Lundi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Ploo_II/Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/Ploo_system",
  "/wiki/Quermian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Believers",
  "/wiki/Planet/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Darksider",
  "/wiki/39_BBY/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Holocron_of_King_Adas",
  "/wiki/Kodai",
  "/wiki/Jedi/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Norval_(Human)",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Professor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Carnor_Jax%27s_father",
  "/wiki/The_Lundi_Series",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/University_of_Coruscant/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Xim/Legends",
  "/wiki/Xim%27s_empire",
  "/wiki/Kitel_Phard_Dynasty/Legends",
  "/wiki/Sith_cult/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Cularin_system",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Bant_Eerin/Legends",
  "/wiki/Korriban",
  "/wiki/Homeworld/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Lisal",
  "/wiki/Captain/Legends",
  "/wiki/Nolar",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Nolari",
  "/wiki/Nolarian_6000_drill",
  "/wiki/Unidentified_machinery_dealer",
  "/wiki/Pilot/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Kodaian",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Adas",
  "/wiki/Omal",
  "/wiki/Water/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Dedra",
  "/wiki/Hoversled/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Darth_Ruin",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/Obsessive-compulsive_disorder",
  "/wiki/Jedi_Apprentice_Special_Edition:_The_Followers",
  "/wiki/Jedi_Apprentice",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Retcon",
  "/wiki/Wizards.com",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Star_Wars:_Attack_of_the_Clones:_The_Illustrated_Companion",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}