{
 "name": "Murtag",
 "display_name": "Murtag",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Republic Military",
      "301st Infantry",
      "301st Infantry"
     ]
    }
   ]
  }
 ],
 "content": "Murtag was a Human male private who fought in the Republic Military's 301st Infantry during the renewed war between the Galactic Republic and the reconstituted Sith Empire. Stationed on the planet Hoth in a squad under the command of Sergeant Fideltin Rusk, Murtag joined his unit in recovering Imperial survey maps of the nearby Starship Graveyard region in order to aid several Jedi Knights in their covert mission on Hoth, but the squad was pursued by the Imperials and pinned down in a firefight in an abandoned outpost. Severely wounded by the exploding probe droids that the Imperials were using to attack his squad, Murtag was the only survivor of the fight other than Rusk, and the pair escaped from the Imperials with help from the Jedi known as the Hero of Tython.\nA Human male, Murtag enlisted in the Republic Military during the Cold War between the Galactic Republic and the Sith Empire. By the year 3642 BBY, Murtag was a private in the 301st Infantry, and he was assigned to a six-man squad under the leadership of the Chagrian Sergeant Fideltin Rusk on the ice planet Hoth. During the renewed war with the Empire, the 301st Infantry was assigned to aid two Jedi Knights—the Nautolan Leeha Narezz and the Jedi known as the Hero of Tython—in their covert mission to retrieve the schematics for the personal space station of the Sith Emperor. Sergeant Rusk and his squad were tasked with retrieving Imperial survey maps of the nearby Starship Graveyard, and the unit was successful in their mission.\nHowever, Imperial forces pursued Murtag and the rest of the squad, and the unit took up a defensive position in an abandoned outpost in the nearby Crescent Canyon. Rusk, Murtag, and their squad put a strong fight against their attackers, despite the Imperials sending probe droids on suicide runs against them—the droids would rush the Republic troopers and explode when they got close enough—and the unit defeated almost all of the Imperial pursuers. However, during the fighting, four of the squad's members were killed, and Murtag suffered third-degree burns and severe shrapnel wounds, leaving Rusk the only member of the unit still capable of fighting. Fortunately for the wounded soldier, the Hero of Tython, whom Leeha Narezz had sent to the outpost with a companion to reinforce Rusk's quad, eliminated the remaining Imperials.\nMurtag was wounded and in shock when the Knight arrived, but his commanding officer ordered the private to get back on his feet and prepare for the second wave of Imperial attackers. However, the Hero overruled Rusk and told Murtag to get behind cover, taking on the Imperials with the Knight's companion and Rusk. After the fighting ended, the Chagrian officer took Murtag to the nearest medcenter, where the injured Human received treatment for his wounds.\nMurtag was fair-skinned with dark-red hair and green eyes. He suffered severe burns and shrapnel wounds during the fighting on Hoth, and he received scarring across both sides of his face and on the bridge of his nose. While wounded, Murtag easily succumbed to panic and was terrified of dying.\nAs a member of the 301st Infantry, Murtag wore armor decorated in the division's colors of white and dark blue. He wore a white chestpiece and equipment over a black jumpsuit as well as dark blue shoulder pauldrons in addition to his blue-and-white gloves and boots. In combat, Murtag carried a standard-issue blaster rifle, and he was trained in its use as a soldier of the Republic.\nMurtag first appeared in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011, during the Jedi Knight-class mission \"Suicide Squads\" on Hoth. Players can choose the light-side option of ordering Murtag to stay put, which results in his survival, or they can choose the dark-side option of forcing him to fight and causing his death. This article assumes that the player chooses only the moral light-side options as a Republic Jedi Knight character, and therefore it assumes that Murtag survives.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/301st_Infantry",
  "/wiki/Private/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Planet/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Fideltin_Rusk%27s_squad",
  "/wiki/Sergeant/Legends",
  "/wiki/Fideltin_Rusk",
  "/wiki/Map/Legends",
  "/wiki/Starship_Graveyard_(Hoth)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Mission_to_Hoth_(Hunt_for_the_Sith_Emperor)",
  "/wiki/Crescent_Canyon_Ortolan_outpost",
  "/wiki/Probe_droid/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Standard_year/Legends",
  "/wiki/3642_BBY",
  "/wiki/Chagrian/Legends",
  "/wiki/Water/Legends",
  "/wiki/Nautolan/Legends",
  "/wiki/Leeha_Narezz",
  "/wiki/Emperor%27s_Fortress",
  "/wiki/Tenebrae",
  "/wiki/Squad/Legends",
  "/wiki/Crescent_Canyon",
  "/wiki/Droid/Legends",
  "/wiki/Republic_trooper",
  "/wiki/Death/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Nose/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/2011",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Category:Images_of_Murtag",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Battle_of_Ilum",
  "/wiki/In-universe",
  "/wiki/Galactic_Standard_Calendar"
 ]
}