{
 "name": "Murthil%27s_den",
 "display_name": "Murthil's den",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Family type",
     "values": [
      "Selonian den"
     ]
    },
    {
     "name": "Species",
     "values": [
      "Selonian"
     ]
    },
    {
     "name": "Matriarch(s)",
     "values": [
      "Murthil"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "Murthil's Tunnels",
      "Selonian Tunnel Network",
      "Labor Valley",
      "Coronet City",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Fragmented",
     "values": [
      "3640 BBY",
      "during the Battle of Corellia"
     ]
    },
    {
     "name": "Affiliation",
     "values": [
      "Corellian resistance"
     ]
    }
   ]
  }
 ],
 "content": "The Selonian Murthil was the mother of a den of Selonian warriors who resided in the Selonian Tunnel Network under the planet Corellia's capital, Coronet City.\nLed by the fearsome den mother Murthil in 3640 BBY, the den, by then, had defended their home Corellia for years and was known to surface-dwellers only by rumors of their existence in a vast Selonian Tunnel Network under Coronet City. There, they lived in inter-connected caverns either dug out of Corellia's rocks or were formed from a network of pre-established underground pipelines.\nDuring the Galactic War waged between the Republic and the reconstituted Sith Empire, forces of the latter invaded Corellia and rooted out Republic loyalists, resistance fighters, as well as the native Selonians from their homes. Angered by this intrusion, the Corellian Selonians, led by den mother Murthil, aided resistance fighters fleeing from the surface and provided shelter for those affected by the attempted Imperial occupation.\nDuring the struggle for independence from Imperial forces, the Seloians became a major target for housing rebels in the Tunnel Network beneath Coronet City's Labor Valley. By the orders of the Imperial commander—Darth Decimus—an Imperial strike team had been dispatched to pursue the remaining rebel forces and confront den mother Murthil for her assistance to the rebellion.\nIn Murthil's tunnels, Imperial forces struck down many Selonian warriors as they made their way to Murthil's bunker, where the mother and her Elite Selonian Guards lay prepared behind a Force Field Generator.\nStill commanding her den from the bunker, Murthil was faced with an Imperial hero as she conferred with the elite guard Destha. Calling for the Imperials' surrender, the Selonians were ready for combat nonetheless, and a fight eventually ensued.\nRallying her warriors in the chamber, the Selonians battled, though they were no match for the Imperial hero. Downed and defeated, Murthil was accepting her den's downfall when three Imperial Guards entered, General Hesker amongst them. Congratulating the Imperial hero's work, Hesker relayed Darth Decimus' wishes for the fate of the Selonians to fall in the hero's hands.\nThe fate of Corellia's Selonians was decided by the Imperial when Murthil was executed—\"we'll kill every last Selonian on Corellia.\"\nMurthil's Selonian den consisted of many warriors, including the Elite Selonian Guards. Selonian warriors populated the tunnel network of pipelines beneath Coronet City, with the more elite warriors such as armsmasters standing guard nearer to the den mother's tunnels and its bunker, where the Elite Guard, including the twin-blaster pistol-wielding Selonian Destha, protected den mother Murthil.\nMurthil's den's first and only appearance is in the 2011 video game Star Wars: The Old Republic.\nWhen faced with the choice of either killing or capturing Murthil, the player could take the option of sparing the Selonians, allowing Murthil to swear allegiance to the Empire. Before she is taken into Imperial custody, the den mother explains that per Selonians traditions, promises were always kept.\nLater, Major Tradik, an Imperial officer who initially advocated for assaulting the \"flurry aliens\"—the Selonians—in their tunnels as news of their collaboration with resistance forces reached his ear and who served as Darth Decimus' liaison to Imperial forces at Labor Valley, would report to the player of the aftermath of Murthil's capture through an in-game mail, with 3018 credits attached:",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Selonian/Legends#Society_and_culture",
  "/wiki/Selonian/Legends",
  "/wiki/Murthil",
  "/wiki/Selonian_Tunnels",
  "/wiki/Labor_Valley",
  "/wiki/Coronet_City/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/3640_BBY",
  "/wiki/Battle_of_Corellia",
  "/wiki/Corellian/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Selonian/Legends#Social_structure",
  "/wiki/Soldier/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Den_mother",
  "/wiki/Homeworld/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Cave/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/City/Legends",
  "/wiki/Darth_Decimus",
  "/wiki/Elite_Selonian_Guard",
  "/wiki/Force-field_generator",
  "/wiki/Destha",
  "/wiki/Imperial_Guard",
  "/wiki/General/Legends",
  "/wiki/Hesker",
  "/wiki/Darth/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Major/Legends",
  "/wiki/Tradik",
  "/wiki/Officer/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Battle_of_Ilum"
 ]
}