{
 "name": "Mushkil",
 "display_name": "Mushkil",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Honoghr"
     ]
    },
    {
     "name": "Died",
     "values": [
      "25 ABY",
      "Garqi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Noghri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Clan Baikh'vair"
     ]
    }
   ]
  }
 ],
 "content": "A male Noghri from Clan Baikh'vair, Mushkil was one of a team of Noghri commandos from Honoghr that accompanied a New Republic reconnaissance team to the Yuuzhan Vong occupied world of Garqi in 25 ABY. After being inserted onto the planet via the shuttle Best Chance, the team acquired a pair of Human thralls the Yuuzhan Vong had created. However, Mushkil and the majority of the team were trapped in the city of Pesktda's Xenobotanical Garden by the Yuuzhan Vong forces, where the Noghri was felled by the warrior Krag Val.\nMushkil was a male Noghri commando from the species' homeworld of Honoghr, and was part of Clan Baikh'vair. In 25 ABY, during the initial stages of the Yuuzhan Vong War, where the New Republic attempted to stop the advance of the Yuuzhan Vong extra-galactic invaders, Mushkil and five other Noghri commandos were assigned to a reconnaissance team that was led by a trio of Jedi—Corran Horn, Ganner Rhysode, and Jacen Solo. The team's goal was to observe the Yuuzhan Vong and help the local resistance on the occupied planet of Garqi. In order to be infiltrated onto Garqi, Mushkil and the team were crammed aboard the small shuttle Best Chance which was in turn stuffed aboard the freighter Lost Hope. While the X-wing starfighters of Rogue Squadron fended off the attacks on the Lost Hope by the Yuuzhan Vong coralskippers after the freighter launched from the Bothan Assault Cruiser Ralroost, the Lost Hope attempted to gain access to Garqi. However, as it was attempting this, the freighter seemingly exploded, leaving debris to fall down to Garqi below; among that debris was the Best Chance, and it managed to make it to Garqi unseen by the enemy.\nOn Garqi, Mushkil and the team met up with the local resistance, led by Rade Dromath. They learned from them that the Yuuzhan Vong on Garqi had been creating an army of thralls, which were Human slaves controlled by the invaders. They also learned that their enemy was pitting each batch of thralls against Yuuzhan Vong warriors and their Chazrach soldiers in the streets of the city of Pesktda in order to find the batch of thralls that was the most fit for combat. The team decided to capture some of the thralls for analysis, and Mushkil and the group ambushed the Yuuzhan Vong warriors and their soldiers while they were fighting one of the batches of thralls. Mushkil and the Noghri commandos engaged the reptile-like Chazrach, and he and the other commandos cut a swath through them. However, the Yuuzhan Vong warriors managed to rally the thralls that had just been fighting them to their side, and both the thralls and the Chazrach attacked the team. Forced to retreat, the team captured a pair of thralls, and escaped from the battle, though they were pursued by Yuuzhan Vong warriors. While a small part of the group took the thralls back to the Best Chance, Mushkil and the others found themselves trapped in the Pesktda Xenobotanical Garden in a grove of bafforr trees by the enemy.\nA standoff ensued, with the Yuuzhan Vong force led by the warrior Krag Val facing Mushkil and the team. During the standoff, Mushkil placed himself between the Jedi and the enemy, and declared that the enemy must get through him to attack the Jedi. A blaster bolt broke the standoff, and as both sides charged each other, Mushkil reached Val first. The Noghri cast a knife at the Yuuzhan Vong, but Val knocked it aside with his amphistaff before he swept Mushkil's feet out from under him and impaled him with the staff. However, the team proved victorious after the sentient bafforr trees let pollen fall upon the fighters, which caused the living armor of the Yuuzhan Vong warriors to suffocate their wearers as the armor died. The bafforr tree grove was burned in order to hide the advantage the bafforr trees' pollen gave the New Republic against the invaders, and Mushkil's body was likewise consumed. The rest of the team later escaped Garqi with the thrall specimens.\nDuring the standoff, the Noghri warrior stood between the Yuuzhan Vong and the Jedi, to force the enemy to come through him to get the Jedi. Mushkil was a skilled warrior with his hands and feet, and he and the other Noghri cut through many Chazrach during the attempt to capture the thralls. He also reached Krag Val before the Jedi, though his skill with a knife failed to save him from Val's amphistaff.\nMushkil first appeared in 2000's novel The New Jedi Order: Dark Tide II: Ruin, written by Michael A. Stackpole as part of the Dark Tide Duology. He also received an entry in The Complete Star Wars Encyclopedia, released in 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Honoghr/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Garqi/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Clan_Baikh%27vair",
  "/wiki/Commando/Legends",
  "/wiki/New_Republic_Garqi_reconnaissance_team",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Planet/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Best_Chance_(shuttle)",
  "/wiki/Battle_of_Garqi",
  "/wiki/Human/Legends",
  "/wiki/Thrall",
  "/wiki/Biot",
  "/wiki/City/Legends",
  "/wiki/Pesktda",
  "/wiki/Pesktda_Xenobotanical_Garden",
  "/wiki/Death/Legends",
  "/wiki/Krag_Val",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Extra-galactic",
  "/wiki/Jedi/Legends",
  "/wiki/Corran_Horn",
  "/wiki/Ganner_Rhysode",
  "/wiki/Darth_Caedus",
  "/wiki/Freighter/Legends",
  "/wiki/Lost_Hope",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Yorik-et",
  "/wiki/Bothan_Assault_Cruiser",
  "/wiki/Ralroost",
  "/wiki/Resistance_(Garqi)",
  "/wiki/Rade_Dromath",
  "/wiki/Slavery/Legends",
  "/wiki/Chazrach",
  "/wiki/Soldier/Legends",
  "/wiki/Bafforr_tree",
  "/wiki/Blaster/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Amphistaff",
  "/wiki/Sentience/Legends",
  "/wiki/Vonduun_Skerr_Kyrric",
  "/wiki/Fire/Legends",
  "/wiki/2000",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Dark_Tide_Duology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)"
 ]
}