{
 "name": "Mussat_Nasrabi",
 "display_name": "Mussat Nasrabi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Mussat Nasrabi was a male Mon Calamari who served aboard the Sullustan cruise liner, the Starlite Cloud, as chief engineer. It was here that he became good friends with the smuggler Platt Okeefe.\nHe later found work on a tibanna processor in the heart of Cloud City, Bespin, and was able to siphon off some of the gas to his own processing facility. From there, he supplied Okeefe and other smugglers for a tidy profit. With this, Nasrabi was able to hire Ugnaughts to run his processor while he moved on to bigger projects.\nNasrabi then established a small but high-class casino, called The Floating Fish. Tastefully decorated, it had polarized windows to provide privacy for its clients. Nasrabi decorated the casino with a number of globes hanging from the ceiling filled with live fish, a nod to his own culture. Nasbari was known to run the casino well, gaining a reputation for a clean, honest establishment. The casino provided games of all sorts, including sabacc and Trin sticks.\nIn 1 ABY Okeefe made a run out to Bespin to pick up some tibanna from Nasrabi. He was pleased to help her out; especially since a run a year before to Bonadan had gone wrong. However, Major Birket of the Imperial Security Bureau was aware of the deal and set bounty hunters on Okeefe's trail. Okeefe eventually managed to beat them, and made the transfer with Nasrabi.\nIt is likely Mussat was related to Amira Nasrabi, the Mon Calamari proprietor of the Illuminated Aquean casino in the Vaynai Archipelago.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nasrabi_(disambiguation)",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Neeta",
  "/wiki/Sullustan/Legends",
  "/wiki/Starlite_Cloud",
  "/wiki/Engineer/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Tibanna/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/The_Floating_Fish",
  "/wiki/Sabacc/Legends",
  "/wiki/Trin_sticks",
  "/wiki/1_ABY/Legends",
  "/wiki/Bonadan/Legends",
  "/wiki/Major/Legends",
  "/wiki/Birket",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Amira_Nasrabi",
  "/wiki/Illuminated_Aquean",
  "/wiki/Casino/Legends",
  "/wiki/Vaynai_Archipelago",
  "/wiki/Imperial_Double-Cross",
  "/wiki/Platt%27s_Smugglers_Guide",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Vaynai_Archipelago",
  "/wiki/Star_Wars_Gamer_8"
 ]
}