{
 "name": "Muura",
 "display_name": "Muura",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Over 1.5 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith",
      "Khai family"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Gavar Khai",
      "Vestara Khai"
     ]
    }
   ]
  }
 ],
 "content": "Muura was a Keshiri female from the planet Kesh and an attendant to the Sith Tyro Vestara Khai in 41 ABY. Muura was talented in the making of the ceremonial vor'shandi markings, as well as elegantly braiding hair. She used these talents to lavishly decorate Vestara the morning that the Tyro traveled to the Circle Chambers in the city of Tahv for a meeting with the Circle of Lords, the planet's ruling council. Vestara was then apprenticed to Lady Rhea and moved to live in the Sith Temple. Muura was subsequently dismissed from the Khai household, as her services were no longer needed.\nMuura was a female Keshiri from the Wild Space planet of Kesh. She was a maidservant of the Khai family, a Human family in the Lost Tribe of Sith, in 41 ABY. She often attended to Sith Tyro Vestara Khai, the only daughter of Sith Saber Gavar Khai and his wife, Lahka Khai. On the morning that Vestara was to travel to the Circle Chambers in the capital city of Tahv for a meeting with the Circle of Lords, the planet's governing council, Muura prepared Vestara with vor'shandi markings—which were made from the nectar of the S'rai plant—particularly of the dalsa flower, and intricately braided her hair. Afterward, Muura was no longer needed as his daughter's attendant, as Vestara was chosen to be the apprentice of Lady Rhea, and would have to live in the Sith Temple. Gavar informed Muura that the family no longer had need of her at their estate, and he gave her clothing and food to last several days. Gavar also told a few of his friends that Muura had become available for work elsewhere.\nStanding over 1.5 meters tall, Muura had the soft purple skin and lilting accent of her species. Muura was accustomed to Vestara's unhappiness at the marring scar on her face, and she fawned over the Tyro, praising her beauty even though Vestara herself thought that Muura was more attractive. Muura was skilled in the artistry of vor'shandi markings, beautiful designs painted onto members of the Tribe for special ceremonies. She was also highly dexterous, as she was able to weave her mistress' long brown hair into intricate braids.\nMuura was confused by Gavar's sadness in the house as his daughter left, and when he informed her that her services would no longer be needed; but she knew better than to ask for a reference upon her dismissal.\nMuura was created by author Christie Golden for her first Star Wars novel, Fate of the Jedi: Omen, the second novel in the nine-part Fate of the Jedi series. She was later mentioned in Golden's third installment in the series, Fate of the Jedi: Ascension, the eighth novel overall.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/Keshiri",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Khai_family",
  "/wiki/Gavar_Khai",
  "/wiki/Vestara_Khai",
  "/wiki/Planet/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Sith_Tyro",
  "/wiki/41_ABY",
  "/wiki/Vor%27shandi",
  "/wiki/Hair/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Circle_Chambers",
  "/wiki/City/Legends",
  "/wiki/Tahv",
  "/wiki/Circle_of_Lords",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Olaris_Rhea",
  "/wiki/Kesh_Sith_Temple",
  "/wiki/Khai_estate",
  "/wiki/Wild_Space/Legends",
  "/wiki/Human/Legends",
  "/wiki/Sith_Saber",
  "/wiki/Marriage/Legends",
  "/wiki/Lahka_Khai",
  "/wiki/Capital/Legends",
  "/wiki/S%27rai_plant",
  "/wiki/Dalsa_flower",
  "/wiki/Species/Legends",
  "/wiki/Christie_Golden",
  "/wiki/Star_Wars",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)"
 ]
}