{
 "name": "Muuurgh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Togoria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Nearly 3 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Muuurgh was a male Togorian assigned as a bodyguard to Han Solo while he was working on Ylesia.\nThe t'landa Til claimed that Muuurgh was to be Solo's bodyguard, but Han thought it was fairly clear that the large feline was intended to keep him in line. The two became friends, despite some initial awkwardness due to the conditions of their meeting, and Muurgh's trouble with Basic.\nSolo learned that Muuurgh had come to Ylesia on a quest to find his mate, Mrrov, who had left Togoria and disappeared. He had tracked her down to Ylesia, where she had come seeking religious sanctuary. The t'landa Til told him that no Togorian had ever been to the Ylesian colonies. Muuurgh was crushed, but he obtained a job as a guard in order to earn enough money to continue his search. The t'landa Til were careful to assign him to posts where he would not learn of Mrrov's presence.\nAfter being assigned to Solo, Muuurgh was trained to be his gunner, though he never became particularly skilled at it—though female Togorians had an aptitude for technology, males were more primitive hunters. When Solo flew the Ylesian Dream on a mission, they where attacked by pirates. Han managed to kill one with a concussion missile, but Muurgh suffered a burn wound in the attack. Solo plotted a course for the nearest planet he could, Alderaan, where Muurgh was treated for his wound.\nWhen Han befriended Bria Tharen, he told her of his friend's plight. She remembered seeing a Togorian on Ylesia some months before that, and when she gave a description based on her recollection, it matched that of Mrrov.\nWhile Han was on a mission to Nal Hutta, Muuurgh made the journey to another of the Ylesian colonies. When he arrived, he found that Mrrov was there, as she had been all along. He watched as she participated in a ceremony and then was selected to be shipped to the spice mines of Kessel .\nWhen Han returned from Nal Hutta, the two made their escape along with Bria, and then rescued Mrrov on their way out.\nAfter returning Muuurgh and Mrrov to Togoria, Han and Bria stood as best man and maid of honor in Muuurgh and Mrrov's wedding. They would later go on to have three kits.\nHe later returned to Ylesia with a group of Togorians to help the Rebel Alliance conquer the slave planet. When Mrrov was wounded by a Gamorrean, Muuurgh tore out the guard's throat.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Togoria/Legends",
  "/wiki/Togorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Ylesia/Legends",
  "/wiki/T%27landa_Til",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Mrrov",
  "/wiki/Alderaan/Legends",
  "/wiki/Bria_Tharen",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Wedding_of_Muuurgh_and_Mrrov",
  "/wiki/Gamorrean/Legends",
  "/wiki/The_Paradise_Snare",
  "/wiki/Rebel_Dawn",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}