{
 "name": "Muz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Muun"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Muz, also known as \"Muz the Fence,\" was a Muun male who owned a shop on the planet Tatooine in 137 ABY. As a black marketeer, he fenced stolen goods and supplies. The former Jedi and bounty hunter Cade Skywalker sold five shipments of contraband to Muz before Vigo Lun Rask, a leader in the Black Sun criminal organization, asked the Muun to find out who was preventing them from acquiring contraband from Imperial shipping vessels. After purchasing a shipment of blasters from Skywalker, Muz informed Rask that the bounty hunter was the one hindering their operations by taking the contraband they wished to acquire.\nMuz, a Muun male, lived on the Outer Rim planet Tatooine during the Second Imperial Civil War. By 137 ABY, he operated a store, where he bought and sold illegally obtained items, such as armaments and other goods. The black marketeer, nicknamed \"Muz the Fence,\" purchased items from the former Jedi and bounty hunter Cade Skywalker, who sold five shipments of contraband to the Muun under the pseudonym Luke Skywalker.\nHowever, Vigo Lun Rask, who was a leader in the Black Sun criminal organization, contacted Muz and demanded that he find out who was preventing his pirates from stealing shipments from Imperial transport vessels. Skywalker, who had recently obtained a shipment of Thunderbolt Mark 7 blasters, attempted to sell them to Muz. The Muun refused to buy them for the full price, electing to purchase the lot for a quarter of the standard rate. Skywalker tried to intimidate Muz into buying the shipment at full price by firing his blaster in the shop.\nHowever, Muz refused and gave him the same offer minus the damages done to his shop. Muz warned Skywalker to leave Tatooine after the latter agreed to the price. He then contacted Rask and informed him that Skywalker was the one hindering Black Sun's operations by obtaining the contraband the criminal organization wished to acquire.\nMuz had brown skin and blue eyes, and wore blue-colored clothing with a red vest. He was condescending to Cade Skywalker when the former Jedi attempted to sell his sixth shipment of contraband to him, and he refused to negotiate on the price he was offering Skywalker. However, Muz did make it a point to warn Skywalker about Black Sun's interest in locating the person hindering their operations. After the meeting, he told Rask about Skywalker's whereabouts and lied to the Vigo about buying the latest shipment from the former Jedi.\nMuz appeared in the thirty–seventh issue of the comic series Star Wars: Legacy, written by John Ostrander and released on June 24, 2009. He was penciled by Jan Duursema.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Muun/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Muz%27s_shop",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/137_ABY",
  "/wiki/Black_marketeer",
  "/wiki/Merchant/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Vigo/Legends",
  "/wiki/Lun_Rask",
  "/wiki/Black_Sun/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Starship/Legends",
  "/wiki/M-40_light_repeating_blaster",
  "/wiki/Bounty/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Rawk_chopped_special",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Legacy_(2006)_37",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/John_Ostrander",
  "/wiki/June_24",
  "/wiki/2009",
  "/wiki/Jan_Duursema"
 ]
}