{
 "name": "Mynnic",
 "display_name": "Mynnic",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Mynnic was a male Human Jedi Knight serving the Jedi Order and the Galactic Republic in the final decades of the Republic Classic era. Unlike some Jedi, Mynnic preferred to work with non-Force-sensitives to complete missions, going as far to create a band of adventurers that roamed the galaxy around 32 BBY.\nDiscovered to be Force-sensitive at an early age by representatives of the Jedi Order, Mynnic was taken to the Coruscant Jedi Temple for training in the ways of the Force. Passing through the Temple academy, Mynnic was trained as a Padawan and built himself a blue-bladed lightsaber before completing his Trials of Knighthood and ascending to the rank of Jedi Knight. Continuing his studies independently, Mynnic pursued the path of the Jedi Consular and went on long journey missions often. He wore the traditional robes of a Knight; though he wore a high-tech headband that hearkened to a tradition found on his homeworld.\nA wise and noble man, Mynnic's spirituality made him a great leader and thoughtful strategist. At some point in his travels Mynnic met the young Cerean noble Pal-Han-Das; the Rodian scoundrel Vinto; and a Trandoshan warrior named Wertsnik. All four formed a small group of compatriots who traveled around the galaxy around the time of the Invasion of Naboo resolving conflict without force when at all possible. At some point, the group came face to face with a group of Trade Federation battle droids and were forced to engage them in battle.\nMynnic was originally featured in a Star Wars Gamer article in which he was supposed to show an example of combat to players of the Star Wars Roleplaying Game. Mynnic's appearance was based on that of the G.I. Joe character Spirit Iron-Knife.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Jedi_recruiter",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Padawan/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/Jedi_apparel",
  "/wiki/Cerean/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Pal-Han-Das",
  "/wiki/Rodian/Legends",
  "/wiki/Vinto",
  "/wiki/Trandoshan/Legends",
  "/wiki/Wertsnik",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Battle_droid/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Survival_Strategies:_Combat_Tactics_for_the_Star_Wars_Roleplaying_Game",
  "/wiki/Star_Wars_Gamer_6"
 ]
}