{
 "name": "Myrsk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Corporate Sector AuthoritySecurity Police",
      "Security Police"
     ]
    }
   ]
  }
 ],
 "content": "Myrsk was a male Nikto sergeant who worked for the Espos at Mondder Spaceport on Etti IV. He was a veteran of the Clone Wars, where he served with the Confederacy of Independent Systems. He fled to the Corporate Sector at the end of the conflict to escape the Galactic Empire's xenophobia and possible retaliation for his service.\nIn 3 BBY, he and his officers broke up a brawl that Jahan Cross, Han Solo and Chewbacca were fighting with a group of disgruntled cantina patrons. When he attempted to arrest Cross, he claimed diplomatic immunity. When Myrsk attempted to arrest Solo and Chewbacca, Cross claimed they were in his employ and therefore also under diplomatic immunity. Myrsk then sarcastically asked if he could arrest the group of brawlers from the cantina. Once assured they were indeed criminals, he stalked away, muttering under his breath about how Imperials annoyed him.\nMyrsk was present at the Stark Compound when Jahan Cross was arrested for the murder of Dah'lis Stark. He informed Cross that his diplomatic immunity was revoked by Emesh Nar. After Cross overpowered a pair of Espos and escaped, he attempted to shoot him down, but was stopped by Elli Stark.\nHe investigated the crash of Cross's speeder after the agent escaped from the Stark Compound. He didn't believe that Cross died in the crash and decided to interrogate Solo to see if he knew of the whereabouts of Cross. He and Dimity interrogated Solo and Chewbacca aboard the Millennium Falcon, and when Solo sarcastically responded to his questions, he punched the smuggler. Chewbacca reacted violently and had to be restrained by Solo. Solo suggested that it would be wise for Myrsk to apologize, which the Espo did. He and Dimity departed the freighter, and Myrsk asked Dimity why he didn't back him up. Dimity responded that \"it was above my pay grade.\"\nMyrsk staked out the landing bay where the Falcon was, confident that Cross would eventually show up. During this time, he was informed by comlink that Emesh Nar had been killed and the ambassador's private shuttle had been stolen from the embassy. Myrsk ordered all units to intercept the stolen shuttle and prevent it from reaching orbit. When Cross, who was piloting the shuttle, attempted to bluff his way past the two interceptors sent after him by stating that the ambassador was on board, the sergeant interrupted and commanded the pilots to bring the shuttle to ground. As the pursuit returned to the surface of Etti IV, Myrsk followed in a repulsorlift vehicle. He ordered ground units to be at all intersections along the pursuit route and authorized them to shoot to kill if necessary. After he ran his ship into a mag-lev train, causing a huge accident, Myrsk arrived to survey the damage. Despite his partner's belief that Cross was immolated in the crash, Myrsk was confident he was still alive.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nikto/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Security_Police",
  "/wiki/Sergeant/Legends",
  "/wiki/Mondder_Spaceport",
  "/wiki/Etti_IV/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Speciesism",
  "/wiki/3_BBY/Legends",
  "/wiki/Jahan_Cross",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Stark_Compound",
  "/wiki/Death/Legends",
  "/wiki/Dah%27lis_Stark",
  "/wiki/Emesh_Nar",
  "/wiki/Elli_Stark",
  "/wiki/Dimity",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Imperial_Embassy_(Etti_IV)",
  "/wiki/K-222_Aero-Interceptor",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_1",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_2",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_3"
 ]
}