{
 "name": "Naat Reath",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Echuu Shen-Jon"
     ]
    }
   ]
  }
 ],
 "content": "Naat Reath was a female Human Padawan who served the Jedi Order and the Galactic Republic during the Clone Wars\nA Force-sensitive Human, Naat Reath and her brother, Stam, were given to the Jedi Order for training in the ways of the Force by their parents. Studying together at the Coruscant Jedi Temple during the Separatist Crisis which would plague the Galactic Senate for nearly a decade, Reath remained at the Temple when her brother and his tutor, Jedi Master Echuu Shen-Jon, were called to fight on Geonosis for the opening salvo of the Clone Wars. During the fighting, Stam Reath confronted the Dark Acolyte Sev'rance Tann and was slain leaving Shen-Jon and Reath in great emotional pain.\nIn an attempt to help the pair grieve, the Jedi High Council assigned Reath to Shen-Jon as his new Padawan. Taking up the rank of Commander in the Grand Army of the Republic, Reath was placed in command of clone troopers who would follow her orders in battle. Eager to prove herself a worthy apprentice, Reath also longed to avenge her brother despite the Jedi Code's negative view on vengeance. Hunting General Taan across the galaxy, the pair hoped to rob the Confederacy of Independent Systems of one of their most aspiring generals, but their actions brought them dangerously close to the dark side of the Force. When they finally tracked Tann to the planet Krant, Reath was captured by the Acolyte and held prisoner. Challenging Shen-Jon to a lightsaber duel for the prize of keeping Reath alive, Shen-Jon fell to the dark side and was able to defeat Taan in combat. When he set out to mutilate the Chiss woman's body, Reath stopped her master, begging him to abandon his hate and return to Coruscant with her. Upon his refusal, Reath returned to the Temple and reported to the High Council that Shen-Jon had killed Tann but died from wounds suffered in battle. However, Reath's testimony to the High Council was met with mixed reception. Mace Windu in particular did not fully believe Reath, and wondered for the rest of his life what happened on Krant. Windu asked Reath about the subject on at least one other occasion, but she spoke evasively, leaving the truth unclear to Windu and the High Council.\nReath's ultimate fate into the Rise of the Empire remained unknown, but when her Master Echuu Shen-Jon resurfaced decades later, she did not.\nNaat Reath's appearance in the briefing screen is taken from a promotion picture of Immi Danoo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Nautolan/Legends",
  "/wiki/Naat_Lare",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Echuu_Shen-Jon",
  "/wiki/File:Perilousrevengeechuu.ogg",
  "/wiki/Padawan/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Stam_Reath",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Sev%27rance_Tann",
  "/wiki/Battle_of_Krant",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/General/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Krant",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Immi_Danoo",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}