{
 "name": "Naboo-1",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Naboo Royal Space Fighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Squad Leader Naboo-1 was a Human male pilot in the Naboo Royal Space Fighter Corps. He was active in 32 BBY and was captured by the Trade Federation during the Invasion of Naboo.\nThe Jedi Knight Obi-Wan Kenobi rescued Naboo-1 and five other pilots before the final stages of the invasion. Kenobi infiltrated the Royal Observatory where the pilots were held and freed them. The squad leader agreed to accompany Kenobi back to the Naboo Resistance, but stated that the pilots would let Kenobi precede them. Kenobi led the pilots back to the Theed Royal Palace, stopping them several times to engage Federation forces before joining back up with the resistance. Naboo-1 reported the success of their breakout to resistance leader Asha and requested access to the south entrance.\n\"Squad Leader\" was voiced by Nick Jameson in the 2001 video game Star Wars: Obi-Wan. The mission \"Captives of the Federation\" in which this character appears contradicts the chronology of Star Wars: Episode I The Phantom Menace. The character identifies himself as \"Naboo-1\" during a communication transmission to Asha at the conclusion of the mission. It is unclear if this individual is supposed to represent Ric Olié, the leader of Bravo Flight who accompanied the Queen throughout the movie.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Obi-Wan",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Naboo_Royal_Space_Fighter_Corps/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Rescue_mission_in_Theed",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Naboo_Resistance",
  "/wiki/Theed_Royal_Palace/Legends",
  "/wiki/Asha_(Naboo)",
  "/wiki/Nick_Jameson",
  "/wiki/2001",
  "/wiki/Video_game",
  "/wiki/Ric_Oli%C3%A9/Legends",
  "/wiki/Bravo_Flight/Legends",
  "/wiki/Obi-Wan:_Prima%27s_Official_Strategy_Guide"
 ]
}