{
 "name": "Nadea Tural",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thrad"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Thradian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Senate",
      "Imperial Senate",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Nadea Tural was a female Thradian who represented the planet of Thrad in the Senate of the Galactic Empire. Around fifteen years after the founding of the Empire, Tural suffered a crash while she was traveling to Arkanis. She was rescued by the crew of the starship Ghost, a group of individuals who opposed the Empire. Although Tural's initial feelings toward the rebels were scorn and fear, she changed her mind after Imperial Commander Earll boarded the Ghost and threatened to execute the rebels without a proper trial.\nTural's sympathies towards the rebel cause led to her imprisonment in the Arrth-Eno Prison Complex on Imperial Center. She was killed when Rebel spy Eneb Ray attempted to rescue her and other imprisoned senators from the prison, an event that was a trap by the Emperor, Darth Sidious, to lure all Rebel spies on Coruscant to one place and kill the senators and spies in the destruction of the prison. The Emperor used this as propaganda against the Rebel Alliance, claiming that they killed the senators in an act of terrorism.\nA female Thradian, Nadea Tural was a politician. By the fifteenth celebration of the Galactic Empire's founding, she represented her home planet of Thrad in the Imperial Senate, the de jure legislative assembly of the Empire. At some point during the fourth year before the Battle of Yavin Senator Tural set course for the planet Arkanis, but the hyperdrive of her Star Commuter 2000 shuttle malfunctioned, causing it to crash.\nAlthough injured, Tural managed to send a distress call, which was intercepted by the Ghost, a light freighter owned by a band of individuals who opposed the Empire. Upon seeing who her rescuers were, Tural was at first terrified, thinking that the rebels would torture her. However, the rebels, led by the Twi'lek captain Hera Syndulla and the Jedi in exile Kanan Jarrus, were adamant to prove to the senator that the Empire she served was, in fact, an oppressive regime.\nTural was unwilling to believe them, but her mind would soon change. Having also received the distress call, an Imperial Gozanti-class cruiser attacked the Ghost, and a squad of stormtroopers led by Commander Earll boarded the rebel craft. Earll and her men forced the rebels to surrender and ordered their immediate execution. Upon hearing the commander's orders, Senator Tural was incensed, and she demanded that the Ghost crew get a fair trial. Earll brushed Tural's objections aside, telling her that the Senate had no jurisdiction in that matter.\nWhen the stormtroopers were about to fire, the senator jumped in front of Commander Earll, allowing Kanan Jarrus to Force push everyone out of the way. The rebels managed to get the upper hand, and the Imperial troops were pushed back to their ship. Later on, Senator Tural was brought to the planet of Camson by her rebel rescuers. Although she did not approve of all they did, she thanked them for saving her and giving her a clearer perspective on the Imperial Senate's actual helplessness.\nAfter Syndulla and her crew opened her eyes to the atrocities of Palpatine's regime, Tural started to actively help people who wished to oppose the Empire in secret. Through a fellow Thradian named Beneda, she arranged transport for Swain and Cogon, two Imperial defectors who had taken shelter on Thrad. Although Tural had planned to send the defectors to the planet Klonoid, where they would join a rebel cell, the two were captured by Agent Kallus of the Imperial Security Bureau before they could depart.\nTural became a rebel sympathizer in the Senate, which the Emperor, Darth Sidious, disbanded shortly before the Battle of Yavin, and was arrested due to her views. She was imprisoned in the Arrth-Eno Prison Complex. Some time after the Battle of Yavin, Rebel spy Eneb Ray was ordered by Princess Leia Organa of the Rebel Alliance to infiltrate Arrth-Eno, where Tural and other Rebel-sympathetic senators were scheduled to be executed. Upon breaking into the facility, Tural told Ray that the Emperor himself was planning to visit the prison to oversee their execution. As a result, Ray and other Rebel spies hatched a plot to assassinate the Emperor. Unknown to the spies, however, was that the Emperor's alleged presence was a trap to lure all of the Rebel spies on Coruscant to one place. The Emperor only sent a body double, and the Empire destroyed the prison—along with Tural, the other senators, and all of the spies except for Ray. After their deaths, the Emperor broadcast a message on Coruscant alleging that the Rebels destroyed Arrth-Eno in an act of terrorism and thus deprived the senators of a trial.\nNadea Tural first appeared in the \"Senate Perspective\" comic strip from the ninth issue of the Star Wars Rebels Magazine, published on September 9, 2015. While designing Tural, artist Ingo Römling based her on sketches drawn by Ralph McQuarrie, the Star Wars original trilogy concept artist.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Thrad",
  "/wiki/0_ABY",
  "/wiki/Coruscant",
  "/wiki/Thradian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Senate",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/Arkanis",
  "/wiki/Spectres",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Commander",
  "/wiki/Earll",
  "/wiki/Prison",
  "/wiki/Arrth-Eno_Prison_Complex",
  "/wiki/Spy",
  "/wiki/Eneb_Ray",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Propaganda",
  "/wiki/Politics",
  "/wiki/Empire_Day",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Homeworld",
  "/wiki/Battle_of_Yavin",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Senator",
  "/wiki/Hyperdrive",
  "/wiki/Star_Commuter_2000",
  "/wiki/Shuttle",
  "/wiki/Distress_signal",
  "/wiki/Light_freighter",
  "/wiki/Torture",
  "/wiki/Twi%27lek",
  "/wiki/Captain",
  "/wiki/Hera_Syndulla",
  "/wiki/Jedi",
  "/wiki/Kanan_Jarrus",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Stormtrooper",
  "/wiki/Death",
  "/wiki/Force_push",
  "/wiki/Camson",
  "/wiki/Eye",
  "/wiki/Beneda",
  "/wiki/Transport",
  "/wiki/Swain",
  "/wiki/Cogon",
  "/wiki/Klonoid",
  "/wiki/Rebel_cell_(Klonoid)",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Dissolution_of_the_Imperial_Senate",
  "/wiki/Yavin_Prime",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Arrth-Eno_Mission",
  "/wiki/Unidentified_Darth_Sidious_body_double",
  "/wiki/Senate_Perspective",
  "/wiki/Comic_strip",
  "/wiki/Star_Wars_Rebels_Magazine_9",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/September_9",
  "/wiki/2015",
  "/wiki/Ingo_R%C3%B6mling",
  "/wiki/Ralph_McQuarrie",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/No_Sympathy",
  "/wiki/Star_Wars_Rebels_Magazine_14",
  "/wiki/Star_Wars_Annual_(2015)_1",
  "/wiki/August_26",
  "/wiki/File:Thradian_design-Twitter.png"
 ]
}