{
 "name": "Nadia Grell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sarkhai"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3664 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sarkhai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic RepublicOssus Colonization Initiative",
      "Ossus Colonization Initiative",
      "Rift Alliance"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Barsen'thor"
     ]
    }
   ]
  }
 ],
 "content": "Nadia Grell was a female Sarkhai who became a Padawan, later a Jedi Knight of the Jedi Order during the Galactic War. She also replaced her father, Tobas Grell after his death, as the senator of Sarkhai; until the outbreak of the war against Zakuul.\nWhen Nadia's former mentor, the Barsen'thor he had mysteriously disappeared during the Eternal Empire's conquest; she begin to search for the man that she loved, but Nadia later abandoned her search for her former mentor; dedicating all her efforts on the war against the Eternal Empire.\nNadia was the daughter of Senator Tobas Grell of Sarkhai and Maykia Grell. Nadia had not spent much time off her home planet. She held an intense curiosity for all the species and experiences that she had never seen before and picked up an interest in diplomacy from assisting her father.\nWhen the Barsen'thor was tasked with meeting and aiding the Rift Alliance on the Republic ship, the Fortitude, Sith ambushed the ship. They rigged it to crash and kill the leaders of the Rift Alliance and separate them from the Galactic Republic. Nadia had hidden and been trying to contact anyone she could. She was able to warn the arriving Barsen'thor, who saved the delegation by evacuating to the Jedi's ship, where they stayed for a time.\nOn Quesh, the Jedi Consular discovered that Nadia was unusually strong in the Force during an incident at Attis Station. Force-users were practically unheard of on her homeworld, rendering Nadia as a freak in the eyes of her people. Nadia's father took her along on his diplomatic missions away from Sarkhai hoping that he could find someone to help her control her abilities and help her meet similar people. But upon seeing Jedi, he noticed she was more powerful but uncontrolled in comparison to the masters he met.\nAfter her father's death at the hands of \"Stark\", a mysterious Sith Lord whose name was taken by the First Son, Nadia was inducted into the Jedi Order as a Padawan under the guidance of the Barsen'thor in accordance with her father's will.\nNadia would inherit her father's position representing her home for the Republic and would have to leave training for these duties from time to time.\nAt a later point during the Galactic War, Nadia was reciting the Jedi Code with her Master when Lieutenant Felix Iresso interrupted, explaining that their ship's navicomputer had been sliced, its destination plotted towards Rishi. Zenith chimed in that Rishi was a haven for pirates and gunrunners, so there was no way anyone from there could've done so. As the crew checked the navicomputer, Nadia's Master had a vision that compelled the Barsen'thor to announce that they were going to Rishi.\nDuring the Eternal Empire's conquest, the Barsen'thor went missing for sometime, Nadia consulted the Noetikons and decided to rally the Barsen'thor's old allies; such as Gaden-Ko, the Esh-kha and the Balmorran resistance to search for her master. During this time, she also was promoted to the rank of Jedi Knight and at her request, replaced as senator by Thariki, so that she could better serve the war effort. At some point before the return of the Outlander, she met Jedi Master Gnost-Dural and joined in his efforts to establish a hidden Jedi colony on Ossus.\nAfter the death of Nadia's mentor, she took his holocron, which the Jedi Consular had assembled on Rishi and buried it in the forests of her home planet.\nNadia's Force powers were volatile and difficult for her to control; prior to Jedi training and even as a Padawan, her power would occasionally surge beyond her grasp; she once destroyed a rock that she was levitating. She used a double-bladed lightsaber in battle and used her explosive Force powers in combat as well.\nNadia Grell is a companion character for the Jedi Consular class of Star Wars: The Old Republic. In the original class storyline, she was a romance option only for male player characters. After she returned in the \"Jedi Under Siege\" update, she became a romance option for all Jedi Consulars regardless of gender. Nadia can be invited to join the Eternal Alliance if the Outlander is a Consular. Nadia is voiced by Holly Fields.\nAccording to several posts on the official SWTOR, her age in game is 22.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Nadia_Grell",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sarkhai",
  "/wiki/3664_BBY",
  "/wiki/Sarkhai_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ossus_Colonization_Initiative",
  "/wiki/Rift_Alliance",
  "/wiki/The_Barsen%27thor",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galactic_War",
  "/wiki/Tobas_Grell",
  "/wiki/Senator/Legends",
  "/wiki/War_against_Zakuul",
  "/wiki/Eternal_Empire",
  "/wiki/Maykia_Grell",
  "/wiki/Fortitude_(Valor-class_cruiser)",
  "/wiki/Sith/Legends",
  "/wiki/Quesh",
  "/wiki/Jedi_Consular",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Attis_Station",
  "/wiki/Death/Legends",
  "/wiki/Stark",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Syo_Bakarn",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Felix_Iresso",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Rishi/Legends",
  "/wiki/Zenith",
  "/wiki/Force_vision/Legends",
  "/wiki/Gaden-Ko",
  "/wiki/Esh-kha",
  "/wiki/Balmorran_resistance",
  "/wiki/Thariki",
  "/wiki/Alliance_Commander",
  "/wiki/Gnost-Dural",
  "/wiki/Third_Barsen%27thor%27s_holocron",
  "/wiki/Force_power/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Eternal_Alliance",
  "/wiki/Holly_Fields",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook",
  "/wiki/January_18",
  "/wiki/2012"
 ]
}