{
 "name": "Nagme",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan VongShaper caste",
      "Shaper caste"
     ]
    }
   ]
  }
 ],
 "content": "Nagme was a female Yuuzhan Vong Master Shaper. At the start of the Yuuzhan Vong War she was stationed on Dibrook interrogating Yuledan. Her work included changing people from the galaxy into monsters for an army, though they were only partially effective. At some time, she and Tsalok had a forbidden relationship. She also mentioned that much of her work on Dibrook was forbidden, especially her plan towards the Jedi.\nEventually, Tsalok came to Dibrook to interrogate the Jedi himself, while this occurred, a large army of refugees and a garrison of New Republic troops came to save the refugees taken to her labratory. Tsalok made it clear that she, the Yammosk and the Jedi Yuledan were too important to lose and so were evacuated. When Warmaster Tsavong Lah sent word, it became clear that one of Nagme's shapers was an informant for Lah.\nTsalok had Nagme send any shapers she didn't trust to battle with the warriors against the oncoming army. Nagme wished to take subjects for her experiments with her but instead had to contain them and poison them as they fled to Rychel where she would work under Tsalok's watch.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Shaper_caste",
  "/wiki/Nina_Galfridian",
  "/wiki/Master_Shaper",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Dibrook",
  "/wiki/Yuledan",
  "/wiki/Tsalok",
  "/wiki/New_Republic/Legends",
  "/wiki/Yammosk",
  "/wiki/Warmaster",
  "/wiki/Tsavong_Lah",
  "/wiki/Invasion:_Rescues_2",
  "/wiki/Invasion:_Rescues_3",
  "/wiki/Invasion:_Revelations_1",
  "/wiki/Invasion:_Revelations_5"
 ]
}