{
 "name": "Nagraoao",
 "display_name": "Nagraoao",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Nagraoao was a Wookiee spacer during the Galactic Civil War. He often worked with smuggler Roark Garnet.\nNagraoao was a male Wookiee spacer active during the Galactic Civil War. He occasionally worked with his friend, the Human Roark Garnet. During one mission, the pair crash-landed on the planet Tatooine, and Nagraoao was injured in the landing. The Wookiee was bleeding, and with no supplies—the rejuvenation tank and medical supplies had been destroyed in the crash—Garnet suggested using his blaster to cauterize the wound. Nagraoao complained about his plan.\nAt some point, Nagraoao accompanied Garnet on the flight in his freighter, the Dorion Discus, which he had recently repaired after being attacked by alien pyramidal starships days previously. The Dorion Discus encountered a meteor storm, and the freighter's fusion generators, which had not been properly repaired, gave out and the pair were lucky that the ship's magnetic bottle did not follow suit. Nagraoao employed his technical expertise in helping to repair the vessel; however, before they finished, more of the pyramidal ships arrived, causing a fluctuation in the Force.\nAt a later time, Nagraoao and the smuggler Hawk Carrow were incarcerated in the Spice Mines of Kessel by the Galactic Empire. Learning of his friends' plight, Roark Garnet flew the Dorion Discus to the Kessel system to rescue them. He was stopped by a Star Destroyer performing inspections, but the smuggler bribed the Navy officer to let him go.\nNagraoao was a faithful companion to Roark Garnet and was well trained in the maintenance and repairing of space transports. His name translated from Shyriiwook as \"heroic kin.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Roark_Garnet/Legends",
  "/wiki/Human/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Dorion_Discus",
  "/wiki/Alien/Legends",
  "/wiki/Unidentified_pyramidal_starship",
  "/wiki/Standard_day/Legends",
  "/wiki/Meteor",
  "/wiki/Fusion_generator/Legends",
  "/wiki/Magnetic_bottle",
  "/wiki/The_Force/Legends",
  "/wiki/Hawk_Carrow",
  "/wiki/Prison/Legends",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kessel_system/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Unidentified_Imperial_naval_officer",
  "/wiki/Transport/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game_(first_edition)",
  "/wiki/Galactic_Campaign_Guide"
 ]
}