{
 "name": "Nakaron",
 "display_name": "Nakaron",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dosha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Glorga the Hutt"
     ]
    }
   ]
  }
 ],
 "content": "Nakaron was a Trandoshan criminal who was wanted by the New Republic for assassination and murder of New Republic personnel, assault on New Republic personnel, theft of New Republic property, reckless endangerment, and manslaughter. The reward for his capture was 60,000 credits.\nNakaron was muscular and highly intelligent, but also extremely cruel and obdurate.\nNakaron was a mercenary and assassin like so many of his conspecifics. However, his success made him so self-assured that he started disregarding the class system that had been the cornerstone of Trandoshan society for thousands of years. He was eventually expelled from his home city of Forak, and subsequently banned from entering many other cities on Dosha, causing him to virtually be exiled from the planet.\nEventually, Nakaron was hired by Glorga the Hutt. He found out that one of Glorga's lieutenants, Lanish Ran, was in reality a Rebel agent, and decided to wait for the right moment to expose him. Ran, however, knew that Nakaron had found out. Nakaron knew that Ran had been planted as an agent, but he thought he was an Imperial agent, because he had previously seen Ran while he was posing as an Imperial officer in Forak, and did whatever he could to prove absolute fealty to the Hutt. This went on for a long time, even after the establishment of the New Republic.\nDuring the Second Hollastin Insurrection, when a band of smugglers assaulted Glorga's court, Nakaron thought his suspicions that Ran was an Imperial agent were confirmed. As the smugglers attacked, Nakaron took out two of them while Ran single-handedly took down the remaining eight. Nakaron was now convinced that Ran was an Imperial due to the formidable combat skills, which he believed were the result of Imperial military education. When Nakaron approach the Hutt with his theory a couple of weeks later, he was fired on the spot by the gangster who threatened to kill Nakaron should he ever show his face around again. Nakaron drew his blaster and killed the Hutt in response.\nSubsequently, he killed Ran in a blaster shootout that lasted 45 minutes, during which Nakaron managed to kill two dozen innocent passers-by. He was arrested within five minutes by another New Republic agent in the employ of Glorga—agent Thom Clessigan—who brought him aboard the Protector bound for a detention facility on Dles IV. Nakaron managed to hijack the Protector and kidnap agent Clessigan and the ship's crew.\nNakaron was considered ugly, even by fellow Trandoshans. He had a sickly greenish complexion due to exposure to the sandstorms of Varic. His skin appeared broken and unhealthy, because he had spent considerable time in the dry desert heat of Lorpfan. However, he was in great physical condition and incredibly strong and agile. He had almost no scars, unlike many of his species, with the exception of some mangled tissue caused by a landspeeder accident.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandosha/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Glorga",
  "/wiki/Hutt/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Mercenary/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/City/Legends",
  "/wiki/Forak",
  "/wiki/Planet/Legends",
  "/wiki/Lanish_Ran",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Time/Legends",
  "/wiki/Second_Hollastin_Insurrection",
  "/wiki/Smuggler/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Thom_Clessigan",
  "/wiki/Protector_(shuttle)",
  "/wiki/Prison/Legends",
  "/wiki/Dles_IV",
  "/wiki/Starship/Legends",
  "/wiki/Sandstorm/Legends",
  "/wiki/Varic",
  "/wiki/Desert/Legends",
  "/wiki/Lorpfan",
  "/wiki/Species/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_4"
 ]
}