{
 "name": "Nakano Lash",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Glee Anselm"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "Nakano Lash's 720 light freighter",
      "Ruusan system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nakano Lash's crew"
     ]
    }
   ]
  }
 ],
 "content": "Nakano Lash was a Nautolan female bounty hunter active during the time of the Galactic Empire. She operated out of a ship called the Starskimmer. She became the mentor of bounty hunter and former Imperial Beilert Valance after saving him from Imperial stormtroopers. Sometime after, Lash and a team of bounty hunters were hired by Khamus, heir to the Mourner's Wail Syndicate, for a mission on the planet Corellia.\nLash was unaware of the mission's true objective, which was for Khamus to kill his partner Krynthia, the daughter of the leader of the Unbroken Clan who had become pregnant with his daughter. Lash then killed Khamus, betraying the other hunters by killing their client. She went into hiding after the failed mission, but resurfaced years later, becoming a target of the bounty hunters she had betrayed.\nAs a child, Lash faced a difficult situation, but nobody came to her rescue. At some point, her parents died, and were commemorated with a grave on the planet Galmerah. Lash eventually became a bounty hunter, operating during the reign of the Galactic Empire. Sometime after 10 BBY, Lash was present at a cantina in Phelar Port on the planet Eriadu, alongside the twin bounty hunters T'ongor and T'onga and the black market tech dealer Jhorstek, who Lash had invited to the cantina for business. While the group conversed, a young thief was caught attempting to escape Imperial stormtroopers, and pleaded for help.\nWhile Lash felt sympathetic towards the boy's situation due to similar events in her own past, Jhorstek and the other hunters were hesitant to get involved. However, before Lash could intervene, the stormtroopers were attacked by the cyborg Beilert Valance, a former Imperial soldier who received severe injuries fighting for the Empire. While Valance managed to overpower the stormtroopers, he was met by a number of reinforcements, who shot him down. Against the will of her companions, Lash went to assist Valance, killing the remaining stormtroopers. Lash rescued the fallen Valance, and had Jhorstek fix his damaged cybernetics. Following the incident on Eriadu, Lash mentored Valance, who became a bounty hunter himself.\nSometime prior to 3 ABY, Nakano Lash was hired by Khamus, heir of the Mourner's Wail Syndicate, to attack a sanctuary of the Unbroken Clan in Coronet City on the planet Corellia. Lash assembled a team of bounty hunters, consisting of Valance, Bossk, Boba Fett, and T'ongor, entering the Unbroken Clan sanctuary accompanied by Khamus.\nAfter Bossk, Fett, and Valance dealt with the Unbroken Clan guards, Lash breached the door to the compound, allowing Khamus to eliminate his target, which was Khamus' partner Krynthia, the daughter of the leader of the Unbroken Clan who had become pregnant with his daughter. Lash watched in horror as Khamus stood over the fatally wounded Krynthia, stating that he could not allow his father to discover that he had a baby with someone with Unbroken Clan blood. Lash then shot Khamus, killing the only heir to the Mourner's Wail Syndicate.\nUpon Khamus's death T'ongor reported Lash's apparent betrayal to the other hunters. With their client deceased, the other hunters abandoned the mission. Lash convinced Tongor to help him save Krynthia, but while they retreated with her, T'ongor was killed. Weeks later, Krynthia died giving birth to her daughter Cadeliah, who Lash would take care of, intending to raise her and eventually use her rightful leadership over both clans to stop the feud between them. Lash would then disappear into hiding sometime afterward. T'ongor's sister T'onga attributed his death to Lash and swore revenge on the bounty hunter.\nSeveral years later, Lash supposedly resurfaced, having been sighted near the planet Kessel, and a large bounty was placed on her. Word of Lash's location spread throughout the galaxy, and a number of bounty hunters intended to hunt Lash down, including those involved in the mission on Corellia, who sought Lash out of revenge. According to spies of the Mourner's Wail Syndicate, Lash used a transmitter to contact the Unbroken Clan following her reappearance. Information given to Bossk by the rogue archaeologist Doctor Chelli Aphra claimed that Lash had visited her parents' grave on Galmerah, which contained a hidden set of map coordinates.\nAs Lash attempted to evade capture, the bounty hunter Ooris Bynar located Lash and Cadeliah on Ruusan. Despite capturing Cadeliah and threatening Lash, he was eventually defeated and killed by Lash. Lash hid with Cadeliah in the wreckage left over from a battle during the Clone Wars, but was found by Valance and T'onga. Before T'onga could exact her revenge, Lash explained what had happened to her and the importance of Cadeliah, also convincing T'onga that she hadn't killed T'ongor but admitting that his death was on her hands. Right when T'onga let go of her desire for vengeance and wanted to return to her wife instead, she was shot and mortally wounded by Boba Fett. Valance fought Fett while Lash protected Cadeliah. Moments later, Vukorah's ship arrived, firing upon Lash's ship. Fett, seeing that Lash was doomed, escaped from Ruusan. Meanwhile, Lash was trapped inside her ship, and, seeing that she was no longer able to take care of Cadeliah, pleaded to Valance that he took care of the girl from then on. Although Valance said that he would not be able to protect her from the Unbroken Clan, Lash said she had never meet a better person than him who could do the task. Lash expressed her wish that she died knowing that Cadeliah, the only good she had ever raised, would be in good hands. After bequeathing her rifle to Valance, who escaped with Cadhelia, Lash died as her ship was obliterated by General Vukorah's ship.\nA Nautolan female, Lash had blue skin and black eyes, and had a tattoo on her left arm. When witnessing a young boy plead for help in escaping Imperial stormtroopers, Lash was sympathetic towards the thief, unlike her fellow bounty hunters, who did not want to become involved, not wishing to make trouble. Lash saw herself in the thief and his situation, and chose to rescue Beilert Valance when he attempted to defend the boy.\nDuring the mission on Corellia, Lash was unfazed by the complaints made by Khamus about her team, or his threats of punishment in the event of failure. Lash refused to let Khamus get away with killing his target in the Unbroken Clan sanctuary, and jeopardized their mission, and the lives of the other hunters, to kill him.\nAfter the failed job on Corellia, Lash took it upon herself to protect Cadeliah, hoping that she could end the war between the Mourner's Wail Syndicate and the Unbroken Clan, also citing her desire to finally do something good in her life as motivation.\nLash wore a partial mask on the upper half of her face, covering her left eye. She carried a large blaster rifle equipped with a scope and a bayonet. She wore tan-colored clothing underneath white armor, over which she wore a red cape.\nNakano Lash first appeared in Bounty Hunters 1, a comic written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on March 11, 2020.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bounty_Hunters_3",
  "/wiki/Bounty_Hunters_4",
  "/wiki/Bounty_Hunters_5",
  "/wiki/Bounty_Hunters_8",
  "/wiki/Crimson_Reign_2",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Glee_Anselm",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Nakano_Lash%27s_720_light_freighter",
  "/wiki/Ruusan_system",
  "/wiki/Nautolan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nakano_Lash%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Starskimmer",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Beilert_Valance",
  "/wiki/Stormtrooper",
  "/wiki/Khamus",
  "/wiki/Mourner%27s_Wail_Syndicate",
  "/wiki/Skirmish_on_Corellia",
  "/wiki/Planet",
  "/wiki/Corellia",
  "/wiki/Krynthia",
  "/wiki/Unbroken_Clan",
  "/wiki/Death",
  "/wiki/Standard_year",
  "/wiki/Parent",
  "/wiki/Burial",
  "/wiki/Galmerah",
  "/wiki/10_BBY",
  "/wiki/Cantina",
  "/wiki/Phelar_Port",
  "/wiki/Eriadu",
  "/wiki/Twin",
  "/wiki/T%27ongor",
  "/wiki/T%27onga",
  "/wiki/Black_market",
  "/wiki/Jhorstek",
  "/wiki/Unidentified_thief_(Phelar_Port)",
  "/wiki/Cyborg",
  "/wiki/Soldier",
  "/wiki/Cybernetics",
  "/wiki/Unbroken_Clan_sanctuary",
  "/wiki/Coronet_City",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Boba_Fett",
  "/wiki/Cadeliah",
  "/wiki/Mourner%27s_Wail_Syndicate-Unbroken_Clan_war",
  "/wiki/Kessel",
  "/wiki/The_galaxy",
  "/wiki/Spy",
  "/wiki/Transmitter",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Map",
  "/wiki/Ooris_Bynar",
  "/wiki/Ruusan",
  "/wiki/Clone_Wars",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Limb",
  "/wiki/Thief",
  "/wiki/Blaster_rifle",
  "/wiki/Scope",
  "/wiki/Bayonet",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Cape",
  "/wiki/Bounty_Hunters_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Paolo_Villanelli",
  "/wiki/Marvel_Comics",
  "/wiki/March_11",
  "/wiki/2020",
  "/wiki/Category:Images_of_Nakano_Lash",
  "/wiki/Bounty_Hunters_2",
  "/wiki/Bounty_Hunters_6",
  "/wiki/Bounty_Hunters_9",
  "/wiki/Bounty_Hunters_10",
  "/wiki/Bounty_Hunters_12",
  "/wiki/Bounty_Hunters_14",
  "/wiki/Bounty_Hunters_16",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/Bounty_Hunters_17",
  "/wiki/Bounty_Hunters_18",
  "/wiki/Bounty_Hunters_20",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Bounty_Hunters_22",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Nakano_Lash",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Bounty_Hunters",
  "/wiki/720_light_freighter",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Target_Vader_5",
  "/wiki/Mimban_Campaign",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Mimban",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back"
 ]
}