{
 "name": "Nakirre",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Around 18 BBY",
      "Whetstone",
      "Sunrise system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kilji"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kilji Illumine",
      "Illumine Kilhorde",
      "Illumine Kilhorde"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Several beings",
      "Vassal One",
      "Vassal Two",
      "Vassal Four",
      "A Kilji",
      "A Kilji pilot",
      "A Kilji weapons operator",
      "Vassal One",
      "Vassal Two",
      "Vassal Four",
      "A Kilji",
      "A Kilji pilot",
      "A Kilji weapons operator"
     ]
    }
   ]
  }
 ],
 "content": "Nakirre was an enlightened male Kilji Generalirius who was the leader of the Kilji species' theocracy of the Kilji Illumine and the government's battle fleet, the Illumine Kilhorde. As a follower of the Kilji religious beliefs and his status of enlightened—which was achieved after becoming a follower of the Kilji philosophy—Nakirre was in charge of the Illumine, and the enlightenment of others, such as the individuals who became his vassals: Vassal One, Vassal Two, Vassal Four, and three other beings. To spread enlightenment across the galaxy, and wishing the enlightenment of the entire universe, Nakirre allied himself with the Grysk coordinator Jixtus, who with permission of the Kilji Overlords traveled aboard the generalirius's Kilji war cruiser Whetstone, guiding the Kilji conquests of enlightenment across the Unknown Regions.\nAround 18 BBY, the pair undertook a series of meetings with nations and peoples of the Unknown Regions, such as the Chiss and their Chiss Ascendancy, at planets including Zyzek, Rhigar, Avidich, and four other Chiss worlds. As Nakirre ad Jixtus erupted chaos across the Ascendancy by rising tensions between the Clarr and Dasklo families, the generalirius realized he was a mere tool of the Grysks, and was humiliated by Jixtus throughout their travels. Meanwhile, the Kilhorde was destroyed by the Paataatus species with Chiss Senior Captain Thrawn's assistance. The battle fleet's destruction led to Nakirre's death aboard the Whetstone at the hands of Jixtus, who viewed the Kilji as useless without the Kilji battle fleet. Although Nakirre thought not, the unenlightened being was able to change the enlightened's fate.\nGeneralirius Nakirre, a male Kilji, leader of the government of his species, the Kilji Illumine, and its battle fleet, the Illumine Kilhorde, was at some point in his life enlightened to the Kilji way of order and enlightenment, his species' religious beliefs. He also enlightened other beings to the Kilji beliefs, turning them—Vassal One, Vassal Two, Vassal Four and other vassals—to Kilji vassals, followers of the Kilji way and crew of Nakirre's own Kilji war cruiser, the Whetstone.\nAt some point following the Nikardun sentient species' conquests, Nakirre decided to travel with Jixtus, a Grysk operative of the warlike Grysk species, who guided the Kilji in his nation's conquests of enlightenment. The Kilji Overlords—which approved the Generalirius' decisions—approved Nakirre's decision to travel with the Grysk, allowing the Grysk to travel aboard the Whetstone. Around 18 BBY, following an incident at the Unknown Regions planet of Hoxim, the Whetstone, commanded by Nakirre and Jixtus, orbited the planet Zyzek, a trade hub for several nations. During their visit, Jixtus gave a speech on the benefits the Grysks would provide the Kiljis, but was interrupted by Vassal Two, who alerted Nakirre of a unknown warship's presence above Zyzek.\nThe warship, whose commander—Senior Captain Mitth'raw'nuruodo core name \"Thrawn\"—revealed to be the Chiss heavy cruiser Springhawk broadcast a message asking for members of the Watith species to receive some prisoners Thrawn had supposedly captured. Nakirre stood forth, although he did not know about the Watith, and presented the Illumine and his beliefs to Thrawn, who rejected them, which led to a short confrontation shut down by Zyzek System Defense, the organization who protected the Zyzek system. Before leaving, the generalirius promised to change the ancient Chiss paths to the enlightenment of the Kiljis.\nShortly after, the Kilji and the Grysk met Patriel Thistrian of the Chiss Mitth family on the planet Avidich, who ordered them away. Nakirre was frustrated by this, and argued with Jixtus, believing himself superior. Jixtus ordered Nakirre and his vassals to travel to a star system, which unbeknownst to the Illumine temporarily housed his flagship, the Grysk Shatter-class WarMaster FateSpinner. While the massive warship pointed directly at Nakirre's ship, Jixtus revealed that the Kiljis were tools of Jixtus, who would die if he deemed it pleasant. However, he confirmed that their agreement to bring enlightenment to the peoples of the region still stood.\nWith their agreement to enlighten the Chiss and other nations still standing, the pair traveled to the Chiss planet of Rhigar, where Clarr'os'culry \"Roscu\" boarded the Whetstone, wishing to study Nakirre's war cruiser and meet Jixtus. Aboard the Whetstone, the operative presented a recording of the Chiss Xodlak family and Dasklo families practicing an attack on a warship. Before Roscu's departure, Nakirre informed her that the Kilji Illumine could provide the Clarr with warships to \"protect their worlds,\" which the Chiss rejected.\nAfter Illumine General Crofyp's task force's flagship, Crofyp's Kilji war cruiser Anvil, was destroyed by Thrawn's Springhawk and the Paccosh–commandeered Nikardun blockade frigate in the Unknown Regions Rapacc system, the Anvil's Pathfinder navigator, Qilori, the Anvil's navigator, was saved by Thrawn. The pathfinder stated that Jixtus commanded the Kiljis, but also accepted others' directives, which the senior captain believed to be Nakirre's.\nShortly afterward, Thrawn and Qilori captured the Kilji picket cruiser Hammer in the Unknown Regions Sunrise system, obtaining a Kilji data rectangle with the Kilhorde's battle data. The senior captain shared those files with the Paataatus Hiveborn, whose territory was near the battle fleet's conquests, which the Paataatus people deemed unacceptable, sending an attack fleet to engage the Illumine Kilhorde, eventually destroying it. Until at least one day before the fleet's destruction, Nakirre had received reports of victories on the Kilji conquests from several Kilji field commanders.\nWhen they stopped, the generalirius feared that his generals had foolishly extended their campaigns to the Chiss planet of Colonial Station Chaf, which would have disrupted the long-range triad transmitter found there's operation, preventing the Kilhorde and its generalirius to communicate. By that time, Nakirre and his ally had visited six planets and four senior officials of the Chiss Nine Ruling Families.\nThe Kilji generalirius inquired his ally if they were still traveling to the astronomical object Sharb, and Jixtus told Nakirre that they were traveling to the Chiss world of Ornfra, where they would witness Roscu's death at the hands of a Grysk asteroid missile platform, provoking a civil war between the Clarr and their allies and the Dasklo and its allies, and after, the destruction of the Ascendancy. The generalirius disliked adjusting their schedule to the Clarr captain, and Jixtus promised him that her life would end soon, and with it, the Ascendancy. The Grysk ordered Vassal One to execute the course to the Chiss world, but there was no response. Nakirre informed his Grysk companion that his vassals only took orders from him, and Jixtus said that he enjoyed being the master of his servants and ship.\nThe generalirius then attempted to mock his companion, in turn, Jixtus threatened the enlightened with the Illumine's destruction, the Kiljis' everything—culture, souls, lives—twist to servitude of the Grysks. Nakirre was completely calm, an ability of the enlightened, and answered with a simple no, remarking that the unenlightened falsehood's could not change the enlightened.\nAfter the short confrontation, Nakirre expressed his desire to put the Chiss alongside the Kiljis and Grysks as allies, saying that the Kilji enlightenment would allow that. However, his Grysk companion denied that, and Nakirre thought about the future: a future with no Ascendancy, where the Kiljis and the Grysk would conquer the entirety of Lesser Space—the region beyond the Unknown Regions—and Nakirre himself would enlighten the shadowy Grysk leadership. The generalirius also imagined boulders being crushed to fine sand, which Jixtus had mentioned in his threat, which prompted his ally to sooth him, informing him that their call to the Chiss warship Orisson would be one the generalirius could listen. After the call, the Orisson traveled to Ornfra, where it destroyed a Grysk asteroid missile platform planted by Jixtus to destroy the Chiss and provoke a civil war, as the Clarr would believe the Mitth family on Ornfra had destroyed the Orisson.\nAfter Roscu had survived the Grysks' secret platform's attack Jixtus had prepared, Nakirre and the Grysk were once again waiting. Vassal Four opened a transmission with Clarr family Patriarch Clarr'ivl'exow \"Rivlex,\" who informed Jixtus of his travel to the Chiss capital of Csilla with all other leaders. The transmission was cut, and Generalirius Nakirre expressed his desire to enlighten them all there, which prompted Jixtus to denigrate the Kilji enlightenment, as well as to confess that Nakirre and his people meant nothing to him.\nFeeling humiliation and what he deemed powerless anger, Nakirre thought about killing Jixtus, wrapping his hands around the Grysk's neck and listening to his gasps and whimpers, however, the Kilji thought what that would provoke: the nearby Grysk fleet would learn of Jixtus' death, and would destroy the Kilhorde—as Jixtus' fleet knew of its location—and more critically, in Nakirre's opinion, would siege the Kilji homeland, the Kiljis' home. Deciding against the Grysk's assassination, Nakirre continued to act as an agent of Jixtus.\nLater, the generalirius, his ally, and Qilori—who piloted the Whetstone—traveled to the Sunrise system, where they observed a deactivated Chiss fleet. The Sprignhawk, one of the destroyed warships, opened comm with the Whetstone, and Jixtus and Thrawn engaged in a conversation regarding the latter's defeat and the \"destruction\" of Thrawn's fleet at the system. The pair argued, which resulted in Nakirre being informed of his Kilhorde's destruction by the Paataatus. Jixtus, who viewed the generalirius as useless without the Kilhorde, killed the Kilji after he had expressed his hatred for the Grysk. Following Nakire's death, all the vassals aboard the Whetstone stopped their duties, as their master had been lost and the Kilji path prevented them from doing anything without him, wrapping their arms around their heads. Following Nakirre's death, the Chiss fleet was reactivated and sieged Jixtus's fleet, including the FateSpinner.\nDuring the battle, Qilori, who was aboard the Whetstone, feared that Jixtus—who had now fled to the FateSpinner—would move on from the battle against the reactivated Chiss vessels and destroy the Whetstone. The navigator was able to rise as the Kiljis' new master, being able to convince them to disintegrate the FateSpinner's entire starboard aft flank with the Whetstone's weapons. This, and the fear of defeat, prompted Jixtus to use a self-destruct mechanism implanted in all his fleet, to kill himself. After the death of Jixtus, Qilori reported Generalirius Nakirre's death to Thrawn. Although Nakirre was absolutely sure that the unenlightened could not change the enlightened's fate, the Kilhorde's, his vassals', and his own fate were changed by Jixtus of the unenlightened Grysks.\nGeneralirius Nakirre was an ambitious tall member of the Kilji species with soft dark orange skin and soft dark brown hair, he possessed two legs, and his skin formed patterns conveying his emotions. The Kilji was overconfident in his capabilities as a military commander and in the Kilji Illumine's might, as he called it. His overconfidence in his people and himself led to several humiliations, which eventually led to the destruction of the Kilhorde, and it also led to significant arrogance and defiance, which were prohibited by the Kilji path. Nakirre, in his dream for a world in peace and order, united by the Kilji beliefs, allied himself with the Grysks, and was defiant against them, recalling the enlightenmet in an attempt to persuade them to do what he wished, to enlighten the Chiss. Although he showed defiance to the Grysks, he also feared them, and wondered why they had allied themselves with the Illumine when they had powerful starships such as the FateSpinner, comforting himself by thinking that they feared the Kiljis would stop their conquests. His comfort led him to think that he could enlighten the Grysks' leadership himself.\nDeeply religious, Nakirre viewed himself as a superior being over all others hat did not follow the Kilji way, including Jixtus, who in fact controlled the generalirius. Wishing to kill the opressor of the Illumine, Jixtus, Nakirre sought to kill him on various occasions, but decided against it as the Kilji Overlords had accepted his decision to travel with the Grysk, and if the Grysk fleet learnt of Jixtus' death, Nakirre feared they would siege the Kilji homeland. As Jixtus and Thrawn mocked the Kilji and his enlightenment, Nakirre added them to his list of beings that he wished to personally enlighten—or kill. Although being generalirius prevented him from fearing anyone, or showing anything other than calmness and superiority, Nakirre feared Jixtus and his people, who could easily destroy the Kilhorde and the Kiljis.\nNakirre was able to lead a government and a battle fleet at the same time. He was also able to command a cruiser and form alliances with other governments. He was the master of all Kilji vassals, and therefore able to bring weak-minded individuals to the Kilji path. Nakirre spoke the Minnisiat trade language which he could understand with Thrawn and Jixtus and spoke Taarja, another trade language, with Captain Roscu.\nNakirre wore a light blue outfit. He also owned and commanded a Kilji war cruiser, the Whetstone.\nNakirre appeared in the 2021 novel Thrawn Ascendancy: Lesser Evil, the final volume in Timothy Zahn's Ascendancy Trilogy. An excerpt of the novel published on the website Gizmodo on November 3 of that year included the appearance of Nakirre.Before Lesser Evil's release on November 16, 2021, Zahn was interviewed by Hoeler—who considered Generalirius Nakirre's name delightful—and he stated that he introduced Nakirre as a dynamic of Jixtus, who did not realize that he was a tool of the Grysk, and thought that he was more important than the operative. Hoeler also established in the interview that Nakirre represented a \"very interesting perspective\" in the novel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/18_BBY",
  "/wiki/Whetstone",
  "/wiki/Sunrise_system",
  "/wiki/Kilji",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kilji_Illumine",
  "/wiki/Illumine_Kilhorde",
  "/wiki/Alien",
  "/wiki/Vassal_One_(Whetstone)",
  "/wiki/Vassal_Two_(Whetstone)",
  "/wiki/Vassal_Four_(Whetstone)",
  "/wiki/Unidentified_Kilji_vassal_(Helm)",
  "/wiki/Unidentified_Kilji_vassal_(pilot)",
  "/wiki/Unidentified_Kilji_vassal_(weapons)",
  "/wiki/File:Nakirreintroduction.ogg",
  "/wiki/Kilji_way_of_order_and_enlightenment",
  "/wiki/Generalirius",
  "/wiki/Species",
  "/wiki/Fleet",
  "/wiki/Religion",
  "/wiki/Kilji_vassal",
  "/wiki/Unidentified_Kilji_vassal",
  "/wiki/The_galaxy",
  "/wiki/Universe",
  "/wiki/Grysk",
  "/wiki/Jixtus",
  "/wiki/Kilji_Overlords",
  "/wiki/Kilji_war_cruiser",
  "/wiki/Kilji_conquests_of_enlightenment",
  "/wiki/Unknown_Regions",
  "/wiki/Chiss",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Planet",
  "/wiki/Zyzek",
  "/wiki/Rhigar",
  "/wiki/Avidich",
  "/wiki/Chiss_Ascendancy_crisis",
  "/wiki/Clarr_family",
  "/wiki/Dasklo_family",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Paataatus%E2%80%93Kilji_conflict",
  "/wiki/Paataatus",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Death",
  "/wiki/File:Nakirrezyzek.ogg",
  "/wiki/Nikardun",
  "/wiki/Sentience",
  "/wiki/Nikardun_conquests",
  "/wiki/Jixtus%27s_plan",
  "/wiki/Hoxim_incident",
  "/wiki/Hoxim",
  "/wiki/Commanding_officer",
  "/wiki/Orbit",
  "/wiki/Springhawk",
  "/wiki/Zyzek_system",
  "/wiki/Core_name",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Watith",
  "/wiki/Prisoner",
  "/wiki/Confrontation_at_Zyzek",
  "/wiki/Zyzek_System_Defense",
  "/wiki/Chiss_path",
  "/wiki/File:Jixtusschedule.ogg",
  "/wiki/Patriel",
  "/wiki/Thistrian",
  "/wiki/Mitth_family",
  "/wiki/Unidentified_star_system_(FateSpinner)",
  "/wiki/Flagship",
  "/wiki/Shatter-class_WarMaster",
  "/wiki/FateSpinner",
  "/wiki/Clarr%27os%27culry",
  "/wiki/Cruiser",
  "/wiki/Xodlak_family",
  "/wiki/File:Mightyillumine.ogg",
  "/wiki/General",
  "/wiki/Crofyp",
  "/wiki/Crofyp%27s_task_force",
  "/wiki/Anvil",
  "/wiki/Attack_on_Rapacc",
  "/wiki/Paccosh",
  "/wiki/Thief",
  "/wiki/Nikardun_blockade_frigate",
  "/wiki/Rapacc_system",
  "/wiki/Pathfinders_(Navigators%27_Guild)",
  "/wiki/Navigator",
  "/wiki/Qilori",
  "/wiki/Sunrise_incident",
  "/wiki/Kilji_picket_cruiser",
  "/wiki/Hammer_(Kilji_picket_cruiser)",
  "/wiki/Kilji_data_rectangle",
  "/wiki/Paataatus_Hiveborn",
  "/wiki/Paataatus_attack_fleet",
  "/wiki/Standard_day",
  "/wiki/Field_Commander",
  "/wiki/Colonial_Station_Chaf",
  "/wiki/Long-range_triad_transmitter",
  "/wiki/File:Bouldersandkiljis.ogg",
  "/wiki/Sharb",
  "/wiki/Ornfra",
  "/wiki/Lesser_Space",
  "/wiki/Grysk_leadership",
  "/wiki/Desert",
  "/wiki/Orisson",
  "/wiki/Asteroid_missile_platform",
  "/wiki/File:Simplistickilji.ogg",
  "/wiki/Skirmish_between_the_Grayshrike_and_the_Orisson",
  "/wiki/Patriarch",
  "/wiki/Clarr%27ivl%27exow",
  "/wiki/Capital",
  "/wiki/Csilla",
  "/wiki/Hand",
  "/wiki/Jixtus%27s_fleet",
  "/wiki/Kilji_homeland",
  "/wiki/File:Nakirredeath.ogg",
  "/wiki/Thrawn%27s_fleet",
  "/wiki/Self-destruct_mechanism",
  "/wiki/File:Nakirrekillingchiss.ogg",
  "/wiki/Hair",
  "/wiki/Limb",
  "/wiki/Grysk_conquests",
  "/wiki/File:Nakirreseffort.ogg",
  "/wiki/Minnisiat",
  "/wiki/Taarja",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/November_3",
  "/wiki/November_16",
  "/wiki/Category:Audio_files_of_Nakirre",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Template:LesserEvilDate",
  "/wiki/2022",
  "/wiki/November_27"
 ]
}