{
 "name": "Nal_Kenuun",
 "display_name": "Nal Kenuun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Muunilinst"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Muun"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Nal Kenuun was a Muun male who resided in the city of Pilaan on the planet Muunilinst. He was a wealthy and powerful gambler who held high-stakes games and participated in illegal Podracing by sponsoring his own Podracer pilot, Grunta.\nIn 0 ABY, Kenuun captured the Rebels Luke Skywalker, Leia Organa, Han Solo, Chewbacca, and Tobin Elad after they killed Grunta. With an upcoming race looming, Kenuun offered to give the Rebels a datacard he had taken from Mak Luunim, a Rebel contact whom he had killed due to an unpaid debt, in exchange for one of the Rebels taking Grunta's spot in the competition. Skywalker accepted the arrangement and eventually won the race. However, after the Rebels received the datacard from Kenuun, the Muun tried to collect the Imperial bounties on Solo and Elad. When Organa threatened to harm Urgiluu, Kenuun's pet krayt dragon, Kenuun consented to let the Rebels escape without further incident.\nNal Kenuun was a Muun male who resided in the city of Pilaan on the planet Muunilinst. Rich and powerful, Kenuun had many individuals in debt to him, including several Imperial stormtroopers stationed on the planet, whom he used as his own private guard. Other Muuns were wary of earning his ire, as Kenuun was generally known to have people who offended him killed. When fellow Muun Mak Luunim was unable to pay back his debt to Kenuun, Kenuun arranged his death—Luunim was killed when his airspeeder's central turbine failed in midair, an action carried out by Kenuun's stormtroopers.\nIn 0 ABY, the Rebel pilot Luke Skywalker, accompanied by fellow Rebels Leia Organa, Han Solo, Chewbacca, and Tobin Elad—who was secretly the Imperial assassin X-7 tasked to kill Skywalker—went to Muunilinst in search of Luunim, who had been a Rebel contact managing part of their funds. Luunim, however, was already dead by the time that Skywalker and the others arrived.\nHaving learned that Kenuun had raided Luunim's apartment, taking everything of value, the Rebels concluded that Kenuun was in possession of a datacard that they had sought to retrieve from Luunim. The datacard contained access codes to secret financial accounts that the Rebellion badly needed to replace its lost funds after the planet Alderaan's destruction.\nWhile looking for information on how to contact Kenuun, the Rebels were approached by Grunta, a Dug Podracer pilot under the employ of Kenuun. Grunta offered to lead the Rebels to a high-stakes gambling game that Kenuun was holding in exchange for a hundred-credit fee. However, Grunta turned on the Rebels when he led them into an ambush by four of his fellow Dugs flying swoops and armed with blasters who tried to rob them. After a short fight, the Rebels were able to drive the robbers away, killing Grunta in the process, but were ambushed again by Kenuun's stormtroopers.\nOwing to Grunta's penchant for trouble, Kenuun had a homing droid shadowing him as a precaution, which enabled Kenuun's stormtroopers to find and capture the Rebels. They were taken to Kenuun's home, where, after being restrained by stun cuffs in a makeshift prison for a certain length of time, they were finally able to meet Kenuun.\nTheir captor inquired why they were keen to meet him, and, after learning their reasons, Kenuun admitted that he did have Luunim's datacard. In exchange for it, however, the Muun demanded that one of them take Grunta's place and race for Kenuun in an upcoming Podrace event. When the Rebels pointed out that Podracing was not suited for a Human, Kenuun warned them of the fate of individuals who chose not to repay their debts to him, subtly reminding them of Luunim's death. Eventually, Skywalker agreed to the proposition and volunteered himself.\nKenuun lent Skywalker Grunta's Podracer, a Collor Pondrat Plug-2 Behemoth. While Skywalker was testing the Podracer, one of its engines caught fire due to a defective current filter, and Skywalker lost control of the craft, which crashed into the ground and subsequently exploded. Unhurt and determined to win the competition, Skywalker convinced Kenuun to lend him another one. Similarly bent on winning, Kenuun allowed Skywalker to choose another Podracer—a Keizar-Volvec KV9T9-B Wasp—from his vast collection. After a close race, Skywalker emerged as the winner, beating the other Podracer pilots sponsored by Kenuun's Muun rivals.\nWhen Skywalker, Solo, and Elad went back to Kenuun's apartment to collect their end of the deal, Kenuun proved true to his word and handed the datacard over to the Rebels. As they tried to leave, however, Kenuun summoned his stormtroopers and then tried to collect the Imperial bounties on Solo and Elad as payment for the first Podracer that Skywalker crashed. The ensuing fight ended in a standoff, in which one of the stormtroopers leveled a blaster rifle on Solo, while Elad raised one on Kenuun.\nTo break the stalemate, Elad offered himself to Kenuun in exchange for Solo's and Skywalker's safety. Kenuun agreed to the proposition when Organa suddenly appeared and declared a new agreement by threatening to harm Kenuun's pet krayt dragon, Urgiluu. Fearing that the krayt dragon pearl inside Urgiluu's stomach might be damaged and lessen its value, Kenuun allowed the Rebels to leave Muunilinst safely.\nA typical Muun, though considerably taller and slimmer compared to others of his kind, Nal Kenuun was very particular when it came to monetary matters, deeming it dishonorable to renege or go back on one's word concerning financial dealings. True to his Muun heritage, Kenuun never let opportunities for certain financial gain pass him by\nKenuun was fastidious regarding his possessions, never failing to demand a replacement or suitable payment in the instances in which his properties were destroyed. When his Podracer pilot, Grunta, was killed by Han Solo and his fellow Rebels, Kenuun threatened to murder them unless someone took Grunta's place in the race, as Kenuun claimed Grunta to be his property. After Luke Skywalker won the Podracing event, the Muun remained true to his word and handed over the datacard that he had promised to the Rebels. It was only after the exchange was made that he tried to collect the Imperial bounty on Solo and Tobin Elad.\nKenuun had a reputation for being cold-hearted and cruel, which made his attachment to his pet krayt dragon all the more humorous to his Muun rivals, who mocked Kenuun behind his back. However, what his rivals did not know was that Kenuun held no affection for the creature but was more interested in harvesting the valuable pearl that the dragon had in its stomach.\nInspiring fear in everyone who knew him, Kenuun arranged the deaths of beings for reasons varying from not paying their debts to him to the simplest matter of angering him. According to Haari Ikreme Beeerd, a Podracing crewman whom Solo befriended prior to the race, an individual once laughed in front of Kenuun upon learning the Muun's devotion to his pet. As reprisal, the individual was killed along with his entire family. However, being smart and calculating, Kenuun ensured that no proof was ever found tying himself to the murders.\nNal Kenuun was extremely analytical and tended to view all possible outcomes of a situation in order to boost his own advancement and interests. Being the most feared individual on the planet, Kenuun was efficient in handling all of his organization's affairs, whether it be employing stormtroopers to eliminate a rival, or choosing the best pilots to race for him.\nNal Kenuun was created by author Alex Wheeler for the 2008 novel Rebel Force: Target, the first entry in the Star Wars: Rebel Force series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Nal",
  "/wiki/Muunilinst/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Gender/Legends",
  "/wiki/City/Legends",
  "/wiki/Pilaan",
  "/wiki/Planet/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Grunta",
  "/wiki/0_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/X-7",
  "/wiki/Death/Legends",
  "/wiki/Muunilinst_Podrace",
  "/wiki/Datacard/Legends",
  "/wiki/Mak_Luunim",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Urgiluu",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Time/Legends",
  "/wiki/Mak_Luunim%27s_apartment",
  "/wiki/Mak_Luunim%27s_datacard",
  "/wiki/Alderaan/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Dug/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Swoop/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Lightfight",
  "/wiki/Homing_droid",
  "/wiki/Nal_Kenuun%27s_apartment",
  "/wiki/Stun_cuffs",
  "/wiki/Prison/Legends",
  "/wiki/Human/Legends",
  "/wiki/Grunta%27s_Podracer",
  "/wiki/Collor_Pondrat/Legends",
  "/wiki/Plug-2_Behemoth",
  "/wiki/Fire/Legends",
  "/wiki/Current_filter",
  "/wiki/Nal_Kenuun%27s_Podracer",
  "/wiki/Keizar-Volvec",
  "/wiki/KV9T9-B_Wasp",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Krayt_dragon_pearl/Legends",
  "/wiki/Stomach/Legends",
  "/wiki/Heart/Legends",
  "/wiki/Haari_Ikreme_Beeerd",
  "/wiki/Alex_Wheeler",
  "/wiki/2008",
  "/wiki/Rebel_Force:_Target",
  "/wiki/Star_Wars:_Rebel_Force",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/0_ABY"
 ]
}