{
 "name": "Nala Noos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darkside"
     ]
    }
   ]
  }
 ],
 "content": "Nala Noos was a female Trandoshan resident of the Cularin system asteroid belt.\nAs of 32 BBY, Nala Noos was one of Vin Tal'benes's employees in the asteroid repair station Darkside. Because of the sudden absence of the security chief of Darkside, Tal'benes promoted Noos to \"acting\" security chief. Noos was unhappy with her job and wanted to be assigned to any other post, preferably outside Darkside.\nShe did not take her job seriously, and mostly rested in her official chair while assigning newcomers to patrol the corridors. Noos had heard about the shadow lurkers, strange creatures in the corridors, but tried to gave them little thought.\nNoos had hear vague rumors of The Cell, a criminal faction opposing to Darkside owner Nirama, but she had really not seen them. As a security chief, however, she was familiar with the damage they had caused, and disliked them.\nNala Noos talked with some undercover agents sent by Nirama to root out The Cell. Although most people could not relate the agents' short-term presence in Darkside with the sudden capture of the local Cell leaders, Noos, using her security chief background, reached the correct conclusion; however, as she was loyal to Nirama, she decided to keep it as a secret.\nNoos was then transferred to Rothe Gate, the Organization's main weapon storage asteroid, but she was restricted to paperwork duty as the manager of the Office of Personnel for Rothe Gate. She regretted this new post. As Trandoshans in Rothe Gate were commonly underachievers led to Noos not fraternizing much. Besides, Noos was a fierce supporter of Nirama, and she suspected that fellow Trandoshan Gorssk could be loyal to The Cell.\nA team of agents of The Cell who believed to be working for Nirama entered in the Office of Personnel and slipped past Noos to obtain what they believed to be key information on treacherous elements of the Organization. If Noos was to see the results, she would have believed it to be insufficient to convict anyone.\nNala Noos had pale yellow skin and looked to be always exhausted. Like many people in Darkside, Noos was grumpy and gloomy, but she was seen smiling during paydays, specially when Nirama send additional supplies and a band.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Darkside_(space_station)",
  "/wiki/Cularin_system_asteroid_belt",
  "/wiki/32_BBY/Legends",
  "/wiki/Vin_Tal%27benes",
  "/wiki/Asteroid/Legends",
  "/wiki/Shadow_lurker",
  "/wiki/The_Cell",
  "/wiki/Nirama",
  "/wiki/Rothe_Gate",
  "/wiki/The_Office_of_Personnel_for_Rothe_Gate",
  "/wiki/Gorssk",
  "/wiki/MidWorld",
  "/wiki/UnderWorld"
 ]
}