{
 "name": "Nala_Se",
 "display_name": "Nala Se",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaminoan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.13 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black with white irises"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kaminoan government",
      "Galactic Republic",
      "Sith Order",
      "Galactic Empire",
      "Imperial cloning program",
      "Imperial cloning program"
     ]
    }
   ]
  }
 ],
 "content": "Nala Se was a Kaminoan female doctor and scientist who served the Galactic Republic throughout the Clone Wars. As the Chief Medical Scientist on her homeworld of Kamino, she played a key role in engineering the Grand Army of the Republic and, during the galactic conflict, assisted in the rehabilitation of battle-wounded clone troopers. Although she cared for injured clones even when Separatist forces threatened her life as well as her soldiers, Nala Se had a ruthless side to her, insisting to Jedi General Shaak Ti that clone troopers were Kaminoan property, and therefore, disposable assets.\nShe was also one of the few individuals that knew about Clone Protocol 66, a secret directive encoded into the behavioral modification biochip of every clone in the Republic Military. Believing the chips acted as a safeguard against renegade Jedi, Nala Se went to great lengths to preserve the secrecy of Protocol 66 during the galaxy-wide Clone Wars. Se was also in charge of Omega, a female unaltered clone assisting her with medical duties. When Omega attempted to escape with Clone Force 99, Nala Se assisted in their escape and sabotaged further attempts to capture the young clone in order to protect her. Se later witnessed the new Empire subjugate her home and bring down her people. Se herself, however, was spared from this fate as the Empire sought to use her exceptional talents with cloning science for their own purposes, transporting the Chief Scientist to a secret facility on the planet Weyland.\nPrior to the Clone Wars, Jedi Master Sifo-Dyas commissioned the Kaminoans to create a clone army for the Galactic Republic. As the Chief Medical Scientist of Kamino, Doctor Nala Se was one of the primary engineers of the clone troopers—genetically identical soldiers bred from a human template, the bounty hunter Jango Fett. Sifo-Dyas would die shortly after his army's inception, however, leaving Nala Se and her people with a new benefactor: Sith Lord Darth Tyranus. At Tyranus' behest, Nala Se oversaw the installation of an inhibitor chip in the brain of every clone trooper in development. She was told by Tyranus that the bio-chip and its directive, Clone Protocol 66, served as a safeguard against betrayal from renegade Jedi, although its true purpose was to fulfill the Sith's plot of exterminating the Jedi Order. As a contingency plan, Protocol 66 was classified information that Nala Se guarded in accordance with Tyranus' instructions. Shortly before the Clone Wars began on Geonosis in 22 BBY, Nala Se was supervising the secret implant of inhibitor chips into the clones' brains when Jedi Knight Obi-Wan Kenobi visited Tipoca City to find Fett.\nIn the aftermath of the First Battle of Geonosis, Nala Se became an asset to the newly-formed Grand Army of the Republic due to her close involvement in the creation of clone troopers. As a Doctor, she served on multiple Haven-class medical stations where her medical skills were put to use for the treatment of injured clones. In addition to her off-world duties, Nala Se supported the war effort as a scientist and doctor from the Tipoca City cloning facility on her homeworld.\nWhile serving as the Kaminoan chief of the Kaliida Shoals Medical Center, Nala Se learned that her facility had become a target for the Malevolence, a Separatist Subjugator-class heavy cruiser commanded by General Grievous. While coordinating the evacuation of the station's staff and patients, she was informed by Admiral Wullf Yularen that the Separatist attack was imminent—making it impossible to completely abandon the facility in time. However, the Kaliida Shoals station was saved through the actions of the Jedi General Anakin Skywalker and his apprentice, Jedi Commander Ahsoka Tano, before Grievous could destroy it. Following the Separatist withdrawal, Nala Se commended Skywalker for his service.\nAfter the near-destruction of the Kaliida Shoals facility, Nala Se was transferred to a new post at the Ord Cestus medical station, where she served for a time with Jedi General Kit Fisto. With Geonosis reconquered from the Separatists, the crew of the Pelta-class frigate TB-73 was assigned the errand of delivering medical supplies to the Ord Cestus station. However, the frigate became infested by numerous brain worms—parasitic lifeforms native to the Geonosian homeworld. The incident aboard the TB-73 almost resulted in the contamination of Nala Se's facility, but was ultimately prevented when Tano killed the worms.\nAt the height of the Clone Wars, Nala Se returned to her homeworld, where she worked alongside Jedi General Shaak Ti. After CT-5385 fatally shot the Jedi Tiplar during the Battle of Ringo Vinda, the defective clone was taken to Tipoca City in order to undergo an extensive evaluation. As the chief medical scientist on Kamino and one of the cloning program's founders, Nala Se was tasked with discovering the cause behind the clone's malfunction. She subjected the clone to a hyper test which caused her patient to undergo extreme convulsions. The test's data revealed no signs of infection, but Nala Se recognized the clone's actions and aggressive behavior as signs of a premature activation of Protocol 66. Alarmed by this discovery, she communicated her findings to the Kaminoan Prime Minister Lama Su and Darth Tyranus, leading the latter to insist that they terminate the clone in order to protect the secrecy of the inhibitor chip and its true nature. However, the ARC trooper CT-5555 conducted his own test on CT-5385 which, despite its fatal consequence, led to the discovery of the chip.\nThe ARC trooper's interference caused Tyranus to doubt the clone army's reliability in the event of an intentional activation of Protocol 66, although Nala Se assured him that the preemptive execution was an anomaly. As for the clones' growing sense of individuality, she believed that it was due to the Jedi's influence, yet remained confident that it would not interfere with the execution of the protocol. When CT-5555 discovered that every clone had a bio-chip in their brain, Nala Se claimed that it was a safeguard designed to suppress the more aggressive tendencies of the clones' template, Jango Fett.\nAgainst the protests of Nala Se, Shaak Ti decided to take CT-5555 to the Grand Republic Medical Facility on Coruscant along with his bio-chip and that of the late CT-5835, believing the clone should have an audience with Supreme Chancellor Sheev Palpatine. Fearing that the Jedi would discover the true programming in the bio-chips, Nala Se accompanied them to the Republic capital, where she secretly drugged the clone in order to make him appear unstable and his testimony unreliable. At the medical facility she asserted that the ARC trooper was dangerous without his control chip, and that the death of Tiplar was the result of a virus that infected CT-5835. Despite her efforts, the secrecy of Protocol 66 was ultimately saved when CT-5555 attempted to assassinate Palpatine after learning of the chancellor's involvement in the conspiracy. Palpatine entrusted the bio-chips to Nala Se for safekeeping, knowing that the Kaminoan scientist would send them to his Sith apprentice, Darth Tyranus.\nNala Se made a holographic recording of her report on the situation, in which she stated that, as confirmed by an independent investigation, CT-5555's inhibitor chip had malfunctioned. While both the Jedi Council and the Senate committee accepted the investigation's conclusions, CT-7567 had filed a grievance report on the matter. When Chancellor Palpatine activated Protocol 66 later that year, now-former Jedi Padawan Ahsoka Tano was targeted by CT-7567 and other troopers while traveling aboard a Republic attack cruiser. Before attacking her, CT-7567 managed to tell her to find \"Fives,\" CT-5555's nickname, prompting Tano to view Se's report as well as CT-7567's grievance report after she evaded the clones' initial attempt to eliminate her.\nAt some point, Nala Se began utilizing the services of Omega, an unaltered clone, in assistance to her own medical duties. When Clone Force 99, a squad of modified clones, returned to Kamino, they were greeted by Omega; Nala Se instructed Omega to remain with her. Nala Se later met with Admiral and Governor Wilhuff Tarkin, who had arrived at the facility to assess the viability of using clones in the newly formed Galactic Empire. Nala Se, alongside Lama Su, spoke favorably of the clones. They also informed Tarkin of Clone Force 99's effectiveness, as well as their disregard for authority. When asked how many enhanced clones were in the Kaminoans' possession, Nala Se stated that only five remained; Tarkin assumed she was referring to Clone Force 99 as a whole, not realizing that Corporal Echo was technically a \"reg\" and that Omega was the fifth enhanced clone.\nHowever, Tarkin was not confident in Clone Force 99's reliability after reading a counter-report from one of their own that they allowed Jedi Padawan Caleb Dume to escape on Kaller. As a test of their loyalty, he dispatched the squad on a mission to Onderon to eliminate Saw Gerrera, his rebel cell, and the refugees he was protecting. When the squad failed to complete their objective, they were immediately arrest upon their return to Kamino in a failed attempt to rescue Omega. Crosshair, the clone who filed the counter-report, was removed from the squad's cell and taken to Nala Se, who informed Tarkin that his inhibitor chip wasn't as active as a standard clone and enhanced the chip at his order, strengthening his loyalty to the Empire, causing him to turn on his own squad.\nWhen Clone Force 99 made their escape with Omega, Nala Se covertly assisted in their escape by remotely preventing the bay doors from closing. After Clone Force 99 successfully escaped, Nala Se informed Lama Su of their escape as well as the loss of Omega. Under Lama Su's instruction, she agreed to refrain from informing the Empire of what had occurred.\nNala Se later spoke with Lama Su to discuss the implications of Vice Admiral Rampart's plans to replace their clones with conscripted soldiers and volunteer recruits. Nala Se already had plans to create a superior clone, but with Fett's genome gradually degrading and the absence of the two unaltered clones, Boba and Omega, she stated such a contingency would not be possible without them. Lama Su was unconcerned with retrieving the necessary clones by force and reminded that they only needed one to ensure their civilization continued relationship with the Empire.\nDetermined to regain Omega, who was vital to Nala Se's research, Lama Su hired several bounty hunters to find the enhanced clone. She was captured on Bracca by one of the hunters, Cad Bane, whom Lama Su instructed to bring to an abandoned Kaminoan cloning facility on Bora Vio. Nala Se offered to bring the mercenary's payment for Omega, but her personal interest in Omega prevented Lama Su from allowing her to go. The Prime Minister felt that Nala Se had endangered their operation, and therefore he sent his aide Taun We to retrieve Omega. Nala Se was then informed that she would be tasked with extracting the genetic material that the Kaminoans required from Omega before terminating her.\nOmega ultimately escaped from Bane as a result of the interference of Fennec Shand, a mercenary that Nala Se secretly hired to prevent the girl from being returned to Lama Su. Following her fight with Bane, Shand informed Nala Se that Omega had managed to get rescued by the members of Clone Force 99. Satisfied that Omega was safe, Nala Se paid the mercenary her fee.\nSome time afterwards, Lama Su suspected that the Empire would no longer need the services of the Kaminoans and would destroy them. Nala Se gathered medical personnel to flee Kamino, but was discovered by Rampart. He decided that she would still be of use to the Empire, and that they no longer required Lama Su. Nala Se had no choice but to comply. After the Empire wiped out every Kaminoan settlement it knew of, Se was transported to an Imperial facility at Mount Tantiss on the planet Weyland.\nAs the chief medical scientist of Kamino, Nala Se was highly intelligent and well-versed in the science of cloning. Her background in the development of the clone army enabled her to serve in the Clone Wars by caring for wounded clones and supervising their rehabilitation. Although she was willing to risk her own life to oversee the evacuation of injured troopers during a Separatist assault on medical facility near Kaliida Shoals, Nala Se possessed a ruthless side to her personality. She favored scientific methods that yielded the quickest results, such as hyper tests, and was unconcerned by their adverse effects on a patient. If an initial test failed to produce a satisfactory result, she would advocate for a more intrusive method such as surgery regardless of the risk to her patient's survival.\nShe held no regard for the lives of her clone creations beyond their usefulness to Kamino and the Galactic Republic. From Nala Se's point of view, clones were disposable assets and the property of their creators. Her methods and opinions greatly differed from those of Shaak Ti, who regarded the clones as living beings. As such, Nala Se experienced difficulty in her professional relationship with the Jedi. In addition to her disregard for the Jedi's moral views, Nala Se disapproved of their spiritual beliefs.\nHowever, despite her lack of regard the lives of the clones she did show some concern for the female unaltered clone Omega. Nala Se cared enough about her young assistant to keep her safe through all means, including purposefully sabotaging the efforts of CT-9904 to subdue the child. Nala Se showed concern for Omega's welfare and safety, so much that she would go against Lama Su's orders to ensure that Omega would be protected. She hired the bounty hunter Fennec Shand to retrieve Omega and return her safely, but when Lama Su declared that he wanted her to terminate the young clone, Nala Se called off Shand, believing Omega would be safe as long as Lama Su did not have her and agreed to pay the bounty hunter.\nNala Se was a Kaminoan female who possessed the average physical features of her people, including white skin and large black eyes with white pupils. She was tall in height and possessed a slender build, both of which were also common to the Kaminoan anatomy.\nNala Se first appears in the Star Wars: The Clone Wars television series season one episode \"Shadow of Malevolence\" on Cartoon Network. She is voiced by Gwendoline Yeo, who reprises the role of Nala Se in season six as well as in Star Wars: The Bad Batch.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nala_Se",
  "/wiki/Nala_Se/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Nala_Se",
  "/wiki/Kamino",
  "/wiki/Kaminoan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Ruling_Council_(Kamino)",
  "/wiki/Galactic_Republic",
  "/wiki/Sith",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_cloning_program",
  "/wiki/Doctor",
  "/wiki/Scientist",
  "/wiki/Clone_Wars",
  "/wiki/Chief_Medical_Scientist",
  "/wiki/Homeworld",
  "/wiki/Cloning",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galaxy",
  "/wiki/Clone_trooper",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_military",
  "/wiki/Soldier",
  "/wiki/Jedi_General",
  "/wiki/Shaak_Ti",
  "/wiki/Trooper",
  "/wiki/Order_66",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Republic_Military",
  "/wiki/Jedi",
  "/wiki/The_galaxy",
  "/wiki/Omega",
  "/wiki/Genders",
  "/wiki/Clone_Force_99",
  "/wiki/Weyland",
  "/wiki/Jedi_Master",
  "/wiki/Sifo-Dyas",
  "/wiki/Army",
  "/wiki/DNA",
  "/wiki/Human",
  "/wiki/Clone_template",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Death",
  "/wiki/Species",
  "/wiki/Sith_Lord",
  "/wiki/Dooku",
  "/wiki/Brain",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi_Order",
  "/wiki/Geonosis",
  "/wiki/22_BBY",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Tipoca_City",
  "/wiki/File:YouMustTry-SoM.ogg",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Haven-class_medical_station",
  "/wiki/Planet",
  "/wiki/Chief",
  "/wiki/Kaliida_Shoals_Medical_Center",
  "/wiki/Malevolence",
  "/wiki/Subjugator-class_heavy_cruiser",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Admiral",
  "/wiki/Wullf_Yularen",
  "/wiki/Battle_of_the_Kaliida_Nebula",
  "/wiki/Time",
  "/wiki/Kaliida_Shoals/Legends",
  "/wiki/Anakin_Skywalker",
  "/wiki/Padawan",
  "/wiki/Jedi_Commander",
  "/wiki/Ahsoka_Tano",
  "/wiki/Ord_Cestus_medical_station",
  "/wiki/Kit_Fisto",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Pelta-class_frigate",
  "/wiki/TB-73",
  "/wiki/Ord_Cestus",
  "/wiki/Frigate",
  "/wiki/Brain_worm",
  "/wiki/Parasite",
  "/wiki/Geonosian",
  "/wiki/Skirmish_aboard_TB-73",
  "/wiki/Worm",
  "/wiki/CT-5385",
  "/wiki/Tiplar",
  "/wiki/Battle_of_Ringo_Vinda",
  "/wiki/City",
  "/wiki/Prime_Minister",
  "/wiki/Lama_Su",
  "/wiki/Darth",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5555",
  "/wiki/Grand_Republic_Medical_Facility",
  "/wiki/Coruscant",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Capital",
  "/wiki/Virus",
  "/wiki/Sith_apprentice",
  "/wiki/Hologram",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Senate",
  "/wiki/Standard_year",
  "/wiki/Skirmish_aboard_the_Tribunal",
  "/wiki/Tribunal",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Corporal",
  "/wiki/Echo",
  "/wiki/CT-9904",
  "/wiki/Jedi_Padawan",
  "/wiki/Caleb_Dume",
  "/wiki/Kaller",
  "/wiki/Mission_to_Onderon_(Clone_Force_99)",
  "/wiki/Onderon",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Escape_from_Kamino",
  "/wiki/Vice_Admiral",
  "/wiki/Rampart",
  "/wiki/Boba_Fett",
  "/wiki/Mission_on_Bracca",
  "/wiki/Bracca",
  "/wiki/Cad_Bane",
  "/wiki/Bora_Vio_cloning_facility",
  "/wiki/Bora_Vio",
  "/wiki/Taun_We",
  "/wiki/Rescue_of_Omega",
  "/wiki/Fennec_Shand",
  "/wiki/Unidentified_medical_officer",
  "/wiki/Weyland_facility",
  "/wiki/Mount_Tantiss",
  "/wiki/Eye",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Cartoon_Network",
  "/wiki/Gwendoline_Yeo",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Category:Audio_files_of_Nala_Se",
  "/wiki/Category:Images_of_Nala_Se",
  "/wiki/Destroy_Malevolence",
  "/wiki/Rookies",
  "/wiki/Brain_Invaders",
  "/wiki/Senate_Murders",
  "/wiki/Conspiracy",
  "/wiki/Fugitive",
  "/wiki/Orders",
  "/wiki/Shattered",
  "/wiki/Aftermath_(episode)",
  "/wiki/Replacements",
  "/wiki/Reunion",
  "/wiki/Bounty_Lost",
  "/wiki/War-Mantle",
  "/wiki/Return_to_Kamino",
  "/wiki/Kamino_Lost",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Databank_A-Z",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Grievous_Intrigue",
  "/wiki/The_Unknown"
 ]
}