{
 "name": "Nalgol",
 "display_name": "Nalgol",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kuat"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Remnant"
     ]
    }
   ]
  }
 ],
 "content": "Nalgol was a Human of the noble Kuat family serving as captain and commanding officer of the Star Destroyer Tyrannic of the Starfleet of the Imperial Remnant some fifteen years after the Battle of Endor. He was one of four Braxant Sector Fleet officers whose Star Destroyers were chosen to serve Flim, a con-artist portraying a returned Grand Admiral Thrawn, and the plans of Moff Vilim Disra and Royal Guardsman Grodin Tierce to envelope the New Republic into a civil war over the crisis concerning the revealed Caamas Document. In order to convince Nalgol and his fellow officers—captains Trazzen of the Obliterator, Argona of the Ironhand, and Dorja of the Relentless—that Flim was Thrawn, Disra had a meeting executed where the four captains personally met with the Thrawn-apparent. Though he did not trust the Moff, he was a steadfast and loyal officer, and accepted the order to command the Tyrannic, Ironhand, and Obliterator on a secret assault aimed at the Bothan homeworld of Bothawui, shaking hands with Flim at the conclusion of the meeting. The hand-shake had actually been a test in which he incorporated the use of his now-poisonless Kuat family crest ring—the ring was normally used to administer poison to one's rival opponent—to acquire a tissue sample which he would later check alongside Thrawn's medical file. The idea would have uncovered the con-artist and plot as a whole if it hadn't already been anticipated; under Disra's instructions, Tierce had gone to some lengths to alter Thrawn's files in order that Flim's tissue would match that of the Chiss Grand Admiral.\nSuspicions quelled, the three Star Destroyers, equipped with the prototype cloaking devices, arrived in the outer reaches of the Bothawui system where they attached themselves to a comet in order to mask their location until their arrival near the capital planet, where the planned attack would then take place. It wouldn't be so. When Imperial agents in the capital city managed to board a New Republic warship and open fire on the planet, it seemed a civil war had begun had not the Millennium Falcon discovered the three Star Destroyers hiding behind the comet, much to Nalgol's surprise. Off schedule, he attempted to order an attack, but already the whole of the once-fighting New Republic warships were bearing down on the Star Destroyers. Realizing that staying to fight would spell certain doom for those under his command, Nalgol ordered a withdrawal.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kuat/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Captain/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Tyrannic",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Braxant_Sector_Fleet",
  "/wiki/Flim",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Vilim_Disra",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Grodin_Tierce",
  "/wiki/New_Republic/Legends",
  "/wiki/Caamas_Document",
  "/wiki/Trazzen",
  "/wiki/Obliterator",
  "/wiki/Argona",
  "/wiki/Ironhand_(Imperial-class)",
  "/wiki/Dorja",
  "/wiki/Relentless_(Dorja)",
  "/wiki/Bothan/Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}