{
 "name": "Nalskel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Otolla Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Nalskel was an up-and-coming Otolla Gungan politician on the Mid Rim planet Naboo who lived during the time of the Galactic Civil War. Following the Battle of Yavin, political opponents in the Nal Raka Criminal Empire sent a Nikto bounty hunter named Soris to kill Nalskel. However, Nalskel's life was saved when the infamous Mandalorian bounty hunter Boba Fett sent a contact of his to work for the politician. This contact, who was learning the ways of bounty hunting, killed Soris and several of his followers, allowing Nalskel's political career within the Imperial administration to continue unhindered.\nNalskel was an Otolla Gungan male politician of the lush Mid Rim world of Naboo who lived during the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. Sometime following the Battle of Yavin, Nalskel's political career began to flourish. However, his political views were not well liked by his opponents, particularly those in Borvo the Hutt's Nal Raka Criminal Empire. In order to halt the Gungan politician's rising success, they commissioned a Nikto bounty hunter named Soris with killing Nalskel.\nHowever, Nalskel's ambitions could not be stopped so easily. The infamous Mandalorian bounty hunter Boba Fett became aware of Nalskel's plight and sent a novice bounty hunter to help resolve the politician's dilemma. Thrilled that Fett had sent him help, Nalskel quickly put the novice bounty hunter to work. Thanks to Naskel's associates, the bounty hunter learned that Soris was away on business. To take advantage of Soris' absence, Nalskel sent the bounty hunter to the Nikto's camp outside of Naboo's oceanside city of Kaadara. Searching for clues, the bounty hunter succeeded in locating Soris' datapad, which contained detailed information regarding Soris' allegiance with the Nal Raka Criminal Empire.\nTo teach Borvo a lesson, Nalskel sent the bounty hunter to another camp outside of Kaadara, occupied not only by Borvo's henchmen, but Soris himself. The bounty hunter first started by killing at least fifteen of Borvo's underlings, before turning toward Soris. Deducing that Soris had no friends left, Nalskel ordered the bounty hunter via comlink to approach Soris, hand him his death mark, and kill him. Motivated by the promise of compensation, the bounty hunter cornered Soris and handed over the death mark given to him by Nalskel—a tombstone inscribed in Aurebesh with the words, \"Rest in Peace. In Loving Memory.\" The bounty hunter then executed Soris, much to Nalskel's delight, who now felt that his political career could blossom unhindered. After the bounty hunter received his payment in credits, Nalskel mused over his next step, going to the Imperial administration.\nNalskel belonged to a lineage of the Gungan species known as the Otolla. Like many Otolla Gungans, Nalskel had orange eyes and orange, mottled skin. Nalskel also spoke a strongly accented form of Gunganese, a language derived from the Naboo settlers' language, Basic.\nNalskel was ambitious in his effort to advance his political agenda and ruthless in his mission to eliminate his political opponents. As evidenced by his cooperation with the bounty hunter sent by Boba Fett, Nalskel had no qualms with killing Soris and enacting revenge against Borvo's criminal empire. Nalskel also insisted on the macabre gesture of handing Soris a death mark in the form of a tombstone before having him killed. Still, Nalskel exhibited a cheerful demeanor. He was very thankful to Fett and the novice bounty hunter who saved his life.\nDuring his political career, Nalskel wore a uniform similar in appearance to those of the militiagung, soldiers of the Gungan Grand Army.\nNalskel was a non-player character in the 2003 massively multiplayer online role-playing game Star Wars Galaxies, developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Nalskel was added to the game with the \"New Game Enhancements\" update, released on November 15, 2005. If a player chose to pursue the bounty hunter profession, the player would receive an arrest warrant item when reaching Level 26. By using this item, players would begin an optional quest that involved working with Boba Fett to save the Gungan Nalskel from Soris the bounty hunter. This article assumes that the player was a novice bounty hunter, which was the intended recipient of the arrest warrant item.\nThe game's directory tree files contain details for a follow-up quest that never made it onto the live servers. In this quest, the player discovers that a rival politician, a man named Charde, directly hired Soris to kill Nalskel. Upon learning this information, Nalskel asks the player to assassinate Charde. The directory files also reveal that Nalskel was an up-and-coming politician of Wayfar, a small town on the planet Tatooine.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Naboo/Legends",
  "/wiki/Otolla/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Politics/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Nal_Raka_Criminal_Empire",
  "/wiki/Nikto/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Soris",
  "/wiki/Death/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Borvo",
  "/wiki/Hutt/Legends",
  "/wiki/Canon",
  "/wiki/Ocean/Legends",
  "/wiki/City/Legends",
  "/wiki/Kaadara",
  "/wiki/Datapad/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Death_mark/Legends",
  "/wiki/Tombstone",
  "/wiki/Aurebesh/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Species/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Gungan_Basic",
  "/wiki/Language/Legends",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Militiagung/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Gungan_Grand_Army/Legends",
  "/wiki/2003",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Video_game",
  "/wiki/Charde_(politician)",
  "/wiki/Assassin/Legends",
  "/wiki/Wayfar",
  "/wiki/Tatooine/Legends",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Comm_unit/Legends",
  "/wiki/Galactic_Phrase_Book_%26_Travel_Guide_(real-life_book)",
  "/wiki/Star_Wars:_Episode_I_The_Visual_Dictionary"
 ]
}