{
 "name": "Namman_Cha",
 "display_name": "Namman Cha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale",
      "with red tattoos"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Namman Cha was a Human male and an aspiring Dark Jedi in league with the Galactic Empire who believed that he could become a Dark Lord of the Sith through the discovery of ancient relics, like the Codex of Tython. He was an imposing warrior, calling for no quarter in a brutal attack. His hate had pushed him to learn to use a shoto, a short-bladed lightsaber.\nFrom time to time Namman Cha, to his great disgust, was assigned by the Emperor, Darth Sidious, to work in tandem with the Imperial Forces. One such occasion involved the Dark Jedi aiding the Imperial Security Bureau in uncovering a Rebel smuggling operation. Shadowing the insurgents' movements in the vicinity of the planet of Naboo, Cha saw the evidence of the Corellian pilot Dash Rendar's involvement in the scheme. The Dark Jedi preferred to simply destroy the traitor, but he was required to learn the smuggler's contacts first. Cha sent an undercover agent to follow Rendar, while he himself, accompanied by several of his Sith Shadow minions, attempted to get aboard his starship, the YT-2400 light freighter called Outrider. Though their plans were ultimately foiled by the smuggler's security, the ISB operative successfully identified Rendar's Rebel contact as Major Coret Bhan. Pleased with the report, Cha sent the agent to follow the smuggler's vessel to uncover more of his activities.\nShortly before the Battle of Talus, the Dark Jedi Cha was charged by the Lord Darth Vader with uncovering and laying waste to the Rebel base on Talus. While investigating insurgent activity in the Corellian system, he ambushed a meeting of Rebel agents in the Corellian spaceport. However, Cha was not aware that thanks to intelligence efforts, his adversaries were ready for the attack. The Dark Jedi and his underlings did not expect to find such a large number of Rebels, as well as several CorSec operatives in the spaceport at the same time. After several of his minions were defeated, Cha ordered a retreat and escaped with a few of his adepts.\nWhile on a mission to the planet of Dathomir, the Dark Jedi Cha became interested in the Nightsister Kyrisa, who had mastered the power of animal friendship. Sensing that her ability to control the beasts of Dathomir was special, he determined that the witch could become a powerful ally to the Emperor and intended to recruit her to their cause. However, before Cha could get to Kyrisa, she was exiled from the planet by the Clan mother Gethzerion for a failed attempt to claim the leadership of the clan. It took Cha some time to track her down, but eventually he determined that Kyrisa had crashed on the remote Outer Rim world of Hoth. The Dark Jedi contacted one of his Imperial agents to aid him in the search for the Nightsister and the two met on Hoth, where they agreed to check different search grids and stay in touch with each other.\nDuring his search, Cha discovered that he wasn't the only one interested in Kyrisa. His old enemy, the Jedi Knight Rachi Sitra, was also looking for the Nightsister, with the help of some Rebels from the small local outpost. After killing a local Hoth hog, the dark warrior was spotted by one of the Rebels and, after a brief conversation, attacked his competitor. However, the Rebel was able to knock the lightsaber out of Cha's hand and while the Dark Jedi made a leap to recover it, he admitted that as much as he would have fun killing the Rebel, finding the Nightsister was his first priority and time was of the essence. Cha left the Rebel be and continued his search of Kyrisa. He was soon back on her trail by following her beasts. The Dark Jedi found several wampas and fought them, and eventually he found the Nightsister and, after a fierce lightsaber fight, persuaded her to join him.\nNamman Cha was adept at lightsaber combat, and regularly made use of dual lightsabers, displaying his use of Jar'Kai. He could also cast Force lightning, and was adept and many other Force powers, such as Force push.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/The_Price_of_Victory",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Codex_of_Tython",
  "/wiki/Lightsaber_shoto",
  "/wiki/The_Shadow_Syndicate",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Smuggler",
  "/wiki/Planet",
  "/wiki/Naboo/Legends",
  "/wiki/Corellian",
  "/wiki/Dash_Rendar/Legends",
  "/wiki/Sith_Shadow",
  "/wiki/Starship",
  "/wiki/YT-2400_light_freighter/Legends",
  "/wiki/Outrider/Legends",
  "/wiki/Major/Legends",
  "/wiki/Coret_Bhan",
  "/wiki/Squadrons_Over_Corellia",
  "/wiki/Battle_of_Talus",
  "/wiki/Lord/Legends",
  "/wiki/Anakin_Skywalker",
  "/wiki/Talus",
  "/wiki/Corellian_system",
  "/wiki/Corellian/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Wampa/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Kyrisa",
  "/wiki/Animal_bond",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Emperor/Legends",
  "/wiki/Clan_mother",
  "/wiki/Gethzerion",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Rachi_Sitra",
  "/wiki/Hoth_hog",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/Template:SWGTCG",
  "/wiki/Galactic_Hunters",
  "/wiki/Agents_of_Deception",
  "/wiki/Star_Wars_Galaxies_Memory_Book",
  "/wiki/Category:Images_of_Namman_Cha"
 ]
}