{
 "name": "Namua",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Namua was a Nautolan male who lived on the Colossus platform in 34 ABY. He sold fruit at the Colossus marketplace. He had an inquisitive personality, and was present for several major events on the station.\nIn 34 ABY, Namua watched the race between Torra Doza, and the newcomer Kazuda Xiono, from his fruit stall. During his efforts to spy on Colussus residents, Kazuda used Namua's stall as cover. When the Colossus was raided by pirates, Namua hid in a shelter until the pirates retreated. He was walking the corridors when Xiono ran down to try and save Jace Rucklin. Namua was also working at his store when the droid BB-8 was searching for Xiono.\nWhen the pirates attacked again, Namua went to salvage the content of a hoverlift that had been rammed into the pirate Leoz. Sometime after, Namua was in the market and spotted Torra Doza, daughter of Colossus Captain Imanuel Doza. He and a few others bombarded her with questions about what Doza was doing regarding pirate attacks and canceled races.\nWhen the First Order occupied the Colossus, Namua was among the residents who protested against them in the marketplace. Later that same day, as he was walking through the station, Namua came across Neeku, Tam, BB-8, Kel, and Eila, who were carrying an unconscious stormtrooper. He asked about the stormtrooper's wellbeing, but seemingly accepted their explanation that the man was ill.\nWhen the food stores on the Colossus ran out while the station was fleeing from the First Order, Aunt Z declared that she was leaving, and several other residents, including Namua, volunteered to join her. However, Namua and the others were convinced to stay when Kazuda and Torra successfully hunted down a jakoosk to feed the station. When Neeku rigged up a hologram to simulate Castilon's sky outside the marketplace, Namua exclaimed that it looked just like the real thing.\nNamua was a male Nautolan with green skin and black eyes. The tentacles on his head were short, and he kept them tied back in a ponytail. He paid close attention to what was happening on the Colossus, and was sometimes inquisitive to the point of being invasive.\nNamua first appeared in \"The Recruit,\" the first episode of Star Wars Resistance Season One. He was first identified in \"Secrets and Holograms,\" where he was voiced by Stephen Stanton.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Nautolan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Colossus",
  "/wiki/34_ABY",
  "/wiki/Colossus_marketplace",
  "/wiki/Race_between_Kazuda_Xiono_and_Torra_Doza",
  "/wiki/Torra_Doza",
  "/wiki/Kazuda_Xiono",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Pirate",
  "/wiki/Jace_Rucklin",
  "/wiki/Droid",
  "/wiki/BB-8",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Leoz",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/First_Order",
  "/wiki/Neeku",
  "/wiki/Tamara_Ryvora",
  "/wiki/Kel",
  "/wiki/Eila",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Z%27Vk%27Thkrkza",
  "/wiki/Jakoosk",
  "/wiki/Hologram",
  "/wiki/Castilon",
  "/wiki/The_Recruit",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/Secrets_and_Holograms",
  "/wiki/Stephen_Stanton",
  "/wiki/The_Triple_Dark",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_Search_for_Kaz",
  "/wiki/Synara%27s_Score",
  "/wiki/The_New_Trooper",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)"
 ]
}