{
 "name": "Nan",
 "display_name": "Nan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Approximately 1.5 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nihil",
      "Graf family"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Hague",
      "Marchion Ro"
     ]
    }
   ]
  }
 ],
 "content": "Nan was a female human information broker and member of the Nihil who lived during the High Republic Era. She joined the pirate organization along with her parents when she was a child. After her parents' deaths, she became the ward of the elder Nihil Hague, who taught her how to fight cleverly to make up for her small stature. When she and Hague were stranded at an ancient space station after the Great Hyperspace Disaster, the two concealed their identities as Nihil while taking refuge alongside multiple other starships.\nFollowing the battle in the Berenge sector, Nan and Chancey Yarrow went from working for the Eye of the Nihil Marchion Ro to work for the Graf family. She returned to the Nihil after the destruction of Starlight Beacon.\nNan was a human female who lived during the High Republic Era. As a child, she and her parents joined the Nihil, an organization of pirates who ravaged the Galactic Frontier. Nan's mother and father died during a Nihil raid, leaving her in the care of the Zabrak Nihil member named Hague.\nShortly after the Great Hyperspace Disaster, Nan and Hague were marooned in a star system containing the Amaxine space station, which housed Drengir who had been kept dormant for many years. There, the young pirate and her ward kept their Nihil identity hidden, posing as simple refugees. They and others were aided by a group of Jedi including Master Cohmac Vitus, Jedi Knights Orla Jareni and Dez Rydan, and Padawan Reath Silas. Reath and Nan were both in their teenage years, and the girl feigned romantic interest in Reath to learn about the Jedi Order for the Nihil. Some of the refugees attempted to kidnap and traffic Nan as a slave, but she was rescued by Padawan Silas.\nAboard the Amaxine station, several idols kept the energy of the dormant Drengir, imbued with the dark side of the Force, at bay. For a time after the Hyperspace Disaster, the Galactic Republic closed all hyperspace travel except for emergencies. Once that was lifted, the Jedi returned to the Republic capital planet of Coruscant with the idols, believing them to be the source of the dark side energies on the station and seeking to study them in the Shrine in the Depths of the Jedi Temple. However, the Jedi learned that the idols had actually been keeping the Drengir aboard the station dormant and returned to the station to return the idols and once again entrap the Drengir. When they returned, Nan's Storm and stormship had arrived at the Amaxine station, and she and Hague openly displayed as Nihil.\nNan confronted Silas at blasterpoint, but allowed the young man to go free as he had saved her from human trafficking. Later, after Hague and most of Nan's Storm were killed, Nan reported to Eye of the Nihil Marchion Ro.\nOver the next year, Nan served as a protégée of Ro, for whom she developed romantic feelings. She served alongside Krix Kamerat as a protégé of Ro, and felt a strong rivalry with Krix.\nAboard Starlight Beacon, Reath Silas, who had a crush on the Mirialan Jedi Knight Vernestra Rwoh, pondered how it would feel to kiss Nan, recalling her as a sweet and lonely girl despite her cruelty and status as a pirate. He then reminded himself that she had been fishing for information by feigning kindness, and decided to eat instead of thinking about Nan further.\nNan took on a mission for Marchion Ro to accompany the \"Oracle\" Mari San Tekka to the space station Gravity's Heart of the physicist Chancey Yarrow. There, she and the Chadra-Fan doctor Kisma Uttersond were treated as prisoners by Yarrow's Nihil before Nan accompanied Yarrow to the Graf family's mobile headquarters, Everbloom. The Nihil set an ambush on Everbloom where they captured the Jedi Padawans Reath Silas and Imri Cantaros as well as Chancey Yarrow's daughter, the hauler Sylvestri Yarrow.\nFollowing the attack on Gravity's Heart, Nan and Chancey Yarrow escaped and went back to Everbloom, where Yarrow pressured Nan to become an information broker and spy for the Graf family rather than working for Marchion Ro. After a time away from the Nihil, she decided to return to the group after the Yarrow's death and the destruction of Starlight Beacon, which proved to her that the Nihil were unstoppable.\nNan first appeared in the young-adult novel The High Republic: Into the Dark, which was written by Claudia Gray and published as part of the Star Wars: The High Republic publishing series on February 2, 2021. She was first pictured in concept art showcased during the fourth episode of the web series Star Wars: The High Republic Show on July 28 of the same year.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nan_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Nihil",
  "/wiki/Graf_family",
  "/wiki/Hague",
  "/wiki/Marchion_Ro",
  "/wiki/Information_broker",
  "/wiki/High_Republic_Era",
  "/wiki/Pirate",
  "/wiki/Parent",
  "/wiki/Death",
  "/wiki/Amaxine_space_station",
  "/wiki/Space_station",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Starship",
  "/wiki/Battle_in_the_Berenge_sector",
  "/wiki/Chancey_Yarrow",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Youngling",
  "/wiki/Galactic_Frontier",
  "/wiki/Zabrak",
  "/wiki/Star_system",
  "/wiki/Drengir",
  "/wiki/Standard_year",
  "/wiki/Jedi",
  "/wiki/Jedi_Master",
  "/wiki/Cohmac_Vitus",
  "/wiki/Jedi_Knight",
  "/wiki/Orla_Jareni",
  "/wiki/Dez_Rydan",
  "/wiki/Padawan",
  "/wiki/Reath_Silas",
  "/wiki/Jedi_Order",
  "/wiki/Slavery",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Galactic_Republic",
  "/wiki/Hyperspace",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Shrine_in_the_Depths",
  "/wiki/Imperial_Palace",
  "/wiki/Storm",
  "/wiki/Stormship",
  "/wiki/Blaster",
  "/wiki/Krix_Kamerat",
  "/wiki/Starlight_Beacon",
  "/wiki/Mirialan",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Diet",
  "/wiki/Mari_San_Tekka",
  "/wiki/Gravity%27s_Heart",
  "/wiki/Chadra-Fan",
  "/wiki/Kisma_Uttersond",
  "/wiki/Everbloom",
  "/wiki/Imri_Cantaros",
  "/wiki/Sylvestri_Yarrow",
  "/wiki/Spy",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/Claudia_Gray",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/February_2",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_High_Republic_Show",
  "/wiki/July_28",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_Midnight_Horizon_(audiobook)",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com"
 ]
}