{
 "name": "Nana",
 "display_name": "Nana",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Homanan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kelly Vermillion"
     ]
    }
   ]
  }
 ],
 "content": "Nana was a member of the mysterious shape-changing race known as Homanans. She was able to change her shape to anything from the size of a Wookiee to that of an Ewok, but rarely changed her personality. She almost always seemed loving and carefree. Nana took pleasure in using her abilities to confuse and bewilder others, and was not above playing pranks at the most inopportune times.\nShe often carried weapons of several different races to enhance her disguises, including a Wookiee bowcaster. Her weapon of choice, however, was simply a blaster.\nWhile Captain Scarlet Bloodhawk was on the planet of Mandrine, Nana, in the form of a Wookiee, decided to nose around her ship, the Capri Nitari, which was reported to Bloodhawk by her crewmate Haynes. Bloodhawk did not find out that this Wookiee was Nana until later in a bar called Maizie's. While there, she joined in the brawl started by Kronus and his goons. After the fight she was approached by Bloodhawk, whom thought she was Tyric's mate, as she was in the guise of a bird-like humanoid similar to him, who told him her name and explained that she only answered to Kelly.\nAfter leaving the planet Mandrine, she was part of Kelly's group when they went to the spice mines of Kessel and acquired the Long Shot, which they rechristened the Menagerie in honor of their diverse group. Later in their journey, Nana lost her Homanan body when she was involved in an explosion while in the presence of a Jedi Force crystal. Luckily for her, the crystal saved her mind and forced it into the Noolan body of Otolia Ratiuv. Because of this she lost her shape-changing ability and gained telepathy.\n \"The New Rogues Gallery: Unsung Heroes of the Rebellion\"—Polyhedron 59",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nanna",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Homanan",
  "/wiki/Gender/Legends",
  "/wiki/Kelly_Vermillion",
  "/wiki/Polyhedron_59",
  "/wiki/Wookiee/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Bowcaster/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Scarlet_Bloodhawk",
  "/wiki/Planet/Legends",
  "/wiki/Mandrine/Legends",
  "/wiki/Capri_Nitari",
  "/wiki/Haynes",
  "/wiki/Maizie%27s",
  "/wiki/Kronus",
  "/wiki/Tyric_(Shaliz%27Na)",
  "/wiki/Spice/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Menagerie",
  "/wiki/Jedi/Legends",
  "/wiki/Force_crystal",
  "/wiki/Noolan",
  "/wiki/Otolia_Ratiuv",
  "/wiki/Polyhedron",
  "/wiki/The_New_Rogues_Gallery:_Unsung_Heroes_of_the_Rebellion"
 ]
}