{
 "name": "Nandreeson",
 "display_name": "Nandreeson",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Glottal"
     ]
    },
    {
     "name": "Died",
     "values": [
      "17 ABY on Skip 6"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Glottalphib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Nandreeson was a Glottalphib crime lord and one of the most powerful in the galaxy by 17 ABY. He was the undisputed kingpin of Smuggler's Run.\nLando Calrissian once burglarized Nandreeson's living quarters and escaped with a small fortune, which he later used to finance his various business ventures such as the Tibanna gas mining operation on Bespin. Incensed, Nandreeson put a bounty on Calrissian's head. Nandreeson was not merely angry at the theft, but at what it had done to his reputation. He felt that if Calrissian had not made him look foolish, he would have succeeded Jabba the Hutt as the galaxy's most powerful crime lord. He also felt that if he were to finally apprehend Calrissian and make an example of him, the galaxy's criminal element would view him with considerably greater respect.\nSeventeen years after the Battle of Yavin, Calrissian risked returning to Smuggler's Run to help his friend, Han Solo. Despite his precautions, Calrissian was captured and imprisoned by Nandreeson. Lando was thrown into the pool in Nandreeson's quarters. Nandreeson explained to Lando that he intended to keep Lando in the water indefinitely, without sustenance or rest, until Lando finally succumbed to exhaustion and drowned. An attempt to rescue Lando, organized by Solo, failed when half of the rescue party  unexpectedly turned on him after they had reached Nandreeson's quarters. At this point Nandreeson decided to simply have Calrissian, Solo and Chewbacca shot and commanded those in his employ to do so. However, the former friends of Solo and Calrissian were subdued with relative ease and Nandreeson's Glottalphib guards were either killed or driven off after Lando fired a shot at the ceiling, which was occupied by a large number of watumba bats. The startled bats flew around the room and then noticed the fiery breath of the Glottalphibs. The fire-eating bats proceeded to literally fly down the throats of the Glottalphibs and eat their breath, with fatal results.\nNandreeson was submerged when the bats were spurred into action and thus was not attacked by them. Determined to get his revenge on Calrissian, he took hold of Lando and dragged him underwater in an attempt to drown him. Lando was saved when Solo dove under the water to Nandreeson and kicked him. The crime lord opened his mouth to fry Solo, and Chewbacca shot him in the mouth, the only fatal place for a Glottalphib.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Glottal",
  "/wiki/17_ABY/Legends",
  "/wiki/Skip_6",
  "/wiki/Glottalphib",
  "/wiki/Gender/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Smuggler%27s_Run/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Tibanna/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Zeen_Afit",
  "/wiki/Kid_DXo%27ln",
  "/wiki/Wynni",
  "/wiki/Watumba_bat",
  "/wiki/The_New_Rebellion",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_9",
  "/wiki/The_Official_Star_Wars_Fact_File_116",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}