{
 "name": "Nandan Roty",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Canto Bight Police Department"
     ]
    }
   ]
  }
 ],
 "content": "Nandan Roty was a human male officer of the Canto Bight Police Department. In around 34 ABY, he was playing a game of cards in the jail of the Canto Bight police headquarters when he and two of his colleagues were attacked by the astromech droid BB-8. The droid managed to subdue the guards, and after defeating another officer, escaped with the criminal DJ.\nNandan Roty was a human male who served as an officer in the city of Canto Bight's police department. In around 34 ABY, Roty joined a game of cards being played by officer Stepheden Thaldree and another member of the department in the jail of the Canto Bight police headquarters. The trio was then attacked by the astromech droid BB-8, who was seeking to free his comrades Finn and Rose Tico from the jail.\nThe droid managed to subdue all three officers and tie their hands and feet, also gagging Roty with his gloves. The criminal DJ, who had just released himself from his cell, then discovered BB-8 and his three captives, each of whom gave muffled cries for the criminal to help them. Another officer then discovered the scene, and demanded BB-8 and DJ surrender; however, as Roty watched, BB-8 began launching coins at the officer, who DJ then knocked out with his boots. BB-8 and DJ then successfully escaped from the prison.\nRoty had fair skin, brown eyes and brown hair.\nRoty wore the white, blue and black uniform of the Canto Bight police department, including a betaplast armored collar and neck guard and a black helmet. He was equipped with an electro-shock stun prod, a Relby K-25 blaster, a scrambled long-range comlink and a police glowrod.\nNandan Roty was portrayed by Andy Nyman in the 2017 film Star Wars: Episode VIII The Last Jedi and credited as \"Jail Guard\". The character was then named by a card released in the Star Wars: The Last Jedi 2017 series of cards.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Canto_Bight_Police_Department",
  "/wiki/34_ABY",
  "/wiki/Canto_Bight_police_headquarters",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Droid",
  "/wiki/DJ",
  "/wiki/City",
  "/wiki/Canto_Bight",
  "/wiki/Gambling",
  "/wiki/Stepheden_Thaldree",
  "/wiki/Mission_to_Canto_Bight",
  "/wiki/Finn",
  "/wiki/Rose_Tico",
  "/wiki/Glove",
  "/wiki/Coin",
  "/wiki/Boot",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Betaplast",
  "/wiki/Armor",
  "/wiki/Hat",
  "/wiki/Electro-shock_prod",
  "/wiki/Relby_K-25_blaster",
  "/wiki/Comlink",
  "/wiki/Police_glowrod",
  "/wiki/Andy_Nyman",
  "/wiki/2017",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Last_Jedi:_Rose_and_Finn%27s_Secret_Mission",
  "/wiki/The_Last_Jedi_(storybook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary"
 ]
}