{
 "name": "Nap_Lagard",
 "display_name": "Nap Lagard",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Nap Lagard was a male Neimoidian ship commander for the Trade Federation. In 32 BBY, he commanded the Lucrehulk-class freighter Acquisitor, which was stationed in the Outer Rim Territories. During that year, the Trade Federation Lucrehulk freighter Revenue came under attack by Nebula Front terrorists over the planet Dorvalla. Lagard answered a distress call sent by Captain Daultay Dofine and managed to fight off the Nebula Front with the Acquisitor. After picking up Dofine from an escape pod, Lagard took part in a conversation with Trade Federation Viceroy Nute Gunray, which resulted in Dofine taking over command of the Acquisitor.\nNap Lagard was a male Neimoidian who served the Trade Federation during the final decades of the Galactic Republic. In 32 BBY, he was in command of the heavily-armed Lucrehulk-class freighter Acquisitor, which was stationed in the Outer Rim Territories of the galaxy. During that time, the Revenue, another Trade Federation Lucrehulk freighter loaded with a cache of priceless aurodium ingots, was attacked over the planet Dorvalla by Nebula Front, an organization of terrorists. Captain Daultay Dofine of the Revenue sent a distress call for help, and Lagard moved his ship to the Dorvalla system to fight off the Nebula Front troops and rescue as much of the Revenue's cargo as possible.\nAfter arriving at the Dorvalla system, Lagard and his well-armed ship quickly fought off the Nebula Front forces, except for the Hawk-Bat, the flagship of the Nebula Front-aligned mercenary Arwen Cohl. After the Hawk-Bat retreated too, a subordinate informed Lagard that they received a signal from Dofine's escape pod. Dofine instantly ordered Lagard to contact Trade Federation Viceroy Nute Gunray, although he did not tell Lagard why he should do so. Dofine also told Lagard that Cohl, who had boarded the Revenue during the battle and stolen its cargo before leaving in another escape pod, had set the ship to explode. After the Acquisitor picked up Dofine, Lagard himself—accompanied by a mechno-chair to communicate with Gunray—greeted Dofine. In the ensuing conversation, Dofine reported the loss of the Revenue and its cargo. However, Gunray ordered Dofine to take over command of the Acquisitor from Lagard and leave the area.\nNap Lagard was able to command a Trade Federation ship, and he successfully drove back the Nebula Front forces over Dorvalla. Like most of the Trade Federation members, he hated the Nebula Front and was eager to end the threat the group posed. To that end, he intended to force Dorvalla to pay compensation for the attack on the Trade Federation. The Commander was curious about the news that Dofine wanted to report to Gunray, and Dofine rebuffed him for asking for the news. Lagard reacted quickly by asking his colleague a humiliating question about the fate of Dofine's ship, albeit knewing that Dofine had already lost the Revenue.\nNap Lagard first appeared in Cloak of Deception, a novel written by James Luceno and published in 2001. In 2008, he received an entry in The Complete Star Wars Encyclopedia. The name \"Nap Lagard\" was mentioned in the \"Standard Game\" mode of Star Wars: Galactic Battlegrounds, a 2001 video game by LucasArts, as well as its 2002 sequel, Star Wars: Galactic Battlegrounds: Clone Campaigns, in which he is one of the randomly chosen leaders for the Trade Federation. However, as he does not actually appear in the original Galactic Battlegrounds, and the mention of \"Nap Lagard\" is only a randomly chosen name, this article treats his appearance in the game as non-canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Starship/Legends",
  "/wiki/Commander/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Lucrehulk-class_battleship",
  "/wiki/Acquisitor_(Lucrehulk-class)",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Revenue",
  "/wiki/Dorvalla_Incident",
  "/wiki/Nebula_Front/Legends",
  "/wiki/Terrorist/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dorvalla/Legends",
  "/wiki/Distress_signal/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Daultay_Dofine/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Viceroy/Legends",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Time/Legends",
  "/wiki/Aurodium/Legends",
  "/wiki/Dorvalla_system",
  "/wiki/Trooper/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Hawk-Bat_(gunship)",
  "/wiki/Flagship/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Arwen_Cohl",
  "/wiki/Unidentified_Neimoidian_subordinate",
  "/wiki/Mechno-chair/Legends",
  "/wiki/Cloak_of_Deception",
  "/wiki/James_Luceno",
  "/wiki/2001",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Video_game",
  "/wiki/LucasArts",
  "/wiki/2002",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Canon",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}