{
 "name": "Napvansa Tadavv",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sluissi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Napvansa Tadavv was a female Sluissi who joined the Alliance to Restore the Republic and served as an expert engineer on starships during the Galactic Civil War. In 0 ABY, Tadavv was on the shadowport known as StarForge Station. That year, when the former Imperial EF76 Nebulon-B escort frigate Far Orbit came to the space station looking to take on more crew, she applied for a position.\nA female Sluissi, Napvansa Tadavv was a skilled starship engineer and was good at keeping large engines performing. She had a habit of tripling repair time estimates so she could beat the deadline and look good. In 0 ABY, Tadavv was on the space station shadowport known as StarForge Station, located in the StarForge Nebula, when the former Imperial EF76 Nebulon-B escort frigate Far Orbit arrived after its crew mutinied from under Imperial control. Answering the call for new crew members to staff the ship, which was now a privateering vessel for the Rebel Alliance, the Sluissi was one of many who applied for a berth.\nTadavv had a thick accent and liked tripling repair times so she looked good when she beat the deadline. She was hairless and, at some point, wore a bandolier that had multiple pouches.\nNapvansa Tadavv first appeared in Preparing for War, a roleplaying adventure idea from 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games' Star Wars: The Roleplaying Game and was a sequel of sorts to the previous publication Pirates \u0026 Privateers, carrying on that book's theme by following the privateering vessel Far Orbit. Tadavv was provided as a sample character of the people who could apply for berths on the ship. It is up to player discretion as to who receives a job on the ship.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sluissi",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Shadowport/Legends",
  "/wiki/StarForge_Station",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Far_Orbit",
  "/wiki/Space_station/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Time/Legends",
  "/wiki/StarForge_Nebula",
  "/wiki/Mutiny_on_the_Far_Orbit",
  "/wiki/Frigate/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Bandolier/Legends",
  "/wiki/Preparing_for_War",
  "/wiki/Roleplaying_game",
  "/wiki/1998",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Timothy_S._O%27Brien",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Standard_week/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}