{
 "name": "Nas Ghent",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent SystemsConfederate Navy",
      "Confederate Navy",
      "Galactic EmpireImperial NavyBlack Eight Squadron",
      "Imperial NavyBlack Eight Squadron",
      "Black Eight Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Nas Ghent was a male Human and hotshot starfighter pilot of the Imperial Navy who originally fought for the Confederacy of Independent Systems during the Clone Wars.\nGhent fought with the Confederacy fleet at the Battle of Coruscant and was a decorated hero of the Confederacy. After the war he turned to smuggling, taking dangerous runs through Imperial no-fly zones aboard his ship, the Rhodi's Silence. He did so in an attempt to find a way to cope with the regrets he had from his past and to recapture something of the thrill he had felt in his youth while flying for the Separatists.\nOn one such run, he was shot out of space by Darth Vader. Ghent figured his time had come and accepted his death at the hands of Vader. Vader, however, deactivated his lightsaber and said he was not going to kill him. Vader said that his aviation skills were impressive, but that he is wasting his skills smuggling, and personally recruited Ghent to recruit a crack Imperial TIE Fighter unit, Black Eight Squadron. Assigned aboard the Imperial-class Star Destroyer Crucible, the flagship of an Outer Rim Moff, Ghent clashed with the ambitious deck officer Commander Dorin Millavec. Millavec had been nearing the end of his captaincy of the Crucible and awaiting a career-enhancing move into Lower Command, when he had been sidelined by Darth Vader. Vader ordered Ghent to find seven individuals with unorthodox thinking methods to be assigned to the Crucible, even authorizing Millavec to pull them out of the Imperial prisons if he saw fit. Once brought aboard, Ghent would be responsible for all flying and training. Ghent would report only to Millavec, who in turn would report only to Vader. Millavec balked at Vader's extension of his assignment aboard the Crucible, but Vader bluntly told Millavec he was staying onboard ship until Vader was personally pleased with Ghent's squadron, and also warned Millavec not to test the likes of Darth Vader, lest he be sent to a remote listening post on the Outer Rim, which would be sufficient to doom an Imperial career, or even be sent to the Emperor's throne room for an even worse fate.\nMeanwhile, Ghent was prepared for his job as a squadron commander: by having his vitals tested and his long hair shaved into a buzzcut, and being issued the uniform of an Imperial Sub-Lieutenant.\nAn annoyed Millavec decided to get rid of the \"upstart\" by arranging for him to be killed in a supposed accident: On his first familiarization flight, Ghent was to be given a decrepit TIE fighter and to be shot from behind by his flight members as a rebel infiltrator. However, despite the condition of his ship, Ghent managed to eradicate his two wingmen and crash land into the landing bay, which astonished the crew of the Crucible. An enraged Ghent said if Millavec has a problem with him, he needs to try and kill him face-to-face instead of playing games like a coward. Dorin Millavec coolly replied that the attack was a test from Darth Vader to prove his worthiness as a squad leader, and that Ghent passed with flying colors. Ghent, however, did not appear assuaged by this.\nLater, with his second-in-command, Millavec remarked that Ghent simply needs another assassination attempt, and sought to do so through seven murderous prisoners he had released from prison. The XO remarked that Ghent may wise up to the fact that Vader did not order the hit, but Millavec smugly responds he has his bases covered in that the trainees will kill Ghent, and Vader will forget about his plans through his obsession with finding that Rebel pilot who destroyed the Death Star.\nThis vicious plot, however, only served to re-kindle Ghent's fighting spirit, and he silently vowed to himself to mold this squadron, called the Black Eight, into the Empire's finest, and to get even with Millavec.\nThe story of Ghent was left on a cliffhanger, as the formation of the squadron was never depicted. However, Jeremy Barlow suggested that the story may be continued in a future Rebellion arc, and has hinted that BoShek will be one pilot recruited by Ghent into the Black Eight Squadron.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ghent",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Confederate_Navy",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Black_Eight_Squadron",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/TIE_pilot",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Rhodi%27s_Silence",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Crucible_(Imperial-class)",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Dorin_Millavec",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jeremy_Barlow",
  "/wiki/Star_Wars:_Rebellion_(comic_series)",
  "/wiki/BoShek",
  "/wiki/Walking_the_Path_That%27s_Given",
  "/wiki/Star_Wars_Tales_21",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_PocketModel_TCG#Scum_and_Villainy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Redline",
  "/wiki/1_ABY/Legends"
 ]
}