{
 "name": "Nasdra Magrody",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 10 ABY",
      "Belsavis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arkanian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Magrody Institute of Programmable Intelligence",
      "Galactic Republic",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Professor Nasdra Magrody was a male Arkanian who worked at the Magrody Institute of Programmable Intelligence during the Galactic Civil War.\nIn 21 BBY, Magrody was part of a panel of experts on the HoloNet News program A Galaxy Divided. The topic was the nature of General Grievous's secret weapon. Initially, Magrody tried to downplay the threat, claiming the media were sensationalizing the events, and noting that they were minor in the larger scale of the conflict itself. He also refused to speculate on the nature of the weapon, and suggested that fellow debater Umak Leth's proposals about its capabilities were impractical and unimaginative. He commented sarcastically that Leth might as well have suggested enemy-deployed armed neebrays, space slugs or other vacuum-based lifeforms that could avoid sensors. Despite his attitude, when questioned further about that possibility by the host of the debate, Magrody did point to an ancient record made by his people, of an event similar to what he described.\nLater in the program, when panelist Bunt Dantor brought up the possibility of an ion cannon, Magrody argued that the size of a vessel armed with a weapon capable of destroying entire task forces, would have to be 12 kilometers long. This was based on his perception of the size of the powerplant required, which differed from both Leth's and Dantor's estimates. The possibility of a continent-scorching laser pulse being generated by that kind of power, was also raised by him, though he corrected himself and noted that this was most likely not the case with the enemy weapon.\nAs a teacher at the Magrody Institute, Magrody had several pupils. Bevel Lemelisk was one of the more notable during the time of the Galactic Republic. He also tutored Stinna Draesinge Sha and Ohran Keldor, as well as Qwi Xux, on board Wilhuff Tarkin's training academy orbiting the planet Omwat.\nMagrody later aided in the construction of the Sun Crusher and Death Star, believing, like Qwi Xux, that they would be used for less sinister designs. Sometime before the construction of the battlestation, Nasdra began tapping into a mystical field known as the Force, trying to measure its abilities scientifically, something that even the Jedi weren't able to do. Also during this time he invented a chip that was surgically implanted into a sentient's brain, allowing that sentient to control droids by using the Force focused through the chip.\nAfter the Destruction of Alderaan, he disappeared with his wife Elizie and daughter Shenna and was later found by Roganda Ismaren, who sought him in order to bring to fruition her plans of using the dreadnaught Eye of Palpatine as a focal point and a weapon against the New Republic. She had him implant the special chip into her son's mind and teach him to focus the Force through the implant, so he could bring the Eye to Belsavis. He was kept prisoner under Plett's house, being told that he would one day be reunited with his wife and daughter, though all the holos they had given him never aged.\nHe may have been killed by Roganda or Irek after he outlived his usefulness, though he did write a series of notes that he kept in the room he was locked in, which were later found by Leia Organa Solo. In them, he expressed extreme regret for aiding the construction of the Death Star. The last note was dated 10 ABY, making his presumed death at around that time.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Belsavis/Legends",
  "/wiki/Arkanian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Magrody_Institute_of_Programmable_Intelligence/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Professor/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/A_Galaxy_Divided",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/Umak_Leth",
  "/wiki/Neebray_Manta",
  "/wiki/Exogorth/Legends",
  "/wiki/Lyrax_Pentigure",
  "/wiki/First_Battle_of_Omonoth",
  "/wiki/Bunt_Dantor",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Bevel_Lemelisk",
  "/wiki/Stinna_Draesinge_Sha",
  "/wiki/Ohran_Keldor",
  "/wiki/Qwi_Xux",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Omwat/Legends",
  "/wiki/Sun_Crusher",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Battlestation",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Elizie_Magrody",
  "/wiki/Shenna_Magrody",
  "/wiki/Roganda_Ismaren/Legends",
  "/wiki/Dreadnaught",
  "/wiki/Eye_of_Palpatine",
  "/wiki/New_Republic/Legends",
  "/wiki/Irek_Ismaren",
  "/wiki/Plett",
  "/wiki/Holovid/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/HoloNet_News_%E2%80%94_A_Galaxy_Divided",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Droids,_Technology_and_the_Force:_A_Clash_of_Phenomena_(article)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_85",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Death_Star_Owner%27s_Technical_Manual"
 ]
}