{
 "name": "Nashi",
 "display_name": "Nashi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan"
     ]
    }
   ]
  }
 ],
 "content": "Nashi was a male Hutt who served Jabba the Hutt of the Hutt Clan. Around eight years after the beginning of the Clone Wars, Nashi was sent as an envoy to visit Delian Mors, Imperial Moff of the planet Ryloth. Nashi met with the Moff in her command center on Ryloth's largest moon, where he spoke and laughed with her in the center's courtyard. As the two finished their meeting, Colonel Belkor Dray arrived to meet with Mors and questioned who Nashi was and why he was present. Mors then had Nashi escorted back to his ship with three cases of theenwine. As he left, the envoy belched in Belkor's direction and told Mors that the Colonel looked as rigid as a tree.\nNashi's serpentine, slug-like, body was three meters in length and covered in leathery skin, reminding Belkor of an overstuffed sausage. His watery eyes and his generally slack expression were the norm for his species. Nashi spoke Huttese in a surprisingly high-pitched voice and when he belched at Belkor it created a visible cloud of stink which smelt of rotting meat.\nNashi first appeared in Lords of the Sith, a novel written by Paul S. Kemp and released in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hutt",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Hutt_Clan",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Delian_Mors",
  "/wiki/Galactic_Empire",
  "/wiki/Moff",
  "/wiki/Planet",
  "/wiki/Ryloth",
  "/wiki/Mors%27_command_center",
  "/wiki/Ryloth%27s_largest_moon",
  "/wiki/Colonel",
  "/wiki/Belkor_Dray",
  "/wiki/Starship",
  "/wiki/Theenwine",
  "/wiki/Tree",
  "/wiki/Slug_(creature)",
  "/wiki/Leather",
  "/wiki/Sausage",
  "/wiki/Water",
  "/wiki/Eye",
  "/wiki/Species",
  "/wiki/Huttese",
  "/wiki/Lords_of_the_Sith",
  "/wiki/Paul_S._Kemp",
  "/wiki/2015",
  "/wiki/Lords_of_the_Sith_(audiobook)"
 ]
}