{
 "name": "Nashiak_Llalik",
 "display_name": "Nashiak Llalik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Plavin 6"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Commission for the Preservation of the New Order",
      "Coalition for Progress",
      "Commission for the Preservation of the New Order",
      "Coalition for Progress",
      "Coalition for Progress",
      "Llalik Designs"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Nashiak Llalik, a Human male scientist born on Plavin 6, was a prestigious armor designer. After graduating from the Chandrilan Academy of Sciences, he was recruited by COMPNOR and assigned to the Coalition for Progress. Initially working for his own venture business, Llalik Designs, he developed the coveted Sunder 9 power armor; however, Imperial laws prevented Llalik from continuing that line of work. Llalik then accepted contracts from the Empire to develop armor for Radiation zone assault troopers, Storm commandos, and Zero-G assault stormtroopers. Llalik was handsomely rewarded due to the quality of his work, and he used his fortune to buy a house on his homeworld. His younger sister, Doctor Saren Llalik, an agent of the Rebel Alliance, thought that Nashiak was a potential recruit for the Alliance, because she believed he lacked any real political view.\nNashiak Llalik was born on Plavin 6, a humid jungle world. He was the second of Doctors Nash and Loran Llalik's three children. During his childhood, Nashiak showed an interest in armor technology; he was fond of reading stories about the Death Watch and Sun Guard, two notorious historical military groups that had used advanced armor. Llalik often entertained his younger sister, Saren, by talking about these forms of armor. Later, Llalik studied at the Chandrilan Academy of Sciences and obtained a degree, graduating at the top of his class. Now a scientist, he was then recruited by the Commission for the Preservation of the New Order Science group, who in turn assigned him to the Coalition for Progress, both associated with the Galactic Empire.\nFor a long time, Llalik wanted to work on his pet project, the Sunder 9 power armor. He initiated a personal business venture, Llalik Designs, which allowed him to work on the Sunder 9 for one year. Llalik was his own test pilot for the Sunder 9 project, and as he was left-handed, the prototypes included some weapons in the left arm. However, new Imperial laws forbade most power armor, and Llalik, having already built two untested prototypes, was unhappy.\nWhen Llalik was forced to leave the Sunder 9 project, the Empire hired him to work on armor for the Zero-G assault stormtrooper. He had a chance to incorporate some concepts from the Sunder 9 in that project, although this was not enough to satisfy his own research interests. A talented designer, Llalik became responsible for the development of many Imperial and civilian armor suits, including the Radiation zone assault trooper armor and the Storm commando armor. He also teamed up with Creshaldyne Industries and Koromondain PDS, Incorporated in different designs. Thanks to the quality of his work, Llalik became a rich man.\nHe used the money he earned to build a manor for himself on Plavin 6, even though he did not live on the planet any longer, hoping to return there one day in the future. Llalik decided to store his Sunder 9 prototypes at his manor, and he set up security droids to protect them. Several scoundrels from throughout the galaxy traveled to Plavin 6 wanting to acquire the Sunder 9 prototypes, but none of them managed to evade Llalik's security measures.\nMeanwhile, a Rebel Alliance task force noticed that Llalik's designs were used to the Rebellion's detriment, and so it considered him to be a threat. However, Saren—who had since become a member of the Alliance—did not believe that Llalik was actually a political supporter of the Empire. She hoped that he could be recruited by the Rebellion not only to use his genius for a goal she deemed better, but also because she missed his stories about Sun Guard and Death Watch armor.\nNashiak Llalik, a dark-skinned Human with light green eyes, was fond of wearing loose clothes. He was qualified to test his own prototypes; and as he was left-handed, some of his test armor was customized for his particular use. Saren Llalik believed that Nashiak did not really share the political views of the Empire, as he had only started working toward Imperial interests when new laws stopped him from continuing to work on his own projects.\nLlalik was an expert in the design and maintenance of armor, particularly power armor and certain specific designs, such as those used by the radtroopers, the Zero-G stormtroopers, and the Storm commandos. He was also knowledgeable in other areas, including droid and blaster technology. His other skills included the operation of armor and jetpacks, the use of armor-mounted weapons, and scholarly knowledge of historical armor and alien species.\nNashiak Llalik was first mentioned in Alliance Intelligence Reports , published by West End Games and written by several authors. This book was a supplement to West End Games' Star Wars: The Roleplaying Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Plavin_6",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Coalition_for_Progress/Legends",
  "/wiki/Llalik_Designs",
  "/wiki/Nonrey",
  "/wiki/Doctor/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Chandrilan_Academy_of_Sciences",
  "/wiki/Sunder_9",
  "/wiki/Powersuit",
  "/wiki/Radiation_zone_assault_trooper",
  "/wiki/Storm_commando",
  "/wiki/Zero-G_assault_stormtrooper",
  "/wiki/Nashiak_Llalik%27s_manor",
  "/wiki/Homeworld/Legends",
  "/wiki/Saren_Llalik",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Nash_Llalik",
  "/wiki/Loran_Llalik",
  "/wiki/Death_Watch/Legends",
  "/wiki/Sun_Guard",
  "/wiki/Creshaldyne_Industries/Legends",
  "/wiki/Koromondain_PDS,_Incorporated",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Security_droid/Legends",
  "/wiki/Scoundrel",
  "/wiki/The_galaxy/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Gravity/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/1994",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Gundark%27s_Fantastic_Technology:_Personal_Gear",
  "/wiki/The_Movie_Trilogy_Sourcebook"
 ]
}