{
 "name": "Navari Trik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Navari Trik was a distributor of paintings.\nDuring 1 ABY, she was tasked with distributing paintings selected in Galactic Empire Painting Contest, as well as secretly distributing Rebel paintings from the Rebel Alliance Painting Contest.\nShe set up shop near the Mos Eisley Cantina for a short time, distributing paintings to a number of spacers. Two paintings of note that she distributed were, United in our Cause and The March to Restuss.\nShe later made a return, distributing two other paintings titled Imperial Oasis Incident and Preparing for the Storm in front of the Mos Eisley Spaceport.\nNavari Trik was a Non-Player Character  in the MMORPG Star Wars Galaxies. During Game Update 5, players could obtain paintings from her in Mos Eisley. These paintings were created by players and voted on by the playerbase.\nShe once again made another appearance during Game Update 14, handing out two others free of charge. Just like before, these two paintings were created by players, and voted on by the playerbase on the Star Wars Galaxies message board.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Painting/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Galactic_Empire_Painting_Contest",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Rebel_Alliance_Painting_Contest",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/United_in_Our_Cause",
  "/wiki/The_March_to_Restuss",
  "/wiki/Imperial_Oasis_Incident",
  "/wiki/Preparing_for_the_Storm",
  "/wiki/Spaceport/Legends",
  "/wiki/Sony"
 ]
}