{
 "name": "Nawara_Ven",
 "display_name": "Nawara Ven",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New RepublicRogue Squadron",
      "Rogue Squadron",
      "Galactic Federation of Free Alliances",
      "Booster Terrik"
     ]
    }
   ]
  }
 ],
 "content": "Nawara Ven, known in Ryl as Nawar'aven  was a Twi'lek X-wing pilot and attorney who served as a starfighter pilot and Executive Officer of Rogue Squadron.\nVen joined the Rebellion after seeing many of his clients, whom he knew to be innocent, railroaded by Imperial authorities. He was invited to try and test for Rogue Squadron following its reformation.\nOwing to his legal skills, Ven was often called to arbitrate disputes between squadron members. One such time was when Bror Jace was picking on Gavin Darklighter, saying that to date, he was the worst pilot in the squadron. Bror Jace wanted to decide what his \"punishment\" should have been—namely to be \"apprenticed\" to the best pilot—fetching caf, drafting reports, that sort of thing. However, Corran Horn argued that he was the best pilot and he wasn't particularly inclined to mess with Gavin the way that Bror wanted to. Nawara decided to argue his case before Wedge Antilles, Tycho Celchu and Captain Afyon of the Eridain. Corran agreed to add his kills to Gavin's and go by percentage averages rather than total number of kills. Unfortunately for Nawara, this meant that he was now the worst pilot in the squadron.\nNawara also began to form a relationship with Rhysati Ynr in the early days of Rogue Squadron. During the first battle of Borleias, Nawara was shot out of his X-wing but he was rescued by Tycho Celchu who flew a shuttle in the battlezone, rescuing pilots who were EVA. He participated in the Second Battle of Borleias using Lujayne Forge's X-wing.\nDuring the squadron's mission to infiltrate Imperial Center, he was responsible for evaluating the inhabitants of Invisec to assess their support of a New Republic invasion. While deep undercover with his squadmates, he successfully defended fellow Rogue Gavin Darklighter when the youth was wrongly accused of being a bigot by Bothan Rebel Asyr Sei'lar.\nLater, Ven led the squadron in a delegation to his home planet of Ryloth, in order to obtain the ryll kor necessary to fight the Krytos virus ravaging Coruscant's nonhuman population.\nVen was called upon to act as defense counsel for fellow squadron member Tycho Celchu against charges of murder and treason. The trial ended when fellow Rogue Corran Horn, whom Celchu was accused of killing, burst into the courtroom. Shortly thereafter, Ven and his squadmates resigned their commissions, in order to wage an insurgency against Isard's junta on the bacta-producing planet Thyferra, in the conflict that became known as the Bacta War.\nVen was twice wounded when enemy TIE Fighters scored direct hits on his X-wing fighter. While he completely recovered after the first instance, during the second a micro-meteorite severed his right leg below the knee. Though fitted with a prosthesis, he was no longer fit for combat. However, squad leader Wedge Antilles made him Rogue Squadron's Executive Officer in recognition of his able administrative and intelligence skills.\nFollowing the conclusion of the hunt for Warlord Zsinj, Ven retired from military service altogether and married Rhysati Ynr, a woman from Bespin whom he met while with the Squadron. The two resigned their commissions to start a family. Later, he served as an officer aboard Booster Terrik's freelance Star Destroyer Errant Venture and helped to rescue Jedi students stranded on Trogan during the Yuuzhan Vong War.\nTwo years after the Second Galactic Civil War, Ven, working as a lawyer, defended Luke Skywalker and the Jedi Order against charges brought against them by Chief of State Natasi Daala and the Galactic Alliance, in the Chief's attempt to bring the Jedi to heel for not adhering strictly to the law. Although he was dismayed by Skywalker's plea of guilty and the fact that he was not a part of the final agreement between Daala and his client, Ven continued to defend other Jedi, including Tahiri Veila and Valin Horn. While he won Veila's case, Ven was defeated while defending Horn, successfully persuading the judge to deem the Jedi mentally unstable yet unable to prevent the man's sentence to confinement in carbonite. Ven later represented the entire Jedi Order, fighting the executive order Daala had imposed on them. He won, lifting many of the restrictions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/New_Republic/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Booster_Terrik",
  "/wiki/Twi%27leki/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bror_Jace",
  "/wiki/Gavin_Darklighter",
  "/wiki/Caf/Legends",
  "/wiki/Corran_Horn",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Afyon",
  "/wiki/Eridain",
  "/wiki/File:NawaraVen-JP.jpg",
  "/wiki/Rhysati_Ynr",
  "/wiki/First_Battle_of_Borleias",
  "/wiki/Borleias/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Second_Battle_of_Borleias",
  "/wiki/Lujayne_Forge",
  "/wiki/Coruscant/Legends",
  "/wiki/Alien_Protection_Zone",
  "/wiki/Bothan/Legends",
  "/wiki/Asyr_Sei%27lar",
  "/wiki/Ryloth/Legends",
  "/wiki/Ryll_kor",
  "/wiki/Krytos_virus",
  "/wiki/Treason/Legends",
  "/wiki/Trial_of_Tycho_Celchu",
  "/wiki/Bacta/Legends",
  "/wiki/Thyferra/Legends",
  "/wiki/Bacta_War",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Meteorite/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Bespin/Legends",
  "/wiki/Errant_Venture/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Trogan/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Luke_Skywalker",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Tahiri_Veila",
  "/wiki/Valin_Horn",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Tahiri_Veila",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Valin_Horn",
  "/wiki/Carbonite/Legends",
  "/wiki/X-Wing:_Rogue_Squadron",
  "/wiki/X-Wing:_Rogue_Squadron_(unabridged_audiobook)",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/X-Wing:_The_Krytos_Trap",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/X-Wing:_Wraith_Squadron",
  "/wiki/X-Wing:_Iron_Fist",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/X-Wing:_Isard%27s_Revenge",
  "/wiki/I,_Jedi",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/Young_Jedi_Knights:_Delusions_of_Grandeur",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Rogue_Squadron",
  "/wiki/Star_Wars_Insider_59",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_14",
  "/wiki/The_Official_Star_Wars_Fact_File_77",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Rogue_Three/Legends",
  "/wiki/Nrin_Vakil",
  "/wiki/6_ABY/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Rogue_Eight/Legends",
  "/wiki/Erisi_Dlarit",
  "/wiki/Koobis_Nu",
  "/wiki/Executive_officer/Legends",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Mandatory_Retirement"
 ]
}