{
 "name": "Naxy Screeger",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sakiyan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun",
      "Anjiliac kajidic"
     ]
    }
   ]
  }
 ],
 "content": "Naxy Screeger was a compulsive Sakiyan gambler who was perpetually in debt. Screeger tended to stop in the middle of sentences to think about what he would say next, usually in the form of \"whaddya call it.\"\nHe was a patron of Rik's Cantina on Coruscant, although he hopped many seedy places such as Brogar's Cantina on Lok, where he ran into Cade Skywalker, who sought to collect Screeger's bounty posted by Rav. With little effort, the bounty hunters captured Screeger, who pleaded to be released up until he was turned over to Rav on Socorro.\nScreeger soon helped Cade, Syn, Chak and Kee get into the Golden Gorg Cantina. After the latter got the Grinning Liar back, Screeger tried to beg Cade to let him on the Mynock before Rav killed him. To keep him from creating trouble, Skywalker placed him in the hold where there were rotting gorgs until they could drop him off somewhere.\nSome time after the death of Darth Krayt, Screeger became an information broker for Black Sun Vigo Lun Rask, however was undercover as an operative for Cade so that the Mynock could intercept their ships while they were hijacking Imperial freighters and could take the goods for themselves.\nHe later got a job as gatekeeper in the headquarters of Vedo Anjiliac Atirue, the leader of Anjiliac kajidic. Skywalker, who was requested by Vedo and Jool, Screeger reminded Skywalker that he owed him for telling him that Sith scientist Vul Isen, whom Skywalker was hunting, was on Daluuj. However, only one of Isen's former labs was there, and Skywalker refused to pay him as Isen himself wasn't present before moving in to see Vedo, reminding him that they were invited. Screeger wasn't bothered, and decided to let Skywalker pass, before correcting that only he was invited and causing a door to fall from the ceiling, cutting off Cade from his companions and disappearing into the ground. Several security droids then attacked him, as Vedo wanted to test his skills, but he easily dispatched them with his lightsaber.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sakiyan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Anjiliac",
  "/wiki/Kajidic/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Rik%27s_Cantina/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Brogar",
  "/wiki/Lok/Legends",
  "/wiki/Rav",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Socorro/Legends",
  "/wiki/Chak_(Wookiee)",
  "/wiki/Golden_Gorg_Cantina",
  "/wiki/Grinning_Liar",
  "/wiki/Mynock_(Helot-class)",
  "/wiki/Gorg/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Information_broker/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Lun_Rask",
  "/wiki/Vedo_Anjiliac_Atirue%27s_headquarters",
  "/wiki/Vedo_Anjiliac_Atirue",
  "/wiki/Jool",
  "/wiki/Vul_Isen",
  "/wiki/Daluuj/Legends",
  "/wiki/Security_droid/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Legacy_(2006)_2",
  "/wiki/Legacy_(2006)_3",
  "/wiki/Legacy_(2006)_23",
  "/wiki/Legacy_(2006)_37",
  "/wiki/Legacy_(2006)_48",
  "/wiki/Legacy_(2006)_49",
  "/wiki/Legacy_(2006)_0",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_Era_Campaign_Guide"
 ]
}