{
 "name": "Naytha_Alutana",
 "display_name": "Naytha Alutana",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Metatheran Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Naytha Alutana was a female Twi'lek escort who lived during the waning years of the Galactic Republic. Alutana began life as a slave; she was eventually purchased from a slaving pen by Thurm Loogg, a senior Metatheran Cartel official, and she entered the service of the Cartel. In about 31 BBY, Loogg sent Alutana to act as an escort for Merik Darou, the assistant of Lavina Wren, the senator of the Cularin system, as part of a plan developed by Loogg to put the senator into his debt. Alutana spent some time with Darou on the planet Cularin, and she was with him when he entered a coma as a result of consuming some tainted ryll. The Twi'lek immediately called some private medical personnel and ensured that they took care of Darou, then traveled to a Cartel officer-cruiser to report to Loogg on Darou's condition.\nLavina Wren hired the Heroes of Cularin, a group of local freelance agents, to track down the drug dealer from which Darou had purchased the tainted ryll, and the agents flew to the officer-cruiser to meet with Alutana. Loogg and the Twi'lek met with the agents in Loogg's personal office, and Loogg agreed to allow Alutana to assist the agents with their investigation. She then provided them with the address of Kelkan D'vrosh, the dealer who had sold the ryll to Darou.\nDespite being forced into slavery, Alutana was genuinely helpful and willing to serve others. However, she was fiercely loyal to Loogg due to the fact that he had rescued her from slavery, so she was only willing to help the freelance agents once Loogg had directed her to do so.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Metatheran_Cartel",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Thurm_Loogg",
  "/wiki/31_BBY/Legends",
  "/wiki/Merik_Darou",
  "/wiki/Lavina_Durada-Vashne_Wren",
  "/wiki/Senator/Legends",
  "/wiki/Cularin_system",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Ryll/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Drug_dealer",
  "/wiki/Kelkan_D%27vrosh",
  "/wiki/Oblivion%27s_Kiss"
 ]
}