{
 "name": "Nebaél",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skye"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "S'kytri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Lime green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Supreme Council"
     ]
    }
   ]
  }
 ],
 "content": "Nebaél was a female S'kytri of the Highland Clans of the planet of Skye. The Speaker of the Supreme Council that governed the planet, she resided in the planet's capital city, the City of the Winged People.\nA S'kytri of the Highland Clans, Nebaél served as the Speaker of the Supreme Council in 22 BBY. At this time, the crazed Arkanian mutant, Zeta Magnus had brought a pathogen to Skye and unleashed it on her people, declaring himself Magister in the process. When Jedi Knight Obi-Wan Kenobi and his two Padawans, Anakin Skywalker and Halagad Ventor were brought before the Council to discuss the future of the Tyrant which ruled over them, Nebaél began the proceedings by reminding all in the audience chamber that it was the fault of offworlders that brought about Magnus' plague and ruined their cities. Fearing that they were on the planet to steal the world's bounty and abandon them to death, Nebaél questioned the thinking of Patriarch Klarymére for pledging his eternal fealty to the Jedi if they succeeded in ridding the world of Magnus. While the Patriarch defended his decision, Jedi Kenobi interrupted and addressed Nebaél, speaking of the Jedi's Prophecy of the Chosen One. Introducing Skywalker as the Chosen One with careful emphasis on the Padawan's name, Ventor used the Force to levitate Skywalker up and out of the Council's grand windows much to the shock and awe of Nebaél and the rest of the Council. After the stunt and with a mild Force persuasion from the Patriarch's dughter Kharys, Nebaél granted permission for the offworlders to walk freely and to work on behalf of the Council to end the threat of Magnus. With Nebaél agreement, Kenobi ordered her to muster her soldiers in preparation for an attack on Magnus' citadel on his signal. When the time came, Nebaél sent her soldiers against the citadel and Magnus' forces were eventually defeated. Honoring her pledge to grant eternal fealty to the Jedi, though she vowed no other offworlder would be welcomed to their world due to the violence Magnus had caused.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Skye/Legends",
  "/wiki/S%27kytri",
  "/wiki/Gender/Legends",
  "/wiki/Supreme_Council_of_the_Highland_Clans",
  "/wiki/Planet/Legends",
  "/wiki/City_of_the_Winged_People",
  "/wiki/22_BBY/Legends",
  "/wiki/Arkanian/Legends",
  "/wiki/Zeta_Magnus",
  "/wiki/Magister",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Halagad_Ventor",
  "/wiki/Patriarch_(Skye)",
  "/wiki/Klarym%C3%A9re",
  "/wiki/Chosen_One/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Kharys",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story"
 ]
}