{
 "name": "Nebo",
 "display_name": "Nebo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Onderon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3997 BBY",
      "Dxun"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Naddists"
     ]
    }
   ]
  }
 ],
 "content": "Nebo was a Human male street philosopher and Naddist who preached the virtues of a Naddist regime in the Onderonian capital city of Iziz in the years leading up to the Great Sith War. Nebo delivered sermons to the Iziz populace alongside his father, Rask, despite the fact that their rhetoric was highly unpopular with their audience, who were happy to be free of the former Naddist monarchy of Onderon.\nDuring one such sermon in 3997 BBY, a large angry mob began hurling projectiles at Nebo and Rask, but the two Naddists were saved by a lone Jedi Knight, Exar Kun. Despite their confusion at a Jedi protecting followers of the dark side, Kun enlisted the two Naddists to help him reach the tomb of the late Dark Lord of the Sith Freedon Nadd. Nebo, along with his father, guided the Jedi to the mausoleum on the moon Dxun and watched as Kun cut a hole in the tomb's outer wall with his lightsaber in order to enter. Thinking him a tomb desecrator, Nebo and Rask pulled blasters on Kun once he emerged from within the structure but fell to Kun's lightsaber.\nA Human male native of the planet Onderon, Nebo was a street philosopher who preached to the residents of the Onderonian capital city of Iziz alongside his father, Rask. Nebo and his father were members of the Naddist cult, which worshiped fallen Jedi Knight and Dark Lord of the Sith Freedon Nadd, who brought the teachings of the dark side of the Force to Onderon centuries before. However, by 3997 BBY, Onderon's Naddist monarchy had fallen, and the populace of Iziz saw the Naddists as enemies. Nevertheless, Nebo and Rask did not hide their allegiance to the dark-side cult, even after the fall of the Naddist government. Although the Onderonian masses despised Nebo and Rask's rhetoric, the Jedi refused to arrest them, as they had not committed any crimes.\nOne day in 3997 BBY, Nebo and his father took to the streets to preach the virtues of a Naddist-led government but were met only by an angry mob who insulted and cursed them. Before long, their audience began hurling rocks and other projectiles at Nebo and Rask, who were forced to cower and protect themselves from the mob. However, a lone Jedi Knight named Exar Kun ignited his lightsaber and stepped between the preachers and the townsfolk, berating the crowd for not letting the Naddists speak. Nebo and Rask were incredulous and asked Kun why he, a Jedi Knight, would protect followers of Freedon Nadd. Kun responded that he needed help in something and that he believed Nebo and Rask could assist him.\nKun revealed that he was hoping to learn more about the dark side of the Force and closely interrogated Nebo and Rask on what they knew about the location of the Tomb of Freedon Nadd. After a promise of gold, Nebo and Rask agreed to transport Kun to Dxun, the moon where Nadd's tomb was located. After landing a shuttle on the Onderonian moon, Nebo and Rask guided Kun to the site of the tomb. Kun asked the two to remain behind while he entered, promising them a great reward if the structure they had reached was in truth the tomb he sought. Nebo and Rask watched as Kun subsequently cut a hole in the structure's outer wall with his lightsaber, in order to enter. When Kun returned, Nebo and Rask each pulled a blaster on the Jedi Knight, calling him a tomb desecrator and demanding that he hand over the Sith scrolls he had gathered in the tomb. Enraged, Kun drew his lightsaber and killed the father-and-son Naddist duo.\nNebo was an ardent believer in the Naddist teachings, so much so that he continued to preach the virtues of a Naddist regime in the streets of Iziz despite the fact that their rhetoric had drawn the ire of the Onderonian populace. Both Nebo and his father despised the Jedi Knights, describing them as \"hateful\" and blaming them for the downfall of the Onderonian monarchy. Therefore, they were very surprised when the Jedi Exar Kun saved them from the angry mob and defended their right to free speech. Nebo held a measure of reverence toward Freedon Nadd's tomb, to the point where he pulled a blaster on Kun after the Jedi Knight, in Nebo's eyes, desecrated the tomb. Both Nebo and his father showed a degree of knowledge of Dxun's terrain, leading Kun through the moon's treacherous wilderness to Nadd's resting place.\nNebo made his first appearance in Star Wars: Tales of the Jedi - Dark Lords of the Sith, a story arc of the Star Wars: Tales of the Jedi comic book series, written by Tom Veitch and Kevin J. Anderson and released over late 1994 and early 1995. Nebo appeared in the arc's second issue, wherein he is killed, and was indirectly mentioned in the arc's third issue. In his appearance, Nebo was illustrated by Chris Gossett.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Onderon/Legends",
  "/wiki/3997_BBY",
  "/wiki/Dxun/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Naddist",
  "/wiki/File:CrazyNebo-DLOTS.ogg",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Iziz/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Rask",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Tomb_of_Freedon_Nadd",
  "/wiki/Death/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Freedon_Nadd",
  "/wiki/Moon/Legends",
  "/wiki/Exar_Kun%27s_lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sith_cult/Legends",
  "/wiki/Onderon_Royal_Family",
  "/wiki/Second_Battle_of_Onderon",
  "/wiki/The_Force/Legends",
  "/wiki/Gold/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Sith_scroll/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_-_Dark_Lords_of_the_Sith",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tom_Veitch",
  "/wiki/Kevin_J._Anderson",
  "/wiki/1994",
  "/wiki/1995",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_2",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_3",
  "/wiki/Chris_Gossett",
  "/wiki/Tales_of_the_Jedi:_Dark_Lords_of_the_Sith_(audio)",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}