{
 "name": "Neddoo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray and blue",
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree Village tribe"
     ]
    }
   ]
  }
 ],
 "content": "Neddoo was an Ewok male who lived on the Forest Moon of Endor. In 3 ABY, he was attempting to repair his hut, but the Ewok Teebo, who was being affected by a loonee bird, threw a bundle of reeds at it, destroying the structure. Neddoo was angered by the move and went to Chief Chirpa to complain.\nNeddoo was an Ewok male member of the Ewok tribe in Bright Tree Village on the Forest Moon of Endor. On at least one occasion, his hut had needed to be repaired. In 3 ABY, when Neddoo needed to once again repair the hut, he was approached by the young Ewok scout Teebo, who was under the influence of a loonee bird, which caused him to find everything around him hilarious and to play pranks. Asked of what he was doing, Neddoo explained that he was strengthening his home's support rods, and he asked Teebo to help him by passing him a bundle of reeds. Instead of doing so, however, Teebo used a wagon to launch the bundle at a startled Neddoo, which caused the Ewok to crash into his house, destroying it.\nTeebo laughed at Neddoo, who was shocked that the Ewok scout would do such a thing. It was then that Neddoo caught the effect of the loonee bird, and he too began laughing at his plight, with Teebo encouraging such mirth. However, once Teebo left, the effect wore off, and Neddoo questioned aloud what he was laughing at. He later showed up at the hut of Chief Chirpa along with several other victims of Teebo's pranks in order to complain. By that time, Neddoo's arm was in a sling, and he explained to Chirpa that Teebo had destroyed his hut. Shortly after, the Ewok medicine man Logray told everyone that Teebo was had been behaving strangely due to the loonee bird.\nTeebo considered Neddoo to be the \"biggest sourpuss\" in Bright Tree Village. Neddoo was angry at Teebo after his hut was destroyed, and he questioned why he had pulled such a prank. After Teebo's laughter was done affecting him as well, Neddoo was surprised at himself for laughing at such an incident. He then felt the need to complain about what Teebo had done to Chief Chirpa. Neddoo's fur was gray and blue, and he had black eyes. He also sported a white beard.\nNeddoo wore green clothing with a hood over his head.\nNeddoo appeared in the seventh issue of the Ewoks comic series, which was written by David Manak, illustrated by Warren Kremer, and published by Marvel Comics on February 4, 1986.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Bright_Tree_Village_tribe",
  "/wiki/Endor/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Teebo/Legends",
  "/wiki/Loonee_bird",
  "/wiki/Chief/Legends",
  "/wiki/Chirpa/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Wagon/Legends",
  "/wiki/Bird/Legends",
  "/wiki/Royal_Hut",
  "/wiki/Time/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Shaman/Legends",
  "/wiki/Logray/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Ewoks_7",
  "/wiki/Ewoks_(Marvel)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/David_Manak",
  "/wiki/Warren_Kremer",
  "/wiki/Marvel_Comics",
  "/wiki/February_4",
  "/wiki/1986",
  "/wiki/Category:Images_of_Neddoo",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Marvel_Age_37"
 ]
}