{
 "name": "Nee Alavar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Delegation of 2",
      "000",
      "Delegation of 2",
      "000"
     ]
    }
   ]
  }
 ],
 "content": "Nee Alavar was a human female senator of the Galactic Republic during the Clone Wars. She became a member of the Delegation of 2,000, a group of senators concerned with the actions of Supreme Chancellor Sheev Palpatine during the war.\nAfter Palpatine was rescued during the Battle of Coruscant in 19 BBY, Alavar was among a group of senators who greeted him upon his safe return to the planet Coruscant. She was later one of several delegation members who attended a meeting with Palpatine in his office in order to discuss their concerns.\nNee Alavar was a human female who served as a senator in the Senate of the Galactic Republic. During the Clone Wars, Alavar became a member of the Delegation of 2,000, a group of senatorial representatives who were concerned with the conduct of Supreme Chancellor Sheev Palpatine during the war and wanted him to revoke the emergency powers he had been granted.\nIn 19 BBY, she was among a group of senators who gathered on a landing pad of the Senate Building on the planet Coruscant in order to greet Palpatine after he was rescued from Separatist General Grievous by the Jedi Anakin Skywalker and Obi-Wan Kenobi during the Battle of Coruscant. After Palpatine arrived in a Util-313 speeder bus, Alavar followed him and the rest of the group into the Senate Building while speaking to fellow senator and delegation member Malé-Dee.\nAlavar was later one of several delegation members, alongside senators Padmé Amidala and Fang Zar, who met with Palpatine in his office to discuss their concerns. Due to the chancellor's popularity in the Senate, Alavar and her colleagues had to be very careful in how they approached the conversation in order to not appear unpatriotic or traitorous. Soon after, Palpatine was declared Galactic Emperor, and many members of the Delegation of 2,000 were arrested for treason.\nNee Alavar had tan skin and brown eyes.\nAlavar wore a dark blue robe.\nNee Alavar first appeared in the new Star Wars canon in the prequel trilogy film Star Wars: Episode III Revenge of the Sith, which was released on May 19, 2005. Alavar additionally appears in one of Episode III's deleted scenes, in which she visits Palpatine's office with several other members of the Delegation of 2,000 led by Amidala in order to discuss their concerns with the Chancellor's changes to the Galactic Constitution. The scene, including Alavar's involvement, was partially brought into canon by the 2017 reference book Star Wars: The Visual Encyclopedia.\nThe character's name was not used in the film, but appeared in the credits. She was portrayed by actress Rena Owen, who had previously voiced the Kaminoan Taun We in the 2002 prequel film, Star Wars: Episode II Attack of the Clones. Owen was invited back to play Alavar so that she could be in the final part of the trilogy after playing Taun We, and was on set for three weeks, having been flown to Sydney for a month. The deleted scene was filmed on July 15, 2003 on Stage 7 at Fox Studios, Sydney, and the scene on the landing platform was filmed on Stage 3 at the studio on July 22 of that year.\nOwen considered the human role of Alavar fairly boring compared to the alien Taun We, but she enjoyed being on set and was flattered to return, as she felt it meant the she had become part of the family of people that the film makers trusted. Upon reading the script for the deleted scenes she had a feeling they might be cut, as they did not tie into the central story of Anakin Skywalker. Never the less, she found the group of senators interesting and colorful and felt the scenes painted a fascinating picture of Amidala's character.\nWhile filming the landing platform scene, she asked director George Lucas if senators were allowed to smile and was told that they were; Alavar can be seen smiling in the final cut of the film. Prior to the release of Episode III, Alavar first appeared in the Star Wars Legends novelization of the film, which was written by Matthew Stover and released on April 2, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nee_Alavar",
  "/wiki/Nee_Alavar/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Delegation_of_2,000",
  "/wiki/Senator",
  "/wiki/Clone_Wars",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Battle_of_Coruscant",
  "/wiki/19_BBY",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Emperor%27s_office",
  "/wiki/Galactic_Senate",
  "/wiki/Senate_Building",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Jedi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Util-313",
  "/wiki/Speeder_bus",
  "/wiki/Mal%C3%A9-Dee",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Fang_Zar",
  "/wiki/Galactic_Emperor",
  "/wiki/Treason",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/May_19",
  "/wiki/2005",
  "/wiki/Galactic_Constitution",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Rena_Owen",
  "/wiki/Kaminoan",
  "/wiki/Taun_We",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/July_15",
  "/wiki/2003",
  "/wiki/Fox_Studios,_Sydney",
  "/wiki/July_22",
  "/wiki/Alien",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(novelization)",
  "/wiki/Matthew_Stover",
  "/wiki/April_2",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Category:Images_of_Nee_Alavar",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Technology",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Mark_Newbold",
  "/wiki/August_21",
  "/wiki/October_9",
  "/wiki/2021",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith"
 ]
}