{
 "name": "Neelda",
 "display_name": "Neelda",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Neelda was a Rodian male bounty hunter. Along with the duo Tiver and Rinn and the esteemed hunter Jango Fett and his son Boba Fett, Neelda was hired to return a runaway Twi'lek to her father. After apprehending the girl, Rinn and Tiver betrayed the other bounty hunters taking Boba hostage, but they were eventually killed by Boba himself. The young bounty hunter let Neelda live, saying that he did not seem to be part of the betrayal and hoping that Neelda would talk about the event with other bounty hunters, starting to build Boba a reputation.\nDuring his career as a bounty hunter, Neelda worked with the Gand Rinn and the Chadra-Fan Tiver. Sometime before the plot to assassinate Senator Amidala, the three of them were hired by a man to return his runaway daughter. Neelda and the other two bounty hunters waited for Jango Fett, who had also been hired, in a cantina on Telerath. When he arrived, the bounty hunters noticed his son, Boba, assuming Fett was being followed. Fett introduced Boba, and Neelda showed no issue with the addition to their crew.\nLeaving Telerath, they traveled to Ord Mantell, where they watched the Twi'lek exit a cantina. Neelda reminded Rinn that their target was to be unharmed, which the Gand was dismissive of. When the Twi'lek met with her Falleen lover Griph, the bounty hunters confronted her. Neelda ordered Griph to leave, and he ran away, abandoning the Twi'lek. Before the bounty hunters could capture her, the Twi'lek jumped from the edge of the balcony. Fett, who had been waiting below, ascended using his jetpack and caught her. While Rinn and Tiver were displeased, believing Fett was showing off, Neelda was amazed by the act. Fett stunned the Twi'lek and they made their way back to his ship, the Slave I.\nBefore they arrived, Tiver knocked Boba to the ground as Rinn demanded that Fett hand the Twi'lek over to them. Shocked, Neelda questioned what his partners were doing, but he was silenced by Rinn, who threatened to kill him. Fett refused to exchange the Twi'lek for Boba, which took Tiver by surprise. However, Boba used a hidden blaster to kill Tiver and free himself. As Fett and Neelda watched, Boba turned to disarm Rinn before shooting the Gand down. Neelda retrieved the blaster Boba had dropped when being attacked by Tiver, giving it to Fett. However, Fett turned to his son, asking for his opinion on whether the Rodian should be kept alive. Neelda tried to talk them out of killing him, but Fett left the decision up to his son. As Neelda hadn't been in on the betrayal, and so that he would spread the word of what had happened, Boba decided to let him live, but forfeit his share of the bounty. Relieved, Neelda remarked that he thought the deal was fair, before turning and running away from the two Fetts.\nNeelda was a male Rodian with green skin and purple eyes. Despite being a bounty hunter, Neelda was ethical in his missions, wanting to leave their Twi'lek target unharmed and questioning Rinn and Tiver's betrayal. However, he did nothing to stop them from threatening Boba's life, leaving them to face the consequences of their actions, which led Tiver to accuse him of cowardice. He was satisfied with losing his share of the reward in exchange for his life, choosing to leave rather than fight back.\nNeelda first appeared in the 2018 canon comic Age of Republic - Jango Fett 1, written by Jody Houser and illustrated by Luke Ross.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Tiver",
  "/wiki/Rinn_(Gand)",
  "/wiki/Jango_Fett",
  "/wiki/Boba_Fett",
  "/wiki/Mission_to_Ord_Mantell_(Jango_Fett)",
  "/wiki/Unidentified_Twi%27lek_(Ord_Mantell)",
  "/wiki/Twi%27lek",
  "/wiki/Unidentified_Twi%27lek%27s_father",
  "/wiki/Death",
  "/wiki/Gand",
  "/wiki/Chadra-Fan",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Cantina",
  "/wiki/Telerath",
  "/wiki/Ord_Mantell",
  "/wiki/Falleen",
  "/wiki/Griph",
  "/wiki/Jetpack",
  "/wiki/Stun",
  "/wiki/Starship",
  "/wiki/Slave_I",
  "/wiki/Blaster",
  "/wiki/Bounty",
  "/wiki/Eye",
  "/wiki/2018",
  "/wiki/Age_of_Republic_-_Jango_Fett_1",
  "/wiki/Jody_Houser",
  "/wiki/Luke_Ross",
  "/wiki/Category:Images_of_Neelda"
 ]
}