{
 "name": "Neena",
 "display_name": "Neena",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.4 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Neena was a female Human musician from Alderaan who lived in the Minos Cluster.\nNeena grew up in the household of Bail Organa, and when she began to show musical talent, Organa sent her to an offworld school to master the string oscillator. She was there when the first Death Star destroyed Alderaan. Shocked by this development, Neena tried to contact her old friend Leia Organa, but without funds provided by the Organa household, she was stranded.\nWithout an alternative, Neena began performing on space liners, trying to pick ships heading toward anyone she knew but without much success. After several months, she gave up, and soon was making a decent but boring living entertaining the decadent beings of the planet Adarlon in the Minos Cluster. There, she was approached by Rebel agent Drun Cairnwick, who recruited her to the cause of the Rebellion and sent her to the sector headquarters of Travnin.\nNeena built a solid reputation playing at The Grand Design spacer's bar on Travnin, attempting to get a job performing aboard the Victory-class Star Destroyer The Chariot to gather information on the sector Moff. She arranged for free traders visiting the bar to deliver supplies to local Rebels on behalf of underworld figure Tecknel Shnick. She was successful in gathering information on The Chariot, passing it on to Rebel agents during the revolt in the Cluster.\nShe was also known to deal with smugglers and other such lowlifes, and once hired a down-on-their-luck smuggling crew to steal a batch of prototype holocorders from the Nadir Corporation. When they returned with the holocorders, she got LREED to offload them and paid the group 4,000 credits then offered them the job of delivering a holocrystal and business card to her friend in Pwosson Pictures on Adarlon. She informed the group to look her up whenever they were back on Travnin.\nNeena was almost invariably regarded as \"cute\" by those who encountered her. Her hair was brown and waist-length, often getting in her way when performing various tasks.\nNeena was friendly, with an endearingly impish nature and disarming smile, but her horrible memories of losing her friends on Alderaan made her introverted and gave her difficulty becoming close to others. She believed wholeheartedly in the Rebellion and respected those who put their lives on the line to defeat the Galactic Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Musician/Legends",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/String_oscillator",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Adarlon/Legends",
  "/wiki/Drun_Cairnwick",
  "/wiki/Sector/Legends",
  "/wiki/Travnin/Legends",
  "/wiki/The_Grand_Design",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/The_Chariot",
  "/wiki/Moff/Legends",
  "/wiki/Tecknel_Shnick",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Smuggler/Legends",
  "/wiki/Holorecorder/Legends",
  "/wiki/Nadir_Corporation",
  "/wiki/LREED",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Holocrystal",
  "/wiki/Pwosson_Pictures",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galaxy_Guide_6:_Tramp_Freighters",
  "/wiki/Galaxy_Guide_6:_Tramp_Freighters_(Second_Edition)",
  "/wiki/Challenge_68"
 ]
}