{
 "name": "Neesha_Tor",
 "display_name": "Neesha Tor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Neesha Tor's family"
     ]
    }
   ]
  }
 ],
 "content": "Neesha Tor was a female Rutian Twi'lek.\nNeesha Tor was born on Ryloth. Her mother abandoned her when she was young, leaving her to be a beggar in the streets. Everyone in the town hated her, calling her names such as \"street trash.\" One day, she met a female Twi'lek that told her that she lived near her grandmother and watched her mother grow up and saying that she deserved to be deserted. The Twi'lek refused to let her child give Tor some food, saying it was kind but it would be \"bad luck.\"\nOne day, Tor met a tooka. She complimented it on its cuteness, but then yelled that unlike her, it had done nothing to make people hate it and attempted to kick it, but missed. She fell off the waterfall, hanging on by its edge. She told herself that that was what she deserved, but then Jedi Master Mace Windu came and when she asked him what the plan was to get back up, he said that he didn't have one, shocking Tor, However, he said that he can help her but it will hurt, to which she agreed to take the risk.\nWindu force-pushed her up, and when she asked at why he helped her as he's a Jedi, and she's a worthless beggar, he told her that she wasn't. He told her that it didn't matter what everyone else thought. Windu told her that one day she'd find her worth.\nIn her later life, she would get the tooka as her pet. She also tried to understand what Windu was saying, as she didn't understand at the time of their meeting.\nYears after Windu's death, she recounted this incident to Emil Graf, who was impressed by her experience, but asked what Windu meant. She confessed that she didn't know at first, but she thinks she had now found out. As she freed the tooka, she said that she thought so. When Graf asked what it meant, she said that she could be wrong, but she thinks it meant that it doesn't matter what other people think. What matters is the choices you make, and the choices after that.\nNeesha Tor had brown eyes, and blue skin. During her childhood, she wore rags and thought herself as worthless and cannot be compared to a Jedi Master. However, Jedi Master Mace Windu, persuaded her to feel better about herself, although she didn't understand what he meant until adulthood.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ryloth",
  "/wiki/Twi%27lek",
  "/wiki/Rutian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Neesha_Tor%27s_family",
  "/wiki/Neesha_Tor%27s_mother",
  "/wiki/Neesha_Tor%27s_grandmother",
  "/wiki/Foodstuff",
  "/wiki/Tooka",
  "/wiki/Water",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/The_Force",
  "/wiki/Standard_year",
  "/wiki/Emil_Graf",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Neesha_Tor",
  "/wiki/Eye",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_A_Small_Push",
  "/wiki/Star_Wars_Adventures_(2017)_12"
 ]
}