{
 "name": "Nefta",
 "display_name": "Nefta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 ABY",
      "Byss"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Ruling Circle",
      "Dark Empire",
      "Dark Side Adepts"
     ]
    }
   ]
  }
 ],
 "content": "Nefta, a humanoid male, was a member of the Imperial Ruling Circle and a Dark Side Adept loyal to Galactic Emperor Palpatine during his reign in clone bodies. After Palpatine was killed by Jedi Knight Luke Skywalker, Nefta—along with another darksider, Sa-Di—decided to take his place instead of waiting until he returned in a new clone body. The adepts destroyed the Emperor's clones that had survived an attack attempted previously by Skywalker. Palpatine's loyal Executor Sedriss, however, witnessed Nefta's and Sa-Di's treachery and killed them for it.\nNefta was a humanoid male member of the Imperial Ruling Circle and a Dark Side Adept serving Galactic Emperor Palpatine, who had been reborn in a clone body after his death during the Battle of Endor against the Rebel Alliance in 4 ABY. In 10 ABY, Palpatine launched an assault on the Alliance—which had taken over dominant governmental and territorial control of the galaxy from the Galactic Empire—but was killed by Jedi Knight Luke Skywalker, who also destroyed Palpatine's clones stored in the Emperor's Citadel on the planet Byss. Skywalker, however, was not aware that Palpatine had an additional hidden storage of clones in that same citadel. Following the Emperor's death, Executor Sedriss—a member of the Dark Side Elite, the select cadre of Palpatine's Dark Jedi—assumed command of the Imperial forces, hoping that one day Palpatine's spirit would inhabit another clone and the Emperor would return to rule the Empire once more.\nNefta, however, thought that the Emperor's return could occur many years later, and without a leader, the Empire could collapse beforehand. Nefta and fellow darksider Sa-Di wanted to take the throne themselves and decided to ensure that Palpatine would not come back to stand in their way. The two first spread rumors of the Emperor's permanent demise, and later, when Sedriss departed to discipline the recently rebelled planet of Balmorra, made their final move. Nefta and Sa-Di, armed with a lightsaber and an axe respectively, assaulted the secret storage of clones and destroyed all cloning tanks one by one. Just as they finished their mission, Sedriss returned from Balmorra and witnessed the results of their work. The Executor immediately decided to kill the two for their treachery and attacked Nefta with his lightsaber. Nefta blocked the first blow with his own weapon but was then quickly slain by Sedriss, who later executed Sa-Di as well. Unbeknownst to all three, Palpatine had in fact already taken a new clone body and was watching the entire scene from the shadows in a corridor. After Nefta's and Sa-Di's deaths, the Emperor revealed himself and acknowledged Sedriss's loyalty toward him.\nNefta was an ambitious individual who was willing to rule the Galactic Empire. Although considered to be one of Palpatine's closest friends, Nefta betrayed him by destroying the clones, a task he found most distasteful, but necessary to preserve the Empire.\nNefta was able to adequately handle a lightsaber, using one to destroy the clone tanks. He also apparently possessed some Force powers, which Sedriss referred to as \"magic,\" although neither Nefta's skill with the lightsaber nor his powers were enough to defeat the Executor.\nNefta's only appearance in Star Wars Legends is in the first issue of the Star Wars: Dark Empire II comic book series, written by Tom Veitch and illustrated by Cam Kennedy. Nefta and Sa-Di are the only two characters in the entire comic series whose lines in the speech bubbles are written in white on the black background, instead of the traditional black on white. Nefta is completely absent from the audio adaptation of Dark Empire II, in which Sa-Di destroys the clones by himself.\nHis name is most likely a reference to Nefta, a village in Tunisia where scenes from the 1977 film Star Wars: Episode IV A New Hope were filmed.\nIn addition to his sole appearance, Nefta was briefly referenced in several sources, including the 2002 The New Essential Guide to Characters and The Emperor's Pawns, an article appearing in the fifth issue of the Star Wars Gamer magazine. That article contains a continuity error, as it states that the Emperor's Hand Sarcev Quest betrayed Nefta and Sa-Di when abusing the power within the Ruling Council. Quest's rise to power, however, occurred after the final death of Palpatine in 11 ABY, a year after Sedriss killed Nefta and Sa-Di.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Dark_Empire_II_1",
  "/wiki/The_Emperor%27s_Pawns",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/10_ABY/Legends",
  "/wiki/Byss/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Ruling_Council/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Dark_Side_Adept",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Battle_of_Pinnacle_Base",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Darksider",
  "/wiki/Sa-Di",
  "/wiki/Transfer_essence",
  "/wiki/Duel_on_Byss",
  "/wiki/Executor_(Imperial_rank)",
  "/wiki/Sedriss_QL",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Operation_Shadow_Hand",
  "/wiki/The_galaxy/Legends",
  "/wiki/Emperor%27s_Citadel",
  "/wiki/Planet/Legends",
  "/wiki/Dark_Side_Elite",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Battle_of_Balmorra",
  "/wiki/Balmorra/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Axe",
  "/wiki/Second_Duel_on_Byss",
  "/wiki/Force_power/Legends",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Dark_Empire_II",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tom_Veitch",
  "/wiki/Cam_Kennedy",
  "/wiki/Dark_Empire_II_(audio)",
  "/wiki/Tunisia",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/2002",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Sarcev_Quest",
  "/wiki/Battle_of_Onderon_(Galactic_Civil_War)",
  "/wiki/11_ABY/Legends",
  "/wiki/Dark_Empire_II_3",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Star_Wars_Handbook_3:_Dark_Empire",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_85",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/Dark_Empire_2",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Dark_Empire_6",
  "/wiki/Dark_Empire_5",
  "/wiki/Template:Cite_web",
  "/wiki/Empire%27s_End_2"
 ]
}