{
 "name": "Neina",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Neina was a Human female officer who lived during the Galactic Civil War.\nAfter the Battle of Yavin, Neina resided on board Tansarii Point Station, in the Bright Jewel system. During that time, she was a student of Antom Moria who trained her to become an officer.\nSometime following the Battle of Yavin, violence sparked between the Car'das controlling Tansarii Point Station and the Rak'qua living in neighboring Station Gamma. To settle the dispute, Antom Moria dispatched Neina to travel to Station Gamma in order to speak to a Rak'qua Fervent, one of the Rak'qua leaders. However, the Rak'qua refused to discuss with the young woman and instead captured her. When two days passed without hearing word from Neina, Moria grew concerned, and asked a spacer to investigate her disappearance. The spacer was also an officer under training who had just arrived on Tansarii Point Station with Han Solo. The spacer agreed with helping Antom and soon departed to Station Gamma in order to negotiate the release of Antom's missing student. Ultimately, the Rak'qua Fervent agreed to let Neina go, only if the spacer could succeed in hunting down and defeating one of his shamans in mortal combat. In the end, the spacer succeeded in this test of honor, thus earning Neina's freedom. The young woman was set free and returned safe to Antom Moria.\nNeina was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Neina was added to the game as part of the \"New Player Tutorial\", introduced with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Antom_Moria",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Car%27das/Legends",
  "/wiki/Rak%27qua",
  "/wiki/Station_Gamma",
  "/wiki/Standard_day/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Shaman/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit"
 ]
}