{
 "name": "Nejaa_Halcyon",
 "display_name": "Nejaa Halcyon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19.5 BBY",
      "Susevfi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Corellian Jedi",
      "Corellian Jedi",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Valin Halcyon"
     ]
    }
   ]
  }
 ],
 "content": "Nejaa Halcyon was a Human male Corellian Jedi Master who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars. Unbeknownst to the Jedi High Council, Master Halcyon was married to a Corellian woman and was the biological father of Valin Halcyon. During his service to the Order, he befriended the Caamasi Jedi Ylenic It'kla, who remembered him as Spicewood in his memnii. He was slain by the Dark Acolyte Nikkos Tyris towards the end of the war, and was survived by his family even after the fall of the Republic and the disbandment of the Order. His wife, Scerra, married Halcyon's friend Rostek Horn, and took his surname in order to further hide their identities from the Galactic Empire.\nLike almost all Jedi in the later days of the Galactic Republic, Nejaa Halcyon was identified at an early age as Force-sensitive and taken to Coruscant for training as an Initiate of the Jedi Order. Crafting a silver-bladed lightsaber for his own use, Halcyon progressed through the ranks of the Order in the ensuing years, achieving the rank of Jedi Knight by 60 BBY. After additional training as a Jedi Guardian as well as dabbling in the work of the recruiters of the Acquisition Division, Halcyon ascended to the rank of Jedi Master and was presented with a Credit chip, a tradition amongst the Corellian Jedi. He would later present this medallion to his good friend and Corellian Security Force member Rostek Horn.\nMaster Halcyon worked with the Acquisition Division circa 30 BBY, working as a recruiter in the Outer Rim Territories. It was around this time that Master Halcyon discovered the Force-sensitive Twi'lek Boc Aseca; Halcyon determined the boy to be too old to begin training on Coruscant and refused him admittance into the Order. While loyal to the Order and the Jedi High Council, Master Halcyon disobeyed the Jedi Code by taking marriage vows with a Corellian woman named Scerra. Together, without the High Council's knowledge, the couple had a child whom they named Valin. While Halcyon worked to hide his family from the Order, he always suspected that Grand Master Yoda knew of the child.\nWhen the Corellian sector closed its borders during the Separatist Crisis, Halcyon led a contingent of Corellian Jedi to the planet to insure that the system's security was up to par. The group's involvement in the sector raised questions as to where their loyalties lay; the group returned to the Republic proper after their investigation, stating, \"Our commitment is to the Jedi Council and the Republic that it serves, but we are Corellians by blood and will always have a connection to our home.\"\nDuring the Separatist Crisis between the Republic and the Confederacy of Independent Systems, Master Halcyon led a team of Jedi Knights to locate and recapture the Scarlet Thranta, a rogue Judicial Department corvette whose captain and crew had defected from the Republic. Intercepting the ship, Halcyon hailed the rogue Captain Zozridor Slayke over the planet Bpfassh. Slayke dispatched his lieutenant, a Rodian named Grudo, to aggravate Halcyon and attempt to defeat him in a fight. While Halcyon was distracted with Grudo, Captain Slayke slipped under the notice of the Jedi and board Halcyon's ship, the Plooriod Bodkin. Fleeing the world, Halcyon and his crew were left stranded for months with their single prisoner; Halcyon was disgraced in the media and lost the respect of many of his peers, though no one mentioned his failure around the Temple. Having been rescued by the High Council, Halcyon was stripped of his command of the mission to hunt Slayke and found himself resigned to sitting around the Temple without an assignment.\nWhen the Clone Wars erupted out of the Separatist Crisis, Halcyon received many minor missions, but did not lead many large battles early in the war. Assigned to Corellia late in 22 BBY, Halcyon went undercover as the scientist Ratri Tane to gain information against the Confederacy. Later, Jedi Aayla Secura and Ylenic It'kla were dispatched to find Tane and retrieve the information he had gathered. Discovering that Tane was actually Master Halcyon, the Jedi succeeded in the mission and kept the information from the Confederacy.\nEventually, Master Halcyon was given his first major assignment by the High Council. Recommended by Supreme Chancellor Palpatine by name, Halcyon quickly accepted the mission, and took the news that he would be serving alongside Captain Zozridor Slayke with grace. Charged with protecting the Intergalactic Communications Center on Praesitlyn from the Confederacy, Halcyon chose Jedi Anakin Skywalker as his second in command, having gotten to know him during his time stationed at the Temple. Devising a battle plan to relieve Slayke's outnumbered organization, the Freedom's Sons, Halcyon and Skywalker's initial plan was met with failure. Crafting a desperate rescue mission for the men and women on the ground, Halcyon led a successful assault on the planet while Skywalker captured Separatist Admiral Pors Tonith.\nHaving regained the full confidence of the High Council, Halcyon was granted the title of General in the ranks of the Grand Army of the Republic. Accepting many missions, Master Halcyon served alongside Jan Dodonna at some point in the conflict. In the last year of the war, Master Halcyon accompanied his friend, Master It'kla, and \"Desertwind\" to Susevfi on a mission to neutralize the threat posed by the Jensaarai cult. Confronting the Dark Jedi Nikkos Tyris, Halcyon entered a duel to the death which neither combatant walked away from. Recovering Master Halcyon's lightsaber, Master It'kla reported his friend's demise to the High Council and turned over the lightsaber to the Galactic Museum's Jedi exhibit.\nLearning of his friend's death, Rostek Horn broke the news to Scerra and her son. Vowing to help them through their hardship, the family was even more troubled when the Jedi Order was disbanded and the Republic replaced by the Galactic Empire. Horn and the widow Halcyon eventually fell in love with each other and married, with the family adopting the Horn surname to further hide from the Empire. Adopting young Valin, they began to call him Hal, in honor of his father's legacy. Passing on Halcyon's Jedi Credit coin, who in turn passed it on to his son Corran, the family did not know much of Nejaa Halcyon's legacy until the ship the Lusankya launched out of the Coruscant cityscape. Locating the lost museum of the Jedi, Corran Horn discovered Halcyon's lightsaber among the exhibit.\nConsidered to demonstrate a reserve demonstrative of a true Jedi Master by Grand Master Yoda, Nejaa Halcyon was able to maintain calm in the midst of adversity, capable of laughing off even the wary looks of his peers. Halcyon befriended the young Anakin Skywalker after just a few sparring sessions at the Jedi Temple, admiring his technique learned in the war and from Halcyon's acquaintance, Obi-Wan Kenobi. Halcyon shared the fact he was secretly married, which prompted Skywalker to reveal his secret marriage as well.\nLike other Jedi from the Halcyon family, Nejaa Halcyon had virtually no telekinetic ability under normal circumstances. However, he had a talent for absorbing energy, such as from blaster bolts or lightsaber blades. With this energy, Halcyon could perform the same telekinetic feats that most Jedi could accomplish normally, such as when he destroyed a dark Jedi with a Force crush. Halcyon was also very skilled in the use of mental projection via the Force.\nHe possessed a lightsaber with a silver blade.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Halcyon_(disambiguation)",
  "/wiki/Corellia/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Susevfi",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Corellian_Jedi",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hal_Horn",
  "/wiki/Desertwind",
  "/wiki/Sukarr",
  "/wiki/Duel_on_Susevfi",
  "/wiki/Corellian/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Scerra_Horn",
  "/wiki/Caamasi",
  "/wiki/Ylenic_It%27kla",
  "/wiki/Memnis",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Nikkos_Tyris",
  "/wiki/Rostek_Horn",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/60_BBY/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Jedi_recruiter",
  "/wiki/Acquisition_Division/Legends",
  "/wiki/Jedi_Credit",
  "/wiki/Corellian_Security_Force",
  "/wiki/30_BBY/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Boc_Aseca",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Erk_H%27Arman",
  "/wiki/Odie_Subu",
  "/wiki/Corellian_sector/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Scarlet_Thranta",
  "/wiki/Judicial_Department/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Mission_to_Bpfassh_(Separatist_Crisis)",
  "/wiki/Zozridor_Slayke",
  "/wiki/Bpfassh",
  "/wiki/Lieutenant/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Grudo",
  "/wiki/Plooriod_Bodkin",
  "/wiki/22_BBY/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Ratri_Tane",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Mission_to_Corellia_(Clone_Wars)",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Intergalactic_Communications_Center",
  "/wiki/Praesitlyn",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sons_and_Daughters_of_Freedom",
  "/wiki/Admiral/Legends",
  "/wiki/Pors_Tonith/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Jensaarai/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Galactic_Museum",
  "/wiki/Jedi_Museum",
  "/wiki/Corran_Horn",
  "/wiki/Lusankya/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Horn_family",
  "/wiki/Telekinesis/Legends",
  "/wiki/Tutaminis",
  "/wiki/Mind_trick/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_54",
  "/wiki/HoloNet_News_Vol._531_55",
  "/wiki/Star_Wars_Insider",
  "/wiki/Elusion_Illusion",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/Jedi_Trial",
  "/wiki/Lone_Wolf:_A_Tale_of_Obi-Wan_and_Luke",
  "/wiki/Interlude_at_Darkknell",
  "/wiki/X-Wing:_Rogue_Squadron",
  "/wiki/X-Wing:_Rogue_Squadron_(unabridged_audiobook)",
  "/wiki/X-Wing:_The_Krytos_Trap",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/X-Wing:_Isard%27s_Revenge",
  "/wiki/I,_Jedi",
  "/wiki/Star_Wars:_Union",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/Legacy_of_the_Force:_Betrayal",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Who%27s_Who_in_Rogue_Squadron",
  "/wiki/Star_Wars_Insider_59",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_24",
  "/wiki/The_Official_Star_Wars_Fact_File_28",
  "/wiki/The_Official_Star_Wars_Fact_File_90",
  "/wiki/Polyhedron",
  "/wiki/I,_Jensaarai",
  "/wiki/Polyhedron_157",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Wizards.com",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}