{
 "name": "Nemet",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Death Squadron",
      "Imperial Navy's officer corps",
      "Death Squadron",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Commander Nemet was a human male officer in the naval forces of the Galactic Empire. In 3 ABY, he served as tracking officer aboard the Imperial II-class Star Destroyer Avenger, a part of the Sith Lord Darth Vader's personal fleet, Death Squadron. The fleet searched for the secret base of the Alliance to Restore the Republic, culminating in the Battle of Hoth, after which the Avenger took part in the pursuit of the Millennium Falcon, a rebel vessel that escaped from the planet Hoth.\nDuring the chase, the Falcon hid in the Hoth asteroid field and then escaped Imperial sensors by landing on the command tower of the Avenger. After the Star Destroyer's captain, Lorth Needa, ordered the Falcon be tracked, Nemet informed him that the vessel had vanished. Needa was then executed for losing the Falcon, which ultimately escaped from the Imperials.\nThe human male Nemet served as a member of the officer corps of the Imperial Navy of the Galactic Empire. In 3 ABY, he held the rank of commander and served as a tracking officer aboard the Imperial II-class Star Destroyer Avenger, under the command of Captain Lorth Needa. The Avenger was a part of Death Squadron, a fleet of Star Destroyers led by the Sith Lord Darth Vader in a search of the secret headquarters of the Alliance to Restore the Republic. When the headquarters was discovered on the planet Hoth, the Avenger was among the vessels that took part in the Imperial attack on the base.\nThe YT-1300 light freighter known as the Millennium Falcon was among the rebel craft to escape Hoth, and Vader ordered that the Avenger and other vessels pursue it, as it carried close allies of his son, Luke Skywalker. The freighter managed to hide for a time from the pursuing vessels within the Hoth asteroid field, but upon exiting the field, it encountered the Avenger, which had been patrolling the edge of the field. Failing to jump to hyperspace due to issues with the Falcon's hyperdrive, the freighter's captain, Han Solo, flew his ship directly at the Avenger while Nemet moved over to one of the crew pit consoles on the bridge of the Avenger. He was leaning over the shoulder of the bridge crew member at the console when the Falcon flew in close past the viewport of the bridge, causing the commander to quickly glance up out of the pit.\nSolo then landed the Falcon on the Avenger's command tower, causing the freighter to disappear from the Star Destroyer's scanners. Needa immediately ordered that the freighter be tracked, but after checking his screen, Nemet reported the loss of the vehicle. He confirmed it after checking his screen again when Needa questioned if a vessel like the Falcon was large enough to have a cloaking device. Communications officer M'Kae then informed Needa that Vader wanted an update on the pursuit of the Falcon, and the captain left to apologize to Vader, who executed him for his failure. The Falcon ultimately managed to escape without alerting the Imperials, but was pursued by the bounty hunter Boba Fett.\nNemet had fair skin, brown eyes, and brown hair.\nNemet wore a standard olive-gray Imperial Navy officer's uniform, including a belt and a cap with an officer's disc. On his right breast, the commander bore a single code cylinder and a rank insignia plaque with two red squares above two blue.\nNemet was portrayed by Mark Jones in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back, although the character was only credited in the film as one of several \"Other officers.\" Nemet's lines were dubbed over by actor James Gleason at Samuel Goldwyn Studios on November 2, 1979, with the dialogue replacement cue sheet refering to Nemet as the \"Floor Commander.\" In the film's script, the character is referred to only as \"Tracking Officer.\"\nJones appears again toward the end of the film aboard the bridge of Vader's flagship, the Executor, as footage from the Avenger was reused; however, this article assumes that this is a separate character. The scenes on the bridge of the Avenger were shot on Stage 5 at Elstree Studios at some point between April 24 and May 2, 1979.\nIn the 2015 novel adaptation of the film, The Empire Strikes Back: So You Want to Be a Jedi? by Adam Gidwitz, Nemet's dialogue is altered to sound more panicked than in the film. The 2019 graphic novel adaptation of the film by Alessandro Ferrari also alters Nemet's dialogue, merging his two lines together by removing Needa's dialogue between them.\nIn the new Star Wars canon, Nemet was first identified in the title for a 2018 Star Wars Authentics image produced by The Topps Company, Inc., which incorrectly states that the character appeared in Episode IV A New Hope. The name \"Nemet\" originated in the Star Wars Legends continuity, where it was first used on a card in the 1997 Dagobah Limited set of the Star Wars Customizable Card Game. In Legends, Nemet also appeared prior to the release of The Empire Strikes Back in the film's novelization by Donald F. Glut and The Empire Strikes Back Storybook by Shep Steneman, which were released earlier in 1980.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nemet",
  "/wiki/Nemet/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Death_Squadron",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/File:Needa-TrackThem.ogg",
  "/wiki/Commander",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_Navy",
  "/wiki/3_ABY",
  "/wiki/Assignment",
  "/wiki/Tracking_officer",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Avenger",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Fleet",
  "/wiki/Echo_Base",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Hoth",
  "/wiki/Millennium_Falcon",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/Hoth_asteroid_belt",
  "/wiki/Sensor",
  "/wiki/Command_tower",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Captain",
  "/wiki/Lorth_Needa",
  "/wiki/Starship",
  "/wiki/Death",
  "/wiki/File:Needa-Nemet.ogg",
  "/wiki/Military_rank",
  "/wiki/Commanding_officer",
  "/wiki/Star_Destroyer",
  "/wiki/Luke_Skywalker",
  "/wiki/Freighter",
  "/wiki/Time",
  "/wiki/Asteroid_field",
  "/wiki/Hyperspace",
  "/wiki/Hyperdrive",
  "/wiki/Han_Solo",
  "/wiki/Data_pit",
  "/wiki/Bridge_(starship)",
  "/wiki/Viewport",
  "/wiki/Scanner",
  "/wiki/Cloaking_device",
  "/wiki/Communications_officer",
  "/wiki/M%27Kae",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Imperial_kepi",
  "/wiki/Imperial_officer%27s_disc",
  "/wiki/Breast",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Mark_Jones",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Officer",
  "/wiki/James_Gleason",
  "/wiki/November_2",
  "/wiki/1979",
  "/wiki/Flagship",
  "/wiki/Executor",
  "/wiki/Elstree_Studios",
  "/wiki/April_24",
  "/wiki/May_2",
  "/wiki/File:Nemet-altered.ogg",
  "/wiki/2015",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/Adam_Gidwitz",
  "/wiki/2019",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Alessandro_Ferrari",
  "/wiki/Star_Wars",
  "/wiki/2018",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Legends",
  "/wiki/1997",
  "/wiki/Dagobah_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Donald_F._Glut",
  "/wiki/The_Empire_Strikes_Back_Storybook",
  "/wiki/Shep_Steneman",
  "/wiki/Category:Audio_files_of_Nemet",
  "/wiki/Category:Images_of_Nemet",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/The_Moviemaking_Magic_of_Star_Wars:_Ships_%26_Battles",
  "/wiki/May_6",
  "/wiki/2020",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/2019_Topps_Star_Wars_Black_%26_White:_The_Empire_Strikes_Back",
  "/wiki/September_29",
  "/wiki/2021",
  "/wiki/Behind_the_Magic",
  "/wiki/Creating_the_Worlds_of_Star_Wars:_365_Days"
 ]
}