{
 "name": "Nemok-Ta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Voss"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Centuries before 3640 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gormak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Nemok-Ta was a male Gormak who studied the Force with the Jedi Order in the ancient past of Voss when Jedi and Sith fought on the planet; However, Nemok-Ta's greed and arrogance of the consequences of learning the Force caused the birth of Sel-Makor; in later time during the Cold War he resurfaced as a Force ghost and he told an outsider to go back to Voss-Ka and tell them they threatened Voss with their fight against the Gormak.\nIn ancient times, Sith and Jedi came to battle on the planet called Voss. The natives who inhabited the planet were strong in the Force. In their greed, the natives asked the Jedi to teach them how to use the Force in exchange for fighting their enemies. Nemok-Ta was among the many disciples.\nHowever, the natives failed in understanding the Force. Those who chose to study the Force would become known as the Voss. Those who did not study the Force and instead viewed it as a corruption would become the beastly Gormak. The creation of two races also created a dark side entity called Sel-Makor, who settled in an area called the Nightmare Lands.\nNemok-Ta died under unknown circumstances, but his spirit endured. Unfortunately, Sel-Makor imprisoned Nemok-Ta in the body of his Abyssin avatar, where he would remain for hundreds of years, even as Voss faded from memory of the greater galaxy.\nBy 3640 BBY, during the Galactic War, an Imperial strike team ventured into the Nightmare Lands to discover the identity of the dark power that resided there. Upon encountering and killing the Abyssin avatar of Sel-Makor, Nemok-Ta was freed. With little time left in the physical world, the Gormak ghost explained to the strike team the true history behind Voss and Sel-Makor. He urged them to return to Voss-Ka and warn his people that the Nightmare Lands will grow so long as both Voss and Gormak continue to war. However, the Imperials instead exploited this information by telling the Three, Voss-Ka's rulers, that the Jedi and Republic ruined their planet in the past.\nNemok-Ta is a character of Star Wars: The Old Republic for the main Voss quests.\nAfter encountering Nemok-Ta, the player can either tell the Three the truth about the Voss and Gormak  or lie about it .",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Voss",
  "/wiki/3640_BBY",
  "/wiki/Gormak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sel-Makor",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Force_ghost",
  "/wiki/Voss-Ka",
  "/wiki/Nightmare_Lands",
  "/wiki/Abyssin/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Galactic_War",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}