{
 "name": "Nemrileo irm-Drocubac",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tanjay IV"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tanjayan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Commerce Guild"
     ]
    }
   ]
  }
 ],
 "content": "Nemrileo irm-Drocubac was a Tanjayan male senator who represented the planet Tanjay IV in the Republic Senate on Coruscant during the Separatist Crisis. Irm-Drocubac had a family, which included a wife and two children. In 22 BBY, the senator was involved in Commerce Guild Presidente Shu Mai's plot to have the planet Ansion secede from the Galactic Republic. His involvement in the plot led to him being murdered by agents loyal to the Separatist movement, who sabotaged a delivery vehicle, causing it to crash with his aircar, although the crash was later blamed on equipment failure.\nNemrileo irm-Drocubac was a Tanjayan male who represented his homeworld of Tanjay IV as a senator in the Senate of the Galactic Republic. Irm-Drocubac began working on the planet Coruscant in 37 BBY and had lived on world since. By the time of the Separatist Crisis, in which many star systems left the Republic to form the Confederacy of Independent Systems, irm-Drocubac had a wife, two children, and resided in a suburb in the Bindai District on Coruscant.\nIn 22 BBY, irm-Drocubac was a part of Commerce Guild Presidente Shu Mai's plot to have the planet Ansion secede from the Republic. During a meeting with several other conspirators, irm-Drocubac expressed his doubts regarding Mai's loyalty to the cause, as well as his concerns about Ansion's secession. While he was later traveling in an aircar in the south quadrant of Coruscant, section ninety-three near the suburb where he resided, irm-Drocubac was murdered by agents loyal to the Separatist cause. The agents sabotaged a heavy-equipment delivery vehicle, causing it to collide with his aircar, although the crash was officially attributed to internal guidance software failure in the delivery vehicle.\nIrm-Drocubac's death, combined with the later death of Tam Uliss, a Corellian industrialist, served as a message to others in the Separatist movement who doubted Mai's loyalty to the cause. After his death, Supreme Chancellor Palpatine was scheduled to deliver his eulogy, and irm-Drocubac's ashes were to be scattered above Galactic City, in accordance with Tanjay tradition.\nNemrileo irm-Drocubac was openly disdainful of the common being, despite the fact his lifestyle was based upon their productivity. He was well respected by his colleagues, co-workers and supporters on his homeworld. Despite being a Republic senator, irm-Drocubac knowingly committed treason by being part of a Separatist conspiracy. irm-Drocubac was also known to distrust Shu Mai's loyalty to the Separatist cause, and had concerns regarding Ansion's secession.\nNemrileo irm-Drocubac first appeared in the 2002 novel The Approaching Storm, written by Alan Dean Foster.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tanjay_IV",
  "/wiki/22_BBY/Legends",
  "/wiki/Tanjayan",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Commerce_Guild/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Irm-Drocubac_family",
  "/wiki/Nemrileo_irm-Drocubac%27s_wife",
  "/wiki/Unidentified_child_1_(Nemrileo_irm-Drocubac)",
  "/wiki/Unidentified_child_2_(Nemrileo_irm-Drocubac)",
  "/wiki/Presidente/Legends",
  "/wiki/Shu_Mai/Legends",
  "/wiki/Ansion/Legends",
  "/wiki/Death/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Unidentified_heavy-equipment_delivery_vehicle",
  "/wiki/Airspeeder/Legends",
  "/wiki/Ansionian",
  "/wiki/Mousul",
  "/wiki/Homeworld/Legends",
  "/wiki/37_BBY/Legends",
  "/wiki/Time/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Bindai_District",
  "/wiki/S-93_Area",
  "/wiki/Saboteur/Legends",
  "/wiki/Tam_Uliss",
  "/wiki/Corellian/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_City",
  "/wiki/Treason/Legends",
  "/wiki/2002",
  "/wiki/The_Approaching_Storm",
  "/wiki/Alan_Dean_Foster",
  "/wiki/The_Approaching_Storm_(audiobook)",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_51",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Standard_year/Legends"
 ]
}