{
 "name": "Nenavakasa Nalor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Nenavakasa Nalor, nicknamed \"Nena,\" was a female Nikto engineer who was once enslaved to the Hutt Clan in her younger years after being taken from her homeworld by pirates. Eventually, early in the First Order-Resistance War, Nalor was hired to sabotage the Colossus, a mobile supertanker fuel depot allied with the Resistance that the First Order was attempting to hunt down. Faking damage to her ship, Nalor transmitted a distress call picked up by the station in which she claimed to have barely escaped a First Order attack, and Team Colossus members Neeku Vozo and Kazuda Xiono advocated for her rescue, although Jarek Yeager suspected a trap.\nWhen Xiono and the pirate Synara San flew out to rescue Nalor from her starship, Xiono invited her onboard after learning she was an engineer, as Vozo, the only engineer the Colossus had, was swamped with the amount of needed repair work. Building a quick rapport with Vozo, Nalor used the repair work as cover for her sabotage of the platform, installing a K-spline intended to drain its power as well as repairing the station too well by activating systems that the Colossus lacked the power to be able to have on all at once. After Nalor attempted to cover for her actions and incite conflict on the station by blaming the Warbird gang on draining nearly half the station's power into their sail barge, Galleon, Xiono investigated and was found by San, who pointed out that she herself had installed the power shunt and that Nalor was the one who'd had access to the Colossus' power.\nSearching Nalor's ship, Xiono and San discovered the ship was actually undamaged and decrypted data that revealed that Nalor was working for the First Order and had in fact been tracking the station for several days. After being unmasked, Nalor fled the platform and transmitted her coordinates to the First Order, although regretful about hurting Vozo's feelings. Upon the arrival of Commander Pyre and Agent Tierny's Star Destroyer, Nalor was paid for her work before escaping into hyperspace. However, before the First Order forces could cripple the Colossus, Vozo and Xiono managed to undo the sabotage, allowing the station to escape. Displeased that her hired asset had failed to sufficiently cripple the station, Tierny ordered Pyre to have Nalor executed should they encounter her again, something the stormtrooper commander was only too pleased to agree to.\nNenavakasa Nalor first appeared in the animated series Star Wars Resistance, in the season 2 episode \"The Engineer.\" She is voiced by Meghan Falcone, who is married to the voice of Neeku, Josh Brener.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nena_(disambiguation)",
  "/wiki/Nikto",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/Slavery",
  "/wiki/First_Order",
  "/wiki/Engineer",
  "/wiki/Pirate",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Sabotage_of_the_Colossus",
  "/wiki/Colossus",
  "/wiki/Supertanker_fuel_depot",
  "/wiki/Resistance",
  "/wiki/Hunt_for_the_Colossus",
  "/wiki/Team_Colossus",
  "/wiki/Neeku_Vozo",
  "/wiki/Kazuda_Xiono",
  "/wiki/Jarek_Yeager",
  "/wiki/Synara_San",
  "/wiki/Starship",
  "/wiki/K-spline",
  "/wiki/Warbird_gang",
  "/wiki/Sail_barge",
  "/wiki/Galleon",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/Agent",
  "/wiki/Tierny",
  "/wiki/Thunderer",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Nenavakasa_Nalor",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/The_Engineer",
  "/wiki/Meghan_Falcone",
  "/wiki/Josh_Brener",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Resistance_to_the_End",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Databank_(website)"
 ]
}