{
 "name": "Nenevanth_Tion",
 "display_name": "Nenevanth Tion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lianna"
     ]
    },
    {
     "name": "Born",
     "values": [
      "36 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Commission for the Protection of the Republic",
      "Sub-Adult Group",
      "Commission for the Protection of the Republic",
      "Sub-Adult Group",
      "Sub-Adult Group"
     ]
    }
   ]
  }
 ],
 "content": "Nenevanth Tion was a citizen of the Galactic Republic and one of the earliest members of SAGroup, the youth chapter of the political lobbyist organization known as COMPOR. A Human male born on the Outer Rim world of Lianna, Tion lived during the Republic's final years which were marked by a government in decline, the Separatist Crisis and the Clone Wars. As civil war engulfed the galaxy, Tion and many other like-minded SAGroup brigadiers rallied behind COMPOR in support of the Republic and its head of state, Supreme Chancellor Palpatine.\nA young, adolescent Human male of noble birth at the time of the Clone Wars, Nenevanth Tion was born in 36 BBY on the planet Lianna in the Outer Rim Territories of the galaxy. As civil war broke out between the Galactic Republic and the Confederacy of Independent Systems, Tion departed his homeworld at the age of fifteen and traveled to Coruscant, the capital world of the Republic. Shortly after his arrival, Tion was among the first applicants inducted into the Sub-Adult Group , the Republic youth program of the Human-dominated Commission for the Protection of the Republic .\nAs brigade leader, Tion accompanied six thousand SAGroup brigadiers to a COMPOR rally that was held in the year 21 BBY at the Monument Plaza of Galactic City. Guarded by two clone troopers, Tion delivered a patriotic speech to a large assembly in which he used historical quotes from the Kitel Phard Dynasty in praise of Supreme Chancellor Palpatine's leadership of the Republic. Regarding the elimination of corruption and inefficiency that hindered the Republic, Tion quoted an ancient speech made by the Emperor Uueg Tching of the Atrisi system. Shortly afterward, Chancellor Palpatine addressed the crowd via holocomm and commended the loyalty of both COMPOR and its SAGroup chapter. He also credited Tion's generation as the vanguard of a new order that would replace the chaos of civil war and political stagnation.\nBy the end of Clone Wars in 19 BBY, the self-anointed Emperor Palpatine proclaimed the end of the Old Republic and established the first Galactic Empire in its place. The new autocrat retained the support of COMPOR, itself reformed into the Commission for the Preservation of the New Order . The new organization possessed its own SAGroup, a ideological-based youth program with the objective of indoctrinating young citizens with the principles of the New Order.\nNenevanth Tion was a proud and idealistic young adult, unafraid to voice his support for the Galactic Republic in front of large crowds. Driven by a strong sense of patriotism, Tion supported the Republic during the Clone Wars and was fiercely loyal to Supreme Chancellor Palpatine. He also displayed an interest in history, such as when he used quotes from the ancient Kitel Phard Dynasty during his pro-Republic speech in Monument Plaza.\nNenevanth Tion first appeared in Republic HoloNet News Core Edition 14:9:04, an in-universe HoloNet News issue published in Star Wars Insider 70.\nAfter being asked about it on Twitter, Star Wars author Pablo Hidalgo has commented that the character \"may or may not be Lord Tion from the Radio drama, but the age and the loyalty work out right,\" meaning he left it open for someone else to define if they wanted to.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tion_(disambiguation)",
  "/wiki/Lianna/Legends",
  "/wiki/36_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Tionese_(people)",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Commission_for_the_Protection_of_the_Republic/Legends",
  "/wiki/SAGroup_(COMPOR)/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Civil_war",
  "/wiki/The_galaxy/Legends",
  "/wiki/Brigade/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Humanocentrism",
  "/wiki/21_BBY/Legends",
  "/wiki/Monument_Plaza/Legends",
  "/wiki/Galactic_City",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Kitel_Phard_Dynasty/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Uueg_Tching",
  "/wiki/Atrisian_system",
  "/wiki/Holocomm/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Sub-Adult_Group/Legends",
  "/wiki/Republic_HoloNet_News_Core_Edition_14:9:04",
  "/wiki/In-universe",
  "/wiki/Star_Wars_Insider_70",
  "/wiki/Star_Wars",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tion_(Human)",
  "/wiki/Star_Wars_(radio)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Republic_HoloNet_News_Special_Inaugural_Edition_16:5:241",
  "/wiki/Star_Wars_Insider_84"
 ]
}