{
 "name": "Nerra Ziveri",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Post-56 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Lanius Qel-Bertuk"
     ]
    }
   ]
  }
 ],
 "content": "Nerra Ziveri was a male Twi'lek Jedi Master. He took Lanius Qel-Bertuk as his Padawan and trained him to be a Jedi Knight. At some point, he met Klis Joo, a Duros female who was a Jedi in training at that time.\nIn 119 BBY, Ziveri became the Headmaster of the Almas Academy as it grew from a small school to a full Academy where he taught the Living Force. Though some wondered at putting an Academy so close to such a powerful dark side site as the Almas Sith fortress, Ziveri felt it would be a constant reminder to students of the dangers of the dark side. Every year, he recounted the tale of Kibh Jeen and the Dark Jedi Conflict to the students, though he eventually had older students take over this duty, first as a narration and later as a drama—the event was known as the Ritual Tale of Kibh Jeen.\nNerra Ziveri began the tradition of the Academy taking on some older students, beginning with some Tarasin on the cusp of adulthood and expanding to teenage Wookiees and Twi'leks. He also extended the time students stayed in the group learning environment, expanded the training in alien cultures, and instituted a program of \"Jedi quests\" for his students to gain some experience in the galaxy beyond. All these policies were non-standard for a praxeum, but the High Council of Coruscant, always keeping an eye on the Academy and the nearby Fortress, supported Ziveri's initiatives for his experimental school.\nThe Almas Academy grew in only a few years, in what Ziveri considered the will of the Force. Ziveri was also training Qel-Bertuk as the next Headmaster of the Academy.\nDiscovering that Klis Joo was unhappy with her assignment as Jedi watchman of Duro, Ziveri offered her a teaching job at his Academy. Joo eventually accepted and reached Almas around 55 BBY. Around the same time, Ziveri accepted one Wookiee student who was old even for his Academy's standards, Kirlocca—the last student he personally accepted.\nZiveri was convinced the Sith fortress was important to the future of the galaxy and attempted to probe its dark side aura. One day in 56 BBY, he succeeded in penetrating the aura. He said his farewells to Qel-Bertuk, whom he made the new Headmaster of the Academy. Ziveri then left the planet and disappeared on a mysterious mission, never to be seen again. A bust of Ziveri remained at the Academy as a reminder of his legacy.\nIn 31 BBY, Nerra Ziveri was a Force ghost, active in the Cularin system. Ziveri was present when the flying fortress Conkesta built by dark Jedi Karae Nalvas was destroyed.\nRole-playing game adventure Into the Storm Clouds feature an optional scene only to be played if any playable character dabbled in the dark side of the Force. That character would meet the spirit of a Twi'lek Jedi, who is suggested to be Ziveri, and is offered the choice to either die because of injuries, join the dark side or forfeit all of the character levels that character might have earned. It is unclear whether this is Ziveri's own power operating or some outer power with Ziveri only acting as a mediator.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/56_BBY/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Klis_Joo",
  "/wiki/Duros/Legends",
  "/wiki/119_BBY",
  "/wiki/Almas_Academy",
  "/wiki/Living_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Kibh_Jeen",
  "/wiki/Dark_Jedi_Conflict",
  "/wiki/Ritual_Tale_of_Kibh_Jeen",
  "/wiki/Tarasin",
  "/wiki/Wookiee/Legends",
  "/wiki/Jedi_quest",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Duro/Legends",
  "/wiki/55_BBY/Legends",
  "/wiki/Kirlocca",
  "/wiki/The_galaxy/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Force_ghost",
  "/wiki/Cularin_system",
  "/wiki/Conkesta",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Karae_Nalvas",
  "/wiki/Into_the_Storm_Clouds",
  "/wiki/Tilnes_Rising",
  "/wiki/Wizards.com",
  "/wiki/Discussions_With_Lanius",
  "/wiki/The_Eye_(roleplaying_adventure)",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Into_the_Academy",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}