{
 "name": "Neva_Kee",
 "display_name": "Neva Kee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Xagobah"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Xamster"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue and pale"
     ]
    }
   ]
  }
 ],
 "content": "Neva Kee was a Xamster male podracer pilot who participated in the Boonta Eve Classic podrace on the planet Tatooine during the year 32 BBY. During the second lap of the race, Kee flew off course to find a shortcut and disappeared, never to be seen again. Speculation arose that his podracer might have crashed and that Kee was then captured by Jabba the Hutt, but no firm evidence of his fate was ever found.\nA male member of the Xamster species, Neva Kee was a podracer pilot who hailed from the planet Xagobah. During the year 32 BBY, Kee was present on the planet Tatooine in order to participate in the Boonta Eve Classic podrace. Flying a purple, inverted, Y-shaped podracer, Kee started on the nearside position of the last row, behind the seventeen other competitors. After the initial ceremonies, race host Jabba the Hutt officially began the Boonta.\nKee fared poorly from the get-go, and was quickly passed by Anakin Skywalker, who had actually stalled on the starting grid and got a late start. During the second lap, Kee flew off of the course in search of a shortcut, only to never be seen again. Following his disappearance, police inspector Tanivos Exantor Divo acquired a hologram image depicting Jabba the Hutt paying bounty hunter Aurra Sing near the crash site of Kee's podracer, while two of Jabba's henchmen pulled Kee out of the wreckage. All identifying authentimarks were scrubbed from the hologram, making the authenticity of the images unclear. Divo also developed a theory that Farwan \u0026 Glott, the original manufacturers of Kee's podracer, had hired Sing so that they could acquire the racer's customization secrets, which Kee had never shared.\nNeva Kee was a blue and off-white-skinned Xamster with orange eyes. During the Boonta Eve Classic, Kee attempted to cheat by finding an off-course shortcut, a maneuver that caused his disappearance. Kee also notably never shared his custom modification secrets for his podracer.\nNeva Kee flew a podracer that was a solid, rigid unit as opposed to a traditional podracer with a cockpit tethered to two engines. Instead of the cockpit being behind the engines, it was instead placed in front of them. He made special secret modifications to his podracer, but never shared them.\nNeva Kee was created for and appeared in the 1999 film Star Wars: Episode I The Phantom Menace. Despite the art department creating a lifelike maquette based on the character, only a barely seen 3D render was created for the character that was used for distant shots of Kee's podracer. Some concept art of the character was rendered by Terryl Whitlatch.\nThe 2022 StarWars.com article \"Star Wars Inside Intel: Podracing\" uses gender-neutral pronouns in reference to Kee despite him having been long established to be male.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Neva_Kee",
  "/wiki/Neva_Kee/Legends",
  "/wiki/Neva_(disambiguation)",
  "/wiki/Kee",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Xagobah",
  "/wiki/Xamster",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Podracer_(profession)",
  "/wiki/Pilot",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Podracing",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Standard_year",
  "/wiki/32_BBY",
  "/wiki/Podracer",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Species",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mos_Espa_podrace_circuit",
  "/wiki/Law_enforcement_agency",
  "/wiki/Inspector",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Hologram",
  "/wiki/Hutt",
  "/wiki/Bounty_hunter",
  "/wiki/Aurra_Sing",
  "/wiki/Farwan_%26_Glott",
  "/wiki/Eye",
  "/wiki/Cockpit",
  "/wiki/Engine",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Terryl_Whitlatch",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/2022",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Podracing",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}