{
 "name": "Nho%27Apakk",
 "display_name": "Nho'Apakk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Off-white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown",
      "pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree Village",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Nho'Apakk was an Ewok warrior from Bright Tree Village on the Forest Moon of Endor. During the Battle of Endor in 4 ABY, he helped Rebel Alliance forces defeat Galactic Empire stormtroopers. Nho'Apakk had off-white fur and wore a greenish hood. The Ewok fought with a three-pronged, wooden staff.\nNho'Apakk was a male Ewok of Bright Tree Village who served his tribe as a warrior on the Forest Moon of Endor. In 4 ABY, a small group of Rebel Alliance operatives arrived on Endor and convinced Nho'Apakk's village that the Galactic Empire, which had established a presence on the moon to support the construction of a new Death Star battlestation in the system, was a threat the Ewoks could help defeat. Nho'Apakk thus joined with his fellow Ewoks in the Battle of Endor to fight alongside the Rebel forces, and the warrior personally attacked stormtroopers sent by the Empire.\nNho'Apakk had cream-colored fur, a brown nose, pale fingers and toes, and black eyes. The Ewok preferred to avoid confrontation whenever possible, but he was willing to defend Bright Tree Village fearsomely if need be. The warrior wore a greenish hood. He fought with a wooden staff with three prongs at its tip.\nThe Nho'Apakk action figure, part of Hasbro's Star Wars: The Legacy Collection toy line, is based on an Ewok costume seen in the film Star Wars: Episode VI Return of the Jedi. The Ewok appeared in scenes shot by the second unit near Crescent City, California. During that time of production, a crewmember snapped a publicity photograph of the Ewok holding a film slate.\nHasbro released the Ewok action figure in 2009 as part of a two-pack with fellow Ewok Paploo. Nho'Apakk's description on the toy card fails to note whether the Ewok is male or female, but in official statements, Hasbro has identified him as a male. The character's portrait illustration on the figure card is a repainted version of the one used for Graak on Hasbro's Romba and Graak two-pack, released in 2007. As such, the card image does not match the appearance of the actual Nho'Apakk action figure.\nNho'Apakk is named for a Star Wars fan named Noah. In Spring 2008, Noah, then seven years old, was facing a debilitating operation from which it would take him several months to recover. The boy lived near Hasbro's headquarters, and, when the toy company heard about his impending surgery, they invited him for a tour and to discuss their Star Wars toy line. There, Noah revealed that he was a fan of the Ewoks from Return of the Jedi. Hasbro, incidentally, was in the preliminary design stages for a new pair of Ewok action figures. They showed Noah several production shots of the various Ewoks used in Return of the Jedi and asked him to choose the two he found most interesting; the boy selected Paploo and a white-furred Ewok that Hasbro staff were largely unfamiliar with. Nevertheless, they honored Noah's wishes and decided to design new action figures of his choices.\nProduction progressed by several months, and the white-furred Ewok remained unidentified. Hasbro and Lucasfilm Ltd. then realized that the character was one of several Ewoks who had not yet received official names. Hasbro proposed naming the Ewok for Noah; Lucasfilm agreed and provided the name \"Nho'Apakk\" to sound like an Ewokese version of the boy's first name and parts of his surname. Hasbro promised to give the boy the first Nho'Apakk figure from the toy's production run, and the company claimed that the whole experience strongly affected both Noah and his family. By May 2009, Noah had undergone his operation and was in recovery.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Endor/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Staff/Legends",
  "/wiki/Endor_strike_team/Legends",
  "/wiki/Operative",
  "/wiki/City/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battlestation",
  "/wiki/Endor_system/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/2009",
  "/wiki/Paploo/Legends",
  "/wiki/Graak",
  "/wiki/Romba/Legends",
  "/wiki/2007",
  "/wiki/Star_Wars",
  "/wiki/Noah",
  "/wiki/2008",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Ewokese/Legends",
  "/wiki/May",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars:_The_Ultimate_Action_Figure_Collection",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/May_1",
  "/wiki/November_5",
  "/wiki/2015",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/November_22",
  "/wiki/2012",
  "/wiki/May_8",
  "/wiki/2013",
  "/wiki/July_26",
  "/wiki/2018",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/StarWars.com"
 ]
}