{
 "name": "Nial Organa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Nial Organa was a male Human who was a member of House Organa of Alderaan.\nA male Human of Alderaan, Nial Organa was the bastard child of a scandalous affair between Tia Organa and Padawan Halagad Ventor. While Ventor abandoned the family to join the Jedi Order, Organa grew up under his mother's care and came to be acquainted with his adopted cousin, Princess Leia. When the Princess was growing up, Organa was embroiled in a succession of romantic relationships with partners considered inappropriate for a man of his rank, often covered in salacious tabvid stories. His lustful tendencies mirrored those of his mother; her marriage into House Vandron was abruptly ended by the affair that conceived young Nial.\nThe connection between Nial Organa and Tia Organa was not made explicit in any canon literature until the publication of SkyeWalkers: A Clone Wars Story in 2015. Nial and Tia Organa were linked, however, in Children of the Jedi, where Leia's thoughts segue from Cousin Nial's love-life to the scandal a generation earlier which had seen Aunt Tia's engagement to a nobleman of House Vandron abruptly broken off. This connection tentatively indicated that Nial was Tia's son—even perhaps a direct product of the earlier scandal—but in itself it did not amount to proof. Author Abel G. Peña tied this story together by revealing that Halagad Ventor was indeed the father.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Tia_Organa",
  "/wiki/Padawan/Legends",
  "/wiki/Halagad_Ventor",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Tabvid",
  "/wiki/House_Vandron",
  "/wiki/Canon",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/2015",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/Author/Legends",
  "/wiki/Abel_G._Pe%C3%B1a"
 ]
}