{
 "name": "Niano Organa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Elder Houses",
      "House of Organa",
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Niano Organa was a human male member of the House of Organa. He was the son of Duke Kayo Organa and Duchess Celly Organa, and the adoptive cousin of Princess Leia Organa.\nNiano Organa was the son of Duke Kayo Organa and Duchess Celly Organa, whose sister was Queen Breha Organa of Alderaan. He was also a cousin to Princess Leia Organa, the adopted daughter of Queen Breha and Senator Bail Prestor Organa.\nDuring the Imperial Era, Niano attended a gathering put together by the officials of the House of Organa on Alderaan. When his cousin, Leia thanked Y-O for serving her food, Niano mocked her for thanking a droid, which he saw as a lower life form. He then said that due to Leia being adopted, she would never be a true Organa. Leia countered by saying that she knew Niano only sought his father's approval and was constantly trying to impress him. This upset Niano, who left Leia alone. Later, despite her father Bail's encouragement, she refused to apologize to Niano due to his hatred toward droids.\nNiano Organa was a human male who had black hair, brown eyes, and light skin. Organa believed it was unnecessary to show kindness toward droids, which he described as lower life forms. He also did not consider Leia a true member of the House of Organa because of her adoption status.\nNiano Organa first appeared in the first episode of the television series Obi-Wan Kenobi, which premiered on May 26, 2022. While unnamed in the episode, the credits identified him as \"Cousin Niano Organa\" and as portrayed by Ian Inigo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Elder_Houses",
  "/wiki/House_of_Organa",
  "/wiki/File:Niano-KnowThings.ogg",
  "/wiki/Duke",
  "/wiki/Kayo_Organa",
  "/wiki/Celly_Organa",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/File:Niano-NotReal.ogg",
  "/wiki/Queen",
  "/wiki/Breha_Organa",
  "/wiki/Alderaan",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Imperial_Era",
  "/wiki/Y-O",
  "/wiki/Foodstuff",
  "/wiki/Droid",
  "/wiki/Parent",
  "/wiki/File:Niano-Lifeform.ogg",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/May_26",
  "/wiki/2022",
  "/wiki/Ian_Inigo",
  "/wiki/Category:Audio_files_of_Niano_Organa",
  "/wiki/Category:Images_of_Niano_Organa",
  "/wiki/Part_I",
  "/wiki/StarWars.com",
  "/wiki/May_27"
 ]
}