{
 "name": "Nib_Assek",
 "display_name": "Nib Assek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 230 BBY",
      "Starlight Beacon",
      "Eiram system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Burryaga Agaburry"
     ]
    }
   ]
  }
 ],
 "content": "Nib Assek was a human female Jedi Knight of the Jedi Order during the time of the High Republic. She took the Wookiee Burryaga Agaburry as her Padawan, learning Shyriiwook in order to better educate him in the Force. Assek and her Padawan participated in the effort to save the Hetzal system from hyperspace anomalies, flying together in a Jedi Vector.\nNib Assek was a Force-sensitive female human who joined the Jedi Order and eventually attained the rank of Jedi Knight. She eventually took the rare Wookiee initiate Burryaga Agaburry as her Padawan, learning the language Shyriiwook in order to better educate him in the Force.\nAround 232 BBY, Assek and Burryaga attended a conclave onboard the recently-completed Starlight Beacon space station, between the Jedi Order and the Galactic Republic. Afterwards, they were among dignitaries given an extensive tour of the station by its administrator, Shai Tennem. During the tour, the party encountered technicians Joss and Pikka Adren, who were hurriedly attempting to quietly locate a fault Pikka had discovered in the station's power systems. Tennem, unaware, attempted to rope the Adrens into joining the tour; however, Burryaga sensed their distress over the situation and informed Assek. She immediately suggested aloud that the Adrens be allowed to continue on with the important work they were doing, allowing the couple to locate and fix the problem before the Beacon could completely lose power.\nAfterwards, Assek and her apprentice were among many who departed the space station on the Republic cruiser Third Horizon. However, while the starship was in transit through hyperspace, a distress signal was picked up from the Hetzal system, causing the ship to divert to offer assistance. A rescue effort was formed from those onboard the Third Horizon, and Assek and Burryaga manned a two-seater Jedi Jedi Vector, with Assek piloting. The threat to the Hetzal system was comprised of large amounts of debris which had been flung out of hyperspace at great speeds and threatened all of the system's inhabited worlds. During the rescue effort, Assek and Burryaga teamed up with two other Vectors flown by Jedi Knights Mikkel Sutmani and Te'Ami, as well as a Longbeam cruiser flown by the Adrens, on an important task to destroy a chunk of debris heading for the main landmass of Hetzal Prime's Fruited Moon.\nTe'Ami took charge of the mission, bringing the weapons systems of the four ships under her control, as the Jedi joined their minds together. However, Burryaga appeared to have trouble focusing, so Assek and the other Jedi let him out of the link so they could work. Just before they fired, however, Burryaga halted the attempt, and Assek translated her apprentice into Galactic Basic Standard as he explained that they could not fire upon the approaching debris because it was a piece of a starship with living beings still onboard. Te'Ami subsequently relayed the information to Avar Kriss, who was coordinating the system-wide effort.\nNib Assek was a human female with grey hair, worn in braids. She was caring of others and her apprentice, willing to learn a language that was difficult for humans to speak in order to best teach her apprentice. She was also willing to regularly translate for Burryaga.\nNib Assek possessed enough command of the Force to attain the rank of Jedi Knight. She learned to understand Shyriiwook in order to be an effective teacher for her Padawan Burryaga. She was able to participate in a mental link with other Jedi.\nNib Assek wore Jedi robes, including set of brown robes with gold trim and another in cream-and-gold. During the effort to save the Hetzal system, she piloted a two-seater Jedi Vector.\nNib Assek first appeared in the short story \"Starlight: Part One: Go Together\" by Charles Soule, which was published in Star Wars Insider 199. She was voiced by Shannon Tyo in the 2021 audio drama The High Republic: Tempest Runner.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Nib_Assek",
  "/wiki/230_BBY",
  "/wiki/Starlight_Beacon",
  "/wiki/Eiram_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Jedi_Knight",
  "/wiki/Time",
  "/wiki/High_Republic_Era",
  "/wiki/Wookiee",
  "/wiki/Padawan",
  "/wiki/Shyriiwook",
  "/wiki/The_Force",
  "/wiki/Hetzal_system",
  "/wiki/Hyperspace",
  "/wiki/Jedi_Vector",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Initiate",
  "/wiki/232_BBY",
  "/wiki/Starlight_Beacon_conclave",
  "/wiki/Space_station",
  "/wiki/Jedi",
  "/wiki/Galactic_Republic",
  "/wiki/Administrator",
  "/wiki/Shai_Tennem",
  "/wiki/Technician",
  "/wiki/Joss_Adren",
  "/wiki/Pikka_Adren",
  "/wiki/Cruiser",
  "/wiki/Third_Horizon",
  "/wiki/Starship",
  "/wiki/Distress_signal",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Mikkel_Sutmani",
  "/wiki/Te%27Ami",
  "/wiki/Longbeam_cruiser",
  "/wiki/Hetzal_Prime",
  "/wiki/Fruited_Moon",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Avar_Kriss",
  "/wiki/Hair",
  "/wiki/Braid",
  "/wiki/Language",
  "/wiki/Jedi_robes",
  "/wiki/Starlight:_Part_One:_Go_Together",
  "/wiki/Charles_Soule",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Shannon_Tyo",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_The_Great_Jedi_Rescue",
  "/wiki/Starlight:_First_Duty",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Showdown_at_the_Fair",
  "/wiki/Deck_the_Halls",
  "/wiki/Life_Day_1",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Battle_for_Starlight",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/Halcyon_Legacy_1",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Ships_of_the_Galaxy:_The_Halcyon_Starcruiser",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/Vernestra_Rwoh",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/Death",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/A_Test_of_Strength",
  "/wiki/Standard_week",
  "/wiki/0_BBY"
 ]
}