{
 "name": "Nibber_Swoo",
 "display_name": "Nibber Swoo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Varl"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rybet"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Nibber Swoo was a male Rybet.\nThe early life of professional cabbie Nibber Swoo was a mystery. He was licensed by the government of Coruscant to travel outside the magnetic traffic-lines of the city-planet. Zooming through the city canyons in his red, open-topped Barkhetta, he had an uncanny habit of pulling up whenever someone needed a lift. Of course, if he had to evade blaster-toting pursuers, he would charge double, though often looking back over his shoulder to take a pot-shot with his trusty hold-out blaster.\nHis cousin worked for a funeral home, where he operated an organic disintegrator. After-hours, he did a roaring trade disposing of bodies for shady figures in the local underworld. As such, Nibber Swoo was often a source for secondhand information about local criminal activity.\nNibber Swoo's 'interpretations' of skylane regulations frequently put him at loggerheads with Coruscant Security Force Lieutenant Ia, who considered Swoo her professional nemesis.\nHigh-strung and irritable, Swoo would launch into a spittle-flying fury whenever he was cut off by a cargo hauler or pulled over by Coruscant Security for a speeding violation.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Varl/Legends",
  "/wiki/Rybet/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Air_taxi/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Barkhetta",
  "/wiki/Blaster/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Ia",
  "/wiki/Coruscant_and_the_Core_Worlds"
 ]
}