{
 "name": "Nico_Medina",
 "display_name": "Nico Medina",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Nico Medina was a human male captain of a Republic cruiser during the Separatist Crisis. A year before the start of the Clone Wars, he escorted Jedi Masters Mace Windu and Kit Fisto to the Fondor system, where they provided backup reinforcement to a mission headed by Jedi Knights Obi-Wan Kenobi and Bultar Swan.\nIn 23 BBY, Medina piloted a Consular-class cruiser to the planet Fondor's jungle-moon of Nallastia, in an effort to liberate the Fondorians from the machinations of Groodo the Hutt, who sought, in a bid to seize more starship-manufacturing business for himself, to destroy the Fondor Shipyards and the Fondor Spaceport and surface factories.\nAfter Captain Medina was instructed by Mace Windu to ready his starship for liftoff, when the Jedi's duties were completed at the Skull Queen's fortress, he promptly obeyed the order. Master Windu introduced Medina to the Stars of Nallastia, powerful energy-field dissipating gems that they would use to break through Fondor's defensive shields that had been activated by Groodo's Droid Control Army. Medina seemed to take this almost magical solution in stride, for he'd heard of stranger things in his career. The crew was to take the vessel directly to the Fondor Spaceport, which was to be liberated from Groodo's grasp.\nBut as the cruiser took off from the fortress landing field, Medina and his co-pilots were suddenly attacked by a venrap snake native to the surrounding jungles, causing the ship to lurch to one side and begin a nosedive to the moon's surface. The vicious purple-skinned, sharp-fanged creature coiled itself tightly around all three seated pilots, intending to crush the life out of them or perhaps kill them with its poisonous venom. Rendered unconscious, the pilots slumped forward in their seats after Master Windu and the Skull Queen, Quenelle, rushed forward to seize control of the ship again and kill the creature. The Skull Queen dealt the killing blow with her vibroblade, striking the serpent between the eyes. The snake's lifeless body flopped to the cockpit floor and slid back down the corridor and into the lounge.\nCaptain Medina and his crew maintained stable condition and were soon recovered from the unnerving encounter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Margravine",
  "/wiki/Gender",
  "/wiki/Captain/Legends",
  "/wiki/Consular-class_cruiser",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Fondor_system",
  "/wiki/Mission_to_Fondor_(Separatist_Crisis)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Fondor/Legends",
  "/wiki/Jungle/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Nallastia",
  "/wiki/Fondorian",
  "/wiki/Groodo",
  "/wiki/Hutt/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Fondor_Shipyards/Legends",
  "/wiki/Fondor_Spaceport",
  "/wiki/Skull_Queen%27s_fortress",
  "/wiki/Lost_Stars_of_Nallastia",
  "/wiki/Force_field/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Droid_Control_Army",
  "/wiki/Magic",
  "/wiki/Pilot/Legends",
  "/wiki/Venrap",
  "/wiki/Snake/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Skull_Queen",
  "/wiki/Quenelle",
  "/wiki/Death",
  "/wiki/Vibroblade/Legends",
  "/wiki/Cockpit/Legends",
  "/wiki/Star_Wars_Adventures_3:_The_Hostage_Princess",
  "/wiki/Star_Wars_Adventures_1:_Hunt_the_Sun_Runner",
  "/wiki/Star_Wars_Adventures_2:_The_Cavern_of_Screaming_Skulls"
 ]
}