{
 "name": "Nida Korsin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Born",
     "values": [
      "4995 BBY",
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4896 BBY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Nida Korsin was a Human female member of the planet Kesh's Lost Tribe of Sith who eventually became Grand Lord of the dark side order. Korsin was born the daughter of Grand Lord Yaru Korsin and his wife, Seelah, and was delivered into a unique family dynamic—Yaru had killed Seelah's previous husband several years before Korsin's birth, and Seelah married him in an effort to secure the futures of herself and her son, all while planning Yaru's downfall. While Seelah tried to suppress Korsin's training in the Sith ways, Korsin secretly learned the dark side through subterfuge by her father and was groomed to eventually succeed him. An avid uvak-rider, she was placed in charge of the Skyborn Rangers riding club, which also served as a military force in preparation for an anticipated armed uprising by Seelah and her son, Jariad. In 4975 BBY, that finally came to pass. Although Yaru was fatally wounded in the battle, Korsin and her Skyborn Rangers turned the tide and crushed the coup attempt. Korsin subsequently became the new Grand Lord, ushering in an unprecedented golden age for the Lost Tribe. She died heirless in the year 4896 BBY, after a seventy-nine-year reign, her passing ending the dynastic system of succession in the Lost Tribe.\nA Force-sensitive Human female, Nida Korsin was born in 4995 BBY, the daughter of Yaru and Seelah Korsin, on the remote planet of Kesh. Both of Korsin's parents were crewmembers of the Sith starship Omen—in 5000 BBY, while on a Lignan mining mission at the height of the Great Hyperspace War, the Omen crash-landed on Kesh after a Jedi attack. The survivors of the Omen disaster established a planetary government as a new Sith organization known as the Lost Tribe of Sith, of which Korsin's father, once captain of the Omen, was named Grand Lord. Seelah was originally married to Yaru's half-brother, Devore, who survived the crash of the Omen along with Korsin's parents, only to die at Yaru's hand after an attempt to seize power. In an effort to ensure the positions of herself and her son, Jariad, Seelah married her husband's killer and bore Nida, all while planning Yaru's downfall. Although Korsin was Seelah's only daughter, Korsin's mother only saw her as a genealogical detail and actively tried to restrict Korsin's training in the Sith ways, while grooming Jariad as the future Grand Lord.\nIn what was ostensibly a gesture of Sith trust in the Keshiri natives, the young Nida Korsin was boarded in one village after another with a series of Keshiri nurse-maids and tutors, preventing her from receiving anything more than rudimentary training in the dark side of the Force. However, Yaru found a way around Seelah's machinations. The Grand Lord staged the deaths of several loyal subordinates who taught Korsin in secret during the night. During the day, Korsin, who became an able rider of the avian uvak beasts indigenous to Kesh, served as an aerial ambassador amongst the Keshiri, giving her an opportunity to win friends among the natives and build a network of informants. Secretly, she was being groomed to eventually take control of the Lost Tribe, all right under her mother's nose.\nIn 4975 BBY, for Korsin's twentieth birthday, she was placed in charge of an uvak-riding club known as the Skyborn Rangers. Although they appeared to be nothing more than a group of hobby-riders, the Skyborn Rangers were all trained Sith warriors and were secretly prepared to defend Grand Lord Yaru in case of an anticipated armed uprising by Seelah and Jariad. Although over the last twenty-five years the Lost Tribe had made efforts to find a way off Kesh, by then they had given up and committed to live amongst the Keshiri for good. Their intentions were declared in a massive celebration in the capital city of Tahv, featuring a grand entrance on uvak-back by Korsin and her Rangers, which was met with a mixed reception.\nIn her capacity as head of the Skyborn Rangers, Korsin became close with the group's traveling stable master, Tona Vaal, son of Korsin family friend Adari Vaal. As Korsin would soon learn, Vaal was member of a Keshiri resistance group led by his mother that was ready to strike and carry out their plan to overthrow Sith rule. Their plan involved the theft of thousands of uvak vital to Sith control, which would be sent to their deaths to set up an armed uprising. However, Vaal fell for Korsin and divulged the details of the plot to her, allowing her to prevent most of the uvak from being stolen.\nAt the same time, she and her Skyborn Rangers were called in for their main purpose. After thwarting the resistance's efforts, Korsin rushed to the Kesh Sith Temple with her compatriots on uvak-back—Seelah and Jariad had attacked. Although Yaru valiantly fought back, by the time Korsin arrived her father was wounded and cornered. Igniting her lightsaber, Korsin jumped into the fray, and she and her Rangers turned the tide of the battle. In a final stand, Yaru tried to throw Jariad off a precipice, but when he failed, Korsin did it for him, killing her brother. Seelah was wounded and knocked unconscious in an explosion, and lost the use of her legs. In his last act, Yaru commended his legacy to Korsin, a change ratified by the three surviving Sith High Lords, officially making her the new Grand Lord.\nIn the first hours of her Grand Lordship, Korsin made several declarations in accordance with her father's final wishes: henceforth, although not including Seelah, the spouse and household laborers of the Grand Lord would be executed upon the ruler's death. In Seelah's case, Korsin ordered for the immediate withdrawal of the Sith from the Temple, leaving her mother there to live out the rest of her days alone. When Seelah awoke hours after the battle's end, Korsin was at her side and broke the news.\nKorsin received another gift from her father—a map of a previously unknown continent far across the sea, discovered from examination of the last visual data taken by the Omen twenty-five years prior. Knowing that the continent was inhabited, Korsin was sworn to keep its existence a secret, only to be revealed when the people truly needed to know. She went on to have a celebrated reign as Grand Lord, initiating a golden age for the Lost Tribe. She eventually married a man who became her Lord Consort, and in 4960 BBY they had a son, Donellan. Although Donellan was in line to assume his mother's position, Korsin went on to outlive her son, who had waited too long to make his move. Heirless, she abolished the dynastic system, instead instituting succession based on merit. Korsin went on to reign for seventy-nine years—still regarded as a record as of 3000 BBY—and eventually died in 4896 BBY. In honor of her reign, the Festival of Nida's Rise, held every seventy-nine years, was instituted. By 3000 BBY, Korsin and her father were the most celebrated figures on Kesh, depicted in statues and monuments all over the land.\nAlthough she outwardly appeared to be harmless and even somewhat bumbling, Nida Korsin was secretly a cunning and capable leader of Sith. She was charismatic and found it easy to win people over, earning her the allegiance of dozens of friends and informants—exemplified by her charming of Tona Vaal, who subsequently revealed the Keshiri resistance's hidden plans to her. Being very active in the community, Korsin sought to create a public image of being rugged and lively, publicly leading the Skyborn Rangers and wearing clothes to represent herself that way. As her father, Yaru's, heir, Korsin was very loyal to the Grand Lord, coming to his rescue and saving him from Seelah's and Jariad's attack. Meanwhile, she reflected her mother's cold attitude toward herself, abandoning her to die alone in the isolated Kesh Sith Temple.\nDespite her mother's best efforts, Nida Korsin learned the dark side of the Force in secret, eventually becoming adept in the ways of the Sith. In addition, she was extremely skilled with a lightsaber, mowing down with ease Seelah's and Jariad's forces in the battle near the Kesh Sith Temple. Korsin was also a capable uvak rider, an ability she employed in her capacity with the Skyborn Rangers. After her father's death, she showed herself to be an excellent leader and governor, bringing the Lost Tribe of Sith into an unparalleled golden age.\nAlthough Nida Korsin was first mentioned in Lost Tribe of the Sith: Paragon, the third eBook in John Jackson Miller's Lost Tribe of the Sith series, she made her first appearance in the series' next installment, Savior. Korsin was also mentioned in four subsequent sequels: Purgatory, Sentinel, Pantheon, and Secrets, and was also referenced in the 2012 reference book The Essential Reader's Companion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Kesh",
  "/wiki/4995_BBY",
  "/wiki/4896_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Planet/Legends",
  "/wiki/Grand_Lord",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Yaru_Korsin",
  "/wiki/Marriage/Legends",
  "/wiki/Seelah_Korsin",
  "/wiki/Korsin_family",
  "/wiki/Duel_near_the_Omen",
  "/wiki/Devore_Korsin",
  "/wiki/Standard_year/Legends",
  "/wiki/Jariad_Korsin",
  "/wiki/Sith_training",
  "/wiki/Sith/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Uvak",
  "/wiki/Skyborn_Rangers",
  "/wiki/4975_BBY",
  "/wiki/Death/Legends",
  "/wiki/Duel_near_the_Kesh_Sith_Temple",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Sith_dreadnaught",
  "/wiki/Omen",
  "/wiki/5000_BBY/Legends",
  "/wiki/Lignan_crystal",
  "/wiki/Mining/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Skirmish_over_Phaegon_III",
  "/wiki/Captain/Legends",
  "/wiki/Keshiri",
  "/wiki/Nurse/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Nose/Legends",
  "/wiki/Birthday/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Tahv",
  "/wiki/Tona_Vaal",
  "/wiki/Adari_Vaal",
  "/wiki/Keshiri_resistance",
  "/wiki/Keshiri_uprising_in_Keshtah",
  "/wiki/Time/Legends",
  "/wiki/Kesh_Sith_Temple",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Limb/Legends",
  "/wiki/High_Lord",
  "/wiki/Standard_hour/Legends",
  "/wiki/Alanciar",
  "/wiki/Ocean/Legends",
  "/wiki/Nida_Korsin%27s_consort",
  "/wiki/Grand_Consort",
  "/wiki/4960_BBY",
  "/wiki/Donellan",
  "/wiki/3000_BBY",
  "/wiki/Festival_of_Nida%27s_Rise",
  "/wiki/Clothing/Legends",
  "/wiki/Sith_Temple",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Lost_Tribe_of_the_Sith:_Paragon",
  "/wiki/EBook",
  "/wiki/John_Jackson_Miller",
  "/wiki/Star_Wars:_Lost_Tribe_of_the_Sith",
  "/wiki/Lost_Tribe_of_the_Sith:_Savior",
  "/wiki/Lost_Tribe_of_the_Sith:_Purgatory",
  "/wiki/Lost_Tribe_of_the_Sith:_Sentinel",
  "/wiki/Lost_Tribe_of_the_Sith:_Pantheon",
  "/wiki/Lost_Tribe_of_the_Sith:_Secrets",
  "/wiki/2012",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Lillia_Venn",
  "/wiki/3960_BBY",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/Lost_Tribe_of_the_Sith:_Skyborn",
  "/wiki/Candra_Kitai",
  "/wiki/Dann_Itra",
  "/wiki/Varner_Hilts",
  "/wiki/Darish_Vol"
 ]
}