{
 "name": "Nierre",
 "display_name": "Nierre",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jelucan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nierre family"
     ]
    }
   ]
  }
 ],
 "content": "Nierre was the last name of the father of the Nierre family, a human family that lived on the planet Jelucan during the reign of the Galactic Empire. They were the descendants of the first wave of settlers who had been exiled to Jelucan for remaining loyal to their king. Like his family, he had blonde hair and pale white skin. When Ciena Ree was thirteen years old, he was accused of abusing his position as Imperial communications monitor by reporting on private meetings and messages. As a result, a complaint was filed to the local Imperial governor.\nSince it was a taboo to have one's honor questioned in Jelucan first-wave culture, the other families showed their solidarity to the Nierres by planting flags outside their house and sending a family member to stay with them. Like her family, Ciena believed that no one should want to hide information from the Empire and that the Nierres' accusers were dishonorable. Nierre's family's honor was also at stake, since it was believed they would have to bear the stain of his disgrace forever if the complaint was upheld.\nIn the end, Nierre's accusers backed down and accepted the Imperial version of events. Nierra, his family, and their supporters including the Rees celebrated the Nierre family's acquittal.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jelucan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nierre_family",
  "/wiki/Parent",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/King",
  "/wiki/Hair",
  "/wiki/Ciena_Ree",
  "/wiki/Standard_year",
  "/wiki/Governor",
  "/wiki/Ree_family",
  "/wiki/Lost_Stars",
  "/wiki/Lost_Stars_(audiobook)"
 ]
}