{
 "name": "Niev_Jaub",
 "display_name": "Niev Jaub",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Niev Jaub was a Sullustan trader that operated on Nar Shaddaa. He specialized in delivering exotic foods to the Hutt casinos that were established on the moon. When Moff Sarn Shild decided to make an example of Nar Shaddaa, the smugglers banded together to try to repulse the attack. Even though he was an honest businessman, Niev Jaub decided to join the smugglers and add his little freighter Bnef Nlle to the rag-tag force being assembled by Mako Spince. The feeling of responsibility was strong within him, seeing that he had many friends and family members present on Nar Shaddaa, and he couldn't let them all die without a fight.\nNiev was part of the First Strike Element that lay hidden among the debris field surrounding Nar Shaddaa, waiting for the Carrack-class light cruiser Vigilance to arrive. Unfortunately, Niev jumped the gun and attacked too soon when he saw Falan Iniro's ship leave its hiding place among the debris.\nNiev realized his mistake right away and knew that Bnef Nlle was not fast enough to flee from Vigilance and its TIE escort. Instead, he made the heroic choice and dove into the Carrack's port side, causing the shields to weaken and allowing the rest of the smuggler fleet to destroy it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullust/Legends",
  "/wiki/4_BBY/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Sarn_Shild",
  "/wiki/Bnef_Nlle",
  "/wiki/Mako_Spince",
  "/wiki/Carrack-class_light_cruiser/Legends",
  "/wiki/Renthal%27s_Vigilance",
  "/wiki/Falan_Iniro",
  "/wiki/TIE/LN_starfighter",
  "/wiki/The_Hutt_Gambit",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}