{
 "name": "Nightsister_Matriarch",
 "display_name": "Nightsister Matriarch",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 11 ABY and 19 ABY",
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Nightsisters"
     ]
    }
   ]
  }
 ],
 "content": "The \"Nightsister Matriarch\" was a Human female Nightsister native to the planet Dathomir and active during the administration of the New Republic. In that time, the Matriarch led a group of Nightsisters in an attack on the planetary base that belonged to the Imperial warlord X1. Soon enough, the New Republic's Grey Squadron joined the fight. During the battle, the Matriarch confronted Jedi Knight X2 and was killed by him.\nThe \"Nightsister Matriarch\" was a title held by a pale-skinned Human female Dathomiri Witch of the Nightsisters sect who lived on the planet Dathomir during the sovereignty of the New Republic. During this time, the Imperial warlord X1 established a facility on the planet, where he conducted experiments with cloning. X1 eventually fled the planet, and the Nightsisters, led by the Matriarch, overran the facility. While the Nightsisters fought X1's troops outside the base, the Matriarch, riding a rancor, infiltrated the facility itself.\nAt some point between 11 ABY and 19 ABY, the New Republic's Grey Squadron, led by Jedi Knight X2, arrived on the planet in search of X1. Fighting through the Nightsisters, Grey Squadron reached the entrance to the base. Sensing the Matriarch's presence, X2 left his men at the entrance to provide backup and went inside alone. Breaking through a wall, the Matriarch attacked X2, but he was able to kill the rancor. She subsequently charged X2 with her lightsaber and the Force, but the Jedi Knight prevailed and killed her as well.\nThe Nightsister Matriarch was a skilled practitioner of the dark side of the Force, and her dark presence was strong enough to be sensed by X2. She utilized a red-bladed lightsaber in battle and was adept at telekinesis. The Matriarch was also able to control her rancor and used it in the fight against X2.\nThe Nightsister Matriarch appears as a boss in the Nintendo DS edition of the 2009 video game Star Wars Battlefront: Elite Squadron.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Dathomir/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Gender/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Planet/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Time/Legends",
  "/wiki/Mission_to_Dathomir_(Galactic_Civil_War)",
  "/wiki/X1%27s_Dathomir_base",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/X1",
  "/wiki/Grey_Squadron",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/X2",
  "/wiki/Death/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Gray",
  "/wiki/Squadron/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Red",
  "/wiki/Telekinesis/Legends",
  "/wiki/Animal_bond",
  "/wiki/Nintendo_DS",
  "/wiki/2009",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Battlefront:_Elite_Squadron",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Pellaeon%E2%80%93Gavrisom_Treaty"
 ]
}