{
 "name": "Nik_Sant",
 "display_name": "Nik Sant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Special Forces Trackers Unit",
      "Special Forces Trackers Unit"
     ]
    }
   ]
  }
 ],
 "content": "Nik Sant was a male human who served in the military of the Alliance to Restore the Republic during the Galactic Civil War. By the time of the Battle of Endor in 4 ABY, Sant was one of the most veteran scouts in the Rebel Alliance.\nNik Sant served the Alliance to Restore the Republic during the Galactic Civil War, and by 4 ABY he was one of the most veteran scouts in the Alliance Military. That year, the Rebel Alliance launched a decisive attack against the Galactic Empire during the Battle of Endor, where they intended to destroy the Empire's second Death Star superweapon. Sant, one of the Pathfinders, was part of a strike team led by General Han Solo that was tasked with destroying the shield generator that powered the Death Star's shield.\nTheir operation was a success, allowing Alliance forces to destroy the orbiting Death Star and fracture the Empire. Prior to the ground battle proper, he donned the armor of a captured scout trooper and took up the trooper's post at the shield generator bunker. Though the Imperials saw through his disguise and captured him, along with the rest of the strike team, he was saved when the local Ewok tribe ambushed the Imperials, allowing Solo and the rest of the Rebels to destroy the shield generator.\nNik Sant was, by 4 ABY, an older male human with light skin, white hair, and a white beard. During the Battle of Endor, he wore the typical military uniform worn by members of the Pathfinders.\nNik Sant appeared briefly as a member of Han Solo's strike team in the 1983 film Star Wars: Episode VI Return of the Jedi. He was first identified as Nik Sant in The Official Star Wars Fact File 44 in 2002. According to a continuity polaroid from Return of the Jedi, he was portrayed by one \"L. Burner.\"\nThe similarities between Sant's appearance and that of the former Clone Captain Rex, a character who appears in both the Star Wars: The Clone Wars and Star Wars Rebels television series, stoked speculation that Sant and Rex could be the same character. In 2016, at a screening of the second season finale of Star Wars Rebels, executive producer Dave Filoni speculated that the \"bearded old guy on Endor,\" Nik Sant, could be Rex, suggesting it did not make any sense for there to be an \"old guy\" on Endor unless it was someone like Rex. The Rebels series finale, which aired on March 5, 2018, confirmed that Rex did fight at the Battle of Endor, but did not go so far as to confirm that Rex and Sant are the same character. Six months after the episode's airing, Filoni revealed in an interview with IGN he ultimately chose to not canonize the theory because he felt that laying down an already established character prior to his coming to Star Wars wasn't correct, adding that Rex could have been present at Endor and not be Sant, even though some fans could choose to believe that Sant and Rex are the same individual while others choose to not do so.\nIn recreations of shots from Return of the Jedi in the Star Wars Galaxy of Adventures short \"Han Solo - From Smuggler to General,\" Rex is used instead of Sant wearing clone trooper armor. Rex also appears in original shots in the short. Because Galaxy of Adventures shorts are not meant to be taken as literal events, no official source has currently definitively stated that Sant and Rex are the same character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Nik_Sant",
  "/wiki/Nik_Sant/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/Alliance_Military",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Scout",
  "/wiki/Galactic_Empire",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Endor_strike_team",
  "/wiki/General",
  "/wiki/Han_Solo",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/Orbit",
  "/wiki/Scout_trooper",
  "/wiki/Bright_Tree_Village",
  "/wiki/Hair",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_Official_Star_Wars_Fact_File_44",
  "/wiki/2002",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_Rebels",
  "/wiki/2016",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Dave_Filoni",
  "/wiki/March_5",
  "/wiki/2018",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Han_Solo_-_From_Smuggler_to_General",
  "/wiki/Clone_trooper_armor",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Exit_from_Endor",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Star_Wars:_Destiny_Two-Player_Game",
  "/wiki/Star_Wars:_Legion",
  "/wiki/Leia_Organa_Commander_Expansion",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Endor_and_the_Fall_of_the_Empire",
  "/wiki/Shattered_Empire_1",
  "/wiki/March_30",
  "/wiki/August_6",
  "/wiki/2020",
  "/wiki/March_14",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/August_12",
  "/wiki/May_24",
  "/wiki/Matt_Martin",
  "/wiki/File:MattMartinGoA.jpg"
 ]
}