{
 "name": "Nik_Hepho",
 "display_name": "Nik Hepho",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Britarro"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Nik Hepho was a Britarro male who worked as a bounty hunter during the reign of the Galactic Empire. He specialized in hunting members of the outlawed Church of the Force and, after working in the Inner Rim and on the planet Coruscant, traveled to the moon Jedha to hunt down more suspected adherents. Hepho was present in Jedha City shortly before it was destroyed by the Empire's Death Star superweapon.\nNik Hepho worked as a bounty hunter, specializing in tracking down adherents of the Church of the Force, a religion outlawed by the Galactic Empire. His skill gained him some renown in the Inner Rim, and he hunted in the depths of the planet Coruscant until he considered that area empty of targets. Hepho then traveled to the moon of Jedha with a list of suspected Church members compiled by the Imperial Security Bureau that he had bought on the black market.\nWhile on Jedha, Hepho kept his starship, the Apostate, hovering in orbit under the control of a droid intelligence with which he maintained contact via a backpack-mounted long-range transmitter. In the year 0 BBY, he walked past the Disciple of the Whills Silvanie Phest and one of her fellow disciples in Jedha City, shortly before the entire city was destroyed by the Empire's Death Star superweapon. Hepho was mentioned in an artist's journal, which was restored, expanded, and displayed by the Graf Archive at some point after 34 ABY.\nA Britarro, Nik Hepho had smooth, blue skin and green eyes with no hair. Hepho's unmistakable skin tone made him hard to miss.\nWhile on Jedha, Hepho wore a yellow coat and gloves with a gray shirt and brown pants, and made use of a metallic headpiece and a BlasTech A310 rifle with a perforated, air-cooling barrel-shroud. He wore a backpack-mounted long-range transmitter that allowed him to keep in contact with his starship, the Apostate.\nNik Hepho first appeared in the 2016 Anthology film, Rogue One: A Star Wars Story. The film did not identify Hepho, but his name was provided by Star Wars: Rogue One: The Ultimate Visual Guide, a reference book written by Pablo Hidalgo and released on the same day as the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Britarro",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Church_of_the_Force",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Jedha_City",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Hunting",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Black_market",
  "/wiki/Starship",
  "/wiki/Apostate",
  "/wiki/Orbit",
  "/wiki/Droid_brain",
  "/wiki/Backpack",
  "/wiki/Transmitter",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Disciples_of_the_Whills",
  "/wiki/Silvanie_Phest",
  "/wiki/City",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/34_ABY",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Glove",
  "/wiki/BlasTech_Industries",
  "/wiki/A310_rifle",
  "/wiki/Barrel-shroud",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Time/Legends",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com"
 ]
}