{
 "name": "Nik_Deleru",
 "display_name": "Nik Deleru",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Nik Deleru was a Nautolan Male living on Coruscant during the time of the Cold War. While on Coruscant his mate, Ria, left him. Nik believed her departure to be due to a kidnapping by the Migrant Merchants' Guild but instead his mate chose to work in the employ of the guild, dancing in their headquarters. Her departure led Nik to seek the help of the Coruscant Security Force. While arguing with Police Officer Mal, Deleru enlisted the help of an individual to locate Ria.\nNik was highly possessive, often seeing his mate, Ria, as a possession rather than a person, even referring to her as his \"most prized possession\". He was also very outspoken, a trait which did not endear him to Coruscant security.\nThe quest to locate Ria in Star Wars: The Old Republic has two basic endings. The light side choice has the player choosing to let Ria go, with Nik being told she was either taken off world, that she left him, or that she's dead. The dark side choice forces Ria to return to Nik, who sends her back to their homeworld; Ria manages to escape this fate by disappearing while the transport is docked on another world. Nik then believes she was kidnapped again.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nautolan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Ria_Deleru",
  "/wiki/Migrant_Merchants%27_Guild",
  "/wiki/Migrant_Merchants%27_Guild_headquarters",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/Mal",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Nik_Deleru",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}