{
 "name": "Nils_Tothwin",
 "display_name": "Nils Tothwin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Jaundiced"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Nils Tothwin was a human male who served as an Imperial Navy lieutenant during the Galactic Civil War. He served under Admiral Rae Sloane on board the Imperial-class Star Destroyer Vigilance.\nNils Tothwin served the Galactic Empire as a lieutenant in the Imperial Navy. He served under Admiral Rae Sloane on board the Imperial-class Star Destroyer Vigilance. Sloane considered Tothwin a poor excuse for an Imperial, believing that all the best officers had died at the Battle of Endor.\nIn the aftermath of the Battle of Endor, the Vigilance was stationed above the planet Akiva in preparation for a meeting on the planet between surviving Imperials. Prior to the meeting, the Star Destroyer encountered the HH-87 Starhopper Rover above the planet. Sloane ordered that Tothwin have the Rover pulled in by the tractor beam after its pilot, Wedge Antilles, claimed to be a dead Devaronian named Gev Hessan. Tothwin did as ordered and prepared to fire at the ship if it tried to launch a proton torpedo at the Vigilance. The Rover did not fire, but self-destructed upon reaching the Star Destroyer, leading Tothwin to believe the pilot was dead. Sloane believed otherwise and ordered that he be found.\nImmediately after the summit was concluded, the Vigilance and two other Star Destroyers became embattled against a fleet of five New Republic ships. During this battle, Admiral Sloane was attempting to board the Vigilance in the yacht of Arsin Crassus. Tothwin sent her a transmission during this time, although it was cut short when the Vigilance received major damage to its bridge. The Vigilance was subsequently destroyed during the battle.\nNils Tothwin was a jaundiced human male. Though in service to the Empire, Admiral Sloane believed he did not exemplify the best of the Imperial Military.\nNils Tothwin first appeared in the 2015 novel Aftermath, written by Chuck Wendig.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Aftermath_(novel)",
  "/wiki/Lieutenant",
  "/wiki/Galactic_Civil_War",
  "/wiki/Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Vigilance_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Imperial_officer",
  "/wiki/Death",
  "/wiki/Battle_of_Endor",
  "/wiki/Endor",
  "/wiki/Planet",
  "/wiki/Akiva",
  "/wiki/Emergency_summit_on_Akiva",
  "/wiki/Star_Destroyer",
  "/wiki/Mission_to_Akiva",
  "/wiki/HH-87_Starhopper",
  "/wiki/Rover",
  "/wiki/Tractor_beam",
  "/wiki/Pilot",
  "/wiki/Wedge_Antilles",
  "/wiki/Devaronian",
  "/wiki/Gev_Hessan",
  "/wiki/Starship",
  "/wiki/Proton_torpedo",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/New_Republic",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Yacht",
  "/wiki/Arsin_Crassus",
  "/wiki/Bridge_(starship)",
  "/wiki/Imperial_Military",
  "/wiki/2015",
  "/wiki/Chuck_Wendig",
  "/wiki/Aftermath_(audiobook)"
 ]
}