{
 "name": "Nils_Cridmeen",
 "display_name": "Nils Cridmeen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Nils Cridmeen was a Human male mechanic who lived during the Galactic Civil War.\nIn 1 ABY, Nils Cridmeen was present on the planet Dathomir when an accident took place in the Imperial Research and Prison Facility. The Blackwing virus that was studied there escaped containment and decimated most of the people in the area, turning them into starving undead creatures. In response, the Galactic Empire promptly established a Quarantine Zone to contain the infection. The few people who survived the initial virus outbreak, including Nils Cridmeen, were trapped in the Quarantine Zone. The survivors established camps in order to to repel the regular assaults of the zombies and try to live in safety while waiting for an evacuation.\nNils Cridmeen took shelter in Camp Epsilon, the most unsafe camp since it was located in the courtyard of the Imperial Research and Prison Facility, the place where lived the most dangerous undeads. Other survivors in the camp at that time included the former prisoner Zsu Val, the technician Sogan Varga, the Inquisitor Klex Fulgor, and the stormtroopers GT-643, KD-121 and HX-138. Nils Cridmeen and HX-138 expected to be able to fix a Lambda-class shuttle present in the camp in order to allow the survivors to escape the Quarantine Zone.\nAt some point, a group of spacers visited Camp Epsilon during their journey in the Quarantine Zone. They intended to help HX-138 in order to get the support of HX-138 and her stormtroopers to access the research facility. HX-138 thus tasked the spacers to find parts to repair the damaged Lambda shuttle: power converters, a computer core memory, a spinal trunk and fuel cells. The spacers explored the Quarantine Zone and collected the needed parts on the wreckage of crashed shuttles and brought them to Nils Cridmeen. The mechanic started the repairs while the spacers entered the research facility. The spacers survived to their mission and finally came back to Camp Epsilon. In the meantime, Nils Cridmeen was able to fix the Lambda-class shuttle. The refugees of Camp Epsilon and the spacers eventually escaped the Quarantine Zone altogether with the repaired shuttle.\nNils Cridmeen was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Nils Cridmeen was added to the game with the \"Game Update 14\", a.k.a. the \"Death Troopers\" update, released on October 12, 2009.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Blackwing_virus_outbreak_on_Dathomir",
  "/wiki/Imperial_Research_and_Prison_Facility",
  "/wiki/Imperial_bioweapons_Project_I71A",
  "/wiki/Zombie/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Quarantine_Zone_(Dathomir)",
  "/wiki/Camp_Epsilon",
  "/wiki/Zsu_Val",
  "/wiki/Sogan_Varga",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Klex_Fulgor",
  "/wiki/Stormtrooper/Legends",
  "/wiki/GT-643",
  "/wiki/KD-121",
  "/wiki/HX-138",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/October_12",
  "/wiki/2009",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}