{
 "name": "Nim",
 "display_name": "Nim",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Vestar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireLightning Battalion",
      "Lightning Battalion"
     ]
    }
   ]
  }
 ],
 "content": "Nim was a pudgy Imperial general in the Lightning Battalion.\nTwo years before the Battle of Yavin, Nim participated in the campaign against the Icarii on Vestar; although Colonel Abal Karda was in command of the Imperial forces in the field, Nim had overall command of the campaign. His troops wiped out the native Icarii species completely using a biological agent specific to the species that dissolved their internal organs. In the end only one of them was left, the sorceress Queen Selestrine. In revenge for the destruction of her people, she predicted that Nim would soon experience a sudden and unexpected death that would arrive soon after his victory. Abal Karda was very pleased about this prediction since he planned to take over the General's position and get up to the top of the Imperial chain of command.\nOnly moments after this prediction was made, Nim visited the colonel in his quarters and informed him that Lord Darth Vader was very pleased about the progress of the Icarii Campaign and intended to offer Karda a promotion to General, just as Selestrine had predicted. There was only one hitch: Vader had heard of the only surviving Icarii and claimed the casket that contained the head of the sorceress for himself.\nRealizing that he would lose his secret weapon, Karda flew into a rage and pushed Nim away forcefully when he stepped forward to take the casket, causing the general to stumble and accidentally impale himself on a sword he had knocked off the table. The colonel panicked, shooting dead Nim's guards and fleeing the planet with Selestrine's casket, resulting in his classification as an Enemy of the Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/General/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Nym/Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Vestar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lightning_Battalion",
  "/wiki/Beez",
  "/wiki/Boba_Fett:_Enemy_of_the_Empire",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Icarii",
  "/wiki/Colonel/Legends",
  "/wiki/Abal_Karda",
  "/wiki/Queen/Legends",
  "/wiki/Selestrine",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Icarii_Campaign",
  "/wiki/Boba_Fett:_Enemy_of_the_Empire_1",
  "/wiki/Boba_Fett:_Enemy_of_the_Empire_3",
  "/wiki/Aurra_Sing:_Dawn_of_the_Bounty_Hunters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_27",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}