{
 "name": "Nina_Galfridian",
 "display_name": "Nina Galfridian",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Artorias"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Outer Rim Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Nina Galfridian was a Yuuzhan Vong Shamed One female and Queen of Artorias living with her Human husband Caled and his two children Finn and Kaye when the Yuuzhan Vong invaded in 25 ABY. She and her stepdaughter were captured by the invaders, while Caled was left behind and Finn was recruited by Luke Skywalker for Jedi training to aid in the war. She later bonded with the Heart of Artorias, after its liberation by the Artorian refugees.\nHow and when Nina entered the galaxy is not known, but she was present by 6 ABY, at which time she was enslaved to the Duros Dowron. She remained Dowron's slave for two years, at which point he tried to settle on Artorias. The planet's king, Caled Galfridian, retook control from Dowron's thugs, and forced Dowron to deactivate her slave control chip. Nina immediately killed Dowron with her bare hands, and shortly afterward seduced Caled.\nPrior to the invasion of Artorias Nina and her stepdaughter Kaye were shopping in the marketplace. While talking with her friend Jenny, a large explosion rocked the marketplace, shattering merchandise and flinging debris across the square. Jenny was severely wounded by the flying debris and collapsed in Nina's arms. As Yuuzhan Vong warriors entered and marched towards them, Nina ordered Kaye to flee the marketplace. She reluctantly did so, promising to return with her father while Nina attempted to staunch Jenny's wounds. The warriors killed or captured everyone who remained in the market, seizing Nina and the fallen Jenny as well.\nMeanwhile, Kaye was knocked down by a Yuuzhan Vong warrior as she left the market square. Despite the warrior's armor and size, Kaye was able to kill him due to his arrogance. However she was captured as well shortly thereafter. Nina would be reunited with her stepdaughter when both Galfridians, Jenny, and other Artorians were imprisoned aboard a Yuuzhan Vong slaveship, an event which her stepson Finn sensed through the Force Nina's husband Caled and Finn attempted to rescue her and her Kaye but were forced to retreat to a hangar where they were besieged by a Yuuzhan Vong force. However they were rescued by Jedi Master Luke Skywalker who took Finn and the refugees toward transport ships offplanet. Caled however, decided to remain on Artorias, organizing an attack force to strike at the invaders. Finn was recruited by Skywalker for Jedi training at the Jedi Praxeum on Yavin 4 after demonstrating his Force ability when he sensed his family in danger.\nNina, Kaye, and the other captives were transferred to the slaveship, Tsam P'ah where they were held in awful conditions. While she tended to Jenny's wounds, a Yuuzhan Vong warrior approached the queen and demanded that she serve the commander of the ship. Asking for medical supplies to treat Jenny's wounds, Nina was rebuffed by the Yuuzhan Vong who again demanded that she serve the commander of the vessel. Responding that she served only the Artorian people, the warrior struck her for her refusal. Her stepdaughter Kaye stepped in and offered herself up to the commander. Jenny said that she could have gone, to which Nina replied that she had been a slave once and would not be one again. Nina informed Kaye that Jenny had died, after she had returned from her meeting.\nThe sense of loss that Nina experienced from Jenny's death, coupled with the belief that she had also lost her stepson and husband led Nina into a catatonic state. Kaye was unable to bring her out of it, though she was certain to entrust her care to the Artorian prisoners while she formulated a plan to wrest control of the Tsam P'ah from the control of Commander Sha'kel.\nAs the prisoners began to fight back, Kaye entrusted a few of the Artorians to keep the queen out of the battle. Avoiding her carers, Nina was able to look out onto Artorias and, seeing it in flames, realized that her husband was still alive and fighting the Yuuzhan Vong. The realization allowed her to come out of her catatonic state and join Kaye after the Tsam P'ah was captured. Telling her stepdaughter that she was proud of her, she decided to link with the Tsam P'ah, in order to gain control of the vessel feeling that this was her burden rather than inflicting another one on her stepdaughter. In spite the pain of the bonding process, Nina was able to take control of the vessel, jumping it into hyperspace and ramming a couple of Yorik-Vec assault cruisers in the process.\nNina later brought the renamed Heart of Artorias out of hyperspace and aided in the defeat of the Yuuzhan Vong forces attacking the Dibrook Space Station. During this time, she engaged in a battle of wills with the yammosk installed on Dibrook that was attempting to regain control of the Heart of Artorias. As a consequence of the yammosks continual attempts to reassert control of its wayward ship, Nina landed some distance away from the life signs that the refugees had detected as she was uncertain if she could resist if they were any closer to the source.\nNina was controlling the Heart during the Battle of Dibrook. She was contacted via villip by Commander Tsalok who demanded that she return the Yuuzhan Vong ship. Nina denied to do so, and taunted the commander on his retreat from Dibrook. He revealed that he was going after the queen's son, Finn. When Kaye and Arbeloa came upon prisoners being transformed into thralls, the queen ordered them to pull back immediately and proceeded to use the Heart to bombard the compound, killing many captives and leaving the New Republic forces with a single survivor rescued from the base.\nDespite her royal status, Nina Galfridian was content to go about the marketplace and shop like any other Artorian. She demonstrated great loyalty and bravery in the face of danger when she remained with her wounded friend Jenny rather than run from the oncoming Yuuzhan Vong warriors. While imprisoned aboard the Tsam P'ah, Nina demonstrated her responsibility to her people when she refused to serve the Yuuzhan Vong commander of the ship, claiming that as queen, she could only serve the Artorian people. The sense of loss she experienced after the conquest of Artorias, initially led her into a catatonic state, but she possessed enough mental strength to come out of it and even resist the telepathic commands of Dibrook's yammosk. She is also fiercely maternal and despite not even being the same species as her step-children, she still sees them as her own and is immensely caring and protective of them.\nNina Galfridian was created by Tom Taylor and illustrated by Colin Wilson for the Star Wars: Invasion comic series. The comic series features the Galfridian family as they become separated during the Yuuzhan Vong War. In Invasion 1, Nina is revealed to be the Queen of Artorias.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Invasion:_Rescues_5",
  "/wiki/Artorias",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Outer_Rim_Alliance",
  "/wiki/Shamed_Ones",
  "/wiki/Queen/Legends",
  "/wiki/Human/Legends",
  "/wiki/Caled_Galfridian",
  "/wiki/Finn_Galfridian",
  "/wiki/Kaye_Galfridian",
  "/wiki/Battle_of_Artorias",
  "/wiki/25_ABY/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Heart_of_Artorias",
  "/wiki/The_galaxy/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Dowron",
  "/wiki/Standard_year/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jenny_(Artorias)",
  "/wiki/Warrior_caste",
  "/wiki/Slaveship",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sha%27kel",
  "/wiki/Catatonia",
  "/wiki/Revolt_aboard_the_Tsam_P%27ah",
  "/wiki/Cognition_throne",
  "/wiki/Yorik-vec_assault_cruiser",
  "/wiki/Battle_of_Dibrook",
  "/wiki/Dibrook_Space_Station",
  "/wiki/Yammosk",
  "/wiki/Dibrook",
  "/wiki/Villip",
  "/wiki/Tsalok",
  "/wiki/Thrall",
  "/wiki/Tom_Taylor",
  "/wiki/Colin_Wilson_(artist)",
  "/wiki/Star_Wars:_Invasion",
  "/wiki/Invasion_1",
  "/wiki/Category:Images_of_Nina_Galfridian",
  "/wiki/Star_Wars:_Invasion:_Refugees",
  "/wiki/Invasion:_Rescues_1",
  "/wiki/Invasion:_Rescues_2",
  "/wiki/Invasion:_Rescues_3",
  "/wiki/Invasion:_Rescues_4",
  "/wiki/Invasion:_Rescues_6",
  "/wiki/Star_Wars:_Invasion:_Revelations",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_117",
  "/wiki/Star_Wars_Insider_124",
  "/wiki/Star_Wars_Insider_126",
  "/wiki/Invasion_2",
  "/wiki/Invasion:_Revelations_5",
  "/wiki/Invasion_3",
  "/wiki/Invasion_4",
  "/wiki/Invasion_5"
 ]
}