{
 "name": "Niner",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Vassek 3"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Fil's squad",
      "Fil's squad"
     ]
    }
   ]
  }
 ],
 "content": "\"Niner\" was the nickname of a clone trooper who served within the Grand Army of the Republic during the Clone Wars. In 21 BBY, Niner was a part of a Galactic Republic squad of clone troopers commanded by Jedi Knight Nahdar Vebb and Clone Commander Fil, which was ordered to search for the escaped Trade Federation Viceroy, Nute Gunray, on the third moon of the Vassek system. While on Vassek 3, he served alongside a Republic task force led by Jedi General Kit Fisto, but was killed while attempting to request reinforcements after the task force came into an encounter with Kaleesh Separatist Alliance General Grievous.\n\"Niner\" was the adopted name of a clone trooper created on the world of Kamino to serve within the Grand Army of the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. At some point in the war, Niner later came to serve as part of a squad of Republic clone troopers under the leadership of Jedi Knight Nahdar Vebb and Clone Commander Fil. During his service to the Republic, in 21 BBY, following the escape of Trade Federation Viceroy, Nute Gunray, from Republic custody, Niner was dispatched alongside a task force to the third moon of the Vassek system in an effort to locate and return Gunray to the Republic.\nWhile on Vassek 3, upon the task force's entry of a concealed fortress following the arrival of Jedi General Kit Fisto, Niner was instructed alongside fellow clone trooper known as \"Bel\" to watch after their Nu-class attack/transport shuttle and Fisto's starfighter. As the task force advanced deeper into the fortress, which they had discovered to be the citadel of the Kaleesh Separatist General Grievous, Niner and Bel contacted their Clone Commander and reported Grievous's arrival in the star system, which allowed the task force to prepare an ambush for the Kaleesh.\nHowever, while the Republic forces suffered mounting losses, the two clone troopers were ordered to request reinforcements from the fleet stationed at the planet Bestine IV. But while preparing to send their transmission, the pair was killed alongside their shuttle's destruction as an IG-100 MagnaGuard fired an RPS-6 rocket launcher.\nAs a human clone of the bounty hunter, Jango Fett, Niner was 1.83 meters in height. Niner displayed a sense of compliance with instructions relayed from a superior officer.\nA trooper of the Grand Army of the Republic, Niner wore a personalized set of Phase I clone trooper armor, with his helmet customized with red markings, while his armor plating bore a series of red patches. During his service to the Republic Army, his helmet was equipped with a pair of flashlights as well as communicator attached to his left arm plate. He was also armed with a DC-15A blaster rifle.\n\"Niner\" was introduced in \"Lair of Grievous,\" the tenth episode of the first season of the Star Wars: The Clone Wars television series, which aired on December 12, 2008. As well as all clone troopers in the series, Niner was voiced by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Niner",
  "/wiki/Niner/Legends",
  "/wiki/Nahdar_Vebb",
  "/wiki/Clone_Sergeant",
  "/wiki/O%27Niner",
  "/wiki/Kamino",
  "/wiki/21_BBY",
  "/wiki/Vassek_3",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Fil%27s_squad",
  "/wiki/File:RequireReinforcements-LoG.ogg",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Trooper",
  "/wiki/Commanding_officer",
  "/wiki/Jedi_Knight",
  "/wiki/Clone_Commander",
  "/wiki/Fil",
  "/wiki/Mission_to_Vassek_3",
  "/wiki/Trade_Federation",
  "/wiki/Viceroy",
  "/wiki/Nute_Gunray",
  "/wiki/Vassek_system",
  "/wiki/Task_force",
  "/wiki/Jedi_General",
  "/wiki/Kit_Fisto",
  "/wiki/Death",
  "/wiki/Kaleesh",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/File:LookAfterTheShips-LoG.ogg",
  "/wiki/Planet",
  "/wiki/Rescue_on_the_Tranquility",
  "/wiki/Grievous%27s_fortress",
  "/wiki/Bel",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Kit_Fisto%27s_Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Star_system",
  "/wiki/Fleet",
  "/wiki/Bestine_IV",
  "/wiki/Shuttle",
  "/wiki/IG-100_MagnaGuard",
  "/wiki/RPS-6_rocket_launcher",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Officer",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Helmet",
  "/wiki/Armor",
  "/wiki/Glowrod",
  "/wiki/Comm_unit",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/Lair_of_Grievous",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/December_12",
  "/wiki/2008",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Category:Audio_files_of_Niner",
  "/wiki/Category:Images_of_Niner_(clone_trooper)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Databank_A-Z",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Blue_Shadow_Virus",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Standard_year",
  "/wiki/Tarkin_(novel)"
 ]
}