{
 "name": "Ninth_Sister",
 "display_name": "Ninth Sister",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dowut"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dowutin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right leg"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Sidious",
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "The Ninth Sister, formerly known as Masana Tide, was a female Dowutin who once served the Jedi Order before joining the Galactic Empire as a member of the Inquisitorius. In the early days of the Imperial Era, the Ninth Sister accompanied Darth Vader, the Sixth Brother, and the Tenth Brother to the planet Mon Cala to hunt the Jedi Padawan Ferren Barr. Later, she accompanied the Second Sister to hunt down the fugitive Padawan Cal Kestis. However, Kestis defeated her in a duel on Kashyyyk.\nOriginally a member of the Jedi Order, Masana Tide used the Force to empathetically connect with others and detect their emotions. After surviving Order 66, she was isolated, being tortured until she cracked. Later known as the Ninth Sister, she became a member of Emperor Palpatine's Inquisitorius program and was trained alongside the Seventh Sister, Fifth Brother, Sixth Brother, and Eighth Brother by the Grand Inquisitor in the Inquisitorius Headquarters on Coruscant. They soon fell under the command of Darth Vader when Darth Sidious introduced the Inquisitorius to Vader, who continued their training in the ways of the dark side of the Force. During her training with Vader, the Ninth Sister lost her left eye as a lesson of loss.\nSometime later, the Ninth Sister accompanied Vader to investigate claims that an individual had used the Force to get out of a bar fight on Cabarria. Before entering, the Ninth Sister asked Vader why he was investigating this, as there had been many recent Jedi reports that had turned out as misjudgments. She exclaimed that she should have been the one checking it out and sending back a report. Vader told the Ninth Sister that she should be pleased with his assistance and in their following trade of words, she deduced that Vader was there in case they got lucky and found a Jedi.\nVader told the Ninth Sister to remain outside the bar unless he called upon her. However, once Vader entered the bar, a family of bounty hunters attacked the Dark Lord. They had taken a bounty on Vader unknowingly placed by someone from the very heart of the Republic Executive Building on Coruscant. They set off an ion grenade and destroyed Vader's lightsaber, leading Vader to contact the Ninth Sister to request her to bring him her lightsaber. The Ninth Sister, however, ignored the call, blaming the ion pulse for frying her comm.\nEventually, the family was forced to withdraw from the fight as their ray shields would eventually run out, and Vader was killing even the patrons of the bar to prevent them from attacking him. As the family fled the bar, they held the Ninth Sister at blaster point until Ramat Cha acquired and started up a speeder. As the family escaped, Vader arrived and accused the Ninth Sister of attempting to have him killed. The Ninth Sister told Vader that she had not been the one to place the bounty, suggesting to Vader that one of the other Inquisitors may have done so. Vader ordered the Ninth Sister to remain outside the bar until he returned from dealing with the bounty hunters and told the Ninth Sister that he would kill her if she attempted to flee.\nShe then traveled with Vader back to Coruscant aboard his ship, when their transmitter was jammed, halting their ability to send clearance codes to the surface. This caused Coruscant's defenses to mobilize and fire missiles at their ship. The Ninth Sister was unable to shake them off and Vader took control of the ship. They were hit by one of them, and they managed to crash land on Coruscant. Vader then ordered Ninth Sister to stay with the ship whilst he dealt with the matter at hand. Vader uncovered one of the culprits and executed him and four others in front of the other high ranking Imperials.\nIn 18 BBY, Ninth Sister went with Sixth Brother and Tenth Brother to assist Vader on a mission to Mon Cala. Their objective was to investigate whether a possible Jedi had been influencing King Lee-Char's negotiations with the Empire and with them they took fourteen Purge Troopers. Upon their arrival at Dac City, Ninth Sister was confronted by the king's Chief of Security, Gial Ackbar. Ackbar asked of their business and Ninth Sister gave him a writ that legally protected the Inquisitors from harm. Ackbar told her it was an outrage and she told him to take it up with Vader as he approached them. Ackbar continued questioning for their business on Mon Cala until Vader told him they were searching for a possible enemy of the Empire on Mon Cala. Ackbar denied the possibility but as he said that, a shuttle carrying the ambassador exploded, killing all on board. Vader and the Inquisitors passed Ackbar and walked down from the landing pad.\nThe ambassador's death prompted Governor Wilhuff Tarkin to send Imperial forces down to Mon Cala. The Mon Calamari Guard began defending their cities. The Ninth Sister fought them on the landing pad at Dac City where they secured the area. Ninth Sister asked Vader where they were to go next and he told her that they were heading to the palace. She then asked him if why they would find the Jedi there, to which Vader said they were there for Lee-Char, hoping they could obtain the Jedi's location from him.\nAfter slaying the guards, they entered the palace and took Lee-Char prisoner. Ninth Sister then interrogated him for the location of the Jedi. Before long, a school of large creatures rose through the sea level, generating a wave large enough to rip through the city. The other two Inquisitors attempted to hold it off but even when Vader joined them, the wave was too strong. The Ninth Sister and the others were swept away.\nThe Ninth Sister survived the wave, as did the Inquisitors and all but two of their troopers. They took an Imperial submarine and found Vader in the Great Ungeness Trench under the ocean. Vader asked of Lee-Char and the Ninth Sister said they didn't know but then told him that she had obtained the Jedi's location. They set a course for the location immediately.\nAs they reached the location, they caught the Jedi and his six disciples evacuating their refuge. The group of them scattered, excluding one who attacked the submarine with his blaster. Vader crushed the acolyte's helmet and they began pursuing the others. Another disciple sacrificed himself to slow them down. The submarine kept going despite this and soon reached Bel City where two more disciples waited to slow the group down. As they marched down the corridors, Vader received a transmission from Moff Wilhuff Tarkin, with a request to capture the King in return for a favor at some later date. Vader acquiesced and ordered the rest of the squad to continue as planned while he went to find the King. The Inquisitors did as instructed and continued to find the Jedi and his last two disciples at a dead end. Sixth Brother cut one of them down and the Jedi came forward to confront them.\nAfter an exchange of words with Ferren Barr, he revealed that he not only knew that they were all former Jedi but knew the role the clones played in the destruction of the Jedi Order. The Ninth Sister rebuffed all of this saying that their past no longer affected them. Barr stated otherwise, saying that despite their turn to the dark side they were still Jedi underneath. Barr then used a mind trick on the clones, telling them to execute Order 66.\nBarr's mind trick worked and the clones turned on the three Inquisitors. After Tenth Brother was shot fatally in the chest, Barr Force jumped over the fight between the Inquisitors and clones with his acolyte Verla escaping through the only exit. Wanting to chase after them, Ninth Sister and the Sixth Brother used their combined strength to Force push the clones out of the way, with most of them falling off the deck. As the two began to make their way out, Sixth Brother betrayed Ninth Sister, severing her leg and leaving her behind as a distraction for the remaining clones so he could escape. As the Sixth Brother ran off mockingly wishing her good luck, Ninth Sister swore she would get her revenge on him. However, the Ninth Sister never got the chance as the Brother was killed by the former Jedi Padawan Ahsoka Tano on the moon of Raada during the latter's quest for power sources for her new lightsabers.\nThe Ninth Sister survived Mon Cala and was given a cybernetic right leg. In 14 BBY, the Ninth Sister traveled to the planet Bracca with the Second Sister and some Purge Troopers in search of a possible Jedi named Cal Kestis. Halting a train carrying members of the Scrapper Guild, the Second Sister confronted the passengers. She told them of the Jedi fugitive and threatened the execution of the whole group if the Jedi was not turned over. As the Purge Troopers took aim at the Scrappers, the Abednedo Prauf spoke out, shaming the Empire as a whole for overworking the Scrapper Guild. The Second Sister then killed Prauf, and his friend Cal Kestis reacted by trying to cut her down with his lightsaber, revealing himself as the Jedi. She blocked the Jedi's attack and lifted him with the Force, throwing him to the Ninth Sister. The Ninth Sister then held him above a ledge, proclaiming that she found the Jedi, before Cal ignited his lightsaber causing her to drop him in surprise.\nKestis, however, survived the fall and landed onto another train. As he proceeded towards the front of the train, the Ninth Sister, in her ship, shot at the tracks, causing the train to fall. After Kestis was able to find safety on a platform, the Second Sister confronted him, but he escaped when Cere Junda, aboard the Stinger Mantis, intervened and extracted him before the Second Sister could finish him off.\nSince the encounter on Bracca, the Second Sister dedicated her time to hunting Kestis while the Ninth Sister struggled to see why she found him so important. After Kestis fought with Saw Gerrera's Partisans on Kashyyyk, the Second and Ninth Sisters took part in a counter attack to drive Gerrera off-world. The Ninth Sister told the Grand Inquisitor that she did not think Kestis would return to the world. She was proven wrong when Kestis began climbing the Origin Tree there. The Ninth Sister, in her ship, confronted him at the tree, expressing her feelings of his return to Kashyyyk. She then proceeded to chase him in her ship, shooting at the Jedi padawan periodically. However, a Shyyyo bird appeared and attacked the Ninth Sister's ship, driving it away from Kestis.\nAfter driving the Ninth Sister away, the Shyyyo bird began helping Kestis climb the Origin Tree after he tended to one of its wounds. When they were at the bird's nest, however, the Ninth Sister attacked, driving the Shyyyo bird away and confronting Kestis. She expressed her desire to kill him quickly, believing him to be an unworthy opponent. The pair then engaged in a fierce duel, the Ninth Sister using just one blade. However, Kestis soon slashed the Ninth Sister in the left leg and arm, causing her to cry out in pain and ignite her second blade. After the two fought some more, Kestis was able to cut off her right hand, disarming her. Using the force originating from her caterised wounded hand to hold her lightsaber, stating that the Inquisitiors were trained in special abilities. The Ninth Sister continued to fight Kestis, expressing her wish to turn Kestis into an inquisitor through torture like she and the other former Jedi. As she grew more angry, Kestis outmaneuvered her and slashed her in the back. The Ninth Sister continued to advance on him, but Kestis flipped behind her and pushed her with the Force through the branches behind, sending her falling out of the nest.\nWhilst atop the Origin Tree, Kestis communicated with Junda back on the Mantis, asking her if she had known the Ninth Sister before the Jedi Purge. Cere responded in the negative, stating that she could only guess what she had been like before. Kestis then discussed the Ninth Sister's perspective on fighting the Empire and how hopeless it would ultimately turn out. Junda then mentioned her theory that all Inquisitors were former Jedi who had been turned via fear and torture, emphasizing the temptation of giving into absolutes under the suffering caused by the Empire. Kestis acknowledged the possibility of her theory, mentioning the Ninth Sister's enthusiasm in making others suffer.\nWhen Kestis spoke to Greez Dritus while standing just outside the Mantis on Kashyyyk, Dritus brought up Kestis' impressive feat in outrunning a TIE fighter. Kestis then mentioned that it had carried the Ninth Sister, a revelation which horrified Dritus who brought up the ramifications of more Inquisitors like the Second Sister coming after them.\nIn the years following the fall of the Galactic Empire, Jedi Master Luke Skywalker traveled the galaxy to rediscover the history of the Jedi Order that had been suppressed by the Empire. In his search for knowledge, Skywalker became aware of the Ninth Sister's existence. During his self-imposed exile on Ahch-To, Skywalker wrote a book he titled The Secrets of the Jedi, which chronicled the information he had learnt on his travels. The Ninth Sister was one of several Inquisitors who were depicted in the book as illustrations, alongside information pertaining to the Inquisitorius.\nA hulking individual, the Ninth Sister was a female Dowutin with brown skin and white eyes, the left of which was lost during a training session with Darth Vader. She had two small horns on her chin and her fingers had black claws on the ends. As an Inquisitor, the Ninth Sister was dangerous and imposing. She was good at reading people with the Force, being able to deduce Vader's intentions of joining her on Cabarria. She later refused to assist Vader when he asked for her help in a fight with bounty hunters.\nMuch like her fellow Inquisitorius, the Ninth Sister was a Jedi hunter who hunted down the remaining members of the Jedi Order. She went to refuse any kind of remembrance and connection to the very same order to which she once belonged, believing herself to not be one of those who kept memories and that the past no longer affected her. The Ninth Sister was also arrogant and overconfident, as shown when she fought against the fugitive Padawan Cal Kestis on Kashyyyk, taunting him that she wouldn't like to fight herself as well and that he wasn't worthy of her time.\nHer training to become an Inquisitor was a time of torture, as she described to Cal Kestis what it was like while also pointing out her role as an Inquisitor had taught her that no setback was too great. After Kestis cut off her hand, the Ninth Sister shrugged it off after the initial shock, claiming that after one loses their self a limb is easy, and considered taking him and threatening that he would be broken down just as she and the other Inquisitors were.\nThe Ninth Sister was powerful in the Force, and possessed extraordinarily empathic abilities to read minds, which further enhanced her mastery on the Force. This ability became even more potent when she converted to the dark side of the Force. However, she lacked the strength in combat that some of the other Inquisitors possessed, although her life surpassed the Tenth Brother during the fighting in Bel City. She was able to successfully fend off a group of Purge troopers despite losing a leg.\nThe Ninth Sister was able to successfully interrogate King Lee-Char of Mon Cala, for the location of a hiding Jedi, in time as a large wave swept them away soon after. While less agile than other Inquisitors, the Ninth Sister utilized her brute strength, massive size and Jedi training to gain any advantage over her opponents. She was able to put up a considerable fight against the more agile Cal Kestis on Kashyyyk, and kept on fighting despite the loss of her right hand and lightsaber wounds to her limbs and back, showing that she had high tolerance for pain.\nThe Ninth Sister's lightsaber was a double-bladed spinning lightsaber, a type which all the Inquisitors, excluding the Tenth Brother, utilized. She wore a black helmet with two red visors covering each of her eyes. The Ninth Sister wore a black, skin-tight body suit which had silver lines trailing vertically down her chest, back and limbs. Around her waist was a kama of six metal armor plates which protected her thighs. On her back, she could attach her lightsaber to keep it within arm's reach. She was given a cybernetic right leg after the Sixth Brother's betrayal. She utilized a TIE/rp Reaper attack lander as her personal starship.\nThe Ninth Sister first appeared, albeit unnamed, in Darth Vader  6, a comic book written by Charles Soule, illustrated by Giuseppe Camuncoli, and released on October 4, 2017. Her design was credited to the aforementioned penciller Camuncoli, the inker Cam Smith, and the colorist David Curiel.\nThe Ninth Sister was identified in Darth Vader  11. In Darth Vader  16, the Ninth Sister and Sixth Brother's former names are revealed to be Masana Tide and Bil Valen, although the comic did not specify which character had which name. The 2018 reference book Star Wars: The Dark Side later confirmed the Ninth Sister to be Masana Tide. Although her former name is never mentioned directly in Star Wars Jedi: Fallen Order, an achievement is entitled \"Her name was Masana Tide!\" which is automatically awarded and displayed on the screen upon defeating the Ninth Sister on Kashyyyk.\nIn Fallen Order, she was voiced and motion-captured by Misty Lee.\nAlthough she already had a design, the Ninth Sister's appearance was updated for the video game Jedi: Fallen Order to accommodate for the finer detail needed in the game. Efforts were made to include the features that made her design recognizable, including the raised shoulder pads, the red visor, the three chest stripes, and the layered skirt. The base material used in the design was referenced from the Imperial military uniforms seen in the Star Wars original trilogy. The final concept design was created by Jordan Lamarre-Wan, the lead concept artist for the game. The Ninth Sister's in-game model was created by senior character artist Vince Rizzi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sister_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Ninth_Sister",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Dowut",
  "/wiki/Dowutin",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitorius",
  "/wiki/Darth_Sidious",
  "/wiki/Anakin_Skywalker",
  "/wiki/Standard_day",
  "/wiki/Imperial_Era",
  "/wiki/Brother/Sister",
  "/wiki/Battle_of_Dac_City",
  "/wiki/Sixth_Brother",
  "/wiki/Tenth_Brother",
  "/wiki/Planet",
  "/wiki/Mon_Cala",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ferren_Barr",
  "/wiki/Second_Sister",
  "/wiki/Secret_mission_to_rebuild_the_Jedi_Order",
  "/wiki/Cal_Kestis",
  "/wiki/Liberation_on_Kashyyyk",
  "/wiki/Lightsaber_duel",
  "/wiki/Kashyyyk",
  "/wiki/Force_power",
  "/wiki/The_Force",
  "/wiki/Force_empathy",
  "/wiki/Order_66",
  "/wiki/Torture",
  "/wiki/Galactic_Emperor",
  "/wiki/Seventh_Sister",
  "/wiki/Fifth_Brother",
  "/wiki/Eighth_Brother",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Inquisitorius_Headquarters",
  "/wiki/Darth",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Eye",
  "/wiki/Unidentified_bar_(Cabarria)",
  "/wiki/Cabarria",
  "/wiki/Cantina",
  "/wiki/Chas",
  "/wiki/Bounty_hunter",
  "/wiki/Assassination_attempts_on_Darth_Vader",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Bounty",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Coruscant",
  "/wiki/Ion_grenade",
  "/wiki/Kirak_Infil%27a%27s_lightsaber",
  "/wiki/Ninth_Sister%27s_lightsaber",
  "/wiki/Ray_shield",
  "/wiki/Blaster",
  "/wiki/Ramat_Cha",
  "/wiki/Speeder",
  "/wiki/Vader%27s_starship",
  "/wiki/Transmitter",
  "/wiki/Missile",
  "/wiki/Starship",
  "/wiki/Barokki",
  "/wiki/18_BBY",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/Purge_Trooper",
  "/wiki/Dac_City",
  "/wiki/King",
  "/wiki/Chief_of_Security",
  "/wiki/Gial_Ackbar",
  "/wiki/Shuttle",
  "/wiki/Telvar",
  "/wiki/Ambassador",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Imperial_Military",
  "/wiki/Mon_Calamari_Guard",
  "/wiki/City",
  "/wiki/Dac_City_palace",
  "/wiki/Prisoner",
  "/wiki/Mind_probe_(Force_power)",
  "/wiki/Unidentified_Mon_Cala_creature",
  "/wiki/Ocean",
  "/wiki/Cloning",
  "/wiki/Imperial_submarine",
  "/wiki/Great_Ungeness_Trench",
  "/wiki/Ferren_Barr%27s_cave_refuge",
  "/wiki/Nipaltoo",
  "/wiki/Submarine",
  "/wiki/Helmet",
  "/wiki/Orvek",
  "/wiki/Bel_City",
  "/wiki/Moff",
  "/wiki/Daren",
  "/wiki/Mind_trick",
  "/wiki/Skirmish_in_Bel_City",
  "/wiki/Force_jump",
  "/wiki/Verla",
  "/wiki/Force_push",
  "/wiki/Dismemberment",
  "/wiki/Ahsoka_Tano",
  "/wiki/Moon",
  "/wiki/Raada",
  "/wiki/Kyber_crystal",
  "/wiki/Ahsoka_Tano%27s_white_lightsabers",
  "/wiki/14_BBY",
  "/wiki/Bracca",
  "/wiki/Train",
  "/wiki/Scrapper_Guild",
  "/wiki/Death_penalty",
  "/wiki/Scrapper",
  "/wiki/Abednedo",
  "/wiki/Prauf",
  "/wiki/Jaro_Tapal%27s_lightsaber",
  "/wiki/Cere_Junda",
  "/wiki/Stinger_Mantis",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Origin_Tree",
  "/wiki/Shyyyo_bird",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Greez_Dritus",
  "/wiki/New_Republic_Era",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Ahch-To",
  "/wiki/The_Secrets_of_the_Jedi",
  "/wiki/Horn",
  "/wiki/Jedi_training",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/Kama",
  "/wiki/TIE/rp_Reaper_attack_lander",
  "/wiki/Darth_Vader_(2017)_6",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/October_4",
  "/wiki/2017",
  "/wiki/Cam_Smith",
  "/wiki/David_Curiel",
  "/wiki/Darth_Vader_(2017)_11",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/2018",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Misty_Lee",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Jordan_Lamarre-Wan",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Darth_Vader_(2017)_12",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Darth_Vader_(2017)_15",
  "/wiki/Darth_Vader_(2017)_17",
  "/wiki/Star_Wars_(2020)_5",
  "/wiki/Category:Images_of_the_Ninth_Sister",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Marvel_Comics"
 ]
}