{
 "name": "Nippet",
 "display_name": "Nippet",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown and white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree tribe"
     ]
    }
   ]
  }
 ],
 "content": "Nippet was an Ewok of the Bright Tree tribe on the moon of Endor. In 4 ABY, Nippet hid in fear when the protocol droid C-3PO was raised into the air above the Bright Tree Village center by the Jedi Luke Skywalker in an attempt to scare the Ewoks into freeing Skywalker and his companions from captivity. The wokling later listened to C-3PO tell stories of Skywalker's adventures and squeaked in terror when the droid described the Sith Lord Darth Vader.\nNippet was an Ewok of the Bright Tree tribe that lived in Bright Tree Village on the forest moon of Endor. In 4 ABY, Nippet was just a small wokling when a scouting party led by the Ewok Teebo returned with a group of rebels that had been caught in one of the tribe's net traps. The Ewoks of the village had mistaken one of the captives, the protocol droid C-3PO, for the deity known as the Golden One and so seated him on a throne in the village center, where Nippet was seated in a basket. As Nippet watched the proceedings, an adult Ewok stroked the wokling's head.\nThe tribe then prepared to sacrifice the captives in C-3PO's honor, placing the humans Han Solo and Luke Skywalker over cooking fires to be made part of a grand banquet for the droid. Skywalker then had C-3PO tell the Ewoks to spare his companions, warning that he would otherwise become angry. When the Ewoks ignored the threat, Skywalker used the Force to lift the droid into the air, causing the Ewoks present to panic. As C-3PO floated above the platform, Nippet squealed in terror and hid within the basket.\nAfter the Ewoks had freed the captives, Nippet was among the residents of the village that gathered in Chief Chirpa's hut with their new allies to listen to C-3PO tell stories of Skywalker's various adventures in fighting the Galactic Empire. During the storytelling, Nippet was held in the arms of a brown furred Ewok who stood next to Widdle Warrick. After the droid introduced the Sith Lord Darth Vader and recreated the sound of his breathing, Nippet let out a yelp of terror. Once the story was finished, Chirpa made the former captives into members of the tribe and agreed to help the rebels in their fight against the Empire.\nNippet was scared by the apparent demonstration of C-3PO's divine powers and the droid's description of Darth Vader but was fascinated by the adventure, heroism, and sound effects in C-3PO's story. The wokling had brown and white fur, black eyes, and light skin.\nNippet first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The wokling was portrayed via puppet with a sheet foam body, plastic eyes, and a foam latex face, ears, and hands, all covered in faux fur. In the bottom of the puppet there is an opening for a puppeteer's hand, and a puppeteering wire in the wrists and neck allows for movement. The dimensions when sitting are 53.5 centimeters by 35.75 centimeters by 38 centimeters . As of 2019, when the puppet was sold for £22,500 at auction, the prop had some fading to the paint throughout, the rubber was fragile from age, and there was rusting to the puppeteering wire. The Ewok village scenes were filmed between January 18 and February 2, 1982 on Stage 3 at Elstree Studios.\nIn the new Star Wars canon, the wokling was first named in Return of the Jedi: Beware the Power of the Dark Side!, a 2015 adaptation of Return of the Jedi written by Tom Angleberger. The name was misspelled as \"Nippett\" in the adaptation, but the correct spelling was later used in the 2017 reference book Star Wars: Geektionary: The Galaxy from A - Z. The name originated in the Star Wars Legends continuity, where it was first used for a recurring Ewok character in the Ewoks television series. Nippet first appeared in the episode \"The Haunted Village,\" which aired on September 14, 1985, and was first named in the episode \"The Travelling Jindas,\" which aired on October 5, 1985. The wokling seen in Return of the Jedi was established to be Nippet by an action figure of the character released as part of the Star Wars: The Legacy Collection toy line by Hasbro Inc. in 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nippet",
  "/wiki/Nippet/Legends",
  "/wiki/Endor",
  "/wiki/Ewok",
  "/wiki/Color",
  "/wiki/Bright_Tree_tribe",
  "/wiki/File:NippetScream.ogg",
  "/wiki/Moon",
  "/wiki/4_ABY",
  "/wiki/3PO-series_protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Telekinesis",
  "/wiki/Bright_Tree_Village",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Gender",
  "/wiki/Heroes_of_Yavin",
  "/wiki/Wokling",
  "/wiki/Protocol_droid",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/File:Nippet-EEK.ogg",
  "/wiki/File:Woklings_AEYNTK.jpg",
  "/wiki/Forest",
  "/wiki/Scout",
  "/wiki/Teebo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Deity",
  "/wiki/Golden_One",
  "/wiki/Throne",
  "/wiki/Human",
  "/wiki/Han_Solo",
  "/wiki/Fire",
  "/wiki/The_Force",
  "/wiki/Droid",
  "/wiki/Atmosphere",
  "/wiki/File:NippetStories.png",
  "/wiki/Chief",
  "/wiki/Chirpa",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Limb",
  "/wiki/Hair",
  "/wiki/Widdle_Warrick",
  "/wiki/Darth_Vader%27s_armor/Canon",
  "/wiki/Battle_of_Endor",
  "/wiki/Darth",
  "/wiki/Eye",
  "/wiki/File:NippetPuppet.jpg",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/2019",
  "/wiki/January_18",
  "/wiki/February_2",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/Star_Wars",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/2015",
  "/wiki/Tom_Angleberger",
  "/wiki/2017",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/The_Haunted_Village",
  "/wiki/September_14",
  "/wiki/1985",
  "/wiki/The_Travelling_Jindas",
  "/wiki/October",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Hasbro_Inc.",
  "/wiki/2008",
  "/wiki/Category:Audio_files_of_Nippet",
  "/wiki/Category:Images_of_Nippet",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_172",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/The_Star_Wars_Archives:_Episodes_IV%E2%80%93VI,_1977%E2%80%931983",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_4",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/March_17",
  "/wiki/2021",
  "/wiki/The_Making_of_Star_Wars:_Return_of_the_Jedi",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27"
 ]
}