{
 "name": "Niriian",
 "display_name": "Niriian",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Niriian was a Togruta female individual who served as a Science officer in the New Republic. She was in a romantic relationship with Ensign Deltura.\nNiriian served as the Science officer aboard the New Republic Defense Fleet's Carrack-class light cruiser Oculus in the months following the Battle of Endor. She had a romantic relationship with Ensign Deltura. Under Deltura's orders, Niriian launched the Viper probe droid BALK1 to explore the debris field created by the comet Kinro, which devastated the Core Worlds eons ago. After launching the probe, she began monitoring the atmospheric data. Deltura then invited her for dinner and bed, which she accepted.\nLater, Niriian and Deltura were together when they informed Admiral Ackbar by hologram that one of their probe droids above Akiva had recorded the destruction of transport carrying New Republic Special Forces soldiers. Analyzing the footage, Niriian and Deltura believed that Sergeant Major Jom Barell was the sole survivor. Since Barell had deployed his parawings too early, Niriian believed that he had a low chance of survival. Ackbar then ordered Niriian and Deltura to keep monitoring the situation on Akiva.\nDespite Niriian's assessment, Jom survived the fall and played a role in the successful rebellion on Akiva.\nNiriian was a cold, efficient business woman. She studied everyone around her like they were winged-insects pinned to a board. She kept her head-tails pulled back behind her with a small black cord.\nNiriian first appeared as a supporting character in Chuck Wendig's 2015 novel Aftermath, which was part of the Journey to Star Wars: The Force Awakens promotional series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Togruta",
  "/wiki/Gender",
  "/wiki/New_Republic",
  "/wiki/Science_officer",
  "/wiki/Ensign",
  "/wiki/Ardin_Deltura",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Carrack-class_light_cruiser",
  "/wiki/Oculus",
  "/wiki/Battle_of_Endor",
  "/wiki/Viper_probe_droid",
  "/wiki/BALK1",
  "/wiki/Kinro",
  "/wiki/Core_Worlds",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Akiva",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/Sergeant_major",
  "/wiki/Jom_Barell",
  "/wiki/Parawings",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Limb",
  "/wiki/Insect",
  "/wiki/Lekku",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(novel)",
  "/wiki/Journey_to_Star_Wars:_The_Force_Awakens",
  "/wiki/Aftermath_(audiobook)"
 ]
}