{
 "name": "Nittel_Karkson",
 "display_name": "Nittel Karkson",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Nittel Karkson, nicknamed \"Nit,\" was a young Gotal male who lived on Coruscant level 4000 with his grandmother during the High Republic Era. Karkson was extremely poor and, as a result, turned to thievery to support himself and his grandmother.\nDuring the Coruscant Solstice Tide of 232 BBY, Karkson traveled to the upper levels to steal from patrons participating in the Solstice festivities. Karkson's criminal actions were seen by Jedi Master Stellan Gios, who began to follow Karkson. Karkson fled to the lower levels of Coruscant, where Gios found him surrounded by members of the Norikus gang attempting to take Karkson's loot. Gios saved Karkson from the gang members and retrieved Karkson's loot, making him promise never to steal again. Karkson then returned home to his sick grandmother, unaware that Gios was following him. Upon entering Karkson's home, Gios realized that Karkson was stealing items in an attempt to sell the items later to purchase supplies and materials for his sick, elderly grandmother. Gios then gave the grandmother his Jedi robe, which would keep her warm. Karkson and his grandmother thanked Gios as he turned to leave, but before he could, Karkson asked if he would stay for dinner—stating it would be an honor to host the Jedi. Gios happily agreed. During dinner, Gios showcased his Force abilities and offered to take Karkson and his grandmother back to the Coruscant Jedi Temple after the meal to receive fresh clothes and a place to sleep. Gios also offered to teach Karkson how to put his talents to better use the following day.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Coruscant",
  "/wiki/Gotal",
  "/wiki/Gender",
  "/wiki/High_Republic_Era",
  "/wiki/Solstice_Tide",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Jedi_Master",
  "/wiki/Stellan_Gios",
  "/wiki/Norikus_gang",
  "/wiki/Robe",
  "/wiki/The_Force",
  "/wiki/Jedi_Temple",
  "/wiki/A_Coruscant_Solstice",
  "/wiki/Life_Day_Treasury"
 ]
}