{
 "name": "Nix_Card",
 "display_name": "Nix Card",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Scipio"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Muun"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.46 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "InterGalactic Banking Clan",
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate",
      "Confederacy of Independent Systems",
      "Sith"
     ]
    }
   ]
  }
 ],
 "content": "Nix Card was a male Muun who served as the InterGalactic Banking Clan's representative in the Senate. He also was the senator of his homeworld, the Outer Rim Territories planet of Muunilinst. In his time as the representative of the InterGalactic Banking Clan, he spoke with senators Lott Dod of the Trade Federation, and Gume Saam of the Techno Union after the proposal of a bill that would have deregulated tha banks. During their meeting, Saam proposed killing Senator Padmé Amidala of Naboo, which Card and Dod dismissed as the Banking Clan and the Trade Federation \"were about business not violence.\" Later, Card spoke with Count Dooku, the Head of State of the Separatist Confederacy of Independent Systems and the Confederacy's commander, General Grievous, and urged the Separatists to launch an attack on the capital of the Galactic Republic, Coruscant. Then, Grievous sent several Infiltrator demolition droids to the planet, where would destroy the capital's Central power distribution grid.\nAs the Separatist Senate voted to open peace negotiations, Card met with Count Dooku, Dod and Saam again, where Card told Dooku that it was troubling to see the Serennian's own senate proposing peace negotiaitons. Then, Dooku assured the senators that an attack would come, and that the Techno Union, the Banking Clan and the Trade Federation would get their fair share and then some of the war's profits. After the demolition droids destroyed the power distribution grid, angering the senate and ending the peace proposal, and fullfilling Card's wish for an attack and end for peace negotiations. Later on, Card attended a slave auction at Zygerria, where he witnessed Jedi Knight Obi-Wan Kenobi, and stated that the Jedi were not tough, after all.\nCard later visited the planet of Scipio with Senator Amidala, where Amidala and Clovis devised a plan to investigate the missing funds of the bank, when Amidala entered the vault, Card and a squad of Muun guards escorted Clovis. And later, when the vault's power was lost, Card inquired one of the Muun guards on the situation. After Amidala and the Core Five left the vault, the senator returned to her quarters, where Card arrested her for espionage. As Amidala and Clovis escaped Scipio with stolen files that could show the status of the Muun organization, Card informed Clu Lesser, the spokesman of the Core Five, that he and him alone had allowed the events to happen, after incriminating Lesser, Card spoke with Supreme Chancellor Palpatine, in the Chancellor's Sith identity, Darth Sidious, and informed the Sith of Clovis and Amidala's status and the status of the information. Then, Sidious informed Card that they would then continue with the next state of the procceedings, and upon Card's inquiry, he assured the Muun that he would be protected. The Muun later ceded control to the Office of the Supreme Chancellor upon Clovis' death.\nNix Card hailed from the planet of Scipio. At some point, he became an agent of the Sith. In 21 BBY during the Clone Wars, Card was the Senator of the InterGalactic Banking Clan in the Galactic Republic's Senate, having succeeded Baron Rush Clovis. Following the proposal of bill that would have deregulated the banks, Card spoke with Trade Federation Senator Lott Dod and Techno Union Senator Gume Saam in his office about the reasons of its failed passing. Despite Saam's idea of assassinating Senator Padmé Amidala, Card agreed with Dod that killing the young Senator from Naboo was a bad suggestion since he felt that the Banking Clan and the Trade Federation were about business and not violence and the Senate would not deregulate the banks even if Senator Amidala wasn't alive anymore. Thus, Card said they would have to bring the war to Coruscant in order to force the congress to deregulate the banks. He and Dod decided to contact their clients on the side of the Confederacy of Independent Systems.\nCard spoke with Count Dooku and General Grievous and urged them to launch their attack on Coruscant. After the Separatist Senate voted on commencing peace negotiations with the Republic, Card, Dod, and Saam spoke with Dooku. They were displeased that the Separatist Congress had voted to open negotiations, but the Count assured them that chances of peace would disappear after their attack. Dooku and Grievous were able to carry out the attack. Seeing confirmation of the Confederacy's involvement, the Galactic Senate was persuaded by Saam to retaliate by deregulating the banks to access much-needed funds for the military.\nIn 20 BBY, Card attended an slave auction at the planet of Zygerria, where he stated the Jedi were not so tough upon witnessing Jedi Knight Obi-Wan Kenobi being tortured. He also visited various slavers, which presented their slaves.\nIn 19 BBY later visited the planet of Scipio with Senator Amidala, where Amidala and Rush Clovis, an agent of the Core Five, devised a plan to investigate the missing funds of the InterGalactic Banking Clan, when Amidala entered the vault, Card and a squad of Muun guards escorted Clovis. And later, when the vault's power was lost, Card inquired one of the Muun guards on the situation, to which the Muun replied that the power was out, and that it would take some time to switch over to another power generator. After Amidala and the Core Five escaped the vault—and Amidala stole data on the missing funds—the senator returned to her quarters, where Card along with two Muun guards arrested her for espionage. Later, Jedi Knight Anakin Skywalker, Amidala's husband, retrieved Amidala from a prison cell in which she was being held. Upon Amidala informing him of the files being held by Clovis, Amidala traveled to Clovis' private residence and rescued Clovis from Embo, a bounty hunter tasked with eliminating him.\nAs Amidala and Clovis escaped Scipio with stolen files that could show the status of the Muun organization, Card informed Clu Lesser, the spokesman of the Core Five, that he and him alone had allowed the events to happen. After incriminating Lesser, Card spoke with Supreme Chancellor Palpatine, in the Chancellor's Sith identity, Darth Sidious, and informed the Sith of Clovis and Amidala's status and the status of the information. Then, Sidious informed Card that they would then continue with the next state of the procceedings, and upon Card's inquiry, he assured the Muun that he would be protected. After Clovis took control of the Banking Clan, Dooku forced Clovis to remove interest rates from the Separatist and rise the Republic's, which angered the senate.\nThen, Dooku sent his flotilla to Scipio, where his forces, commanded by himself and Kraken, a tactical droid, invaded the planet, and forced the Republic to do the same. Upon the Republic's arrival, the Separatists withdrew their invasion, and Clovis was killed when he fell of a tower when a Hyenna-class droid fighter crashed into the tower. After Scipio was stabilized, Card addressed the senate and ceded control of the banks to the Office of the Supreme Chancellor, for \"a better tomorrow.\" Which played right into Palpatine's plans.\nNix Card was a male Muun hailing from Scipio, he was intelligent, however, he could be controlled. The Muun was arrogant, not only to his enemies, but to his peers too. He had light skin and yellow eyes. He stood at 2.46 meters, and had 5 long and thin fingers.\nNix Card wore a hat which covered the top of his head and a red and black-colored tunic which covered his entire body. He owned an office at Coruscant.\nCard first appeared in the Star Wars: The Clone Wars TV-series' third season's tenth episode, \"Heroes on Both Sides,\" which aired on November 19, 2010. Card was voiced by Corey Burton.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nix_Card",
  "/wiki/Nix_Card/Legends",
  "/wiki/Nix_(disambiguation)",
  "/wiki/Scipio",
  "/wiki/Muun",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Sith",
  "/wiki/Lott_Dod",
  "/wiki/Gume_Saam",
  "/wiki/Gender/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Senate",
  "/wiki/Senator",
  "/wiki/Homeworld",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Muunilinst",
  "/wiki/Trade_Federation",
  "/wiki/Techno_Union",
  "/wiki/Republic_financial_reform_bill",
  "/wiki/Death",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Count_of_Serenno",
  "/wiki/Dooku",
  "/wiki/Head_of_State",
  "/wiki/Commander",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Infiltrator_demolition_droid",
  "/wiki/Central_power_distribution_grid",
  "/wiki/Separatist_Senate",
  "/wiki/Serennian",
  "/wiki/Zygerria",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Currency",
  "/wiki/Squad",
  "/wiki/Core_Five",
  "/wiki/Clu_Lesser",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Darth",
  "/wiki/Office_of_the_Supreme_Chancellor",
  "/wiki/21_BBY",
  "/wiki/Clone_Wars",
  "/wiki/Baron",
  "/wiki/Count",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/20_BBY",
  "/wiki/Slavery",
  "/wiki/Slaver",
  "/wiki/19_BBY",
  "/wiki/Rush_Clovis",
  "/wiki/Security_guard",
  "/wiki/Power_generator",
  "/wiki/Anakin_Skywalker",
  "/wiki/Marriage",
  "/wiki/Prison",
  "/wiki/Rush_Clovis%27s_residence",
  "/wiki/Embo",
  "/wiki/Bounty_hunter",
  "/wiki/Dooku%27s_flotilla",
  "/wiki/Kraken",
  "/wiki/Tactical_droid",
  "/wiki/Invasion_of_Scipio",
  "/wiki/Hyena-class_Droid_Fighter/Bomber",
  "/wiki/Grand_Plan",
  "/wiki/Clothing",
  "/wiki/Nix_Card%27s_office",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/November_19",
  "/wiki/2010",
  "/wiki/Corey_Burton",
  "/wiki/Category:Images_of_Nix_Card",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/An_Old_Friend",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Prisoners",
  "/wiki/Crisis_on_Naboo",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau",
  "/wiki/June_29",
  "/wiki/2017"
 ]
}