{
 "name": "Nod",
 "display_name": "Nod",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Snivvian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Nod was a male Snivvian criminal who lived on the Colossus on Castilon. He was regularly seen with his brother Narb at Aunt Z's Tavern, the Colossus marketplace, or watching the usual races that took place. One night, the two got into an argument and caught Kazuda Xiono spying on them. They threatened him, but he got away. Nod later went looking for Narb after he did not return from trying to rob the Office of Acquisitions. He pointed a blaster at the owners, but they tricked him into standing on a trap door and activated it.\nDuring the New Republic era, Nod lived on the Colossus, an independent refueling station on Castilon. At some point, he and his brother Narb were at Aunt Z's tavern. During their visit, a commotion happened between the human Kazuda Xiono and the Klatooinian Bolza Grool. The Aleena Grevel, whom Narb worked for, attempted to intervene to collect the credits Xiono owed him, but Grool threw him, and he fell into the arms of Nod. While in the Snivvian's arms, Grevel got a cup and threw it back at Grool, who threw Xiono into a serving droid. A cup fell out of the droid's hand and into the Rodian Glem, causing him to start throwing cups at Nod. Aggravated, Nod joined the commotion, and an all-out bar fight ensued until Jarek Yeager intervened with his blaster.\nShortly after, the Nikto Neeku came into the tavern to announce Xiono as a new challenger for the regular races on the Colossus. Xiono was not intending to be a challenger, but Nod and the other patrons cheered despite this. Sometime later, Nod and Narb were watching a race with several others. Xiono and Neeku were soon to join the group, and the race's host, Jak Sivrak, announced Xiono as the next challenger. Sivrak showed Xiono the racers and asked him which one he wanted to challenge. Xiono chose Torra Doza, and the others laughed. Nod attended their race the next day and watched as Xiono's racer, the Fireball, crashed into the ocean.\nOne day, Nod confronted Narb over some credits he owed him. As they argued, Nod noticed Xiono hiding behind a crate and picked him up by his collar. Grevel then appeared to again attempt to collect the credits Xiono owed him, and Xiono ran. Nod and Narb chased him through the Colossus marketplace, and Grevel pushed a box in front of Xiono, tripping him. Nod and Narb picked him up, and Grevel led them out of the open area. Grool was passing the confrontation at that moment, and Xiono's droid, BB-8, electrically shocked him, causing his crate of gorgs to fly out of his hands. The gorgs then fell onto Grevel and the Snivvians, and Xiono got away.\nAt some point, Nod was talking to Narb and another individual in the marketplace when Commander Pyre and two other First Order stormtroopers were questioning residents over the location of two children. He and Narb were also conversing in the market when BB-8 was searching for Kaz and when the residents were confronting Torra Doza on the recent race cancellations.\nWhen Marcus Speedstar came to the Colossus to participate in the racing event known as the Platform Classic, he visited Aunt Z's tavern, where Nod, Narb and the other residents offered to pay for his drink. Speedstar kindly declined, and they left him. Yeager then entered the tavern and challenged Speedstar in the Platform Classic. Speedstar accepted, and Aunt Z began the betting for the race. Nod immediately put in his bet. He later watched the race with Narb.\nSome time later, Narb went to the Office of Acquisitions with a blaster to rob credits from the owners, Flix and Orka. When he did not return, Nod went there with a blaster in search of his brother. The pair tried to direct Nod towards where Narb had gone, in reality positioning him above their trap door. When Nod was over the trap door, Flix pressed the button to open it. Nod eventually was reunited with Narb, and a short while after, they went to watch another race. During the race, they stood either side of Grevel. Nod was sitting at the bar at Aunt Z's when Kaz received his drink from Aunt Z. When the Mirialan Synara San came to see Kaz, Torra invited them and Tamara Ryvora to play a game at Doza Tower.\nAfter the First Order began patrolling the Colossus, Nod and Narb were in the marketplace when the fifth TIE fighter arrived at the refueling station. Shortly after, three stormtroopers passed and confronted Glem about his identification, almost arresting him before he was able to find it. As the stormtroopers continued to be harsh to the residents, some of them gathered in the marketplace to protest against them. Nod and Narb soon joined the rabble as night fell, and they threw produce at the trooper CS-515, secretly Xiono in his armor, who was running from a squad of stormtroopers who wished to apprehend him. He ran past Nod and the other residents and the intercepting squad then arrived of them, who were also caught up in the volleys of fruit thrown by protesters. The squad leader, CS-812, tried shooting in the air with his blaster, but this did not work, so another stormtrooper set their blaster to stun and shot at the crowd. The residents were forced to stop and raise their hands, allowing CS-831 to locate the rogue trooper his squad was chasing. After locating him on the squad's tracker, 812 stunned Nod and Narb to create an exit, and they ran back into the corridors.\nOne day, Nod was at Aunt Z's asking for a drink when Grevel began quarreling with a First Order BB-series astromech droid, which ended in him conceding. Two stormtroopers then joined the BB unit and Nod decided to leave, shaking his head at them as he left. However, he was soon captured by the First Order. They locked him in a crate at the West Docks with Grevel, Aunt Z, and Hype Fazon, who each had quarreled with the First Order. Aunt Z continued to refuse her position as a prisoner while the other three sat helplessly on the other side. They eventually learned that they were going to be transported off-world after hearing stormtroopers take other prisoners to their designated ship.\nWhile they waited for their departure, Aunt Z told them some stories. As she finished one which made Nod and the others laugh, Xiono, who had sneaked into the West Docks with Torra Doza, whispered into the crate, telling Aunt Z that they should try and steal their transport. She promptly agreed, before Xiono and Doza were forced to slip away as more stormtroopers arrived. The troopers took Nod and the others out of the crate and to the transport. After they entered it, Xiono and Doza attacked the guards posted at the boarding ramp. The stormtroopers guarding Nod and the others then ran to deal with them when Aunt Z attacked them, knocking them unconscious. Nod and Grevel fled the scene as the fight ensued, leaving Aunt Z and the others to finish it for them.\nXiono later planned to sink the Colossus until only Doza Tower at the top remained in order to swim up to the tower itself. As he did it, the rest of the platform was sealed off to avoid flooding. After arresting Jarek Yeager for his involvement in the operation, Commander Pyre made an announcement to the Colossus residents. At this time, Nod was in the now abandoned marketplace, stealing from the stalls.\nNod was a male Snivvian with brown skin, dark brown hair, and black eyes. He spent a lot of time with his brother Narb and thought to inquire on his whereabouts when he did not return from trying to rob the Office of Acquisitions. He was easily aggravated by others, attacking Glem when he threw cups at him and grabbing Xiono by his throat when he caught him snooping on him.\nNod wore a sand-colored shirt and trousers with a gray overshirt. In addition he wore a brown tunic and brown boots. For combat, he owned a blaster and wore armor plating on his forearms.\nNod was created for Star Wars Resistance, first appearing in the Season One premiere \"The Recruit.\" He was then identified in the following episode, \"The Triple Dark,\" where he was voiced by Jonathan Lipow.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Snivvian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Colossus",
  "/wiki/Castilon",
  "/wiki/Narb",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Colossus_marketplace",
  "/wiki/Kazuda_Xiono",
  "/wiki/Office_of_Acquisitions",
  "/wiki/Blaster",
  "/wiki/New_Republic",
  "/wiki/Refueling_station",
  "/wiki/Z%27Vk%27Thkrkza",
  "/wiki/Human",
  "/wiki/Klatooinian",
  "/wiki/Bolza_Grool",
  "/wiki/Aleena",
  "/wiki/Grevel",
  "/wiki/Credit",
  "/wiki/Rodian",
  "/wiki/Glem",
  "/wiki/Jarek_Yeager",
  "/wiki/Nikto",
  "/wiki/Neeku",
  "/wiki/Jak_Sivrak",
  "/wiki/Torra_Doza",
  "/wiki/Fireball",
  "/wiki/BB-8",
  "/wiki/Gorg",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/First_Order",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Marcus_Speedstar",
  "/wiki/Platform_Classic",
  "/wiki/Flix",
  "/wiki/Orka",
  "/wiki/Mirialan",
  "/wiki/Synara_San",
  "/wiki/Tamara_Ryvora",
  "/wiki/Doza_Tower",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/CS-515",
  "/wiki/CS-Squad",
  "/wiki/CS-812",
  "/wiki/Stun",
  "/wiki/CS-831",
  "/wiki/BB-series_astromech_droid",
  "/wiki/West_Docks",
  "/wiki/Hype_Fazon",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/The_Recruit",
  "/wiki/The_Triple_Dark",
  "/wiki/Jonathan_Lipow",
  "/wiki/The_Children_from_Tehar",
  "/wiki/The_Search_for_Kaz",
  "/wiki/The_Platform_Classic",
  "/wiki/Secrets_and_Holograms",
  "/wiki/When_Thieves_Drop_By",
  "/wiki/The_Need_for_Speed",
  "/wiki/Bibo_(episode)",
  "/wiki/The_Doza_Dilemma",
  "/wiki/The_First_Order_Occupation",
  "/wiki/The_New_Trooper",
  "/wiki/The_Disappeared",
  "/wiki/Descent_(episode)",
  "/wiki/No_Escape:_Part_1",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/The_New_World",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)"
 ]
}