{
 "name": "Nodlia",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mokivj"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Nodlia, born as LebJau was a human male electronics and maintenance factory worker in the Mokivj droid factory led by pro-separatist and former member of the Galactic Republic, Duke Solha on Mokivj. However, after the catastrophe on his home planet, Mokivj, LebJau changed his name and moved to Batuu, as the Mokivj population knew he had collaborated with Jedi Knight Anakin Skywalker, Senator Padmé Amidala and Chiss Senior Captain Mitth'raw'nuruodo, or Thrawn of the Chiss Ascendancy.\nWhile LebJau lived on Mokivj, the Separatists took control of the planet. The food rations on the planet were not adequate so the locals sneak out of the encampments and hunted during the nights. LebJau hunted with Grubs and others.\nAt some point, the group found Padmé Amidala, after her ship had crashed and her escape pod landed in the river. As they had no idea who she was, she convinced them she was simply visiting the planet and that instead of turning her over to the Separatists, they should hold her ransom to her family. They kept Padme in a \"boat\" that LebJau was crafting out of scrap, although Padme thought it was \"rough and amateurish\". He cooperated with Jedi Knight Anakin Skywalker and Chiss Commander Mitth'raw'nuruodo or Thrawn during the Mokivj Catastrophe\nWhen Grand Admiral Thrawn and Darth Vader, previously Anakin Skywalker traveled to Batuu, LebJau, now going by Nodlia, was a bartender at Oga's Cantina, following Skywalker's advice. He supplied the information the Chiss and Sith Lord demanded.\nLebJau or Nodlia was a male human that worked as maintenace for pro-separatist Duke Solha. LebJau or Nodlia was kind to Padmé, even while holding her for ransom. He apologized for not having bedding for her, and, to her surprise, followed through with supplying her with food.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Mokivj",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Reproduction",
  "/wiki/Mokivj_droid_factory",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Galactic_Republic",
  "/wiki/Duke",
  "/wiki/Solha",
  "/wiki/Mission_to_Mokivj",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Chiss",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Core_name",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Homeworld",
  "/wiki/Foodstuff",
  "/wiki/Ration_pack",
  "/wiki/Grubs",
  "/wiki/Starship",
  "/wiki/Escape_pod",
  "/wiki/Boat",
  "/wiki/Commander",
  "/wiki/Grand_Admiral",
  "/wiki/Darth",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Sith_Lord",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Thrawn:_Alliances_(audiobook)"
 ]
}