{
 "name": "Noga-ta",
 "display_name": "Noga-ta",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Noga-ta was an Ithorian Jedi Knight who served the Jedi Order and the Galactic Republic, and became the legendary \"Lost Jedi\" on the planet of Barab I after having prevented warfare from engulfing the native Barabel.\nNoga-ta, a Force-sensitive Ithorian, was a member of the Jedi Order centuries before the fall of the Galactic Republic. Although accounts differed, the Jedi Knight Noga-ta arrived on the planet of Barab I just as the native Barabels were about to erupt into warfare. Two large factions had begun to fight over a hunting territory, and were readying themselves for war. Noga-ta created a peace treaty that ended the conflict before it began, potentially saving countless lives. The Jedi's prescriptions for peace—including giving a tribe's largest kill of the night to a neighboring tribe—were still enforced centuries later. Noga-ta's service on Barab I became legend, with the story of the \"great warrior from beyond the clouds\" being passed down from generation to generation through the use of cave paintings and oral recitations. Forever after, Barabel held all Jedi in the highest regard, and because of Noga-ta's actions, they always heeded the word of a Jedi.\nNoga-ta was first mentioned in the sourcebook Geonosis and the Outer Rim Worlds. Noga-ta was illustrated by Jeremy Jarvis in the book, which was published in 2004 by Wizards of the Coast.\nNoga-ta was voiced by Eric Bauza in various non-canonical LEGO Star Wars releases, including the LEGO Star Wars: The Yoda Chronicles episode \"Escape from the Jedi Temple\". In the episode, Noga-ta traveled to Kashyyyk to assist Yoda and Obi-Wan Kenobi's mission to recover holocrons from the Jedi Temple after the initiation of the Great Jedi Purge. Nicknamed \"Rusty,\" Noga-ta's reunion with his old teacher and former roommate is cut short, however, when he realizes that neither Jedi remembered him. A LEGO minifigure of Noga-ta was released in the set \"Jedi Scout Fighter,\" where the Jedi is simply named \"Ithorian Jedi Master.\" Whereas Noga-ta has a blue-bladed lightsaber in \"Escape from the Jedi Temple,\" the Ithorian's minifigure in \"Jedi Scout Fighter\" holds a green-bladed lightsaber.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rusty_(Ithorian)",
  "/wiki/Noga-ta",
  "/wiki/Jedi/Legends",
  "/wiki/Canon",
  "/wiki/Escape_from_the_Jedi_Temple",
  "/wiki/Smuggler/Legends",
  "/wiki/Rusty",
  "/wiki/Barabel/Legends",
  "/wiki/First_Jedi_Purge",
  "/wiki/Meetra_Surik",
  "/wiki/Lost_Jedi",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Barab_I/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/Jeremy_Jarvis",
  "/wiki/2004",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Eric_Bauza",
  "/wiki/LEGO_Star_Wars",
  "/wiki/LEGO_Star_Wars:_The_Yoda_Chronicles",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Order_66/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/LEGO",
  "/wiki/Category:Images_of_Noga-ta",
  "/wiki/LEGO_Star_Wars_The_New_Yoda_Chronicles",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_at_War",
  "/wiki/LEGO_Star_Wars_Character_Encyclopedia:_Updated_and_Expanded"
 ]
}