{
 "name": "Nohn Veyaiko",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fa'athra gang"
     ]
    }
   ]
  }
 ],
 "content": "Nohn Veyaiko was a Neimoidian male who served the Hutt crime lord Voontara Fa'athra as a lieutenant on the planet Nal Hutta. In the year 3643 BBY, he confronted the Imperial Agent Cipher Nine and the mercenary Kaliyo Djannis when they fought their way into Fa'athra's Palace in order to plant false evidence framing Fa'athra's men for the murder of Karrels Javis, a lieutenant of Fa'athra's rival Suudaa Nem'ro. Veyaiko confronted the pair with two of Fa'athra's elite guards, but was killed in the ensuing fight.\nThe Neimoidian male Nohn Veyaiko served the Hutt crime lord Voontara Fa'athra as a lieutenant in his gang during the Cold War between the Galactic Republic and the Sith Empire. He and his master were based on the planet Nal Hutta, where the Hutt possessed a palace close to the industrial town of Jiguuna. Suudaa Nem'ro, another Hutt crime lord, was also heavily active in the area, and he and Veyaiko's employer frequently clashed over local interests. When the Rattataki mercenary Kaliyo Djannis first arrived on Hutta, Veyaiko tried to hire her to take Fa'athra's side in the Hutt rivalry; however, his offer was not enough and she sided with Nem'ro.\nIn the year 3643 BBY the Imperial Intelligence agent known as Cipher Nine came to Hutta disguised as another mercenary known as the Red Blade, hoping to convince Nem'ro to work exclusively with the Empire. The agent began completing tasks for one of Nem'ro's lieutenants, Karrels Javis, but was eventually forced to |Death|kill]] him when an incident involving his sons meant he no longer looked favorably upon the Empire. In order to frame Fa'athra's men and the Republic for the murder, the Blade and Djannis made their way to Fa'athra's palace to plant fake evidence including Republic technology and footage showing Republic agents killing Javis. The pair fought their way through the palace's guards quickly drawing Veyaiko's attention; but the lieutenant allowed them to fight undisturbed, hoping they would wear themselves out on weaker thugs. Once the Agent reached Fa'athra's archives however, the Neimoidian and two of Fa'athra's elite guards confronted them.\nDespite his hopes that the intruders had been weakened, Veyaiko and his men were defeated and killed by the Agent and Djannis, who proceeded to plant the false evidence and convince Nem'ro to side with the Imperials in the Cold War.\nNohn Veyaiko was a green skinned, brown eyed Neimoidian with no hair. He preferred not to take risks, leaving the Agent and Djannis to fight low-level employees of Fa'athra so they would be weaker when he faced them. When Veyaiko did face the two intruders, he was reasonably polite, apologizing that they had to die and offering to have their heads returned to their homeworlds after their deaths. Despite believing he was an important lieutenant of Fa'athra's, his mistrust of the Hutt was enough that he was willing to believe his employer would sacrifice him. The Neimoidian was even willing to abandon Fa'athra and join with Nem'ro should he been given reason to believe the other Hutt was a better employer.\nVeyaiko wore plain clothing and used a vibrosword when confronting the Agent and Djannis.\nNohn Veyaiko was created for the quest \"The New Truth\" which was a part of the Imperial Agent class's storyline on the planet Hutta in Star Wars: The Old Republic, an MMORPG released by BioWare in 2011. During the quest the player has the option to kill Veyaiko for either dark side points or no alignment points, depending on the point in the conversation they attack, or try to persuade him to leave Fa'athra's service and work for Nem'ro for light side points. Should they try and persuade him, the player tricks Veyaiko into believing Fa'athra was setting him up to be killed and successfully persuades Veyaiko to leave and go sign up with Nem'ro. This article assumes the dark side option was chosen as the agent is an Imperial class.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fa%27athra_gang",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Voontara_Fa%27athra",
  "/wiki/Lieutenant/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Imperial_Agent",
  "/wiki/Cipher_Nine",
  "/wiki/Mercenary/Legends",
  "/wiki/Kaliyo_Djannis",
  "/wiki/Fa%27athra%27s_Palace",
  "/wiki/Death/Legends",
  "/wiki/Karrels_Javis",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jiguuna",
  "/wiki/Rattataki/Legends",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Red_Blade",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Vibrosword/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}