{
 "name": "Nok_(Rodian)",
 "display_name": "Nok  (Rodian)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tetsu Clan"
     ]
    }
   ]
  }
 ],
 "content": "Nok was the uncle of Greedo. He was the elder brother of Neela, Greedo's mother.\nIn 17 BBY, the Chattza Rodian known as Navik the Red initiated a series of violent skirmishes against members of the Tetsu Clan. Nok's brother-in-law, Greedo the Elder, was one of Navik's earliest victims. Desperate to survive, Nok and his family fled Rodia aboard one of three large, silver starships. They settled down in the thick jungles of a nameless tropical planet. Nok concealed the ships inside of an immense cavern hoping that no one from the Chattza clan would ever find them again. Satisfied with his people's new home, he helped to erect meager huts inside of the dense branches of the Tendril trees that flourished all throughout the mountain valley.\nOver the years, Nok fashioned a lifestyle for himself with his brother, Teeku, by herding the arboreal creatures known as Tree-Botts. He also became a prodigious hunter and kept the Tetsus safe from the predatory Manka cats that roamed the jungles at night. It was his fervent desire to see his nephews, Greedo and Pqweeduk develop into skilled hunters in their own right. He presented Pqweeduk with a special hunting knife for the youth's twelfth birthday.\nShortly thereafter, Nok discovered that the warriors of Navik the Red had returned. They zeroed in on the Tetsu pilgrimage and began violently razing the jungle, killing as many of their fellow Rodians as they could find. Nok and Teeku scooped up their family and brought them back to the hidden starships. Only one of the three ships managed to survive the destruction. Nok piloted the surviving craft out of the planet's orbit and decided that it would prudent to relocate his family to a safer, more densely populated environment. It was his hope that they could integrate themselves anonymously into another culture where no one would ever recognize them. He brought them to the smugglers' moon— Nar Shaddaa.\nNok and his family settled down in the warehouse district on Level 88 of the Corellian Sector. His sister, Neela found work doing house-service, while Nok and Teeku gained employment as freight handlers. In 1 BBY, Imperial forces raided the warehouse district of Level 88 and engaged in a fire-fight with Rebel Alliance soldiers. Many sections of the district were set ablaze from the devastation. Whether Nok survived the conflagration or not has never been revealed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nok",
  "/wiki/Rodia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tetsu_Clan",
  "/wiki/Greedo/Legends",
  "/wiki/Neela",
  "/wiki/17_BBY/Legends",
  "/wiki/Chattza_Clan",
  "/wiki/Navik",
  "/wiki/Rodian_Clan_Wars",
  "/wiki/Greedo_the_Elder",
  "/wiki/Starship/Legends",
  "/wiki/U-Tendik",
  "/wiki/Tendril_tree",
  "/wiki/Teeku",
  "/wiki/Tree-Bott",
  "/wiki/Manka_cat/Legends",
  "/wiki/Pqweeduk",
  "/wiki/Birthday/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Level_88",
  "/wiki/Corellian_Sector_(Nar_Shaddaa)/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/A_Hunter%27s_Fate:_Greedo%27s_Tale",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/A_Hunter%27s_Fate:_Greedo%27s_Tale_(webstrip)",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}