{
 "name": "Nok_Drayen",
 "display_name": "Nok Drayen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dubrillion"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black with white streaks",
      "later grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic right eye and skin parts"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Drayen Crime Syndicate",
      "Star Cabal"
     ]
    }
   ]
  }
 ],
 "content": "Nok Drayen, was a Human male crime lord whose operations during the Great Galactic War made him an underworld legend, and also a leading member of the fabled Star Cabal. Born the grandson of King Arak Drayen III of Dubrillion, he was the father of Risha, his heir to the throne.\nDuring the Great Galactic War, Drayen, until then a small-time smuggler, rose to galactic infamy when he destroyed the shadowport of Mandellia and killed the thousands of pirates and gangsters who resided there with a single shot.\nDropping out of hyperspace in his freighter, Drayen broadcast a demand that the settlement's residents surrender to him. When they refused, he fired a proton torpedo loaded with a nerve toxin stolen from the Imperial Navy, which slew every last resident in minutes. Drayen then plundered the accumulated wealth of his victims, becoming one of the wealthiest criminals in known space and using the proceeds to establish his own syndicate.\nDrayen's ruthlessness in the accumulation of underworld influence was legendary, and he was credited with having slain half the members of the Hutt Cartel in a single night, with no one ever able to discover the method behind his feat. Having been granted control over an entire quadrant of the galaxy by the Cartel as a peace offering, he later consolidated his power and added to his infamy when he personally destroyed the Rath Cartel and the Vandelhelm Combine during the Syndicate Wars.\nDuring this period, Drayen began a longstanding rivalry with his contemporary, Diago Hixan, as the two competed across the galaxy to commit the most spectacular crimes and claim the greatest treasures, although Drayen always came out on top in their clashes. The conflict became personal when Drayen seduced Shassa Dalle, Hixan's beloved wife, and more so after one of Hixan's many unsuccessful attempts to win her back ended in her accidental death.\nDrayen was present for a business meeting held at the Star Cluster Casino on the smuggler's moon of Nar Shaddaa in 3653 BBY. He and several other individuals were meeting to discuss their interests and how those interests would change now that the Sith Empire had forced the Republic to sign the Treaty of Coruscant. As the meeting was called to order, Drayen exposed Naatu for providing information to the Republic and proceeded to draw his blaster and execute him. He then introduced the Sith Lord Darth Angral, who was there to make the group a proposition.\nAfter the bounty hunter, Braden, escaped from imprisonment on a Sith warship, he returned to Nar Shaddaa to gain Drayen's assistance. He agreed on the condition that Braden help him with some of his business in exchange.\nIn 3653 BBY, as the Cold War dragged on, Drayen was betrayed by one of his lieutenants, infected by a devastating disease. It ate away so much of his skin, along with his right eye, that he had to replace the infected areas with cybernetics. It resulted little, however, for the disease would destroy his organs. Drayen executed the traitor, along with all his other lieutenants, just to be thorough.\nDrayen tried asking the Jedi Order for help, but they were \"uncooperative.\" As a result, he killed three of them so that he might learn what \"secrets\" they might have had.\nDrayen was secretly frozen in carbonite by his Selkath doctor, Chelah, so that he could \"cheat\" death for as long as possible. From there, his daughter Risha would keep him around with her for ten years.\nIn 3643 BBY, Risha partnered with a smuggler to find Nok Drayen's treasure, all the while as Risha keeping her father's existence secret. However, they needed upgrades for their ship and once they had them all, Risha decided it was time to tell the truth. She brought Nok Drayen's carbonite block to Nar Shaddaa, where Doctor Chelah would unfreeze him.\nDuring the brief father-and-daughter reunion, it was a matter of time before the illness reached the mighty Drayen's heart, so he urged Ace to hurry, promising all but one treasure is their's to take. Ace returned with the lockbox containing Dubrillion's treasures, the most important being the lost crown of Dubrillion, to find him dying, which Drayen opened with the code his father taught him. With death looming over him, Drayen told Risha to take the crown, and take back the throne of Dubrillion for herself. However, if she was to succeed, she would have to do many questionable things, and ordered her to kill the smuggler, whom he deemed irrelevant in the grand scheme of things, thus going back on his original promise. She refused, and with his dying words, he told Risha how disappointed he was in her, and succumbed to his illness. Subsequently, Risha ordered Chelah to dispose of her father's body as per his will and released the Selkath from her family's service.\nWhile not afraid of anyone, Drayen was careful not to cross Harridax Kirill, alias the \"Voidwolf.\"\nNok wore an overcoat similar to the one Cade Skywalker would wear thousands of years later. He also wore glove spikes on his gauntlets and possessed a blaster pistol.\nNok Drayen is voiced by Steve Blum.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nok",
  "/wiki/Dubrillion/Legends",
  "/wiki/3643_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Drayen_Crime_Syndicate",
  "/wiki/Star_Cabal",
  "/wiki/Crime_lord/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/King/Legends",
  "/wiki/Arak_Drayen_III",
  "/wiki/Risha_Drayen",
  "/wiki/Smuggler/Legends",
  "/wiki/Shadowport/Legends",
  "/wiki/Mandellia",
  "/wiki/Pirate/Legends",
  "/wiki/Gangster",
  "/wiki/Hyperspace",
  "/wiki/Freighter",
  "/wiki/Proton_torpedo",
  "/wiki/Nerve_toxin/Legends",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Hutt_Cartel",
  "/wiki/The_galaxy/Legends",
  "/wiki/Rath_Cartel",
  "/wiki/Vandelhelm_Combine",
  "/wiki/Syndicate_Wars",
  "/wiki/Diago_Hixan",
  "/wiki/Shassa_Dalle",
  "/wiki/Star_Cluster_Casino",
  "/wiki/3653_BBY",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Naatu",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Angral",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Braden",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Selkath/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Chelah",
  "/wiki/Voidhound",
  "/wiki/Search_for_Nok_Drayen%27s_treasure",
  "/wiki/Special:EditPage/:Nok_Drayen",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Vette",
  "/wiki/Harridax_Kirill",
  "/wiki/Greatcoat/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Glove_spikes",
  "/wiki/Gauntlet/Legends",
  "/wiki/Steve_Blum",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_2:_New_Galactic_Order",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_3:_Uncertain_Surrender",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}