{
 "name": "Nolan_Gillmunn",
 "display_name": "Nolan Gillmunn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jabiim"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabiimi Loyalists",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Nolan Gillmunn was a Human male who served as the leader of the Jabiimi resistance during the Galactic Civil War, and son of famed Clone Wars leader Orliss Gillmunn.\nOne of the Jabiimi Loyalists, Nolan Gillmunn fought alongside his father Orliss Gillmunn against the Jabiimi Nationalists led by the Commander Alto Stratus in the Clone Wars. After the Nationalists, who allied with the Confederacy of Independent Systems, gained the upper hand, the Jabiimi Loyalists gathered on the Monsoon Mesa, where they were to be evacuated by Galactic Republic transport ships. However, Commander Anakin Skywalker, who was leading the evacuation efforts on Jabiim, ordered that only his own clone troopers be rescued for tactical military reasons as well as lack of space. Thus, Anakin abandoned the planet, leaving the Jabiimi Loyalists to their fate. Nolan and other Loyalists witnessed the Republic's betrayal, while Olriss swore their eternal vengeance.\nBut instead of surrendering to the Nationalists and the Confederacy, the Loyalists continued to fight. In 21 BBY, Orliss and Nolan planned an attack on the droid command center in Hyber Canyon. Although Nolan recognized that this was an act of desperation due to their outnumbered numbers, he stood by his father. During the massacre at High Rock Canyon, Nolan witnessed his father being stabbed to death with a blade by the Jabiimi Nationalist Thorne Kraym. However, Nolan himself survived.\nAround seven months ABY, Gillmunn invited a Rebel diplomatic team led by Leia Organa and Luke Skywalker to meet with the resistance. When the Empire became aware of the Rebels' presence, they attacked in an attempt to capture Skywalker. Gillmunn took a team and left to help Skywalker escape, but eventually they were ambushed and captured by Imperials. Just as the Imperial captain gave the word for the Jabiimi squad's execution, they were interrupted by Darth Vader's orbital bombardment. Soon after, Wedge Antilles arrived in his X-wing to finish off the remains of the Imperials. Skywalker left with the Rebels, but Gillmunn and his team stayed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jabiim/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jabiimi_Loyalists",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Thorne_Kraym",
  "/wiki/Jabiimi",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Orliss_Gillmunn",
  "/wiki/Parent/Legends",
  "/wiki/Jabiimi_Nationalists",
  "/wiki/Commander/Legends",
  "/wiki/Alto_Stratus",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Monsoon_Mesa",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Battle_of_Hyber_Canyon",
  "/wiki/Hyber_Canyon",
  "/wiki/Massacre_at_High_Rock_Canyon",
  "/wiki/Leia_Organa_Solo",
  "/wiki/0_ABY/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Nolan_Gillmunn",
  "/wiki/Republic_58",
  "/wiki/Retcon",
  "/wiki/Empire_29",
  "/wiki/Empire_30",
  "/wiki/Empire_32",
  "/wiki/Empire_33",
  "/wiki/Empire_34",
  "/wiki/Rebellion_0",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides"
 ]
}