{
 "name": "Nolaa_Tarkona",
 "display_name": "Nolaa Tarkona",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "24 ABY",
      "Outer Rim Territories"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "One ocular implant in place of a missing Lekku"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ryloth Clan",
      "Diversity Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Nolaa Tarkona was a female Twi'lek who was the leader of the Diversity Alliance. Her teeth were filed sharp and one lek was missing, but she had an ocular implant in its place, allowing her to see behind herself.\nNolaa Tarkona was born on Ryloth during the Imperial Period. As with many other aliens, she was subject to the Humanocentric policies of the Galactic Empire's New Order, fueling her hatred of Humans. The Empire had also enslaved many Twi'leks and her half-sister Oola had died as a slave in Jabba Desilijic Tiure's palace when he fed her to his pet rancor.\nNot wanting to suffer the same fate as her half-sister, an enslaved Nolaa rose up against her masters and started a rebellion, which ultimately succeded in overthrowing the Ryloth government. Tarkona then became the first female Twi'lek leader in galactic history. Any Twi'lek that didn't follow Tarkana's ideals were killed, exiled or sent to work in the ryll mines.\nSoon afterward, Nolaa started the Diversity Alliance  and spread her message of alien unity to many species across the galaxy. She held many rallies on several alien worlds where she whipped up support for the Alliance. Many aliens joined her including Wookiees, Quarren, Ugnaughts, Trandoshans, Duros and Chironians. The Diversity Alliance seemed like a peaceful aliens-first movement on the outside but Nolaa created the Diversity Alliance as a way for all nonhumans to band together against a common enemy: Humans.\nIn 24 ABY, an alien scavenger named Fonterrat discovered the Emperor's plague storehouse in the Deep Core. Hidden within it was a supply of deadly diseases created by General Evir Derricote almost two decades before. Though the Galactic Empire had been defeated, this plague warehouse still remained with its supply of deadly diseases. Knowing of Nolaa's hatred of Humans, Fonterrat offered to sell her a navicomputer module containing the storehouse's location, though he refused to deal directly with her, suggesting that she send a neutral party to meet him on Kuar.\nWhen negotiating, he also provided her with two samples of the virus, one of which she used to seal his payment.  The neutral party turned out to be a wealthy Human merchant and shipping tycoon named Bornan Thul. In exchange for the navicomputer module that contained the coordinates for the asteroid, Bornan paid with a time-locked case filled with credits.\nBornan was then supposed to deliver it to Tarkona at a trade conference on Shumavar but he found out about what lay within the plague warehouse and went into hiding. Enraged, Nolaa hired numerous bounty hunters to locate Thul and bring back the navicomputer.Among those bounty hunters was Ailyn Vel, disguised as her father Boba Fett.\nLater, Bornan's son Raynar Thul  went to find his father with the help of his classmates Jacen Solo, Jaina Solo, Tenel Ka Djo and the Wookiee Lowbacca. They searched his last known locations stretching from ancient ruined worlds including Ziost to the droid foundry world of Mechis III.\nFonterrat also went to the all-Human colony on Gammalin where he unwittingly unleashed the plague which wiped out the population. Before the plague had taken its effect, Fonterrat was imprisoned by the colonists. Since the plague had wiped out every one on the colony other than Fonterrat, he died in his cell of starvation since there was no one to take care of him. Meanwhile, Nolaa Tarkona continued her crusade to whip up support among the alien species of the galaxy by visiting the Chromans of Chroma Zed where she recalled Imperial oppression.\nLater, Lowbacca was recruited into the Alliance by the female Wookiee Raabakyysh and traveled to their headquarters of Ryloth to learn more about them. Meanwhile, the Human Zekk—a friend of the Jedi—rescued Bornan from bounty hunters and learned the reason he had disappeared and the top-secret Imperial plague warehouse. Bornan also revealed that Boba Fett  had sliced into his ship's navicomputer and stolen the coordinates of the plague warehouse. Ailyn Vel then presented this information to Nolaa, who wished to unleash a Human-specific plague upon the galaxy.\nFeeling that Lowbacca only knew the public face of the Diversity Alliance and not the hidden anti-Human sentiment, Lowie's Jedi companions traveled to Ryloth only to get arrested by the local authorities and put to work in the dangerous ryll mines of Ryloth. However, Lowbacca soon learned what had befallen of his Human companions through Raabakyysh.\nThe enraged Wookiee turned against the Diversity Alliance and helped them escape the harsh terrain of the planet and zealous Diversity Alliance troops. The Jedi also discovered that the Diversity Alliance was keeping Humans as slaves in its ryll mines and stockpiling weapons for its war against Humans.They were also rescued by Zekk, Luke Skywalker and Lusa .The Jedi then fled offworld to the galactic capital of Coruscant.\nThis incident attracted galaxy-wide publicity and a special session was held at the New Republic Senate to deal with it. There, before thousands of Senators and representatives, Luke requested that an inspection team be sent to Ryloth to investigate reports of Diversity Alliance aggression. When word of this reached Nolaa Tarkona, she ordered one of her trusted friends, the Devaronian Kambrea, to entertain the inspection team and cover up the evidence of Alliance aggression. She also prepared a fleet to go the plague warehouse.\nMeanwhile on the Jedi/New Republic side, after recording an encrypted message to his wife Aryn Dro Thul explaining their plan, Bornan, along with Raynar, Zekk, Jacen and Jaina Solo, Tenel Ka, and Lowbacca gathered up some explosives and went to the warehouse with the intention of destroying it. They had almost finished wiring when Diversity Alliance ships showed up. In the ensuing confrontation with Tarkona in the warehouse, some of the plague canisters were broken open, including Human and Twi'lek specific virus. Bornan sacrificed himself so the plague would not spread, and told Raynar to get himself and his friends off the asteroid.\nMeanwhile in space, a New Republic fleet under Han Solo defeated the Diversity Alliance fleet. On Ryloth, fighting took place when the New Republic inspection team discovered stockpiles of weapons. However, the fighting was stopped by the Twi'lek Kur who convinced the Alliance soldiers that they had been misguided and that both Humans and Aliens should work together.\nWith the Diversity Alliance facing defeat, Nolaa and Raaba fled to an uncharted world in the Outer Rim on their transport Rising Star where Nolaa died from a slow-acting disease which ravaged her body by wiping out her immune systems and causing her to sweat profusely. She had tried to persuade Raaba to take her to Coruscant so that she could infect her enemies, but failed because the Wookiee had become disenchanted of the Alliance's ideals by then. This ended the Diversity Alliance, which collapsed with the death of Nolaa.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/24_ABY/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lekku/Legends",
  "/wiki/Ryloth_Clan",
  "/wiki/Diversity_Alliance",
  "/wiki/Lowbacca",
  "/wiki/Humanocentrism",
  "/wiki/Kambrea",
  "/wiki/Imperial_Period",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Anti-Humanism",
  "/wiki/Human/Legends",
  "/wiki/Oola/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Ryll/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Chironian",
  "/wiki/Fonterrat",
  "/wiki/Emperor%27s_plague_storehouse",
  "/wiki/Deep_Core/Legends",
  "/wiki/General/Legends",
  "/wiki/Evir_Derricote",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Kuar/Legends",
  "/wiki/Four_unidentified_Imperial_Royal_Guards",
  "/wiki/Rullak",
  "/wiki/Corrsk_(Diversity_Alliance)",
  "/wiki/Bornan_Thul",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Shumavar/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Ailyn_Vel",
  "/wiki/Boba_Fett/Legends",
  "/wiki/File:Nolaa_Tarkona2.jpg",
  "/wiki/Chroma_Zed",
  "/wiki/Raynar_Thul",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Ziost/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Mechis_III/Legends",
  "/wiki/Gammalin",
  "/wiki/Chroman_(species)",
  "/wiki/Raabakyysh",
  "/wiki/Zekk",
  "/wiki/Lusa",
  "/wiki/Talz/Legends",
  "/wiki/Battle_of_the_Emperor%27s_Plague_Storehouse",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Devaronian/Legends",
  "/wiki/Aryn_Dro_Thul",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Han_Solo/Legends",
  "/wiki/Battle_of_Ryloth_(Diversity_Alliance_Crisis)",
  "/wiki/Kur_(Twi%27lek)",
  "/wiki/Rising_Star",
  "/wiki/Coruscant/Legends",
  "/wiki/Young_Jedi_Knights:_Shards_of_Alderaan",
  "/wiki/Young_Jedi_Knights:_Diversity_Alliance",
  "/wiki/Young_Jedi_Knights:_Delusions_of_Grandeur",
  "/wiki/Young_Jedi_Knights:_Jedi_Bounty",
  "/wiki/Young_Jedi_Knights:_The_Emperor%27s_Plague",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/Star_Wars:_Boba_Fett",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Nosaurians",
  "/wiki/Star_Wars_Gamer_9",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_100",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Tinker,_Tailor,_Soldier,_Praji",
  "/wiki/StarWars.com",
  "/wiki/The_Essential_Atlas",
  "/wiki/Databank_(original)",
  "/wiki/The_History_of_the_Mandalorians"
 ]
}