{
 "name": "Nollo_Kanx",
 "display_name": "Nollo Kanx",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fathoms"
     ]
    }
   ]
  }
 ],
 "content": "Nollo Kanx was a male Quarren thug who worked as an enforcer for the Mon Calamari crime lord Odanni. He was one of the most feared inhabitants of Wildwater City on Mon Calamari.\nNollo began his criminal career as an enforcer who eventually caught the attention of rising criminal mastermind Odanni. He rose up to become her right-hand man tasked with eliminating troublemakers and rivals. He specialized in assassinations with exotic poisons and would carry a variety of poisons and injectors on his person. He poisoned Geffa, a Rodian that attempted to strong-arm credits out of Odanni. He would also eliminate targets by taking them on a submersible ride to Rako's Rift where he would feed his passenger to the Krakana.\nNollo was only a moderately talented combatant, being skilled, but not exceptional with blasters and hand-to-hand combat. He was very skilled at biochemistry and created and tested new poisons that he extracted from Mon Calamari's flora and fauna.\nNollo Kanx was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Joel Carroll.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fathoms",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Odanni",
  "/wiki/Wildwater_City",
  "/wiki/Dac",
  "/wiki/Geffa",
  "/wiki/Rodian/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Submersible",
  "/wiki/Rako%27s_Rift",
  "/wiki/Krakana/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Mon_Calamari_(planet)",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Joel_Carroll",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}