{
 "name": "Nomar Organa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Nomar Organa was a male Human Jedi Master who was the youngest son of the third brother of the Count of Organa during the Cold War.\nAs a young boy he was discovered to be Force-sensitive and as such given to the Jedi Order to be trained in their ways. Despite rules against maintaining attachment to family, Organa was able to return to Alderaan as a Padawan. In 3666 BBY he met and fell in love with one of the daughters of House Rist, Rehanna. Their relationship was seen in a positive light by the two houses who negotiated an alliance over their marriage. The Jedi Order, however, did not approve when the news reached them and refused to engage a Jedi in local politics. On their order, Organa broke off his marriage and returned to serve the Order.\nTwenty-three years later, during the Alderaan Civil War, a Sith named Kallig arrived on Alderaan searching for an artifact of Tulak Hord. The artifact was kept sealed within the Elysium and Nomar's key is required to access it. With the aid of Elana Thul, Kallig discovered the holorecording of Organa breaking off his engagement in the archives of House Alde. Kallig then confronted Rehanna in House Rist's fortress, coercing her into arranging to meet with Organa in the old Killik tunnels. Once confronted, the Jedi Master proved no match against the Sith and was killed.\nWhile dreamwalking on Voss to subdue Force ghosts bound to Kallig via the Force walk, the ghost of Kalatosh Zavros took the form of Nomar Organa in an attempt to kill Kallig.\nNomar Organa is voiced by Yuri Lowenthal. The player can choose to either outright kill Nomar Organa  or coerce Rehanna beforehand  into trying to rekindle their relationship. If the latter is chosen, Nomar and his Padawans will be waiting in front of the Elysium to stop Kallig from taking the artifact either way.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/3643_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Count/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/3666_BBY",
  "/wiki/House_Rist",
  "/wiki/Rehanna_Rist",
  "/wiki/Marriage/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Alderaan_Civil_War",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Nox",
  "/wiki/Tulak_Hord",
  "/wiki/Elysium",
  "/wiki/Elana_Thul",
  "/wiki/House_Alde",
  "/wiki/Killik/Legends",
  "/wiki/Death/Legends",
  "/wiki/Voss",
  "/wiki/Force_ghost",
  "/wiki/Force_walk",
  "/wiki/Kalatosh_Zavros",
  "/wiki/Yuri_Lowenthal",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}