{
 "name": "Noni",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kowakian monkey-lizard"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Graf family"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Emil Graf"
     ]
    }
   ]
  }
 ],
 "content": "Noni was a female Kowakian monkey-lizard kept as a pet by Emil Graf. She travelled with her master across Wild Space aboard the scout ship Star Herald alongside the BB-series astromech droid BB-00 \"Boo\" and the monster droid, CR-8R \"Crater.\" The crew shared stories together, often relating to their experiences with each other on the starship.\nNoni was known to steal many objects on the Star Herald, much to the annoyance of Crater. She would steal his tools including a laser-caliper and multiple hydrospanners Crater found her to be a nuisance and even at times wished to get rid of her. The two argued many times with Noni often getting the better of Crater. But Graf would always try to find a compromise between the two. Noni also displayed a large degree of intelligence, which she displayed on many occasions, including saving Crater.\nBut Noni was also very intelligent and always had a smart plan to save the day if necessary. During a mission-gone-wrong at the Lost Library of Nelgenam, Noni rebooted Crater and Boo with the wires of destroyed librarian droids after they had been shocked by a Tarinna. They were able to distract the Tarinna long enough to save Graf and eventually drop a bookcase on the Tarinna.\nNoni was a pet female Kowakian monkey-lizard. Owned by Emil Graf, she travelled Wild Space on the Star Herald with her owner, the monster droid, CR-8R \"Crater\" and the BB-series astromech droid BB-00 \"Boo.\"\nBetween 34 ABY and 35 ABY, Crater was very frustrated after Noni had stolen his laser welder again. Noni knew that Crater needed the tool to fix the power stabilizer and that his repulsors were not strong enough to fly after her. Crater didn't understand the Graf family's obsession with pets and suggested getting rathtars over Noni. Graf noted that Noni always thought she could outsmart Crater which reminded him of a story his great-aunt Lina Graf once told him.\nGraf explained the moral of the story was that you are not as smart as you think. Crater agreed and then activated the sprinkler system, which scared Noni causing her to give up the laser welder. Graf returned the welder to Crater, much to the annoyance of Noni.\nNoni was sitting next to Graf on the Star Herald when he told a story about the boy Mattis Banz standing up to a bully.\nBack on the Star Herald, Graf was spending time with Noni, complimenting her on her looks. But Crater did not hold the same thoughts as Graf and instead thought Noni was ragged beast who looked like she got scrapped from a hull.Graf disagreed and dared Crater to name a creature cuter than her. Crater obliged and listed many creatures until he landed on porg and Graf asked what it was. Crater explained what a porg was and compared that even though a porg could sing, Noni could not. But a porg could cause havoc which Crater noted Noni could do. After the monster droid finished, Graf asked if they should get a porg, but Noni spilled a drink on Crater's, screen and Crater said they only needed one Noni.\nWhile travelling through hyperspace, a strange sound rang throughout the Star Herald. Graf had never heard the sound but Crater explained it was Noni, who tried to sneak into the kitchen for a foodcake through the ventilation ducts but got stuck. Boo wanted Crater to get her cut her out through the wall but then Crater would have to repair more of the ship. He decided to let her suffer in the vents for a little while. Graf knew that Noni could be a lot of trouble, Crater interjected and stated trouble followed her, but he defended her believing that everyone gets in trouble. It reminded him of a story about a boy from Tatooine.\nGraf finished the story and explained to Crater that while Noni does get herself in trouble it is still their job to help her out. Crater agreed that beings should take care of each other but believed Noni was too much work. Meanwhile, Boo was cutting the vent to free her. When Boo took the vent off, Noni came flying out and crashed into the droid. Crater then prepared to clean up after Noni as Boo zapped her. But Graf believed Noni would do the same for Crater.\nWhile the Star Herald was traveling through an asteroid field, Crater gave chase to Noni after she stole his hydrospanner. Graf noted that it looked like Noni was in love with the hydrospanner and wouldn't give it up anytime soon. Crater thought it was nonsense to be in love with an inanimate object but Graf knew a story where it had occurred. After the story, Crater didn't believe Graf could compare it to the hydrospanner he needed. But Graf thought Noni's heart wanted it as she hugged the hydrospanner.\nSometime later, on a planetoid, Noni helped the crew attempt to scare mynocks from the Star Herald. After Crater told a story, the crew successfully removed the mynocks and she swung from a vine to celebrate.\nWhile docked at a space station, Noni was present when Boo accused Graf of stealing his laser-caliper. Graf tried to defend himself but Boo through an insult at him as Noni ran away worried. Graf then told the droids a story about mistaken identity. After finishing the story, Graf found the laser-caliper in Noni's bed. But Boo made an excuse that he could not tell the two apart half of the time.\nNoni was present with the rest of the crew before they travelled through the Shosho Belt to reach the Shosho Outpost. After a bumpy ride, the crew was very dizzy as they relaxed at the outpost.\nAfterwards, Crater ordered Boo to close all the vents as the two joined forces to locate Noni who had stolen Boo's radar receiver. Graf was wondering what was going on and didn't believe tearing up the ship was the answer. But Crater was would not stop at anything to get her. This reminded Graf of a story at Mos Eisley Cantina. After the story ended, Graf came up with a simpler solution to locating Noni. He placed a cake on the floor and waited for Noni to appear because she loved cake. Noni soon fell for the trap and ate the cake.\nWhile stopping at a jungle location, Boo insulted Crater in a manner that caused Noni to burst out laughing. Noni then climbed on to Graf's shoulder as he told a story relating to the issue.\nCrater was once again angry with Noni after discovered that she got jogan fruitcake all over his new hydrospanner. Crater told Graf she was driving him mad. Graf thought it was unusual but Crater thought she was a menace. But Graf told Crater that he needed to appreciate the people in his life and told him a story about Majordomo Bib Fortuna.\nBut Crater failed to follow how the story related to Noni. Graf explained that even though she is not as hard working as Bib Fortuna, she was still vital to the day-to-day operations on the Star Herald. Just then as Crater approached a live wire, Noni jumped out and pushed him away, saving him from short circuiting. Crater thanked Noni and recognized she was a vital part to the crew.\nGraf was chased by First Order stormtroopers after he stole the coordinates to the Lost Library of Nelgenam. He chased the troopers to the Star Herald, where Crater was organizing the memory spheres. But Noni knocked out all the spheres to trip up the stormtroopers to provide the time to escape. Crater thought Noni was a menace but the plan worked. Noni journeyed to the ruins of the library with the crew, where they were all almost crushed by boulders when they entered.\nAfter freeing Boo from the wreck-weavers, Noni came running over to Graf with a worried look on her face. Graf told her the spiders were gone and there was nothing to be afraid of until two librarian droids appeared, angry at all the noise being made. Noni hide behind Graf as he asked for directions but the droids were still angry about the noise and drew their blasters on Graf and Noni. The droids open fired, launching Graf and Noni airborne from the explosions. Noni rode on Graf's back as they ducked for cover behind a large bookself. But they quickly moved to Crater's position where Graf and the droid developed a plan to take down the droids.\nAfter defeating the droids, Noni climbed up one of the bookcases and located a memory crystal at the top of the case. Graf realizing it was their chance to not go home empty handed, climbed up the bookcase. But Graf slipped and fell but he was rescued by Noni, who used her tail to grab his boot and rescue him. Graf then tried helped Noni get the crystal out but they were having difficulties. Then, someone shocked Crater and Boo, shutting them down and a figure appeared behind Noni and Graf. The figure revealed itself to be a Tarinna and they planned to take the memories of Graf.\nNoni ran away to Crater and Boo as the Tarinna pulled the memories from Graf. Trying to reactivate the droids, Noni grabbed the wires from the librarian droids and stuck them to Crater and Boo, causing them to boot back up. Crater was disgusted to see Noni but focused on rescuing Graf instead. He managed to distract the Tarinna long enough for Graf to escape. While Crater distracted the Tarinna again, Graf and the others pushed the bookcase over and onto the Tarinna. The crew then left Nelgenam.\nNoni had red skin with yellow eyes and purple hair. She possessed a cocky attitude towards others, especially Crater, and she would often steal tools from him. Crater looked down on her most of the time and saw her as more of nuisance than a crewmember. But Noni found enjoyment in stealing his tools and would sometimes show a sense of humor. But her cocky, overconfident attitude did work against her on multiple occasions. She could be tricked into returning stolen items with food, including the joogan fruitcake and sometimes believed she had gotten away with stealing too early.\nNoni's relationship with her owner, Graf was much more of a pleasant one compared to Crater. Graf often complimented Noni and stuck up for her when Crater would accuse her of theft. Noni did show that she cared about Crater, even if the two were always at each other. She saved his life from a live wire and helped throw a bookcase on a Tarinna attacking him.\nNoni first appeared in the back up story, \"Tales from Wild Space: Stop, Thief!\" in the premier issue of the 2017 Star Wars anthology comic series, Star Wars Adventures. The story was written by Cavan Scott, illustrated by Jon Sommariva, and published on September 6, 2017.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kowakian_monkey-lizard",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Graf_family",
  "/wiki/Emil_Graf",
  "/wiki/Wild_Space",
  "/wiki/Scout_ship",
  "/wiki/Star_Herald",
  "/wiki/BB-series_astromech_droid",
  "/wiki/BB-00",
  "/wiki/Monster_droid",
  "/wiki/CR-8R",
  "/wiki/Starship",
  "/wiki/Laser-caliper",
  "/wiki/Hydrospanner",
  "/wiki/Time",
  "/wiki/Standard_day",
  "/wiki/Lost_Library_of_Nelgenam",
  "/wiki/Librarian_droid",
  "/wiki/Unidentified_Tarinna",
  "/wiki/Tarinna",
  "/wiki/34_ABY",
  "/wiki/35_ABY",
  "/wiki/Laser_welder",
  "/wiki/Power_stabilizer",
  "/wiki/Rathtar",
  "/wiki/Lina_Graf",
  "/wiki/Mattis_Banz",
  "/wiki/Fikk",
  "/wiki/Hull",
  "/wiki/Porg",
  "/wiki/Hyperspace",
  "/wiki/Anakin_Skywalker",
  "/wiki/Tatooine",
  "/wiki/Droid",
  "/wiki/Asteroid_field",
  "/wiki/Unidentified_planetoid_(Emil_Graf)",
  "/wiki/Mynock",
  "/wiki/Vine",
  "/wiki/Space_station",
  "/wiki/Shosho_Belt",
  "/wiki/Shosho_Outpost",
  "/wiki/Radar/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Cake",
  "/wiki/Jungle",
  "/wiki/Jogan_fruitcake",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/First_Order",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Trooper",
  "/wiki/Memory_sphere",
  "/wiki/Stormtrooper",
  "/wiki/Library",
  "/wiki/Wreck-weaver",
  "/wiki/Spider",
  "/wiki/Blaster",
  "/wiki/Memory_crystal",
  "/wiki/Boot",
  "/wiki/Nelgenam",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Tales_from_Wild_Space:_Stop,_Thief!",
  "/wiki/Star_Wars_Adventures_(2017)_1",
  "/wiki/2017",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Cavan_Scott",
  "/wiki/Jon_Sommariva",
  "/wiki/September_6",
  "/wiki/Tales_from_Wild_Space:_Mattis_Makes_a_Stand",
  "/wiki/Star_Wars_Adventures_(2017)_4",
  "/wiki/Tales_from_Wild_Space:_The_Best_Pet",
  "/wiki/Star_Wars_Adventures_(2017)_5",
  "/wiki/Tales_from_Wild_Space:_Podracer%27s_Rescue",
  "/wiki/Star_Wars_Adventures_(2017)_6",
  "/wiki/Tales_from_Wild_Space:_Gonk!",
  "/wiki/Star_Wars_Adventures_(2017)_8",
  "/wiki/Tales_from_Wild_Space:_IG-88_vs._the_Gatto_Gang",
  "/wiki/Star_Wars_Adventures_(2017)_9",
  "/wiki/Tales_from_Wild_Space:_The_Blue_Brothers",
  "/wiki/Star_Wars_Adventures_(2017)_13",
  "/wiki/Tales_from_Wild_Space:_The_Big_March",
  "/wiki/Star_Wars_Adventures_(2017)_19",
  "/wiki/Tales_from_Wild_Space:_The_Heist",
  "/wiki/Star_Wars_Adventures_(2017)_21",
  "/wiki/Tales_from_Wild_Space:_A_Tauntaun_Tail",
  "/wiki/Star_Wars_Adventures_(2017)_22",
  "/wiki/Tales_from_Wild_Space:_Majordomo,_Major_Problems",
  "/wiki/Star_Wars_Adventures_(2017)_23",
  "/wiki/The_Lost_Stories,_Part_1",
  "/wiki/Star_Wars_Adventures_(2017)_30",
  "/wiki/The_Lost_Stories,_Part_2",
  "/wiki/Star_Wars_Adventures_(2017)_31",
  "/wiki/The_Lost_Stories,_Part_3",
  "/wiki/Star_Wars_Adventures_(2017)_32",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Battle_of_Exegol",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/June_14",
  "/wiki/January_10",
  "/wiki/2019"
 ]
}