{
 "name": "Nooranbakarakana",
 "display_name": "Nooranbakarakana",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 230 BBY",
      "Starlight Beacon",
      "Eiram system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Frozian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Nooranbakarakana, often referred to as Nooran, was a Frozian female Jedi Knight who served the Jedi Order during the High Republic Era. Jedi Master Stellan Gios knew of Nooranbakarakana by reputation alone. She was among many Jedi who attended the Valo Republic Fair, and helped fight the Nihil when they attacked it. Nooranbakarakana later participated in the Unified Republic Task Force dedicated to ending the Nihil threat.\nNooranbakarakana was a Frozian Jedi Knight who served the Jedi Order during the High Republic Era. She was known by reputation to Jedi Master Stellan Gios, who spotted her among many Jedi who attended the Valo Republic Fair. Later, during the Nihil attack on Valo, she was among the assembled Jedi and Galactic Republic forces who checked in with Gios after Padawan Ram Jomaram restored communications channels.\nAfter the Valo attack, the Republic and Jedi set up a Unified Republic Task Force to go after the Nihil, in which Nooranbakarakana participated. During the Battle of Galov, she served on the bridge of the cruiser Ataraxia, as part of the force responding to a distress call from a relay post under attack by Lourna Dee's Tempest. The Task Force successfully prevented the Nihil from taking the station, rescuing two survivors and capturing several of the marauders, including a disguised Lourna Dee, who was presumed dead by the Jedi and Republic forces.\nWrongly believing that Dee had been the Eye of the Nihil, the Jedi of Starlight Beacon then set their sights on identifying her successor, and on gathering whatever information they could about the Nihil's plans. To achieve this, Marshal Avar Kriss and the Starlight Jedi, including Nooranbakarakana, staged a skirmish in the Soola system, disguising two of their Knights as Nihil in the hope that they could then infiltrate the marauders' ranks. The chosen Jedi, Keeve Trennis and Terec, attacked Wayseeker Orla Jareni's starship Lightseeker in the captured Stormship Ransacker, prompting her to send a distress signal to the Ataraxia, while Trennis in turn sent a signal to the Nihil. After the Ataraxia's drift of Jedi Vectors had launched, Nooranbakarakana alerted Kriss that the scanners were picking up multiple readings of other ships about to emerge from hyperspace, responding to the distress call Trennis had sent. Confirming that she had detected the approaching ships' song in the Force, Kriss ordered the Vectors to prepare for incoming. Emerging from hyperspace, Nihil ships from Zeetar's Tempest attached magclamps to the Ransacker in what they believed to be a rescue. Nooranbakarakana soon confirmed that the pirates had jumped back into hyperspace, taking the undercover Jedi with them.\nDuring Trennis and Terec's mission at the Warcloud Forge on Xais, Nooranbakarakana and the other Jedi onboard the Ataraxia continued to monitor the situation. When Zeetar ordered the two false Nihil to execute the Jedi's former ally Myarga the Hutt as a test, Jedi Knight Ceret sensed their bond-twin's distress, informing Marshal Kriss. Nooranbakarakana noted that such unease is common during such missions, but Ceret informed her of Myarga's involvement. Concerned, Kriss ordered Nooran to follow the coordinates provided by Ceret. Later, under torture by Zeetar, Myarga revealed Trennis and Terec's true identities, forcing them into a fight with Zeetar and members of his Tempest. This was interrupted by Lourna Dee, who killed Myarga and, by revealing her survival to Terec, made Ceret and the other Jedi aware as well. Using the opportunity presented to her, Dee ordered Doctor Kisma Uttersond to test the Great Leveler on Trennis and Terec, cutting off the latter's connection with their bond-twin. Nooranbakarakana was shocked by this, remarking that she had never heard Ceret refer to themselves with the singular \"I\". Nooran, along with the others on the Ataraxia's bridge, was dismayed when Ceret collapsed to the floor and began to calcify in a similar manner to Jedi Master Loden Greatstorm.\nAs Ceret struggled, Marshal Kriss found that she could not sense either of the Kotabi twins in the Force. Though Ceret was determined to reach Terec's location, Nooranbakarakana expressed doubt that such a move was wise, advising them to instead go to the Ataraxia's sick bay. Panicking, Ceret threw Nooranbakarakana out of her chair and took the controls. While Kriss helped the Frozian to her feet, Ceret redirected the ship to Xais. After emerging from hyperspace, the ailing Kotabi sank into a hibernation trance, as Nooranbakarakana called for the Marshal. While the Jedi checked on Ceret, the Ataraxia was hit by fire from Nihil ships, prompting Kriss and Sskeer to man their Vectors, leaving Nooran and Galdros to helm the cruiser. During the battle, Nooranbakarakana informed Kriss of the fighters' origin, the refinery, with Sskeer soon confirming his sighting of the Ransacker. Eventually Sskeer would leap from his Vector, aggressively taking on several Nihil on the ground, eliciting a shocked response from Kriss. After defeating the marauders, Sskeer and Kriss were reunited with Trennis and Terec, the former in severe distress, the latter in a hibernation trance like their twin. As the Jedi recovered, Lourna Dee fled the planet, despite the exhausted and anguished Kriss' best efforts to stop Dee's ship using the Force.\nAs a Frozian, Nooranbakarakana had black eyes and was covered in brown fur, with long, delicate fingers and facial whiskers. During the staged skirmish in the Soola system, she remained calm while reporting to Marshal Kriss, showing her relatively laidback yet well-focused nature.\nNooranbakarakana wore cream and brown Jedi robes. She wore a headset while serving on the Ataraxia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Starlight:_Past_Mistakes",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/230_BBY",
  "/wiki/Starlight_Beacon",
  "/wiki/Eiram_system",
  "/wiki/Frozian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Knight",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_Master",
  "/wiki/Stellan_Gios",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Nihil",
  "/wiki/Attack_on_Valo",
  "/wiki/Unified_Republic_Task_Force",
  "/wiki/Jedi",
  "/wiki/Valo",
  "/wiki/Galactic_Republic",
  "/wiki/Padawan",
  "/wiki/Ram_Jomaram",
  "/wiki/Battle_of_Galov",
  "/wiki/Bridge_(starship)",
  "/wiki/Cruiser",
  "/wiki/Ataraxia",
  "/wiki/Distress_signal",
  "/wiki/Relay_Post_Epsilon_One",
  "/wiki/Lourna_Dee",
  "/wiki/Tempest",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Marshal",
  "/wiki/Avar_Kriss",
  "/wiki/Skirmish_in_the_Soola_system",
  "/wiki/Soola_system",
  "/wiki/Keeve_Trennis",
  "/wiki/Terec",
  "/wiki/Wayseeker",
  "/wiki/Orla_Jareni",
  "/wiki/Starship",
  "/wiki/Lightseeker",
  "/wiki/Stormship",
  "/wiki/Ransacker",
  "/wiki/Drift",
  "/wiki/Jedi_Vector",
  "/wiki/Hyperspace",
  "/wiki/The_Force",
  "/wiki/Zeetar%27s_Tempest",
  "/wiki/War_cloud",
  "/wiki/Xais",
  "/wiki/Myarga",
  "/wiki/Hutt",
  "/wiki/Ceret",
  "/wiki/Bond-twins",
  "/wiki/Doctor",
  "/wiki/Kisma_Uttersond",
  "/wiki/Great_Leveler",
  "/wiki/Loden_Greatstorm",
  "/wiki/Kotabi",
  "/wiki/Medical_bay",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Jedi_robes",
  "/wiki/Headset",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Nooranbakarakana",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Nooranbakarakana",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Death",
  "/wiki/The_High_Republic_(2021)_12"
 ]
}