{
 "name": "Norba_Nuum",
 "display_name": "Norba Nuum",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Smarteel"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5 BBY",
      "Smarteel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cabrool Nuum's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Norba Nuum was the daughter of Cabrool Nuum and the sister of Rusk Nuum. Although she seemed to be quiet and reserved alongside her brother, Norba was in fact the most ambitious of Cabrool's children.\nWhen Rusk had Jabba Desilijic Tiure locked in the dungeon for refusing to kill family enemy Vu Chusker, Norba freed him on the condition that he kill her brother for her, thereby making her the sole heir to the Nuum family's criminal empire. However after Jabba killed Rusk, Norba betrayed him, ordering her guards to take Jabba back to the dungeon for murdering her brother.\nLater, Norba came down to Jabba's cell and offered to set him free if he promised to kill Vu Chusker, even showing him the key that would unlock the door of the cell. Sick and tired of this back and forth business, Jabba told Norba he would whisper his answer to her. When Norba leaned in close to listen, Jabba's tongue snaked out and grabbed Norba, pulling her through the window in the cell door and directly into his gaping maw. He then proceeded to swallow her whole. After a brief struggle, she dropped the key right into Jabba's hand, allowing the Hutt to escape the dungeon, with Norba Nuum still struggling and digesting alive inside of him. She was the last of the Nuum House to be killed, after her father and brother.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Smarteel",
  "/wiki/5_BBY/Legends",
  "/wiki/Cabrool_Nuum%27s_species",
  "/wiki/Gender/Legends",
  "/wiki/Cabrool_Nuum",
  "/wiki/Rusk_Nuum",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Vu_Chusker",
  "/wiki/Jabba_the_Hutt:_The_Dynasty_Trap",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_64",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}