{
 "name": "Nord_(Imperial)",
 "display_name": "Nord  (Imperial)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Tarkin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Nord was a Human male Imperial colonel stationed on the Tarkin superweapon as a member of the bridge crew. He became involved in a conspiracy to assassinate Darth Vader, due to his frequent executions of officers for minor failures. The colonel gave the order to fire the superlaser aboard the Tarkin when a strike team of Rebel Alliance saboteurs was attempting to escape, but Leia Organa had sabotaged the firing mechanism, which caused the superlaser to explode and destroy the station. Nord and everyone else aboard was killed.\nNord was a Human male Imperial officer who held the rank of colonel and was stationed aboard the Tarkin superweapon, a large space station with a superlaser similar to that of the Death Star, as a member of its bridge crew in 3 ABY. He became involved with a group of officers planning to kill Darth Vader due to the Dark Lord's ruthlessness when dealing with mistakes made by his subordinates. Nord met with his fellow conspirators, including General Biel, not long after the Dark Lord's arrival and agreed to take action against him.\nWhen Vader planned to confront the Rebel Luke Skywalker, a member of a Rebel strike team that infiltrated the Tarkin, Nord took advantage of this opportunity and opened an airlock near the Dark Lord. He hoped that the Sith would be pulled out into the vacuum of space. But Vader called upon the dark side of the Force to aid him in surviving the pull of air, making it back onto the Tarkin. Nord realized that this failure had given him away, but he gained a temporary reprieve as Vader was focused on capturing the escaping Rebels.\nSeveral TIE Series starfighters, including one TIE Advanced x1 piloted by Vader, engaged the Rebels' craft. However, the Millennium Falcon intervened, and the engagement had left Vader's craft crippled. Seeing another opportunity to assassinate Vader, Nord ordered the Tarkin's superlaser fired at the Rebels, hoping Vader would be caught in the blast. But the Rebels had sabotaged the firing mechanism, causing the Tarkin to self-destruct, ending both the conspiracy and the officers' lives, including the colonel's.\nNord appeared to be a compliant Imperial officer to Darth Vader, but he was secretly part of a group of Imperials aboard the Tarkin that wanted to kill the Dark Lord to stop his frequent executions of their fellow officers. He also disliked the Rebels and wanted to eliminate them as well as Vader. The colonel had fair skin and wore a standard grey Imperial officer's uniform.\nColonel Nord first appeared in the fifty-second issue of the Marvel Star Wars comic series, To Take The Tarkin, published in 1981, and was later mentioned in the 2011 short story Vader Adrift, which was published in the Star Wars Insider Special Edition 2012.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Tarkin_(superweapon)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Superlaser/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Death_Star/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/General/Legends",
  "/wiki/Biel",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Infiltration_of_the_Tarkin",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/TIE_Series",
  "/wiki/Starfighter/Legends",
  "/wiki/TIE_Advanced_x1/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_(1977)_52",
  "/wiki/Vader_Adrift",
  "/wiki/Star_Wars_Insider_Special_Edition_2012",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}