{
 "name": "Norrin Vaxx",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Norrin Vaxx was a male Human native of Coruscant who had a low sensitivity to the Force. He ended up becoming a top contender in the gladiatorial Dool Arena.\nBorn on Coruscant, Norrin had a natural ability to command the Force but his overall power was meager at best. Unable to rely upon his Force powers he turned to other avenues to get by, namely gambling and fighting. Over the years he had been slowly consumed by the dark side of the Force. Although he was Force-sensitive, his powers were so weak that the Galactic Empire did not bother to send anyone to hunt him down.\nHe eventually became a top contender in the Dool Arena on Reuss VIII. It was at the arena when Greel, one of the arena's owners, matched Norrin up against a new challenger Lusubrin T'shkali. Norrin was disappointed with the match up as the Nagai challenger was still a new-comer to the arena.\nNorrin's fighting style was similar to his gambling philosophy in that he would take risks if he thought the rewards outweighed the danger.\nHe was average-looking with green eyes and silvery hair. He was also one of the oldest contenders in the Drool Arena.\nAlthough he had learned quite a few different ways to control the Force, his powers were always very weak and had very little impact.\nHe did train with a lightsaber and was skilled enough in combat that he was able to become a top contender in the Dool Arena.\nIn addition to his yellow-bladed lightsaber he carried a BlasTech DL-18 blaster pistol, although he was not allowed to use the blaster in the arena.\nNorrin Vaxx was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Dool_Arena",
  "/wiki/Force_power/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Reuss_VIII",
  "/wiki/Greel",
  "/wiki/Lusubrin_T%27shkali",
  "/wiki/Nagai",
  "/wiki/Lightsaber/Legends",
  "/wiki/Color/Legends",
  "/wiki/BlasTech_Industries/Legends",
  "/wiki/DL-18_Blaster_Pistol",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997"
 ]
}