{
 "name": "North-3",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 BBY",
      "Ferrix"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Preox-Morlana",
      "North Team",
      "North Team"
     ]
    }
   ]
  }
 ],
 "content": "North-3 was the callsign of a human individual who served in the Preox-Morlana Corporate Tactical Forces. During the time of the Galactic Empire, North-3 participated in an mission to try and arrest Cassian Andor.\nDuring the time of the Galactic Empire, the human male was a corpo in the Corporate Tactical Forces of the Pre-Mor Enforcement, the security detachment of the polity Preox-Morlana. In 5 BBY, two Pre-Mor sentry guards were killed when they harassed the human Cassian Andor, leading Deputy Inspector Syril Karn to investigate their deaths. After Karn identified Andor and traced him to the planet Ferrix, he assembled a strike team led by Sergeant Linus Mosk to apprehend the culprit. The human was among those picked, and was assigned to North Team under the callsign \"North-3.\"\nThe strike team, divided into North Team, East Team and West Team, travelled for Ferrix on a personnel carrier. On board, Mosk briefed the teams on Andor, assigning North and East Team to take position for a pincer movement incase Andor tried to flee while Karn and the sergeant were to lead West Team to go and arrest their target. North-3 stood behind the rest of the corpos at that time, carrying a blaster rifle over his shoulder. Mosk amused the group with remarks about the Ferrix residents, allowing Karn to give a short speech before he dismissed them.\nArriving at Ferrix, the three teams deployed on Mobile Tac-Pods, North Team's transport landing in a salvage yard. North-3 followed behind his three fellow team members, as they disembarked to reach their position. As the teams tracked Andor's position in a city, locals began sounding a signal, and the salvager Brasso got to chaining North Team's Tac-Pod to a heavy piece of scrap. In the meantime, North Team made their way through the city's North Stairs Lane when they came across the mechanic Bix Caleen, who immediately fled from their presence. The team arrested Caleen.\nWhile North Team waited at an alleyway with their new captive, East Team engaged Andor in a building, West Team making their way to join the fight. After Caleen was tied up, her lover, Timm Karlo, arrived and tried to intervene. Despite team leader \"North-1\"'s orders to stop, Karlo charged forward, prompting North-3 to fire at him. The shot struck Caleen's lover in the chest and killed him immediately. North-3 looked shocked at what he had done and removed his hat. North-1 then asked for his rifle and took it from him as he questioned it. North-3's superior then told him to get back to their team's Tac-Pod and get it in the air with the radio on.\nNorth-3 ran back to the pod and got it flying. However, the piece of scrap rigged to the transport led the corpo to struggle to control the Tac-Pod. As North-3 kept flying the pod, the scrap then anchored in some large machinery. The anchor led the Tac-Pod to crash into a structure, killing North-3. The explosion led Mosk to wonder if his group was being flanked by enemies. The other corpos were ultimately unsuccessful in catching Andor, and the deaths of North-3, three other corpos, and Karlo were among the features that brought the incident to the attention of the Empire's Imperial Security Bureau, who took away Pre-Mor enforcement's jurisdictions.\nNorth-3 lacked a degree of discipline, as exemplified by his premature shooting of Timm Karlo, and reacted with indignity and anger when his commanding officer North-1 subsequently removed him from their team's current assignment. By the time he returned to the team's Tac-Pod, he was still visibly upset and failed to notice that a large piece of scrap metal had been attached to the Tac-Pod with a heavy cable.\nLike other Corporate Tactical Forces ground troops, North-3 wore a gray-blue jumpsuit with an orange-brimmed cap, blue boots and gloves, and a similarly-colored light armored vest with spaulders. He, along with North-1, carried a blaster rifle which physically resembled a carbine variant of the SE-14C blaster pistol.\nNorth-3 first appeared in the second episode of the live-action Disney+ series Andor, directed by Toby Haynes and released on September 21, 2022. The character was portrayed by Richard Henderson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_BBY",
  "/wiki/Ferrix",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Preox-Morlana",
  "/wiki/North_Team",
  "/wiki/Callsign",
  "/wiki/Corporate_Tactical_Forces",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Corpo",
  "/wiki/Pre-Mor_Enforcement",
  "/wiki/Politics",
  "/wiki/Death",
  "/wiki/Deputy_Inspector",
  "/wiki/Syril_Karn",
  "/wiki/Planet",
  "/wiki/Sergeant",
  "/wiki/Linus_Mosk",
  "/wiki/East_Team",
  "/wiki/West_Team",
  "/wiki/Preox-Morlana_personnel_carrier",
  "/wiki/Blaster_rifle",
  "/wiki/Mobile_Tac-Pod",
  "/wiki/Transport",
  "/wiki/City",
  "/wiki/Brasso",
  "/wiki/Technician",
  "/wiki/Bix_Caleen",
  "/wiki/Timm_Karlo",
  "/wiki/North-1",
  "/wiki/Rifle",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Commanding_officer",
  "/wiki/Color",
  "/wiki/Armor",
  "/wiki/SE-14C_blaster_pistol",
  "/wiki/That_Would_Be_Me",
  "/wiki/Disney%2B",
  "/wiki/Andor_(television_series)",
  "/wiki/Toby_Haynes",
  "/wiki/September_21",
  "/wiki/2022",
  "/wiki/Reckoning_(episode)",
  "/wiki/Aldhani_(episode)",
  "/wiki/StarWars.com",
  "/wiki/Kassa_(episode)",
  "/wiki/September_23",
  "/wiki/Star_Wars"
 ]
}