{
 "name": "Notluwiski_Papanoida",
 "display_name": "Notluwiski Papanoida",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pantora"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.77 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pantoran Assembly",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Baron Notluwiski Papanoida, a Pantoran male, was the chairman of the moon Pantora during the final years of the Galactic Republic. Papanoida was a powerful figure according to his daughter Senator Chi Eekway. Toward the end of the Clone Wars, Papanoida and his daughter were present in a Coruscant opera house when Anakin Skywalker met with Supreme Chancellor Sheev Palpatine.\nNotluwiski Papanoida was a Pantoran male who hailed from the moon Pantora. The Pantoran fathered several children, including Ion, Che Amanwe, and Chi Eekway. Prior to assuming the role of Supreme Chairman of the Pantoran Assembly, Papanoida was a wealthy and well-connected media mogul popular with the people of Pantora. A memorable character in Pantoran society, he had little difficulty cementing himself as a popular choice to take the position of chairman.\nAfter the death of Chairman Chi Cho during a conflict on the ice planet Orto Plutonia during the time of the Clone Wars, Papanoida was sworn in as Pantora's new chairman. When the Trade Federation blockaded Pantora, public unrest threatened to force the moon to secede from the Galactic Republic and join the Confederacy, who were offering aid. Papanoida relied on Senator Riyo Chuchi to plead for assistance in the Senate in ending the blockade. However, the Federation had his two daughters kidnapped as leverage. Papanoida could guess that his daughters might be on the Droid Control Ship blockading Pantora and dispatched Chuchi and Jedi Padawan Ahsoka Tano to go there under the pretense of a diplomatic mission, while he and his son investigate on their own. Whereas the Coruscant Security Force failed to find any clues in his quarters, Papanoida discovered that one of his idols was misplaced and smeared with blood. Analyzing the blood, he found that it belonged to a Rodian bounty hunter named Greedo.\nThe Pantorans traveled to the palace of Jabba Desilijic Tiure on Tatooine, whom Greedo was employed by. Papanoida was able to draw the Rodian out by simply telling a female Twi'lek that they were looking for him. As expected, Greedo came to the Pantorans and attempted to get rid of them, only for Papanoida to pull out a knife and hold it against Greedo's throat. Matters were brought before Jabba, whom Papanoida reasoned with into assisting them, by comparing Greedo's blood to the sample he found on Coruscant. No sooner than Jabba permitted it did Greedo spill that he had Chi Eekway held in Mos Eisley. The Pantorans forced Greedo to lead them to the cantina where Eekway was being held. But things got tense, as Greedo's Gotal partner began to question him. The Rodian turned on the Pantorans and fled the cantina, as all the patrons started firing on them. The Pantorans were able to dispatch all the assailants; Eekway even saved her father's life by shooting the Gotal when he attempted to kill Papanoida when his back was turned. The Pantorans returned to Coruscant as Chuchi and Tano rescued Che Amanwe from the Droid Control Ship. Because the Federation lacked leverage, they were forced to end the blockade of Pantora.\nBy the end of the Clone Wars, Papanoida and his daughter Chi Eekway were present in the Coruscant opera house following the Battle of Coruscant. The two stood outside Supreme Chancellor Sheev Palpatine's seating box when Anakin Skywalker came to visit Palpatine.\nThe chairman of his homeworld Pantora, Papanoida stood at 1.77 meters tall, or 5 feet, 10 inches. He had blue skin, white hair, and brown eyes. He was an ally of the Republic, but was primarily focused on the governing of his people. He was also very crafty, knowing the best way to find Greedo was to allow the Rodian to attack him in public. He was also a wise negotiator, as he successfully implored Jabba the Hutt to listen to his requests by emphasizing they were fellow fathers who would do anything to save their children. Although he was a kind and caring family man, he was also a skilled combatant, wielding two blaster pistols capably during a shootout on Tatooine.\nPapanoida wore a purple Pantoran coat with a matching hat along with a black belt, cane, and boots. He was comfortable in a gunfight, capably wielding two blaster pistols when a confrontation inside Chalmun's Spaceport Cantina escalated.\nBaron Papanoida was played by Star Wars creator George Lucas in Revenge of the Sith. He was voiced by Corey Burton in the Star Wars: The Clone Wars episode \"Sphere of Influence,\" who based his voice on the legendary director Orson Welles.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Notluwiski_Papanoida/Legends",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic",
  "/wiki/Pantora",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Pantoran_Assembly",
  "/wiki/Galactic_Republic",
  "/wiki/Baron",
  "/wiki/Chairman",
  "/wiki/Moon",
  "/wiki/Senator",
  "/wiki/Chi_Eekway_Papanoida",
  "/wiki/Clone_Wars",
  "/wiki/Coruscant",
  "/wiki/Anakin_Skywalker",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Ion_Papanoida",
  "/wiki/Che_Amanwe_Papanoida",
  "/wiki/Supreme_Chairman",
  "/wiki/Death",
  "/wiki/Chi_Cho",
  "/wiki/Battle_of_Orto_Plutonia",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Orto_Plutonia",
  "/wiki/Trade_Federation",
  "/wiki/Blockade_of_Pantora",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Riyo_Chuchi",
  "/wiki/Galactic_Senate",
  "/wiki/Blockade",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Icon_of_the_Moon_Goddess",
  "/wiki/Rodian",
  "/wiki/Bounty_hunter",
  "/wiki/Greedo",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Tatooine",
  "/wiki/Trella_Bare%27Ah",
  "/wiki/Mos_Eisley",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Gotal",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Hat",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Star_Wars",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Corey_Burton",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Sphere_of_Influence",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Starcruiser",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Disney%2B",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_85",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Trespass"
 ]
}