{
 "name": "Nova_(assassin)",
 "display_name": "Nova  (assassin)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Nova was a female Human assassin active during the Galactic Civil War. Her activities earned her the enmity of the Rebellion.\nIn the midst of the Galactic Civil War, a group of Nova's enemies were able to track her down over a period of several months. Abandoning her living quarters at the time, Nova took what little of her belongings she could bring with her and set out to disappear again on a heavily populated Core World. Using her talents in disguise and forgery, she boarded a Corellian Translines flight to the Core under an assumed identity.\nLittle was known of Nova's personal life. However, she was described as self-indulgent, and those seeking her had learned two personal details: that she enjoyed Lorrdian ballet and that she was allergic to fur.\nNova was intended to appear as part of the article Corellian Transliners in Star Wars Adventure Journal 16, which was never published. She appears as the antagonist of the adventure idea Seek and Detain. In it, the players, either Rebel operatives or bounty hunters, were intended to attempt to board the ship on which she is traveling and capture her. Suggested complications included a chase through a crowded passenger deck, a blaster fight in the vessel's engineering section, and a situation in which Nova would take a high-ranking member of the ship's crew hostage. Nova has yet to appear in any published work.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nova_(disambiguation)",
  "/wiki/Canon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Forger_(profession)/Legends",
  "/wiki/Corellian_Translines",
  "/wiki/Lorrdian/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Corellian_Translines_(article)",
  "/wiki/Star_Wars_Adventure_Journal_16",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Star_Wars_Adventure_Journal"
 ]
}