{
 "name": "Nox_Vellam",
 "display_name": "Nox Vellam",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Grand Moff Nox Vellam was a Human male high-ranking Imperial official during the height of the New Order.\nVellam was Governor-General of the Bright Jewel Oversector, which included the Yavin system; because he had failed to locate the Rebel base on Yavin 4 before the destruction of the first Death Star, Emperor Palpatine removed five of the most important planets from his oversector and placed them under the direct rule of Darth Vader, and reassigned his loyal Sector Group commander Admiral Amise Griff to Vader's command.\nVader, however, was still in a healing trance aboard his TIE Fighter, and a minor civil war broke out between the Imperial forces in Bright Jewel Oversector, as the Governor-General dispatched the Star Destroyer Eradicator to hunt down the elite stormtrooper unit commanded by Captain Sodarra, which had been tasked with returning Vader to Coruscant. This brought Executor and Avenger into the area against the man now regarded, in the words of Admiral Kendal Ozzel, as a \"renegade governor\".\nEmpire 14 has portrayed Vader crashing his TIE Fighter after Yavin on the outpost world of Vaal and returning to Imperial Center from there in a Lambda-class shuttle.\nConfusingly, the Executor is supposed to have entered service under Admiral Griff during the final stages of the blockade of Yavin, but she already appears under the command of Kendal Ozzel in Scoundrel's Luck, implicitly earlier in the timeline.\nMore recently, Allegiance shows Ozzel as Captain of the Imperial Star Destroyer Reprisal in 0.5 ABY, while the Executor is already in commission under Admiral Bentro.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Bright_Jewel_Oversector/Legends",
  "/wiki/Yavin_system/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sector_Group/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Amise_Griff",
  "/wiki/TIE_Advanced_x1/Legends",
  "/wiki/Eradicator_(Imperial-class)",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Sodarra",
  "/wiki/Coruscant/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Avenger/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/Empire_14",
  "/wiki/Vaal/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Scoundrel%27s_Luck",
  "/wiki/Allegiance_(novel)",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Reprisal_(Imperial_II-class)",
  "/wiki/0_ABY/Legends",
  "/wiki/Bentro",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_Essential_Guide_to_Warfare"
 ]
}