{
 "name": "Nub",
 "display_name": "Nub",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Rishi Moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Rishi Station unit",
      "Rishi Station unit"
     ]
    }
   ]
  }
 ],
 "content": "\"Nub\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars. He monitored the listening post at the Rishi Station to warn of any impending Separatist attacks near Rishi. When Clone Sergeant O'Niner, the station's commanding officer, lost contact with the deck officer, he ordered Nub and fellow trooper Droidbait to investigate. However, the two were shot and killed by invading battle droids while on their way.\nThe clone trooper known as \"Nub\" was produced in the Kaminoan cloning facilities to serve in the Grand Army of the Republic, during the Clone Wars against the Confederacy of Independent Systems. In 22 BBY, Nub, along with several other rookie clone troopers, was assigned to the Rishi Station, a Republic listening post located on the moon of Rishi. Under the command of Clone Sergeant O'Niner, Nub and the other troopers in the Rishi unit monitored nearby star systems and were tasked with warning the Republic of any Separatist movements.\nUnbeknownst to them, the Separatist General Grievous planned to attack the nearby planet Kamino, the homeworld of all of the clones. In preparation, Separatist forces infiltrated the Rishi Station. When deck officer CT-327 was killed by invading BX-series droid commandos, Sergeant O'Niner lost contact with him on the comlink and ordered Nub and fellow trooper \"Droidbait\" to find CT-327.\nThe two clones put their helmets on and ran through the base toward the entrance, unarmed. On the way, they were met by a squad of commando battle droids, and exclaimed in surprise as the droids fired on them, killing them both. The commotion was heard by the other clones in the base. Sergeant O'Niner grabbed a blaster and tried to engage the commando droids, but was also killed. Despite their comrades' deaths, the remaining clone troopers were able to escape through an air duct, ultimately destroying the station in order to alert the Republic of Grievous's attack.\nLike all clone troopers of the Republic Military, Nub had been grown using the DNA of bounty hunter Jango Fett. As a clone of Fett, Nub was a human and stood at a height of 1.83 meters. He had tan skin, brown eyes, and black hair. When Sergeant O'Niner ordered Nub and Droidbait to find CT-327, Nub promptly obeyed the order—although it cost him his life.\nWhile on duty at the Rishi Station, Nub wore white Phase I clone trooper armor.\nNub first appeared as an unnamed clone in \"Rookies,\" the fifth episode in the Star Wars: The Clone Wars television series' first season, which aired on October 24, 2008. He was identified as \"Nub\" in the episode guide on StarWars.com. Nub's nickname was an acronym that stood for \"Non-Useful Body.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nub",
  "/wiki/Nub/Legends",
  "/wiki/Kamino",
  "/wiki/22_BBY",
  "/wiki/Rishi_Moon",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Rishi_Station_unit",
  "/wiki/File:Nub-Droids.ogg",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Listening_post",
  "/wiki/Rishi_Station",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Rishi",
  "/wiki/Clone_Sergeant",
  "/wiki/O%27Niner",
  "/wiki/Commanding_officer",
  "/wiki/CT-327",
  "/wiki/Trooper",
  "/wiki/CT-00-2010",
  "/wiki/Death",
  "/wiki/Defense_of_Rishi_Station",
  "/wiki/BX-series_droid_commando",
  "/wiki/File:ONiner-You2.ogg",
  "/wiki/Kaminoan",
  "/wiki/Tipoca_City",
  "/wiki/Domino_Squad",
  "/wiki/Moon",
  "/wiki/Star_system",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Planet",
  "/wiki/Homeworld",
  "/wiki/Deck_officer",
  "/wiki/Sergeant",
  "/wiki/Comlink",
  "/wiki/Helmet",
  "/wiki/Squad",
  "/wiki/Commando",
  "/wiki/Battle_droid",
  "/wiki/Droid",
  "/wiki/Blaster",
  "/wiki/Republic_Military",
  "/wiki/DNA",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Rookies",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/October_24",
  "/wiki/2008",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Nub",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Supply_Lines",
  "/wiki/Bombad_Jedi",
  "/wiki/Standard_year"
 ]
}