{
 "name": "Nubassa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Manaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selkath"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Nubassa was a male Selkath who lived during the Jedi Civil War. He was interested in buying alien animals for use in a zoo on Manaan, although due to Manaan's rules in the matter, Nubassa was forced to utilize slightly less-than-legal means. He wanted creatures which were non-sentient and non-carnivorous, and preferred those which were easy to manage.\nWhen Revan offered to donate the colony of gizka that had invaded the Ebon Hawk, Nubassa quickly refused, citing the gizkas' high reproduction rate and the incredible nuisance they posed. However, he accepted the gizka in the end.\nThis is one of the ways that the gizka can be gotten rid of, onboard the Ebon Hawk, another is to use a pellet called gizka poison. This poison can be obtained from various traders, most notably the alien trader at the Tatooine dock. Feed one gizka with the poison and it will attack and spread the lethal effect to its other specie-mates and the \"Trouble with Gizka\" quest is complete.\nAlso, if the player is patient enough to wait until they arrive on the Unknown World, the gizka will leave the ship on their own.\nIf the player favors the dark side, they can use a mind trick to force Nubassa to buy the gizka from them for 700 credits.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Manaan/Legends",
  "/wiki/Selkath/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Alien/Legends",
  "/wiki/Zoo/Legends",
  "/wiki/Gizka/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Gizka_poison",
  "/wiki/Tatooine/Legends",
  "/wiki/Lehon",
  "/wiki/Mind_trick/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}