{
 "name": "Numa",
 "display_name": "Numa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Born",
     "values": [
      "26 BBY",
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1 meter"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown",
      "later pink"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Teal"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Free Ryloth Movement"
     ]
    }
   ]
  }
 ],
 "content": "Numa was a Twi'lek female who lived on the planet Ryloth during the Clone Wars. As a youngling, she befriended two Republic clone troopers, \"Waxer\" and \"Boil,\" during the Separatist invasion of her homeworld. In the years that followed under the reign of the Galactic Empire, Numa joined a rebel cell that operated on Ryloth under the command of Cham Syndulla.\nNuma was a female Twi'lek who grew up on the Outer Rim planet of Ryloth. Numa lived with her father and mother in their humble home, which was located in the small town of Nabat. When Numa was five standard years old, the galaxy-wide conflict known as the Clone Wars came to Ryloth when the Confederacy of Independent Systems invaded Numa's homeworld. The Confederacy's droid army invaded many population centers, subjugating the people and imprisoning them. Nabat was also invaded, and during the early stages of the droid occupation, Numa's home was heavily damaged and her parents were killed. Numa managed to survive and avoid detection from the droids by taking refuge in the town's extensive underground sewer tunnel systems.\nSome time later, the Galactic Republic launched the Battle of Ryloth in order to free Ryloth from the Confederate occupation. During the battle, two Republic clone troopers from Jedi General Obi-Wan Kenobi's 212th Battalion's Ghost Company—\"Waxer\" and \"Boil\"—went on a recon mission to Nabat, where they heard noise in an alleyway. The two troopers investigated the noise, and were surprised to find a young Twi'lek girl, Numa. Young Numa was initially fearful of Waxer and Boil because she thought they were droids; the two troopers wore full body armor and helmets. Numa even bit Boil's finger when he tried to comfort her.\nAfter the trio avoided the detection of a Separatist recon droid, Waxer and Boil removed their helmets and gave Numa a ration bar, explaining their good intentions, and that they were flesh and blood, just like her. Upon seeing the two clones' faces, she realized they were identical, like brothers, so she pointed at each of them and said in her native language of Twi'leki, \"nerra,\" which meant brother. Waxer and Boil spoke only Galactic Basic Standard while Numa spoke only Twi'leki, so the trio could not understand one another through the spoken word. As Numa finished eating the ration bar, Waxer and Boil decided to move on and finish the recon, leaving Numa behind.\nNuma decided to follow them, staying in the shadows behind the two clones as they trekked through Nabat's neighborhoods. Waxer and Boil were fully aware that Numa was following them, but continued on their mission nonetheless. The young girl, however, soon weaved her way to stand in front of the clones, surprising them with her stealthiness, then she again called \"nerra\" and ran towards her half-destroyed home. Waxer and Boil followed her—though Boil thought it foolish because they were already late meeting up with General Kenobi and the 212th Legion and would be disciplined for getting distracted on their mission.\nInside her home, Numa was overcome with grief, but was comforted when Waxer found and gave her a tooka doll—though she did begin to cry. Waxer hugged Numa and assured that they would keep her safe. Even Boil crouched down and comforted the young girl. Numa then embraced Boil, which startled him. Just then, Boil's comlink sounded: Clone Commander CC-2224 \"Cody\" was calling. The two troopers realized they were really in trouble and hurried out of Numa's home, wondering how they were going to explain Numa to Cody and Kenobi.\nHowever, Numa noticed the presence of several fierce Rylothian carnivores closing in on them; a gutkurr hunting pack had been set loose by the tactical droid TX-20, a leader in the Confederate occupation of Ryloth. Two gutkurrs chased the trio back into Numa's home, so Waxer and Boil held the front doors to the structure shut while firing on the beasts with their DC-15A blaster rifles. Numa, meanwhile searched for an escape route, remembering the secret passage under a trap door in the back of her former home. She got the troopers' attention, so they backed up and followed Numa down the hatch and escaped the gutkurrs. The trio made their way through the tunnels and soon emerged again above ground in a different Nabat neighborhood right near Jedi Master Kenobi and Commander Cody, Waxer and Boil's superior officers. Numa hid behind Boil's legs until Kenobi crouched down and spoke to her in Twi'leki, inquiring as to whether Numa could lead the 212th through the tunnels to where the other Twi'leks were being held prisoner. Numa said that she could and grew very excited.\nShortly thereafter, the clones mounted their offensive: Numa guided Waxer, Boil, and Kenobi through the tunnels while sitting on Kenobi's shoulder to Nabat's town center where the Twi'leks were being used as living shield in order to protect the Confederacy's J-1 proton cannon that prevented the Republic from launching a full-out invasion. Kenobi put Numa down, and gave Cody and his troops on the opposite side of the square the signal, and they opened fire on the Confederate B1-series battle droids and other defenses. As the battle raged, Kenobi used his lightsaber to free the Twi'lek prisoners from their stuncuffs and led them to the tunnels past Numa. Numa watched happily as they passed, once again free, and was found by her uncle, Nilim Bril. The two embraced, happy to see each other alive. Kenobi, Waxer, and Boil continued the fight, destroying the Proton cannons, but the droid TX-20 in an Armored Assault Tank knocked the three Republic warriors to the ground with a laser blast. Numa raced from the safety of her uncle and the other Twi'leks and helped Waxer, Boil, and Kenobi to their feet. While Numa helped Kenobi up, TX-20 aimed his tank's laser cannon at Kenobi and Numa, ready to end their lives. However, the rest of the Twi'leks were inspired by Numa's selflessness and so they took up arms against their droid oppressors, climbing TX-20's tank and ripped his mechanical body apart. Kenobi covered Numa's eyes at the violence, but she peeked out and watched anyway.\nWith the proton cannons destroyed, massive Republic Acclamator-class transgalactic military assault ships landed on the outskirts of Nabat and released their cargo—thousands of clone troopers, All Terrain Tactical Enforcers, and All Terrain Reconnaissance Transports. Numa and her uncle watched the landing with other Twi'leks. Waxer waved goodbye to Numa, then Boil did likewise. Numa, however, wanted a better good-bye, so she ran over and hugged Waxer's leg. He told her not to be afraid because after they liberated the planet they would be back. Numa was sad that they had to go, but was glad she at least had her uncle to watch over her. She then called after them \"nerra, nerra\" and waved goodbye to them. Waxer and Boil asked Kenobi what \"nerra\" meant in Twi'leki, and he explained that it meant \"brother.\" The two were amused and waved back to Numa and then continued on their march to liberate Ryloth's capital city of Lessu from the Confederacy.\nThree years before the Battle of Yavin, Numa had become one of Cham Syndulla's best fighters in the Free Ryloth Movement. She and Gobi Glie accompanied Cham on a mission to rendezvous with the Spectres, another rebel cell that was led by Cham's daughter Hera Syndulla. After docking their Nu-class shuttle with the rebel ship Ghost, Numa and her comrades attended a briefing with the Spectres to discuss a plan to take out an Imperial Quasar Fire-class cruiser-carrier orbiting Ryloth. Since the fighter carrier housed TIE/sa bombers that devastated Ryloth, Cham advocated destroying the ship to demonstrate the strength of the Ryloth rebels.\nHowever, Hera disagreed with her father's plan and advocated stealing the cruiser-carrier for the rebellion. After a heated discussion, Cham reluctantly conceded to Hera's plan. In secret, Cham still intended to destroy the Imperial cruiser-carrier and instructed Numa and Gobi to bring a bag of detonators. During the journey to Ryloth, Numa and her Twi'lek comrades pretended to befriend the Spectres. After landing a stolen TIE bomber in the Imperial cruiser carrier, the Ryloth rebels put their plan into action. Under Cham's orders, Numa and Gobi stunned the rebels Ezra Bridger, Sabine Wren, Kanan Jarrus, and Garazeb Orrelios while Cham dealt with Hera and her astromech droid Chopper.\nAfter exiting their TIE bomber, Numa and her companions dispatched a squad of stormtroopers that had been sent to the hangar bay. While Cham proceeded to disable the ship's hyperdrive, Numa and Gobi headed with their detonators to the munitions rack. Shortly later, they were caught up in a gun battle with stormtroopers. Two of the Spectres, Sabine and Zeb, managed to overpower Numa and Gobi by using a rigged mouse droid to stun them. The two rebels then secured their Twi'lek prisoners while the other four rebels convinced Cham to abandon his plan to destroy the Imperial cruiser-carrier.\nWhile Hera reasoned with her father, Sabine played the recording to Numa and Gobi in an effort to convince them to join forces. After several Imperial reinforcements and TIE bombers attempted to reclaim the cruiser-carrier, Numa and Gobi joined forces with Sabine and Zeb in repelling the Imperial forces. In the end, the two rebel forces managed to hijack the Imperial ship and escape the Ryloth system. While leaving, they destroyed an Arquitens-class command cruiser, which boosted the morale of the Ryloth rebels. Having established a working relationship with the rebellion, Numa and her Twi'lek comrades then departed on their shuttle back to Ryloth.\nTwo years before the Battle of Yavin, a new Imperial commander named Grand Admiral Thrawn took charge of the Imperial counterinsurgency campaign against the Free Ryloth movement. By studying Twi'lek culture, art, philosophy, and history, Thrawn was able to devise tactics which led to the capture of Tann Province; the home of Syndulla clan. While Numa and Cham were riding their blurrg mounts to rendezvous with Hera's crew and Gobi, they were pursued by several Imperial scout troopers and an Imperial Troop Transport. Numa and Cham managed to fight off their pursuers long enough for the Ghost to come and pick them up.\nOnce aboard, Numa along with Cham and Zeb knocked out a scout trooper who had climbed aboard the vessel. Later, Numa attended a briefing where Cham outlined the recent events to Hera and her crew. When Ezra asked what a kalikori was, Numa explained that it was a Twi'lek heirloom that was valuable to Hera's family. Numa, Gobi, Cham, and the other rebels volunteered to take part in a mission to recover Hera's Kalikori from the Syndulla residence, which had become the new Imperial headquarters.\nFor the mission, Numa and the other rebels staged a diversionary attack on an Imperial patrol in the Tulara Ravine while Hera, Ezra, and Chopper went to recover the Kalikori. After destroying a troop transport and an AT-DP walker, the rebels fled into the wilderness but were pursued by a second walker. Following a gun battle, Thrawn's second in command Captain Slavin contacted the two rebel cells to inform them that he had captured Hera and Ezra. He threatened to execute the prisoners if Cham failed to surrender by dawn.\nAfter Cham agreed to surrender in return for his daughter and Ezra's lives, Numa and the other rebels traveled to the Syndulla residence in the Ghost. Cham was about to proceed with the exchange when Hera ordered Chopper to detonate several explosives. This knocked out the Imperial forces and allowed all of the rebels to escape. However, they failed to recover the Kalikori which was taken by Thrawn to add to his art collection. Numa and Gobi later mingled with the other Spectres while Hera reaffirmed her love for her father, Kanan, and her crew.\nNuma was a female Twi'lek with turquoise skin and brown eyes. As a child, she was feisty, being able to remain undetected in occupied Nabat even though the rest of its population had been either killed or rounded up by the Separatist military. She was afraid of Waxer and Boil when she encountered them, Waxer believing that she thought the two clones' armor meant they were droids.\nEven as a child, Numa was able to avoid the battle droid forces which occupied her home city, even though the rest of Nabat's population had been killed or rounded up. She also possessed knowledge of its expansive sewer system which allowed General Kenobi to stage an attack against the occupiers.\nAs an adult, Cham Syndulla considered Numa one of the most skilled warriors in the Free Ryloth Movement.\nAs a child, Numa wore a brown sleeveless dress, brown headdress and brown shoes. When she grew up and became a freedom fighter, Numa wore a tight-fitting black shirt and light brown pants, as well as a beige and black headdress. She wore white-and-orange armour pieces on her left arm, with \"BOIL\" written on one piece in Aurebesh. She wielded a DC-17 hand blaster.\nNuma was voiced by voice actress Catherine Taber, who also voiced Padmé Amidala in Star Wars: The Clone Wars. In a tweet, Taber opined that, in her mind, Numa was a descendant of Legends characters Mission Vao and Vette, two other Twi'lek characters whom she had voiced in the past.\nOn Numa's upper left arm, the word \"BOIL\" is written in Aurebesh as well as a particular crest in reference to one of the clone troopers that rescued her in Star Wars: The Clone Wars. She also has a faded tooka illustration on her tunic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Numa",
  "/wiki/Numa/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Numa",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Ryloth",
  "/wiki/26_BBY",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Youngling",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_trooper",
  "/wiki/Waxer",
  "/wiki/Boil",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Homeworld",
  "/wiki/Standard_year",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Cham_Syndulla",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Numa%27s_father",
  "/wiki/Numa%27s_mother",
  "/wiki/Numa%27s_home",
  "/wiki/City",
  "/wiki/Nabat",
  "/wiki/The_galaxy",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Prisoner",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Ghost_Company",
  "/wiki/Trooper",
  "/wiki/Droid",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Ringneck_recon_droid",
  "/wiki/Ration_bar",
  "/wiki/Blood",
  "/wiki/Twi%27leki",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/General",
  "/wiki/Tooka_doll",
  "/wiki/Comlink",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Diet",
  "/wiki/Gutkurr",
  "/wiki/Tactical_droid",
  "/wiki/TX-20",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/Jedi_Master",
  "/wiki/Commander",
  "/wiki/Officer",
  "/wiki/J-1_proton_cannon",
  "/wiki/B1-series_battle_droid",
  "/wiki/Obi-Wan_Kenobi%27s_second_lightsaber",
  "/wiki/Stuncuffs",
  "/wiki/Nilim_Bril",
  "/wiki/Proton_cannon",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/Laser",
  "/wiki/Tank_(vehicle)",
  "/wiki/Laser_cannon",
  "/wiki/Cannon",
  "/wiki/Acclamator-class_transgalactic_military_assault_ship",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/All_Terrain_Reconnaissance_Transport",
  "/wiki/Capital",
  "/wiki/Lessu",
  "/wiki/Battle_of_Yavin",
  "/wiki/Gobi_Glie",
  "/wiki/Spectres",
  "/wiki/Hera_Syndulla",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Ghost",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/TIE/sa_bomber",
  "/wiki/Detonator",
  "/wiki/Ezra_Bridger",
  "/wiki/Sabine_Wren",
  "/wiki/Kanan_Jarrus",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Stormtrooper",
  "/wiki/Hyperdrive",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/Stun",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Tann_Province",
  "/wiki/Syndulla_clan",
  "/wiki/Blurrg",
  "/wiki/Scout_trooper",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Unidentified_scout_trooper_(Ryloth)",
  "/wiki/Kalikori",
  "/wiki/Syndulla_residence",
  "/wiki/Tulara_Ravine",
  "/wiki/All_Terrain_Defense_Pod",
  "/wiki/Captain",
  "/wiki/Slavin",
  "/wiki/Eye",
  "/wiki/Aurebesh",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Catherine_Taber",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_Legends",
  "/wiki/Mission_Vao",
  "/wiki/Vette",
  "/wiki/Innocents_of_Ryloth",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Darkness_on_Umbara",
  "/wiki/Carnage_of_Krell",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Homecoming",
  "/wiki/Hera%27s_Heroes",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Hammerhead_Corvettes_Expansion_Pack",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Helmets",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Inside_Intel:_Twi%27lek_Culture",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/21_BBY",
  "/wiki/Storm_Over_Ryloth",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/File:Catherine_Taber-Numa_Tweet.png"
 ]
}