{
 "name": "Nurla_Slinthiss",
 "display_name": "Nurla Slinthiss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Nurla Slinthiss was a female Twi'lek criminal who lived at the time of the Galactic Civil War. She was the Vigo of the criminal Black Sun syndicate on the planet Talus.\nSlinthiss used to be a slave of the Hutts. After she had gained her freedom, she became a member of the Black Sun and quickly rose to become the local leader of the crime cartel.\nIn 1 ABY Lady Slinthiss recruited an adventurer to help her with her criminal business. The spacer didn't know about Slinthiss's involvement with the Black Sun at first, but soon learned about her criminal activities. Her first task for the spacer was the delivery of a message to a captain of the Corellian Security Force. The datadisc turned out to be an incriminating holo-recording. When the spacer handed the recording to the captain, the officer swore that he wouldn't be blackmailed by Slinthiss and threatened the spacer. Shortly thereafter, the CorSec captain arrested one of Slinthiss's underlings and ordered to interrogate the criminal. To save her employee, Slinthiss asked the spacer to free him. The spacer ambushed the renegade CorSec troopers that escorted the employee and killed them. Then he brought the underling back safely to Slinthiss.\nSoon after, the Lady Vigo discovered that one of her formerly trusted accountants had decided to sell her books to the Hutts. Slinthiss had put trackers on her records, so she knew exactly where her former accountant was headed. She once again employed the services of the spacer to track down the accountant and kill him and the Hutt enforcers guarding him. It didn't take long before the spacer returned successfully with the stolen books. The Hutt's reaction to this didn't take long either. They hired an assassin to take Slinthiss out. But Slinthiss had done her homework and knew that the Hutts intended to get rid of the assassin after he had done his job. So Slinthiss sent the spacer to meet the assassin and convince him to join with Slinthiss instead. The adventurer once again succeeded and came back with the assassin.\nSlinthiss was a Twi'lek with a light purple skin. She was a criminal that did not mind blackmailing and ordering the coldblooded murder of other people. She was very protective of her devoted underlings but was equally proactive when it came to removing traitors in her organization. Slinthiss still had a grudge on the Hutts after she being one of their slaves. The Hutts did not believe that someone like her was capable of running the local Black Sun activities on Talus, which made her even more ruthless and aggressive in her intent to prove them wrong.\nNurla Slinthiss was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies prior to its closure on December 15, 2011. She could be found in the Dearic Cantina where she offered several quests.\nOne of the NPCs the player had to engage during these quests called Slinthiss a \"Lady Vigo\". This title is usually only used for the 9 top lieutenants of the Black Sun organization, not local leaders. However the game only showed small criminal activities that were confined to the planet Talus.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Category:Criminals",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Datacard/Legends",
  "/wiki/Holo-recording",
  "/wiki/Accountant/Legends",
  "/wiki/Tracker",
  "/wiki/Assassin/Legends",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/Dearic_Cantina"
 ]
}