{
 "name": "Nurm",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Event Vistas"
     ]
    }
   ]
  }
 ],
 "content": "Nurm was a male Sullustan pilot.\nNurm worked for Event Vistas, a corporation of luxury cruise liners. In 8 ABY, he was the co-pilot of the Nebula Queen, a ship making regular runs to Coruscant. The main pilot of the ship was another Sullustan, Rostat Manr.\nManr was kidnapped and brainwashed by agents of Warlord Zsinj. After hearing a trigger phrase, Manr tried to crash the Nebula Queen onto Coruscant. Fortunately, due to similar incidents involving Twi'leks and Gotals, there was a New Republic Intelligence officer on board, who informed Nurm what was happening. Nurm didn't want to believe it, but did as he was instructed - he took over piloting from the auxiliary bridge and locked Manr out of the system. When Manr came to confront him, Nurm stunned him. The Intelligence officer then assured Nurm  that he had acted correctly, stating that it would be better if everyone thought he'd acted on his own initiative, rather than on outside instruction. The officer then sent a Mission Accomplished code to General Airen Cracken, while Manr was taken into custody for examination and interrogation. Presumably, Nurm took over Manr's duties for at least the remainder of that run.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Event_Vistas",
  "/wiki/8_ABY/Legends",
  "/wiki/Nebula_Queen",
  "/wiki/Rostat_Manr",
  "/wiki/Project_Minefield",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Nurm",
  "/wiki/X-Wing:_Solo_Command"
 ]
}