{
 "name": "Nuso Esva",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "8 ABY",
      "Quethold"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "\"Storm-hairs\""
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Multicolored"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nuso Esva's realm",
      "Nuso Esva's battle fleet",
      "Nuso Esva's battle fleet",
      "Galactic Empire",
      "Imperial Court",
      "Imperial Court"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "The Chosen"
     ]
    }
   ]
  }
 ],
 "content": "Nuso Esva, also known as Nuso Esva of the First of the Storm-hairs to the Quesoth species, was a brutal warlord who was a member of the species nicknamed \"Storm-hairs\" by the Quesoth. He, along with his warriors, the Chosen, emerged from an Unknown Regions planet and ravaged worlds and species with their large navy. By 0 ABY, he engaged the Empire of the Hand confederacy and its leader, Senior Captain Thrawn, in a series of battles and skirmishes in the Unknown Regions and Wild Space. In 0 ABY, the Chosen and their master captured the Candoras sector's Galactic Empire Governor Bidor Ferrouz's family and forced him to ally himself with the Rebel Alliance to bring Thrawn to the Poln system to allow Esva to ambush him with his Eastern Fleet.\nWhile infiltrating and sabotaging the Imperial II-class Star Destroyer Chimaera, the senior captain's Task Force Admonitor and his DeepWater-class light freighter, whose commander suspected Esva's plot, prepared to destroy Esva's Fleet. With the Imperial Death Squadron's assistance, Thrawn was able to shatter Esva's forces after a verbal confrontation, and Ferrouz's family was freed from the Chosen shortly before the battle's end. The warlord continued to destroy species and worlds but was stopped when he was killed by Empire of the Hand stormtroopers and now-Grand Admiral Thrawn on the Unknown Regions planet Quethold during Esva's final battle against the Chiss.\nNuso Esva originated from an unidentified planet within the Unknown Regions from which his species that was nicknamed \"Storm-hairs\" by the Quesoth Trevik. Esva's warriors, the Chosen, were \"Storm-hairs\" and also hailed from the planet. By 0 ABY, the \"Storm-hair\" warlord had began to fight the Galactic Empire Senior Captain Thrawn, who had a shadow empire set up to counter Esva's realm and battle fleet and other threats.\nBy 0 ABY, Esva met with his commanders on an unknown world to prepare an operation against Senior Captain Thrawn in the Empire's Poln system, where he sent his Chosen. There, his warriors captured Imperial Governor Ferrouz's family and ordered him to offer a base and supplies to the Rebel Alliance in an attempt to draw the senior captain into the system. Additionally, the Storm-hair promised to the Rebel Vestin Axlon that he would avenge his home planet Alderaan by destroying the Empire for the Rebels, whose leaders, including General Carlist Rieekan, feared that Esva would replace the empire with his own tyrannical reign. Meanwhile, Esva commanded his slave, Sorro, whose family he had killed or captured, to pilot his Kazellis-class light freighter Salaban's Hope to the Imperial II-class Star Destroyer Chimaera's location. There, several of the warlord's starships attacked the Salaban's Hope while the Storm-hair—posing as Imperial Court member Lord Odo—instructed the Chimaera's commander, Captain Drusan, how to defeat the ships. Before the skirmish, Drusan had verified Esva's credentials, as he had promised a victory over the Rebels that would promote the captain to the rank of admiral. His instructions were correct, and he and the Star Destroyed destroyed his warships before the Kazellis freighter was brought aboard. When he was aboard, Esva donned a mask and clothing to conceal his identity.\nAboard the Chimaera, Odo was given quarters in the ship's hangar; however, he considered them unsatisfactory and demanded quarters next to the bridge, where he would know of command decisions and other topics. While Sorro had lunch, the Chimaera's first officer, Commander Gilad Pellaeon, attempted to interrogate him, but the Imperial Lord interrupted him, demanding Pellaeon's help in his move to his new quarters. Shortly after, Esva made a short visit to the planet Wroona to acquire technical equipment and brought it to his quarters aboard the Chimaera shortly after.\nWhile traveling to the bridge, Lord Odo explained what had happened to Sorro: according to him, he had made bad choices, like said in the Arkanian legend the Song of Salaban, after which his freighter was named. After expressing his hope for Sorro fixing his life, he arrived with the commander at the bridge. There, he told Drusan that the ships that had intercepted him earlier were Rebel Alliance warships, and instructed the captain to travel to the Unknown Regions, where the Chimaera would attack one of Odo's attack squadrons. Once there—over the planet Teptixii—Senior Captain Thrawn's Star Destroyer Admonitor flagship and the Chimaera confronted Esva's forces. Odo instructed Drusan and Pellaeon to divide his own Firekiln warships by moving behind the squadron's formation, which would prompt him to flee. Although hesitantly, the Chimaera's officers complied, and Esva's ships fled. After the battle, Odo commanded Captain Voss Parck of the Admonitor to inform Thrawn that he had to go to Poln Major immediately as a response to \"possible insurrection\" after an assassination attempt, unbeknownst to Parck, on Ferrouz carried out by the Chosen. The Admonitor then left under the warlord's directive.\nFollowing Thrawn's task force and the Chimaera's arrival over Poln Minor, Odo and Sorro set up a performance of Mon Calamari in the Star Destroyer's main engine room. Pellaeon arrived when trying to find Odo, and demanded an explanation, which the alien provided. According to him, Esva's Troukree agents, which could have easily infiltrated the Chimaera, would be brought out of their hiding spots by performing the ballet while Arakyd Mark Two seekers searched for them. The captain apologized for interrupting, and left. Shortly after, Odo killed Captain Drusan while his forces were attacking the Chimaera, whose engines Esva destroyed with thermal detonators.\nSorro—wearing Esva's mask and clothing—was then killed by Drusan's second-in-command, Pellaeon, who had been told of Odo's true identity by his Chiss opponent and was trying to murder the Storm-hair under his command. Immediately, both Imperials and Esva engaged in a conversation over comm regarding the latter's sabotage of the Chimaera. The Storm-hair mocked Sorro, and presented Thrawn with a dilemma: the Chimaera was in a collision course with an Imperial Golan defense platform and was unable to move due to its broken engines, Task Force Admonitor was trapped in Poln Minor, and Esva's Eastern Fleet was prepared to destroy any other ship. If Thrawn did not choose between the Star Destroyer or the defense platform, all aboard both war machines would die, and if he chose the Chimaera, the Golan would be destroyed, damaging the Chiss's reputation. The warlord assured Thrawn that his reputation would be ruined, however, the Star Destroyer's tractor beams brought the DeepWater-class light freighter Lost Reef—piloted by Thrawn—aboard, moving it away from its collision course.\nThe senior captain then chose to ignore his enemy, focusing on amplifying his transmission with the warlord for it to reach the Quesoth homeworld of Quethold and the Stromma homeworld of Oristrom, both of which housed the Storm-hair's future allies. While Esva promised to destroy the Poln system with his Firekilns, the Chiss countered that the system's inhabitants could be his allies, prompting the alien to reveal to the Stromma and Quesoth their true fate, being tools, with his gloating. Warlord Esva then promised Thrawn's destruction; however, the senior captain contacted Sith Lord Darth Vader's Death Squadron consisting of the Super Star Destroyer Executor and several Imperial Star Destroyers, all of which proceeded to shatter Esva's Eastern Fleet. The Storm-hair then fled the scene aboard the Salaban's Hope.\nBy 0 ABY, Esva launched his Braccio campaign which nearly destroyed six species, and by 8 ABY, the warlord destroyed many species and planets. On Oristrom, the Stromma defeated the Chosen until Esva assumed personal command, undoing their progress until Grand Admiral Thrawn arrived and forces the Storm-hairs to retreat. In 8 ABY, the Storm-hair allied himself with the Quesoth species' reigning Queen of the Red, promising her that if he captured Empire of the Hand juggernauts with her assistance, he would siege Quethold's White City and the Queen of the White, which would allow the Queen of the Red to rule forever.\nUnder Esva's directive, a Quesoth adviser tasked the Queen's bowlcarrier Trevik—who carried a bowl of nectar for her—to record artwork brought by the Storm-hair to the Red City's Dwelling of Guests building, where he and thirty of his Chosen resided, and share it with Thrawn. According to the warlord, if the Grand Admiral saw the artwork, he would plan his attack as Esva desired, allowing for an easy victory. The Chiss fell for his ploy, and sent his juggernauts and Imperial stormtroopers to the city's Setting Sun Avenue. The Storm-hair sent thousands of Quesoth Soldiers to intercept them and capture the juggernauts while Imperial TIE fighters attempted to destroy the shields protecting the city's loudspeakers sharing the Queen's orders.\nTwo of the juggernauts were destroyed, and the Quesoth Soldiers and several Chosen infiltrated them to discover droids instead of stormtroopers inside them, which frustrated Esva's plan. The TIEs deactivated and destroyed the speakers, and the Soldiers were useless to Esva where they were. Therefore, the warlord ordered the Queen to travel to the juggernauts to order her troops to do what the Storm-hair desired; however, she refused and was killed by her ally after the Soldiers rushed at Esva.\nEsva also killed Borosiv, one of the Queen's attendants, and everyone else but Trevik, who he tasked with telling Thrawn that his Chosen would find him, wherever he tried to hide, and they would kill them. The bowlcarrier left, the Chosen opened fire against the white-armored Imperial stormtroopers, and the Quesoth attacked, and the Storm-hairs were killed. After the battle, Thrawn's Admonitor headed to the Chaos Triangle, where it would clean up what the Chiss referred to as Esva's \"legacy.\" As the warlord desired, Grand Admiral Thrawn was eventually killed by his traitorous Noghri bodyguard Rukh.\nA male member of the Storm-hairs, Warlord Nuso Esva was an arrogant and confident leader with a calm demeanor most of the time. Considered a threat by Thrawn, the warlord was stubborn, and did not accept allies, bribes, or treaties, rather, destroyed everything with no mercy or consideration. Those he did not destroy he considered his tools and destroyed their lives to make them \"useful\" again. Extremely loyal to his warriors, and vice versa, Esva only cared for his people, who instead followed him and died for him willingly. He was willing to use his Eastern Fleet's firepower to turn Poln Major and Poln Minor into rubble, which would kill all their inhabitants—who could very well be allies.\nThe Storm-hair was willing to destroy his enemies later if it gave him a chance to boast. Esva spread rumors and threatened Ferrouz with the murder of his family simply to destroy his nemesis, Thrawn. Led by his dislike of the Chiss, the warlord created a trap just to fall into his opponent's, forcing the brutal Storm-hair to flee. As Lord Odo, Warlord Esva was calm, competent, and helpful aboard the Chimaera, offering tactical insight to kill the senior captain while defeating himself. The Storm-hair had multi-faceted yellow eyes, hair the color of a storm cloud according to Trevik, and multicolored skin. He had long black tendrils in his head, which were similar to a Human's, and the warlord's face was smooth and soft.\nWhile posing as Odo, Nuso Esva wore a metallic mask, a burgundy hooded robe, black gloves, and black boots.\nWarlord Esva was considered powerful by Thrawn, whose military skills were rivaled by the Storm-hair's. Pellaeon considered him a competent member of the Imperial Court while he posed as Lord Odo. Esva spoke the galactic Basic language in addition to his own.\nWarlord Nuso Esva was first mentioned in an excerpt of the 2011 novel Choices of One, written by Timothy Zahn, published in the same year's June 7. The warlord made his first appearance in the novel twelve days after the excerpt's release. In a September 28, 2011, Facebook chat, the author confirmed that Esva's name was a coded version of Moriarty, from Sir Arthur Conan Doyle's Sherlock Holmes stories. If each consonant of \"Nuso Esva\" was replaced with the consonant before it in the Latin alphabet and each vowel is replaced with the preceding vowel in the Latin alphabet, counting y, \"Nuso Esva\" would become \"Moriarty.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Quethold",
  "/wiki/Storm-hairs",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nuso_Esva%27s_realm",
  "/wiki/Nuso_Esva%27s_battle_fleet",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Court/Legends",
  "/wiki/Chosen_(Nuso_Esva)",
  "/wiki/Quesoth",
  "/wiki/Warlord/Legends",
  "/wiki/Species/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Unidentified_planet_(Nuso_Esva)",
  "/wiki/0_ABY/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Senior_Captain/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Nuso_Esva%27s_conquests",
  "/wiki/Wild_Space/Legends",
  "/wiki/Candoras_sector",
  "/wiki/Governor/Legends",
  "/wiki/Bidor_Ferrouz",
  "/wiki/Bidor_Ferrouz%27s_family",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Poln_system",
  "/wiki/Eastern_Fleet",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Chimaera/Legends",
  "/wiki/Task_Force_Admonitor",
  "/wiki/DeepWater-class_light_freighter",
  "/wiki/Battle_of_the_Poln_system",
  "/wiki/Death_Squadron/Legends",
  "/wiki/Braccio_campaign",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Battle_of_Quethold",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Trevik",
  "/wiki/Unidentified_planet_(Nuso_Esva%27s_commanders)",
  "/wiki/Vestin_Axlon",
  "/wiki/Alderaan/Legends",
  "/wiki/General/Legends",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Sorro",
  "/wiki/Kazellis-class_light_freighter",
  "/wiki/Salaban%27s_Hope",
  "/wiki/Unidentified_starship_class_(Nuso_Esva%27s_plot)",
  "/wiki/Lord/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Drusan",
  "/wiki/Admiral/Legends",
  "/wiki/Bridge_(starship)",
  "/wiki/Executive_officer/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Nuso_Esva%27s_quarters",
  "/wiki/Wroona/Legends",
  "/wiki/Arkanian/Legends",
  "/wiki/Song_of_Salaban",
  "/wiki/Nuso_Esva%27s_attack_squadron",
  "/wiki/Teptixii",
  "/wiki/Admonitor",
  "/wiki/Flagship/Legends",
  "/wiki/Battle_of_Teptixii",
  "/wiki/Firekiln",
  "/wiki/Voss_Parck/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Troukree",
  "/wiki/Arakyd_Industries/Legends",
  "/wiki/Mark_Two_seeker",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Golan_Space_Defense_SpaceGun",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Lost_Reef",
  "/wiki/Stromma",
  "/wiki/Oristrom",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Battle_of_Oristrom",
  "/wiki/Queen_of_the_Red_(8_ABY)",
  "/wiki/Queen_of_the_Red",
  "/wiki/Juggernaut",
  "/wiki/White_City",
  "/wiki/Queen_of_the_White",
  "/wiki/Unidentified_Circling",
  "/wiki/Bowlcarrier",
  "/wiki/Nectar/Legends",
  "/wiki/Painting/Legends",
  "/wiki/Red_City",
  "/wiki/Dwelling_of_Guests",
  "/wiki/City/Legends",
  "/wiki/Setting_Sun_Avenue",
  "/wiki/Quesoth_Soldiers",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Planetary_shield/Legends",
  "/wiki/Speaker/Legends",
  "/wiki/Borosiv",
  "/wiki/Chaos_Triangle",
  "/wiki/Treason/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Rukh/Legends",
  "/wiki/Time/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Unidentified_treaty_(Nuso_Esva)",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Language/Legends",
  "/wiki/Nuso_Esva%27s_language",
  "/wiki/2011",
  "/wiki/Choices_of_One",
  "/wiki/Timothy_Zahn",
  "/wiki/June_7",
  "/wiki/July_19",
  "/wiki/September_28",
  "/wiki/Crisis_of_Faith",
  "/wiki/Heir_to_the_Empire:_The_20th_Anniversary_Edition",
  "/wiki/StarWars.com",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Vision_of_the_Future",
  "/wiki/8_ABY",
  "/wiki/The_Last_Command"
 ]
}