{
 "name": "Nute_Gunray",
 "display_name": "Nute Gunray",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Neimoidia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.91 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "90 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation",
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate",
      "Sith",
      "Confederacy of Independent Systems",
      "Executive Separatist Council",
      "Executive Separatist Council"
     ]
    }
   ]
  }
 ],
 "content": "Nute Gunray was a Neimoidian male business magnate and politician who served as the Viceroy of the Trade Federation during the final decades of the Galactic Republic. Prior to his assent to the position, Gunray served as a senator in the Republic Senate, and years later, he was a critical member of the Separatist Council. Before the Invasion of Naboo, Gunray conspired with the Sith Lord Darth Sidious, who had engineered his rise to power, though the Viceroy was unaware that he was nothing more than a pawn in the Sith Grand Plan. After his death during Darth Vader’s slaughter on Mustafar, the Trade Federation and its assets were dissolved by the Galactic Empire.\nIn 32 BBY, Gunray led the Federation in its illegal invasion of the Mid Rim planet Naboo. Though the Viceroy was at the forefront of the crisis, he was merely a pawn following the orders of Sidious, who had instigated the conflict in order to be elected Supreme Chancellor of the Republic. After failing to kill Jedi Master Qui-Gon Jinn and his padawan, Obi-Wan Kenobi, who had posed as ambassadors, the Viceroy gave the order for the Federation droid army to land on the planet in order to coerce its queen, Padmé Amidala, into signing a treaty that would legitimize his invasion. The queen managed to escape the blockade with Jedi intervention, and Gunray assumed control of the planet. Before long, however, Amidala returned to her homeworld and repelled the Federation invasion. Gunray was promptly arrested and taken to Coruscant, though he was able to hold onto his position as Viceroy after four trials in the Supreme Court.\nBitter over the outcome of the invasion, Gunray allied himself with the former Jedi Master Count Dooku, and he pledged Federation military support to the Confederacy of Independent Systems, a splinter state of the Republic. In return for his investment, Dooku helped Gunray orchestrate a failed attempt on Amidala's life, who had since become a Republic senator. As Kenobi investigated the attempted assassination, he discovered the Separatist droid factory on Geonosis, and Gunray watched from afar as the Republic Kaminoan clone army arrived and engaged the Confederacy in the First Battle of Geonosis. \nAfter the outbreak of the Clone Wars in the aftermath of the battle, Gunray became a crucial member of the Confederacy and he attempted to bring the world of Rodia and its leader, Onaconda Farr, into the Separatist cause while simultaneously ending Amidala's life. Though the plot failed and he was taken into Republic custody, Gunray managed to escape his cell with the help of Asajj Ventress, Dooku's Sith assassin. After three years of warfare, the Confederacy found itself in disarray following the deaths of Dooku and the cyborg Supreme Commander of the Droid Army, General Grievous. The surviving Separatist Council members, led by Gunray, sought protection on Mustafar, but they were eventually killed by Darth Vader at the order of his new master. Gunray was the last to be killed by Vader's lightsaber, which ultimately brought an end to the Clone Wars.\nA native of the planet Neimoidia, Nute Gunray lived during the latter decades of the Galactic Republic. During this time, the ruthless Nemoidian rose to the powerful position of Viceroy of the Trade Federation, something that was engineered by the Dark Lord of the Sith Darth Sidious. During his tenure, Gunray authored a Federation advertisement known as Safe In Our Hands. It was created by the Federation's public relations agency, Eleven Star Marketing, and the advertisement featured a Neimoidian hand holding Coruscant in its palm, and some feared that it represented Gunray's ambitions to own Coruscant itself and extend his growing influence. Under Gunray's direction, these claims were dismissed as anti-Neimoidian prejudice.\nFollowing the failure of a taxation bill in the Galactic Senate, Viceroy Gunray conferred with Darth Sidious, furious that Naboo Senator Palpatine's introduction of a bypass amendment had cost the Trade Federation the allegiance of the Delcontrian faction. Sidious assured Gunray that a new bill would be presented to the Senate in a matter of days which would win the Delcontrian faction back, though a doubtful Gunray responded by muttering something beneath his breath which Sidious could not hear.\nAt the same time, under Sidious's direction, Gunray had sunk considerable money into the creation of a Battle Droid fighting force, which was undertaking training maneuvers on Geonosis. When the time was right, Sidious instructed Gunray to cease these training exercises and put his new army to the test.\nNute Gunray contacted Queen Amidala of Naboo and introduced himself, forcefully instructing her to sign a treaty with the Trade Federation which would, essentially, give them control of the entire planet. Amidala refused to sign the treaty, and Gunray implemented the next phase of Lord Sidious's plan; blockading Naboo with a fleet of Battleships.\nThe Naboo Crisis arose as a result of a dispute between the Trade Federation and the Galactic Republic relating to the taxation of trade routes to outlying systems. At the instigation of Darth Sidious—secretly Naboo Senator Palpatine—the Trade Federation decided to force a resolution to the dispute by blockading the planet Naboo with a fleet of modified battleships, cutting off all shipping to the planet. Gunray commanded the blockade itself from his flagship Saak'ak, a Droid Control Ship. In response to the Naboo Crisis, Supreme Chancellor Finis Valorum dispatched two Jedi, the Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi, to negotiate a peaceful resolution to the dispute.\nViceroy Gunray allowed the Jedi emissaries to land their ship Radiant VII in the Saak'ak's hangar bay. After learning that the emissaries were Jedi, Gunray and the ship's captain Daultay Dofine panicked and contacted Darth Sidious via hologram. Lord Sidious ordered Gunray to kill the two Jedi and to invade the planet Naboo. Gunray questioned the legality of such an action, but Sidious quickly silence his concerns by telling the Viceroy that he would \"make it legal\" in the Galactic Senate. Under Gunray's orders, the emissary's ship Radiant VII was destroyed and poison gas was released into the reception room hosting the two Jedi. Gunray also dispatched a group of security battle droids to finish off the Jedi. However, the two Jedi managed to survive the attempted poisoning and quickly dispatched the battle droids before advancing on the bridge. Gunray quickly responded by sealing the blast doors of the bridge and calling for droidekas, which managed to overwhelm the Jedi before they could cut through the doors. Shortly later, Gunray was contacted by the Naboo Queen Padmé Amidala, who, once again, refused to sign a treaty with the Trade Federation. Gunray was smug in his dealings with Amidala, confidently assuring her that he knew nothing of the supposed ambassadors.\nDespite the threat posed by the Jedi, Gunray still proceeded with the invasion, beginning with severing all communication to the planet. C-9979 landing craft were used to land the Trade Federation's droid army on Naboo, and OOM command battle droid OOM-9 was ordered to look out for the Jedi. The army then proceeded to capture the capital city of Theed and other major centers. The Trade Federation's droid army succeeded in occupying Naboo with little resistance and managed to capture Queen Amidala and her entourage. Following the occupation of Theed, Gunray visited the captured Queen himself and reiterated his demand that she sign a treaty with the Federation. She refused, and so she and the others were to be taken to Camp Four.\nGunray suffered a setback when the two Jedi and a local Gungan guide named Jar Jar Binks managed to free the Queen and her entourage, and escape offworld. Meanwhile, Viceroy Gunray and Settlement Officer Rune Haako presided over the occupation of Naboo from the Theed Royal Palace. Naboo's population was forced into camps where they experienced starvation and hardship. In Amidala's absence, Gunray assumed her throne and held Governor Sio Bibble prisoner. Gunray taunted the Governor from atop his Mechno-chair, but the Governor resisted Gunray's attempts to break him.\nIn an attempt to force Queen Amidala to resurface, Gunray personally visited one of the internment camps with a captive Bibble in tow. Gunray had Bibble brought before one of the Queen's handmaidens, Saché, telling the Governor that the Naboo had failed to protect their own citizens. Saché pleaded with the Governor to contact the Queen and tell her that the death toll on Naboo was \"catastrophic.\" Gunray departed, satisfied, and Bibble was forced to transmit a message to the Queen.\nIn the Senate on Coruscant, the Trade Federation's Senator Lott Dod managed to block Queen Amidala and Senator Palpatine's efforts to request Republic intervention in Naboo. However, Queen Amidala, at the instigation of Palpatine, managed to outmaneuver the Trade Federation by calling for a Vote of No Confidence against Chancellor Valorum.\nAs the occupation deepened, the droid army began to move against the Gungans, Naboo's amphibious indigenous civilization, who lived in underwater cities like Otoh Gunga. Facing little resistance, the Trade Federation removed most of their fleet from Naboo with the exception of the Droid Control Ship Vuutun Palaa. The diminished Trade Federation naval presence enabled Queen Amidala, her entourage, her Jedi allies, and Binks to land their starship on Naboo. Queen Amidala managed to rally the Naboo resistance and forge an alliance with the Gungan leader Boss Rugor Nass. Seeking to drive out the Trade Federation, Amidala devised a three-pronged battle plan which involved the Gungan Grand Army marching on Theed to draw away the droid army. Meanwhile, Naboo forces under Amidala and her Jedi allies would infiltrate Theed and capture the Viceroy. Naboo forces would also capture the hangar bay at the royal palace and use their N-1 starfighters to destroy the Droid Control Ship, incapacitating the droid army.\nIn response to this renewed threat from Amidala and the Jedi, Darth Sidious dispatched his Sith apprentice, Darth Maul, to reinforce the Viceroy. Gunray soon detected that the Queen's royal starship had been cleared the blockade and landed on the planet, and dispatched Battle Droids to salvage the craft. Gunray contacted Darth Maul on his approach to Naboo and asked if he wished to search for the Queen and her party, but Maul suggested to Gunray that he \"let them come us.\"\nAfter receiving reports that the Gungan Grand Army was marshalling outside Theed, Gunray dismissed them as primitives and asked for Lord Sidious' permission to wipe them out. At Sidious's urging, Gunray sent the majority of his droid army to wipe out the Gungan forces. During the Battle of Naboo, Gunray believed himself to be away from the fighting the within the Theed Royal Palace. With the bulk of the droid army preoccupied with the Gungans, Queen Amidala and her Jedi allies were able to infiltrate the Palace and secure the N-1 starfighters, which proceeded to launch a starfighter strike on the Vuutun Palaa. While Master Qui-Gon and Padawan Kenobi took on Darth Maul in a lightsaber duel, Queen Amidala's forces fought their way through the Royal Palace.\nGunray's droidekas managed to capture Queen Amidala and some her party and brought them into the throne room, where a triumphant Gunray reiterated his demand that she sign a treaty with the Trade Federation. However, the Queen's disguised handmaiden arrived in the throne room with reinforcements, confusing Gunray and his battle droids. Gunray ordered his droids to pursue the decoy Queen, dividing his forces, and the real Queen used the opportunity disable Gunray's remaining droids and take the Viceroy and Haako captive. Meanwhile in space, Anakin Skywalker destroyed the Droid Control Ship with a missile fired from his starfighter. This effectively disabled the entire Federation droid army; turning the tide of the battle decisively in favor of the Naboo and their Gungan allies. Elsewhere, Kenobi managed to seemingly kill Darth Maul but lost Master Qui-Gon, who succumbed to injuries inflicted by Darth Maul. With the defeat of the Federation's droid army, Viceroy Gunray and Haako were held prisoner by the Naboo and then transported to Coruscant to face trial for their crimes on Naboo.\nGunray spent the next four years undergoing trials in the Senate Courts. Kenobi was involved in the trials against Gunray but found them to be toothless. Gunray's lawyers worked feverishly to ensure that nothing ever came of these trials, and though they cost the Viceroy a fortune in legal fees, no charges were ever brought against him. Gunray's third trial ended in a hung jury, and his fourth found him not guilty, allowing him to retain his assets and titles.\nBitter over his defeat at Naboo, Gunray developed a deep seated grudge against the one person he blamed for his subsequent legal troubles; Padmé Amidala, now a senator for Naboo in the Galactic Senate. At Gunray's direction, the Trade Federation covertly used TriNebulon News to spread rumours about Amidala, attempting to discredit her early Senate career by running negative stories on her youth and inexperience. After the conclusion of Gunray's fourth trial, rumors circulated that he had gone as far as to put a price on Amidala's head.\nAfter his many trials, Gunray grew more bitter at the Republic, and he eventually joined the growing secessionist movement under the leadership of Count Dooku of Serenno—a former Jedi Master who had become Darth Tyranus and Sidious' new apprentice. The Secessionist Movement was a confederation of a thousand star systems and corporations that were dissatisfied with the rampant taxation and excessive corruption within the Galactic Republic. In 24 BBY Dooku delivered the Raxus Address, in which he denounced the Republic as a futile enterprise rife with favoritism and corruption that harmed the outer systems in order to benefit the Core Worlds. In the wake of the speech, the Confederacy of Independent Systems was formed.\n\nGunray agreed to pledge his support for the Separatists in return for one thing: that his old adversary, Senator Amidala, be killed so that he could finally get revenge for his loss during the Naboo Crisis. Dooku agreed to the Viceroy's demands, and he arranged for the bounty hunters Jango Fett and Zam Wesell to assassinate the senator. The bounty hunters launched two unsuccessful attempts, which only drew the Jedi Order's attention to the existence of a clone army being created for the Republic on the planet Kamino. While pursuing Fett, Obi-Wan Kenobi discovered that a droid army was being constructed for the Separatists on the desert planet of Geonosis. As he spied on their dealings, he saw Dooku, Gunray, Haako, Archduke Poggle the Lesser, and Foreman Wat Tambor walking to a secret meeting, with Dooku discussing how they needed to convince the Commerce Guild and Corporate Alliance to sign their treaty. Gunray asked about Amidala, remarking that he would not sign the treaty until Amidala's head was on his desk, but Dooku assured the Viceroy that he was a man of his word.Upon arriving at their meeting, all corporate leaders pledged their support for the Separatist Movement. With their new droid army, the Separatists hoped they could mount a successful challenge against the Republic and their Jedi defenders. Shortly later, Kenobi along with Senator Amidala and Padawan Skywalker were captured by Geonosians following a skirmish in the Geonosian droid factory. After Amidala and her companions were sentenced to death and forced to fight in the Petranaki Arena against the arena creatures—a reek, and an acklay—and the Geonosian picadors, Gunray attended the proceedings, accompanied by Haako, Dooku, Poggle, Jango Fett, and his \"son\" Boba Fett. When Amidala was savagely attacked by the nexu in the arena, the Viceroy chucked in glee. However, Gunray's hopes for revenge against the Senator were dashed when she and her Jedi allies managed to evade the creatures. In their ensuing escape, Gunray asked for Jango to kill her, but Dooku asked that Gunray have patience, as Amidala would die nonetheless.\nGunray and the Separatist allies suffered another blow, however, when a Jedi strike force lead by Jedi Master Mace Windu attacked the Petranaki arena. As a battle broke out, Haako and Gunray remained close to Dooku, and when blaster fire raced by them, the neimodians ducked and covered. Shortly thereafter, clone trooper forces under Grand Master Yoda attacked the arena, forcing Gunray, Haako, and Dooku to retreat into the Geonosian Command Center. Inside, the Viceroy commented on how the Jedi has amassed a massive army, and Dooku pondered to himself how they could have come up with it so quickly. Gunray suggested that they send all available droids into battle, but the Separatist Droid Army proved inferior to the Republic's clone troopers. With the battle turning in favor of the Grand Army of the Republic and their Jedi commanders, Gunray commented that the situation was not looking good, and Haako suggested that they get the Trade Federation Core Ships into space. Gunray did as Haako suggested, and he retreated from Geonosis to supervise the evacuation of the Trade Federation Core Ships. This battle marked the spark of the Clone Wars, a galactic-wide conflict between the Republic and the Confederacy of Independent Systems.\nBy joining the Separatists, Gunray was left unreachable by Republic law, again allowing him to avoid justice for his previous crimes, while the Federation itself remained neutral to do business with both sides. The official story was that Gunray led a splinter faction that was fully devoted to the Confederacy. During the first days of the war after Geonosis, Gunray arrived, in person, on the planet Nooroyo to negotiate trade of its spice export, unaware that Amidala and Skywalker had arrived as well to rescue members of the Naboo Torada Collective who were staying on planet. Upon being informed that Gunray was on planet and that he would certainly send someone to their H-type Nubian yacht because it was a Naboo ship, Amidala and Skywalker were forced to speed up their mission and leave quickly. As Queen Jamillia's sister Antraya was the only member of the collective willing to leave, they left only with her as a droid starfighter started to close in.\nSeveral weeks into the war, rumors reached Gunray and his allies that a splinter group was emerging in the Federation that sought to wrestle control of the corporation. As such, Gunray and his allies asked Dooku to take action. Led by Oje N'deeb, the faction indeed existed and made contact with Amidala during the siege on Hebekrr Minor, hoping to take Dod's Senate seat and redeem the image of the Federation to the Republic. Upon learning of the splinter group, Sidious ordered Dooku to hold Gunray and the others back from snuffing out the splinter cell, as the Sith Lord hoped to use them for his own plans.\nAt some point following the Battle of Geonosis, Nute Gunray turned his attention to the Outer Rim world of Rodia. The planet had been attacked by pirates and Rodia's Republic Senator Onaconda Farr had appealed to Viceroy Gunray for help. The Viceroy agreed to send relief supplies to Rodia in return for one small favor: kidnapping his long-time foe Senator Amidala. Farr was a close friend of the Naboo Senator and called her to Rodia under the pretext of seeking aid from the Republic for the Rodian people. Senator Amidala was escorted by her long-time friend Representative Jar Jar Binks and her protocol droid C-3PO.\nUpon arriving, Senator Amidala and C-3PO were captured. After learning of her capture, Gunray ordered that she be manacled as a precaution before he traveled to Rodia to meet her. However, Gunray's plans encountered an unexpected obstacle in the form of Binks, who managed to elude the Viceroy's battle droids and trick them into believing that he was a Jedi. In the midst of the commotion, Amidala and C-3PO managed to escape and contact the Republic for assistance before they were recaptured by Gunray's battle droids. After arriving on Rodia, Gunray applied pressure on Farr by withholding relief supplies until Senator Amidala was executed. When Senator Farr protested, Gunray responded that the planet was now under his protection.\nAfter Gunray's droid forces had recaptured Senator Amidala and C-3PO, he assembled a trio of droidekas to execute them. Before Gunray could carry out the sentence, Binks and a Kwazel Maw monster that he had befriended named \"Bogey\" burst out from the swamp and overwhelmed the droidekas. The Viceroy attempted to flee aboard his Sheathipede-class transport shuttle but \"Bogey\" knocked it into the swamp. He was then held by Senator Amidala at gunpoint. Shortly later, Farr arrived and revealed that he and Amidala had planned to trap Gunray all along. Shortly later, Republic forces of the 41st Elite Corps arrived and took Gunray into custody.\nFollowing the events on Rodia, the captive Gunray was transferred aboard the Venator-class Star Destroyer Tranquility for trial on Coruscant. Due to his high status in the Confederacy, the Jedi Council dispatched the Jedi Master Luminara Unduli and Master Skywalker's Padawan Ahsoka Tano to guard Gunray. The two Jedi were reinforced by a group of Senate Guards led by Captain Faro Argyus and a squad of clone troopers led by Clone Commander Gree. In response to Gunray's capture, Sidious and Dooku dispatched the Dathomirian dark side assassin Asajj Ventress to infiltrate the Tranquility and rescue or kill the Trade Federation Viceroy to prevent him from giving up their secrets.\nWhile in captivity, Gunray was interrogated by Unduli and Tano but refused to cooperate. When a frustrated Tano threatened the Viceroy, Unduli chastised the younger Jedi. Their interrogation was interrupted by the arrival of Separatist attack force consisting of Separatist Vulture droids and three Droch-class boarding ships. While Separatist droids boarded the Tranquility, Ventress took advantage of the chaos to sabotage the ship's power generators. After Unduli departed with several Clone troopers to fight the intruders, Ventress managed to overpower Ahsoka and free Gunray. Before Gunray could escape with the dark side warrior, Master Luminara returned to the cell and fought with Ventress in the ship's elevator shaft and generator room.\nWhile Luminara was dueling with Ventress, Gunray was locked in his cell with Tano and Argyus standing guard. Unknown to the Republic and Jedi, Argyus was a traitor who was secretly working for Dooku. When Ahsoka departed the brig to help Luminara, Argyus took the opportunity to overpower his fellow Senate Commandos and freed Gunray. Gree managed to overpower Argyus, but Gunray, unnoticed by the clone Commander, picked up a fallen blaster and knocked him unconscious. The Viceroy and his rescuer then escaped on a Republic Consular-class cruiser in the lower hangar and were joined by Ventress, who had escaped her Jedi foes in a Republic escape pod. Gunray was present when Ventress killed Argyus by impaling him through the chest with lightsaber, and after the death Gunray told Ventress he had \"always had a good feeling about\" her, which was what he had told Argyus as well.\nFollowing his escape, Gunray assisted Dooku in luring Jedi Master Kit Fisto, his former apprentice Jedi Knight Nahdar Vebb, and several clone troopers into a trap at General Grievous's fortress on Vassek. Count Dooku wanted General Grievous to prove his worth of leading the Droid Army by killing the intruders since he recently had been experiencing defeats at the hands of the Jedi. As part of the plot, a hologram of Gunray was used to taunt his Jedi and Republic pursuers. Gunray took great pleasure in deceiving the Jedi and laughed as he welcomed them to their doom. Shortly later, the Jedi and clone troopers were attacked by Grievous. Vebb and all the Republic clones present on the mission, with the exception of Fisto, were killed.\nUnder Darth Sidious' orders, Gunray dispatched several ships of the Federation fleet including Munificent-class star frigates to assist the bounty hunter Cad Bane on the planet Devaron. Bane had stolen a Jedi Kyber memory crystal, which contained information of value to Sidious, and kidnapped the Jedi Master Bolla Ropal. Despite Bane's successes, Gunray was furious to learn that Bane had lost four ships to Republic forces during the Battle of Devaron. When the Neimoidian demanded payment, Bane promised that Lord Sidious would compensate the Viceroy for his lost forces once the holocron had been opened.\nAfter Bane killed Ropal for refusing to open the crystal, the bounty hunter managed to kidnap Ahsoka during a skirmish aboard his Munificent frigate. Taking Ahsoka hostage, Bane was able to force Anakin to open the memory crystal. After extracting the desired information from the memory crystal, Bane escaped and reported his success to Gunray, who offered to send him a rescue ship if he disclosed the data from the crystal. However, Bane refused and insisted on sending the information directly to Darth Sidious. Bane escaped into space as the last ship in Gunray's fleet was destroyed.\nFollowing the death of Count Dooku and the defeat of the Separatist fleet during the Battle of Coruscant in 19 BBY, Gunray and the other membersof the Separatist Council met with General Grievous on the planet Utapau, which had become their hideout. With the Republic closing in on the Separatist leadership, Grievous informed the Council that he was transferring them to the volcanic planet of Mustafar for their safety, though this order was truly Sidious's. Gunray, however, responded by rising from his seat and questioning the cyborg General's abilities to keep them all safe, citing Grievous' failure to capture Chancellor Palpatine on Coruscant. Angered by Gunray's complaints, Grievous remarked that the Viceroy should be thankful not to find himself in his grip before dismissing the Council, telling them that their ship was waiting.\nThe Separatist leaders followed Grievous' instructions and departed Utapau for Mustafar moments before the arrival of Jedi Master Obi-Wan Kenobi and the 212th Attack Battalion, who engaged the cyborg general and the Separatist garrison stationed on Utapau. It was during the battle that Kenobi finally killed Grievous, dealing a crippling blow to the Confederate war effort and effectively ending the war.\nWith his personal riches nearly wiped out, the nationalization of the InterGalactic Banking Clan, and the loss of his assets on Cato Neimoidia, Gunray was left with just the Council in the conflict's final phases. With Grievous' defeat on Utapau, Gunray succeeded the droid general as de facto Head of State, being the leading member of the council, and they continued to monitor and command what was left of the Separatist forces from the complex on Mustafar. However, Gunray and the rest of the council, already demoralized by the deaths of Count Dooku and General Grievous, only wanted to sue for peace.\nAfter seducing Skywalker to the dark side and initiating the Great Jedi Purge, Sidious betrayed the Viceroy and the Separatists, by dispatching his new apprentice, now called Darth Vader, to Mustafar to kill Gunray and the other Separatist leaders. Sidious also informed the Separatist leaders of Darth Vader's arrival, but claimed that he had come to make peace with them. After Lord Vader landed, Gunray greeted the Sith apprentice, who then proceeded to shut the blast doors and execute the Separatist Council with his lightsaber. The Trade Federation Viceroy was the very last to be slain. As Vader cornered Gunray, he attempted to reason with Vader, telling the newly appointed Sith Lord that the war was over and that Lord Sidious had promised them peace. However, Lord Vader ignored Gunray's pleas and proceeded to slash him across the chest with his lightsaber, killing him.\nOnce Gunray and all the Separatist leaders had been disposed of, Vader was instructed by Sidious to transmit the order to deactivate all remaining droid units of the Separatist Droid Army, officially ending the Clone Wars.\nVader's slaughter of the Separatist leaders was covered up by the Empire, and official Imperial records stated that Gunray had taken his own life after he realized there was no chance of a Separatist victory. Following Gunray's death, the Trade Federation and its assets were dissolved by the Empire.\nSometime after the Duel on Cloud City, Sidious brutally punished Vader and left him stranded on Mustafar in an attempt to strengthen his connection to the dark side of the Force. During his punishment, Vader found Gunray's decomposing corpse still in the remains of the former Separatist stronghold after he made his way into the complex. The discovery triggered Vader to have a flashback to his slaughter of Gunray and the rest of the Separatist Council.\nAs Viceroy of the Trade Federation, Nute Gunray was powerful, deceitful and willing to kill for his financial benefit. While he hardly appeared to be an economic genius, he was indeed a cutthroat business leader who was primarily concerned with maximizing profits and his own well-being. His opposition to the Galactic Senate's taxation of trade routes led him to impose a military blockade of the planet Naboo. Gunray wanted to force the-then Naboo Queen Padmé Amidala to sign a favorable treaty with the Trade Federation. His desire to achieve these goals led him to blockade and subsequently occupy Naboo, which generated much hostility towards both Gunray and the Federation. While the wider galactic public thought that the Viceroy's Invasion of Naboo was solely motivated by greed, few were aware that Gunray was being manipulated from behind the scenes by the Sith Lord Darth Sidious.\nGunray was openly fearful of his Sith benefactor, and though working with Sidious often yielded great rewards, the Viceroy often showed frustration with Sidious' apparent lack of concern for the Trade Federation's profits. Captain Mariek Panaka once remarked that it seemed like no one but Gunray himself could understand what he wanted, but Jedi Master Mace Windu believed Gunray would at least be opposed to killing civilian Neimoidians to reach his goals. Due to Amidala's role in his defeat on Naboo, Gunray harbored a deep grudge towards the Naboo politician and made several attempts on her life in the years following the Invasion of Naboo. Gunray's vindictiveness towards Senator Amidala led him to pledge the Trade Federation's support to Count Dooku's emerging Confederacy of Independent Systems. Thinking about Gunray and all he had done to her made Amidala briefly understand what Anakin Skywalker must have felt as he cut down an entire Tusken Raider camp.\nAs an opportunistic bully, Gunray used the Trade Federation's wealth to manipulate the Rodian Senator Onaconda Farr into luring Senator Amidala into a trap in return for sending much-needed aid to the planet Rodia. However, Farr and Amidala took advantage of Gunray's vindictiveness and opportunism to capture the Viceroy. Gunray regularly avoided justice for his crimes. Dealing with Gunray was not pleasant for Sidious, who was happy to delegate matters involving the Neimoidian to Dooku. Gunray often used the pervading view of Neimoidian cowardice to his advantage, claiming he was merely an \"innocent pawn\" when captured and causing his enemies to underestimate how dangerous he could be. While Gunray preferred to leave most of the fighting to his battle droids, he was still capable of physical action when push came to shove. During an escape hatched by the traitorous Senate Commando Argyus, Gunray assisted his rescuer by knocking out the Clone Commander Gree.\nNute Gunray often clashed with General Grievous, believing that Count Dooku gave the cyborg preferential treatment. Grievous, for his part, detested the self-serving Neimoidian viceroy. Almost immediately he offended Grievous, whom he dismissed as a mere droid. Shortly after the clone wars began, Grievous lost his flagship, the Malevolence. at the Battle of the Kaliida Nebula. This setback was a source of satisfaction for Nute Gunray.\nNute Gunray wore Neimoidian clothing, including the Viceroy's collar and his crested fabric tiara. At the time of his death he was wearing a red viceroy gown.\nNute Gunray was played by Silas Carson in all of the prequel trilogy films. Carson also acted as Lott Dod, Jedi Master Ki-Adi-Mundi, and Antidar Williams in The Phantom Menace. In The Clone Wars television series, Gunray was voiced by Tom Kenny.\nNute Gunray's name had two sources from real life. The first was the Republican congressman Newt Gingrich, and the second was former President of the United States Ronald Reagan. The former source was because George Lucas primarily wrote the Trade Federation members in terms of motives and characterizations in response to the 1994 Republican Revolution , specifically then-Speaker of the House Gingrich's Contract with America, and the latter source was as a response to Reagan's SDI program being labeled \"Star Wars\" without Lucas' permission.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nute_Gunray",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Brotherhood",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_31",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_54",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Grand_Army_of_the_Republic",
  "/wiki/The_Separatists",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Nute_Gunray",
  "/wiki/Neimoidia",
  "/wiki/19_BBY",
  "/wiki/Mustafar",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Trade_Federation",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Sith",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Executive_Separatist_Council",
  "/wiki/File:NeverRiskMyOwnSkin-CoD.ogg",
  "/wiki/Politics",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Standard_decade",
  "/wiki/Senator",
  "/wiki/Standard_year",
  "/wiki/Separatist_Council",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Grand_Plan",
  "/wiki/Death",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Galactic_Empire",
  "/wiki/32_BBY",
  "/wiki/Mid_Rim",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Supreme_Chancellor",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Trade_Federation_Droid_Army",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Homeworld",
  "/wiki/Coruscant",
  "/wiki/Supreme_Court",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Geonosis",
  "/wiki/Kaminoan",
  "/wiki/Clone",
  "/wiki/Army",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Clone_Wars",
  "/wiki/Rodia",
  "/wiki/Onaconda_Farr",
  "/wiki/Asajj_Ventress",
  "/wiki/Sith_assassin",
  "/wiki/Cyborg",
  "/wiki/Supreme_Martial_Commander_of_the_Separatist_Droid_Armies",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Safe_In_Our_Hands",
  "/wiki/Eleven_Star_Marketing",
  "/wiki/Delcontrian",
  "/wiki/Battle_Droid",
  "/wiki/File:Gunray-TC-14-JediKnights.ogg",
  "/wiki/Prop_31-814D",
  "/wiki/Star_system",
  "/wiki/Naboo_(people)",
  "/wiki/Blockade",
  "/wiki/Fleet",
  "/wiki/Lucrehulk-class_LH-3210_cargo_freighter",
  "/wiki/Flagship",
  "/wiki/Saak%27ak",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Finis_Valorum",
  "/wiki/Jedi",
  "/wiki/Emissary",
  "/wiki/Radiant_VII",
  "/wiki/Hangar",
  "/wiki/Captain",
  "/wiki/Daultay_Dofine",
  "/wiki/Darth",
  "/wiki/Hologram",
  "/wiki/Poison_gas",
  "/wiki/OOM-series_security_droid",
  "/wiki/Escape_from_the_Saak%27ak",
  "/wiki/Poison",
  "/wiki/Battle_droid",
  "/wiki/Droideka",
  "/wiki/Monarch_of_Naboo",
  "/wiki/C-9979_landing_craft",
  "/wiki/OOM_command_battle_droid",
  "/wiki/OOM-9",
  "/wiki/Capture_of_Theed",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Theed",
  "/wiki/Droid",
  "/wiki/Camp_Four",
  "/wiki/Gungan",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Settlement_Officer",
  "/wiki/Rune_Haako",
  "/wiki/Theed_Royal_Palace",
  "/wiki/Governor",
  "/wiki/Sio_Bibble",
  "/wiki/Mechno-chair",
  "/wiki/Sach%C3%A9",
  "/wiki/Lott_Dod",
  "/wiki/Vote_of_No_Confidence",
  "/wiki/Water",
  "/wiki/Otoh_Gunga",
  "/wiki/Vuutun_Palaa",
  "/wiki/Naboo_Royal_Starship",
  "/wiki/Naboo_resistance",
  "/wiki/Boss",
  "/wiki/Rugor_Nass",
  "/wiki/Gungan_Grand_Army",
  "/wiki/N-1_starfighter",
  "/wiki/Sith_apprentice",
  "/wiki/Maul",
  "/wiki/Battle_of_Naboo",
  "/wiki/Starfighter",
  "/wiki/Lightsaber_duel",
  "/wiki/Throne_room_(Theed_Royal_Palace)",
  "/wiki/Realspace",
  "/wiki/Transport",
  "/wiki/The_galaxy",
  "/wiki/TriNebulon_News",
  "/wiki/Separatist_Crisis",
  "/wiki/Serenno",
  "/wiki/24_BBY",
  "/wiki/Raxus_Address",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Zam_Wesell",
  "/wiki/Bounty",
  "/wiki/Jedi_Order",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Kamino",
  "/wiki/Desert",
  "/wiki/Archduke",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Foreman",
  "/wiki/Wat_Tambor",
  "/wiki/Commerce_Guild",
  "/wiki/Corporate_Alliance",
  "/wiki/Geonosian_accord",
  "/wiki/Geonosian",
  "/wiki/Death_penalty",
  "/wiki/Petranaki_Arena",
  "/wiki/Reek",
  "/wiki/Acklay",
  "/wiki/Picador",
  "/wiki/Boba_Fett",
  "/wiki/Nexu",
  "/wiki/Jedi_strike_force",
  "/wiki/Mace_Windu",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Geonosian_Command_Center",
  "/wiki/Cloning",
  "/wiki/Trooper",
  "/wiki/Commander",
  "/wiki/Galaxy",
  "/wiki/Nooroyo",
  "/wiki/Spice",
  "/wiki/Mission_to_Nooroyo",
  "/wiki/Torada_Collective",
  "/wiki/Padm%C3%A9_Amidala%27s_H-type_Nubian_yacht",
  "/wiki/Jamillia",
  "/wiki/Antraya",
  "/wiki/Droid_starfighter",
  "/wiki/Oje_N%27deeb",
  "/wiki/Siege_on_Hebekrr_Minor",
  "/wiki/Pirate",
  "/wiki/Rodian",
  "/wiki/Junior_Representative",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Kwazel_Maw",
  "/wiki/Bogey_(Kwazel_Maw)",
  "/wiki/Sheathipede-class_transport_shuttle",
  "/wiki/Blaster",
  "/wiki/41st_Elite_Corps",
  "/wiki/File:GunrayGreeGift.ogg",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Tranquility",
  "/wiki/Jedi_High_Council",
  "/wiki/Luminara_Unduli",
  "/wiki/Ahsoka_Tano",
  "/wiki/Senate_Guard",
  "/wiki/Faro_Argyus",
  "/wiki/Clone_Commander",
  "/wiki/CC-1004",
  "/wiki/Dathomirian",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Assassin",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/Power_generator",
  "/wiki/Prison",
  "/wiki/Treason",
  "/wiki/Senate_Commando",
  "/wiki/Consular-class_cruiser_(Charger_c70_retrofit)",
  "/wiki/Republic_escape_pod",
  "/wiki/Asajj_Ventress%27_lightsabers",
  "/wiki/Kit_Fisto",
  "/wiki/Nahdar_Vebb",
  "/wiki/Grievous%27s_fortress",
  "/wiki/Vassek",
  "/wiki/Battle_of_the_Kaliida_Nebula",
  "/wiki/Mission_to_Skytop_Station",
  "/wiki/Mission_to_Vassek_3",
  "/wiki/Cad_Bane",
  "/wiki/Trade_Federation_fleet",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Devaron",
  "/wiki/Kyber_memory_crystal",
  "/wiki/Bolla_Ropal",
  "/wiki/Battle_of_Devaron",
  "/wiki/Cad_Bane%27s_Munificent-class_star_frigate",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Utapau",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Battle_of_Utapau",
  "/wiki/File:Nute_Gunray_Last_Words_ROTS.ogg",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Head_of_State",
  "/wiki/Klegger_Corp_Mining_Facility",
  "/wiki/Order_66",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Duel_on_Cloud_City",
  "/wiki/The_Force",
  "/wiki/Mariek_Panaka",
  "/wiki/Mission_to_rescue_Shmi_Skywalker_Lars",
  "/wiki/Tusken_Raider_camp_(Anakin_Skywalker)",
  "/wiki/Commando",
  "/wiki/Malevolence",
  "/wiki/Kaliida_Nebula",
  "/wiki/Clothing",
  "/wiki/Viceroy%27s_collar",
  "/wiki/Viceroy_gown",
  "/wiki/Iain_McCaig",
  "/wiki/Silas_Carson",
  "/wiki/Prequel_trilogy",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Antidar_Williams",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Tom_Kenny",
  "/wiki/George_Lucas",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Short_Negotiations",
  "/wiki/5-Minute_Star_Wars_Stories_Strike_Back",
  "/wiki/Short_Negotiations_(The_Prequel_Trilogy_Stories)",
  "/wiki/The_Prequel_Trilogy_Stories",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Attack_of_the_Clones_(Golden_Book)",
  "/wiki/Queen%27s_Hope",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Supply_Lines",
  "/wiki/Rookies",
  "/wiki/Bombad_Jedi",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Lair_of_Grievous",
  "/wiki/Cargo_of_Doom",
  "/wiki/The_Zillo_Beast",
  "/wiki/Senate_Spy",
  "/wiki/Sphere_of_Influence",
  "/wiki/Hostage_Crisis",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/So_Much_More",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/Darth_Vader_(2020)_7",
  "/wiki/Darth_Vader_(2020)_24",
  "/wiki/Star_Wars_(2020)_27",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Luke_vs._Emperor_Palpatine_-_Rise_to_Evil",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Zander%27s_Joyride",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Exit_from_Endor",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Nute_Gunray",
  "/wiki/Category:Images_of_Nute_Gunray",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Star_Pilot_(2015)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_17",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_30",
  "/wiki/Starship_Fact_File",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_70",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_-_The_Official_Magazine",
  "/wiki/Star_Wars_-_The_Official_Magazine_84",
  "/wiki/Database",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Battle_of_Scarif",
  "/wiki/0_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Aftermath_(novel)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Ships_of_the_Republic_and_Separatists_(I)",
  "/wiki/Destroy_Malevolence",
  "/wiki/July_12",
  "/wiki/2020"
 ]
}