{
 "name": "Nuukol",
 "display_name": "Nuukol",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Ambassador Nuukol was a male Mon Calamari who lived at some point during galactic history.\nNuukol was a male Mon Calamari ambassador who attempted to negotiate a compromise between the Mon Calamari and the Quarren, a rival sentient species that lived on the Mon Calamari homeworld. Nuukol met with the Quarran ambassador Tsillog on the planet Coruscant and they eventually negotiated an accord. To outline their proposals to their respective peoples, Nuukol planned to hold a press conference outside the Mon Calamari embassy, while Tsillog would hold a similar conference outside the Quarren embassy the following day. Using the alias \"Avreet\", Nuukol hired two Mon Calamari radicals to make an attempt on his life, believing that their attack would be unsuccessful and would increase public sentiment for his cause. In addition, he also hired the Rodian Loodux to assassinate Tsillig, hoping that Quarren would be killed and replaced by a new ambassador who was more committed to developing a lasting peace between the two species.\nWhile Nuukol prepared to give his speech at the Mon Calamari embassy, he was attacked by the two Mon Calamari radicals. Their assassination attempt failed, but Nuukol was injured, and he was taken to the embassy's medical facilities. The attackers were captured and revealed that an assassin had been sent to murder Tsillog, so Nuukol hired a group of agents to thwart the attempt on the Quarren's life. The agents saved Tsillog and they eventually deduced that Nuukol was behind the assassination attempt. As a result, Nuukol was sent to a prison facility located on one of the moons of the planet Mon Calamari.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Species/Legends",
  "/wiki/Dac",
  "/wiki/Tsillog",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Loodux",
  "/wiki/Assassin/Legends",
  "/wiki/Death/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Galaxy_of_Intrigue"
 ]
}