{
 "name": "Nyama",
 "display_name": "Nyama",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Stromma"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Stromma council",
      "Nuso Esva's realm",
      "Quesoth",
      "Queen of the Red",
      "Quesoth",
      "Queen of the Red"
     ]
    }
   ]
  }
 ],
 "content": "Nyama was an aggressive Stromma male who was the Stromma council's liaison to Grand Admiral Thrawn's Empire of the Hand. In 8 ABY, he met several Imperial officers aboard the Imperial I-class Star Destroyer Admonitor over the Unknown Regions planet Quethold, where alien warlord Nuso Esva was hiding.\nNyama and his conciliator discussed the Quesoth Soldiers within Quethold's Red City, as well as the Quesoth Soldier Speak language. Senior Captain Voss Parck also talked about the battle of the Stromma homeworld of Oristrom, which the Stromma was winning before Esva assumed command. After Thrawn presented a dangerous battle plan of an attack on the Quesoth, Nyama withdrew the Stromma forces from the Empire of the Hand. During the battle, Esva told Quesoth bowlcarrier Trevik of the Grand Admiral's ability to learn someone's strategy by studying their art, declaring it true after the Stromma Council Liaison discovered it aboard the Admonitor.\nThe Stromma male Nyama was the Stromma council liaison to the Empire of the Hand in 8 ABY. After he and his Stromma warriors arrived at the Imperial I-class Star Destroyer Admonitor aboard several carriers and Nyama's shuttle, the liaison and his conciliator met several Imperial officers during a strategy session. Imperial Senior Captain Voss Parck and Grand Admiral Thrawn discussed alien warlord Nuso Esva's remaining forces and the Empire's future attack on the Unknown Regions planet Quethold's Red City, where the Quesoth species lived, with Nyama, who shared information on the Stromma wars against the Quesoth. Thrawn then requested a recording of Esva's artwork within the city, and Nyama gave a holocam to several traitorous Quesoth to record the art.\nAfter receiving the recordings, which were recorded by bowlcarrier Trevik, who carried a bowl of nectar for the Quesoth Queen of the Red, the liaison translated some phrases spoken in the Quesoth Soldier Speak language before Thrawn promised victory by sending Human Imperial stormtroopers to fight Quesoth Soldiers, which prompted Nyama to withdraw all Stromma from Imperial service, as he deemed the Humans unfit to defeat the Soldiers. Although his conciliator attempted to stop him, his forces indeed left the Admonitor. During the battle between Esva's forces and the Empire of the Hand, the warlord and the Quesoth Queen informed Trevik that Nyama was able to confirm that Thrawn could determine an enemy's strategy by studying their art. The alien also told the bowlcarrier that the artwork recorded under Nyama's directive was there to mislead Thrawn, who would strategize according to the paintings, allowing Esva to defeat him; however, the Grand Admiral expected such a plot, and changed his strategy halfway into the battle, defeating the warlord.\nWhile in the strategy session, Nyama and Balkin discussed the Midli and Circling Quesoth castes, and the former established they were loyal to their Queen and could think by themselves. When Balkin asked if they were loyal, the impatient Stromma insulted him before his conciliator stopped him. An arrogant and aggresive Stromma, Nyama was quick to anger and an ally of the Queen of the Red.\nNyama appeared in the 2011 novella Crisis of Faith, written by Timothy Zahn and published within the 20th Anniversary Edition of Zahn's 1991 novel Heir to the Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Stromma",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Stromma_council",
  "/wiki/Nuso_Esva%27s_realm",
  "/wiki/Quesoth",
  "/wiki/Queen_of_the_Red_(8_ABY)",
  "/wiki/Stromma_Council_Liaison",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/8_ABY/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Admonitor",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Quethold",
  "/wiki/Storm-hairs",
  "/wiki/Warlord/Legends",
  "/wiki/Nuso_Esva",
  "/wiki/Quesoth_Soldiers",
  "/wiki/Red_City",
  "/wiki/Quesoth_Soldier_Speak",
  "/wiki/Language/Legends",
  "/wiki/Senior_Captain/Legends",
  "/wiki/Voss_Parck/Legends",
  "/wiki/Battle_of_Oristrom",
  "/wiki/Homeworld/Legends",
  "/wiki/Oristrom",
  "/wiki/Battle_of_Quethold",
  "/wiki/Bowlcarrier",
  "/wiki/Trevik",
  "/wiki/Soldier/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Carrier/Legends",
  "/wiki/Species/Legends",
  "/wiki/Expansion_Period",
  "/wiki/Painting/Legends",
  "/wiki/City/Legends",
  "/wiki/Holocamera",
  "/wiki/Treason/Legends",
  "/wiki/Nectar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Queen_of_the_Red",
  "/wiki/Midli",
  "/wiki/Circling",
  "/wiki/Queen/Legends",
  "/wiki/2011",
  "/wiki/Crisis_of_Faith",
  "/wiki/Timothy_Zahn",
  "/wiki/Heir_to_the_Empire:_The_20th_Anniversary_Edition",
  "/wiki/1991",
  "/wiki/Heir_to_the_Empire",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Quethold_system"
 ]
}