{
 "name": "Nyiestra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Nyiestra was a female Human from Alderaan and the fiancée of Tycho Celchu. She perished in the destruction of her home planet.\nGrowing up on the pacifistic planet Alderaan, Nyiestra knew Tycho Celchu through her entire childhood, and the two became close friends. By the time they reached adolescence, he was certain he wanted to marry her, and she reciprocated his love. They spent as much time as possible together, eager to enjoy each other's company. Celchu proposed as soon as he was of age, and Nyiestra agreed to both marry him and wait until he had graduated from the Imperial Academy, made it through his first year as a TIE pilot, and been moved into fleet operations where his life would be secure enough professionally to begin a family. Celchu was tremendously certain in his relationship with Nyiestra, sure that she provided an unshakable future for him.\nHowever, Nyiestra died in 0 BBY when the Death Star destroyed Alderaan and, in so doing, eliminated that certain future. Celchu was traumatized, throwing himself into battle against the Galactic Empire that had taken his family and fiancée from him, dedicating himself to making sure no one else suffered their fate. However, in so doing, Celchu became a hardened warrior, someone the pacifistic Nyiestra would not have understood. He realized that, by taking the action he felt was necessary and opposing the Empire, he had become someone fundamentally unsuitable for Nyiestra—a loss which cut him deeply, though he accepted it as inevitable.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Winter_Celchu",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Homeworld/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Imperial_Naval_Academy",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Pilot/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/X-Wing_Rogue_Squadron_3",
  "/wiki/X-Wing_Rogue_Squadron_9",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Rogue_Squadron",
  "/wiki/Star_Wars_Insider_59",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}