{
 "name": "Nyranos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Belsavis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaleesh"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Condemned",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Nyranos was a male Kaleesh who was the leader of the Condemned, descendants of prisoners that lived on the planet Belsavis.\nAround 3641 BBY, Nyranos and the Condemned were strongly opposed to the Republic when the SIS informed that prisoners' descendants were not allowed to leave Belsavis. Refusing to accept that, Nyranos led the Condemned to attack a Prison Administration Prison during the reconstituted Sith Empire's attack on the planet. Though initial attempts to use their neural disruptor failed as a Republic strike team had uncovered their plans and informed the base, which re-modulated their shields, forcing the Condemned to go in by force.\nNyranos made his way to the control room with his Imperial attache, Agent Feldon and a few of his men when he was confronted by the strike team. Though the Kaleesh explained he only wanted justice for his people, the Imperial agent didn't care for it, and his own men turned on him for credits. Nyranos and the strike team managed to kill them all, before the former ordered his remaining followers to stand down. Just then, acting-Warden Graal came running in, angry with Nyranos for the death of his junior officer, Kelsa Gerro, and demanded that the Kaleesh be executed. Nyranos pleaded for his life, reasoning that the Condemned did not deserve imprisonment for their ancestors' crimes, and offered to have his people work with the Republic in exchange for land to settle on Belsavis. The strike team was successfully able to convince Graal to let go of his want for revenge and work with the Condemned, to Nyranos' relief.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Belsavis/Legends",
  "/wiki/Kaleesh/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Condemned",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3641_BBY",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Prison_Administration_Center",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Invasion_of_Belsavis",
  "/wiki/Feldon_(Human)",
  "/wiki/Credit",
  "/wiki/Death/Legends",
  "/wiki/Graal_(Warden)",
  "/wiki/Kelsa_Gerro",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Nyranos",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}