{
 "name": "Nysad",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kintan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kajain'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Nysad was one of many Kajain'sa'Nikto in the service of Jabba the Hutt. He was aboard the Khetanna at the Great Pit of Carkoon, and was killed in the ensuing fight between Jabba's forces and Luke Skywalker's allies during the Rescue of Han Solo in 4 ABY. Nysad fired a shot at Skywalker, but the Jedi rebounded it with his lightsaber, killing him.\nNysad was a Kajain'sa'Nikto male from the planet Kintan, one of many members of his species who served the Hutt crime lord Jabba Desilijic Tiure as part of the court of the Hutt's palace on the desert planet Tatooine. In 4 ABY, Nysad stood beside the bounty hunter Boba Fett on the steps beside Jabba's throne while the Max Rebo Band performed the song \"Jedi Rocks\" for the crime lord and his court. Jabba demanded the song be sung again once it finished, but interrupted the second performance by dropping the enslaved dancer Oola into a pit beneath the throne room after she refused his advances. She was then devored by Jabba's pet rancor, Pateesa, as the court watched.\nOnce the gruesome spectacle was over, the court's attention was drawn to the throne room entryway by blaster fire, and Princess Leia Organa entered with the Wookiee Chewbacca. Organa was disguised as the bounty hunter Boushh, and presented Chewbacca as her prisoner to Jabba, who offered the bounty of twenty five thousand credits on the Wookiee's head. Organa demanded more, and revealed that she had an active thermal detonator, causing Nysad and many other court members to immediately duck for cover. Laughing, Jabba counter offered thirty five thousand credits, which Organa accepted. Nysad moved back out from cover onto the stairs as Chewbacca was taken away to the palace dungeons.\nNysad then took part in a trap that Jabba set for Organa, who had actually come to the palace to free the smuggler Han Solo, who had been frozen in carbonite and displayed on the throne room wall. Having been warned by the bounty hunter Boba Fett that Boushh was not who they seemed, the Hutt had Nysad and many other court members lay in wait behind curtains in the throne room later that night. After they had waited for an hour, the princess entered the room while she thought everyone was asleep. Once she freed Solo, Jabba had the curtains pulled back, revealing Nysad and the others, who blocked her route to the throne room's exit. Both Solo and Organa were then captured.\nThe next morning, the Jedi Knight Luke Skywalker arrived to free Solo, Organa, and Chewbacca. Using Jedi mind tricks, he reached the court room while the Hutt and many of the palace's other denizens still slept and had Jabba's majordomo Bib Fortuna wake him. Nysad then stood on the steps beside Jabba's throne with fellow guards Vizam and Klaatu as Skywalker demanded his allies be set free. Jabba refused, and when Skywalker threatened him with a blaster pistol, the Hutt dropped Skywalker, and the unfortunate Gamorrean guard Jubnuk, through a trap door into a pit below the throne room. Nysad and the others rushed forward to a grating that looked down into the pit, where Jabba's pet rancor, Pateesa, emerged and devored Jubnuk. Skywalker, however, managed to kill the beast, enraging Jabba, who had Skywalker, Solo, and Chewbacca brought up before him in the throne room. After the Hutt sentenced them to be executed at the Great Pit of Carkoon, Nysad joined the crowd that eagerly followed the prisoners as they were marched out of the room.\nNysad traveled with Jabba to the Great Pit of Carkoon on board the Khetanna, the Hutt's sail barge, and spent time inside the vessel during the journey and once it arrived. The prisoners were transported on separate skiffs and upon reaching the pit, Jabba gave them the chance to beg for their lives as Nysad and others watched through the barge's shuttered windows. Skywalker and his allies refused, and after being pushed over the edge of the skiff, the Jedi leapt back on and began attacking his captors with his lightsaber. After Organa managed to shut the blinds and throw the interior of the sail barge into darkness, Skywalker fought his way up onto the top deck of the barge and began slaying the guards there.\nWith a cackle, Nysad emerged through one of the hatches on to the barge's deck and opened fire on Skywalker with his blaster pistol; however, the Jedi deflected the shot with his blade and then slashed the Nikto across the chest with the lightsaber, killing him. Organa, meanwhile, had strangled Jabba and then emerged onto the deck to aid Skywalker, with the pair ultimately destroying the sail barge and escaping with their allies.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nysad",
  "/wiki/Nysad/Legends",
  "/wiki/Kintan",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Khetanna",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Luke_Skywalker",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Lightsaber",
  "/wiki/Planet",
  "/wiki/Species",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Desert",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Max_Rebo_Band",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Blaster",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Boushh",
  "/wiki/Bounty",
  "/wiki/Credit",
  "/wiki/Thermal_detonator",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Standard_hour",
  "/wiki/Sleep",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi",
  "/wiki/Mind_trick",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Vizam",
  "/wiki/Klaatu",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Gamorrean",
  "/wiki/Jubnuk",
  "/wiki/Sail_barge",
  "/wiki/Time",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Skiff",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Blaster_pistol",
  "/wiki/Nikto",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Nysad",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!"
 ]
}