{
 "name": "Nyscha",
 "display_name": "Nyscha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sarkhai"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sarkhai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sarkhai",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Nyscha was a Sarkhai female who was the wife of King Sethun and the Queen of Sarkhai during the time of the Galactic War between the Galactic Republic and the resurgent Sith Empire. Together with her husband, they were captured on Waypoint Station Three by Kyrus and Augin Blaesus, who was a Child of the Emperor and a spy to the Rift Alliance. However, their efforts failed when the Barsen'thor defeated them.\nIn 3642 BBY, Queen Nyscha, along with her her husband Sethun were planning to donate a regiment to the Galactic Republic and heal relations between the government and the Rift Alliance. There, they would deliver troops to aid the Barsen'thor in battling the resurgent Sith Empire. They were stationed on Waypoint Station Three where they hosted a ceremony and present the Jedi with their soldiers. However, while the Barsen'thor was needed on Hoth, Senator Tobas Grell decided to send the Erigorm representative Augin Blaesus as their envoy, but it turns out that Blaesus was a Child of the Emperor. With the assistance of Lord Kyrus, they slaughtered all the soldiers that Nyscha and Sethun were delivering to the Rift Alliance.\nEventually, the Barsen'thor arrived to the station, but the royal family were already captured by the Sith. Nyscha was held at the mercy of Kyrus, but Sethun pleaded him to release her. Blaesus offered Nyscha and Sethun a chance for them and their planet to be saved by the coming destruction; they would order their remaining guards to kill the Jedi. The Barsen'thor warned them that if they agree to this, the Sith would still betray them. Nyscha refused to turn against the Jedi and submit her loyalty to the Empire. This angered Blaesus as he ordered Kyrus to eliminate the Jedi. Nyscha and Sethun watched the fight as the Barsen'thor was able to defeat Blaesus and Kyrus. Nyscha thanked the Jedi for everything and hoped that Tobas Grell and his daughter Nadia were all right since she owes them so much. After their rescue, Nyscha and Sethun returned home safe and gave the Republic full access to their treasury.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Sarkhai",
  "/wiki/Sarkhai_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/King/Legends",
  "/wiki/Sethun",
  "/wiki/Queen/Legends",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Waypoint_Station_Three",
  "/wiki/Kyrus",
  "/wiki/Augin_Blaesus",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Tenebrae",
  "/wiki/Rift_Alliance",
  "/wiki/The_Barsen%27thor",
  "/wiki/3642_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Tobas_Grell",
  "/wiki/Erigorm",
  "/wiki/Sith/Legends",
  "/wiki/Nadia_Grell",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}