{
 "name": "Nysis_Belzara",
 "display_name": "Nysis Belzara",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 31 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Nysis Belzara was a male Bothan Jedi Knight who served the Jedi Order during the last years of the Galactic Republic. Around 31 BBY, Belzara greeted a starship arriving on the planet Coruscant that was transporting a Mandalorian iron box on behalf of the Jedi. The Bothan was subsequently killed in an ambush by the Believers, dark side cultists who sought to steal the vessel's cargo.\nNysis Belzara was a Force-sensitive Bothan male who served the Jedi Order during the latter years of the Galactic Republic, attaining the rank of Jedi Knight. Around 31 BBY, Jedi researchers discovered the Pulas, a powerful Sith artifact, on the planet Almas. To keep the relic out of the clutches of the Believers, a dark side cult who sought to steal it, the Jedi arranged to relocate the artifact to the galactic capital Coruscant for safe keeping. A fleet of ships was assembled to ferry the relic, with each vessel carrying a Mandalorian iron box, one of which contained the Pulas and the others acting as decoys. Belzara was tasked by the Jedi Council, the ruling body of the Jedi Order, with meeting one of the starships arriving on Coruscant and accompanying the crew and their Mandalorian iron box to a safe house.\nThe starship that Belzara was assigned to meet docked on a Coruscant landing platform and just as the crew were disembarking, the Bothan arrived to greet them. However, one of the ship's company the, Tarasin Es'Loma, was secretly in league with the Believers. The Tarasin pretended to fall from the edge of the platform, distracting Belzara and her fellow crew members, the Wookiee Wojarra and the Human Force Adepts San Herrera and Nia Reston, just as a Believer strike team attacked. Belzara was shot and killed in the ambush and the Believers seized the box that the ship had been transporting, which contained a fragment of the dark side-imbued city Conkesta. Moments later, the Jedi Knight Devan For'deschel and a group of spacers arrived at the landing platform; For'deschel recognized Belzara and contacted the Jedi Council to notify them of the Bothan's demise, while Wojarra provided the spacers an account of Belzara's death.\nNysis Belzara was created by Morrie Mullins and featured in the 2002 roleplaying adventure Coruscani Dawn, which formed part of the Living Force campaign and debuted at the fan convention Celebration II. Belzara's death takes place off-scene during the adventure and only his corpse appears directly in the roleplaying module.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mandalorian_iron",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Believers",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_cult",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Pulas",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Almas",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Iron/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Tarasin",
  "/wiki/Es%27Loma",
  "/wiki/Wookiee/Legends",
  "/wiki/Wojarra",
  "/wiki/Human/Legends",
  "/wiki/Force_Adept",
  "/wiki/San_Herrera",
  "/wiki/Nia_Reston",
  "/wiki/City/Legends",
  "/wiki/Conkesta",
  "/wiki/Devan_For%27deschel",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Morrie_Mullins",
  "/wiki/2002",
  "/wiki/Roleplaying_game",
  "/wiki/Coruscani_Dawn",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Celebration_II",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Resistance_Within"
 ]
}