{
 "name": "O'choa Detera",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Jewel system band"
     ]
    }
   ]
  }
 ],
 "content": "O'choa Detera was a female Zabrak dancer who lived during the Galactic Civil War.\nAfter the Battle of Yavin, O'choa Detera was part of a band that performed in the Bright Jewel system. The band also included another dancer, Mestral, and three musicians, Alisia, Alitra and Mako. During that time, the band often played music and danced for the patrons of the cantinas of Tansarii Point Station and Nova Orion Station, two space station located near the planet of Ord Mantell, in the Bright Jewel system.\nBy the time of the Battle of Yavin, a man named Mot Draken fell deeply in love with O'choa Detera while visiting Tansarii Point Station. He then decided to stay on the station. Nevertheless, although he patronized the Tansarii Point's cantina for two years, he never had the courage to talk to her and share his feelings. Then, O'choa finally understood why Draken still remained on the station but she instead had a crush on Bun'Del, one of Mot's friends.\nO'choa Detera was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. O'choa Detera and her band were added to the game as part of the \"New Player Tutorial,\" introduced with the release of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005. The \"New Player Tutorial\" featured the band in the cantina of Tansarii Point Station. With the release of the \"Chapter 8,\" on January 15, 2008, O'choa Detera and the band were also included in the cantina of the Nova Orion Station.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Unidentified_Bright_Jewel_system_band",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mot_Draken",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Mestral",
  "/wiki/Musician/Legends",
  "/wiki/Alisia_(Human)",
  "/wiki/Alitra",
  "/wiki/Mako_(musician)",
  "/wiki/Cantina/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Nova_Orion_Station",
  "/wiki/Space_station/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Bun%27Del",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/January_15",
  "/wiki/2008",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures"
 ]
}