{
 "name": "Ob Khaddor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ob Khaddor was a Human male who served as an outspoken radical Alderaanian artist and grass painter, most famous for having created the moss painting Killik Twilight. He also created the paintings known as Feared and Fighter.\nOb Khaddor was a Human male from Alderaan, a planet where artists and philosophers proliferated. In his youth, Khaddor joined the renowned University of Alderaan, one of the most ancient and prestigious places of learning in the galaxy, where he built himself a reputation as a troublemaker and a radical. He became a grass painter, a botanical artist who created giant works of art by managing the growth of various species of grass. One of his most famous works was the Killik Twilight, a moss painting that depicted the Killik, an ancient race that had once inhabited Alderaan. That painting was hung in the Royal Palace of Aldera, outside the bedroom of the young Princess Leia Organa.\nOne day, Khaddor was told that the Galactic Emperor Palpatine planned a stopover on Alderaan. The artist, who had made himself famous for his overt anti-Imperial sentiments, campaigned so he would be authorized to create a painting that would \"commemorate\" the imminent arrival of Emperor. When Palpatine arrived on the site, he could behold a magnificent, extremely flattering portrait; however, Ob Khaddor had played a trick on the Empire. The artist had arranged things so that carefully planted black lilies would spread open, making it look like as if the Emperor's skin was decayed and rotten.\nA very infuriated Palpatine ordered the whole grassplain to burned down, and the Viceroy Bail Prestor Organa apologized personally in feigned indignation. Ob Khaddor, however, did not suffer the consequences of his mockery, as he had secretly left the planet before the arrival of the Imperial delegation. Subsequently, the Empire put a death mark on Khaddor, and numerous bounty hunters got on his track. However, Ob Khaddor's ultimate whereabouts were still unknown following the destruction of Alderaan in the year 0 BBY. In a report she wrote about her defunct homeworld, the Alderaanian poetess Hari Seldona mentioned Khaddor at great length.\nKhaddor's name is misspelled Ob Khaddar in The Illustrated Star Wars Universe, The Official Star Wars Fact File and Star Wars Galaxies.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Artist/Legends",
  "/wiki/Grass_painting",
  "/wiki/Moss_painting/Legends",
  "/wiki/Killik_Twilight",
  "/wiki/Painting/Legends",
  "/wiki/Feared",
  "/wiki/Fighter_(painting)",
  "/wiki/Planet/Legends",
  "/wiki/University_of_Alderaan/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Species/Legends",
  "/wiki/Grass/Legends",
  "/wiki/Killik/Legends",
  "/wiki/Aldera_Royal_Palace",
  "/wiki/Aldera/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Standard_day/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Black_lily",
  "/wiki/Viceroy/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Death_mark/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Standard_year/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Poet/Legends",
  "/wiki/Hari_Seldona",
  "/wiki/The_Illustrated_Star_Wars_Universe",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Tatooine_Ghost",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/The_Official_Star_Wars_Fact_File_18",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}