{
 "name": "Oberk",
 "display_name": "Oberk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ukio"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireStormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Oberk was an Imperial scout trooper and a corporal at the time of the Battle of Endor.\nOberk was originally from the planet Ukio, and was known as a show-off. He was transferred to scout trooper duty when it was discovered he could skilfully pilot a 74-Z speeder bike.\nDuring a tour of duty on Endor, Oberk encountered and held Rebel operative Leia Organa at pistol-point and, after Oberk ordered his comrade to ready his speeder, Ewok Wicket Wystri Warrick, with whom Organa had recently become acquainted, attacked Oberk with his spear. Oberk was momentarily distracted before Organa bludgeoned him with a branch and knocked him unconscious.\nThe character of Oberk first appeared as a scout trooper extra in the film Star Wars: Episode VI Return of the Jedi, released in 1983. In the film, he was portrayed by an uncredited actor. Prior to the film, in the Return of the Jedi novel released earlier that same year, an unnamed scout trooper with Oberk's role appeared. He is alone when capturing Leia Organa, has different dialogue in the scene, and Organa kills him with his own blaster after Wicket Warrick attacks him. In the same year as the film and the novel, Oberk was also pictured in the Return of the Jedi Storybook, although the text is similar to the novel in describing a single scout trooper attempting to capture Organa, and being killed by her with Warrick's assistance. This article avoids treating the novel as a confirmed Oberk appearance, and lists the Return of the Jedi Storybook as an appearance only because it pictures the character.\nIn 1999, Oberk was given a name and a brief backstory in the Endor Limited edition of the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ukio/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Scout_trooper/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi",
  "/wiki/Planet/Legends",
  "/wiki/74-Z_speeder_bike/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Spear/Legends",
  "/wiki/1983",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(novel)",
  "/wiki/Return_of_the_Jedi_Storybook",
  "/wiki/1999",
  "/wiki/Endor_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/September_11",
  "/wiki/2021"
 ]
}