{
 "name": "Oberhaur",
 "display_name": "Oberhaur",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Storm Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Oberhaur was a commander and Imperial Pilot Trainer in the Imperial Navy.\nAfter the Battle of Yavin, Oberhaur was stationed in the capitol building of Bestine on Tatooine. Here, he trained pilots of the Storm Squadron starfighter unit.\nDuring 1 ABY, Oberhaur met one particular useful pilot. He tasked the pilot with a number of various missions, starting with the disabling and inspection of a lieutenant's ship over Lok space. The Lieutenant was a member of the Lok Revenants, so Oberhaur was particularly interested in his purpose. After the successful completion of this mission, Oberhaur had the pilot intercept an HC-556 Light Cruiser which was being used as a hostage transport. Though the pilot was met with some resistance, he succeeded in escorting the cruiser to safety.\nOberhaur had one final task for the pilot, however, and it was much more daring than the previous ones. Oberhaur wanted the pilot to head over to Nym's Stronghold, and speak to an undercover Imperial Agent named Morv. The agent, disguised as a Nym's Fuel Technician, tasked the pilot with destroying a YT-1300 named the Kimogila's Claw. The pilot once again succeeded, and returned to Oberhaur, expecting another task. While Oberhaur was pleased with the pilot's work, he had no other use for him. Oberhaur reassigned the pilot to Field Commander Alozen, so that the pilot could continue his future in the Imperial Navy.\nCommander Oberhaur is a Non-Player Character in the MMORPG Star Wars Galaxies. Players progressing through the Imperial Storm Squadron must work for Oberhaur, so that they can gain experience and progress through the Imperial Pilot Profession.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Storm_Squadron_(Imperial)",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Commander/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/HC-556_Light_Cruiser",
  "/wiki/Nym%27s_Stronghold",
  "/wiki/Morv",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Kimogila%27s_Claw",
  "/wiki/Field_Commander/Legends",
  "/wiki/Alozen",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed"
 ]
}