{
 "name": "Obitoki",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Non-Human"
     ]
    }
   ]
  }
 ],
 "content": "Obitoki, a non-Human Podracer, competed against a Dug named Sebulba sometime before 27 BBY. During the race, Sebulba disabled Obitoki's pod by shooting flames into one of its engines after Obitoki tried to overtake him.\nObitoki was a non-Human Podracer active in the time frame preceding 27 BBY. In one race against the Dug Sebulba, Obitoki tried to overtake the competitor, who responded by opening a side vent on his pod and spewing fire into Obitoki's engine. Obitoki's pod exploded and crashed while expelling a cloud of debris, removing Obitoki from the race. Another racer, Habba Kee, tried to navigate the wreckage, but he collided with Obitoki's pod, knocking him out of the race as well.\nObitoki appeared in the Star Wars: Episode I The Phantom Menace novelization, written by Terry Brooks and published just before the release of the film in 1999. The character was also depicted in another tie-in entitled Star Wars Episode I Journal: Anakin Skywalker. In the novels, Obitoki and Habba Kee die in the crash described above during the Boonta Eve Classic of 32 BBY. In the same context, Obitoki and Kee are mentioned in the movie's script, but neither makes an appearance in the film itself. While the novel has racers Elan Mak, Kee, and Obitoki surpassing another driver named Anakin Skywalker during the race's second lap, the trio is replaced by Ark Roose, Gasgano, and Teemto Pagalies in the movie, none of whom crash in the way Obitoki does. Additionally, the reference book Star Wars: Episode I Incredible Cross-Sections establishes that eighteen racers qualified and competed in the Boonta Eve Classic, but Obitoki is not on the provided list. This article thereby treats the appearance in the novel as ambiguously canonical within the Star Wars Legends continuity. However, The Complete Star Wars Encyclopedia's entry on Obitoki confirms that the racer existed and crashed in the way described, but it leaves the wreck's occurrence during the Boonta and Obitoki's death ambiguous.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Alien/Legends",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Sebulba/Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Time/Legends",
  "/wiki/Habba_Kee",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Terry_Brooks",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/1999",
  "/wiki/Star_Wars_Episode_I_Journal:_Anakin_Skywalker",
  "/wiki/Death/Legends",
  "/wiki/Boonta_Eve_Classic_(32_BBY)",
  "/wiki/32_BBY/Legends",
  "/wiki/Kam_Nale",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Ark_Roose/Legends",
  "/wiki/Gasgano/Legends",
  "/wiki/Teemto_Pagalies/Legends",
  "/wiki/Star_Wars:_Episode_I_Incredible_Cross-Sections",
  "/wiki/Boonta_Eve_Classic/Legends",
  "/wiki/Canon",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(unabridged_audiobook)",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_Illustrated_Screenplay",
  "/wiki/Star_Wars_Collector_Edition_2013:_The_Prequel_Trilogy",
  "/wiki/Jedi_Quest:_The_Dangerous_Games",
  "/wiki/Hekula"
 ]
}