{
 "name": "Och%C5%8D",
 "display_name": "Ochō",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tao"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yasaburō clan",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ochō was a human female who lived on the Outer Rim planet Tao during the Imperial Era, and the daughter of a powerful crime family. Her father was Yasaburō. As a child, Ochō formed a close bond with a Lepi orphan and slave named Lop and convinced her father to adopt the Lepi girl.\nMuch of Tao's population rebelled against the Galactic Empire in response to perceived Imperial oppression. Ochō's father Yasaburō supported the rebellion, but Ochō joined the Empire.\nOchō was a human female from the resource-rich planet Tao, located in the Outer Rim Territories. She was born into a clan and crime family led by her father Yasaburō, who had the title \"Boss\".\nOne day at a market, Ochō and Yasaburō encountered a runaway Lepi slave and orphan named Lop attempting to steal fruit to eat. Yasaburō asked the Lepi where her parents were, to which Lop responded that they were gone. Lop's stomach rumbled with hunger, and Ochō enthusiastically suggested they adopt her into their family. Her father cajoled Ochō for loudly expressing sympathy for an escaped Imperial slave within earshot of Galactic Empire personnel, but Ochō appealed to Yasaburō's strong sense of morality to take the Lepi girl in. Ochō insisted she could tell Lop was a good kid and escorted her to play at the beach, at which point Yasaburō acquiesced to adopting Lop and raising her as his own daughter. Lop's droid companion TD-4 proceeded to free the Lepi from her shock collar and took a family photo of Lop, Ochō, and Yasaburō.\nSeven years after Lop joined the Yasaburō clan, an explosion at Tao's Imperial base destroyed much of the local town, leaving flames and smoke rising from the destruction. Ochō confronted her father in indignation for supporting the attack. Yasaburō denounced the Empire for its treatment of their homeworld and its environment, people, and resources, insisting locals must take action against the Empire to show they would not accept such treatment. Affiliates of the clan implored the father and daughter to stop arguing and flee before Imperial stormtroopers arrived. At that moment, Lop reached the commotion, and a clan member begged her to mediate between Ochō and Yasaburō.\nOchō scolded her father as the attack had injured people including members of their own family. Lop begged her sister and father to cease fighting, but Yasaburō insisted this was a matter for the head of the family and commanded Lop to remain silent. Ochō insisted on making herself clear as the next head of family, insisting that Yasaburō's \"stubborn\" opposition to development was \"wrong.\" She asserted that Tao needed the Empire to fuel its economic growth, to which her father retorted that Tao had long survived without assistance from the Galactic Republic. Yasaburō asked why that should change now, and why they should \"throw themselves at  feet\" while it continued military buildup on Tao. He asked how Ochō would feel if the Empire turned their world into a war zone, saying that if she wanted to lead the family, she should want to drive the Empire out. Ochō angrily insisted that the Empire was the only hope for their planet to develop and progress, whether or not a war should occur. Her father labeled the Empire's \"support\" for Tao as a euphemism for taking control. At that moment, Imperial stormtroopers neared the scene, and most of the gathered crowd fled. Yasaburō decried the fleeing people as fools, expressing belief in Tao residents' \"duty\" to protect the planet; a duty which had been passed down for generations.\nLop drove in a landspeeder with Ochō, telling her sister she ought to consider how Father felt about the Empire and their homeworld. Ochō insisted that she had a responsibility as Yasaburō's heir to turn to the Empire for the sake of their future. As the pair approached an Imperial roadblock, Ochō affirmed that she knew how to take care of their household. The young women were stopped at the roadblock, where an Imperial officer greeted Ochō, saying he had been waiting for her. The officer revealed that Ochō had agreed to negotiate on her father's behalf to prevent the insurrection on Tao from occurring, but had failed to prevent violence. Lop, distraught, asked Ochō whether she had indeed tried to stop Yasaburō without even talking to him first. Ochō confirmed that, saying she couldn't \"leave it up to\" their father anymore and that he was \"blinded\" by his idealism.\nThe officer said that, since Ochō could not keep the Yasaburō clan under control, the Empire would have to make life even more difficult for them. Ochō apologized to the officer, taking full responsibility and insisting that she would either persuade or force her father to stop the violence. He invited Ochō to accompany him and his stormtroopers for the Empire's \"redevelopment initiative\" an ally to the Empire, imploring her to help him end the bloodshed. Lop begged her sister not to go, saying it would break their father's heart. Nevertheless, Ochō bit her thumb, smeared her blood by her eyes as makeup, cut her hair, and joined the Empire. Lop held her sister's braid of hair as Ochō departed with the Imperial forces.\nOchō had a strong degree of sympathy for Lop when she met the Lepi as a runaway slave and orphan.\nSeven years later, Ochō believed the Galactic Empire was necessary to promote development on her homeworld of Tao, and opposed her father's support for the local rebellion against the Empire. Nevertheless, she loved her father and her homeworld.\nThis benevolence would vanish later, after joining the Empire. Upon seeing Lop inherit the lightsaber, Ochō would openly claim that Lop wasn't a legitimate heir, being both adopted and an alien. It's unknown if this was due to Imperial influence, or if these feelings were always buried within her. She would go as far as to attempt to kill her father and Lop, refusing to even consider merciful actions.\nHer statements about her father being \"blinded by idealism\" take an ironic turn, as Ochō herself would become blinded by her Imperialism.\nOchō was named お蝶  in the original Japanese, meaning \"butterfly.\" She appeared in \"Lop \u0026 Ochō,\" a short film in the Star Wars: Visions series written by Sayawaka and directed by Yuki Igarashi. The short, produced by Geno Studio, released on Disney+ on September 22, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Tao",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Yasabur%C5%8D_clan",
  "/wiki/Galactic_Empire",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Parent",
  "/wiki/Yasabur%C5%8D",
  "/wiki/Lepi",
  "/wiki/Slavery",
  "/wiki/Lop",
  "/wiki/Rebellion_on_Tao",
  "/wiki/Boss",
  "/wiki/Shopping_district",
  "/wiki/Thief",
  "/wiki/Fruit",
  "/wiki/TD-4",
  "/wiki/Shock_collar",
  "/wiki/Attack_on_Tao%27s_Imperial_base",
  "/wiki/Homeworld",
  "/wiki/Stormtrooper",
  "/wiki/Galactic_Republic",
  "/wiki/Imperial_Military",
  "/wiki/SLA-93",
  "/wiki/Landspeeder",
  "/wiki/Unidentified_Imperial_officer_(Tao)",
  "/wiki/Lop_%26_Och%C5%8D",
  "/wiki/Sayawaka",
  "/wiki/Yuki_Igarashi",
  "/wiki/Geno_Studio",
  "/wiki/Disney%2B",
  "/wiki/September_22",
  "/wiki/2021",
  "/wiki/Category:Images_of_Och%C5%8D",
  "/wiki/Lop_%26_Och%C5%8D_(manga)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/July_14"
 ]
}