{
 "name": "Ochi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bestoon"
     ]
    },
    {
     "name": "Born",
     "values": [
      "By 19 BBY",
      "Bestoon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Sometime between 21 ABY and 35 ABY",
      "Pasaana"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellowish"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Head implants",
      "eye gadgets"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Assassin's Guild",
      "Sith",
      "Galactic Empire",
      "Crimson Dawn",
      "Vader's crew",
      "Acolytes of the Beyond",
      "Sith Eternal",
      "Ochi's crew"
     ]
    }
   ]
  }
 ],
 "content": "Ochi, also known as Ochi of Bestoon, was a humanoid alien male assassin of the Sith Order from Bestoon spanning decades, from the fall of the Galactic Republic to the rise of the New Republic. Ochi possessed a personal knife used to commit acts of murder, and had head implants. Trained in combat and martial skills, Ochi was very capable fighter and lent his services to Dark Lord of the Sith Darth Sidious and the criminal underworld. After attracting the attention of the Jedi Master Luke Skywalker, being able to evade him time and time again, before arriving on Pasaana and becoming trapped in the Shifting Mires, soon drying.\nBorn during the Republic Era, rising to be a member of the Assassin's Guild, Ochi had been since the time of the Clone Wars been a Jedi hunter and seeker of Sith arcana. During the Imperial Era, Ochi was an associate of advisor Yupe Tashu and an assassin in service of Darth Sidious. He was also an operative of Lady Qi'ra and Crimson Dawn following the Battle of Hoth.\nHe continued to work after the demise of the Sith, becoming a devotee of both the Acolytes of the Beyond and the Sith Eternal cults. Ochi soon came to serve the reborn Darth Sidious once more, who sent him to retrieve the latter's granddaughter Rey. When the girl's parents denied him her location, the huntsman killed them, sealing her fate as the only blood-relative of the fallen Emperor. Having drunkenly bragged of being recruited by the Sith Eternal, however, Ochi was tracked by Jedi Master Luke Skywalker and his companion Lando Calrissian to Pasaana, where the assassin became stranded under its desert sands and died.\nBorn on the planet Bestoon by 19 BBY, the humanoid Ochi of Bestoon began his career as a Jedi killer during the Clone Wars—a galaxy-wide conflict between the Galactic Republic and Separatist Alliance—Ochi became a hunter of Sith relics during his infamous career, operating as a ruthless assassin and a devotee to the dark side of the Force.\nAt some point in his life, Ochi of Bestoon came into the direct service as a Sith assassin for the Dark Lord of the Sith Darth Sidious, publicly known as Sheev Palpatine. On Sidious's orders, he attempted to assassinate Depa Billaba on Malathon IX while her former master Mace Windu was away, though Windu himself was actually hunting the assassin himself and fought him off before he could fire on the Jedi General. He continued to serve Palpatine during the time of the Galactic Empire after the Clone Wars ended with the Separatists and the Jedi defeated.\nSometime between 3 ABY and 4 ABY, Ochi was tasked by Darth Sidious with hunting down his wounded Sith apprentice, Darth Vader, on Mustafar as part of Vader's Sith training to strengthen his connection to the dark side of the Force.\nOchi quickly engaged in a short duel with Vader: even though Vader could not use the Force by the Emperor's order, he managed to choke Ochi with his metallic arm. The Sith Lord asked questions about the Emperor and his power which the assassin did not answer, but he eventually set Ochi free. The Sith assassin, however, started to fight again and managed to deprive Vader of his lightsaber and trap him in a Mustafarian cave. While in the cave, Vader met the Eye of Webbish Bog, an imposing spider-like creature. Despite the assassin's initial elation at having beaten Sidious' apprentice, Vader soon escaped the cave, having been gifted with a Sith wayfinder by the Eye. To attack the Sith Lord, Ochi employed the assistance of the Droid Crush Pirates of Bestoon, to whom he had promised any valuable spare parts from Vader's cybernetics.\nVader managed to fend off the Pirates' onslaught, but not before one of the droids was able to cut off part of the Sith Lord's artificial leg. Upon examination, the droid realized that the parts that comprised Vader's suit were obsolete and useless, and turned on Ochi. The assassin was saved from the Pirates by Vader, who quickly incapacitated him and retrieved his lightsaber.\nAfter destroying the Pirates, Vader used their parts to repair an abandoned Eta-2 Actis-class light interceptor. With Ochi at his mercy, the Sith Lord ordered him to decipher the coordinates hidden in the wayfinder's glyphs. Ochi attempted to trick Vader by entering different coordinates into the starfighter, but his captor noticed the ruse and threatened him until the assassin revealed the wayfinder's true path, to the planet Exegol. Satisfied, Vader trapped Ochi within an escape pod and attached said pod to the starfighter, jumping through hyperspace to follow the route laid out by the wayfinder.\nOchi and the Sith Lord soon arrived at the Red Honeycomb Zone, where they encountered a massive, tentacled space-faring creature related to the summa-verminoth, as well as several Star Destroyers. Strafed by hundreds of TIE Fighters, Vader flew the pair into the Zone, where several of the pursuing TIEs were destroyed by the creature's tentacles. However, the pair's safe passage through the nebula was short-lived, as the psychic creature overcame both of their minds, overwhelming them with visions of their own deaths. They crash-landed on Exegol's surface, where the creature loomed over them. Despite Ochi's insistence that they should flee, Vader stood his ground and used the Force to tame the creature.\nAs Vader tamed the tentacled creature, Ochi fled downhill to the nearby Sith Citadel, where his master, Darth Sidious, was already waiting. Ochi stood witness as Vader attempted to confront his master using the creature under his control. Palpatine, however, ultimately defeated the creature with little effort, using the Force to compel the creature to squeeze itself with its own tentacles until it sliced itself apart.\nAfter the behemoth's death, Sidious laughed as he retreated into the Sith Citadel. Ochi followed Vader as he entered the Citadel to pursue his master. Inside, Ochi witnessed cloning facilities, ancient monuments and effigies of ancient Sith Lords, and legions of Sith cultists and acolytes. As Ochi followed Vader deeper into the Citadel, Ochi watched as the Sith Lord defeated both Force-sensitive and non-Force-sensitive assailants.\nAs he continued to pursue Palpatine, Ochi attempted to persuade Vader to give up his quest for vengeance against Sidious and offered to broker a deal with the Emperor if Vader would cease fighting, which Vader ignored. As they continued deeper into the Citadel, Vader and Ochi discovered one of the Emperor's greatest secrets: a massive fleet of Star Destroyers, each similar in design to but a thousand times more powerful than the Imperial I-class Star Destroyers currently in service by the Empire, and each equipped with a planet-destroying cannon.\nOchi followed Vader as he continued to be drawn further into the Citadel. Following the feeling of suffering and pain within the Citadel, Vader eventually led the pair to what appeared to be the Citadel's heart. Within a massive chamber was a dome with red-light shining from the glass panes near the top. As Vader was drawn towards the chamber, Ochi attempted to persuade Vader to come back with him to broker peace with Sidious. Vader ignored him, as Ochi followed him into the chamber, they discovered its contents: the peak of a subterranean mountain of kyber crystal. Sith cultists forced the crystal to scream and suffer, which the Sith believed imbued the crystals with more power. Pieces mined from the kyber mountain were used to power the Emperor's machinations and his fleet's planet-destroying weapons.\nAfter the kyber crystal was cut, the crystal screamed out in pain and sent out a wave of power, throwing back the Sith cultists who worked in the chamber. Ochi was knocked back as well, and in the process, his helmet was thrown off and the blazing, blood-red light from the kyber crystal burned Ochi's exposed eyes, blinding him. Within the blinding, red light, Palpatine appeared and revealed the unlimited power he harnessed through the planet's subterranean suffering kyber. Faced with such strength, Vader appeared to realize he could not compete with the Emperor's power, making him finally acquiesce to his master.\nOnce they returned to Coruscant, Ochi was implanted with a cybernetic visor so he could continue to see. When Vader asked his master his will, the Emperor told him to decide that for himself. Vader then called Ochi over and the Emperor allowed him to leave with the Sith Lord. Traveling to a remote outpost somewhere in the Outer Rim, they met with a Hutt named Bokku. Ochi asked Bokku for the whereabouts of Han Solo, to which Bokku reported that Jabba the Hutt had lost Solo and would recover him. However, Ochi then told the Hutt that he would recover Solo himself in exchange for power. When Bokku asked Ochi if he served the Emperor, Ochi replied that they both served Vader now.\nVader was then attacked by a group of Gamorrean guards, which the Sith Lord slew with ease. Bokku quickly apologized for not recognizing Vader and reiterated that he didn't know where Solo was. From this, Ochi determined that Jabba had likely hired someone to find Solo and asked Bokku for their identity. Bokku expressed fear at the idea of betraying Jabba until Ochi pried into Bokku's willingness to take over the Grand Hutt Council himself. Bokku then revealed that he had been tracking the hunters who had taken Jabba's bounty and that one crew of droids had gone in a different direction from the others. Bokku told Vader the droids were deep in the heart of Hutt Space and that it would be better to go in Bokku's barge so as not to scare them away.\nOn their way to the droids' location, Bokku inquired as to his compensation for his assistance, to which Vader assured him that he would be rewarded. He also asked Ochi if Vader could be trusted, to which Ochi replied that there was no safe haven anywhere and that the only way to survive was to find the biggest monster to stand behind. Under the piloting of Bokku's nav droid Gak-Sixtoo, they arrived at Zee-Nine City Seven while Vader and Ochi boarded their Lambda shuttle. But as they approached the city, their ship's engines were shut down, causing them to crash. After escaping the wreckage, Vader and Ochi were confronted by the Droid Crush Pirates, who expressed shock at Ochi's service to Vader. When Ochi claimed he had picked the winning side, the droid captain told him he had picked wrong as the assassin droid IG-88B revealed himself and fired upon both Ochi and Vader.\nAs Vader deflected IG-88's attacks, the droid reminded his target that he had sustained damages while IG-88 himself had not. Vader informed the droid that he had information he required and commanded him to lay down his weapons, to which IG-88 replied that Vader would only access his information by downloading it from his severed head. Vader went to attack IG-88, but the droid then took out a remote and used it to slice into Vader's armor, taking control of the Sith Lord. As IG-88 forced Vader to hold his own saber to his head, Vader demanded to know who had given the droid the code to breach his armor. IG-88 responded that the terms of his employment prevented him from sharing that information. While the droid was distracted, Vader used the Force to take the remote from him, allowing him to use it against his opponent. Vader then forced IG-88 to hold his own blaster to his head and pull the trigger, incapacitating him.\nVader then continued his fight against the pirates until Bokku's barge fired upon him. Vader blocked the blasts with his lightsaber and redirected the energy at the pirates, knocking them back along with Ochi. As the pirates retreated, Ochi ordered the droid captain to reveal Solo's location. However, the droid captain simply laughed and said he would kill Ochi next time, to which Ochi said he couldn't wait. Vader then took IG-88's hand and used it to access a terminal he had been using earlier. Upon activating the terminal, Vader and Ochi discovered various dead ends that the droid had been chasing, as well as the symbol of crime syndicate Crimson Dawn. After acquiring IG-88's information, Vader returned to Bokku's barge and confronted him over his betrayal. When Vader asked the Hutt what he had learned, Bokku conceded that the Sith could not be defeated, which Ochi noted was a good answer.\nAfterwards, Vader sent Ochi to Arkanis to gather more information on Crimson Dawn. Ochi prepared to infiltrate a local bar, but was told by Vader to simply walk through the front door. Ochi then burst into the bar, kicking over one of the patron's drinks and causing them to punch Ochi in the face. But before the patron could attack, Ochi revealed his allegiance to Vader and asked the rest of the bar attendants if they could tell him about Crimson Dawn. Retrieving an invitation sent out by the crime syndicate, Ochi returned to Bokku's lair with Vader and interrogated him about the invitation. Bokku revealed that Crimson Dawn was holding an auction for Han Solo and that Jabba would surely purchase him. However, Vader then told Bokku that he would bid against Jabba and humiliate himself. That way, Jabba would not suspect him of eventually betraying him, to which Bokku agreed. As they took off in their shuttle, Vader suddenly grabbed Ochi and dropped him out of the ship. Once Ochi landed on the ground, Vader ordered him to find out who else Bokku was working with.\nLater that night, Ochi tracked down and attacked a couple of Crimson Dawn assassins. But when Ochi went to interrogate the leader, he suddenly found himself surrounded by tens of masked assassins. After eliminating a few of them, Ochi revealed his affiliation with Vader, to which the assassins merely laughed. When Ochi boasted about both his and Vader's power, one of the assassins picked up a handful of seeds and used them to demonstrate Crimson Dawn's numbers. When the assassin offered him a chance to join them, Ochi warned them that his master was coming, only for Vader to drive the ship away and park it on a nearby mountain. When the assassin offered the ultimatum again, Ochi simply resumed firing, eventually eliminating the remaining assassins. Ochi was then approached by Vader and realized that the Sith already knew that Bokku was working with Crimson Dawn. He only wished to test Ochi's loyalty. As more assassins began to surround them, Ochi assured Vader that he would serve him as long as he remained the most powerful, to which Vader affirmed that he would always be the most powerful. With this, Ochi laughed and joined Vader in eliminating the rest of the assassins.\nAfter discovering that Sly Moore had hired IG-88, Vader and Ochi returned to Coruscant to find her, her court and the phlutdroid in Administrative Temple Garden 313A. As Vader struck down IG-88 once again, Moore and her court fled into the Imperial Palace. As they attempted to escape into the streets, Vader used the Force to close the door in front of them. However, Moore then took out another remote and used it to freeze Vader in his own armor, allowing her and her court to open fire on the Sith Lord. But this did not last as Vader overcame the Umbaran's control and struck down her entire court. Moore tried once more to take control of Vader, but Ochi revealed that Vader had fixed that vulnerability in his armor. Vader then knocked the remote out of Moore's hand and told her that she could not bend his will. Moore responded that she only wanted to see if Vader was still plagued by fear, to which Vader said that the only fear in that place was hers. Moore conceded that he could kill her effortlessly, but also pointed out that doing so would do nothing to save him from Luke Skywalker. When Vader asked the Umbaran what she knew of Skywalker, she stated that the key to finding him, his friend Han Solo was currently being sold by Crimson Dawn. She also pointed out that if she secured Solo for Vader, then the Emperor would not learn of his plans. When Ochi asked Moore why Vader should trust her, the Umbaran answered that she would be delighted to reunite Vader with the only person who could kill him, to which Vader agreed and Ochi laughed.\nShortly after, Ochi and Moore left for Jekara along with a few Imperial officers to attend the Auction for Han Solo, which was led by Crimson Dawn's leader, Lady Qi'ra. Once the bidding began within the Vermillion, Moore attempted to bid for the smuggler, but soon found herself in conflict with Jabba, Bokku and the rest of the attending Hutts. While the Umbaran was able to use the Force to weaken the minds of the other bidders, she found that the Hutts were too strong-willed for her to manipulate. After losing the bid, Moore took Ochi aside and asked why Bokku was bidding against her. Ochi explained to her that Vader had only sent her and Bokku there to humiliate her in the Emperor's eyes and Bokku in Jabba's. Suddenly, the auction was interrupted by the arrival of Vader himself. Guarded by a pair of death troopers, the Sith declared that Solo belonged to him. After fighting off Lady Qi'ra, Vader took possession of Solo and contacted Luke Skywalker, ordering him to come to him or else his friend would die. But Skywalker refused and began to flee from the planet in his X-wing starfighter. Ochi laughed and presumed that the boy feared Vader, to which Vader remarked that he would. Vader then ordered that Solo be brought aboard the Executor and his TIE Advanced be prepared.\nOnce Vader left to pursue Skywalker, Bokku confronted Ochi and told him Vader was supposed to support his bid. Though Ochi reminded him that Vader only promised he might get what he deserved. He then overheard Sly Moore contact Vader and inform him that she was not helping him. With this, Ochi attacked Moore, taking out her Droid Crush Pirate guards and accusing her of trying to kill Vader. Moore responded by meeting the assassin in combat and reminding him that she served the Emperor. As they fought, Moore explained that Vader feared Skywalker since the Emperor could claim him as his new apprentice, thus making Vader obsolete. She also claimed Vader could not kill her without betraying the Empire and that both he and Ochi had failed to destroy the Emperor's greatest weapon. Ochi was then subdued with a single stab to the chest as Moore told him to return to his true master. Just then, their fight was interrupted by the arrival of the Hutt fleet. Ochi contacted Bokku and asked him what he was doing, to which Bokku said he didn't want to spoil the surprise. Ochi then contacted Vader and informed him that the Hutts were after the Imperial shuttle transporting Solo.\nOnce Vader quelled the Hutt attack, Ochi took Moore to the Executor in stuncuffs, accusing her of conspiring to help Skywalker escape, to which Moore then reiterated that the Emperor wanted the boy alive. Vader then arrived, to which Ochi exclaimed that he never doubted him. Moore went on to explain that both Crimson Dawn and Solo had vanished. In response to her motives, Vader informed Moore that Skywalker had fled, meaning he was not who the Emperor believed he could be. But Moore retorted that he still had his freedom and would still fight. Vader then choked Moore with the Force and told her that though Skywalker had hope, it would not be enough. Vader was then contacted by Sidious, to which Vader released his grip on Moore and knelt before his master. After Vader reiterated his loyalty to the Empire, Sidious tasked Vader with rooting out the Crimson Dawn spies within the Empire. Ochi then laughed at Moore once more before departing with Vader.\nShortly after, Vader and Ochi were approached by General Hurst Romodi, who presented them with the troops they would need to destroy Crimson Dawn. Vader then ordered Ochi to meet with the Assassin's Guild and inform them that they now served him. In turn, Ochi departed for Saki and met with three other assassins on the planet. To make sure they were still on good terms, the assassins presented Ochi with a prisoner they had taken a while to secure; Qi'ra. Surprised, Ochi asked the assassins if anyone else knew about this. They then claimed that it was only them who had captured her. Therefore, they should be the only ones to be rewarded. Ochi agreed before blasting the three of them in their heads, killing them. Ochi then deactivated the cage holding Qi'ra and stood at her side, claiming to be loyal to the Dawn by saying they were a million stronger than one.\nLater, Ochi returned to the Executor to maintain his image of loyalty to the Empire. There, he encountered the bounty hunter Beilert Valance, who had just been recruited by Vader to lead the newly formed Dark Squadron against Crimson Dawn. Alongside Lieutenant Jyala Haydenn, Ochi tasked Valance and his team with killing Tarl Sokoli, a former Imperial recruited by Crimson Dawn. Afterwards, Ochi left with Vader to assist the Empire in hunting down Crimson Dawn's agents on various planets, including Vincorba and Calior. While on Vincorba, they fought alongside a group of mercenaries known as the Revengers. Ochi commented that they would serve well as expendable assets, to which Vader reminded him that he was expendable as well.\nAfter finishing on Calior, Vader, Ochi and the Revengers rendezvoused with Valance and a few other assassins on Laecor to continue their hunt. Approaching a squad of stormtroopers and a crowd of civilians, Ochi introduced their group before a stormtrooper explained that the civilians had been attacked by Crimson Dawn. The civilians chastised the stormtroopers for doing nothing to stop the attack, to which one of the stormtroopers accused them of being Jedi sympathizers. The stormtroopers then attempted to move the civilians. When they refused to comply, the stormtroopers fired on them. But Vader then jumped in to deflect the blaster bolts and cut down the stormtroopers. When Ochi expressed confusion over this, Vader revealed that the stormtroopers actually served Crimson Dawn.\nWhen Chilla Zin asked how Vader knew that, Ochi suggested he ask Vader, which Zin declined. Tanka reasoned they must be Crimson Dawn if they ignored the attack. Ochi questioned the Trandoshan's logic, but nevertheless praised their passion. As their group continued on, Ochi discovered the Dawn's symbol in one of the stormtrooper's holoprojectors, confirming Vader's deduction. When Tanka asked Ochi if he doubted the Sith, Ochi denied this and accused Tanka of doing so, which Tanka denied. Ochi then gave Valance his next assignment; to help them kill every Dawner at their secret base. But for now, the bounty hunter would scout ahead. Valance tugged on Ochi's cape and asked him what the trick was, to which Ochi claimed that everything was as it seemed. As more Dawn agents attacked Valance and the Revengers, Loriach informed Ochi of their numbers and position. When Gee-Ninety asked if it was time to attack, Ochi said no, explaining that the point was to get a lock on their home base. However, Vader then grabbed Ochi with the Force and threw him toward the Revengers, using him as bait as well. As the agents surrounded them, Ochi requested that Vader bomb the stronghold. However, Vader refused and instead mounted Gee-Ninety, balancing himself atop the droid as they rolled themself to the stronghold's front entrance.\nVader then stormed the stronghold along with Ochi, who the Sith stopped from killing all of the agents inside. When Ochi expressed more confusion, Vader explained that Crimson Dawn was just a symptom and that he would destroy the disease. He then discovered a layout of every Dawn agent within the Empire, which Ochi and Valance noted went all the way to the top. Following that, Vader and his followers returned to Coruscant. As they arrived, Ochi tasked Valance, the assassins and the Revengers with infiltrating the Zanchal Estate while he and Vader went to the Imperial Palace. When Valance questioned if they should trust the list, Ochi told him that the Assassins Guild confirmed at least half the people on the list were Crimson Dawn collaborators. After splitting up from the group, Vader and Ochi entered the Palace and struck down all of the Royal Guards and aides in the Emperor's throne room, except for Sly Moore. Unfazed by this, Sidious pointed out Vader should have kept one of them alive for questioning.\nWhen Vader asked him if they were loyal, Palpatine said they were loyal to strength, which Vader showed them. However, only one of them was Crimson Dawn, meaning that Vader's list was flawed. When Sidious questioned if his apprentice already knew that, Vader hesitated before assuring his master that he would bring him order. Vader and Ochi left for the Zanchal Estate to confront Baron Espis Zanchal for his loyalty to the Dawn. Upon arriving, Vader was thanked by a pair of hostages who the Revengers had rescued from the Baron. As he returned to his shuttle, Vader informed Ochi that the list was a plant, which Vader himself had deduced when Ochi could only confirm that half of the names on it were Crimson Dawn. Vader then told Ochi to find out what connected every other person on the list. That way, they would find out who planted it and why.\nAfterwards, Ochi confronted Sly Moore and accused her of planting the list, to which Moore said that Ochi's name would've been on it if that were the case. Just then, they were both stunned by ZED-6-7. The droid was accompanied by Sabé, who told Ochi and Moore to do as she said or else she would inform Vader of their loyalty to Crimson Dawn. As ZED-6-7 confirmed their identities, Ochi attacked Sabé, only for the droid to subdue them again. Sabé went on to explain that she was with Crimson Dawn as well and that the real names on the list were planted to clean out the syndicate. She then asked them what Vader wanted, to which Ochi said that he wanted her due to her affiliation with the Dawn. Sabé said he could inform Vader if he wanted, but she still wanted to know what drove the Sith Lord to do what he did. When Ochi and Moore clarified that Vader wanted power and order, Sabé said they would use him to bring chaos. Later, Ochi returned to the Executor and met with Modi, who was mourning his lost officers, due to them not actually bring affiliated with Crimson Dawn. Romodi then showed Ochi the names of those who were not involved.\nOchi noticed that four of them were involved in the execution of the Amidalans on Naboo. Following this, Ochi met with Vader to inform him of what he'd discovered. Though Romodi's soldiers were not of the Dawn, Ochi warned Vader that Romodi did not understand the Sith and that he would come for Vader someday. With this knowledge, Vader and his assassins prepared to go to Tranchar to capture and interrogate Lieutenant Grapa about the mission on Naboo. Before leaving for Tranchar, Ochi reminded his associates that they needed Grapa alive. When Valance reminded them that he was only there for the child Vader was threatening, Ochi warned that he would have to kill him if he suborned a mutiny. Upon arriving on Tranchar, Ochi informed the assassins of the guards' numbers before they commenced their mission. After they fought their way through many stormtroopers and sentry droids, Grapa was killed by Tanka and Vader realized that the Imperials had known they were coming. When Valance informed Vader that the droids were from Romodi's command, Vader confronted Ochi over having spoken with Romodi prior to their departure. Ochi tried to stammer out an explanation before giving up and running away while Valance fired at him.\nAfter stealing a ship, Ochi escaped from Tranchar and arrived on Naboo to meet with Sabé. But once he stepped out of his ship, it was destroyed by Vader's TIE Advanced. After landing in front of Ochi and meeting him on the ground, Vader commended him for leading him to Sabé, which Ochi went along with and claimed to have been his plan all along. Vader then confronted Sabé herself and took her Crimson Dawn badge from her, claiming that he was the Dawn.\nFollowing this, Vader took Ochi, Sabé and ZED-6-7 to the carcass of a sando aqua monster that Vader had slain. The Sith Lord then threw Ochi and Sabé out of the shuttle and watched as they were attacked by a pack of ravenous creatures. Ochi tried to assure Vader of his loyalty, but Vader cut him off and asked Sabé why she believed in the Dawn. As Sabé defended herself, she stated that she had infiltrated the Dawn for her own means. Ochi fought the creatures alongside her, claiming he had infiltrated the Dawn as well for the sake of the Empire. As the creatures swarmed them and Ochi begged for help, Vader levitated the creatures with the Force and fed them to a group of long-necked beasts as they sprouted from the ground. Ochi claimed to understand Vader's analogy, saying they needed to make their enemies destroy each other. Upon returning to the Executor, Ochi confronted Romodi and blasted his droid.\nHe then assured Romodi that he was not there to kill him, but to warn him that Vader had gone rogue. He went onto explain that Vader had joined the Dawn and that his crew most likely had as well. When Romodi asked Ochi why he was telling him this, Ochi explained that he served power and that if Romodi ended up coming out on top, he wanted to give him at least one reason to think of him kindly. Later, Ochi had Valance and the assassins travel to Oro Sankeria for their next assignment. Once they arrived, Valance contacted Ochi and asked him what job Vader had for them now. However, Ochi didn't respond and instead watched as the assassins were attacked by a squad of TIE fighters sent by Romodi. When Valance claimed that Ochi had betrayed them, Ochi assured him that they were not the target, but a distraction. Romodi's forces were then attacked by Sabé's Crimson Dawn cell as Ochi arrived in a landspeeder, claiming that, at the moment, his loyalties lied with Vader's assassins. Ensuring the assassins escaped, Ochi watched as the warring Imperial and Dawn forces were wiped out by a pulse bomb before informing the assassins that Vader had used them to get his enemies to eliminate one another.\nMuch to Ochi's dismay, Vader then left the planet with Sabé, leaving him and the rest of the assassins to their own devices. As Ochi called after Vader, Valance chuckled and told him he wasn't Vader's favorite anymore. Ochi then leapt atop a TIE fighter before climbing inside its cockpit. When Tanka asked Ochi what he was doing, Ochi told him he was getting back on the job before Sabé set them up for destruction. Ochi then followed Vader and Sabé to Gabredor III, where they were infiltrating a facility controlled by the planet's governor, who was in league with Crimson Dawn. After entering the facility on a speeder, Ochi found Vader subdued by one of the governor's weapons. Vader and his team were attacked by more droids and Crimson Dawn assassins, to which Ochi joined in the fight and guarded Vader until he had recovered. Vader then Force-choked Ochi for allowing the Governor Tauntaza to escape. When Ochi explained that he was aiding Vader, the Sith Lord asked if he thought the governor's weapon could destroy him. Sabé told him it might have, prompting Vader to release Ochi and leave with Sabé to get information on the technology. Following this, Vader seized Ochi's speeder and used it to go after Tauntaza. As Vader left, Ochi bragged about having been the one to assist Vader, though Sabé cut him off to give him his next assignment. He would assist her with evacuating the conscripts and preparing for the facility to be destroyed before Vader returned.\nOchi told Sabé to call the Gabredor III colony for a transport, to which Sabé said that Vader would have commanded their help if he required their assistance. As she talked with ZED-6-7 and a doctor named Aira about finding how Tauntaza was harvesting the energy for her weapons, Ochi said he would go find them a transport. However, Sabé ordered him to stay and help them stop the governor. As the stormtroopers threatened him, Ochi claimed he could kill them all and accused Sabé of being a rebel sympathizer. To this, ZED-6-7 reminded him that Sabé had been given the title of Lieutenant Commander, meaning that she outranked them. Ochi then begrudgingly went along with Sabé, ZED-6-7, Aira and a local colonist named Kitster Banai to destroy Tauntaza's facility, though they were soon met by an enormous storm. Ochi suggested waiting until the storm ended, but ZED-6-7 explained that the storm was artifical and that the governor was using it to drain the planet of its resources. As the rest of the group discussed going into the storm, Ochi suggested taking cover instead until Sabé silenced him. The group then rode into the storm on speeders and located the facility creating it. Ochi asked Sabé what she could do to stop the storm, to which Sabé admitted she didn't know. As Kitster was pulled off of his speeder and into the storm, Ochi told Sabé they had to escape. Sabé refused however in favor of locating Kitster. When Ochi said it was too late, Sabé was also pulled into the storm, allowing Ochi and the accompanying stormtroopers to leave.\nUpon escaping the storm, Ochi saw Vader's shuttle crash into the forest. Ochi regrouped with Vader as he stood next to the wreckage. When Vader asked him about Sabé's whereabouts, Ochi informed him of her fate and suggested calling the Executor for extraction. However, another colonist claimed that the storm would kill them all. When Vader asked the colonist if there were any ships, the colonist said Kitster's racer was the only ship that hadn't been confiscated or destroyed. To this, Vader boarded the racer and sped off into the storm, blowing Ochi away in the process. Using his binoculars, Ochi watched as the Executor opened fire and dissipated the storm. ZED-6-7 found that their comms were no longer being jammed, to which Ochi dared the droid to contact Vader and see how he was doing. Just then, Vader, Sabé and Kitster returned to the colonists. Vader then ordered Piett to fire on Tauntaza's facility. However, the blasts were deflected by a shield, which ZED-6-7 explained was drawing energy from the planet. Ochi doubted the facility had any weakness, but Vader said there was always a weakness, to which Ochi quickly agreed. When ZED-6-7 claimed the facility's underside was unshielded, Vader took Em-Sevenbee with him to the facility as Ochi ran for the forest on Sabé's orders. When Tauntaza escaped, Sabé sent Ochi to locate her. However, he was soon captured and brought to Naboo by handmaidens Dormé, Eirtaé, Saché, and Rabé Tonsort, who interrogated him for Sabé's location.\nAfterwards, Ochi rendezvoused with Qi'ra and the rest of her allies on the Vermillion. Qi'ra then informed them of Crimson Dawn's ultimate goal which was to assassinate the Emperor himself. To fulfill this mission, Ochi was given a new target by Qi'ra; the Emperor's Royal Guard. Before leaving, Ochi asked fellow assassin Deathstick what her target was, to which she told Ochi to mind his own target. Ochi then left for Coruscant in the Bestoon Legacy along with an ASN courier droid, which he would use to poison the Emperor's Guard. Upon landing on the planet, he met with a salesman named Zlarb, who supplied him with a poison known as Ziroxin-12.\nThis poison came with a precise delivery mechanism which would allow Ochi to dial in the exact time of his targets' deaths down to the second. Armed with the poison and the droid, Ochi visited the Works and used the droid to administer the poison into the guards' breakfast. Ochi used his binoculars to watch them eat the poisoned food from afar, only to realize that one of the guards, Major Erstin Deez, was not present. He then tracked down Deez to a landing platform and poisoned him via a dart that grazed his neck. With that, Ochi and the droid fled from Coruscant while the Emperor's Guard fell over dead.\nIn time, Sidious realized the Sith had an enemy arising against them, with him and Vader learning it was indeed Crimson Dawn before ordering the Empire to track down the Vermilion. Ochi was aboard the flagship when Qi'ra greeted him and her many other allies, telling them that the Sith were finally hunting them. As such, she revealed that she had ordered all of her agents in the Empire, along with her agents in other major parties, to create chaos throughout the galaxy, telling Ochi and the others that it marked the start of her hidden empire.\nAt some point, Ochi acquired the services of the droid D-O from one of his victims, a scholar whom Ochi had murdered on Primus Cabru. In the time of the New Republic, Ochi partnered with Yupe Tashu and the pair joined the self-styled Acolytes of the Beyond. After the fall of the Acolytes, Ochi spent several years searching for a wayfinder to reach Exegol in order to heal his body and restore his eyes. Frustrated by his lack of success, Ochi mistreated his droid servant D-O.\nWhile searching for the wayfinder on an Inner Rim moon around 21 BBY, he encountered several Sith Eternal acolytes led by Kiza who brought him in contact with Emperor Palpatine, who had been resurrected after his death at the hands of his former apprentice during the Battle of Endor. Palpatine tasked Ochi with capturing his granddaughter, Rey, in return for the path to Exegol. Rey was the daughter of Palpatine's Strand-Cast clone \"son\" Dathan and his wife Miramir. To aid in his mission, Kiza handed Ochi a Sith blade which drained the blood of its victims. Having been reactivated by the Emperor, Ochi became a Sith loyalist.\nTo aid in his hunt for Rey, Ochi hired a group of bounty hunters to pursue Rey and her parents Dathan and Miramir. However, these hunters were killed by the New Republic's Halo Squadron. Later, Ochi met with the mercenaries Bosvarga and Cerensco at the Boxer Point Station's Sennifer's Beam and Balance in the Janx system. There, he recruited the two mercenaries in return for past favours. New Republic veteran Lando Calrissian eavesdropped upon their conversation and learn about Ochi's connection to the Sith Eternal. Cerensco realized that Calrissian was listening to their conversation and assaulted him, triggering a bar fight. To avoid arousing further attention, Ochi and his companions quickly fled Boxer Point Station.\nConcerned about the return of the Sith and believing that Ochi could help find his missing daughter Kadara Calrissian, Calrissian alerted his Jedi friend Master Luke Skywalker and astromech droid R2-D2 about Ochi's activities. While traveling aboard Ochi's ship Bestoon Legacy, Bosvarga and Cerensco advised Ochi to enlist the help of several associates including Pysarian, Krastan, the Sphox and her crew, Repreever, Stiper, and Plo Mandrill. However, Ochi instead decide to post a bounty on Rey's family.\nD-O subsequently informed Ochi that he had received an encrypted channel code from Zargo Anaximander, the Regent-captain and administrator of Nightside space station in the Therezar system. At the advice of New Republic Flight Lieutenant Dina Dipurl, Rey's parents Dathan and Miramir had sought refuge from Anaximander. Seeking to collect Ochi's bounty on the family, Anaximander betrayed Rey's family to Ochi. After Ochi confirmed the fugitives' identities via bioscan readings, he told Anaximander to expect a visit from his associates and to prepare the \"captives\" for transfer. Anaximander agreed to Ochi's arrangement, believing this an opportunity to negotiate their \"sale\" to the Sith assassin.\nOchi dispatched his droid bounty hunter allies, the Crush Pirates, to pick up Rey and her parents on Nightside. However, the Crush Pirates disobeyed Ochi's orders and staged an attack on Nightside. The droid pirates were wiped out by Nightside's droid security forces. In addition, Calrissian arrived on the station with Skywalker to aid Rey's family. With Calrissian's help, Rey's family escaped Nightside station on Anaximander's stolen yacht Goldstone.\nWhen Ochi arrived at Nightside station, he discovered that the Crush Pirates had disobeyed his orders, antagonized Anaximander, and failed to prevent Rey's family from escaping. Anaximander was furious at Ochi, believing that he had allowed his droid forces to attack the space station. In response, Ochi castigated Anaximander for allowing the family to escape. When Anaximander demanded payment, Ochi threatened to kill the regent-captain. In an attempt to save his own life, Anaximander revealed that he had installed a tracking device aboard the Goldstone. Under the dark side's influence, Ochi killed Anaximander with his Sith dagger, which drained the regent-captain's blood.\nAfter retrieving Anaximander's data card, Ochi returns to the Bestoon Legacy where he reunited with D-O, Bosvarga, Cerensco, and their associates Krastan and Stiper. Shortly later, they were joined by the droid captain of the Crush Pirates, whom Ochi berated for attacking Nightside against his orders. When the droid captain attempted to kill Ochi, the Sith assassin and his associates destroyed the rogue droid. As retribution for letting the droid aboard his ship, Ochi murdered Striper with his Sith dagger. He then warned his remaining associates not to \"cross him\" on pain of death.\nContinuing his hunt for the fugitive family, Ochi and his associates departed Nightside. Later, Ochi was contacted by a Sith Eternal cultist who chastised him for failing to capture the family. Ochi convinced the Sith cultist to give him another chance by sending organic soldiers instead of droids. The cultist ordered Ochi to travel to the planet Basta Core to meet an agent known as \"Steadfast\", who would provide him with organic reinforcements.\nWhile Bosvarga, Cerensco, and Krastan traveled with several bounty hunters to Torrenoteer Minor in a failed attempt to capture Rey's family, Ochi and D-O traveled on Bestoon Legacy to Basta Core. There they met \"Steadfast\", who turned out to be High Colonel Enric Pryde, a member of an Imperial remnant faction that later became the First Order. Pryce had been seconded with a contingent of Corporate Sector Authority  troopers led by Viceprex Coromun, who had been sent to aid Oci's mission. Ochi requested three platoons of CSA troopers and a starship. Despite Coromun's protests, Pryde agreed to provide Ochi with the reinforcements he needed.\nAfter escaping Ochi's associates on Torrenoteer Minor, Rey's family fled to the Taw Provode Imperial facility. There, Miramir devised a plan to protect Rey by stealing Ochi's ship Bestoon Legacy and hiding Rey with junk boss Unkar Plutt on Jakku. Her plan was to return for Rey after hiding Ochi's ship. Dathan reluctantly agreed to support his wife's plan and they used Anaximander's ship to lure Ochi to Taw Provode. Ochi and his Corporate Sector allies took the bait and travelled to Taw Provode. They were followed by Calrissian and Komat, a former Acolyte of the Beyond who had been redeemed by Skywalker.\nThough Ochi and his CSA allies surrounded the Goldstone, Dathan and Miramir managed to escape by disguising themselves as Espo officers. To help Rey's family escape offworld aboard the Bestoon Legacy, Komat and Calrissian initiated a gunfight with the CSA troopers. They killed numerous CSA troopers and destroyed the Goldstome and a fuel tank before being captured by Ochi's forces.\nOchi interrogated Calrissian and Komat about the whereabouts of Rey's family. Calrissian refused to cooperate with his captor and dared the Sith assassin to stab him. Before Ochi could stab him with the Sith dagger, Skywalker arrived and killed the remaining CSA soldiers with his lightsaber. Ochi fought back with his Sith dagger, which was impervious to lightsaber strikes. Though the Jedi Master eventually gained the upper hand, Ochi managed to escape by igniting a fuel tank, which gave him the opportunity to escape on the CSA transport.\nOchi eventually located the CSA's command ship Emchen despite a communication blackout. \"Steadfast\" and Coromun were furious with Ochi for wasting CSA personnel and resources on Taw Provode and initially refused to speak with him. Ochi persisted and demanded more troops and ships to continue his hunt for Rey's family. Pryde rejected his request and threatened to destroy his ship. Pryde subsequently relented and reveals that he had installed a tracking device aboard Ochi's stolen ship. After learning that Bestoon Legacy was on Jakku, Ochi and his associates Bosvarga and Cerensco headed there. Following the meeting, Coromun offered to shoot down Ochi's transport but Pryde decided to let Ochi \"dig his own grave.\"\nOchi and his associates located the stolen Bestoon Legacy in the space orbiting Jakku. By that time, Dathan and Miramir had hired Unkar Plutt to look after Rey while they hid Ochi's ship offworld. Miramir had also acquired a set of Aki-Aki beads with the goal of misleading Plutt into believing that they had hidden Rey on the desert world of Pasaana. Ochi and his associates boarded the Bestoon Legacy and confronted the couple. When the parents refused to reveal Rey's location, Ochi stabbed Dathan to death with the Sith dagger. He then questioned a defiant Miramir before stabbing her to death as well.\nAfter discovering Miramir's Aki-Aki beads, Ochi mistaken believed that the couple had hidden Rey on Pasaana. By this stage, Ochi's thinking had been clouded by the Sith dagger and the alcohol and engine coolant that he drank to cope with it. To cover his trail, Ochi ordered Cerensco and Bosvarga to dump Dathan and Miramir's bodies into a crate with a second tracking beacon. After detaching the CSA transport from Bestoon Legacy, Ochi was driven by the Sith dagger to attack and murder Cerensco and Bosvarga. He then dumped their bodies out of the airlock. By the time Lando and R2-D2 arrived in the Jakku system in an attempt to aid Rey's family, they found the abandoned CSA transport, the crate containing Dathan and Miramir's bodies, the corpses of Ochi's associates. Unaware about Rey's true location, they mistakenly believed that Ochi had captured Rey.\nDetermined to complete his mission and claim the Emperor's reward on Exegol, Ochi traveled on the Bestoon Legacy to Pasaana's Forbidden Valley. Despite D-O's pleas, Ochi explored the surrounding area on his speeder bike. He was haunted by visions of the late Miramir and Dathan, whom he believed were taunting him. Using his Sith dagger as a guide, Ochi flew his speeder bike over the Shifting Mires. However, the vehicle's rear repulsorlift broke down, causing it to descend with its rider into the quick sand below. Ochi struggled but was sucked beneath the Sifting Mires to his death. In his final moments, Ochi realized too late that he had been outsmarted by Rey's parents.\nWith the help of the former Bespin Wing Guard commander Nikka, Calrissian discovered that Ochi's ship Bestoon Legacy was on Pasaana. Together with Skywalker and R2-D2, Calrissian searched the abandoned Bestoon Legacy. Though they found no sign of Ochi aboard the ship and the nearby Sinking Fields, Luke found documents describing a Sith wayfinder and Ochi's seemingly deactivated droid D-O. Since Skywalker was busy training his Jedi Order, Calrissian decided to remain on Pasaana to keep a look out for Ochi and search for his missing daughter.\nIn 35 ABY, Darth Sidious announced his revived intentions to dominate the galaxy, triggering the Resistance to renew their search for Exegol. On Pasaana, Rey, along with Finn, Poe Dameron, Chewbacca, C-3PO, and BB-8, found themselves in the same predicament as Ochi once did, after hoping to explore his derelict ship, only to be caught in the sands and sink underground. While in the caves, Rey found Ochi's remains, as well as his Sith dagger, which she learned was the missing key that Luke Skywalker had been searching for.\nBy this time, Ochi's bones had been picked clean by gouge-beetles. Unlike Ochi, however, Rey and the others escaped the caves, and Rey sought justice for her parents.\nAlthough he was an assassin of the Sith, Ochi of Bestoon was devoted to serving only the most powerful, hence his pledges of allegiance to Darth Sidious and Darth Vader. As such, during the Syndicate War, those around Ochi were unsure if he was loyal to the Sith and Empire or their enemies in Crimson Dawn. He remarked that he was \"playing a lot of sides.\" Despite his tendency towards serving others, he was extremely arrogant and headstrong, eager to rush into fights even when the odds were stacked against him. He was also easily amused and frequently laughed when things went his way. While he possessed great talents as a fighter and a tracker, Ochi was frequently outwitted and caught off guard, largely due to his assumption that he was better than his opponents. But even when he was defeated or overwhelmed, he continued to press on and put himself at risk for the sake of his own ego.\nAt one point, he even boasted about his knowledge of the location of the Emperor's wayfinder in a cantina. After being blinded, he became obsessed with the incident and the \"beauty\" of the kyber crystal. Ochi was also obsessed with ancient Sith arcana. While not Force-sensitive himself, the relic hunter believed that the dark side of the Force propelled him and shaped his actions, considering his murders to be in the service of the greater darkness beyond the veil. He was also unkind to his droid D-O, whom he neglected and discarded. Ochi found standard Imperial caf awful to drink.\nOchi had an inflated view of his own skills and resourcefulness as a bounty hunter. This over-confidence led him to underestimate the fugitives Dathan and Miramir, who hid their daughter Rey from him by planting false clues suggesting that she was hiding on Pasaana. Due to his embrace of the dark side, Ochi was also driven into homicidal frenzies which led him to kill other beings for real and perceived wrongs. Under the influence of a Sith dagger which drained the blood of sentient beings, Ochi was also at times driven to kill by blood lust.\nDespite his arrogance, Ochi was a very capable fighter who could face several opponents at once and even hold his own against Darth Vader for a time. He was also very skilled in melee combat which was displayed in his fight against Sly Moore. The Sith assassin was also such a skilled shot that he even killed several assassins by shooting them all in the head within just a few moments.\nTowards the end of his life and hunting career, Ochi also wielded a Sith dagger that drained the blood of living beings. Ochi was able to fight Jedi Master Luke Skywalker on one occasion with his Sith dagger, which was capable of deflecting lightsabers. When outmatched by superior opponents, Ochi would create diversions in order to escape. In addition, Ochi was also able to pilot starships.\nOchi of Bestoon possessed a personal knife used to commit acts of murder. The assassin also captained a ship named the Bestoon Legacy, which was left with D-O on Pasaana after the Sith assassin's demise there. During his missions, Ochi wore a helmet and armor to aid him in the fight. He was equipped with a blaster pistol and a spear with a spearhead on one end and an axe head on the other. Ochi also had a blaster rifle and could even wield it with the pistol simultaneously during combat. After being blinded, he was implanted with a a cybernetic visor in order to regain his sight.\nOchi of Bestoon was played by creature performer and puppeteer Liam Cook in the 2019 film Star Wars: Episode IX The Rise of Skywalker, the third installment of the Star Wars sequel trilogy. Ochi's design came from a piece of concept art made for Boolio. Although Star Wars: The Rise of Skywalker: Expanded Edition stated Ochi had bragged about having a clue to the location of the Emperor's wayfinder, saying he had the coordinates inscribed, when he came to Lando Calrissian's attention, Shadow of the Sith later retconned that he was instead talking about how the Sith had recruited him once more.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Crimson_Reign_1",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Star_Wars:_Darth_Vader:_Into_the_Fire",
  "/wiki/Star_Wars:_Darth_Vader_Vol._3_%E2%80%94_War_of_the_Bounty_Hunters",
  "/wiki/Bounty_Hunters_18",
  "/wiki/Darth_Vader_(2020)_18",
  "/wiki/Darth_Vader_(2020)_19",
  "/wiki/Darth_Vader_(2020)_20",
  "/wiki/Darth_Vader_(2020)_21",
  "/wiki/Darth_Vader_(2020)_22",
  "/wiki/Darth_Vader_(2020)_23",
  "/wiki/Darth_Vader_(2020)_24",
  "/wiki/Darth_Vader_(2020)_25",
  "/wiki/Darth_Vader_(2020)_27",
  "/wiki/Darth_Vader_(2020)_28",
  "/wiki/Crimson_Reign_2",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Talk:Ochi",
  "/wiki/Bestoon",
  "/wiki/19_BBY",
  "/wiki/21_ABY",
  "/wiki/35_ABY",
  "/wiki/Pasaana",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Eye",
  "/wiki/Assassin%27s_Guild",
  "/wiki/Sith",
  "/wiki/Galactic_Empire",
  "/wiki/Crimson_Dawn",
  "/wiki/Vader%27s_crew",
  "/wiki/Acolytes_of_the_Beyond",
  "/wiki/Sith_Eternal",
  "/wiki/Alien",
  "/wiki/Sith_assassin",
  "/wiki/Standard_decade",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Battle_of_Endor",
  "/wiki/New_Republic",
  "/wiki/Knife",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Shifting_Mires",
  "/wiki/Republic_Era",
  "/wiki/Time",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Jedi_hunter",
  "/wiki/Sith_artifact",
  "/wiki/Imperial_Era",
  "/wiki/Emperor%27s_adviser",
  "/wiki/Yupe_Tashu",
  "/wiki/Assassin",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Battle_of_Hoth",
  "/wiki/Galactic_Civil_War",
  "/wiki/Sith_cultist",
  "/wiki/Religion",
  "/wiki/Darth",
  "/wiki/Rey_Skywalker",
  "/wiki/Palpatine_family",
  "/wiki/Galactic_Emperor",
  "/wiki/Mission_to_Pasaana",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Desert",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Hunt_on_Malathon_IX",
  "/wiki/Depa_Billaba",
  "/wiki/Malathon_IX",
  "/wiki/Mace_Windu",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Sith_apprentice",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mustafar",
  "/wiki/The_Force",
  "/wiki/Limb",
  "/wiki/Sith_Lord",
  "/wiki/Eye_of_Webbish_Bog",
  "/wiki/Spider",
  "/wiki/Species",
  "/wiki/Sith_wayfinder",
  "/wiki/Droid_Crush_Pirates_of_Bestoon",
  "/wiki/Eta-2_Actis-class_light_interceptor",
  "/wiki/Exegol",
  "/wiki/Escape_pod",
  "/wiki/Hyperspace",
  "/wiki/Red_Honeycomb_Zone",
  "/wiki/Unidentified_summa-verminoth_subspecies",
  "/wiki/Summa-verminoth",
  "/wiki/Star_Destroyer",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Sith_Citadel",
  "/wiki/Cloning",
  "/wiki/Force-sensitive",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Axial_superlaser",
  "/wiki/Kyber_crystal",
  "/wiki/Coruscant",
  "/wiki/Hutt",
  "/wiki/Bokku",
  "/wiki/Han_Solo",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Gamorrean",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Nav_droid",
  "/wiki/Gak-Sixtoo",
  "/wiki/Zee-Nine_City_Seven",
  "/wiki/Unidentified_droid_pirate_captain",
  "/wiki/Assassin_droid",
  "/wiki/IG-88B",
  "/wiki/Aerial_bombardment",
  "/wiki/Arkanis",
  "/wiki/Sly_Moore",
  "/wiki/Umbaran%27s_Court",
  "/wiki/Administrative_Temple_Garden_313A",
  "/wiki/Imperial_Palace",
  "/wiki/Jekara",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Death_trooper",
  "/wiki/X-wing_starfighter",
  "/wiki/Executor",
  "/wiki/Darth_Vader%27s_TIE_Advanced",
  "/wiki/Stuncuffs",
  "/wiki/Force_choke",
  "/wiki/General",
  "/wiki/Hurst_Romodi",
  "/wiki/Saki",
  "/wiki/Bounty_hunter",
  "/wiki/Beilert_Valance",
  "/wiki/Dark_Squadron",
  "/wiki/Lieutenant",
  "/wiki/Jyala_Haydenn",
  "/wiki/Tarl_Sokoli",
  "/wiki/Vincorba",
  "/wiki/Calior",
  "/wiki/Revengers",
  "/wiki/Laecor",
  "/wiki/Chilla_Zin",
  "/wiki/Tanka",
  "/wiki/Trandoshan",
  "/wiki/Holoprojector",
  "/wiki/Loriach",
  "/wiki/Gee-Ninety",
  "/wiki/Zanchal_Estate",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Baron",
  "/wiki/Espis_Zanchal",
  "/wiki/ZED-6-7",
  "/wiki/Sab%C3%A9",
  "/wiki/Amidalans",
  "/wiki/Naboo",
  "/wiki/Tranchar",
  "/wiki/Grapa",
  "/wiki/DT-series_sentry_droid",
  "/wiki/Sando_aqua_monster",
  "/wiki/Unidentified_six-legged_horned_creature",
  "/wiki/Unidentified_long-necked_creature",
  "/wiki/Oro_Sankeria",
  "/wiki/Landspeeder",
  "/wiki/Pulse_bomb",
  "/wiki/Gabredor_III",
  "/wiki/Tauntaza",
  "/wiki/Gabredor_III_colony",
  "/wiki/Lieutenant_Commander",
  "/wiki/Kitster_Banai",
  "/wiki/Binoculars",
  "/wiki/Comm_unit",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Dorm%C3%A9",
  "/wiki/Eirta%C3%A9",
  "/wiki/Sach%C3%A9",
  "/wiki/Rab%C3%A9_Tonsort",
  "/wiki/Deathstick",
  "/wiki/ASN_courier_droid",
  "/wiki/Zlarb",
  "/wiki/Ziroxin-12",
  "/wiki/The_Works",
  "/wiki/Major",
  "/wiki/Erstin_Deez",
  "/wiki/Poison_dart",
  "/wiki/Assassination_of_the_Emperor%27s_Royal_Guard",
  "/wiki/Droid",
  "/wiki/D-O",
  "/wiki/Primus_Cabru",
  "/wiki/Wayfinder",
  "/wiki/Inner_Rim",
  "/wiki/21_BBY",
  "/wiki/Kiza",
  "/wiki/Strand-Cast",
  "/wiki/Dathan",
  "/wiki/Miramir",
  "/wiki/Blade_of_Ochi_of_Bestoon",
  "/wiki/Halo_Squadron",
  "/wiki/Bosvarga",
  "/wiki/Cerensco",
  "/wiki/Boxer_Point_Station",
  "/wiki/Sennifer%27s_Beam_and_Balance",
  "/wiki/Janx_system",
  "/wiki/Kadara_Calrissian",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Bestoon_Legacy",
  "/wiki/Krastan",
  "/wiki/The_Sphox",
  "/wiki/The_Sphox%27s_crew",
  "/wiki/Repreever",
  "/wiki/Stiper",
  "/wiki/Plo_Mandrill",
  "/wiki/Zargo_Anaximander",
  "/wiki/Nightside",
  "/wiki/Therezar_system",
  "/wiki/Flight_Lieutenant",
  "/wiki/Dina_Dipurl",
  "/wiki/Homing_beacon",
  "/wiki/Basta_Core",
  "/wiki/Enric_Pryde",
  "/wiki/Torrenoteer_Minor",
  "/wiki/High_Colonel",
  "/wiki/First_Order",
  "/wiki/Corporate_Sector_Authority",
  "/wiki/CSA_trooper",
  "/wiki/Viceprex",
  "/wiki/Coromun",
  "/wiki/Taw_Provode",
  "/wiki/Junk_boss",
  "/wiki/Unkar_Plutt",
  "/wiki/Jakku",
  "/wiki/Komat",
  "/wiki/Corporate_Sector_Authority_Security_Police",
  "/wiki/Skirmish_on_Taw_Provode",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Aki-Aki",
  "/wiki/Coolant",
  "/wiki/Forbidden_Valley",
  "/wiki/Death",
  "/wiki/Bespin_Wing_Guard",
  "/wiki/Commander",
  "/wiki/Jedi_Order",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Palpatine%27s_broadcast",
  "/wiki/Resistance",
  "/wiki/Finn",
  "/wiki/Poe_Dameron",
  "/wiki/Chewbacca",
  "/wiki/C-3PO",
  "/wiki/BB-8",
  "/wiki/Bone",
  "/wiki/Gouge-beetle",
  "/wiki/The_Archivist",
  "/wiki/Syndicate_War",
  "/wiki/Caf",
  "/wiki/Rey",
  "/wiki/Pilot",
  "/wiki/Captain",
  "/wiki/Blaster_pistol",
  "/wiki/Spear",
  "/wiki/Blaster_rifle",
  "/wiki/Liam_Cook",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Boolio",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Emperor%27s_wayfinder",
  "/wiki/Category:Images_of_Ochi",
  "/wiki/Darth_Vader_(2020)_6",
  "/wiki/Darth_Vader_(2020)_7",
  "/wiki/Darth_Vader_(2020)_8",
  "/wiki/Darth_Vader_(2020)_9",
  "/wiki/Darth_Vader_(2020)_10",
  "/wiki/Darth_Vader_(2020)_11",
  "/wiki/Darth_Vader_(2020)_12",
  "/wiki/Darth_Vader_(2020)_13",
  "/wiki/Darth_Vader_(2020)_14",
  "/wiki/Darth_Vader_(2020)_15",
  "/wiki/Darth_Vader_(2020)_16",
  "/wiki/Darth_Vader_(2020)_17",
  "/wiki/Bounty_Hunters_19",
  "/wiki/Crimson_Reign_4",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/Darth_Vader_(2020)_29",
  "/wiki/Crimson_Reign_5",
  "/wiki/Hidden_Empire_1",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Rise_of_Skywalker_(Little_Golden_Book)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Ochi",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Saga_of_Rey",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Emperor_Palpatine",
  "/wiki/Melee_and_Ranged_Weapons",
  "/wiki/General_Equipment_(I)",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Mustafar",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Template:ShadowoftheSithDate",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/War_of_the_Bounty_Hunters_2"
 ]
}