{
 "name": "Octavian_Grant",
 "display_name": "Octavian Grant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tapani Home Defense Fleet",
      "Galactic Republic",
      "Republic Navy",
      "Republic Navy",
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy",
      "Pentastar Alignment",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Octavian Grant was one of the twelve original Imperial Grand Admirals appointed by Emperor Palpatine two years before the Battle of Yavin. A Human male Tapani lord of House Mecetti, Grant saw himself as superior to those who were not members of the nobility, and held a particular dislike for droids and other species. His Humanocentric beliefs stood firm after he joined the ranks of the Galactic Empire, and he proved himself to be an expert military strategist. Due to his military talents, he was appointed as one of the twelve Grand Admirals created by Palpatine in 2 BBY, although he was one of the least popular Grand Admirals, and did not attempt to curry favor with the Imperial moffs.\nAfter leading several successful campaigns during the Galactic Civil War, Grant was left virtually alone after the Emperor's death over Endor, as he had not built up a sturdy following as the other Grand Admirals had. Grant bided his time, laying low in the Pentastar Alignment while his fellow Grand Admirals were hunted down by the New Republic. Eventually, with the other Grand Admirals all dead or hiding in secret, Grant defected to the New Republic, providing key Imperial secrets in exchange for immunity from charges of war crimes. He was relocated to the luxury of the planet Rathalay and was later tempted to come out of retirement to fight the alien Grand Admiral Thrawn, though was prevented from doing so due to continued Republic suspicion of his motives. However, Grant later aided the Republic after a revived Palpatine returned to activity in 10 ABY and reunited the disparate Imperial factions, by helping Republic forces to take down his former ally Grand Moff Ardus Kaine. Grant lived the rest of his days on Rathalay under close New Republic supervision.\nOctavian Grant was born into nobility in the Tapani sector, a wealthy sector located in the Colonies region of the galaxy. A lord of House Mecetti, Grant showed aristocratic tendencies, and was deeply contemptuous of those he felt were lesser beings compared to Humans like himself and his fellow Tapani nobles. He referred to them as the \"working class,\" and he held a particular contempt for droids and alien species, as well as politicians. He was also very contemptuous of those who flaunted the trappings of Tapani nobility that weren't nobles themselves, such as the pirate Reginald Barkbone, who sported a stolen lightfoil. Following a successful stint in the Tapani Home Defense Fleet, Grant joined the Republic Navy and proved to be a brilliant tactician late in the Clone Wars.\nTransitioning into the service of the Galactic Empire, Grant led a fleet against the Trade Federation resistance in the Outer Rim Territories in 19 BBY. Grant pursued remnants of the Trade Federation, led by Customs Vizier Marath Vooro. After a confrontation at Farstine, Grant hunted Vooro down the Five Veils Route and captured him at the Hook Nebula. Grant's exploits, along with other early victories against Separatist holdouts by well-known Imperial leaders like Terrinald Screed and Hurst Romodi, were cause for celebration in the Core Worlds, and Grant rose to a prominent position in the Empire.\nTwo years prior to the Battle of Yavin, Emperor Palpatine created a new flag rank for the Imperial Navy: the rank of Grand Admiral. Palpatine decreed that only twelve could ever hold the rank of Grand Admiral at one time; among them was Grant. The man from Tapani joined Palpatine's \"circle of twelve\" alongside notable officers such as Josef Grunger, Rufaan Tigellinus and Demetrius Zaarin. Outside the Tapani sector, Grant did not develop the kind of popular following that other Grand Admirals cultivated. Within his home sector, however, Grant generated media attention with everything he did. There were journalists whose only duty was to follow his movements, and both his professional achievements and social life were reported on in great detail.\nOf the twelve Grand Admirals, only Grant, Grunger, Tigellinus, and Peccati Syn continued to perform regular naval duties. The others were assigned special projects or missions. Grant did not participate in politics or socialize with moffs and other politicians as many other Grand Admirals did, considering it to be lowering himself; he simply carried out the duties assigned to him by the Emperor. Secretly, however, he wondered if even Palpatine was beneath him, as the Emperor was neither Tapani nor did Grant believe he was a true noble, though the Emperor was a member of the noble House Palpatine of Naboo.\nAlthough the Emperor had stated that there would only ever be twelve, Palpatine privately broke his own rule when he appointed Mitth'raw'nuruodo as the thirteenth Grand Admiral in a secret ceremony. Grant was contemptuous of any aliens rewarded by the meritocracy of the Empire, so he loathed the Chiss Grand Admiral and his achievement. Grant did not act on this and when the Galactic Civil War began, the Tapani aristocrat proved that he was talented, emerging victorious in a series of battles against the Alliance to Restore the Republic.\nThe Empire descended into chaotic infighting after the death of the Emperor and his enforcer, Darth Vader, during the Battle of Endor, four years after the initial Death Star had been destroyed. Grant was not blinded by his beliefs, recognizing full well that while he believed he deserved to rule, having been born of the upper classes, he lacked the power to effectively take over the Empire. This was largely due to the fact that he had not attempted to befriend any of the moffs, and his anti-politician feelings won him no favors either. For these reasons, he was singled out by his fellow Grand Admirals to be the first of them to perish in the bloodbath that followed the debacle at Endor.\nGrant, however, displayed patience not shown by his peers. While many of the other Grand Admirals turned warlord and began fighting with each other, Grant and his personal Star Destroyer Oriflamme found sanctuary in the Pentastar Alignment—a mini-Imperial breakaway kingdom, ruled by Grand Moff Ardus Kaine, in the Outer Rim—biding his time. He watched as the remainder of the Grand Admirals were either captured and subsequently executed by the New Republic, or were killed during battle with other Imperial factions.\nEventually, after the deaths of Grand Admirals Martio Batch and Afsheen Makati two years after the failure at Endor, Grant was the only remaining Grand Admiral known to the New Republic; Thrawn was still on his excursion in the Unknown Regions, with no knowledge of the deaths of Vader and Palpatine, and so the New Republic remained unaware that a thirteenth Grand Admiral had been named. But while this made an opportune moment for Grant to lay claim to the remnants of the Empire, the Pentastar Alignment was growing increasingly unstable, and the New Republic were baying for the blood of Grant, whom they erroneously thought was the last Grand Admiral. Grant petitioned the New Republic two years after Endor to be allowed to defect. They accepted his dual conditions of immunity from prosecution for any actions he might have taken while an Imperial officer and a peaceful retirement to the planet Rathalay in return for valuable Imperial military secrets. He would seek to come out of retirement during the Thrawn campaign, desiring to best the alien, but suspicion of his loyalties prevented the New Republic from employing his services, and no opportunity to escape their grasp ever presented itself to Grant. The New Republic kept close tabs on Grant, with several agents following his every move, among them Jan Ors.\nIn 10 ABY, Palpatine re-emerged from the Deep Core, having survived his death at Endor by inhabiting a clone body, and he united the disparate Imperial splinter factions to launch a series of military campaigns against the New Republic. Ardus Kaine joined Palpatine's cause, and Grant was enlisted by the Republic to help bring down his former ally. After convincing Kaine that he sought to return to the Alignment to fight for the Empire once more, Grant lured Kaine into venturing to the Palanhi system in his personal shuttle, where Republic E-wing escort starfighters ambushed and killed the Grand Moff.\nEven after his retirement from military service, Grant remained a celebrity in the Tapani sector. Whenever he hosted an event at his home on Rathalay, it was reported on in the society section of news programming. Ultimately, Grand Admiral Grant survived longer than his peers had ever expected, outliving every single one of them. For this, he was dubbed \"the last Grand Admiral.\"\nGrant was a Human male with black hair, gray eyes and light skin. He put great emphasis on rank and nobility throughout his life, a trait which would lead to his bias against common citizens. He felt that, because he held higher status due to his species and his noble parentage, he had a right to extra privileges that those without such status should not be allowed to gain. When others managed to get into positions as high as his own, he was deeply unhappy. He was also loath to have an alien among the ranks of the Grand Admirals, such as Thrawn, although he never attempted to defy Palpatine.\nGrant was not afraid to cut his losses, displaying what others might have seen as cowardice. He preferred to stay out of the limelight and operate from the shadows, while many of his peers took a far more direct approach. His style of operating ultimately saw him outlive all those who doubted him, although at the expense of his total freedom. An astute bargainer, Grant was able to coax generous conditions from the New Republic in addition to keeping his life while the former Rebels killed several of the other Grand Admirals. He was loyal to the Empire only to a point; he would happily compromise the Empire to further his own means. His prejudice against aliens later nearly caused him to oppose the only lifeline the Imperial remnant had to regain their former glory.\nGrant wore a Grand Admiral uniform with gold epaulets and the respective rank insignia plaque while serving in the Imperial Navy.\nGrand Admiral Grant was created by Star Wars authors Kevin J. Anderson and Daniel Wallace for The Essential Chronology in the year 2000. Wallace, along with fellow author Abel G. Peña, expanded on his backstory in the Star Wars Insider 66 article Who's Who: Imperial Grand Admirals; Peña later included brief mentions of Grant in Underworld Appendix: Swoops, Spice, and Wretched Rogues, and The Dark Forces Saga. Originally, Grant was the only Grand Admiral not given a first name, though Wallace has said that this was unintentional. Wallace has also stated that Grant is among his favorite of the Grand Admirals he has created. Grant was later provided a first name, \"Octavian,\" in the 2010 sourcebook Galaxy of Intrigue, and his House affiliation was finally specified.\nThe 2012 reference book The Essential Guide to Warfare by Jason Fry and Paul R. Urquhart provided more detail to Grant's career leading up to his promotion to Grand Admiral. The book also made a reference to a \"Moff Grant\" commanding the Emerald Banner Command in the Tapani Sector through the end of the Clone Wars, but the text does not explicitly name this as Octavian Grant, and no other source identifies Octavian Grant as a moff. Urquhart has stated that the intention was to make this Octavian Grant, but it is not certain whether this was definitively established as canonical.\nWho's Who: Imperial Grand Admirals co-author Daniel Wallace unofficially suggested in 2003 that Grant's personal Star Destroyer was named Oriflamme, and this was later canonized in the 2013 blog The Imperial Warlords: Despoilers of an Empire by Wallace and Peña.\nThe Who's Who: Imperial Grand Admirals article appearing in Insider 66 was originally slated to appear in Star Wars Gamer, though when the magazine was discontinued, it instead appeared in Insider. The original Gamer article, titled Dirty Dozen: The Imperial Grand Admirals, contained more information and was longer than the version appearing in Insider. Some of the cut content can be seen in the section below.\nGrant was viewed by many as very detached and aloof in manner, which the other Grand Admirals erroneously saw as weakness. He viewed both his enemies and allies with curiosity, rarely showing what he was truly thinking, though he never feuded with the other admirals, despite their low opinions of him. Grant also had great respect for his enemies; he thought highly of both the Old Republic and the Rebel Alliance, though he knew that the Empire was far less flawed than either of the other two factions.\nGrant preferred a traditional approach in relation to military tactics, with a particular interest in siege warfare. Grant had great respect for Imperial General Jan Dodonna, who was noted for his insights and tactics on siege warfare. When Dodonna defected to the Rebel Alliance, Grant was extremely surprised, though he had no intention of defecting alongside his role model. Grant respected the Rebels' fighting spirit, though he thought that the Empire was far more effective in war, and had little doubt it would eventually defeat its opponents. He had a high opinion of himself, as well as his peers, despite their personal dislike for the Tapani noble. Grant felt that with geniuses such as himself at the helm of the Imperial war machine, none would be able to stop them. Some time during the Galactic Civil War, Grant clashed with General Dodonna in the atmosphere of Galboron. Grant was able to outmaneuver and subsequently defeat his opposite number, though he maintained the reverence he held for Dodonna.\nGrant dutifully reported to Sate Pestage on Imperial Center after the Battle of Endor, knowing he had little chance of survival if he engaged in any conflict with his fellow Grand Admirals. He stayed with Pestage on Imperial Center for a time, though the former Grand Vizier was growing increasingly paranoid, and openly revealed his suspicions of Grant. Fearing a possible assassination attempt, Grant fled Imperial Center before Pestage could strike against him.\nAfter making accords with the New Republic, Grant was relocated to and spent many years on Rathalay, eventually befriending a reformed bandit named Kaerobani, an eccentric man who lived locally. The two grew close, with Grant spending much time in Kaerobani's lush palace. Grant was in Kaerobani's home when the Yuuzhan Vong launched their attack on Rathalay, devastating the planet. Aided by the droid 8t88, Grant came out of his early retirement to deal with a Yuuzhan Vong warrior who had attacked Rathalay.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tapani_Home_Defense_Fleet",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Pentastar_Alignment",
  "/wiki/New_Republic/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Tapani_Noble_Houses",
  "/wiki/Lord/Legends",
  "/wiki/House_Mecetti",
  "/wiki/Droid/Legends",
  "/wiki/Species/Legends",
  "/wiki/Humanocentrism",
  "/wiki/Admiral/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Death/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Rathalay",
  "/wiki/Alien/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Ardus_Kaine",
  "/wiki/Noble/Legends",
  "/wiki/Tapani_sector/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Reginald_Barkbone",
  "/wiki/Lightfoil/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Trade_Federation_resistance",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Customs_Vizier",
  "/wiki/Marath_Vooro",
  "/wiki/Battle_of_Farstine",
  "/wiki/Farstine/Legends",
  "/wiki/Five_Veils_Campaign",
  "/wiki/Five_Veils_Route",
  "/wiki/Battle_of_the_Hook_Nebula",
  "/wiki/Hook_Nebula",
  "/wiki/Separatist_holdouts/Legends",
  "/wiki/Terrinald_Screed/Legends",
  "/wiki/Hurst_Romodi/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Josef_Grunger",
  "/wiki/Rufaan_Tigellinus",
  "/wiki/Demetrius_Zaarin",
  "/wiki/Media/Legends",
  "/wiki/Journalist/Legends",
  "/wiki/Peccati_Syn",
  "/wiki/Imperial_family",
  "/wiki/Naboo/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Oriflamme",
  "/wiki/Martio_Batch",
  "/wiki/Afsheen_Makati",
  "/wiki/6_ABY/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Defection",
  "/wiki/Officer/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/Agent/Legends",
  "/wiki/Jan_Ors",
  "/wiki/Deep_Core/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Operation_Shadow_Hand",
  "/wiki/Palanhi_system",
  "/wiki/Shuttle/Legends",
  "/wiki/E-wing_escort_starfighter",
  "/wiki/Battle_of_Palanhi_(Galactic_Civil_War)",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Grand_Admiral_uniform/Legends",
  "/wiki/Epaulet/Legends",
  "/wiki/Rank_insignia_plaque/Legends",
  "/wiki/Star_Wars",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Daniel_Wallace",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/2000",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Underworld_Appendix:_Swoops,_Spice,_and_Wretched_Rogues",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/2010",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/2012",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Jason_Fry",
  "/wiki/Paul_R._Urquhart",
  "/wiki/Twentieth_Army",
  "/wiki/Canon",
  "/wiki/2003",
  "/wiki/2013",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Dirty_Dozen:_The_Imperial_Grand_Admirals",
  "/wiki/General/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Galboron",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Grand_Vizier/Legends",
  "/wiki/Kaerobani",
  "/wiki/Yuuzhan_Vong",
  "/wiki/8t88/Legends",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Wizards.com",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_67",
  "/wiki/Far_Horizons",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Jedi_Council_Forums",
  "/wiki/January_27",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/February_11",
  "/wiki/2005",
  "/wiki/January_29",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Nial_Declann",
  "/wiki/Ishin-Il-Raz",
  "/wiki/Danetta_Pitta",
  "/wiki/Miltin_Takel",
  "/wiki/Osvald_Teshik",
  "/wiki/Balanhai_Savit"
 ]
}