{
 "name": "Octavion Sorin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Octavion Sorin was an Imperial general active during the height of the Galactic Civil War. A commander of one of the Imperial Army's armored divisions, he was considered one of the finest military minds, and frequently led by example.\nGeneral Sorin was among the various Imperial military leaders trying to hunt down the Rebels after they, including their leaders, escaped the Imperial blockade. At some point, General Sorin participated in the Battle of Hoth. He had also at some point attacked a Rebel cell on Ando Prime.\nGeneral Sorin was a man who preferred to lead by example, and as such was considered to be among the finest military minds in the galaxy. In addition, owing to his status as an armored division commander, his preferred choice of warfare was vehicular assaults and an explosive arsenal, even inferring that those who don't think the former's worth it have not fought alongside AT-STs. He was also particularly vicious as a combatant, even advising that they always play their squads' strengths, and cited via example that if a squad has large blasters to use them often and with intensity.\nOctavion Sorin is a character that was introduced in Return to Hoth and one of the Villain Packs of the Fantasy Flight Games roleplaying game Star Wars: Imperial Assault. His full name is given only on the Agenda cards \"Armored Division\" and \"Explosive Shrapnel.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/General_Sorin_Villain_Pack",
  "/wiki/General/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ando_Prime/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Return_to_Hoth",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Roleplaying_game",
  "/wiki/Star_Wars:_Imperial_Assault_(Fantasy_Flight_Games)"
 ]
}