{
 "name": "Odair_Bel-Opis",
 "display_name": "Odair Bel-Opis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military",
      "Imperial territory G5-623"
     ]
    }
   ]
  }
 ],
 "content": "Odair Bel-Opis was a human male from the planet Corellia who served as the attaché to Grand Moff Lozen Tolruck during the Imperial occupation of Kashyyyk in the months following the Battle of Endor.\nOdair Bel-Opis served as Lozen Tolruck's attaché on the Grand Moff's island fortress on Kashyyyk. They ambushed Jom Barell's commando team attempting to capture a shuttle platform, and captured Barell, taking his eye.\nDuring the Wookiee insurgency, Bel-Opis counseled Tolruck to remain within his fortress, despite the Grand Moff's desire to hunt the natives. He and Tolruck confronted Sinjir Rath Velus when the double-agent arrived in the fortress in the guise of Imperial officer Jorrin Turnbull. Odair fought Sinjir hand-to-hand while Tolruck's followers watched and cheered, and bested the New Republic agent with a choke hold. However, Rath Velus was able to disrupt the Imperial control module, resulting in a prison break. Odair attempted to kill Sinjir, but was attacked by an escaped Wookiee who struck him across the head with a saw blade. Falling, Odair was straddled by the Wookiee, and screamed as the beast ripped off his arms.\nAs the personal attaché to Grand Moff Lozen Tolruck, Odair Bel-Opis was a capable and trustworthy individual. Organized and straightforward, Bel-Opis had no designs on Tolruck's position, making him ideal as a servant. He proved himself to be a brutal and merciless killer, and Tolruck considered him as necessary and simple as a club. While on Kashyyyk Bel-Opis grew dark, patchy stubble over his face, reflecting his untamed environment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_territory_G5-623",
  "/wiki/Lozen_Tolruck",
  "/wiki/Planet",
  "/wiki/Grand_Moff",
  "/wiki/Kashyyyk",
  "/wiki/Battle_of_Endor",
  "/wiki/Lozen_Tolruck%27s_island_fortress",
  "/wiki/Jom_Barell",
  "/wiki/Commando",
  "/wiki/Shuttle",
  "/wiki/Eye",
  "/wiki/Wookiee",
  "/wiki/Liberation_of_Kashyyyk",
  "/wiki/Hunting",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Agent",
  "/wiki/Imperial_officer",
  "/wiki/Jorrin_Turnbull",
  "/wiki/Hand-to-hand_combat",
  "/wiki/New_Republic",
  "/wiki/Control_module",
  "/wiki/Prison",
  "/wiki/Death",
  "/wiki/Club",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)"
 ]
}