{
 "name": "Odanni",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari\u003c"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Odanni was a female Mon Calamari and the proprietor of Fathoms, which was a resort complex in Wildwater City on the planet Dac. She was also a ruthless crime lord who dominated the underworld of Wildwater City.\nOdanni worked tirelessly to build Fathoms restaurant from a small operation into a first-rate entertainment complex. She expanded Fathoms to include three other businesses: the HyperDive Cantina, Wave Works and the Seabed Lodge.\nBehind the glittery exterior, Odanni had set up a large criminal empire that used her operations as fronts. She employed the Quarren Nollo Kanx as her chief enforcer. They typically used poison as a way to deal with those that tried to cross them. When Geffa, a Rodian spice dealer tried to change a deal at the last minute and charge an extra ten percent markup, Odanni and Kanx poisoned him through the food at her restaurant. Her criminal empire included spice dealing, black market sales, money laundering, and fencing stolen goods.\nOdanni was strong willed, opinionated, and stubborn which was unusual for a Mon Calamari woman. She was a perfectionist, especially in matters related to her business. She was a hard boss and was both unrelenting and unforgiving of mistakes. She had a superiority complex towards her customers and although she was pleasant to them when she met them personally, she would privately view most species as being inferior.\nShe had rust-colored skin and kept a calm demeanor at all times, even when angry.\nOdanni was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. She was illustrated by Joel Carroll.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fathoms",
  "/wiki/Wildwater_City",
  "/wiki/Planet/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/HyperDive_Cantina",
  "/wiki/Wave_Works",
  "/wiki/Seabed_Lodge",
  "/wiki/Quarren/Legends",
  "/wiki/Nollo_Kanx",
  "/wiki/Geffa",
  "/wiki/Rodian/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Black_market/Legends",
  "/wiki/Species/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Joel_Carroll",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}