{
 "name": "Oddy Muva",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 32 ABY and 34 ABY",
      "Spalex"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Abednedo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown mottle"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Black Squadron",
      "Black Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Oddy Muva was a male Abednedo technician and aspiring pilot who served the Resistance during its conflict with the First Order. Muva undertook training to become a pilot during this period. He fueled and prepared the starfighters for Black Squadron on the D'Qar resistance base prior to their mission to seek out Lor San Tekka. He assisted pilots Poe Dameron, Snap Wexley, Karé Kun, L'ulo L'ampar, and Jessika Pava. Before their departure, Muva expressed disappointment to Dameron that he was not accompanying them on the mission. Dameron assured him he would get the opportunity at a future date after further pilot training, due to the Resistance's need for pilots.\nIn secret, Oddy had been blackmailed into working as a spy for the First Order after Agent Terex kidnapped his wife Sowa Chuan. Oddy later accompanied Poe, C-3PO, and BB-8 on a mission to Kaddak to pick up a N1-ZX, a Resistance spy droid with purported information on Supreme Leader Snoke. This turned out to be a trap set by Terex. After being separated, Oddy infiltrated Terex's ship Carrion Spike and managed to rescue his wife and several slaves with the help of Black Squadron. However, during the escape, Oddy's ship was damaged, and he decided to sacrifice himself by crashing into the First Order Light Cruiser Enshado.\nOddy Muva was a technician and pilot who was a member of the Resistance's Black Squadron during the Cold War. He was stationed at the Resistance base on the Outer Rim world of D'Qar. He had a wife named Sowa Chuan, who had been kidnapped by the First Order Agent Terex in order to exert leverage against him. Muva was forced to do Terex's bidding. Oddy became Terex's spy and supplied him with intelligence on his Black Squadron colleagues' operations.\nAfter General Leia Organa recruited Captain Poe Dameron and Black Squadron for a secret mission to find the explorer Lor San Tekka, Dameron asked Muva if their starfighters were fueled and ready. When Muva expressed his wish that he could join them, Dameron reassured him that he would get his chance once he had received more training. Black Squadron's mission to Ovanis was complicated when Dameron discovered that somebody had planted a tracking device on his T-70 X-wing starfighter. This somebody turned out to be Muva. Despite being attacked by Terex, Black Squadron managed to escape into space.\nFollowing their return, Muva asked Jessika Pava about the new boosters he and his fellow mechanics had installed on her X-wing starfighter. Pava credited the new boosters for enhancing the speeder of her squadron's X-wings. When Muva remarked that he wished that he had been there, Pava reassured him that he would get his turn once the Resistance obtained a few more starfighters from the New Republic. Pava also told Muva that he was the best technician. When Pava invited him for drinks, Muva asked her about her new mission. Pava mentioned that they were going to a prison. The two then gave a toast to faster ships and defying death. Muva subsequently supplied this information to Terex.\nDuring Black Squadron's Ovanis and Megalox missions, Muva supplied intelligence on the squadron's movements to Terex, who used it to keep ahead of Dameron. As a result, Dameron came to distrust his own fellow pilots. Not suspecting the unassuming Abednedo, he turned to Muva as the only person at the Resistance base he could trust.\nPrior to the Mission to Kaddak, Dameron told Muva that the Resistance would give him his own starfighter. After Dameron allowed Muva to fly his T-70 X-wing, Muva expressed gratitude and vowed to keep the ship safe. After the Resistance spymaster C-3PO informed Dameron that one of the Resistance spy droids on the Outer Rim planet Kaddak had supposedly acquired information about the location of Supreme Leader Snoke, Dameron brought Muva along for the mission and allowed him to fly a freighter. Muva and Dameron were also accompanied by C-3PO and Dameron's astromech droid BB-8.\nUpon landing at Kaddak's spaceport, Muva quickly realized that the Outer Rim spaceport was a dangerous crime haven. He was startled when he witnessed a man being thrown to his death. Later, Muva along with Dameron and C-3PO visited a cantina in the Sliver's Level 45. When a nervous Muva asked what they were doing here, C-3PO explained that they were here to meet his operative, who would be here any moment. Shortly later, they encountered an MSE-6 series repair droid, which informed them that their spy droid had been captured by the Ranc Gang. When Muva asked who the Rancs were, Dameron replied that it was better to fall off the sliver than to deal with the Rancs. Muva and his companions then visited the Ranc Gang's headquarters only for Dameron to be stunned by the reception staff.\nAt the Ranc Gang headquarters, Oddy Muva and the droids are surrounded by Ranc gangsters, whose leader orders his men to seize Poe but to kill the others. Fortunately for the Resistance team, C-3PO activates his local network of spy droids who force the gangsters to stand down. After helping Poe to his feet, Oddy told Poe that the Rancs had been trying to sell their spy droid but that C-3PO's spies were looking for it. The spy droid turned out to be the BX-series droid commando N1-ZX , who complains that they took too long. However, their rescue mission was complicated by the fact that Nunzix has a self-preservation programming that caused him to refuse to disclose the data until he had been safely returned to the Resistance base.\nBefore they could return to their freighter, Muva spotted Terex's ship Carrion Spike flying through the skies of Kaddak. \"Lord\" Terex, who had taken back control of the Ranc Gang, ordered the people of Kaddak to capture Dameron. While Dameron and the droids fled back to the freighter, Muva headed to the Sliver's Level 72 where the Carrion Spike was berthed. As Terex prepared to leave in order to hunt down Dameron, Muva infiltrated the ship disguised as a technician.\nDespite his fears and doubts, Muva mustered the courage to proceed with his mission to rescue his wife. While hiding in the corridors, he caught sight of Terex and one of his henchmen Zumgi walking past. Later, Muva caught sight of Zumgi walking through the Carrion Spike's corridors alone and confronted him. Muva claimed to be a technician who had accidentally stowed but Zumgi pointed out that he had a blaster. Zumgi sliced his blaster with a vibroblade but Muva kicked him in the abdomen. Before Zumgi could hack him, Muva punched him in the chin and knocked him to the ground. Grabbing the vibroblade, Oddy demanded that Zumgi lead him to his wife.\nMeanwhile, Terex's fleet of \"Uglies\" caught up with Dameron's X-wing above an uncharted desert world. Terex had hoped that Dameron would lead them to the Resistance base so that he could destroy the Resistance once and for all. However, Dameron discovered Terex's plot and instead led him to a desert world. Dameron also realized that Oddy was the spy who had been supplying the First Order with information about Black Squadron's movements. After Dameron crashlanded his X-wing and fled into a cave with the droids, Terex led a landing party.\nBack aboard the Carrion Spine, Muva and his prisoner Zumgi entered Terex's suite, which housed his slaves. Muva embraced Chuan and told Zumgi that Terex had stolen and enslaved her. Chuan then revealed that Terex had also captured other alien slaves to use as leverage against other people. Muva vowed to exact revenge against Terex and ordered Zumgi to contact his master. However, Zumgi responded that Terex would beat those who tried to attack him and revealed that Terex had already disembarked in order to pursue Dameron and the droids. Meanwhile, Dameron and the droids harried Terex's landing force while the rest of Black Squadron including Temmin Wexley, Karé Kun, Pava, and L'ulo L'ampar emerged from hyperspace to attack Terex's criminal fleet.\nAs the Resistance and Terex's Ranc Gang fought on land and space, Muva and the slaves escaped the Carrion Spike in escape pods. Before leaving, Oddy reprogrammed the ship's battle computers to auto-target anything without a Resistance transponder and also locked Terex's crew out of the control systems. As a result, the Carrion Spike began firing on Terex's \"Uglies.\" After leaving, Muva contacted Kun and told her that he had freed Terex's slaves and asked Black Squadron to protect the pods from the Ranc fighters.\nDespite Black Squadron's efforts to protect the escape pods, one of the escape pods was shot down by an \"Ugly.\" In response, L'ulo shot down the fighter. When Chuan asked her husband whether they were going to make it, he reassured her that they were together. Despite the death of L'ulo shortly later, the tide of the battle turned in the Resistance's favor when a First Order Maxima-A class heavy cruiser and its TIE/fo space superiority fighters exited hyperspace and attacked Ranc's fleet, destroying the Carrion Spike and the \"Uglies.\" Shortly later, the battle came to an end when Dameron handed Terex over to his First Order superiors, who were displeased that Terex had embarked on an unsanctioned mission.\nAfter escaping from the Carrion Spike in an escape pod, Muva and Chuan returned to Abednedo. There they were captured by First Order troops led by Commander Malarus and Terex, now controlled with a cyborg implant.\nThey left his wife there as a trap for Black Squadron, and took Muva on a GR-75 medium transport, where Terex interrogated him. The mechanic taunted Terex as a slave. When the implant punished Terex, the agent collapsed, accidentally releasing him.\nAt the same time, Dameron and Wexley had met his wife, who sent them after him. There they were captured by the First Order and imprisoned aboard the First Order Light Cruiser Enshado. After his release, Muva freed them and hotwired the system as a distraction, allowing the two Resistance pilots to escape once they reached Spalex, where the rest of Black Squadron and the journalist and Resistance agent Suralinda Javos had been captured.\nAs Malarus ordered her TIE pilots to chase them, Muva stole a First Order TIE fighter. He engaged the other TIEs, shooting several down and allowing the other pilots to escape. As his ship took damage, he steered it towards the Enshado's hanger bay, sharing a final message with Black Squadron. With his death, he ensured the destruction of the cruiser and the escape of the Resistance pilots.\nJavos was inspired by his sacrifice, and intended to share his story as \"Oddy Muva, Resistance hero\" as part of her mission to find propaganda.\nOddy Muva was a technician in the Resistance who had aspirations of flying a starfighter. Despite his skills as a technician, Muva was despondent at not being able to fly a starfighter. Muva was overjoyed when Dameron allowed him to take a spin on his T-70 X-wing starfighter and later expressed gratitude when Dameron invited him to come on their mission to Kaddak. In secret, Muva had been blackmailed into becoming a First Order spy after the First Order Agent Terex kidnapped his wife Sowa Chuan. Oddy despised the First Order and sought to rescue his spouse.\nMuva was visibly nervous during the mission to Kaddak and regarded the planet as a danger zone. Muva was skilled at infiltration and also knew how to fight in unarmed combat. He also wielded a blaster. Muva hated Terex for kidnapping his wife and was determined to settle scores with him. Muva was also tech-savvy and used his technical skills to reprogram the Carrion Spike's battle computers to attack Terex's \"Uglies\" and to lock the ship crew out of the controls. He also knew how to operate escape pods and communications equipment.\nOddy Muva is a supporting character in the ongoing Marvel Comics Star Wars: Poe Dameron comic series, which first premiered on April 6, 2016.\nFollowing the trend of Abdenedo to be named after the Beastie Boys, the name is pronounced similarly to their song \"Body Movin'.\"\nJoin the Resistance: Escape from Vodran refers to Muva's involvement in the wedding of Snap Wexley and Karé Kun—apparently a continuity error, as Muva died in the 19th issue of Star Wars: Poe Dameron, but the wedding was not proposed and conducted until the 25th issue of the series. On Twitter, Story Group member Matt Martin addressed the conflict, saying that there was a miscommunication between creators and that he didn't know if there was two weddings or both sources retell the same wedding.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Poe_Dameron_17",
  "/wiki/Poe_Dameron_18",
  "/wiki/Poe_Dameron_19",
  "/wiki/A_Eulogy_for_Snap",
  "/wiki/Special:Upload",
  "/wiki/32_ABY",
  "/wiki/34_ABY",
  "/wiki/Spalex",
  "/wiki/Abednedo",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/First_Order",
  "/wiki/Resistance_technician",
  "/wiki/Pilot",
  "/wiki/Cold_War",
  "/wiki/Starfighter",
  "/wiki/D%27Qar",
  "/wiki/Resistance_base",
  "/wiki/Lor_San_Tekka",
  "/wiki/Poe_Dameron",
  "/wiki/Temmin_Wexley",
  "/wiki/Kar%C3%A9_Kun",
  "/wiki/L%27ulo_L%27ampar",
  "/wiki/Jessika_Pava",
  "/wiki/Spy",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/Sowa_Chuan",
  "/wiki/C-3PO",
  "/wiki/BB-8",
  "/wiki/Mission_to_Kaddak",
  "/wiki/Kaddak",
  "/wiki/N1-ZX",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Carrion_Spike",
  "/wiki/First_Order_Light_Cruiser",
  "/wiki/Enshado",
  "/wiki/Technician",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Marriage",
  "/wiki/Squadron",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Captain",
  "/wiki/Hunt_for_Lor_San_Tekka",
  "/wiki/Fuel",
  "/wiki/Mission_to_Ovanis",
  "/wiki/Ovanis",
  "/wiki/Homing_beacon",
  "/wiki/Black_One",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Realspace",
  "/wiki/X-wing_starfighter",
  "/wiki/New_Republic",
  "/wiki/Mission_to_Megalox_Beta",
  "/wiki/Megalox",
  "/wiki/Toast_(ritual)",
  "/wiki/Starship",
  "/wiki/Death",
  "/wiki/Resistance_pilot",
  "/wiki/Resistance_spy_droid_network",
  "/wiki/Freighter",
  "/wiki/Astromech_droid",
  "/wiki/Spaceport",
  "/wiki/Cantina",
  "/wiki/The_Sliver",
  "/wiki/Level_45",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/Droid",
  "/wiki/Ranc_Gang",
  "/wiki/Stun",
  "/wiki/BX-series_droid_commando",
  "/wiki/Lord",
  "/wiki/Level_72",
  "/wiki/Zumgi",
  "/wiki/Blaster",
  "/wiki/Vibroblade",
  "/wiki/Ugly",
  "/wiki/Unidentified_desert_planet",
  "/wiki/Desert",
  "/wiki/Cave",
  "/wiki/Prisoner",
  "/wiki/Slavery",
  "/wiki/Slaver",
  "/wiki/Alien",
  "/wiki/Hyperspace",
  "/wiki/Battle_over_a_desert_planet",
  "/wiki/Fleet",
  "/wiki/Escape_pod",
  "/wiki/Computer",
  "/wiki/Maxima-A_class_heavy_cruiser",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Abednedo_(planet)",
  "/wiki/Commander",
  "/wiki/Malarus",
  "/wiki/Cyborg",
  "/wiki/GR-75_medium_transport",
  "/wiki/Journalist",
  "/wiki/Suralinda_Javos",
  "/wiki/Mission_to_Spalex",
  "/wiki/First_Order_TIE_Fighter_Pilot",
  "/wiki/Hangar",
  "/wiki/Propaganda",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_Poe_Dameron",
  "/wiki/April_6",
  "/wiki/2016",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Join_the_Resistance:_Escape_from_Vodran",
  "/wiki/Snap_and_Kar%C3%A9%27s_wedding",
  "/wiki/Poe_Dameron_25",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Matt_Martin",
  "/wiki/Poe_Dameron_1",
  "/wiki/Poe_Dameron_4",
  "/wiki/Poe_Dameron_8",
  "/wiki/Poe_Dameron_9",
  "/wiki/Poe_Dameron_10",
  "/wiki/Poe_Dameron_11",
  "/wiki/Poe_Dameron_12",
  "/wiki/Poe_Dameron_13",
  "/wiki/Poe_Dameron_14",
  "/wiki/Poe_Dameron_20",
  "/wiki/Poe_Dameron_31",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_66",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_Where%27s_the_Wookiee%3F_2",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_26",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Poe_Dameron_3"
 ]
}