{
 "name": "Odra",
 "display_name": "Odra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Frost Sprite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Teal"
     ]
    }
   ]
  }
 ],
 "content": "Odra, colloquially known as the Duchess of Sleet, was an evil Frost Sprite who lived on the Forest Moon of Endor. She became mistress to the Snow King, and she froze his heart, making him selfish and mean. In 3 ABY, she convinced the Snow King to steal the season scepter, a magical staff that controlled the weather. The Snow King used the scepter to freeze the moon, and with its power, Odra plotted to take the Sunstar from the Ewoks of Bright Tree Village.\nThe Snow King's Iceheads captured the Ewok Princess Kneesaa a Jari Kintaka and took her to the Snow Palace. Odra planned to trade Kintaka in exchange for the Sunstar, but Kintaka's friends came to rescue her. The Ewoks took back the season scepter and warmed the Snow King's frozen heart, melting Odra in the process. Defeated, Odra ran off in anger, and the Snow King restored Endor to its summer season.\nOdra, the Duchess of Sleet, was a Frost Sprite who lived on the Forest Moon of Endor. She became romantically involved with the Snow King—one of four entities who controlled Endor's seasons—and lived with him in the Snow Palace.\nIn 3 ABY, during Endor's summer season, Odra froze the Snow King's heart, making him selfish and mean. Under Odra's influence, the king sent Iceheads to steal the season scepter from his brother, the Sun King. Odra and the Snow King used the magical staff to freeze the moon, sending a blanket of snow across its surface, and she cackled with delight. Odra complimented the Snow King on freezing Endor, but he began to reconsider their actions. Odra froze his heart again and instructed him to freeze the Ewoks of Bright Tree Village and take their powerful Sunstar.\nThe Leaf Queen, one of the Snow King's sisters, warned the Ewoks and told them to meet her at the Sun King's palace. As four Ewoks—Princess Kneesaa a Jari Kintaka, Latara, Teebo, and Wicket Wystri Warrick—travelled to the palace, Odra and the Snow King watched them through an oculus. Believing that the four Ewoks carried the Sunstar with them, Odra plotted to intercept the group before they could reach the Sun King. The Snow King ordered the Iceheads to capture the Ewoks and bring them to the Snow Palace.\nThe Iceheads took Kintaka prisoner but failed to capture the rest. The Snow King froze Kintaka in a block of ice, and Odra praised the king's cleverness, stating that they could trade the Ewok princess for the Sunstar. Odra imagined the possible achievements she could do with the Sunstar's power, contemplating making a necklace or destroying a planet. Her reverie was interrupted by the other three Ewoks, who had come to the Snow Palace to rescue Kintaka. The Ewoks had disguised themselves as \"ice-on-a-stick peddlers,\" and Odra vaguely recognized them. However, the Snow King noticed no deception, and he dropped the season scepter to eat one of the treats. The Ewok Teebo tried to grab the season scepter but picked up an Icehead club instead. With the Ewoks' identities revealed, Odra laughed, and the Snow King picked up the scepter.\nOdra commanded the Snow King to freeze the Ewoks, and they scattered as he fired icy energy from the scepter. The Iceheads pursued Teebo and Warrick, and Odra began to chase Latara. One of the Iceheads collided into Odra, and both fell to the floor. Soon after, Teebo took the scepter from the Snow King and wildly fired its seasonal energy. One blast struck Odra and melted her membranous headdress, revealing her bald head. Odra and the Snow King demanded that Teebo return the scepter, but Warrick ran to Teebo's aide. Warrick grabbed the scepter and fired it at the Snow King, warming the king's icy heart and melting Odra. The Frost Sprite yelled in defeat and shrank to a tiny proportion of her original size. Once her transformation was complete, she screamed defiantly and scuttled out of the Snow Palace, claiming that she would return. With Odra gone, the Snow King restored Endor to its summer season and returned the scepter to the Sun King.\nOdra was a Frost Sprite with teal skin and yellow eyes. Enthralling and evil, Odra froze the heart of the Snow King and manipulated him to steal the season scepter. During Odra's reign with the Snow King, she stated that she loved the Iceheads' manner of locomotion. When Odra was struck by the season scepter's power, she melted, shrank to a diminutive scale, and yelled in defiance. According to the Sun King, Odra was a \"real cold chick.\"\nIn the Snow Palace, Odra and the Snow King used an oculus to spy on the Ewoks. Odra had a throne to the left of the Snow King's. Under her influence, the Snow King used the season scepter to freeze Endor. Odra desired to possess the Sunstar, and she considered using it to make a necklace or destroy a planet.\nOdra wore a grey, full-length gown with long sleeves and a black trim. She wore matching black shoes and gloves. Odra also wore a pointed black headdress that was melted away by the scepter.\nOdra appeared in \"The Season Scepter,\" the thirteenth episode in the second season of the animated television series Ewoks. The episode was written by Bob Carrau, and it premiered on November 1, 1986.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Frost_Sprite",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:SnowKingOdra-Ewoks.ogg",
  "/wiki/Endor/Legends",
  "/wiki/Snow_King",
  "/wiki/Temperature/Legends",
  "/wiki/Heart/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Season_scepter",
  "/wiki/Magic",
  "/wiki/Odra_crisis",
  "/wiki/Moon/Legends",
  "/wiki/Sunstar/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Icehead",
  "/wiki/Prince/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Snow_Palace",
  "/wiki/Skirmish_at_the_Snow_Palace",
  "/wiki/Summer/Legends",
  "/wiki/File:OdraDearSnowKing-Ewoks.ogg",
  "/wiki/Duke/Legends",
  "/wiki/Water/Legends",
  "/wiki/King/Legends",
  "/wiki/Sun_King",
  "/wiki/Leaf_Queen",
  "/wiki/Sun_King%27s_palace",
  "/wiki/Latara",
  "/wiki/Teebo/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/File:OdraDefeated-Ewoks.ogg",
  "/wiki/Prisoner/Legends",
  "/wiki/Necklace/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ice-on-a-stick",
  "/wiki/Merchant/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Icehead_club",
  "/wiki/Crown/Legends",
  "/wiki/File:LeafQueenandSunKing-Ewoks.ogg",
  "/wiki/Eye/Legends",
  "/wiki/File:OdraSunstar-Ewoks.ogg",
  "/wiki/Clothing/Legends",
  "/wiki/Glove/Legends",
  "/wiki/The_Season_Scepter",
  "/wiki/Ewoks:_Season_Two",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/Bob_Carrau",
  "/wiki/November_1",
  "/wiki/1986",
  "/wiki/Category:Audio_files_of_Odra",
  "/wiki/Category:Images_of_Odra",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology"
 ]
}