{
 "name": "Oggem_Baobab",
 "display_name": "Oggem Baobab",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "15 BBY",
      "Roon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Baobab family"
     ]
    }
   ]
  }
 ],
 "content": "Oggem Baobab, known locally as \"Old Ogger,\" was a Human male member of the Baobab family. In 75 BBY, he traveled to the planet Roon, searching for Roonstones. While he did find some—six bags' worth—his freighter crashed and caused him to be marooned. He continued his quest to no avail, looking for the stones' source for the next sixty years.\nIn 15 BBY, when his end was near, he was visited by his great-nephew, Mungo Baobab, to whom he gave his tools and asked to continue the search. Mungo accepted but ultimately prioritized saving his friends over the search, per his uncle's final advice to him. Eventually, Mungo found the source, but it was destroyed in a skirmish with the Galactic Empire.\nOggem Baobab was a Human male prospector of the Baobab family, a respected clan native to the planet Manda. In 75 BBY, Baobab traveled on an expedition to the planet Roon in an obsessive search for the source of valuable Roonstones. While he did find the stones on Roon, he crashed his agricultural freighter and was marooned in an area known as the Bantha Graveyard. He was thought to have vanished. While stuck on Roon, he was able to fill six bags with Roonstones, but he never found their original source, despite coming close.\nSixty years later in 15 BBY, Baobab was still stuck in his freighter, and death was imminent for him. By then, some believed the freighter to be haunted. Oggem's great-nephew, Mungo Baobab, had also taken up the search for Roonstones and traveled to Oggem's starship, where he met the old man. Oggem greeted his nephew along with his companions, one of whom was Auren Yomm, an inhabitant of Roon. Yomm recognized him as \"Old Ogger,\" whom Mungo's companions only knew as a local hermit. Mungo tried to ask his uncle about the Roonstones, but Oggem required him to come close to him due to his poor eyesight. Once he did, Oggem noticed that he wore the uniform of the Baobab Merchant Fleet. Mungo then introduced himself, surprised that Oggem had recognized the fleet's colors.\nOggem gave his name, which Mungo recognized, remembering that his great-uncle had gone on an expedition for Roonstones sixty years prior. Oggem told his story of the ship crashing and the Roonstones which he had found, happy to finally be able to share his dream with someone else. Knowing that his death would come soon, he gave his equipment and six bags of Roonstones to Mungo, asking him to finish his life's work of finding the stones' source. He then uttered one final message, reminding Mungo to never prioritize treasure over friends and family, a lesson that he himself had learned. He then died of his old age, with his nephew inviting him to rest well.\nMungo, Yomm, and their two droids, R2-D2 and C-3PO, then left the ship and went outside to examine what Oggem had left for Mungo. Inside Oggem's pouch, they found a memling, a stretchy material used for many purposes; a seed launcher, a type of blaster; and a small pyramid that Mungo theorized to be a clue to the Roonstone source. He wished to follow the clue in order to follow his uncle's final wish and, although Yomm asked him to reconsider, he did not listen.\nLater that day, after Mungo was led to the Roon Sea by the clues to the Roonstones, his boat was caught in a whirlpool. In order to save him and his friends, he was forced to dump the six bags of Roonstones, following his uncle's final advice to place his friends first. The advice continued to influence Mungo further on when he noticed that he valued saving Yomm from the Imperial Governor Bisad Koong over the Roonstone quest. Even after all the Roonstones were destroyed in a fight against the Empire, Mungo was happy, as he had met Yomm in the process.\nOggem Baobab was obsessed with his Roonstone search, continuing it for sixty years. His final advice to his great-nephew was to always place high importance on friendship, valuing it over treasure. He had white hair, light skin, and brown eyes that had trouble seeing.\nOggem utilized a freighter and continued to live in it after it crashed. He owned a seed launcher and memling, both of which he gave to Mungo so that he could continue the search for the Roonstones.\nOggem Baobab first appeared in \"Across the Roon Sea,\" the twelfth episode of the animated series Star Wars: Droids, which aired on November 23, 1985. \"Saturday Morning 'Star Wars'\"—a magazine article published in Starlog's third yearbook volume in 1988—mistakenly spells Baobab's name as \"Oggam.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/15_BBY/Legends",
  "/wiki/Roon/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Baobab_family",
  "/wiki/75_BBY",
  "/wiki/Planet/Legends",
  "/wiki/Roonstone",
  "/wiki/Agricultural_freighter",
  "/wiki/Standard_year/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mungo_Baobab",
  "/wiki/Mission_to_Tawntoom",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Prospector/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Manda/Legends",
  "/wiki/Bantha_Graveyard",
  "/wiki/Freighter/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Auren_Yomm_Baobab",
  "/wiki/Hermit/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Baobab_Merchant_Fleet",
  "/wiki/Fleet/Legends",
  "/wiki/Droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Memling",
  "/wiki/Seed_launcher",
  "/wiki/Blaster/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Roon_Sea",
  "/wiki/Boat/Legends",
  "/wiki/Skirmish_on_the_Roon_Sea",
  "/wiki/Governor/Legends",
  "/wiki/Bisad_Koong",
  "/wiki/Hair/Legends",
  "/wiki/Seed/Legends",
  "/wiki/Across_the_Roon_Sea",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/November_23",
  "/wiki/1985",
  "/wiki/Saturday_Morning_%22Star_Wars%22",
  "/wiki/Starlog_(magazine)",
  "/wiki/1988",
  "/wiki/Category:Images_of_Oggem_Baobab",
  "/wiki/The_Frozen_Citadel",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/The_Droids_Re-Animated",
  "/wiki/Polyhedron",
  "/wiki/Star_Wars_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/Polyhedron_170",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27"
 ]
}