{
 "name": "Oje N'deeb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Oje N'deeb was a Neimoidian male affiliated with the Trade Federation, a Neimoidian-controlled megacorporation. After the onset of the Clone Wars between the Confederacy of Independent Systems and the Galactic Republic in 22 BBY, N'deeb led a faction within the Federation which wished to wrest control of the corporation from Viceroy Nute Gunray and his allies, feeling that their actions, including the Invasion of Naboo a decade prior, had sullied the Trade Federation's reputation. To that end, N'deeb made covert overtures through companies he controlled to arrange for a secret meeting with a loyalist Senator from the Galactic Senate. However, after Padmé Amidala of Naboo conveyed N'deeb's plans to her allies in the Senate, Dark Lord of the Sith Darth Sidious, publicly Supreme Chancellor Sheev Palpatine of the Republic, who had started the Clone Wars for his own ends, became aware of the existence of N'deeb's faction and plotted to destroy them.\nOje N'deeb was introduced in the 2022 young-adult novel Queen's Hope, written by E. K. Johnston. Continuing in the tradition started by George Lucas of naming Neimoidian characters after American politicians, Johnston based N'deeb's name after US president Joe Biden, explaining that both individuals were \"not the worst.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Trade_Federation",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Galactic_Republic",
  "/wiki/22_BBY",
  "/wiki/Viceroy",
  "/wiki/Nute_Gunray",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Standard_decade",
  "/wiki/Siege_on_Hebekrr_Minor",
  "/wiki/Senator",
  "/wiki/Galactic_Senate",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Supreme_Chancellor",
  "/wiki/Galactic_Empire",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Oje_N%27deeb",
  "/wiki/2022",
  "/wiki/Queen%27s_Hope",
  "/wiki/E._K._Johnston",
  "/wiki/George_Lucas",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}