{
 "name": "Oksan",
 "display_name": "Oksan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zygerrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ana Tolla's crew"
     ]
    }
   ]
  }
 ],
 "content": "Oksan was a Zygerrian male member of the smuggler Ana Tolla's crew. Around 34 ABY, the crew was caught attempting to destroy Kat Saka's farm on the Outer Rim planet Batuu using sodilium detonators. Pinned down, Tolla threatened to detonate the explosives that Oksan had helped her place, but Oksan prevented her from doing so, not willing to lose his own life. Later, Oksan did not resist when seized by the thugs of the Oga Garra, the local crime boss of Batuu.\nThe Zygerrian Oksan was a member of the smuggler Ana Tolla's crew. Around 34 ABY, he traveled with the crew to a cantina on the Outer Rim Territories planet Actlyon after a mission. The crew enjoyed orders of refreshments at the cantina but soon rushed to escape, as bounty hunters raided it. Oksan then followed his colleagues back to Tolla's ship, leaving their former associate Izal Garsea behind per their leader's orders.\nAfter leaving Actlyon, Tolla's crew headed to the Outer Rim planet Batuu for its next operation. Oksan assisted in the abduction of the farmer Julen Rakab from the ancient ruins at the edge of Black Spire Outpost with the intention of using him to help destroy Kat Saka's farm. Garsea, a friend who Rakab had been keeping company with following her abandonment by Tolla's crew, was also apprehended as insurance that he would comply. Oksan and his colleague Damar Olin were concerned when the pilot Delta Jeet failed to deliver Garsea to the crew, but Tolla reassured them that their mission would continue as planned. Oksan and Tolla then prepared sodilium detonator bombs to destroy the farm's Surabat grain crops, placing them in the fields and attaching them to a water tower.\nThe pair made it halfway up the tower before Garsea and Creature Stall worker Volt Vescuso arrived at the farm to prevent Oksan and Tolla from continuing. Garsea's loralora bird, Lucky, attacked the Zygerrian until he fell three meters to the ground. Oksan then traded blaster fire with Vescuso and limped to join Tolla at the tower's base. Seeing no way out, Tolla threatened to detonate the bombs she and Oksan had placed, knowing Garsea and Vescuso did not want the farm to be destroyed. However, detonating them would kill her and others still in the blast radius, which prompted Oksan to wrest the detonator from her because he was not willing to lose his life. Oksan did not resist when he and Tolla were taken away by the thugs of Oga Garra, the local crime boss of Batuu.\nOksan had a quiet and surly personality, and his demeanor reminded the smuggler Izal Garsea of her mother. He acted hostile toward the farmer Julen Rakab and was willing to apprehend him as part of the operation, but seemed displeased with the notion that he was blindly following Ana Tolla's orders. Oksan was agreeable to destroying Kat Saka's farm with Tolla's original plan, but he was not willing to complete the mission at the cost of his own life. The Zygerrian did not resist when arrested by Oga Garra's thugs.\nOksan had yellow eyes, gray fur, and a face with feline features. His physique was robust and broad muscled, and he was considered the brawn of his crew.\nWhile in a cantina on Actylon, Oksan wore a piece of outerwear. During the operation on Batuu, he possessed a blaster and had access to sodilium detonators.\nOksan appeared in A Crash of Fate, a 2019 young-adult novel written by Zoraida Córdova.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Zygerrian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Ana_Tolla%27s_crew",
  "/wiki/File:OksanTolla.ogg",
  "/wiki/Smuggler",
  "/wiki/Ana_Tolla",
  "/wiki/34_ABY",
  "/wiki/Skirmish_at_Kat_Saka%27s_farm",
  "/wiki/Kat_Saka",
  "/wiki/Saka_Homestead",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Sodilium_detonator",
  "/wiki/Death",
  "/wiki/Oga_Garra",
  "/wiki/Crime_lord",
  "/wiki/File:OksanOlin.ogg",
  "/wiki/Unidentified_cantina_(Actlyon)",
  "/wiki/Actlyon",
  "/wiki/Cantina",
  "/wiki/Bounty_hunter",
  "/wiki/Ana_Tolla%27s_ship",
  "/wiki/Izal_Garsea",
  "/wiki/Farmer",
  "/wiki/Julen_Rakab",
  "/wiki/Black_Spire_Ruins",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Damar_Olin",
  "/wiki/Pilot",
  "/wiki/Delta_Jeet",
  "/wiki/Bomb",
  "/wiki/Farm",
  "/wiki/Surabat_grain",
  "/wiki/Water_tower",
  "/wiki/Creature_Stall",
  "/wiki/Volt_Vescuso",
  "/wiki/Loralora_bird",
  "/wiki/Lucky_(loralora_bird)",
  "/wiki/Meter",
  "/wiki/Blaster",
  "/wiki/Detonator",
  "/wiki/Ixel_Garsea",
  "/wiki/Hair",
  "/wiki/Feline",
  "/wiki/Clothing",
  "/wiki/A_Crash_of_Fate",
  "/wiki/2019",
  "/wiki/Zoraida_C%C3%B3rdova",
  "/wiki/Category:Audio_files_of_Oksan",
  "/wiki/A_Crash_of_Fate_(audiobook)",
  "/wiki/Standard_month",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)"
 ]
}