{
 "name": "Okuvim",
 "display_name": "Okuvim",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Okuvim the Younger, colloquially known as Okuvim, was a Twi'lek female who served as a scout in the Alliance to Restore the Republic during its war against the Galactic Empire. Around 4 ABY, while on a mission to the planet Mataou, Okuvim was captured by a group of ro hypa trainers and venom dealers, and she lost contact with the Rebel Alliance. Concerned with Okuvim's disappearance, rebel agent Tam Bastion hired a young smuggler to find her. The smuggler traveled to Mataou and rescued Okuvim from the criminals. Sometime later, Okuvim recruited the smuggler to run errands on behalf of the Rebel Alliance.\nOkuvim was a scout for the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. At some point, she scouted the planet Anoat. Following the Battle of Endor in 4 ABY, which saw the death of Galactic Emperor Sheev Palpatine, Imperial Governor Ubrik Adelhard of the Anoat sector established the Iron Blockade to prevent word of the Emperor's death from reaching the sector's populace. During this time, Okuvim and two other rebels were scouting the Anoat sector planet Mataou, having been sent there by rebel agent Tam Bastion.\nWhile on Mataou, Okuvim's companions were killed by a group of ro hypa trainers and venom dealers. She survived the encounter, but she was captured and brought to the abandoned Gnuda Kajidic ancestral estate. When Okuvim's communications with the Rebel Alliance ceased, Bastion hired a young smuggler to find her. The smuggler traveled to Mataou and made contact with the missing rebel. The smuggler defeated the criminal group and their ro hypas, saving Okuvim. The rebel enthusiastically greeted her rescuer, saying that she would buy them drinks.\nAfter the rescue, the smuggler set out on a mission to Anoat, and Okuvim, having scouted there before, helped the smuggler locate a hidden base of dissidents. Okuvim also offered work to the smuggler on behalf of the Rebel Alliance.\nWhen the rebels needed someone to investigate an old housing district on Anoat, Okuvim recruited the smuggler, offering to reward their efforts with guerrilla gear. On another occasion, Bastion and the rebels on Anoat needed to eliminate scavengers from their supply caches, so Okuvim hired the smuggler and payed them with credits.\nOkuvim, often referred to as Okuvim the Younger, was a young Twi'lek female with yellow skin, brown-striped lekku, and brown eyes. When Okuvim went missing, Bastion had faith in her survival abilities, and he described the Twi'lek as \"tough.\" After being rescued on Mataou, Okuvim stated that she liked the smuggler's enthusiasm, and the smuggler later described the Twi'lek as being enthusiastic herself.\nAs a rebel scout, Okuvim wore tan pants, a brown vest, a shirt emblazoned with blue starbirds on each sleeve, black gloves, and dark headgear. She was also equipped with a bandolier and a holster, and she could wield a blaster pistol.\nOkuvim was created as a non-playable character for the 2015 mobile game Star Wars: Uprising, which was written by Alexander Freed and Lori Hyrup. The character was introduced in the Chapter 1 Story Mission titled \"Finding Okuvim,\" and she later appeared as a Daily Opportunities character, offering optional challenges that players could accept.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/File:Okuvim.ogg",
  "/wiki/Scout",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/4_ABY",
  "/wiki/Planet",
  "/wiki/Mataou",
  "/wiki/Ro_hypa",
  "/wiki/Beastmaster",
  "/wiki/Poison",
  "/wiki/Merchant",
  "/wiki/Agent",
  "/wiki/Tam_Bastion",
  "/wiki/The_Smuggler",
  "/wiki/Smuggler",
  "/wiki/Gender/Legends",
  "/wiki/Anoat",
  "/wiki/Battle_of_Endor",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Anoat_sector",
  "/wiki/Iron_Blockade",
  "/wiki/Sector",
  "/wiki/Time",
  "/wiki/Prisoner",
  "/wiki/Gnuda_Kajidic_ancestral_estate",
  "/wiki/Alcohol",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Armor",
  "/wiki/Scavenger",
  "/wiki/Credit",
  "/wiki/Lekku",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Starbird_(symbol)",
  "/wiki/Glove",
  "/wiki/Bandolier",
  "/wiki/Holster",
  "/wiki/Blaster_pistol",
  "/wiki/2015",
  "/wiki/Video_game",
  "/wiki/Alexander_Freed",
  "/wiki/Lori_Hyrup",
  "/wiki/Category:Images_of_Okuvim",
  "/wiki/The_Art_of_Star_Wars:_Uprising",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}