{
 "name": "Ol' Cronchy",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zeldrate"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nova Blades"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Yarvok"
     ]
    }
   ]
  }
 ],
 "content": "Ol' Cronchy was a Zeldrate owned by Yarvok, a lieutenant of the Nova Blades pirates. Yarvok was very fond of Ol' Cronchy, calling the pet his \"beloved.\" Yarvok felt similar about his other Zeldrate, Spike. Krupo, Yarvok's beast wrangler, lost Ol' Cronchy along with many of Yarvok's other pets after his ship carrying the pets unexpectedly crashed on the planet Dantooine, angering and worrying Yarvok. Yarvok said he would kill Krupo if his missing pets, including Ol' Cronchy, were not returned with haste, as Yarvok believed the pets to be terrified out alone on the \"grass ball\" of Dantooine alone without him.\nWhen the Commander landed on Dantooine to investigate reports of Darth Malgus at the Jedi Enclave, Ol' Cronchy could be seen with several of Yarvok's other lost pets, Fuzzy and Yug, around the Enclave's approach. Ol' Cronchy had a preference for the crash-landed shipments of frozen meats scattered near its surroundings.\nOl' Cronchy appeared in the flashpoint Secrets of the Enclave and was mentioned in the Codex entry for Invasive Species on Dantooine in the 2019 expansion Onslaught to the 2011 massively multiplayer online role-playing game Star Wars: The Old Republic by the company BioWare.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Zeldrate",
  "/wiki/Nova_Blades",
  "/wiki/Yarvok",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Lieutenant/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Spike_(pet)",
  "/wiki/Krupo",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Death/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Darth_Malgus",
  "/wiki/Jedi_Enclave",
  "/wiki/Fuzzy_(Xuvva)",
  "/wiki/Yug",
  "/wiki/2019",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare"
 ]
}