{
 "name": "Olana_Chion",
 "display_name": "Olana Chion",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Olana Chion was a human Jedi Knight who served the Jedi Order and Galactic Republic during the Clone Wars. Promoted to the rank of Knight early in the war alongside Anakin Skywalker and several others, Chion served until near the end of the conflict. In 19 BBY, shortly before the war ended, Chion attended a briefing in the Jedi Temple, leaving as Skywalker arrived.\nOlana Chion, a member of the Jedi Order, was promoted to the rank of Jedi Knight in 22 BBY at a mass knighting ceremony held in the Jedi Temple's training courtyard weeks after the beginning of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. All of the new Knights, who besides Chion included Anakin Skywalker, D'urban Wen-Hurd, Keer Stenwyt, Cyruss Okent, and several others, had had their advancement to the rank rushed due to the needs of the war.\nThe end of the ceremony was interrupted by news from Republic Supreme Chancellor Sheev Palpatine of an attack on the neutral planet Cato Neimoidia, and the new Jedi Knights were invited to stay alongside the older Knights and Jedi Masters for a discussion of the situation. The next day, most of the new Knights, including Chion, attended a reception in Palpatine's office in their honor.\nIn 19 BBY, near the end of the Clone Wars, Chion attended a briefing in the Jedi Temple led by Master Obi-Wan Kenobi regarding the status of the ongoing Outer Rim Sieges on worlds such as Boz Pity and Saleucami. Chion departed the briefing room at the same time as Skywalker entered it, with the two Jedi Knights passing each other in the corridor. The war was brought to an end just days later.\nOlana Chion was a human with brown hair and light skin.\nChion wore brown Jedi robes.\nOlana Chion first canonically appeared in the 2005 prequel trilogy film, Star Wars: Episode III Revenge of the Sith, as a Jedi extra played by Dominique Chionchio. Chion was first canonically identified in the 2022 novel Brotherhood, written by Mike Chen. In the Star Wars Legends continuity, O-Lana first appeared in The Fight for Truth, the ninth novel in the Jedi Apprentice junior novel series, written by Jude Watson and published in 2000. She was first identified as Olana Chion and retconned as the extra from the film in a \"What's The Story?\" entry primarily written by Ian Tapley, who derived Chion's surname from that of Chionchio. Submitted as part of the fourth round of the contest, the entry on Chion was published on StarWars.com's Hyperspace feature on February 3, 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Olana_Chion",
  "/wiki/Olana_Chion/Legends",
  "/wiki/Human",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Knight",
  "/wiki/Clone_Wars",
  "/wiki/Anakin_Skywalker%27s_knighting_ceremony",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Imperial_Palace",
  "/wiki/Knighting_ceremony",
  "/wiki/22_BBY",
  "/wiki/Jedi_Temple_training_ground",
  "/wiki/Standard_week",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/D%27urban_Wen-Hurd",
  "/wiki/Keer_Stenwyt",
  "/wiki/Cyruss_Okent",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Cadesura_disaster",
  "/wiki/Planet",
  "/wiki/Cato_Neimoidia",
  "/wiki/Jedi",
  "/wiki/Jedi_Master",
  "/wiki/Standard_day",
  "/wiki/Emperor%27s_office",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Boz_Pity",
  "/wiki/Saleucami",
  "/wiki/Time",
  "/wiki/Hair",
  "/wiki/Jedi_robes",
  "/wiki/2005",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Dominique_Chionchio",
  "/wiki/2022",
  "/wiki/Brotherhood",
  "/wiki/Mike_Chen_(author)",
  "/wiki/Star_Wars_Legends",
  "/wiki/Jedi_Apprentice:_The_Fight_for_Truth",
  "/wiki/Jedi_Apprentice",
  "/wiki/Jude_Watson",
  "/wiki/2000",
  "/wiki/Gender/Legends",
  "/wiki/Retcon",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Ian_Tapley",
  "/wiki/Tuckerization",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/February_3",
  "/wiki/2006",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Category:Images_of_Olana_Chion",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Databank_(original)"
 ]
}