{
 "name": "Olaris Rhea",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "43.5 ABY ; Sinkhole Station",
      "the Maw"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "\"Tall\""
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pale blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Vestara Khai"
     ]
    }
   ]
  }
 ],
 "content": "Olaris Rhea was a female Human Sith Lady in the Lost Tribe of Sith from the remote planet of Kesh. In 41 ABY, Rhea was appointed to be the Master of Sith Tyro Vestara Khai after Khai had encountered a Sith Meditation Sphere named Ship. Rhea and her new apprentice served in the Tribe's armada aboard the captured warship Eternal Crusader. After the members of the Tribe sensed Jedi Grand Master Luke Skywalker's presence in the Force two years later, Rhea and Grand Lord Darish Vol handpicked a strike team to bring down Skywalker and recover Ship, who had abruptly left Kesh. Using Khai's unique connection to Ship, the strike team, led by Rhea, tracked the Meditation Sphere to a planet in the Maw, where they encountered Abeloth, a female being who was able to control the world's deadly flora. She agreed to help keep the Sith safe while they searched for Ship. Meanwhile, the strike team's executive officer, Yuvar Xal, was plotting to overthrow Rhea and take command of the team for himself. Before he could execute his coup, the Meditation Sphere finally returned to the Sith.\nAbeloth discovered Skywalker's location—along with his son, Ben Skywalker—to be Sinkhole Station, a small space station in the Maw, and Ship transported the surviving Sith there. Rhea led the strike team's ambush of the Skywalkers, and Xal initiated his coup during the battle. Due to Rhea's foresight, however, his betrayal failed, and he was killed by Khai, who was then captured by the Skywalkers. Khai escaped later during the battle; and as Ben prepared the Skywalkers' starship, the Jade Shadow, for flight, Rhea met up with Khai and the two remaining Sith. The other two were quickly dispatched by Luke, leaving only Rhea and her apprentice to duel him. The three fought on the turbolift that led to the hangar. As the lift's door opened, Rhea and Khai saw Ben in the Jade Shadow opening fire on Ship. Luke took advantage of their distraction and quickly killed Rhea, while Khai fled.\nOlaris Rhea was a female Force-sensitive Human born on the remote Wild Space world of Kesh. She was trained in the ways of the dark side of the Force with the Lost Tribe of Sith—descendants of a group of Sith whose starship, the Omen, crash-landed on Kesh in 5000 BBY while attempting to deliver a shipment of Lignan crystals to Dark Lord of the Sith Naga Sadow during the Great Hyperspace War. Rhea completed her training and became a respected member of the Tribe. By 41 ABY, she had achieved the rank of Lady on the Circle of Lords, the Tribe's ruling council. As a Lady, she served on the council in the Circle Chambers in the capitol building of the planet's capital city, Tahv.\nIn 41 ABY, Ship, a Sith Meditation Sphere, arrived on Kesh after refusing to join the One Sith, a faction of Sith who followed the Rule of One. After landing in the Temple courtyard in the Takara Mountains, it spoke through the Force with a Sith Tyro named Vestara Khai. The Circle of Lords decided that since Ship's expressed purpose was to train Sith apprentices, the Sphere's interest in Khai warranted her promotion to the rank of apprentice, and Rhea was chosen to be her Master. Ship then revealed to the Tribe that the Sith Empire had been all but destroyed, and now only a few Sith remained in hiding. Soon after, Ship informed the Tribe of a Damorian S18 light freighter that was traveling from the planet Eriadu. Ship called for five Sith to be part of a strike team to attack the vessel, and Rhea and Khai were chosen, along with fellow Sith Sarasu Taalon, Ruku Myal, and Ivaar Workan. They were carried by Ship to the freighter, and the Meditation Sphere attacked it, forcing it to land. The Sith landed in order to pursue and kill the six surviving crew members, and they decided to break into two groups—Rhea and Taalon in one, and Khai, Myal, and Workan in the other. Rhea and Taalon soon cornered four of the crew members, while the other Sith killed the other two. When the Sith finished their hunt, Taalon called them back to the freighter to take inventory.\nFollowing the mission, the Tribe began to use Ship to attack and capture more vessels in an effort to form a new armada with the purpose of conquering the galaxy for the Sith Empire. Rhea and her apprentice served aboard one of the first starships to be captured, the warship Eternal Crusader, and over the next two years, the armada expanded to include over two dozen ships.\nIn 43.5 ABY, Jedi Grand Master Luke Skywalker touched the Codex, an ancient Aing-Tii relic, causing his presence in the Force to be magnified. As a result, his name was whispered through the Force to the members of the Tribe. Ship revealed to the Sith that Skywalker was the Grand Master of the Jedi Order, and posed a threat to their planned conquest of the galaxy. An emergency meeting was held in the Circle Chambers in Tahv, and Rhea and the Tribe's leader, Grand Lord Darish Vol, handpicked a strike team to be led by Rhea, with the objective of hunting down Skywalker. However, during the meeting Ship abruptly left Kesh, following a call through the Force. The strike team was then assigned to find Ship, with the task of eliminating Skywalker coming second.\nRhea served as commander of the strike team aboard the Eternal Crusader, with Sith Master Yuvar Xal serving as the executive officer. They took advantage of Khai's special connection with Ship, using it to track the Meditation Sphere. Discontent arose within the ranks of the strike team, however, as Xal became displeased with Rhea's leadership, voicing his dissatisfaction that they were forced to rely on the word of her apprentice. However, the team finally tracked Ship to a planet in the Maw. There, Rhea organized a search party to be sent down to the surface to recover Ship while the Eternal Crusader remained in orbit. The search party consisted of herself, Khai, Xal, his apprentice Ahri Raas, and several other Sith, leaving the ship under the command of Sith Saber Baad Walusari, whom Rhea trusted more than Xal.\nBefore long, however, several of the Sith were killed by the planet's many deadly plants. Rhea decreed that if any of the team's members were killed they were to die quietly, and if they did so, their families back on Kesh would be commended, but if they died dishonorably, their families would be punished. Rhea and Khai hung back in the search, sending Xal, Raas, and the others ahead. Eventually, they met a being who called herself Abeloth who was able to control the world's deadly plant life, and agreed to protect the Sith during their search for Ship. Also—claiming to have been marooned on the world for thirty years—Abeloth agreed to return with the Sith to Kesh. In reality, however, Abeloth was the voice who had called out to Ship, and was still forcing Ship to ignore Khai's calls for him to return. The strike team's search continued fruitlessly, and as the Eternal Crusader's supplies were exhausted, Rhea finally decided to leave. Abeloth, however, argued for them to stay, but Rhea believed that returning to Kesh with Abeloth would more than make up for failing to recover Ship. Just then, however, Khai caught a glimpse of Ship, and Walusari commed Rhea to say that he had found Ship and was tracking it from the Eternal Crusader. The search party chased after the Meditation Sphere, and as they crossed a river, Rhea was dragged into a whirlpool by a siphon reed. Despite Abeloth's warning, Khai attempted to save her Master. Khai caught up with her deep beneath the waters and used her lightsaber to cut open the reed holding Rhea. Rhea then used the Force to pull them back up to the surface, where they were drawn from the water by Raas.\nAs the hunt continued in vain, more and more Sith arrived in shuttles from the Eternal Crusader to join the search party, until at last the warship no longer had any crew left aboard. Ship remained hidden, and as support for Rhea declined, Xal prepared to initiate a coup to take over the strike team. Nonetheless, Abeloth, who had discovered that Skywalker, along with his son, Jedi Knight Ben Skywalker, was beyond shadows—the state of mind Force-sensitives achieved when they separated their mind from their bodies—at Sinkhole Station, a small space station in the Maw, finally allowed Ship to return to the Sith. She insisted, however, that the Sith capture the Skywalkers and return with them to Kesh rather than kill them, suggesting that Xal would attain the rank of Lord, and that Rhea would become the High Lord of the Sith.\nThe strike team arrived at Sinkhole Station and prepared to ambush the Skywalkers, and Rhea decided to change their objective back from capture to kill. The Sith broke into the station's control room, where they confronted the Skywalkers. After a short fight, the Jedi ran for the station's hangar in an attempt to get to their starship, the Jade Shadow, covering their escape from the control room with azetal gas and blasterfire, leaving three of the attackers dead. Meanwhile, Xal, Raas, Walusari, and Khai were set up at a junction in the station. Rhea warned them that the Skywalkers were headed their way, and as Khai and Walusari threw their grenades at the Jedi, Xal and Raas pushed the grenades back at them before throwing their own stun grenades at the Skywalkers. Rhea had foreseen this betrayal, however, and had given Khai and Walusari fake grenades to throw first. Khai then killed Xal, but Raas and Walusari were subsequently eliminated by the Skywalkers, and Luke quickly captured Khai. As the Skywalkers were ambushed a third time, Khai escaped, but the Jedi defeated the other Sith and made it safely to the hangar. Rhea met up with Khai and the other two surviving Sith while Ben prepared the Jade Shadow for flight and Luke returned inside the Station on a turbolift.\nRhea, Khai, and the two remaining Sith waited at the turbolift entrance for Skywalker, who quickly dispatched the two others. Rhea and Khai, however, jumped into the turbolift and began to duel him. They scored several glancing hits on Skywalker, damaging his vac suit. The Sith pressed their advantage, but the Grand Master deflected one of Khai's blaster shots back at her foot, and he proceeded to duel with Rhea, using the Force to keep Khai from maneuvering to attack him. Behind Luke, the exit panel on the lift finally opened to the hangar, and Ben—in the Jade Shadow—opened fire on Ship. The Sith were distracted by the sudden light, and the visors on their vac suits darkened, temporarily hindering their vision. Rhea and Khai dove evasively, but Luke followed Rhea and quickly cut off her leg and arm, before swiftly decapitating her. Khai, realizing she was severely outmatched, fled.\nThe Skywalkers tracked Khai to Dathomir, where Khai called in members of her Tribe to retrieve her. A shuttle convoy led by Lord Viun Gaalan arrived and was confronted by the Skywalkers. Gaalan told Luke that Rhea's family would grant him much admiration for killing the Grand Master; however, in the ensuing duel, Gaalan was defeated and forced to flee, while Khai was captured. The Jedi were soon accosted by a Sith fleet under the command of High Lord Sarasu Taalon, who convinced them to form an alliance for a mission to defeat Abeloth. Khai's father, the Sith Saber Gavar, was allowed to board the Jade Shadow to speak privately with his daughter; and he confided in her that he, too, grieved over Rhea's death. Vestara responded that Rhea had died well, adding that there was no dishonor in being killed by the Skywalkers.\nOlaris Rhea was tall, with pale blonde hair and blue eyes. She was authoritative and, as one of the most powerful Sith in the Tribe, held great power in the Circle of Lords. Tall, slender, and graceful, she was also somewhat arrogant, and the lower-ranking members of the Tribe found her to be rather imposing. Rhea was known to be a strict teacher; however, she had a soft spot for her apprentice. On the planet to which they tracked Ship in the Maw, Khai grew frustrated with Rhea for failing to see how critical their situation was, and Rhea noted that such disrespect was something that apprentices never lived to do twice. She listened to Khai, however, and, realizing her apprentice was correct, spared her life. Rhea was also exceedingly clever, foreseeing that Xal would attempt to carry out his coup during the battle with the Skywalkers, and giving both Khai and Walusari fake grenades to throw so that they would not be killed when Xal and his apprentice threw them back.\nRhea was a Force-sensitive, and trained in the ways of the dark side of the Force. As a member of the Circle of Lords, Rhea was one of the most powerful and respected Sith on Kesh. She was acknowledged as a strong leader, as she was put in command of the Tribe's strike team. Rhea was proficient in telekinesis techniques, and was also a skilled lightsaber duelist, as she was able to hold her own, for a short time, against the Jedi Grand Master, Luke Skywalker. Khai even managed to injure him, though it was revealed he allowed this in order to establish a Blood Trail.\nOlaris Rhea was created by author Christie Golden for her first Star Wars novel, Fate of the Jedi: Omen, the second of nine novels in the Fate of the Jedi series. Rhea wasn't designated a first name until the third novel of the series, Fate of the Jedi: Abyss, in which she was given the name \"Olaris.\" Although her eyes were identified as blue in Omen, they were noted as green in Abyss. Rhea later appeared in \"First Blood,\" a short story written by Golden.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Category:Wookieepedia_Featured_articles",
  "/wiki/Wookieepedia:Inquisitorius",
  "/wiki/Wookieepedia:Inq/Olaris_Rhea",
  "/wiki/Kesh",
  "/wiki/43_ABY",
  "/wiki/Sinkhole_Station",
  "/wiki/The_Maw/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Vestara_Khai",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/41_ABY",
  "/wiki/Sith_Master/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Tyro",
  "/wiki/Sith_Meditation_Sphere",
  "/wiki/Ship_(Sith_Meditation_Sphere)",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_armada_(Lost_Tribe_of_the_Sith)",
  "/wiki/Warship/Legends",
  "/wiki/Eternal_Crusader",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Grand_Lord",
  "/wiki/Darish_Vol",
  "/wiki/Lost_Tribe_of_Sith_strike_team",
  "/wiki/Abeloth%27s_planet",
  "/wiki/Abeloth",
  "/wiki/Plant/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Yuvar_Xal",
  "/wiki/Ben_Skywalker",
  "/wiki/Space_station/Legends",
  "/wiki/Skirmish_at_Sinkhole_Station",
  "/wiki/Starship/Legends",
  "/wiki/Jade_Shadow",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Turbolift/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Sith_training",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Omen",
  "/wiki/5000_BBY/Legends",
  "/wiki/Lignan_crystal",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Circle_of_Lords",
  "/wiki/Circle_Chambers",
  "/wiki/Kesh_capitol_building",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Tahv",
  "/wiki/One_Sith",
  "/wiki/Rule_of_One",
  "/wiki/Kesh_Sith_Temple",
  "/wiki/Temple_courtyard",
  "/wiki/Takara_Mountains",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Damorian_Manufacturing_Corporation/Legends",
  "/wiki/S18_light_freighter",
  "/wiki/Eriadu/Legends",
  "/wiki/Sarasu_Taalon",
  "/wiki/Ruku_Myal",
  "/wiki/Ivaar_Workan",
  "/wiki/Freighter/Legends",
  "/wiki/Skirmish_near_Eriadu",
  "/wiki/The_galaxy/Legends",
  "/wiki/Codex",
  "/wiki/Aing-Tii/Legends",
  "/wiki/Relics",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Ahri_Raas",
  "/wiki/Sith_Saber",
  "/wiki/Baad_Walusari",
  "/wiki/Comlink/Legends",
  "/wiki/Siphon_reed",
  "/wiki/Water/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Beyond_shadows",
  "/wiki/High_Lord_(Circle_of_Lords)",
  "/wiki/Azetal",
  "/wiki/Blaster/Legends",
  "/wiki/Stun_grenade/Legends",
  "/wiki/Enviro-suit",
  "/wiki/Cho_mok/Legends",
  "/wiki/Cho_sun/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Viun_Gaalan",
  "/wiki/Duel_in_the_Dathomir_landing_meadow",
  "/wiki/Mission_to_the_Maw",
  "/wiki/Gavar_Khai",
  "/wiki/Blood_trail",
  "/wiki/Christie_Golden",
  "/wiki/Star_Wars",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/First_Blood_(short_story)",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_125",
  "/wiki/Star_Wars_Insider:_The_Fiction_Collection_Volume_1",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice"
 ]
}