{
 "name": "Old_One-Eye",
 "display_name": "Old One-Eye",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rancor"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Old One-Eye was a rancor with only one eye who was a contender in an illegal rancor fighting circuit on the galactic capital planet of Coruscant during the Clone Wars. The Jedi Anakin Skywalker and Ahsoka Tano entered the rancor arena while pursuing Separatist agent Raice Liq, and Tano was forced to fight Old One-Eye. Skywalker resolved the situation by calming Old One-Eye with the Force, allowing the Jedi to use the rancor in apprehending their quarry.\nOld One-Eye was a brown-skinned rancor who lived during the Clone Wars, a galactic conflict between the Galactic Republic and the Confederacy of Independent Systems. During the war, Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, went undercover at an illegal rancor fight featuring Old-One Eye on the galactic capital planet of Coruscant, about eighty kilometers away from the Senate Building. They aimed to stop Raice Liq, a Muun who used the fights to transfer Republic munitions data to the Separatists.\nThe fight pitted Old One-Eye against another rancor with six-to-one odds in favor of Old One-Eye. Tano fell into the arena during the match and had to fight Old One-Eye and the other rancor, and Skywalker quickly joined the fight as well. Although the Jedi lightsabers had no effect on the rancors' tough hides, Skywalker was able to calm the beasts through the Force. Before calling Captain Rex of the 501st Legion to bring transports and additional clone troopers to assist in arresting the 200 law-breaking gamblers, Tano mounted Old One-Eye while Skywalker mounted the other rancor to go after Liq. After the arrival of the clones, the Jedi approached Liq on rancors and arrested him.\nOld One-Eye appeared in Prize Contender, a comic written by Rik Hoskin and illustrated by Tanya Roberts, which was published in Star Wars Comic UK magazine for the September 2010 issue.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rancor/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/One-Eye",
  "/wiki/Color/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Eye/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Coruscant_gladiatorial_arena",
  "/wiki/Mission_to_Coruscant_(Anakin_Skywalker)",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Raice_Liq",
  "/wiki/Animal_bond",
  "/wiki/The_Force/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Kilometer/Legends",
  "/wiki/Senate_Building",
  "/wiki/Muun/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/CT-7567/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Gambler/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Prize_Contender",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Rik_Hoskin",
  "/wiki/Tanya_Roberts",
  "/wiki/Star_Wars_Comic_UK",
  "/wiki/September",
  "/wiki/2010",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.11"
 ]
}