{
 "name": "Olee Starstone",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jocasta Nu",
      "Bol Chatak"
     ]
    }
   ]
  }
 ],
 "content": "Olee Starstone was a female Human Padawan who was trained by the Jedi librarian Jocasta Nu and later Jedi Master Bol Chatak during the waning years of the Galactic Republic. She bore a blue lightsaber and was physically fit, but her best skills were as a researcher and historian, like her original Master.\nBorn in 33 BBY. Olee Starstone was accepted into the Jedi Order and grew up in the Jedi Temple, where she was selected as a Padawan of the Chief Librarian, Jocasta Nu. Starstone hoped to one day succeed Nu in her position amongst the Jedi Archives. Shortly before the First Battle of Geonosis, in 22 BBY, in an attempt to broaden her horizons, Starstone went on a mission to Eriadu. It was there that she first met Master Bol Chatak.\nIn 21 BBY, at the behest of the Jedi Council, Starstone was reassigned to Chatak, becoming her Padawan. The Council felt that athletic, skilled young Jedi were needed more on the battlefield of the Clone Wars than at the Jedi Temple.\nTwo years later, in 19 BBY, Starstone and Chatak were among six Jedi who traveled to Murkhana, one of the many Outer Rim Sieges. They were joined with Jedi Master Roan Shryne, who having previously lost his former Master and two Padawans during the war, had become disillusioned and bitter, while also losing much of his connection with the Force. Supreme Chancellor Palpatine and Republic High Command had decided that the policy of \"winning the hearts and minds of the Separatists\" was the most sound plan for taking Murkhana, having given the Corporate Alliance several weeks to surrender for before launching their attack. During this time, however, the Separatists used the opportunity to seed the atmosphere of the planet with anti-laser aerosols, which were designed to scatter blaster fire.\nEventually, the Battle of Murkhana began, with the conflict lasting over three weeks. Starstone and Chatak accompanied Shryne and Clone Commander Salvo aboard a wing of LAAT/i gunships, departing from the Star Destroyer Gallant. They assaulted a Corporate Alliance landing platform in Murkhana City, and once landing, began to fight across the city. Starstone, Chatak, and Shryne accompanied Ion Team, a clone commando unit led by Captain Climber, to the deflector shield generator that protected the landing platform. During the fight to destroy the generator, Shryne saved Climber's life by lending him his lightsaber to kill an attacking mercenary. The group was finally successful, causing the landing platform to lose its defenses.\nWithout warning, Palpatine initiated Order 66 to all clone troopers across the galaxy. The other three Jedi on Murkhana were quickly ambushed and killed by Salvo and his troops, but Climber and Ion Team refused to carry out the order. Unconvinced that the Jedi had betrayed the Republic, they planned to assist in the escape of their Jedi Generals. When Salvo and his men created an ambush for the remaining Jedi, Climber decided to engage his fellow clones, creating a counter-ambush. While the commandos refused to kill their brothers, the confusion they caused was substantial, and Starstone and the others were able to flee the city.\nThe Jedi then disguised themselves as mercenaries, hoping to escape the planet along with the rest of the fleeing Separatist forces. With all the droid armies of the Confederacy shut down by the new Sith apprentice, Darth Vader, the clones across the planet turned their attentions to rounding up the mercenaries instead. The Jedi allowed themselves to be captured, hoping to make their escape at a later time, and were brought to a transport that was departing for a prison on Agon Nine. At the same time, however, Vader himself arrived on the world, seeking the clones that he had heard helped Jedi escape. Starstone and the others witnessed Vader confront the commandos, accusing them of treason. Climber took responsibility for the actions of his team, and told Vader that his actions were justified, as well as calling the man a \"lapdog of the Emperor\". Vader was furious and ignited his lightsaber, and Ion Team drew their weapons to defend themselves. They fired on the Sith, and Vader deftly deflected the bolts back at them, killing two of the clones. Climber and his teammate, Trace, escaped to a nearby treeline, disappearing into the forest.\nMaster Chatak saw an opportunity to dispose of a threat to the galaxy and a killer of Jedi, and ignited her hidden lightsaber and revealed her identity to Vader. She attacked him, and the two former allies dueled, with Chatak able to wound one of Vader's cybernetic arms. Ultimately, however, Vader was too powerful for her, and he decapitated Chatak. Upon Chatak's death, Vader took to scanning the crowd of prisoners, drawing his gaze on Starstone, but he was mercifully distracted before being able to confront her. Shryne subsequently managed to use a mind trick to allow Starstone and he to escape from the prison transport, and once more attempt to flee the city. It was not long, however, until Commander Appo discovered that two prisoners were missing from their initial count, and the clone deduced that these two were in fact the missing Jedi.\nShryne contacted an old ally of his, the Twi'lek crime lord, Cash Garrulan. Garrulan was a former Black Sun vigo and an informant for the Jedi Order, and was willing to help the two fugitives. He warned them of the devastating attack on the Jedi Temple and agreed to get them offworld. He set up the Dead Ringer as a decoy, complete with two Humans hidden on board, while giving Starstone and Shryne a CloakShape fighter to leave the planet. Starstone and Shryne were finally able to escape Murkhana, with the newly formed Galactic Empire following close behind.\nStarstone and Shryne eventually rendezvoused with the Drunk Dancer, captained by Shryne's mother, Jula. The smugglers' ship's young slicer, Filli Bitters, immediately began flirting with Starstone, and Shryne, who had already given up on his life as a Jedi, was disappointed that she ignored Bitters due to her strict adherence to the Jedi Code.\nStarstone, rather than Shryne, took the lead in gathering together survivors of the Great Jedi Purge, contrary to the intentions of Jedi such as Yoda and Obi-Wan Kenobi. By this point, Shryne had even discarded his lightsaber, intent on taking up the life of a smuggler. Jula, however, was more eager to help the young Jedi, and she and Starstone searched planets such as Boz Pity and Felucia for survivors of the purge, but found none. Eventually, Starstone did manage to track down other survivors, gathering Jedi such as Siadem Forte, Iwo Kulka, and Forte's Padawan, Deran Nalual, as well as two young Jedi from the Agricultural Corps, Jambe Lu and Nam Poorf. The Jedi soon resolved to travel to Kashyyyk, hoping to find a sign of Jedi Masters such as Yoda or Quinlan Vos.\nUnknown to the Jedi, Palpatine and Vader were well aware of their plans, and devised a trap in order to accomplish several goals. Moff Wilhuff Tarkin would use the presence of Jedi on the planet to invade and enslave the native Wookiees, who were resisting the transition of the Republic into an Empire. The invasion began almost as soon as the Jedi arrived planetside, and Vader and Commander Appo descended into the Wookiee villages in order to engage the Jedi themselves. Starstone and the others, realizing they had been led into a trap, counterattacked alongside the Wookiees, felling many stormtroopers. While Forte and Kulka battled Appo and his men, Vader dueled Starstone, and seeing the Dark Lord's power, the other Jedi joined in, hoping to overpower him. Vader sliced off Lu's right arm, Poorf's right leg, and decapitated Forte and Kulka in one strike, leaving Starstone to face him alone. She held her own against the more powerful duelist, but was soon close to defeat. Just then, Shryne joined the fight, drawing Forte's lightsaber to him and killing Appo.\nShryne challenged Vader to a duel, allowing the younger Jedi to escape. Starstone, along with their Wookiee ally, Chewbacca, helped Lu and Poorf flee the scene of the battle, climbing aboard the Drunk Dancer and leaving Kashyyyk behind. Shryne dueled Vader alone, and through a protracted battle filled with various offensive and defensive maneuvers, managed to hold off the Sith Lord for a time. Eventually, Vader overwhelmed Shryne by hurling dozens of objects at him all at once, wounding him grievously. While Vader attempted to taunt Shryne for his defeat, Shryne countered that he should thank Vader for making him one with the Force once more.\nFollowing the death of Shryne, Starstone realized she could no longer openly live as a Jedi, but should follow the examples of Kenobi and Yoda and escape into anonymity for the time being. Allowing herself to make attachments, she joined the crew of the Drunk Dancer, alongside Chewbacca. Starstone vowed to fight the Empire in any subtle way she could.\nOlee Starstone was very devoted to the Jedi Order and refused to allow the Jedi flame to be extinguished. At first she didn't believe the Jedi should hide from the Sith but later realized that she could no longer live openly as a Jedi and went into hiding. During her duel with Darth Vader she briefly used her rage but then calmed herself down, even while Vader encouraged her to use her anger.\nStarstone was considered an attractive girl by Filli Bitters, but her devotion to the Jedi Code prevented her from returning his feelings. Eventually, however, she did allow herself to form attachments.\nDespite her young age, Starstone was an athletic and skilled Jedi. Though a Padawan she managed to hold her own against Darth Vader, notably being the last Jedi standing before Roan Shryne arrived to rescue them.\nIn addition to being a skilled duelist Starstone showed promise as a Jedi researcher, having once been the Padawan of Chief Librarian Jocasta Nu.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jocasta_Nu/Legends",
  "/wiki/Bol_Chatak",
  "/wiki/Roan_Shryne",
  "/wiki/Murkhana/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_librarian/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Chief_Librarian/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Eriadu/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Outer_Rim_Sieges/Legends",
  "/wiki/Saras_Loorne",
  "/wiki/The_Force/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Republic_High_Command/Legends",
  "/wiki/Corporate_Alliance/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Anti-laser_aerosol",
  "/wiki/Blaster/Legends",
  "/wiki/Battle_of_Murkhana_(Clone_Wars)",
  "/wiki/Clone_trooper_commander",
  "/wiki/Salvo",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Victory_I-class_Star_Destroyer/Legends",
  "/wiki/Gallant_(Victory_I-class)",
  "/wiki/Murkhana_City/Legends",
  "/wiki/Ion_Team",
  "/wiki/Clone_commando/Legends",
  "/wiki/Climber_(clone)",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Agon_Nine",
  "/wiki/Treason/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Trace_(clone)",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Commander/Legends",
  "/wiki/CC-1119/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Cash_Garrulan",
  "/wiki/Black_Sun/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Operation:_Knightfall",
  "/wiki/Dead_Ringer",
  "/wiki/CloakShape_fighter/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Drunk_Dancer",
  "/wiki/Jula_Shryne",
  "/wiki/Smuggler/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Filli_Bitters",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Boz_Pity/Legends",
  "/wiki/Felucia/Legends",
  "/wiki/Siadem_Forte",
  "/wiki/Iwo_Kulka",
  "/wiki/Deran_Nalual",
  "/wiki/Agricultural_Corps/Legends",
  "/wiki/Jambe_Lu",
  "/wiki/Nam_Poorf",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader",
  "/wiki/Star_Wars_Insider",
  "/wiki/Order_66:_Destroy_All_Jedi",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/Han_Solo:_The_Early_Years",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}