{
 "name": "Olge_Plavi-Dol",
 "display_name": "Olge Plavi-Dol",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Commenor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Olge Plavi-Dol was a female Human Jedi Knight, who served the Galactic Republic as a member of the Jedi Order during the Clone Wars.\nA female Human, Olge Plavi-Dol was born on the planet of Commenor to a family who quickly discovered she was Force-sensitive. Sent to the Jedi Temple on Coruscant, Plavi-Dol was educated in the ways of the Force before being assigned to a Jedi Master. Completing her Trials of Knighthood and ascending to the rank of Jedi Knight, Plavi-Dol explored the ways of the Consular, delving into the art of healing with the Force becoming a proficient Jedi healer.\nAt the outbreak of the Clone Wars, Plavi-Dol took up the rank of Jedi General in the Grand Army of the Republic. Early in the war she traveled to Argul, where she participated in a battle against the Confederacy of Independent Systems. She attended the sick and wounded who were awaiting transport offworld alongside Jedi Master Ulseh. After Grand Master Yoda left the planet to gather reinforcements, Plavi-Dol volunteered to stay behind with Master Ulseh, even though another transport may not have arrived in time, as she believed that her abilities to heal the injured were still needed.\nPlavi-Dol made her only appearance in Only the Force, a scenario for the Star Wars Roleplaying Game. In that, the player playing as Plavi-Dol can choose Plavi-Dol's sex. However, she is described as female in the biographies of the other playable characters, so that can be assumed to be her canonical sex.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Commenor/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/Force_healing/Legends",
  "/wiki/Jedi_healer/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Argul",
  "/wiki/Battle_of_Argul",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Ulseh",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Only_the_Force",
  "/wiki/Star_Wars_Roleplaying_Game"
 ]
}