{
 "name": "Oma Tres",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Oma Tres was a human male who served as a bartender of the Spice Runners' Den on the First Order-occupied planet Kijimi around 35 ABY who had experienced much discord in his position. As a bartender, Tres only hoped that the conflict would end, and an era of peace would take its place.\nWhen noticing the protocol droid C-3PO wearing a coat as the droid and his crew entered the workshop of the droidsmith Babu Frik, Tres shook his head in disapproval while cleaning a cup. After the event, the First Order abandoned the planet following the activation of Protocol 13, which was then immediately followed by its destruction by the Xyston-class Star Destroyer Derriphan. Tres had gray hair, brown eyes and light skin. He wore a blue scarf and a brown coat, as well as black gloves and a device covering his right eye.\nOma Tres appeared in the 2019 film Star Wars: Episode IX The Rise of Skywalker, the third and final installment of the Star Wars sequel trilogy. He was played by veteran composer John Williams. According to Williams, he initally turned down the role, humbly claiming that it would be \"silly\" for him to appear in the film. However, when he told his wife, Samantha Winslow, of the idea, she immediately convinced him to play the character, saying that it was \"more important than doing the score of the film\". On set, the props behind Williams consisted of 51 items specifically chosen to commemorate Williams' other films and his 51 Academy Award nominations. \"Oma Tres\" is an anagram of the word \"maestro.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bartender",
  "/wiki/Spice_Runners%27_Den",
  "/wiki/First_Order",
  "/wiki/Planet",
  "/wiki/Kijimi",
  "/wiki/35_ABY",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Jacket",
  "/wiki/Droid",
  "/wiki/Babu_Frik%27s_workshop",
  "/wiki/Droidsmith",
  "/wiki/Babu_Frik",
  "/wiki/Protocol_13",
  "/wiki/Destruction_of_Kijimi",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Derriphan",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Scarf",
  "/wiki/Glove",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/John_Williams",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Disney%2B",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/The_Skywalker_Legacy"
 ]
}