{
 "name": "Omad_Kaeg",
 "display_name": "Omad Kaeg",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Olive-skinned"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lando Calrissian"
     ]
    }
   ]
  }
 ],
 "content": "Omad Kaeg was the captain of the mining ship Joyous Roamer in the Chiloon Rift as of 45 ABY. He was a member of the mining cooperative that operated in the Rift.\nDuring the Qreph brothers' attempted hostile takeover of the galactic economy, Kaeg was manipulated into a sabacc game with some Mandalorians that the Qrephs had hired; when Kaeg lost and was unable to pay his marker, he was nearly coerced into selling his shares in the mining cooperative. Fortunately, he had been hired by Lando Calrissian to act as a courier to send a message to Han and Leia Organa Solo, where Calrissian had wanted the Solos to help him against the pirate problem in the Chiloon Rift that the Qreph brothers were behind.\nAfter the Solos learned of Kaeg's predicament, they agreed to help him escape the Qrephs' wrath, and he ended up helping them in their adventure in bringing the brothers down. Three months after the end of that adventure, which saw to the Qrephs' deaths, Kaeg was invited to the toast that the Solos and Luke Skywalker that saw to them taking an unofficial retirement from the galaxy's problems.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Joyous_Roamer",
  "/wiki/Chiloon_Rift",
  "/wiki/45_ABY",
  "/wiki/Sabacc/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/House_of_Solo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Skywalker_family/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Crucible_(novel)",
  "/wiki/Crucible_(audiobook)"
 ]
}