{
 "name": "Omel Sampak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "Accretion Disco"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pyke"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "Omel Sampak was a Pyke male gangster who served as a member of the Pyke Syndicate during the Galactic Civil War. Between 3 ABY and 4 ABY, Sampak ordered the bombing of a Nar Kanji fight school which killed a number of students as they slept, after which, Sampak hired out the space station Accretion Disco to celebrate his victory. To keep Sampak and his entourage alive as they celebrate, one of his underlings hired the crew of the bounty hunter T'onga for the job. As the crew met with Sampak, he speculated that one of the crew, Tasu Leech, could be a Nar Kanji assassin and that he sounded like one. T'onga defended her crew mate and stated he was not an assassin, but pointed out that a number of party crashers were in fact assassins.\nAs T'onga's crew fought the assassins, Leech was ordered by T'onga to take Sampak to a safe room. When they arrived, they were encountered by a number of assassins, with one recognizing Leech as a native of Nar Kanji because of his fighting style. The assassin attempted to persuade Leech of where his loyalties should lie, with them instead of T'onga's crew or working for the Pykes, and then informed Leech of the reason why they had tried to kill Sampak, to exact revenge for the bombing of the students. After the assassin left, Sampak praised Leech for stepping up and stated he was not as useless as he had first thought, but was then stabbed and killed by Leech with a knife. As the fighting began to end, T'onga and the rest of the crew made their way to the safe room to collect their fee for protecting Sampak, though when they arrived they discovered what Leech had done.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Accretion_Disco",
  "/wiki/Pyke",
  "/wiki/Gender",
  "/wiki/Pyke_Syndicate",
  "/wiki/Gangster",
  "/wiki/Galactic_Civil_War",
  "/wiki/Bombing_of_a_Nar_Kanji_fight_school",
  "/wiki/Death",
  "/wiki/Sleep",
  "/wiki/Space_station",
  "/wiki/Unidentified_Pyke_Syndicate_member",
  "/wiki/T%27onga%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/T%27onga",
  "/wiki/Tasu_Leech",
  "/wiki/Nar_Kanji",
  "/wiki/Assassin",
  "/wiki/Jablogian_(language)",
  "/wiki/Skirmish_on_the_Accretion_Disco",
  "/wiki/Unidentified_Kanji_assassin",
  "/wiki/Homeworld",
  "/wiki/Knife",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Omel_Sampak",
  "/wiki/Bounty_Hunters_27",
  "/wiki/Bounty_Hunters_28",
  "/wiki/StarWars.com",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}