{
 "name": "Omera",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sorgan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sorgan human tribe"
     ]
    }
   ]
  }
 ],
 "content": "Omera was a human female from the planet of Sorgan. At some point, she became a widow. In 9 ABY, a band of Klatooinian raiders attacked her village and people. However, after the raiders stole Krill the villagers had gathered, Mandalorian bounty hunter Din Djarin was contacted by Caben and Stoke, who attempted to recruit the Mandalorian for the defense of their home. Although Djarin was first hesitant, he ultimately accepted. Djarin teamed up with ex-Shock trooper Carasynthia Dune and trained the villagers in hand-to-hand combat as well as in shooting. After Djarin and Dune destroyed the Klatooinian raiders' camp, the raiders attacked the village with their AT-ST, however, they were ultimately defeated by the villagers and the mercenaries.\nAfter the succesful defense of her village, Djarin and Dune settled in the village. At that point, Omera met with Djarin, who informed her that Grogu, a child that was accompanying him would be staying in the village with the other kids, such as Omera's daughter, Winta. However, a Kubaz bounty hunter attempted to kill Grogu after he tracked the Child with a Tracking fob. Forcing Dune to defeat him and Djarin to abandon the village, as bounty hunters would continue to attack Grogu and the village. Omera and her daughter then bid farewell to Djarin and Grogu, who left with their belongings, causing Winta to cry.\nAt some point, Omera had a daughter, Winta, but was later widowed. She resided with her tribe at a village on the planet Sorgan, taking care of her daughter and farming krill. The village became the site of frequent attacks by Klatooinian raiders, forcing Omera and the villagers to remain hidden to avoid being caught by them. Fellow villagers Caben and Stoke convinced the bounty hunter known as Din Djarin help defend their village, who also brought former rebel shock trooper Carasynthia Dune alongside him. When they arrived at the village, Omera provided lodging to Din Djarin. When Djarin was alerted to Winta's presence, Omera comforted the girl, explaining that he was here to protect the village. She later arrived with a tray of food and asked why he never removed his helmet publicly, learning of his past and the way of life he followed.\nWhen Dune and Din Djarin investigated the Klatooinian raiders and discovered the tracks of an AT-ST, they announced to the villagers that they would have to migrate elsewhere. Omera stated that the farmers had nowhere else to go. After the two agreed to train the tribe, Omera and a number of villagers were trained in using blasters by Din Djarin. Omera displayed her prowess in using a Relby-v10 micro grenade launcher, catching the attention of the bounty hunter. Following their training, Djarin told Omera to prepare for the attack as him and Dune departed to provoke the Klatooinian raiders. When the two returned, Omera and the tribe repelled the attack.\nA few weeks after the battle, Dune and Din Djarin settled in the village. Omera provided a cup of spotchka to Dune while commenting to Djarin that Grogu was happy to be living at the village. He later informed her that he would be leaving Grogu behind in order to keep him safe. Omera asked Din Djarin to stay and attempted to remove his helmet but was stopped by him, stating that only Grogu belonged here. Their conversation was interrupted by a gunshot, which turned out to be Dune killing a bounty hunter that attempted to eliminate Grogu. Knowing that his life was still in danger, Djarin decided to leave the planet with him. Omera thanked him as he parted ways with Dune and the tribe.\nOmera was a human female hailing from Sorgan, she had tan skin, brown hair and brown eyes. She stood at 1.73 meters.\nOmera was the only person out her entire village that knew how to shoot with a blaster before Din Djarin taught her village's adults how. She was also able to lead her village while defending her people from the Klatooinians.\nOmera was portrayed by Julia Jones in Chapter 4 of Jon Favreau's 2019 Disney+ television series The Mandalorian, which aired on November 29, 2019. Stunt work for the character was performed by Lauren Mary Kim, who also acted as the double for The Armorer in the series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sorgan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Unidentified_human_tribe",
  "/wiki/Planet",
  "/wiki/Widow",
  "/wiki/9_ABY",
  "/wiki/Klatooinian_raiders",
  "/wiki/Klatooinian",
  "/wiki/Pirate",
  "/wiki/Unidentified_village_(Sorgan)",
  "/wiki/Krill",
  "/wiki/Farm",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Caben",
  "/wiki/Stoke",
  "/wiki/Shock_trooper",
  "/wiki/Carasynthia_Dune",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Blaster",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Mercenary",
  "/wiki/Grogu",
  "/wiki/Daughter",
  "/wiki/Winta",
  "/wiki/Unidentified_Kubaz_bounty_hunter",
  "/wiki/Tracking_fob",
  "/wiki/Farmer",
  "/wiki/Krill_(creature)",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Foodstuff",
  "/wiki/Helmet",
  "/wiki/Way_of_the_Mandalore",
  "/wiki/AT-ST_Raider",
  "/wiki/Relby-v10_micro_grenade_launcher",
  "/wiki/Spotchka",
  "/wiki/Julia_Jones",
  "/wiki/Chapter_4:_Sanctuary",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/November_29",
  "/wiki/Lauren_Mary_Kim",
  "/wiki/The_Armorer",
  "/wiki/Category:Images_of_Omera",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian:_A_Clan_of_Two",
  "/wiki/The_Mandalorian:_This_is_the_Way",
  "/wiki/The_Mandalorian_4",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Cast",
  "/wiki/Process",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Databank_(website)",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020",
  "/wiki/Chapter_8:_Redemption"
 ]
}