{
 "name": "Omi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vodran"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dianoga"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "10.0 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "Omi was a Force-sensitive female dianoga who lived inside garbage masher 3263827 aboard the Death Star.\nOmi, like other dianoga, was a sentient carnivorous cephalopod which possessed multiple hearts, seven suckered tentacles, and a single eyestalk protruding from the center of her body. She had purple skin that could change color to match her surroundings, and a green eye with red sclera. Omi was 10.0 meters tall.\nSometime before the Battle of Yavin, Omi got into an altercation with Iduna, a male member of her species, who had wanted to exchange eggs. Her Force-sensitivity enabled her to defeat Iduna.\nSometime later, she was captured on her homeworld by the native Vodran, who handed Omi to Imperials en route to the Death Star. While en route to the DS-1 Orbital Battle Station, she received a vision of fiery destruction and escaped her containment. She attempted to flee the vessel by making use of her species' natural ability to camouflage, but was discovered by two Imperial stormtroopers. Although she dispatched the two stormtroopers, by surrendering herself to the power of what she could only describe as \"It,\" she realized that there was nowhere to go, and retreated back into her containment, until finally arriving on the Death Star. Once aboard, Omi once again received a vision of fire, and was dumped into a garbage chute, introducing her to garbage masher 3263827, where she would feed on the organic materials that would fall in.\nAfter rescuing Princess Leia Organa aboard the Death Star, Han Solo, Chewbacca, and Luke Skywalker were temporarily stranded inside garbage masher 3263827, in the year 0 BBY. Enacting the belief of her people, Omi pulled Skywalker into the water, \"baptizing\" him, after she felt that he too was in \"submission to It,\" and letting him go shortly thereafter. As the compression cycle was about to start, the dianoga disappeared deep underwater. When Luke Skywalker escaped the trash compactor unharmed, Omi sensed that he would go on to do great things.\nBefore the Death Star's destruction, Omi continued to develop in her submission to \"It,\" being able to telepathically lift objects into the air. When her vision was fulfilled, and the Death Star was destroyed, she pondered what she would be in the next life.\nOmi, and the dianoga species, first appeared in the original 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy. Nnedi Okorafor, writer of the short story \"The Baptist\" for the anthology From a Certain Point of View, revealed Omi's name in a preview for her short story on September 16, 2017. Okorafor stated that she named the dianoga Omi, as Omi means \"water\" in the Yoruba language.\nIn George Lucas' revised fourth draft of A New Hope, Omi, or more specifically the dianoga, was referred as \"Dia Nogu,\" in reference to the earlier drafts, in which the Jedi were called \"Dai Nogas\" or just \"Dai.\" The early scripts of the film didn't always have Omi's presence nor the trash compactor scene. In the finished version of film, Lucas was reportedly less than impressed with the delivered dianoga effect, having envisioned something bigger and more ominous.\nIn 2015, Chuck Wendig, author of the novel Aftermath, expressed interest in potentially writing stories about Malakili, Chief Chirpa or Omi. However, he ultimately wrote about Malakili in his sequel novel Aftermath: Life Debt.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Omi",
  "/wiki/Unidentified_Dianoga",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Vodran",
  "/wiki/0_BBY",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Yavin_system",
  "/wiki/Dianoga",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Force-sensitive",
  "/wiki/Garbage_masher_3263827",
  "/wiki/Sentience",
  "/wiki/Diet",
  "/wiki/Cephalopod",
  "/wiki/Heart",
  "/wiki/Limb",
  "/wiki/Eye",
  "/wiki/Battle_of_Yavin",
  "/wiki/Iduna",
  "/wiki/Species",
  "/wiki/Egg",
  "/wiki/Vodran_(species)",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_station",
  "/wiki/Force_vision",
  "/wiki/Starship",
  "/wiki/Stormtrooper",
  "/wiki/The_Force",
  "/wiki/Fire",
  "/wiki/Garbage_compactor",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Death",
  "/wiki/Star",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Luke_Skywalker",
  "/wiki/Standard_year",
  "/wiki/Water",
  "/wiki/Telepathy",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Nnedi_Okorafor",
  "/wiki/The_Baptist",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/September_16",
  "/wiki/2017",
  "/wiki/George_Lucas",
  "/wiki/2015",
  "/wiki/Chuck_Wendig",
  "/wiki/Aftermath_(novel)",
  "/wiki/Malakili",
  "/wiki/Chirpa",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Trapped_in_the_Death_Star!",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/A_Bad_Feeling_About_This",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Mind_Your_Manners",
  "/wiki/Star_Wars_Adventures_Annual_2018",
  "/wiki/All_Creatures_Great_and_Small",
  "/wiki/Tales_from_a_Galaxy_Far,_Far_Away:_Aliens:_Volume_I",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Awakenings",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Databank_A-Z",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Join_the_Resistance",
  "/wiki/Episode_IV:_A_New_Hope_Read-Along_Storybook_and_CD",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Chuck_Wendig%27s_War",
  "/wiki/Star_Wars_Insider_160"
 ]
}