{
 "name": "Omkoo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Talus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aqualish"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Omkoo was an Aqualish male who lived on Talus during the Galactic Civil War.\nOmkoo was a descendant of Aqualish who settled on Talus long before the Galactic Civil War. After the Battle of Yavin, he resided in the city of Dearic. In 1 ABY, Omkoo was concerned by rumors of thugs vandalizing Aqualish gravesites. As the local Federation of the Double Worlds authorities seemed indifferent to this situation, the Aqualish hired a spacer at the Dearic Starport to investigate and stop disturbing the graves.\nThe spacer traveled to one of the oldest Aqualish gravesites. There, the spacer did not find thugs but paramilitary forces of the Tralus and Talus Liberation Party, a group fighting for the independence of the Double Worlds from the Corellian system. Omkoo was disgusted to see the TTLP soldiers plundering the ruins, he ordered the spacer to kill them for their crime. The spacer and Omkoo then discovered that the TTLP had already shipped off some artifacts from the gravesite to the Nashal Starport, as well as to a weapons depot of the Rebel Alliance. The spacer visited those places and, after fighting again some TTLP soldiers, managed to retrieve all stolen artifacts. At the Rebel weapons depot, the spacer discovered information indicating that the TTLP provided weapons, medical equipment and stolen Aqualish artifacts to the Rebels in order to obtain their support.\nThe spacer brought back the stolen Aqualish artifacts who was puzzled by the discoveries and did not figure out what the TTLP wanted with the old Aqualish society.\nOmkoo was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. Omkoo was added to the game with the quest \"Grave Robbers\" released with the \"Publish 21\", on August 4, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Talus/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/City/Legends",
  "/wiki/Dearic/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Federation_of_the_Double_Worlds",
  "/wiki/Spacer/Legends",
  "/wiki/Dearic_Starport",
  "/wiki/Aqualish_gravesite",
  "/wiki/TTLP_soldiers",
  "/wiki/Tralus_and_Talus_Liberation_Party",
  "/wiki/Double_Worlds",
  "/wiki/Corellian_system",
  "/wiki/Nashal_Starport",
  "/wiki/Weapons_Depot",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_4",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}