{
 "name": "Ommo_Twilto",
 "display_name": "Ommo Twilto",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sentient species"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Ommo Twilto was an alien mercenary. In 35 ABY, the Festival of the Ancestors was held on the planet Pasaana, and those native Aki-Aki chieftains who could afford it hired offworld enforcers, including Twilto and Dered Karno, to make sure that nothing disrupted the festivities and that any violence was quickly contained. Generally staying out of any altercations, the enforcers kept an eye on merrymakers that might become unruly and turn into troublemakers. They also scanned the crowd for other offworld hired guns, as the anonymity of the crowds at the festival attracted fugitives and bounty hunters.\nTwilto had brown skin and black eyes and braided black hair. The alien wore brown armor made up of plastoid tiles wrapped in leather padding and a gray helmet over a red shirt with a brown belt, pants, gloves, and boots. The enforcer's weapon was an electroprod staff with leather straps for insulated grip and a battery head with a charge trode.\nOmmo Twilto was created for the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, but is not visible in the final film. However, the character was mentioned in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. Twilto's name is a partial anagram of the name of actor Tom Wilton, who portrayed Twilto in the film and referred to the character as Tovine on set. Derek Arnold, who portrayed Dered Karno, stated that everything about Twilto and Karno and their depiction in The Visual Dictionary made completing the sequel trilogy worthwhile.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Unidentified_snouted_species",
  "/wiki/Color",
  "/wiki/Mercenary",
  "/wiki/35_ABY",
  "/wiki/Festival_of_the_Ancestors",
  "/wiki/Planet",
  "/wiki/Pasaana",
  "/wiki/Aki-Aki",
  "/wiki/Chief",
  "/wiki/Dered_Karno",
  "/wiki/Bounty_hunter",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Alien",
  "/wiki/Armor",
  "/wiki/Plastoid",
  "/wiki/Leather",
  "/wiki/Helmet",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Electroprod",
  "/wiki/Staff",
  "/wiki/Battery",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tom_Wilton",
  "/wiki/Derek_Arnold",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}