{
 "name": "Omnino",
 "display_name": "Omnino",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vena"
     ]
    },
    {
     "name": "Died",
     "values": [
      "37 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Venan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Baroness Omnino was a female Venan who was the ruler of Vena during the waning years of the Galactic Republic.\nCirca 57 BBY, the rise of Baron Kindoro and Baroness Omnino to power on Vena changed the historical isolationist position the system always maintained. Due to the fact that Kindoro and Omnino had been both ambassadors to Coruscant and Alderaan, this contact with outsiders motivated an economic deregulation and active foreign policy, including trade agreements, in order to make goods accessible to the Venan royal family.\nThis radical shift angered many Venans, who resented the fact that only the royal family was benefitting from the economic opening. The commoners called for a return to isolationism and the old-fashioned values. The regents, unwilling to give in to popular demands, imprisoned the movement leaders and sent them to labor camps. This move aggravated tensions and motivated the emergence of terrorism and sabotage against Venan nobility.\nThis conflict was worsened with the death of Kindoro, as Baroness Omnino proved herself even more unmerciful than her husband, and waged bloody war for years against her subjects.\nHer husband's death 49 BBY left her with a son, the would-be Baron Sando. Master Qui-Gon Jinn was responsible for escorting her husband while traveling through Republic Space. The baron's heart failed, and Omnino blamed Qui-Gon for his death; since then, she distrusted the Jedi.\nSeveral years later, the Baroness attempted to defame the Jedi and take control over the Republic. She first used an arcane mind control device to perform a false-flag assassination attempt on herself when she arrived on Coruscant to commence membership negotiations for Vena. This garnered her support within the Republic and discredited the Jedi, tasked with her protection.\nYears earlier, she had provided the minor con-man Taxer Sundown with a similar device and dispatched him to rule over the Ten Mile Plateau on Ord Mantell in her service. With the power granted by the mind-control device, he posed as a Jedi, alienating them from the local populace. Together with Baron Sando, he was also tasked with overseeing the deportation of sentient Mantellian Savrips, which the Venan nobility favored as exclusive food.\nThe Baroness, feigning romantic affection for Qui-Gon, sent him on a quest to rescue her son, who was missing after a pirate raid. Unbeknownst to her, the ship he traveled with also carried captive savrips. Entirely unintentionally, she thus also planted Qui-Gon and his Padawan, Obi-Wan Kenobi, on the trace to her Mantellian activities, which they swiftly put an end to. Meanwhile, she used her artificial mind control to influence Supreme Chancellor Finis Valorum, effectively controlling him.\nShortly after the death of Sundown and the breakdown of her Mantellian organization, she arrived at the Ten Mile Plateau to personally put an end to the Jedi interlopers. However, it appeared she had developed some real affection for Qui-Gon, since he was able to persuade her into allowing him to join her side. The feeling was not mutual, however, as the Jedi used the first opportunity to deceive her and sever her head. With all the major conspirators dead, what remained of her scheme quickly unraveled.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vena/Legends",
  "/wiki/37_BBY/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Venan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/57_BBY/Legends",
  "/wiki/Kindoro",
  "/wiki/Vena_system",
  "/wiki/Ambassador/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Venan_civil_war",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/49_BBY/Legends",
  "/wiki/Sando_(Baron)",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Republic_Space",
  "/wiki/Jedi/Legends",
  "/wiki/Mind_control_device",
  "/wiki/Taxer_Sundown",
  "/wiki/Ten_Mile_Plateau",
  "/wiki/Sentience/Legends",
  "/wiki/Mantellian_Savrip/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Finis_Valorum/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Qui-Gon_and_Obi-Wan:_Last_Stand_on_Ord_Mantell_1",
  "/wiki/Qui-Gon_and_Obi-Wan:_Last_Stand_on_Ord_Mantell_2",
  "/wiki/Qui-Gon_and_Obi-Wan:_Last_Stand_on_Ord_Mantell_3",
  "/wiki/Category:Images_of_Omnino",
  "/wiki/Wizards.com",
  "/wiki/Before_the_Rise",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_10",
  "/wiki/The_Official_Star_Wars_Fact_File_131",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}