{
 "name": "Omze%27kehr_Kahr",
 "display_name": "Omze'kehr Kahr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sluudren"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sludir"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Omze's Incredible Traveling Starport"
     ]
    }
   ]
  }
 ],
 "content": "Omze'kehr Kahr, known as Omze was a Sludir and the older brother of Quintik Kahr.\nOmze began his career as a gladiator at the pits of Loovria, fighting with a force pike. Other gladiators were Quintik and Wookiee Broadside. It is unclear if Omze fought with Broadside. However, it is known that Omze began to hate Humans at this point, particularly gamblers betting in gladiator fights, and more specifically in fights where Omze himself fought.\nOmze eventually became a free Sludir paying for his freedom. He then decided to hack in Sienar Fleet Systems databases, on planet Byblos. To do so, he hired a Sullustan, Futor, who had been an information controller for SoroSuub until being fired on the charges of industrial spionage.\nSome time after this, Omze bought a Stelar-class Neutron cruiser, which he transformed in Omze's Incredible Traveling Starport. He added three main docking bays in the holds, each of them big enough to hold four small freighters. The decks were alive with free traders offering their products and services. Most of the traders and customers were aliens from different species, with a certain reluctance towards Humans. One of the traders was Wilam Olgreen, former leader of Olgreen Intelligence Guild during the Clone Wars. He had been boss of an illegal droid operation and he offered related products and services.\nDuring the Port's opening, Omze's brother Quintik  gave Omze a Twi'lek slave, Con'varra, a pariah exiled from his own town on Ryloth. Omze decided to free Con'varra and provide him with a paid job where he would be trained by the best hackers and forgers in the galaxy.\nThe Port traveled throughout the Mid Rim and the Outer Rim Territories, providing service and entertainment. Only Omze himself knew the route the Port would follow, and sometimes the Port left a system in a second if Omze considered it convenient.\nOmze's main majordomo was Brobius, a Bith working to keep the passengers comfortable. Jillsarian technician Golben was the chief mechanic. Omze's old fellow Broadside became the bartender for Starboard Broadside Club; Omze usually steered the Port so that the Club's window provide the passengers a good view of the system where they were. Some rumors suggested that Omze had used part of his own savings to buy Broadside's contract.\nFutor was the operator of a databank with information about all the galaxy and news services, Futor's Network. He sold his information, which was precise, current and very expensive. He also kept an ear in the cabin.\nSecurity forces were controlled by Rodian mercenary Ne'Chak, who commanded a group of Rodian men. He had trained, with surprising success, a team of Jawas in melée and ranged combat for Bantha Traxx at Lianna, which called Omze's attention. Wroonian con artist Felsing used to impersonate a noble lady with a wrongly-jailed child so that kind people would help her to infiltrate in safe areas to steal. She was seen by Ne'Chak's forces on the Port and almost captured.\nAfter Con'varra became an expert forger, he returned to Omze and founded Conv'arra's Data Central, providing quality forgeries and hacking services with a great system that could duplicate almost any document. Some rumors said that Omze himself sometimes sold information about the forgeries to some governments, specially if the customer was a Human.\nIt was rare for the Port's customers to see Omze in person, but he controlled personally all of the Port's activities.\nQuince was killed by Human smuggler Platt Okeefe and her Twi'lek partner Tru'eb Cholakk while they were trying to escape from him. Omze blamed them both for his brother's death and came to hate them, especially Okeefe.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sluudren",
  "/wiki/Sludir",
  "/wiki/Gender/Legends",
  "/wiki/Omze%27s_Incredible_Traveling_Starport/Legends",
  "/wiki/Quintik_Kahr",
  "/wiki/Loovria/Legends",
  "/wiki/Force_pike/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Broadside_(Wookiee)",
  "/wiki/Sienar_Fleet_Systems/Legends",
  "/wiki/Byblos/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Futor",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Wilam_Olgreen",
  "/wiki/Olgreen_Intelligence_Guild",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Con%27varra",
  "/wiki/Ryloth/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Brobius",
  "/wiki/Bith/Legends",
  "/wiki/Jillsarian",
  "/wiki/Golben",
  "/wiki/Starboard_Broadside_Club",
  "/wiki/Futor%27s_Network",
  "/wiki/Rodian/Legends",
  "/wiki/Ne%27Chak",
  "/wiki/Jawa/Legends",
  "/wiki/Bantha_Traxx",
  "/wiki/Lianna/Legends",
  "/wiki/Wroonian/Legends",
  "/wiki/Felsing",
  "/wiki/Smuggler/Legends",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Tru%27eb_Cholakk",
  "/wiki/Platt%27s_Starport_Guide",
  "/wiki/Cynabar%27s_Fantastic_Technology:_Droids",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Wizards.com",
  "/wiki/Kyle_Katarn%27s_Tale"
 ]
}