{
 "name": "Onaconda_Farr",
 "display_name": "Onaconda Farr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 21 BBY and 20 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Turquoise"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Council of Neutral Systems",
      "Council of Neutral Systems",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Onaconda Farr was a male Rodian politician who represented his homeworld of Rodia and the greater Savareen sector in the Galactic Senate during the final decades of the Galactic Republic. Though he was a complicated and self-conscious individual in private, Farr was an outspoken advocate for democracy and progressive causes and a devoted servant to his people, always keeping their best interests at heart. During the Clone Wars, a pan-galactic war between the Republic and its splinter state, the Confederacy of Independent Systems, Farr became a leading anti-war senator and worked with his allies to bring about a peaceful resolution to the conflict. Farr suffered personal crises throughout the war, and the mistakes he made trying to do what was right would lead to his assassination.\nIn the years before and during the Separatist Crisis, Farr worked alongside a group of like-minded senators, such as Bail Organa, Mon Mothma, and Padmé Amidala, a close friend and protégé of his, to maintain loyalty and democracy in the Republic. Early in the Clone Wars, however, Farr faced a crisis of faith when Rodia became a target for piracy, and the Republic failed to deliver aid. Desperate to help his starving people, Farr made a deal with the Confederacy through Viceroy Nute Gunray of the Trade Federation, reluctantly granting them the ability to exploit the Savareen sector in return for much-needed supplies. He became further troubled with his decision, however, when he learned that Viceroy Gunray additionally wanted him to hand Amidala over to the Separatists. Though Farr initially complied, Amidala convinced him to turn on Gunray, who they had arrested. Though ashamed of himself, Farr was welcomed back into the Republic, which sent relief aid to Rodia.\nFor the remainder of his life, Farr was a staunch loyalist to the Republic but became a leading supporter of anti-war causes and promoted diplomatic solutions to the Clone Wars. He and his faction launched campaigns to defeat one Senate bill deregulating the InterGalactic Banking Clan to increase war funds and another expanding the Republic Military, but both efforts failed. Hoping to keep the latter bill from coming into effect, Farr and Amidala introduced counter-legislation aimed at reducing the Republic's military budget and worked hard to gather the support needed to pass the bill. While celebrating what seemed to be a coming victory, however, Farr suddenly died of what appeared to be heart failure. An investigation by the Coruscant Security Force revealed that he had been poisoned by his aide, Lolo Purs, in retaliation for his brief contract with the Confederacy. The late Farr's allies pushed to pass his bill, but the motion failed in the Senate.\nA male Rodian from the Outer Rim Territories world of Rodia, Onaconda Farr came to represent his homeworld as a senator in the Galactic Senate of the Galactic Republic on Coruscant. Like other senators, Farr had several aides on his staff, including Pa Dua, Tox Don, Silood, and Lolo Purs. Farr served as a mentor to Purs, who later became Rodia's Junior Representative in the Senate at his side. As Rodia's senator, Farr was also the resident of the Senatorial Palace situated in the planet's swamps underneath a protective dome.\nSenator Farr was involved in relief work during his senatorial career, aiding planets and people plagued by disasters. Farr's relief efforts acquainted him with an educator, builder, and relief worker from Naboo named Ruwee Naberrie. Farr and Naberrie became good friends, and Farr served as Naberrie's strongest ally in the Senate. Being friends with Ruwee, Farr grew close with his family and became an uncle figure to his youngest daughter, Padmé Naberrie, when she was a young girl. Farr and Padmé shared a close bond, and she affectionately gave him the nickname \"Uncle Ono.\" Farr mentored Padmé as she grew up, and she picked up several skills in politics that would serve her well in the future, such as downplaying her strengths to maintain the element of surprise.\nPadmé became involved in Farr and Ruwee's relief work at a young age, and she joined them in 39 BBY as part of a relief mission to the planet Shadda-Bi-Boran. Shadda-Bi-Boran's sun was dying, causing ecological disaster and necessitating the relocation of it's populace. Although the relief effort managed to successfully evacuate the entire population, the refugees were unable to adapt to life because they could not replicate their homeworld's environment properly and died. Despite her father's misgivings, Padmé eventually became the Queen of Naboo and became Padmé Amidala. Farr and Padmé stayed close, and the Rodian became acquainted with the Naboo Royal Handmaidens assigned to her. Several of Padmé's handmaidens, such as Sabé, grew fond of him.\nBy 32 BBY, the Republic was under the leadership of Supreme Chancellor Finis Valorum. Valorum's administration was hampered by heightened corruption, bureaucracy, and, above all, inaction. Despite Valorum's ineptitude, he was a well-meaning man and Farr was close with the Chancellor and supported him. Valorum's reign would come to a tumultuous end, however, when the Trade Federation blockaded Naboo in opposition to his taxation policies on Outer Rim trade routes, which the Trade Federation held a monopoly on. With negotiations failing and the people of Naboo suffering, Queen Amidala traveled to Coruscant to personally plead for the Senate to act.\nFarr was present during the special session called for Amidala's testimony, during which Senator Lott Dod of the Trade Federation disputed Amidala's claims and objected to a motion to solve the incident immediately without concrete evidence. Dod recommended that a commission be appointed to study the allegations made by Amidala, which was seconded by the representatives from Malastare. Valorum presented the idea to Amidala, who suddenly called for a Vote of No Confidence in the Chancellor's leadership. Amidala's motion led to Valorum's removal, and in the aftermath of the Battle of Naboo, Senator Sheev Palpatine won the election and became his successor. Farr wished that the fall of Valorum's administration had ended differently, but did not entirely oppose his removal and remained close with Padmé.\nBy 28 BBY, Farr continued to serve in the Senate and had become involved with fellow progressively-minded senators Bail Organa of Alderaan and Mon Mothma of Chandrila. Though there were other senators involved with the trio, they formed the central leadership of their political caucus. They were each a member of various prestigious Senate committees. Farr served on committees involved in construction work and the transportation of construction materials, in keeping with his roots in relief aid. As a shared goal, Farr, Organa, and Mothma were devoted to maintaining loyalty to the Republic and its democracy, especially as the government was facing a rising amount of distrust and secrecy among its members. One of the senators Farr and his allies suspected of treasonous plans was Mina Bonteri of Onderon, who had grown increasingly separated from other senators and begun receiving heavily encrypted messages in private.\nIn that same year, Padmé's second term as Queen of Naboo ended. At the behest of her successor, Queen Réillata, she returned to a life of service when her successor and the people of Naboo asked that she represent them in the Senate after Senator Oshadam stepped down. Although he wanted to work with her as allies, Farr maintained a distance from her during her early months in office, reasoning that she would want to establish herself without having to rely on her father's connections with an old family friend. Amidala became a controversial figure during her early career, with her last appearance before the senate remaining fresh and libelous newsnet stories connected to the Trade Federation maring her reputation. The young woman also became involved with Senator Bonteri, whose secrecy had become alarming. Mothma decided to use Amidala's notoriety to their benefit. She planned a gala to be held at one of Coruscant's public gardens, where she, Farr, Organa, and other like-minded senators could speak about Bonteri in private. Mothma invited Amidala to the event, knowing that her presence would distract publicity away from them.\nSenator Farr wore an iridescent blue suit to the gala, where he met Amidala for the first time since before she had joined the Senate. Not long into the night, Farr noticed Padmé and approached her. Farr greeted her warmly and told her that it was good to be able to see her. Farr told her that he had hoped to meet her before, though he wanted to give her space. Padmé thanked him and expressed that she too wished to have met him, though wanted to make sure she didn't look dependent on her father's connections. Farr commended her choice and asked if she had been doing alright. She informed him that she had settled into her new role well, and Farr told her that if she needed anything she could always call on him if she wished. At that moment someone on the upper tiers of the gardens called down to Farr, and he politely bade Amidala farewell and took his leave. Unbeknownst to Farr, however, was that the Amidala he spoke to was not Amidala at all; deducing that Mothma wanted her to be a distraction, Padmé had asked Sabé to act as a decoy for her at the party. Sabé dressed the part of Senator Amidala, while Padmé disguised herself as a handmaiden. Despite this, Sabé felt comfortable talking to Farr, though she was not used to his and Padmé's close physical spacing. Sabé saw her interaction with Farr as a great accomplishment, given how he had known Padmé longer than anyone on Coruscant and she had successfully fooled him.\nLater in the evening, Farr joined Mothma, Organa, and several other senators in one of the more secluded biomes of the garden, the jungle section. The thick foliage gave them an added security to speak freely without being bothered by newsnet droids, and the group began discussing Senator Bonteri. Farr believed that Bonteri couldn't be trusted, citing her heavily encrypted talks with unknown people, and Organa noted that she had recently been trying to recruit the nonpartisan Padmé to whatever it was she was doing. Mothma suggested that they let Bonteri do so, then they would try to convince Padmé to tell them what she was up to. Farr disagreed with Mothma and said that Padmé was not gullible enough to be unaware of what they would be trying to do if she did side with Bonteri. Mothma questioned if she would be willing to stand with them, and Farr assured her that both Amidala and Naboo were loyal to the Republic. Organa suggested that they would be better off asking Amidala outright what Bonteri was attempting to do. Agreed, the group split and reentered the party. Shortly after his conversation with Farr and Mothma, Organa ran into the disguised Amidala and recognized her. The two walked through the gardens together, and he convinced Padmé to consider joining forces with him, Farr, and Mothma.\nIn the months after the gala, Amidala fell in with Farr and his allies, and the barrier they had set up between themselves during her early tenure fell. Now officially allied, Amidala often came to Farr for advice, where she could speak without having to filter herself to a fellow delegate but freely to an old friend. In a show of good faith, Organa, Farr, and Mothma used their connections and political clout to clear Padmé of the libelous newsnets reports that clouded her first months in office in controversy. Although Padmé had chosen to side with the relatively progressive caucus led by the three, she was unsure of her own positions and remained decidedly nonpartisan, a stance that clashed with Mothma's somewhat extreme policies. She joined the committee for the transportation of construction materials, where she and Mothma argued consistently, especially over the armament of Republic ships to curb piracy.\nFollowing a debate she and Mothma had one day, Padmé went to Farr for advice. Padmé had been having a crisis trying to understand her private and public personas, as well as cementing her positions. In a rare moment of vulnerability, she confessed her insecurities to Farr. Padmé viewed Farr not as a colleague but as a family friend, which made it easier for her to speak openly to him. Padmé told him that she was struggling to understand her positions and felt as though she didn't know who to be in front of her colleagues. Farr told her that it was alright to be unsure, emphasizing that it was better to be aware of naïvete than to ignore it. Farr reassured her that being honest about her opinions did not make her a poor senator and that she would find the balance between how she acted in private and how she acted in public. When Amidala asked what she would have to do if she didn't do it fast enough, Farr insisted that she would have plenty of time to figure it out.\nThe growing disloyalty in the Senate led way to a major rift in the Republic in 24 BBY, when Count Dooku of Serenno, a former Jedi Master, delivered the Raxus Address, a speech that denounced the Republic as a futile enterprise riddled with corruption and favoritism which harmed outlying systems to the benefit of the Core Worlds. As had been feared by Farr and his allies, many dissatisfied members of the Senate began an exodus from the Republic and joined the nascent Confederacy of Independent Systems, a new galactic government headed by Dooku. Amid this crisis, Farr joined Organa, Amidala, and Mothma as member of the Loyalists, promoting loyalty to the Republic and aiding Chancellor Palpatine to maintain cohesion. The Senate additionally passed the Emergency Powers Act, allowing Palpatine to remain in office after his term expired until the crisis was over.\nAs the Confederacy continued to expand and the threat of conflict loomed, the Republic Senate began debating the necessity of raising a proper military in the event the crisis led to open war. A bill was proposed in the Senate by 23 BBY titled the Military Creation Act, which would give the Republic the ability to commission a Grand Army of the Republic. The Loyalist faction was opposed to the bill, and Amidala emerged as the leading face of the opposition movement, spending almost a year fighting to defeat it.\nAmidala's opposition to the Military Creation Act made her a target for assassination, and on the day the Senate was scheduled to vote on the bill in 22 BBY, her ship was bombed as it landed on Coruscant. Amidala managed to evade death by posing as a pilot, but a decoy and several guards were killed in the explosion. After a second attempt on her life failed, she was removed from Coruscant for her own safety. In her absence, Naboo Representative Jar Jar Binks was easily manipulated by proponents of the Military Creation Act to propose that the Senate grant Chancellor Palpatine emergency powers to combat the Confederacy, including the ability to raise an army without needing to pass the contentious bill. Farr and his aides were present in the Senate chamber when Binks introduced a motion to expand the scope of powers granted to the Office of the Chancellor by the Emergency Powers Act, enabling Palpatine to bypass the Military Creation Act and form the Grand Army of the Republic himself. The motion passed the Senate, and the Republic gained an army of clones from the Kaminoan government. Shortly after the army was adopted, the first battle between the Republic and the Confederate armies took place on Geonosis, and the Clone Wars officially began.\nThe effects of the war spread immediately, and Rodia began to suffer under the Republic's new wartime provisions. An increase in piracy in the system left Republic supply ships ransacked and destroyed, leading to a supply shortage on Rodia that began to harm the planet's civilians. As Republic aid to the situation became more and more difficult for Farr to obtain, he became increasingly troubled and distant from his colleagues in the Loyalist faction. Many of his longtime associates, including Amidala, noticed that he had begun acting strangely and started treading around him carefully, but they were not yet worried about his condition. In the first weeks of the war, one of Padmé's handmaidens, Dormé, warned Sabé to do so while she was temporarily impersonating the senator. Farr continued to attend events with his faction, including a soiree hosted by Organa shortly after the Battle of Geonosis.\nDuring the early days of the war, the Separatists under Dooku seized control of several major hyperspace lanes, separating the Republic from a majority of its clone armies fighting in the Outer Rim Territories. To undo this setback, Chancellor Palpatine sought to secure an alliance with the Hutt Clan, a criminal organization that held control over crucial space lanes that would help the Republic continue to flow across the galaxy. One of Dooku's underlings, Asajj Ventress, kidnapped the son of a powerful Hutt leader, Jabba Desilijic Tiure. Jabba sent out a call to both the Republic and Confederacy, offering an alliance in return for his son. Senator Farr and a veteran diplomat, Senator Kharrus of Kinyen, met with Chancellor Palpatine in his office during the crisis, where Jabba contacted the Supreme Chancellor. Jabba demanded to know why the Jedi were not looking for his child, and Palpatine assured him that there were Jedi on their way to find him. The Hutt then threatened the proposed alliance, stating that if the Jedi did not find his son, the Republic would not gain access to Hutt territories. The Jedi were able to locate Jabba's son on the planet Teth and deliver him to Jabba on Tatooine, and the treaty between the Hutt Clan and the Republic went forward as promised.\nAs the Republic continued to not act on the supply crisis on Rodia, the planet's people began to starve, and Farr felt that the Republic had abandoned them. A measure was debated in the Senate to send a relief effort to aid the starving Rodians, but the vote was postponed, and Farr was left without any Republic aid. Rodia's famine led Viceroy Nute Gunray, a Confederate leader, to realize that this crisis marked a perfect opportunity to turn Rodia away from the Republic. Gunray reached out to Farr with the promise of sending immediate aid to the starving world, including food, ships, and protection from future pirate attacks. Farr, disillusioned with further seeking help from the Republic desperate to gain access to aid for his people, accepted Gunray's offer, including his one condition: capture Senator Amidala and turn her over to the Separatists. On the pretext of asking for Republic aid, Farr contacted Amidala and personally asked her to visit him on Rodia. She agreed and prepared to go on a diplomatic mission to ensure Farr's loyalty to the Republic.\nSenator Amidala, along with Naboo Junior Representative Jar Jar Binks and protocol droid C-3PO, traveled to Rodia to meet with Farr. Amidala met with Farr alone at his palace, guided by the latter's aide, Silood. Amidala greeted Farr in Rodian, and the two shared a warm welcome. Farr expressed his concern that she would not have shown up, but Amidala told Farr that both he and Rodia were important to her, as well as the Republic, and that she would not have denied helping him. Farr questioned the Republic's care for Rodia in response, however, pointedly asking where the government was when Rodia's supply ships were destroyed, and its people starved. Padmé tried to ease Farr by telling him that the Republic would vote to send supplies to Rodia. Farr took this moment to tell her that he had accepted help from Nute Gunray and explained the benefits he was getting from the deal. Amidala furiously told him that Gunray would only bring the war to Rodia, just as he had done to Naboo years earlier. Farr dejectedly told Amidala that he had already agreed to do all that he could for his people, and several B1-series battle droids entered the courtyard and surrounded the senator.\nFarr activated a hologram of Gunray, who confronted Amidala and gloated in her capture. Amidala managed to briefly contact C-3PO, but the droids gripped her arms and destroyed her comlink before she could alert him. Farr apologized to Amidala and told her that he didn't have a choice. Amidala replied that he always had a choice and tried to appeal to him, but Farr did not answer back. Gunray thanked Farr for his work and told him that he would arrive within the hour to deliver supplies. While a squad of battle droids attempted and failed to capture Binks and C-3PO, Farr led Amidala to prison atop a tower in his palace. As they approached the tower complex, Amidala again tried to appeal to Farr and told him that it was not too late for him to change his mind. Farr again solemnly ignored her pleas. As Amidala was brought inside her cell, Farr lightly protested the battle droid's use of chains. Farr was informed that it was a request from Gunray. As her cell door closed, Amidala asked Farr whether or not his actions would be worth it, and the senator looked away in shame.\nAs Farr prepared to leave the prison, Silood arrived and informed him of Gunray's arrival. Farr asked Silood what had happened with Binks and C-3PO, who has inadvertently escaped their capture and were hiding in the wreckage of Amidala's ship. Silood told Farr that there were no signs of them. Farr was glad that there were no signs of them and assumed they had fled into the jungle. Shortly thereafter, Farr went to a hangar bay to meet Viceroy Gunray as he departed his ship. Farr and his welcoming convoy greeted Gunray and expressed gratitude for coming. Gunray, however, immediately demanded to see Senator Amidala. As Farr, Gunray, and their respective guards left the hangar and started towards the detention tower, Binks and C-3PO were spotted by a battle droid nearby. The droid mistook Binks, who was wearing a cloak, as a Jedi and the frightened Gunray ordered his droids to open fire. Binks managed to slip through a grate into the water below the palace. Gunray ordered that an alarm be sounded and that they find the Jedi.\nWith C-3PO taken away and no sign of Binks, Farr and Gunray resumed their journey to Amidala's cell. Along the way, Farr inquired about when he could expect the supplies he was promised. Gunray informed Farr that his request for supplies would be taken into consideration after Amidala's execution. Farr was shocked by this revelation and tried to reason that because she was a prisoner of war, Amidala could not be executed. He was unable to convince Gunray, and he and Silood stayed back a few meters behind Gunray, where Farr told his aide that Amidala was right and that he had made a terrible mistake. Farr decided that he and his aides had to appease Gunray so as to try and still gain supplies from his deal but secretly hoped the Jedi would arrive to help them.\nAs Farr and Gunray approached the prison tower, one of the droid wardens told them that Amidala had escaped her cell. Binks, who had climbed the tower to free her, was spotted just seconds later along the walkway to the cell chamber. Gunray again ordered his droids to fire on him, but again Binks escaped. Padmé was captured shortly after, as was C-3PO. Unknown to Farr and Gunray, however, was that C-3PO had managed to contact the 41st Elite Corps and request help. Amidala and C-3PO were line up along a wall, and a trio of droidekas rolled out and formed an execution squad. Farr pleaded with Gunray to spare them, but his protests were silenced by the Viceroy. As the droidekas prepared to open fire, Farr noticed Binks in the distance and distracted Gunray by pointing him out. Gunray ordered his droids to fire at Binks, but a Kwazel Maw the Gungan had befriended underneath the palace rose up from the waters and attacked Gunray's forces. The Viceroy ran towards his ship, but the creature destroyed it before he could reach it. Binks and Amidala cornered Gunray, who ordered Farr to kill them.\nFarr instead aimed his blaster at Gunray. Farr revoked his decision to join the Separatists and confirmed to Amidala and to Gunray that he was loyal to the Republic, and placed Gunray under arrest. Gunray warned Farr that he would pay for what he had done. The Republic forces C-3PO had contacted arrived moments later and took Gunray into custody. With Gunray under arrest, Farr thanked Binks, who he believed was still a Jedi, for what he had done. Farr, Amidala, and her companions were contacted by Chancellor Palpatine, who told Farr that after the capture of Gunray and the testimony of Amidala, the Republic would send a convoy of supply ships to Rodia immediately. When the Chancellor's transmission ended, Farr turned to Amidala and asked if she could forgive him for his mistakes. Amidala told Farr that it was the Republic who should be thanking him for his loyalty and value as an ally.\nAfter his brief decision to join the Confederacy, Farr fully reintegrated himself into the Republic, and once again began to work closely with Amidala, Mothma, and Organa as an outspoken proponent of peaceful solutions to the war, despite his tenuous relationships with them earlier in the conflict. Farr's anti-war stances made him a target for the campaigns of militarist senators such as Mee Deechi of Umbara and Halle Burtoni of Kamino. Although Deechi and Burtoni had different opinions of Farr, with the latter showing respect for his colleague, they both saw Farr as an easy tool to use in their advertisements and propaganda and eagerly used his public statements against him. In addition to his support for a peaceful end to the war, Farr was a member of the Council of Neutral Systems, a group of fifteen hundred systems that advocated for neutrality under the leadership of Duchess Satine Kryze, the ruler of Mandalore. Sometime before the Republic discovered Separatist plans to build a new droid foundry, Farr and Senator Kin Robb of Taris had dinner in the Senate building's dining commons.\nWhen the Mandalorian terrorist organization Death Watch was rumored to be connected to the Confederacy, the Republic proposed that they occupy the neutral world to end the threat. Duchess Satine Kryze greatly opposed a Republic presence on Mandalore and planned to travel to Coruscant to argue before the Senate against the planned occupation. Kryze invited Senator Farr to join her on her voyage to Coruscant aboard her yacht, the luxury liner Coronet. Along with Farr were his fellow Council of Neutral Systems members Kin Robb and Tal Merrik of Kalevala, as well as Orn Free Taa of Ryloth. Farr traveled to the Mandalorian capital city Sundari to meet with Kryze and her retinue as they prepared to board the ship. Although it was against Satine's wishes, Farr and the other senators requested the presence of Jedi and Republic forces. In addition to Kryze's guard, the Jedi Obi-Wan Kenobi and Anakin Skywalker were brought aboard the Coronet as protection, along with a squad of clone troopers. Kryze and Kenobi had a complicated history together, and Farr and the other senators were unprepared for the tenuous trip ahead of them.\nSoon after the Coronet's departure, Farr, Kryze, and the other senators enjoyed drinks in a sitting room, where the duchess addressed her guests about the intolerability of war. Kenobi and Skywalker entered the room as she was speaking, and Kenobi proposed a pro-war counterargument. Kenobi's interruption annoyed the duchess, and the two spent some time bickering about their respective points of view. Despite the efforts of Senator Free Taa, the two remained at odds and became confrontational. The tensions began to dissipate when Senator Merrik suggested they all prepare for dinner, which both the Duchess and Jedi agreed to. Later on, Farr joined the Duchess and his fellow senators for dinner. Shortly into their meal, however, they were alerted that there was a security issue. Skywalker and the clone forces had located an empty container in the cargo hold, from which several probe assassin droids had escaped.\nSkywalker contacted Kenobi and warned him that one droid had escaped the cargo hold and was heading up the lift towards the dining room, alarming Farr and the others. Obi-Wan ordered them to back away from the lift, and they went to the far side of the room, opposite the lift. The droid then broke open the doors, killing two of Duchess Kryze's Protectors and making its way across the dinner table. Kenobi managed to destroy it with his lightsaber, only for tens of smaller probes to eject from the larger droid. Farr and the other senators tried to evade the droids as Kenobi and Kryze destroyed them together, eventually clearing the room of the threat. Once the droids were destroyed the senators regained their bearings and calmed down as the chaos subsided.\nWith the threat seemingly over and Kryze and Kenobi reconciled, Farr and the other senators later reconvened for dessert. They had not been seated long before Kenobi entered carrying a dish which Senator Free Taa assumed to be dessert, though the Jedi pulled back a cloth covering the dish and revealed that he was carrying a surviving probe droid. Kenobi explained that the assassin probes had been brought on board the Coronet under the seal of the Senate and that he believed the droid would attack Duchess Kryze and anyone besides the senator who had brought the crate on board. Kryze objected to Obi-Wan's use of interrogation but assured her it was perfectly safe. Obi-Wan first noted the droid's violence against Senator Free Taa, before holding the dish up to Farr and clearing him of any blame.\nThe droid next exerted hostility towards Senator Robb and especially Kryze, before falling still in the presence of Senator Merrik. Merrik flipped the tray out of Kenobi's hand, freeing the droid in the process. The droid scurried towards Kryze, but Kenobi managed to bat it away with a dish. The droid landed near Farr and attacked the Rodian. As Farr scrambled to get the droid off him, Merrik used the distraction to kidnap Kryze and leave the room. Kenobi destroyed the probe before it could harm Farr, then left the room to follow Merrik and Kryze. Farr and the other senators remained away from the ensuing firefight, during which Kryze was safely rescued and Merrik was killed.\nThe Coronet arrived at Coruscant sometime later, where Duchess Kryze and her guests departed the ship and met with Chancellor Palpatine. The ordeal finally over, Farr, Free Taa, and Robb boarded a transport with the Chancellor and departed for the Senate. Farr and his colleagues were later present when Duchess Satine presented her case for neutrality before the Senate, where a doctored testimony from Mandalorian Deputy Minister Jerec of her Mandalorian Government Council persuaded a majority in the Senate to vote in favor of occupation. After managing to gain access to the original testimony at great personal risk, Kryze convinced the Senate to rescind its vote and won continuing neutrality for her people. Sometime later, Farr was present in the Senate chamber to listen to Pantoran Senator Riyo Chuchi's testimony against the Trade Federation, which had blockaded Pantora under the false pretense the planet owed them a large debt. Following the session, Farr walked down the halls of the building with Padmé's protocol droid, C-3PO.\nIn an attempt to give Chancellor Palpatine and the Republic the unprecedented and broad powers to spy on citizens suspected of being Separatists, a bill was introduced to the Senate ironically titled the Enhanced Privacy Invasion Bill. The bill was opposed by many anti-war senators, among them Farr. Senator Philo invited Farr to a meeting in one of the Senate Office Building lobbies, where several other senators were to join forces in opposition to the bill. Among those also invited were Senators Amidala, Robb, and Organa. At the informal meeting, the gathered senators agreed to oppose the bill and keep it from passing the Senate floor. While this meeting was taking place, a group of bounty hunters, led by Cad Bane, forced their way into the office building to take a group of senators hostage.\nBane had been hired by the Hutt Clan to take Republic senators hostage in order to force the Republic into a prisoner exchange. Surrounding the senators, Bane informed them of the situation and advised them not to fight back. Philo, however, refused to listen to the bounty hunter and began his way to the door, only to be shot and killed by Bane. The seriousness of the crisis known, the other senators did as Bane asked. Bane contacted the Chancellor to demand the release of Ziro the Hutt in exchange for the kidnapped senators. When the Chancellor refused, Bane had his group shut down the building's power in retaliation, cutting the Chancellor off from contacting anyone for help. Bane ordered his hunters to search the senators, taking their comlinks and making sure none of them had any weapons.\nBefore Bane's hunters could search Padmé, who was in possession of Anakin Skywalker's lightsaber, Skywalker himself was spotted by Bane watching from an upper level. Bane fired several shots at the Jedi, who slipped away. After evading capture for a short while, Skywalker was found and knocked unconscious by the bounty hunters. The hunters dragged Skywalker into the lobby with the other hostages, where Bane installed a series of bombs on the pillars in the room. The bombs emitted a detection laser that surrounded the senators, which, if triggered, would kill the hostages. Chancellor Palpatine had Ziro freed from prison, though he had Republic forces surround the Senate building to capture Bane. One step ahead, Bane told the Chancellor that if he was arrested, he would set off the bombs and kill the hostages. In the lobby, Farr and the other senators remained still, unsure of what to do.\nSkywalker regained consciousness and asked what had happened. Farr informed him that Bane ordered them to stay put, which he recommended they do. Skywalker told Farr that it was not a good idea and took his lightsaber from Amidala. Striking the blade through the floor, Skywalker cut a hole around the senators, sending the floor they were standing on crashing down to the level below. Skywalker's maneuver saved the senators, as just when they fell through the floor, Bane set off the bombs during his escape. The senators fell to the ground, though none were seriously injured. Farr helped C-3P0 to his feet, then joined the other senators as they got their bearings. In the aftermath of the hostage crisis, the privacy invasion bill faced harsher scrutiny and even galvanized a political resistance movement. Once the unpopular bill reached the Senate floor, it was soundly defeated and failed to pass.\nAs the war raged on and the Republic military faced heightened casualties and fewer victories, the Senate convened to debate the cost of the war. The debate was largely unproductive, with senators forced into partisan lines. The more militarist caucuses argued that an increase in clone trooper production was needed while anti-war senators were wary about continuing the war without considering the Republic's poor financial state. Led by Senator Organa, Farr was among this group, alongside Amidala and Senator Mothma. During the contested debate, Senator Gume Saam, a representative of the Techno Union, proposed a bill that would allow the Republic to open new credit lines with the InterGalactic Banking Clan. This deregulation would give the Republic the necessary funds to produce more clones, but at the cost of services not related to the war.\nWhile Organa and Mothma argued against Saam's bill on financial grounds, they were unable to deflect Senator Lott Dod and Senator Halle Burtoni's promotion of the bill. With the Senate in open bickering, Amidala entered the fray and argued that the deregulation would not only be fiscally irresponsible but also morally reprehensible. Amidala proposed that, instead of leading the Republic further in war, the Senate open communication with the Confederacy for negotiations to take place. Amidala was immediately accused of treason, though Organa was able to adjourn the Senate by suggesting to Vice Chair Mas Amedda that they postpone Saam's emergency bill until the financial cost could be properly reported to the body.\nEager to sue for peace despite the animosity she received in the Senate, Padmé undertook a covert mission to the Confederate capital, Raxus Secundus, to meet with her old friend and now-Separatist, Mina Bonteri. Bonteri presented a peace initiative to the Separatist Senate, where it received enough support to be put into motion. Back on Coruscant, Amidala presented the motion to the Republic with the support of Farr, Organa, and Mothma. As explained by Amidala and Organa, the fact that the Separatists were willing to reach out in peace was a sign that the deregulation of the banks was not needed and ill-timed.\nWhen Amidala and Organa were done presenting their case, Farr stood from his pod and called for the Senate to immediately vote down Saam's bill. Amedda put forth Saam's bill for voting, but while the results were tallied the power in the Senate chamber went out. As had been ordered by Saam, Dod, and Banking Clan representative Nix Card, and arranged by Separatist General Grievous, Coruscant's Central power distribution grid was bombed, setting off an explosion that resulted in a planetwide blackout and the sabotage of the peace talks. When the Senate confirmed that the attack had been arranged by the Separatists, Saam reintroduced his bill to the floor with overwhelming support from the congress. Despite Amidala's pleas, Chancellor Palpatine personally announced his support for deregulation.\nWith the peace talks in shambles, the militarist and corporate caucuses of the Senate continued to push for an increase in war spending. Farr, Amidala, Organa, and Mothma found themselves increasingly scrutinized as a majority of the Senate argued against peaceful negotiations. During another contested and fiery debate, Senator Burtoni put forward an emergency appropriations bill drafted by the Kaminoan government that would allow funds for an additional five million clone troopers. Amidala attempted to persuade the Senate that the bombing attack had been meant to destroy the peace talks, though she was again called a traitor and found little support. Farr looked to Amidala, saddened by the verbal assault levied against her. While Chancellor Palpatine attempted to ease the Senate into listening to her, he received word that Separatist Head of State Count Dooku had sent him a message. Playing the message before the Senate, the body was informed by Dooku that an alleged Republic attack had killed Bonteri, and the Count formally recalled the peace initiative. When the news of Bonteri's death broke, Amidala looked to Farr and the two shared a glance as any hope of peace had died.\nFollowing the Senate meeting, Farr joined Amidala and Organa as they walked to the latter's office. Amidala was distressed at the news of Bonteri's death and questioned why the Republic would target her. Organa revealed to Farr and Amidala that Republic spies had discovered that Bonteri was actually murdered by Dooku's thugs. Farr apologized to Amidala for her loss, and Organa told her that they had to work harder to defeat Burtoni's bill in order to make sure she didn't die in vain. Organa told Amidala and Farr that in order to line up support against the bill he would need ammunition against it. Farr attempted to lighten the mood by jokingly reminding the two that they couldn't afford ammunition, but his joke fell flat. Organa asked Amidala to speak to the Banking Clan to find out how much interest they were planning on charging for the loan. Amidala asked Farr to join her, reasoning that he knew the Banking Clan representatives and snidely telling him that he owed her for telling a bad joke.\nFarr and Amidala went to the office of Banking Clan representative Mak Plain, where the Muun told the pair that the bank was going to charge the Republic at an interest rate of twenty-five percent. Farr and Amidala were outraged, and Farr pointedly told Plain that such a high charge was outright theft. Amidala was confused at the high charge, given that the Banking Clan's arrangement with the Republic was at a standard interest rate of ten percent. Plain asked both Farr and Amidala to calm themselves and explained that after deregulation, the same rules no longer applied. Plain also informed the two that the Separatists had no issue with the rate hike and had secured a loan to fund nearly three million credits to fund their armies. Farr muttered that the Separatists would wipe the Republic out with their increase in battle droids, and Amidala asked Plain why the Banking Clan would fund Dooku. Plain waved away their questions and stated that the Banking Clan had no stake in the war and that what happened on the battlefield was of no concern to them.\nFarr and Amidala's inquiry into the Banking Clan proved helpful to Organa, who realized that the twenty-five percent interest rate would not only force the Republic to continue to operate in debt but also force the government to defund services unrelated to the war effort. Although he now had the ammunition he needed, a new problem arose as several senators had received threats warning them to vote in favor of the bill. Later that night, Farr was walking in the Monument Plaza when a mandatory blackout was put into order. As he walked down the center of the plaza, he was jumped by two thugs, Robonino and Chata Hyoki. Robonino grappled Farr to the ground while Hyoki kicked him in his side. Although he survived the attack, Farr ended up with a broken arm. The next day, while Amidala and Organa were attempting to sway more senators to their side, Farr walked up to them and revealed his arm, now being kept in a sling. Amidala told Farr that they had to do something about it, but all he said in reply was that the attack would not change his mind and that he would continue to support the defeat of the bill.\nSometime later, he and Amidala paid a visit to Senator Christo at his apartment in an attempt to gain his vote. Farr parked his speeder just outside Christo's home, while Amidala was dropped off by her driver. Inside, Christo was unmoved by their attempt to reach him ideologically, believing that it was not worth being beaten up just for one vote. Farr told Christo that his arm would heal, but that the lives of those dying in the war would not. Christo again swatted this away, telling Farr that the clones were created for that purpose. Amidala tried to reason that the clones were people, but was told by Christo that the people he cared about were the ones who put him in office, angering Farr. Farr asked Christo when the last time he spoke to his constituents was, but the Quarren deflected the question and pointed it back at him. As it became clear that he wouldn't sway to either Amidala or Farr, Christo asked the pair what Organa believed about the issue. Amidala told him that Organa was preparing to speak before the full Senate, and Christo told her that he was willing to hear what he had to say.\nTheir attempt to gain Christo's vote having failed, Farr and Amidala departed the senator's home. Amidala was optimistic despite their failure, believing that once Christo and the other undecided senators heard what Organa would say in his speech, they would join their side. Farr offered to give Padmé a ride, but she declined and instead told him that she would walk to her speeder, which her driver had parked a block away. Farr protested because of the attacks, but she told him that she could defend herself and he asked her to be careful. While Farr left in his speeder, Amidala walked down the street, where she was jumped and nearly killed by Robonino and Hyoki. After a lengthy chase on a stolen speeder bike, she managed to escape the pair but found herself held up by police while the bounty hunters escaped.\nThe next day, Organa was targeted by the two thugs in a garage in the Senate building. Although the two were arrested by Organa's guards, Organa himself ended up seriously injured when his speeder crashed into a wall as he attempted to escape. Organa had his guards contact Farr, who found Amidala in the halls of the Senate and brought her into his office. A medic with Bail told Farr and Amidala that he was in no condition to give his speech. Farr ordered the medic to take Organa to take him to the hospital immediately, and before their call was ended, Organa asked Padmé to speak in his place. The Senate, meanwhile, had already convened and was awaiting Organa to present his case before the full congress. Although the supporters of Burtoni's bill urged the Senate to move forward with the vote, Mothma stalled them and told them that the opposition had to speak before they moved on.\nIn Amidala's office, Farr tried to convince Amidala to speak in Organa's place. Padmé was nervous, given that Organa had more weight to his words and was the person undecided senators had been waiting to hear. Onaconda told Padmé that she too had respect in the Senate, though she reminded him that her politics had largely been partisan during her career, and she did not carry the same clout as Organa. Amidala's aide, Teckla Minnau, arrived to dress her for her speech, and she gave Padmé the necessary confidence by telling her that she could be able to sway more to their side because she listens to the people of the Republic, not just the elite in the Senate. In the Senate chamber, Mothma's stalling had just about failed as Vice Chair Amedda was preparing to begin the voting. Amidala arrived moments later and announced that she would be speaking on Organa's behalf. Once given the floor, Amidala gave a speech inspired by Minnau's personal struggles. Amidala's speech was a passionate defense of basic social amenities, during which she argued that the increase in war spending would come at the cost of the citizens of the Republic, many of whom on Coruscant watched her speech as it was broadcast on the HoloNet. Once she finished her speech and called for the Senate to defeat Burtoni's bill, she received rousing support from many in the chamber, including Farr, who congratulated her and eagerly joined the applause.\nAlthough Padmé's speech against the increase in clone forces was well-received, it was not enough to stop Burtoni's bill from passing the Senate. Despite their failure to stop the bill from passing, Farr and Amidala proposed counter-legislation to reduce military spending and keep Burtoni's bill from ever coming into effect. With aid from Organa and Mothma, Farr and Amidala began their efforts to gain enough votes to pass their bill. Farr himself was the leading promoter of the bill and was successful in convincing many senators to support it, though they were still in need of more to gain a majority. The day before Amidala was scheduled to speak before the Senate in support of the bill, Farr traveled to the docks for a clandestine meeting, where a mysterious figure tried to frighten him out of continuing the peace effort. Despite the threat, Farr remained stagnant and committed to getting his bill passed.\nThe next day, Farr was present in Padmé's office alongside Mothma and Purs. After meeting with Duchess Satine, who was present on Coruscant, Padmé spoke with Senator Stonk via hologram. When Padmé ended her call with Stonk, Lolo asked if they had lost another vote. Padmé confirmed it, adding that he was sorry for his inability to support the bill. Purs was annoyed at this and exclaimed that sorrow wouldn't help them. Farr calmly poured himself a glass of wine and said that when Padmé addressed the Senate in her speech, she would be able to get the votes they needed by inspiring their colleagues to do what was right. Amidala told Farr that she hoped he was right. Purs addressed Farr in Rodian, saying that he was the most influential man on Rodia. Farr longingly looked to the ground and told Purs that even if he was an influential man, what mattered to him after all the mistakes he had made was to help bring about peace. At this time, the Senate had been gathered and was prepared for Amidala's speech. Organa entered Padmé's office and told Farr and the others of this, and they left for the chamber.\nWhile walking towards their respective senate pods, Farr told Amidala and Organa that he was excited about the former's speech. Padmé joked that she wouldn't call it exciting, suggesting that the word terrifying was more applicable. Farr turned to Organa and told him to pay her no mind, explaining that Padmé always downplayed her strengths, even as a child. Farr said that this helped her maintain the element of surprise. Padmé warmly turned to Onaconda and told him that she had learned the trick from him. In the Senate chamber, Amidala's speech was well-received and gained applause from the congress. Farr joined her, along with Mothma, Organa, and Purs, in her office following the session to celebrate. Purs poured them each a glass of wine, and Farr offered a toast. Farr told Padmé that she had turned the tide, and Mothma complimented her as well. Padmé suggested to them that they had to wait until they won to call it a victory.\nSuddenly, the group was interrupted by Burtoni, who had entered Amidala's office uninvited. Burtoni agreed with Padmé that they shouldn't celebrate yet, angering the Naboo senator. Padmé told Burtoni that they were having a private meeting, but Burtoni accused them of being Separatists conspiring together. Mothma's attempt to ease them both failed, and Farr addressed Burtoni directly. Farr told the Kaminoan that although her people had bartered the clone army in exchange for a seat in the Senate, she did not have free reign to go wherever or do whatever she pleased. Farr sent Burtoni away, but before leaving, she looked to the group and told them that the war would not end soon.\nFarr rejoined the group after sending Burtoni away, and Mothma commended his efforts in leading the bill. Farr simply told her that he was just trying to do what was right, though he despondently added that he wished he could have done so earlier in the war. Mothma placed her hand on his shoulder and waved away his regrets, telling him that what mattered was that he was doing so now. Organa raised his glass and proposed a toast to their victory and an end to the war. With the exception of Purs, the senators toasted and drank their wine, but after drinking Farr became dizzy and complained that his heart was in pain. Moments later, Farr said that he couldn't breathe, then fell to the ground, dead. Mothma ran out of the room to get help while Amidala screamed frantically as she held his body.\nFarr's death became a case in the Coruscant Security Force, and Lieutenant Tan Divo immediately ordered for Farr's body to be autopsied. Farr's body was autopsied by forensic science commander V2A DAZ, who discovered the chemical trace of poison in his bloodstream. The poison, which was of Kaminoan origin, only affected Rodians, and in V2A DAZ's report the droid concluded that Farr had been murdered. The discovery of the poison led the CSF to open an investigation under Lieutenant Divo. Following Farr's death, a small funeral ceremony was held on a floating landing platform in Coruscant's atmosphere. The funeral was attended by many of Farr's close friends and colleagues in the Senate, including Amidala, Organa, Mothma, Robb, Deechi, Riyo Chuchi, and Free Taa, as well as Chancellor Palpatine and Vice Chair Amedda. Others in attendance included Duchess Kryze and her Mandalorian Protectors, Farr's aides Silood and Purs, and leading members of the Jedi High Council. Silood gave a eulogy at the service, during which he reflected on how Farr knew better than anyone of his own mistakes but was nonetheless a devoted leader to his planet and his people. Following Silood's speech, he accompanied Farr's casket onto a shuttle while Senate Honor Guards performed an arms salute.\nAfter the shuttle left, Organa approached Amidala and offered help if she needed anything, but she rebuffed him and told him that what they needed was to pass Farr's bill. Amidala then walked over to Purs, who was distraught and told Amidala that she was unsure what to do without Farr's guidance. Amidala embraced and consoled her and said that no one could replace him. Moments later, they were both told that they had been summoned to the Chancellor's office.\nUpon arriving, Amidala and Purs found the Chancellor, Vice Chair, Organa, and Mothma surrounded by a contingent of Coruscant Security Force police droids. Palpatine introduced Inspector Divo, who asked the two if they knew of anyone who hated Farr enough to kill him, confusing them. Divo explained that Farr hadn't died of heart failure but rather had been poisoned. Amidala and Purs argued that Farr had no enemies, and even his political opponents respected him. Despite the senators' protests that no one could have hated Farr to the point of murder, Divo believed that one of Farr's secrets must had come out or a mistake had returned to haunt him, prompting someone to eliminate him. After the meeting, Organa, Mothma, Purs, and Amidala began walking towards the latter's office. Mothma questioned who could have wanted Farr to be hurt, but Purs told them that they were all being targeted. Organa told Purs that speculation was not helpful, instead telling the others that they had to work harder to pass Farr's bill. Amidala, however, suggested that they postpone the vote until they knew what had happened to Farr.\nBehind closed doors, Amidala told them that a delay would help them conduct their own investigation into Onaconda's death, despite Divo's ongoing case. At Mothma's urging, Amidala decided to allow Organa to help her. The two first went to Senator Deechi's office to question him and Burtoni. Deechi laughed at the idea of either of them killing Farr, and Burtoni coldly joked that, since Farr was often used in their fundraising campaigns, neither would kill their best source of income. Deechi told Amidala and Organa that he greatly respected Farr despite their differences and gave them what information he knew. Deechi revealed he had been secretly having Farr followed, and because of this, knew about Farr's secret meeting at the docks the night before he died.\nWith Deechi's tip, Amidala and Organa traveled to the docks to look for any clues as to what happened. While there, Organa told Amidala that using their investigation to bury her grief over Farr's death was not a good idea, angering her. He asked why she couldn't leave it to Lieutenant Divo, though before she could answer, a hooded figure tried to kill them by dropping a large shipping crate from a crane. After a brief firefight and a failed attempt to capture the mysterious person, the CSF arrived and Divo berated them for intervening in his investigation. Again, despite Divo's urging, Amidala and Organa left to continue their investigation after surmising that Deechi had set them up. Once they reached Deechi's office, however, they found the Umbaran senator dead, stabbed to death in his chair. With another Senate murder case opened, Divo ordered that senator be confined to their offices under CSF security. Divo had Amidala, Organa, Mothma, and Purs in one room, though Purs protested and left. Amidala told the inspector that Burtoni had been in their meeting with Deechi, and Divo went to question the Kaminoan. However, Divo discovered Burtoni's office empty and the senator nowhere to be found. He returned to Amidala's office, though while greeting Mothma was interrupted by Purs, who screamed and told him that she had been attacked by Burtoni, who was quickly found and arrested by the CSF.\nIn the Chancellor's office the next morning, Divo questioned Burtoni, who denied attacking Purs and murdering Farr and Deechi. Divo speculated that Burtoni had been the person Farr met with at the docks the night before he died, then slipped the poison into the wine when she barged into Amidala's office during Farr's celebration with the others. Burtoni tried to dispel his claims, but Divo continued and told her about the poison's Kaminoan origin. Divo ordered Burtoni to be arrested, but Amidala realized that, if the poison was in all their drinks and only affected Rodians, then Purs would have died too. Padmé quickly realized that Purs must not have drunk, but by then Purs had taken out her blaster and aimed it at her head. Purs grabbed Amidala and held her hostage.\nPadmé demanded to know why she killed Farr, and Purs told her that it was his deal with the Separatists that had motivated her. Farr's mistake had brought Rodia into the war, and Lolo believed that he was weak and didn't deserve to lead the planet after the incident. While she explained her hatred for Farr, however, Purs revealed that she had been the mysterious figure who confronted Farr at the docks, and the one who had tried to kill Amidala and Organa a few days later. She also admitted to killing Deechi after learning that he knew of the meeting. Before she could leave, however, Purs was surrounded by police droids under Divo's orders, and Padmé swatted her blaster out of her hand and punched her hard in the jaw, knocking her out.\nAfter Purs was arrested, Burtoni was released, and the Senate returned to normality. The congress convened later to vote on Farr's bill, though despite all the efforts made by the late senator and his allies, the motion failed and the increase in clone trooper production was to continue as outlined in Burtoni's bill. While talking with Amidala following the defeat of Farr's bill, Chancellor Palpatine used the deaths of Farr and Deechi to support his argument that it was important to continue with the expansion of the Republic's defenses.\nOnaconda Farr was a male Rodian who stood 1.75 meters tall, or 5 feet and 9 inches. He had turquoise skin with iridescent coloration across his head and blue eyes that sparkled when he wore clothes that complimented them. Farr was a devoted servant to his people, and in his life of public service, their needs were always his primary concern. His policies always reflected their well-being, and in his attempts to keep them out of harm's way, he was prone to making mistakes. Farr was deeply aware of his flaws and was at times self-conscious of them. Despite this, he felt that it was important to be aware of one's shortcomings, rather than pretending to be without issues or naïveté.\nFarr was a deep loyalist to the Republic but did not believe that the government was beyond criticism and worked to preserve the democratic institutions that held it intact. He joined the efforts of Bail Organa and Mon Mothma in trying to maintain democracy during the heightened state of inaction and backsliding before the Separatist Crisis. Farr mentored Padmé Amidala in her youth and again in her first years as a senator, during which he advised her that it was okay to be unsure of her positions until she found what they were. In Farr's opinion, being honest about her inexperience did not make her a poor senator. He was saddened when she would be verbally assaulted by their colleagues and would attempt to alleviate tense situations by making jokes, which were not always well received. Farr and Amidala had a close relationship developed over many years, and with Organa and Mothma, the two worked together closely in the Senate as well.\nDespite being a longtime supporter of the Galactic Republic, Farr faced a crisis of faith in the early Clone Wars as Rodia became a target of piracy and his people faced a famine. Farr's troubles made him distant from his allies, and he became disillusioned with the Republic and turned to Viceroy Gunray for aid, even at the expense of Senator Amidala. The decision weighed heavily on Farr, and as he learned more of Gunray's true motives and the false pretenses on which his deal had been made, Farr turned on his brief ally and helped Amidala have Gunray arrested. Despite Amidala's apology and immediate Republic aid, Farr was deeply affected by his mistake. His act of betrayal to both the Republic and Amidala haunted him, and for the rest of his life, he suffered from immense regret for what he had done.\nIn the aftermath of his betrayal, Farr looked to devote himself to the fight for peace, which he decided was what mattered most to him. He believed that people couldn't wait for others to fix injustices, but rather stand up and end injustice themselves. Although Farr was a career politician who had served in the Senate for many years, he became a target for militarist and corporate groups in the congress, who used him in their propaganda to denounce peace. Despite this, he was resolute and unyielding to attacks and was willing to personally challenge his opponents and confront them himself. Though he wished he had joined the fight to end the war much sooner than he had, he found solace in being able to do so anyway. Farr found in his cause a way to let go of his guilt and redirect his attention, but others would not be as forgiving as he was.\nOnaconda Farr was first introduced as the senator of Rodia in Star Wars: Episode II Attack of the Clones, released May 16, 2002 and was portrayed by Zuraya Hamilton, who was also the department coordinator for Attack of the Clones. He was voiced by Dee Bradley Baker in Star Wars: The Clone Wars television series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Onaconda_Farr",
  "/wiki/Onaconda_Farr/Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Rodia",
  "/wiki/21_BBY",
  "/wiki/20_BBY",
  "/wiki/Coruscant",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Council_of_Neutral_Systems",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Politics",
  "/wiki/Homeworld",
  "/wiki/Savareen_sector",
  "/wiki/Galactic_Senate",
  "/wiki/Standard_decade",
  "/wiki/Democracy",
  "/wiki/Clone_Wars",
  "/wiki/The_galaxy",
  "/wiki/Death",
  "/wiki/Standard_year",
  "/wiki/Separatist_Crisis",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Mon_Mothma",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Trade_Federation",
  "/wiki/Mission_to_Rodia",
  "/wiki/Republic_financial_reform_bill",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Republic_military_enhancement_bill",
  "/wiki/Republic_Military",
  "/wiki/Reduced_military_spending_bill",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Poison",
  "/wiki/Aide",
  "/wiki/Lolo_Purs",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Senator",
  "/wiki/Pa_Dua",
  "/wiki/Tox_Don",
  "/wiki/Silood",
  "/wiki/Junior_Representative",
  "/wiki/Senatorial_Palace",
  "/wiki/Swamp",
  "/wiki/Naboo",
  "/wiki/Ruwee_Naberrie",
  "/wiki/39_BBY",
  "/wiki/Shadda-Bi-Boran",
  "/wiki/Star",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Sab%C3%A9",
  "/wiki/32_BBY",
  "/wiki/Supreme_Chancellor",
  "/wiki/Finis_Valorum",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Lott_Dod",
  "/wiki/Malastare",
  "/wiki/Vote_of_No_Confidence",
  "/wiki/Battle_of_Naboo",
  "/wiki/Darth_Sidious",
  "/wiki/28_BBY",
  "/wiki/Alderaan",
  "/wiki/Chandrila",
  "/wiki/Committee_for_transportation_of_construction_materials",
  "/wiki/Mina_Bonteri",
  "/wiki/Onderon",
  "/wiki/R%C3%A9illata",
  "/wiki/Oshadam",
  "/wiki/Jungle",
  "/wiki/24_BBY",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Serenno",
  "/wiki/Jedi_Master",
  "/wiki/Raxus_Address",
  "/wiki/Core_Worlds",
  "/wiki/Loyalist",
  "/wiki/Emergency_Powers_Act",
  "/wiki/23_BBY",
  "/wiki/Military_Creation_Act",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/22_BBY",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Clone_trooper",
  "/wiki/Cloning",
  "/wiki/Ruling_Council_(Kamino)",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Geonosis",
  "/wiki/Dorm%C3%A9",
  "/wiki/Hutt_Clan",
  "/wiki/Asajj_Ventress",
  "/wiki/Rotta",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Kharrus",
  "/wiki/Kinyen",
  "/wiki/Teth",
  "/wiki/Tatooine",
  "/wiki/Hutt_Clan%E2%80%93Republic_treaty",
  "/wiki/File:WhereWasTheRepublic-BJ.ogg",
  "/wiki/C-3PO",
  "/wiki/Rodian_(language)",
  "/wiki/B1-series_battle_droid",
  "/wiki/Hologram",
  "/wiki/Prison",
  "/wiki/Cloak",
  "/wiki/Jedi",
  "/wiki/Water",
  "/wiki/Death_penalty",
  "/wiki/41st_Elite_Corps",
  "/wiki/Kwazel_Maw",
  "/wiki/Gungan",
  "/wiki/Blaster",
  "/wiki/Mee_Deechi",
  "/wiki/Umbara",
  "/wiki/Halle_Burtoni",
  "/wiki/Kamino",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Mandalore",
  "/wiki/Mission_to_Cato_Neimoidia",
  "/wiki/Geonosis_primary_droid_foundry",
  "/wiki/Kin_Robb",
  "/wiki/Taris",
  "/wiki/Death_Watch",
  "/wiki/Mandalore_Defense_Resolution",
  "/wiki/Coronet",
  "/wiki/Tal_Merrik",
  "/wiki/Kalevala",
  "/wiki/Orn_Free_Taa",
  "/wiki/Ryloth",
  "/wiki/Sundari",
  "/wiki/Mandalorian_Protectors",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Skirmish_aboard_the_Coronet",
  "/wiki/Foodstuff",
  "/wiki/SD-K4_assassin_droid",
  "/wiki/SD-K4a_mini-assassin_droid",
  "/wiki/Util-313",
  "/wiki/Deputy_Minister",
  "/wiki/Jerec",
  "/wiki/Mandalorian_Government_Council",
  "/wiki/Plot_to_assassinate_Satine_Kryze",
  "/wiki/Pantoran",
  "/wiki/Riyo_Chuchi",
  "/wiki/Pantora",
  "/wiki/Protocol_droid",
  "/wiki/File:NotAVeryGoodIdea-HC.ogg",
  "/wiki/Enhanced_Privacy_Invasion_Bill",
  "/wiki/Philo",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Cad_Bane%27s_group",
  "/wiki/Cad_Bane",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Gume_Saam",
  "/wiki/Techno_Union",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Raxus_Secundus",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Nix_Card",
  "/wiki/Grievous",
  "/wiki/Central_power_distribution_grid",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Head_of_State",
  "/wiki/Mak_Plain",
  "/wiki/Muun",
  "/wiki/Monument_Plaza",
  "/wiki/Robonino",
  "/wiki/Chata_Hyoki",
  "/wiki/Christo",
  "/wiki/Christo%27s_apartment",
  "/wiki/Quarren",
  "/wiki/Teckla_Minnau",
  "/wiki/Stonk",
  "/wiki/Wine",
  "/wiki/Lieutenant",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Forensic_science_commander",
  "/wiki/V2A_DAZ",
  "/wiki/Funeral_of_Onaconda_Farr",
  "/wiki/Jedi_High_Council",
  "/wiki/Honor_Guard",
  "/wiki/Deechi%27s_office",
  "/wiki/Umbaran",
  "/wiki/Eye",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/May_16",
  "/wiki/2002",
  "/wiki/Zuraya_Hamilton",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Queen%27s_Hope",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Ambush",
  "/wiki/Bombad_Jedi",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Senate_Spy",
  "/wiki/Lightsaber_Lost",
  "/wiki/The_Mandalore_Plot",
  "/wiki/Voyage_of_Temptation",
  "/wiki/Duchess_of_Mandalore",
  "/wiki/Corruption_(episode)",
  "/wiki/Sphere_of_Influence",
  "/wiki/Hostage_Crisis",
  "/wiki/Hostage_Crisis_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Hunt_for_Ziro",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Pursuit_of_Peace_(short_story)",
  "/wiki/Senate_Murders",
  "/wiki/Shades_of_Reason",
  "/wiki/Voices",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/So_Much_More",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/Category:Audio_files_of_Onaconda_Farr",
  "/wiki/Category:Images_of_Onaconda_Farr",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_60",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Nightsisters_(episode)",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/46_BBY",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Battle_of_Scarif",
  "/wiki/0_BBY"
 ]
}