{
 "name": "Onasi family",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Patriarch(s)",
     "values": [
      "Carth Onasi"
     ]
    },
    {
     "name": "Planet(s) of origin",
     "values": [
      "Telos IV"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Fragmented",
     "values": [
      "3958 BBY"
     ]
    },
    {
     "name": "Affiliation",
     "values": [
      "Galactic Republic",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "The Onasi family was a Human family that resided on Telos IV during the Mandalorian Wars. The patriarch of the family, Carth Onasi, was one of the most skilled pilots in the Navy of the Galactic Republic, eventually gaining the rank of Admiral. His wife was Morgana Onasi, and they had one son, Dustil.\nAt the beginning of the Jedi Civil War, Telos IV was bombarded by the Sith fleet. Carth had been away on military duty, and returned to find his wife dying and his son missing. Dustil had been taken by the Sith, but his father didn't know this and eventually stopped looking, assuming the worst.\nYears later father and son were reunited, though not under the best of circumstances. Dustil had joined the Sith Academy on Korriban. He blamed his father for what had happened to the family. Carth was disappointed by his son's choices, and vowed to set things right.\nWith the help of Revan, Carth eventually convinced his son to turn away from the Sith, and they agreed to meet again on Telos IV.\nAn unseen monument was later constructed in honor of an unspecified member of the Onasi family for unknown reasons in Coronet City on Corellia, though by the time of the Galactic War, it was destroyed by Mandalorian mercenaries employed by the Empire to assist in their invasion and occupation of Corellia.\nWhile a name for Carth's deceased wife is not in the game files, David Gaider, BioWare's writer for the character, gave her name as \"Morgana.\" This was later implemented officially with the release of the Knights of the Old Republic Handbook.\nWith Dustil Onasi becoming a Sith student at the Sith Academy on Korriban, the bloodline may have been Force-sensitive from either Carth , Morgana, or both.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Onassi",
  "/wiki/Human/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Telos_IV",
  "/wiki/3958_BBY",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Mandalorian_Wars",
  "/wiki/Pilot/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Admiral/Legends",
  "/wiki/Morgana_Onasi",
  "/wiki/Dustil_Onasi",
  "/wiki/Jedi_Civil_War",
  "/wiki/Bombing_of_Telos_IV",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Korriban",
  "/wiki/Revan/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Galactic_War",
  "/wiki/Mandalorian/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Battle_of_Corellia",
  "/wiki/David_Gaider",
  "/wiki/BioWare",
  "/wiki/Knights_of_the_Old_Republic_Handbook",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide"
 ]
}