{
 "name": "Onca",
 "display_name": "Onca",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ithor"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.05 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Onca was a male Ithorian bounty hunter who was in operation during the Clone Wars, together with his brother Bulduga. Onca's and Bulduga's reputation caught the eye of the Sith Lord Count Dooku and Phindian criminal mastermind Moralo Eval, who invited both brothers to participate in a series of challenges at the Box on the planet Serenno. As Bulduga was killed before the challenges, Onca was forced to participate alone.\nAt some unspecified point in their lives, Onca and his brother Bulduga became bounty hunters and formed a legendary duo throughout their careers, becoming famous across the galaxy. In 20 BBY, during the Clone Wars, both brothers were invited along with some other fellow bounty hunters by the Sith Lord Count Dooku and the Phindian criminal mastermind Moralo Eval to participate in a series of challenges at the Box on the planet Serenno. The duo's reputation was the main reason for which they caught Dooku's eye.\nBulduga's participation in the tournament was cut short when he was murdered by the Duros bounty hunter Cad Bane shortly before the challenges began during a dispute over Bulduga's hat. Bane asked Bulduga where he got his hat from, and Bulduga responded by drawing his pistols, recognizing the conversation's tension; however, Bane drew his blaster first and fatally shot Bulduga, taking Bulduga's hat for his own. Onca witnessed this event, but didn't dare challenge Bane due to Bane's superior skills. Onca secretly mourned for his deceased brother.\nCompeting against other bounty hunters in the potentially fatal challenges, the victors would receive the honor of kidnapping Supreme Chancellor Sheev Palpatine of the Galactic Republic. Onca did well in the first challenge like the others, although by Embo's fault he nearly fell to his death and into the Dioxis released in the gas room, and made it to the second challenge. Once there, the bounty hunters discovered that the room was full of electrified laser blade columns just when one nearly impaled Onca's head after Rako Hardeen pushed Jakoli to safety, but Onca bent to avoid that fate. In a matter of seconds, however, Onca was cornered by the columns and one got directly to his head, with the laser near his face, threatening to slice it. But as the laser didn't get too far, it returned to its original position. Thinking that he was safe, Onca breathed a sigh of relief, but he was quickly impaled in the back by a laser blade before he could react, killing him and thus becoming the first bounty hunter to die in the challenges.\nAlong his brother Bulduga, Onca was part of a successful legendary bounty hunting team famous over the galaxy. In contrast of his brother, who was a fast-drawing gunslinger, Onca was slower, incapable to overcome the bulk of his Ithorian build to snap off shots as quickly as Bulduga could. This last trait would eventually cost to Onca not only his career, his life also, when he was fatally cornered at the Box on Serenno.\nOnca favored firepower over finesse or flash. Onca frequently carried more than one blaster rifle, including a sawed-off one, at a time.\nOnca appeared first and only physical appearance was in the episode \"The Box\" of the TV show Star Wars: The Clone Wars. He later appeared in a flashback sequence of the episode \"Crisis on Naboo\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Onca",
  "/wiki/Onca/Legends",
  "/wiki/Bane%27s_Story",
  "/wiki/Ithor",
  "/wiki/20_BBY",
  "/wiki/Serenno",
  "/wiki/Ithorian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_Wars",
  "/wiki/Bulduga",
  "/wiki/Eye",
  "/wiki/Sith_Lord",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Phindian",
  "/wiki/Moralo_Eval",
  "/wiki/Box",
  "/wiki/The_galaxy",
  "/wiki/Tournament_on_Serenno",
  "/wiki/Planet",
  "/wiki/Duros",
  "/wiki/Cad_Bane",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Republic",
  "/wiki/Embo",
  "/wiki/Death",
  "/wiki/Dioxis",
  "/wiki/Electrified_laser_blade",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jakoli",
  "/wiki/Gunslinger",
  "/wiki/Firepower",
  "/wiki/Blaster_rifle",
  "/wiki/The_Box",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Crisis_on_Naboo",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Category:Images_of_Onca",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Prisoners",
  "/wiki/Standard_year"
 ]
}