{
 "name": "Oncho Shen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aduba-3"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Oncho Shen was a Human male who lived on the Outer Rim planet Aduba-3 during the Galactic Civil War. Shen lived in the farming village of Onacra with his daughter Merri and her grandfather, a local mystic known as the Old One. By 0 ABY, Shen's village came under attack by a criminal gang known as the Cloud Riders. When Onacra enlisted the aid of Rebel hero Han Solo to defend itself against the Cloud-Riders, Shen served as the village's spokesman when Solo and his Star-Hoppers visited Onacra.\nA native of the Outer Rim world of Aduba-3, Oncho Shen lived in the small farming community of Onacra during the era of the Galactic Civil War. For most of his life, Shen lived a simple existence growing maze-stalk while raising his daughter Merri. Also present was Merri's grandfather, a mystic known as the Old One—Shen had some disdain for the elderly man, scorning his belief in shamanistic power. By 0 ABY, his village had become a target of the Cloud-Riders, a vicious gang led by former pro swoop racer Serji-X Arrogantus.\nDesperate to be rid of the Cloud-Riders, the people of Onacra enlisted the aid of Rebel hero Han Solo, who put together the makeshift militia known as the Star-Hoppers of Aduba-3 to defend the village. Solo and his gunslingers made the journey to Onacra from the spaceport of Tun Aduban, along the way saving Shen's daughter Merri from a high-hound attack. Shen, who had been chosen by his fellow villagers as their spokesman, greeted the Star-Hoppers upon their arrival in Onacra, expressing his undying gratitude for his daughter's rescue. As the Star-Hoppers prepared for the Cloud-Riders to descend upon the village, Solo was approached by the Old One, who offered to aid their defense of Onacra by summoning a great legendary beast. Disbelieving of the old man's ramblings, Shen stepped in and quickly urged Solo to ignore his entreaties. However, Shen's skepticism was proven wrong in the coming battle, when the Old One succeeded in calling forth the massive Behemoth from the World Below from its slumber beneath the village.\nA family man who lived a simple life in a small farming community, Oncho Shen cared deeply for his daughter Merri and was extremely grateful for her rescue by Han Solo and his Star-Hoppers. However, his familial affection didn't fully extend to her grandfather, the Old One, holding a disdainful attitude towards the elderly man's fixation on mysticism.\nOncho Shen made his first and only appearance in the Star Wars Legends continuity in Star Wars  9, written by Roy Thomas and released in 1977. In his lone appearance, Shen was illustrated by Howard Chaykin.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Aduba-3/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Onacra",
  "/wiki/Merri_Shen_Doshun",
  "/wiki/Old_One",
  "/wiki/0_ABY/Legends",
  "/wiki/Cloud-Riders/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Star-Hoppers_of_Aduba-3",
  "/wiki/Maze-stalk",
  "/wiki/Shaman/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Swoop_racing/Legends",
  "/wiki/Serji-X_Arrogantus",
  "/wiki/Spaceport/Legends",
  "/wiki/Tun_Aduban",
  "/wiki/High-hound",
  "/wiki/Battle_of_Aduba-3",
  "/wiki/Behemoth_from_the_World_Below",
  "/wiki/Star_Wars_(1977)_9",
  "/wiki/Roy_Thomas",
  "/wiki/1977",
  "/wiki/Howard_Chaykin",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Starhoppers_of_Aduba-3",
  "/wiki/Star_Wars_Gamer_4"
 ]
}