{
 "name": "Ondorru",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lord Ondorru was a Human male Sith Lord of the resurgent Sith Empire who was active during the Cold War.\nDuring the Great Galactic War, Ondorru was responsible of the trap that forced the Dagger Wing Republic starfighter to fire on Imperial civilians, spreading false information. Around 3641 BBY, Ondorru was one of the top leaders of the Imperial troops that besieged the Belsavis prison on Belsavis. He was pursued by Dagger Wing and fought with Dagger Wing's leader, Conrad Gall. He effortlessly defeated Gall, but when the leader of Havoc Squad arrived, he summoned beasts to cover his escape. The leader of Havoc Squad let Ondorru escape.\nOndorru found that most beings in the galaxy were beneath his contempt, believing that the only beings worthy of his respect were Sith strong in the Force as himself—a rare group. He had almost no regard for other human beings and even less consideration for alien species, whom he considered little better than talking animals. Fellow Sith considered Ondorru a dangerously reckless individual. He was notorious for pursuing his passions without restraint, carelessly endangering anyone in his way. Darth Vowrawn once described him as a \"capricious deviant,\" and his actions and attitudes bore the description out.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Great_Galactic_War",
  "/wiki/Bombing_of_Fest",
  "/wiki/Dagger_Wing",
  "/wiki/Republic_starfighter",
  "/wiki/3641_BBY",
  "/wiki/Belsavis_prison",
  "/wiki/Belsavis/Legends",
  "/wiki/Conrad_Gall",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/The_Force/Legends",
  "/wiki/Darth_Vowrawn",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}