{
 "name": "One-Eye",
 "display_name": "One-Eye",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "black eyebrows"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right eye replacement"
     ]
    }
   ]
  }
 ],
 "content": "One-Eye was a Human male bounty hunter who was active during the time of the New Republic. At some point, his right eye was replaced with cybernetics, which also covered a large scar over the eye, rendering him a cyborg. He wore light colored clothing and carried weapons such as an E-11 blaster rifle and a Carbonite gun. One-Eye had brown eyes, light-colored skin, and brown hair, except for his eyebrows, which were black.\nOne-Eye first appeared in the 1997 computer game Star Wars: Jedi Knight: Dark Forces II as a character who only appeared in the game's multiplayer mode as a playable character model. He appeared again in Jedi Knight's expansion pack, Star Wars: Jedi Knight: Mysteries of the Sith. Mysteries of the Sith introduced \"multiplayer personalities\", a form of character creation that put different character models under different professions. Each profession also had their own set of starting weapons for a match. One-Eye was categorized as a bounty hunter. It is not known if One-Eye is meant to be the character's name or a nickname. Due to his multiplayer only appearances, One-Eye's place in canon is uncertain.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Old_One-Eye",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Time/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Carbonite_gun",
  "/wiki/Hair/Legends",
  "/wiki/1997",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/Canon"
 ]
}