{
 "name": "One",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Celegian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dyarchy"
     ]
    }
   ]
  }
 ],
 "content": "One was a male Celegian who lived during the Republic Dark Age.\nWhen One was over two hundred years old, he was captured on the orders of the Krevaaki Sith Lord Saaj Calician, Regent of the Dyarchy, and transported to planet Byllura, in the Grumani sector. There, he was taken to the The Loft in the city Hestobyll, where he was tortured and forced to submit to the Sith and the dark side. With One's mind broken, Calician arranged for thousands more Celegians to be brought to Byllura. By utilizing the innate telepathic abilities that Celegians possessed, Calician established a Celegian network to replace conventional communications technology, whereby Calician would make One send out telepathic messages to the other Celegians on Byllura.\nIn c. 1032 BBY, the Jedi Knight Kerra Holt traveled to Byllura and infiltrated The Loft. She encountered One and persuaded him to refuse to send out any more messages for Calician. One followed her words, and was able to stop sending messages, which resulted in a breakdown in communications across the world.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Celegian",
  "/wiki/Gender/Legends",
  "/wiki/Dyarchy",
  "/wiki/Republic_Dark_Age",
  "/wiki/Standard_year/Legends",
  "/wiki/Krevaaki",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Saaj_Calician",
  "/wiki/Planet/Legends",
  "/wiki/Byllura",
  "/wiki/Grumani_sector",
  "/wiki/The_Loft",
  "/wiki/City/Legends",
  "/wiki/Hestobyll",
  "/wiki/Sith/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/1032_BBY/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kerra_Holt",
  "/wiki/Knight_Errant_(novel)"
 ]
}