{
 "name": "Onibald Daykim",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corusca Bank",
      "Daykim's Kingdom"
     ]
    }
   ]
  }
 ],
 "content": "Onibald Daykim, also known as King Daykim, was a low-level civil servant on Coruscant, who hid in the Undercity and led a group of fugitives, collectively known as Daykim's Kingdom.\nDaykim was employed by the Corusca Bank , as a low-level manager. Due to a simple accounting error by a member of his staff, he became the most famous person on Coruscant for two hours. The error caused Emperor Palpatine to be placed at the top of the public list of loan-defaulters in the Imperial City for two hours. In retribution for this embarrassment, the Emperor fired the entire board of directors and sought out the one personally responsible for the error. Daykim, along with his fellow bureaucrats, fled into the depths of Coruscant's Undercity to avoid capture.\nIn the Undercity, the bureaucrats remained loyal to Daykim, crowning him King Daykim. As King, Daykim received the best of their spoils; fine animal skins, and the shoulder pads and gloves of a stormtrooper.\nThe group tapped into the energy grid of Imperial City with old generators, and used other discarded pieces of machinery to rig up surveillance to protect their patch. So isolated was Daykim's Kingdom, they were unaware of the demise of the Empire, until Jacen and Jaina Solo stumbled into their territory, after Chewbacca and C-3PO lost them. Daykim returned the twins to the surface, but despite assurances of the New Republic's benevolence, decided to remain in the Undercity, rather than return to the bureaucratic dullness of surface life.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Corusca_Bank",
  "/wiki/Daykim%27s_Kingdom",
  "/wiki/Coruscant_underworld",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_City",
  "/wiki/King/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Power_generator/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Chewbacca/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Solo_twins",
  "/wiki/New_Republic/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}