{
 "name": "Oniye Namada",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Oniye Namada was a Human female who served as a major in the Imperial Security Bureau during the Great Jedi Purge. She played an important role in the resolution of the Vaklin insurgency in 19BBY. With the help of Darth Vader, she succeeded in her task to erase all traces of the presence of the Jedi Order on Vaklin, despite the strong attachment of the people for the Jedi cause. She had a daughter that she wanted to send to the Imperial Education Center on Vaklin.\nOniye Namada is Human female who served as a major in the Imperial Security Bureau during the Great Jedi Purge.\nIn 19 BBY, Imperial forces invaded the planet Vaklin as part of the Great Jedi Purge. Indeed, Vaklin was a world deeply-seated in pro-Jedi tradition. When the Empire asserted its control over the planet, Jedi Knight Cho'na Bene and two fellows, a Jedi Master and his apprentice, instigated an insurgency against the Empire. With the populace actively working against the Empire, Darth Vader was dispatched to turn the people against the Jedi and put down the insurrection.\nOniye Namada carried out Darth Vader orders by questioned the locals of Vaklin what the statue was; then telling the Clone gunnery Team to destroy the statue of the Jedi Khen Reo. She then said \"This empty Plaza will serve as the new site of an Imperial Education Center on Valkin. She strongly encouraged the people of Vaklin to enroll in the Imperial Education Center. She was in disguise as a clone trooper then publicly executing the Jedi in front of the Citizens so the Jedi would be humiliated.\nOniye Namada was a major in the Imperial Security Bureau during the Great Jedi Purge. She was good at manipulation, shown by when she humiliated the jedi on Vaklin. Since she served in the Imperial Security Bureau, she could crackdown on citizens who supported the Jedi or were affiliated with them. Lord Vader praised her because of her expertise during the Vakln Insurgency.\nMajor Namada wore a white Imperial uniform with a pair of black boots, she also wore a belt, on her head she wore an Imperial kepi. She wore an rank insignia on on the left breast of her uniform. She was also an expert using the DC-15x sniper rifle when she shot Cho'na Bene in the throat killing him instantly.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Namada",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Major/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Vaklin_insurgency",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Vaklin",
  "/wiki/Jedi/Legends",
  "/wiki/Oniye_Namada%27s_daughter",
  "/wiki/Imperial_Education_Center",
  "/wiki/19_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Cho%27na_Bene",
  "/wiki/Unidentified_Jedi_Master_(Shrokaan)",
  "/wiki/Unidentified_reptilian_Jedi_Knight",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Imperial_kepi",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Breast",
  "/wiki/DC-15x_sniper_rifle/Legends",
  "/wiki/Purge_%E2%80%93_The_Tyrant%27s_Fist_1",
  "/wiki/Purge_%E2%80%93_The_Tyrant%27s_Fist_2"
 ]
}