{
 "name": "Oo'ob",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Prior to 19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gigoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Oo'ob, also known as Oo'ob the Apostate, was a Gigoran male Jedi Master who lived before the time of the Galactic Empire. He utilized a unique lightsaber sniper rifle hybrid known as the Farkiller, created by fellow Jedi Var-Whill, to make pre-emptive strikes on targets from long distances. However, he and Var-Whill were declared apostates by the Jedi High Council as a result and were both purged.\nProfessor Korin Aphra eventually uncovered evidence of Oo'ob and his crimes in 16 BBY, writing about the Jedi in his \"Notes on Jedi Heresies.\" Korin's daughter Chelli Aphra later stole the Farkiller from a Slinani Migration Shrine in 3 ABY, the weapon then falling into the hands of rebels that were plotting to kill Emperor Palpatine.\nThe Gigoran male Oo'ob was a part of the Jedi Order, holding the rank of Jedi Master. In the wake of a conflict known as the Corsair Wars, he began pursuing a more pre-emptive approach to threats and recruited fellow Jedi and noted crystallist Var-Whill to create the Farkiller, a unique hybrid of lightsaber and sniper rifle that Oo'ob used to take out targets from a hundred kilometers away.\nIn the words of Professor Korin Aphra, it could have been theorized that Oo'ob's work with the Farkiller killed several hundred \"emergent despots.\" However, Oo'ob's new methods broke Jedi doctrine, and the Jedi High Council felt that the Gigoran's methods lacked restraint. As a result, both Oo'ob and Var-Whill were declared apostate and purged within the decade. Oo'ob was remembered by some as \"Oo'ob the Apostate.\"\nIn 16 BBY, during the time of the Galactic Empire, Korin Aphra obtained stolen memory crystals with evidence of Oo'ob's existence as well as his \"crimes.\" Korin believed he could use the crystals' records to find the Fortress of Garn and the Ordu Aspectu, a splinter group of Jedi. Korin recorded the story of Oo'ob in his \"Notes on Jedi Heresies.\"\nTwenty years later, in 3 ABY, Korin's daughter, the rogue archaeologist Chelli Aphra, discovered the Farkiller when infiltrating the Slinani Migration Shrine Red Mist and recalled Oo'ob's use of it to her partner Vulaada Klam. After stealing the Farkiller, she was captured by assets of the Rebel Alliance, who claimed they wanted to use its technology to build their own superweapon and assassinate the Galactic Emperor, Palpatine. In reality, the superweapon was a lie, and the Farkiller was part of a larger assassination plot against the Emperor coordinated by Minister Pitina Voor of the Empire's propaganda division, who was manipulating the rebel conspirators. The plot was ultimately unsuccessful.\nA Gigoran male, Oo'ob had white fur, tying some of his hair in a bun behind his head. The Jedi chose to betray his Order's doctrine in order to pre-emptively attack potential threats.\nOo'ob wore brown and red clothing that was ripped in several places and wrappings on his lower arms and his legs going down to the feet. He also had a belt with compartments and wore a vocoder mask over his mouth.\nOo'ob first appeared through a hologram in a flashback in the canon comic Doctor Aphra  32, written by Si Spurrier, illustrated by Wilton Santos and Caspar Wijngaard, and published by Marvel Comics on May 8 2019 as part of the Star Wars: Doctor Aphra series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Oo%27ob",
  "/wiki/19_BBY",
  "/wiki/Gigoran",
  "/wiki/Gender",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Lightsaber",
  "/wiki/Sniper_rifle",
  "/wiki/Farkiller",
  "/wiki/Var-Whill",
  "/wiki/Jedi_High_Council",
  "/wiki/Death",
  "/wiki/Professor",
  "/wiki/Korin_Aphra",
  "/wiki/16_BBY",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Infiltration_of_the_Red_Mist",
  "/wiki/Red_Mist",
  "/wiki/3_ABY",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Plot_to_assassinate_Emperor_Palpatine",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Droid",
  "/wiki/Teezee-Too",
  "/wiki/Corsair_Wars",
  "/wiki/Crystallist",
  "/wiki/Kilometer",
  "/wiki/Standard_decade",
  "/wiki/Memory_crystal",
  "/wiki/Citadel_of_Rur",
  "/wiki/Ordu_Aspectu",
  "/wiki/Standard_year",
  "/wiki/Archaeologist",
  "/wiki/Slinani_Migration_Shrine",
  "/wiki/Vulaada_Klam",
  "/wiki/Superweapon",
  "/wiki/Minister",
  "/wiki/Pitina_Mar-Mas_Voor",
  "/wiki/Coalition_for_Progress",
  "/wiki/Color",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Vocoder_mask",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Doctor_Aphra_(2016)_32",
  "/wiki/Simon_Spurrier",
  "/wiki/Wilton_Santos",
  "/wiki/Caspar_Wijngaard",
  "/wiki/Marvel_Comics",
  "/wiki/May_8",
  "/wiki/2019",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Doctor_Aphra_(2016)_33",
  "/wiki/Doctor_Aphra_(2016)_36",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Accresker_Jail",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/0_BBY",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth",
  "/wiki/Doctor_Aphra_(2016)_2"
 ]
}