{
 "name": "Oo_Wen",
 "display_name": "Oo Wen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ho'Din"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gardulla Besadii the Elder"
     ]
    }
   ]
  }
 ],
 "content": "The male Ho'Din Oo Wen was owned as a slave by Gardulla Besadii, a crime lord of the Hutt species. Wen was a gardener and, together with several other Ho'Din foresters, populated Besadii's luxurious if notorious indoor pleasure garden with exotic and dangerous plants. In 32 BBY, while working on the garden construction project, Wen defied his owner by not reporting the location of a group of Ghostling children who had escaped from the Hutt's captivity cells and whom the Ho'Din gardener helped to hide within the garden.\nOo Wen was a tall, male member of the Ho'Din species. His skin was bright green and his fleshy tendril 'hair' was violet in color. Although a gardener by profession, by 32 BBY he'd been purchased as a slave by Gardulla Besadii. A Hutt crime lord, Gardulla commissioned an underground pleasure garden in her fortress on the desert planet, Tatooine. Wen was one of several Ho'Din responsible for cultivating and maintaining the garden, which contained the diverse terrains of swampland, forest, waterfalls, and a lake, and was populated with many dangerous semi-sentient flora and fauna. The Ho'Din foresters worked for a full season to prepare the garden with flowers and trees.\nThe garden was also to contain various sentient beings as ornaments. To that end, the Besadii Hutt had several Wisties released into the garden to serve as sources of illumination. Similarly, in 32 BBY, Gardulla's thugs captured a group of diminutive Ghostling children, which included their Princess, Arawynne, for use as garden ornaments. Arawynne and the Ghostlings were broken out of their cells by some Tatooine children, all slaves themselves—Kitster Banai, Anakin Skywalker, and Pala Kwi'teksa—but soon returned to hide in the partially completed pleasure garden until the local children could organize a break-out from Besadii's compound. Wen and his fellow Ho'Din were known to Banai, who was also enslaved to Gardulla, and the boy was confident that the Ho'Din gardeners would protect the Ghostling children.\nWen lived up to Banai's expectations; as a nature lover—derisively called a \"flower lover\" by Sebulba the Dug, who'd originally enslaved the Ghostlings for Gardulla—he was prepared to protect the Princess and her companions from the Hutt and her henchmen. At one point, while Wen was working with a small sapling, he saw Arawynne and two companions, Kwi'teksa and a Wistie, across an open clearing. Wen waved the children forward, indicating that it was safe for them to cross the meadow. The Ghostling children, together with Kwi'teksa and several Wisties, took refuge in a cave in the garden. Wen was aware of that location, and the Wistie lookouts were prepared to let the Ho'Din visit the children. Eventually, Arawynne and her companions successfully escaped the compound.\nWen, like many Ho'Din, was a lover of nature, and worked as a gardener. He was prepared to defy his owner, Gardulla Besadii the Elder, and do anything to protect the Ghostling children in his garden.\nOo Wen was created by Dave Wolverton for Episode I Adventures 7: Capture Arawynne, published by Scholastic in 2000. Each installment in the young adults' Episode I Adventures series came with two books. One was a regular story book; the other was a game book that provided the reader with interactive choices to determine the outcome of the adventure. It is only the story book that mentions Oo Wen. Both the story book and the accompanying game book mention another, unidentified Ho'Din. Those sections are told from the perspective of Sebulba the Dug, who does not know the Ho'Din's name. It is therefore possible that this unnamed Ho'Din is also intended to be Wen; however, as there are multiple Ho'Din gardeners working for Besadii, this article treats the two as separate individuals.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ho%27Din/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gardulla_Besadii_the_Elder/Legends",
  "/wiki/Episode_I_Adventures_5:_The_Ghostling_Children",
  "/wiki/Slavery/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Species/Legends",
  "/wiki/Garden/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Gardulla_Besadii%27s_pleasure_garden",
  "/wiki/Plant/Legends",
  "/wiki/Ghostling",
  "/wiki/Youngling/Legends",
  "/wiki/Prison/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Gardulla_the_Hutt%27s_Palace/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Swamp/Legends",
  "/wiki/Water/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Wistie/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Arawynne",
  "/wiki/Kitster_Chanchani_Banai",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Pala_Kwi%27teksa",
  "/wiki/Sebulba/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Unidentified_Wistie_(Pala%27s_scout)",
  "/wiki/Unidentified_Wistie_(Arawynne%27s_lookout)",
  "/wiki/Dave_Wolverton",
  "/wiki/Episode_I_Adventures_7:_Capture_Arawynne",
  "/wiki/Scholastic_Inc.",
  "/wiki/2000",
  "/wiki/Star_Wars:_Episode_I_Adventures_(Scholastic)",
  "/wiki/Episode_I_Adventures_Game_Book_7:_Capture_Arawynne",
  "/wiki/Unidentified_Ho%27Din_gardener",
  "/wiki/Episode_I_Adventures_8:_Trouble_on_Tatooine"
 ]
}