{
 "name": "Ooris_Bynar",
 "display_name": "Ooris Bynar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3 ABY",
      "Ruusan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Thisspiasian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire",
      "Khel Tanna's crew",
      "Khel Tanna's crew"
     ]
    }
   ]
  }
 ],
 "content": "Ooris Bynar was a Thisspiasian male bounty hunter active during the time of the Galactic Empire. He partnered with Khel Tanna and her crew of scoundrels, undergoing missions for galactic criminals like Jabba Desilijic Tiure. When the former bounty hunter Nakano Lash resurfaced, Bynar sought her out, hoping that her capture would put him on the map as a hunter in his own right. After following Lash's former protégé Beilert Valance across the galaxy, Bynar finally tracked Lash down to the planet Ruusan in the Teraab sector, where he found that the former hunter was protecting a young girl named Cadeliah. Unprepared for the resourcefulness of the youngling, Bynar dropped his guard and was taken down by the duo, strangled to death by Lash with his own tail.\nDuring the reign of the Galactic Empire, Ooris Bynar worked as a bounty hunter, gaining a reputation for often causing a large amount of collateral damage. The Thisspiasian male fell in with the scoundrel Khel Tanna and her crew, pulling jobs for clientele such as Jabba Desilijic Tiure of the Hutt Clan. One such job brought the crew to the casino planet of Galator III, where they pulled a heist on one of the world's many establishments. The mission was nearly compromised by the group's pilot, Han Solo, who arrived late to the team's extraction. Nevertheless, Solo managed to pick up the entire crew and escape Galator III aboard the Millennium Falcon. After returning to Tatooine, Jabba gave all credit for the mission to Solo, causing Tanna's crew to part ways with the Corellian and his Wookiee co-pilot, Chewbacca.\nLater, Bynar and the rest of Tanna's crew traveled to the Mollo Tanka planetoid to reluctantly rescue Solo after learning that he had a lead on a valuable prize for Jabba: a verillix urn containing the ashes of Krestrel D'Naran. The crew planned to have Solo lead them to the urn and take the profits for themselves, but complications arose when the group discovered that the prize had been lost to the criminal Corbus Tyra on Antillion. Tyra, who had previously identified himself as Solo's father, had been arrested by Marshal Buck Vancto and taken to the Benelex Marshal Service Headquarters on Paqualis III. The crew led a mission that saw Tyra extracted but left Chewbacca injured. Bynar reported the injury to Tanna, who ordered her team to leave the Wookiee behind and escape with their mark.\nAround 3 ABY, the former bounty hunter Nakano Lash, who had disappeared after betraying fellow hunters in a previous mission, supposedly resurfaced, leading a number of bounties to be placed on her. One such bounty was placed by Syphacc, the owner of Syphacc's Bountiful Bounties, from whom Bynar attempted to get the job. Syphacc was reluctant to oblige due to the hunter's reputation, but a powerful choking from the Thisspiasian's tail changed his mind. Syphacc remained doubtful of his chances, however, and contacted famed hunter Boba Fett about the job soon after Bynar departed.\nIn order to track Lash down, Bynar trailed her bounty hunting-mentee, Beilert Valance, following him to a safe house in Phelar Port on Eriadu. There, Valance acquired a clue to Lash's location and departed for the graveyard planet of Galmerah aboard his starship, the Broken Wing. Bynar followed him at a distance in his own ship. Once at the planet, Valance and his droid Nine-Four-El discovered coordinates to Lash's location but were attacked by Bossk, who was also after Lash. In the skirmish that followed, Bynar ambushed Nine-Four-El and stole the droid's head, slicing into its memory to discover that Lash was on Ruusan.\nAs hunters throughout the Teraab sector searched for Lash, Bynar located her hideout on Ruusan and discovered that she was protecting a young girl named Cadeliah. When Lash returned, she found Cadeliah trapped in Bynar's grip, with the Thisspiasian threatening to kill the youngling should Lash approach. The girl, however, was not as helpless as Bynar assumed, as she uhsheathed a hidden knife and stabbed him in his head. With Cadeliah freed, Lash moved in with a blade of her own, slicing off one of Bynar's hands and finally choking him to death with his own tail. Valance and his companion T'onga, whom Bynar had once worked alongside in Khel Tanna's crew, later discovered the Thisspiasian's body and contemplated where Lash might have gone next.\nOoris Bynar was a Thisspiasian male with brown hair and green skin. The bounty hunter was aggressive, strangling Syphacc in order to take the bounty on Nakano Lash. Bynar regarded fellow bounty hunter Beilert Valance with disdain, considering him a \"cyborg freak\" due to his extensive cybernetic implants.\nThroughout his career, Bynar wore a blue coat over a purple jacket and white armor, as well as gloves on one pair of hands. He also wore a mask on the lower portion of his face. Bynar carried a blaster pistol that was kept in a holster and occasionally wielded EE-4 carbine rifles in all four of his arms. Bynar utilized a starship when attempting to track down Lash.\nOoris Bynar first appeared in Bounty Hunters 1, a comic written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on March 11, 2020. Bynar was later included in Star Wars: Han Solo \u0026 Chewbacca; this comic, which takes place earlier in the timeline, introduced some minor continuity issues with his previous appearances. In Han Solo \u0026 Chewbacca 1, colorist Alex Sinclair depicted Bynar as having completely orange skin, as opposed to the character's original appearance in Star Wars: Bounty Hunters, where Arif Prianto showed him to be green. Bynar's face was later colored green in Han Solo \u0026 Chewbacca 5, but the majority of his body remained orange. Bynar is also shown to have worked alongside the bounty hunter T'onga for several missions, despite the fact that she claims not to recognize his corpse in Bounty Hunters 4.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ooris_(disambiguation)",
  "/wiki/Han_Solo_%26_Chewbacca_6",
  "/wiki/3_ABY",
  "/wiki/Ruusan",
  "/wiki/Thisspiasian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Khel_Tanna%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Khel_Tanna",
  "/wiki/The_galaxy",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Nakano_Lash",
  "/wiki/Beilert_Valance",
  "/wiki/Planet",
  "/wiki/Teraab_sector",
  "/wiki/Cadeliah",
  "/wiki/Hutt_Clan",
  "/wiki/Casino",
  "/wiki/Galator_III",
  "/wiki/Heist_on_Galator_III",
  "/wiki/Pilot",
  "/wiki/Han_Solo",
  "/wiki/Millennium_Falcon",
  "/wiki/Tatooine",
  "/wiki/Corellian",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Mollo_Tanka",
  "/wiki/Planetoid",
  "/wiki/Mission_to_Mollo_Tanka",
  "/wiki/Krestrel_D%27Naran",
  "/wiki/Corbus_Tyra",
  "/wiki/Antillion",
  "/wiki/Ovan",
  "/wiki/Marshal",
  "/wiki/Buck_Vancto",
  "/wiki/Benelex_Marshal_Service_Headquarters",
  "/wiki/Paqualis_III",
  "/wiki/Extraction_on_Paqualis_III",
  "/wiki/Skirmish_on_Corellia",
  "/wiki/Syphacc",
  "/wiki/Syphacc%27s_Bountiful_Bounties",
  "/wiki/Boba_Fett",
  "/wiki/Safe_House",
  "/wiki/Phelar_Port",
  "/wiki/Eriadu",
  "/wiki/Burial",
  "/wiki/Galmerah",
  "/wiki/Starship",
  "/wiki/Broken_Wing",
  "/wiki/Droid",
  "/wiki/Nine-Four-El",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Slicer",
  "/wiki/Death",
  "/wiki/Youngling",
  "/wiki/Knife",
  "/wiki/Sword",
  "/wiki/Limb",
  "/wiki/T%27onga",
  "/wiki/Hair",
  "/wiki/Cyborg",
  "/wiki/Cybernetics",
  "/wiki/Jacket",
  "/wiki/Armor",
  "/wiki/Glove",
  "/wiki/Blaster_pistol",
  "/wiki/Holster",
  "/wiki/EE-4_carbine_rifle",
  "/wiki/Bounty_Hunters_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Paolo_Villanelli",
  "/wiki/Marvel_Comics",
  "/wiki/March_11",
  "/wiki/2020",
  "/wiki/Star_Wars:_Han_Solo_%26_Chewbacca",
  "/wiki/Timeline_of_galactic_history",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Alex_Sinclair",
  "/wiki/Star_Wars:_Bounty_Hunters",
  "/wiki/Arif_Prianto",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Bounty_Hunters_4",
  "/wiki/Category:Images_of_Ooris_Bynar",
  "/wiki/Bounty_Hunters_2",
  "/wiki/Bounty_Hunters_3",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year"
 ]
}