{
 "name": "Opeepit",
 "display_name": "Opeepit",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Frigosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic hands"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Team Colossus"
     ]
    }
   ]
  }
 ],
 "content": "Opeepit was a Frigosian male who lived on the Colossus refueling station during the era of the New Republic. He was the station's sole janitor.\nOpeepit was the janitor of the Colossus platform. When Kazuda Xiono first visited the Office of Acquisitions, he went past the Frigosian while he cleaned the floor. When Xiono was running to stop Jace Rucklin from racing, he was blocked by Opeepit and a number of droids that were working in the corridor. When Tamara Ryvora and Synara San conversed in the Colossus marketplace, they put their junk in a bin Opeepit was carrying. Later on, pirates attacked the Colossus. Opeepit chased a Hassk pirate around with his floor sweeper. When Xiono and Torra Doza were later visiting the market, Opeepit was there.\nFollowing the First Order's rescue of Torra from the Warbird gang, First Order stormtroopers occupied the Colossus. Opeepit was talking to the Gotal Rolt in the marketplace when three stormtroopers harassed the Rodian Glem. He was later cleaning the floors when two stormtroopers approached him and asked how long he had worked on the Colossus. Opeepit replied and they decided to confiscate his floor sweeper, much to the janitor's resistance. Later that day, he encountered Xiono and San in a turbolift and complained about the confiscation, prompting the two to express their sympathy.\nWithout his floor sweeper, Opeepit was forced to clean the floors with a brush. While scrubbing at a hall intersection, a stormtrooper, who was actually the Resistance spy Kazuda Xiono in disguise, walked into the puddle and he told him to go around. As the trooper left, he annoyingly stated that Opeepit would clean the floors faster with a floor sweeper, which left him muttering sarcastically to himself. That evening, he was carrying a basket of fruit when the same stormtrooper pushed past him, knocking the fruit out of his hands. Enraged Opeepit kicked one of the fruit aside as two stormtroopers passed him. Sometime later, Opeepit was scrubbing the floors in the marketplace when the Colossus began sinking. Large doors sealed off the outside to prevent internal flooding, but not before some of the sea water poured into where Opeepit was cleaning.\nOpeepit was a male Frigosian with yellow hair and cybernetic hands.\nOpeepit wore a breathing mask and heavy black goggles to protect him from Castilon's atmosphere and light. He used a floor sweeper.\nOpeepit was a character developed for the Star Wars Resistance animated series. He first appeared in the Season One premiere, \"The Recruit,\" but was not identified until after his appearance in \"Fuel for the Fire,\" in Bucket's List.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/Frigosian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Limb",
  "/wiki/Team_Colossus",
  "/wiki/Colossus",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Kazuda_Xiono",
  "/wiki/Office_of_Acquisitions",
  "/wiki/Jace_Rucklin",
  "/wiki/Tamara_Ryvora",
  "/wiki/Synara_San",
  "/wiki/Colossus_marketplace",
  "/wiki/Pirate",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Hassk",
  "/wiki/Floor_sweeper",
  "/wiki/Torra_Doza",
  "/wiki/First_Order",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Warbird_gang",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Gotal",
  "/wiki/Rolt",
  "/wiki/Rodian",
  "/wiki/Glem",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Fruit",
  "/wiki/Castilon",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/The_Recruit",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/Bucket%27s_List",
  "/wiki/Category:Images_of_Opeepit",
  "/wiki/The_Children_from_Tehar",
  "/wiki/Synara%27s_Score",
  "/wiki/Secrets_and_Holograms",
  "/wiki/Neeku%27s_Reward",
  "/wiki/The_Need_for_Speed",
  "/wiki/Bibo_(episode)",
  "/wiki/The_First_Order_Occupation",
  "/wiki/The_New_Trooper",
  "/wiki/Descent_(episode)",
  "/wiki/Into_the_Unknown",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/Kaz%27s_Curse",
  "/wiki/The_New_World",
  "/wiki/The_Escape",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/The_Face_of_Evil"
 ]
}