{
 "name": "Open_Hand_of_Hate",
 "display_name": "Open Hand of Hate",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Yavin 4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cult of Exar Kun"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Exar Kun"
     ]
    }
   ]
  }
 ],
 "content": "The Open Hand of Hate was a dark side Force user who was an unwilling follower of Exar Kun.\nBefore becoming a slave to the dark side, the Open Hand of Hate was a student at Corellia University and may have been a member of a archaeological expedition to Yavin 4 in 1 ABY that unknowingly tunneled into the burial chamber of the Temple of Exar Kun. The opening of the tomb had awakened the malevolent spirit of Exar Kun, who proceeded to enslave all the students and researchers and force them into the Cult of Exar Kun. At some point, the Cult traveled to the Corellia University research outpost on Talus that the original group had come from, and proceeded to enslave all the inhabitants and bring most of them back to Yavin 4. Fearing why he had lost contact with the outpost, Professor Cornelius Wagglehorn hired a group of spacers to investigate. After arriving at the outpost and battling a few of the cultists that had remained behind, the spacers discovered what had happened and informed the professor. He sent the spacers the coordinates for the tomb and implored them to enter it and destroy the Sith Lord's evil spirit. The first obstacle the spacers faced a upon entering the tomb was the Open Hand of Hate, who was surrounded by several more of his fellow enslaved students, who seemed to be worshiping him. After noticing the intruders, the Open Hand ordered his followers, one by one, to attack the group, all the while raining balls of electrical force energy down on them from the ceiling. His followers fell, one after the other, until there was no one left but the Hand, who immediately attacked the group with all the dark side fury he could muster. After a relatively short battle, however, the Open Hand of Fate was killed and his spirit was free of the clutches of Exar Kun. Afterward, the spacers continued on into the cave until they met the Minder of Weak Wills.\nThe Open Hand of Hate was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Open Hand of Hate was added to the game as part of the \"Exar Kun\" Heroic Encounter, introduced with the release of the \"Chapter 9\" update, on April 3, 2008.\nThe Open Hand of Hate was a \"boss\" enemy NPC in the Temple of Exar Kun Heroic Encounter. He was the first encounter in the instance, coming before the Minder of Weak Wills.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Cult_of_Exar_Kun",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Corellia_University/Legends",
  "/wiki/Temple_of_Exar_Kun",
  "/wiki/Corellia_University_research_outpost",
  "/wiki/Talus/Legends",
  "/wiki/Cornelius_Wagglehorn",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Minder_of_Weak_Wills",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/April_3",
  "/wiki/2008",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}