{
 "name": "Oppo_Rancisis",
 "display_name": "Oppo Rancisis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thisspias"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Thisspiasian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.38 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White",
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow-green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Blood Monarchy",
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic",
      "Republic High Command",
      "Republic High Command"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Yaddle"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Dal Azim"
     ]
    }
   ]
  }
 ],
 "content": "Oppo Rancisis was a Force-sensitive Thisspiasian male Jedi Master who served on the Jedi Council during the High Republic Era, Invasion of Naboo and the Clone Wars. He was known to be one of the wisest members of the Council. He was respected for his quiet wisdom and devotion to the Force and was a survivor of the initial Great Jedi Purge.\nOppo Rancisis was born on the rocky temperate world of Thisspias to royal parents and was the heir to the Thisspiasian Blood Monarchy. Although he was of royal heritage, Rancisis joined the Jedi Order at a young age and became the padawan learner of Jedi Master Yaddle. At some point, Rancisis was offered the throne of the Blood Monarch, but he declined and chose to continue a life of service as a Jedi instead.\nDuring the High Republic Era, Oppo Rancisis and his Padawan Dal Azim saved a group of slaves from an attack on a Zygerrian encampent, including the Twi'lek Lourna Dee. Rancisis became fond of Dee after seeing her willingness to put her life on the line for the other captives, and suggested that she enroll in the Carida Military Academy in order to gain skills that would help those in need. Dee reluctantly agreed. Rancisis checked in on Dee and her progress at the academy from time to time, but the two eventually lost touch when Dee abandoned the Academy.\nBy the year 232 BBY, Rancisis had become a member of the Jedi High Council, the governing body of the Order, and served as one of its oldest members.\nIn the aftermath of the Great Hyperspace Disaster and the Emergences, the Supreme Chancellor of the Republic, Lina Soh, requested that the Jedi participate in a mission to hunt down or eradicate the raiders called the Nihil, who had caused the disaster and the Emergences. The Jedi Council called a meeting to discuss participating in such action, which Rancisis was present for, joining as a hologram. During the meeting Master Adampo insisted that they should not join the mission, because it was a military action and the Jedi were not a military force. Rancisis responded to this by saying that the Jedi had acted as a military force in the past, in conflicts such as the Great Sith War, which Master Rana Kant responded to by stating that they were not currently at war. Ultimately, the deciding vote was taken by Master Jora Malli, who voted in favor of providing Jedi support in attempting to destroy the Nihil during the Battle of Kur.\nShortly before the Battle of Naboo, Rancisis, still a member of the Council, was present in the Council Chamber of the Jedi Temple on Coruscant when Jedi Master Qui-Gon Jinn came before the Council with news that the Sith, the ancient enemies of the Jedi Order, had resurfaced. He later observed Jedi Master Mace Windu evaluate the Force abilities of Anakin Skywalker, a nine-year-old boy from the planet Tatooine whom Jinn had discovered to be Force-sensitive and believed to be the Chosen One, a being who was prophesied to bring balance to the Force. Although the child was strong in the Force, the Council denied Skywalker entrance into the Order as they found his deep emotional attachments troubling and believed that he was too old for training. Rancisis saw a threat to the Order in the form of Skywalker. The Council reversed their decision, however, after Jinn was slain by the Sith Lord Darth Maul on Naboo, allowing Skywalker to become the Padawan of Jinn's former apprentice Obi-Wan Kenobi, per Jinn's dying wish.\nRancisis still served on the Council ten years after the invasion of Naboo. During this time thousands of star systems joined a secessionist movement who wanted independence from the Galactic Republic. The council feared that if a pan-galactic war to break out they wouldn't have enough manpower to defend the Republic from the Separatist threat. Around this time the life of Senator Padmé Amidala was threatened by an assassination attempt, causing the Council to assign Obi-Wan Kenobi and Anakin Skywalker as protection for the Senator. This eventually lead to Obi-Wan discovering that a Clone army was being manufactured in secret on the world of Kamino at the request of Jedi Master Sifo-Dyas, who had perished some years prior. Rancisis was present on Coruscant when the Council was brought this news. Troubled by this information, the council sent Obi-Wan to Geonosis to track down the bounty hunter Jango Fett, who was the man responsible for the attempts on Amidala's life as well as providing the genetic template for the clone Army. This request ultimately lead to the beginning of the pan-galactic conflict known as the Clone Wars, as the Separatist army and the new Grand Army of the Republic fought each other in what would become known as the first battle of Geonosis.\nWith the Republic now at war, Rancisis was chosen by the Jedi Council to be it's primary representative at Republic High Command meetings as a member of the organization. Throughout the war, Rancisis remained a high ranking Jedi on the High Council, and a key military advisor, also serving as a Jedi general throughout the war, coordinating Republic forces across the galaxy.\nShortly after the outbreak of the Clone Wars Rancisis was present in a council meeting briefing Master Windu on a task they had for the esteemed master. Scouts had discovered that the Separatist Alliance had occupied the Outer Rim world of Hissrich. The council feared that the Confederacy were attempting to utilize the backwater planet as a staging ground to assault neighboring systems. In order to discern the threat level of the occupation the Council tasked Master Windu alongside Master Fisto, Master Dibs and Knight Mano to run a covert information seeking mission on the threat.\nSupreme Chancellor Palpatine informed the Jedi High Council of Queen Julia of Bardotta's request for Jar Jar Binks to assist her after the disappearance of Dagoyan Masters. Oppo, and the rest of the council discussed the matter and Mace Windu volunteered to accompany Binks.\nRancisis was present when Plo Koon revealed that he found the lightsaber of Sifo-Dyas. Yoda confirmed that it was, and decided they needed to investigate. While on a mission to uncover the death of Master Sifo-Dyas who ordered the creation of the clone army, Rancisis was present when Kenobi and Skywalker reported that Count Dooku was behind with the creation of the clone army. The Council kept it a secret out of concern for how it could affect public support for the Republic.\nRancisis was present when Grand Master Yoda claimed to hear the voice of a long-dead Qui-Gon Jinn, who had mastered the ability to become a Force spirit after being killed by Darth Maul. Rancisis along with the other members of the Council participated in meditation in order to see if the Masters could sense Jinn's presence.\nAfter this long meditation, Rancisis was walking through the temple with his Jedi friends Secura, Unduli, and Kenobi. However, Kenobi left as he was going to talk to Windu privately.\nTowards the end of the war, Rancisis was present when Kenobi told the Council that Sugi arms dealers were attempting to sell an enormous kyber crystal to General Grievous on Utapau. When Kenobi and Skywalker reported to the Council after the destruction of the crystal, Yoda recalled stories of when the Jedi and Sith fought for control of the galaxy using weapons powered by kyber crystals.\nRancisis was present on the Council whilst as they watched a live holographic recording of the devastating Separatist attack on Mahranee, the homeworld of the Mahran species.\nDuring the Siege of Saleucami, Rancisis served as a General beside Quinlan Vos shortly before the execution of Order 66.\nAt the end of the Clone Wars, the clone troopers turned on the Jedi Order as a result of Order 66 commanded by the Supreme Chancellor. While a large majority of the Jedi Order was wiped out in this initial attack, some Jedi were able to escape the servants of the newly formed Galactic Empire. The Order was left virtually leaderless, but Rancisis, one of the few council members left, was among the few Jedi who survived by going into hiding. After the hunt for Eeth Koth, Rancisis was on a list of known survivors of the purge compiled by the Jedi hunters known as the Inquisitorius, having hidden himself from the Empire extremely well.\nMeasuring 1.38 meters, Oppo Rancisis had white hair, blue eyes, and green skin. He also had four arms and a snakelike physiology, moving on a long tail similar to serpents. Rancisis was one of the wisest masters on the Jedi High Council, considered a font of wisdom and careful contemplation, he saw the threat that Anakin Skywalker could prove to the Order. Rancisis preferred using his Force powers over his lightsaber in combat. However, Rancisis was a leader in spirit. He was widely respected for his quiet wisdom and devotion to the Force.\nOppo was Force-sensitive and had very highly developed Force powers he could utilize in combat. He was also very adept with his lightsaber, and a formidable foe in hand to hand combat as well, because of his four arms and long tail, with which he could make surprising strikes on an opponent. Rancisis was able to employ Battle Meditation. When in battle, Rancisis could use his tail as a potent weapon when he was forced to defend himself.\nRancisis was an excellent strategist and top Jedi military advisor, with his Jedi-counseled military tactics being cunning and effective.\nHe wore brown Jedi robes and wielded a green-bladed lightsaber.\nOppo Rancisis made his first canonical appearance in the 1999 film Star Wars: Episode I The Phantom Menace as a background character with no speaking lines and was designed by storyboard artist Benton Jewy. Oppo was seen again in the 2002 film Star Wars: Episode II Attack of the Clones again as a background character on the Jedi High Council without any speaking lines.\nRancisis was set to make several other appearances in Star Wars: The Clone Wars television series before its cancellation. One such appearance was seen in the Sixth season and the other was in the Legacy project. He had no speaking lines and would have had his lightsaber visible in the latter appearance.\nDesigns for the lightsaber were based on Count Dooku's lightsaber and were revealed by Dave Filoni and Pablo Hidalgo during their The Untold Clone Wars panel at Celebration Anaheim in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Oppo_Rancisis",
  "/wiki/Oppo_Rancisis/Legends",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Lightsabers_and_Jedi_Equipment",
  "/wiki/Thisspias",
  "/wiki/Thisspiasian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Blood_Monarchy",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_High_Command",
  "/wiki/Yaddle",
  "/wiki/Dal_Azim",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Clone_Wars",
  "/wiki/The_Force",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Reproduction",
  "/wiki/Youngling",
  "/wiki/Padawan",
  "/wiki/Jedi_training",
  "/wiki/Blood_Monarch",
  "/wiki/Jedi",
  "/wiki/Slavery",
  "/wiki/Attack_on_the_Zygerrian_slave_camp",
  "/wiki/Zygerrian",
  "/wiki/Zygerrian_slave_camp",
  "/wiki/Twi%27lek",
  "/wiki/Lourna_Dee",
  "/wiki/Carida_Academy",
  "/wiki/232_BBY",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Emergences",
  "/wiki/Lina_Soh",
  "/wiki/Nihil",
  "/wiki/Hologram",
  "/wiki/Adampo",
  "/wiki/Great_Sith_War",
  "/wiki/Rana_Kant",
  "/wiki/Jora_Malli",
  "/wiki/Battle_of_Kur",
  "/wiki/High_Council_Chamber",
  "/wiki/Battle_of_Naboo",
  "/wiki/Jedi_Council_Chamber",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Sith",
  "/wiki/Mace_Windu",
  "/wiki/Anakin_Skywalker",
  "/wiki/Tatooine",
  "/wiki/Chosen_One",
  "/wiki/Death",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Naboo",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Separatist_Crisis",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Clone_trooper",
  "/wiki/Cloning",
  "/wiki/Kamino",
  "/wiki/Sifo-Dyas",
  "/wiki/Geonosis",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Confederacy_military",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hissrich",
  "/wiki/Star_system",
  "/wiki/Kit_Fisto",
  "/wiki/Tenth_Brother",
  "/wiki/Knight",
  "/wiki/Rissa_Mano",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Queen",
  "/wiki/Julia",
  "/wiki/Bardotta",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Dagoyan_Masters",
  "/wiki/Plo_Koon",
  "/wiki/Lightsaber",
  "/wiki/Mission_to_Oba_Diah_(Clone_Wars)",
  "/wiki/Mission_to_Oba_Diah_(pre%E2%80%93Naboo_Crisis)",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Army",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Force_spirit",
  "/wiki/Darth_Maul",
  "/wiki/Meditation",
  "/wiki/Aayla_Secura",
  "/wiki/Luminara_Unduli",
  "/wiki/Sugi",
  "/wiki/Arms_dealer",
  "/wiki/Kyber_crystal",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Utapau",
  "/wiki/Mission_to_Utapau",
  "/wiki/Crystal",
  "/wiki/Galaxy",
  "/wiki/Superweapon",
  "/wiki/Atrocity_on_Mahranee",
  "/wiki/Mahranee",
  "/wiki/Homeworld",
  "/wiki/Mahran",
  "/wiki/Species",
  "/wiki/Siege_of_Saleucami",
  "/wiki/Quinlan_Vos",
  "/wiki/Order_66",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Galactic_Empire",
  "/wiki/Hunt_for_Eeth_Koth",
  "/wiki/Jedi_hunter",
  "/wiki/Inquisitorius",
  "/wiki/Battle_Meditation",
  "/wiki/Oppo_Rancisis%27_lightsaber",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Benton_Jew",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/The_Clone_Wars_Legacy",
  "/wiki/Dooku%27s_lightsaber",
  "/wiki/Dave_Filoni",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/2015",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/The_Lost_One",
  "/wiki/Voices",
  "/wiki/The_Big_Bang",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/Category:Audio_files_of_Oppo_Rancisis",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Journey_Through_Space_(2015)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Yoda_and_Other_Users_of_the_Force",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Unlimited_Power",
  "/wiki/Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Ephru_Shinn",
  "/wiki/Lahru",
  "/wiki/Pra-Tre_Veter",
  "/wiki/Keaton_Murag",
  "/wiki/Ada-Li_Carro",
  "/wiki/Teri_Rosason",
  "/wiki/Yarael_Poof",
  "/wiki/Stellan_Gios",
  "/wiki/Soleil_Agra",
  "/wiki/Ry_Ki_Sakka",
  "/wiki/32_BBY",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Saesee_Tiin",
  "/wiki/Even_Piell",
  "/wiki/Eeth_Koth",
  "/wiki/Adi_Gallia",
  "/wiki/Depa_Billaba",
  "/wiki/22_BBY",
  "/wiki/Coleman_Trebor",
  "/wiki/Shaak_Ti",
  "/wiki/20_BBY",
  "/wiki/Coleman_Kcaj"
 ]
}