{
 "name": "OrbaLin",
 "display_name": "OrbaLin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 230 BBY",
      "Ataraxia",
      "Eiram system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "OrbaLin was a Ugor male Jedi Master and Jedi archivist who lived during the High Republic Era. Serving aboard the Starlight Beacon space station, OrbaLin led the autopsy of a Hutt trader whose corpse had been found on a derelict starship after a Nihil attack. Later, OrbaLin represented Starlight's Jedi at the Valo Republic Fair while Marshal Avar Kriss was off fighting the Drengir, and fought Nihil raiders during their attack. Due to the largely formless nature of his species, OrbaLin wore an environment suit in order to function in environments tolerable to humans and near-humans.\nOrbaLin, a male Ugor, was the first member of his species to ever join the Jedi Order. During the High Republic Era, he became a Jedi Master and the resident Jedi archivist aboard the space station Starlight Beacon. At the station's dedication ceremony, OrbaLin encountered recently elevated Jedi Master Elzar Mann and had a conversation with him, although Mann found him boring. Later, OrbaLin oversaw the autopsy of a Hutt who had been found on a derelict starship after a Nihil attack alongside Jedi Knight Vernestra Rwoh and her Padawan, Imri Cantaros.\nWhile the autopsy was ongoing, OrbaLin assured Master Estala Maru that they were following strict quarantine procedures. However, he found that the attack had not been what killed the Hutt; instead, its systems had seemingly been infected by a root system. As OrbaLin reported the findings to Maru, the Hutt's corpse exploded, releasing the sentient carnivorous plants known as the Drengir, who proceeded to attack the station. The attack was eventually thwarted when Knight Keeve Trennis, on the planet Sedri Minor, used a mind trick on the Drengir hivemind to momentarily force them into a galaxy-wide retreat. In the aftermath, Starlight's Jedi Marshal Avar Kriss led a campaign against the Drengir across the worlds in the Outer Rim under threat, making an alliance with factions of the Hutt Clan led by Myarga.\nDuring the lead-up to the Republic Fair on Valo, OrbaLin came to represent the Starlight Beacon in Kriss' stead while she was off fighting the Drengir, to the private disappointment of Mann, who had hoped to see Kriss. The Valo Republic Fair, however, came under attack from the Nihil pirates, and OrbaLin teamed up with the journalist Rhil Dairo to reach the Starlight Pavilion and try to send a distress signal during the chaos.\nBefore they could send the distress signal, OrbaLin and Rhil were attacked by Lourna Dee and some of her underlings. OrbaLin fought the Twi'lek marauder and her compatriots among a display of priceless historical Jedi artifacts. The archivist lectured the attackers on the artifacts while throwing the same artifacts at them and simultaneously wielding his lightsaber. The Ugor managed to defeat them through a combination of boring them and skillful use of his blade.\nAfter defeating Lourna and her fellow Nihil, OrbaLin and Dairo sent the distress signal.\nAn Ugor male, OrbaLin wore an environment suit in most locations in order to maintain a humanoid form, using pseudopods to animate the suit and to move. His true form was green and amorphous. He enjoyed bursting into lectures about historical subjects and the artifacts he looked after, although Master Elzar Mann considered him capable of boring the wings off of a Drethi. The archivist was insistent on the importance of proper procedure, but also somewhat witty, interrupting Cantaros complaining about how disgusting he found the autopsy to point out that the Padawan had had a good question regarding the causes of the Hutt's death. He was stoic in the face of danger, reacting to a Drengir attack by telling Maru that the station's quarantine measures were about to be tested to their limits.\nOrbaLin was experienced in the use of Force powers such as telekinesis, as well as lightsaber combat. When his environment suit was breached during a fight with Nihil, the archivist used the amorphous nature of his true form against his opponents to a considerable advantage.\nFurthermore, OrbaLin was masterful at weaponizing lectures on historical artifacts. When cornered by Lourna Dee and two other members of her Tempest at the Valo Republic Fair, the archivist engaged the marauders in combat while lecturing them about Jedi artifacts he threw at them. By boring the pirates with historical details of arcane Jedi technology, OrbaLin disoriented his attackers and gained the upper hand.\nOrbaLin wore a white environment suit with gold detailing and brown gloves and belt, and a domed blue helmet with two breathing tubes. The suit had a compartment in one sleeve for OrbaLin's short, green-bladed lightsaber. During the autopsy, he rode a one-person repulsorlift platform with an attached control panel.\nOrbaLin first appeared in the fourth issue of the comic book series Star Wars: The High Republic, written by Cavan Scott.\nThe comic's eighth issue contains a continuity error with Scott's novel The High Republic: The Rising Storm regarding OrbaLin's whereabouts: the novel depicts OrbaLin as present on Valo for the Fair, representing the Starlight Beacon while Avar Kriss is off fighting the Drengir on Mulita. The High Republic  8, however, depicts OrbaLin participating in the battle on Mulita at the same time. Scott admitted that this was a mistake, and said he had come up with an in-universe explanation for the error to be revealed in future media.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic_(2021)_8",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/The_High_Republic_(2021)_6",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/230_BBY",
  "/wiki/Ataraxia",
  "/wiki/Eiram_system",
  "/wiki/Ugor",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_archivist",
  "/wiki/High_Republic_Era",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Hutt",
  "/wiki/Unidentified_Hutt_trader",
  "/wiki/Starship",
  "/wiki/Nihil",
  "/wiki/Attack_in_the_Kazlin_system",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Marshal",
  "/wiki/Avar_Kriss",
  "/wiki/Drengir",
  "/wiki/Attack_on_Valo",
  "/wiki/Human",
  "/wiki/Near-human",
  "/wiki/Species",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Elzar_Mann",
  "/wiki/Jedi_Knight",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Padawan",
  "/wiki/Imri_Cantaros",
  "/wiki/Estala_Maru",
  "/wiki/Plant",
  "/wiki/Sentience",
  "/wiki/Carnivorous_plant",
  "/wiki/Assault_on_Starlight_Beacon",
  "/wiki/Keeve_Trennis",
  "/wiki/Planet",
  "/wiki/Sedri_Minor",
  "/wiki/Mind_trick",
  "/wiki/Galaxy",
  "/wiki/Jedi",
  "/wiki/Drengir_crisis",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hutt_Clan",
  "/wiki/Myarga",
  "/wiki/Republic_Fair",
  "/wiki/Valo",
  "/wiki/Pirate",
  "/wiki/Journalist",
  "/wiki/Rhil_Dairo",
  "/wiki/Starlight_Pavilion",
  "/wiki/Distress_signal",
  "/wiki/Lourna_Dee",
  "/wiki/Twi%27lek",
  "/wiki/Jedi_artifact",
  "/wiki/EVA_suit",
  "/wiki/Humanoid",
  "/wiki/Drethi",
  "/wiki/Force_power",
  "/wiki/Telekinesis",
  "/wiki/Lightsaber_combat",
  "/wiki/Lourna_Dee%27s_Tempest",
  "/wiki/Glove",
  "/wiki/Belt",
  "/wiki/Lightsaber",
  "/wiki/Repulsorlift",
  "/wiki/The_High_Republic_(2021)_4",
  "/wiki/Star_Wars:_The_High_Republic_(Marvel_Comics_2021)",
  "/wiki/Cavan_Scott",
  "/wiki/Assault_on_Mulita",
  "/wiki/Mulita",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/StarWars.com",
  "/wiki/Death",
  "/wiki/The_High_Republic_(2021)_2",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/File:CavanOrbaLin1.jpg",
  "/wiki/File:CavanOrbaLin2.jpg"
 ]
}