{
 "name": "Orden_Tarc",
 "display_name": "Orden Tarc",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grayish blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Naboo Security Forces"
     ]
    }
   ]
  }
 ],
 "content": "Orden Tarc was a Human male officer of the Royal Naboo Security Forces who lived in the Naboo system during the time of the Galactic Civil War.\nBy the time of the Battle of Yavin, Orden Tarc held the rank of lieutenant of the Royal Naboo Security Forces and was stationed in the city of Narmle, on Naboo's moon of Rori. He served as a liaison officer between the RSF and the Narmle Militia, the local police force, a complex position since Narmle Militia members were quite reluctant to work with the Royal Naboo Security Forces.\nIn 1 ABY, Lieutenant Tarc requested the assistance of the Narmle Militia to investigate into a number of break-ins at cybernetic labs on Rori; but the Militia only dispatched an independent spacer. Nonetheless, Tarc decided to make use of the spacer to find the perpetrator. Tarc first dispatched the spacer to the Cybernetics Lab in Narmle that was the location of the most recent break-in. The spacer discovered that an individual known as Ponda Baba attempted to log onto one of the lab data terminals. According to RSF records, Ponda Baba was an Aqualish small-time thug who usually worked out of the Tatooine system. Tarc figured out that Baba was looking for cybernetics after he lost an arm in an altercation in Mos Eisley. Lieutenant Tarc then ordered the spacer to interrogate local criminals, the Neo-Cobral and the Garyn Raiders, to find Ponda Baba. The spacer visited the Neo-Cobral Base and the Garyn Raider Base, and the Garyn Raiders finally revealed that Baba approached them but they refused to work with him. As the spacer learned how to contact Ponda Baba from the Garyn Raiders, the spacer arranged a meeting with the Aqualish. However, Baba sent henchmen from the Gundark gang to attack the spacer. Lieutenant Tarc therefore dispatchd the spacer to the Gundark Base. There, a Gundark thug revealed that the Aqualish was hiding out at a small camp on the outskirts of Narmle. The spacer finally confronted Ponda Baba but the latter managed to escape and eventually left the moon. Lieutenant Tarc later released Ponda Baba's name and a holographic image to all security forces in the Naboo system. This would prevent the criminal to come back in this part of the galaxy and Tarc considered the case closed.\nOrden Tarc was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Orden Tarc was added to the game with the release of the \"Game Update 12\", on August 10, 2009.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Gray",
  "/wiki/Blue",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Naboo_system/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/City/Legends",
  "/wiki/Narmle_(city)",
  "/wiki/Naboo/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Narmle_Militia",
  "/wiki/1_ABY/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Cybernetics_Lab",
  "/wiki/Ponda_Baba/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Tatoo_system/Legends",
  "/wiki/Cho_sun/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Neo-Cobral",
  "/wiki/Garyn_Raiders",
  "/wiki/Neo-Cobral_Base",
  "/wiki/Garyn_Raider_Base",
  "/wiki/Gundark_gang",
  "/wiki/Gundark_Base",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_10",
  "/wiki/2009",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}