{
 "name": "Ore'mun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "25",
      "793 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rakata"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Infinite Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ore'mun was a Force-sensitive Rakatan who served in the species' Infinite Empire as a spy for Predor Skal'nas, a Rakatan overlord. When Tul'kar, another Predor, led Rakatan forces to the world of Tatooine in 25,793 BBY to gather slaves and cull Force-sensitives from the natives, Ore'mun accompanied him on Skal'nas's orders. Ore'mun lusted for Tul'kar's command of the conquest, and when it was given to the spy via new orders from Skal'nas, Tul'kar angrily killed a smug Ore'mun with Force lightning and prepared to eat the corpse.\nOre'mun was a Rakatan, a member of a naturally Force-sensitive species whose Infinite Empire ruled the galaxy. The Force fueled all Rakatan technology, and the Empire accordingly sought out and enslaved worlds whose populations were strong in the Force through the use of Force-sensitives known as Force Hounds. In 25,793 BBY, Ore'mun served the Infinite Empire as a spy for Predor Skal'nas, a Rakatan overlord. Skal'nas dispatched Ore'mun to accompany the subordinate yet ambitious Predor Tul'kar on a conquest of the planet Tatooine, which had been discovered by Tul'kar's Force Hound Xesh.\nThe starships of the Infinite Empire arrived at the lush world, and Rakatan warriors subjugated the native Kumumgah. On the outskirts of a burning city, Ore'mun watched as Xesh identified Force-sensitives among the locals; the spy then received new orders transmitted from Skal'nas. Ore'mun complimented Tul'kar on Xesh's abilities in such a way as to point out that Skal'nas was his superior, and then confidently relayed the orders: Tul'kar had been summoned to meet with Skal'nas on the planet Byss, and Ore'mun was to remain on Tatooine to oversee the culling of local Force-sensitives. Furious with the display of smugness, Tul'kar telekinetically choked Ore'mun and killed the spy with Force lightning. Ore'mun's body was then prepared by Tul'kar's minions so the Predor could eat his conquered foe.\nAs a Rakatan, Ore'mun was sensitive to the Force. Ore'mun was ambitious and lusted for Predor Tul'kar's command of the conquest of Tatooine, emotions that Tul'kar was able to sense through the Force. The spy took pleasure in relaying Skal'nas's order that Tul'kar return to Byss, and took care to remind the Predor that he was Skal'nas's inferior. Ore'mun had green skin, brown eyes, and no hair.\nOre'mun's sole appearance in Star Wars canon is in Dawn of the Jedi: Force Storm 1, a comic issue by John Ostrander and Jan Duursema that was released by Dark Horse Comics in February 2012. It does not reveal Ore'mun's sex.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/25,793_BBY",
  "/wiki/Tatooine/Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Color/Legends",
  "/wiki/Infinite_Empire",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Species/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Predor",
  "/wiki/Skal%27nas",
  "/wiki/Tul%27kar",
  "/wiki/Planet/Legends",
  "/wiki/Conquest_of_Tatooine",
  "/wiki/Slavery/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Kumumgah/Legends",
  "/wiki/Death/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Cannibalism",
  "/wiki/The_galaxy/Legends",
  "/wiki/Force_Hound",
  "/wiki/Tau_(individual)",
  "/wiki/File:Oremun-death-DotJ1.png",
  "/wiki/Rakatan_ship",
  "/wiki/Unidentified_Tatooine_city",
  "/wiki/Byss/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Category:Images_of_Ore%27mun",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Dark_Horse_Comics",
  "/wiki/February",
  "/wiki/2012",
  "/wiki/Gender/Legends",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/The_Unknown_Regions",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi_0"
 ]
}