{
 "name": "Orion_Ferret",
 "display_name": "Orion Ferret",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Orion Ferret was a Human male weapons trader and gunrunner who owned and operated the space station Bazarre, which served as a large black market hub during the era of the Galactic Civil War. Known for his unscrupulous business practices, Ferret used a pet watchbeast called Ceasar to protect his wares on the junk planet Patch-4. Ferret once attempted to betray and kill Rebel leaders Lando Calrissian and Luke Skywalker over a TIE fighter sale, only for his plot to be exposed and foiled.\nA Human male, Orion Ferret was the owner and proprietor of Bazarre, a massive space station that served as a widely trafficked hub for merchants during the Galactic Civil War. Ferret himself was a noted gunrunner and weapons dealer, and ran a station where almost anything could be bought and sold. He also made use of the nearby garbage planet of Patch-4, using a dangerous watchbeast named Ceasar to protect the assets he hid there, while terrorizing the people who lived upon it. During the height of the Galactic Civil War, Ferret made arrangements to sell four black market TIE fighters to the Rebel Alliance. The deal was brokered with two Rebel leaders—Luke Skywalker and Lando Calrissian, the latter a longtime smuggler and rogue who had past dealings with Ferret—who met with Ferret aboard Bazarre and negotiated the sale.\nAfter receiving his payment, Ferret told the Rebels that the TIE fighters were hidden in the wastelands of Patch-4. He gave them the proper coordinates and allowed them the use of one of his shuttles to pick them up. Lando, who distrusted him, left the Wookiee Chewbacca behind on Bazarre to keep a watch on Ferret. Calrissian had good cause to be suspicious—Ferret had begun to plan their deaths before they arrived, plotting to remotely activate the shuttle's ejection seats and keeping the money, the TIE fighters and Calrissian's Millennium Falcon starship. When Chewbacca's presence complicating the plan, Ferret instead pivoted to a backup, relying on Ceasar to kill the Rebels instead. With the aid of his assistant P'Lor, Ferret used a gelatinous spritzer solution to imprison Chewbacca, who managed to break free.\nWith an enraged Wookiee chasing him through the corridors of Bazarre, Ferret attempted to flee in his personal shuttlecraft, but a few well-aimed shots from Chewbacca's bowcaster rendered the ship unusable. Chewbacca eventually cornered Ferret and threatened to rip the man's head off, only to be stopped by the timely return of Calrissian and Skywalker, who had managed to subdue Ceasar by commandeering the sonic pacifier Ferret used to control the beast. With their TIEs safely secured, the Rebels called Chewbacca off, allowing Ferret to live.\nA Human notorious for his untrustworthiness, Orion Ferret garnered a bad reputation for duplicity from almost everyone he did business with. Those qualities, along with his complete lack of regard for everyone he came into contact with—and for the welfare of innocent people—made Ferret into a notorious underworld figure. However, Ferret was a physically weak and unimposing man, more comfortable concocting secret plans than asserting himself in person.\nOrion Ferret made his first and only appearance in Star Wars 59, released on February 16, 1982, which was written by David Michelinie and illustrated by Walt Simonson, who also did the cover art.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Orion_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Bazarre",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Watchbeast",
  "/wiki/Ceasar",
  "/wiki/Planet/Legends",
  "/wiki/Patch-4",
  "/wiki/Death/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Smuggler/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Starship/Legends",
  "/wiki/P%27Lor",
  "/wiki/Spritzer",
  "/wiki/Bowcaster/Legends",
  "/wiki/Sonic_pacifier",
  "/wiki/Star_Wars_(1977)_59",
  "/wiki/February_16",
  "/wiki/1982",
  "/wiki/David_Michelinie",
  "/wiki/Walter_Simonson",
  "/wiki/Star_Wars_(1977)_58",
  "/wiki/Star_Wars_(1977)_60",
  "/wiki/Star_Wars_(1977)_61",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Comics_Companion"
 ]
}