{
 "name": "Oris Kyrell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jelucan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Second-wave",
      "Kyrell family",
      "Kyrell family"
     ]
    }
   ]
  }
 ],
 "content": "Oris Kyrell was a male human aristocrat from the planet Jelucan. He was married to Ganaire Kyrell and was the father of Dalven and Thane Kyrell. Oris was abusive towards Thane, though he took pride in Dalven as his oldest son. He also disapproved of Thane's childhood friendship with Ciena Ree, due to the rift between her people and his aristocratic class.\nOris Kyrell was the husband of Ganaire Kyrell and the father of Dalven and Thane Kyrell. He was an aristocrat and a descendant of the Second-wave migrants that settled on the planet Jelucan. Oris worked as an accountant during the Age of the Empire. He and his wife Ganaire lived in a grand home that was layered with gold tiles. Oris and his family attended the ceremony celebrating the Galactic Empire's Annexation of Jelucan in 11 BBY. When his wife Ganaire complained about not bringing their hovercraft, Oris responded that the hangars would be too crowded and insisted that the boys could keep up. After Grand Moff Wilhuff Tarkin gave a speech, Oris and his wife attended a private reception with several \"Very Important Officials.\"\nThey left Dalven to babysit his younger brother Thane. However, Dalven abandoned Thane to spend time with his friends. As a result, Thane befriended a Jelucani First Waver girl named Ciena Ree. After meeting Tarkin, the two decided to aspire for careers in the Imperial Navy. Despite Thane's ambitions, Oris took little interest in the intellectual development of his younger son. He instead showered favors over his older son Dalven and even used bribery to secure Dalven a place at an Imperial Academy. By contrast, Oris treated his younger son with disdain. When Thane was fifteen years old, he even beat him up in a fit of rage. On another occasion, Oris broke up a fight between his sons after Dalven insulted Thane's friend Ciena.\nFollowing the destruction of Alderaan, Thane deserted the Imperial Navy out of disillusionment with the Empire's brutal tactics. Thane returned to Jelucan but decided not to seek refuge with his parents. The former TIE fighter pilot did not want to endure his father's drunken contempt or his mother's outrage. In order to protect Thane, Ciena Ree, who had become a Lieutenant Commander in the Imperial Navy, filed a report claiming that Thane had committed suicide. Thane later joined the Alliance to Restore the Republic. After the Battle of Hoth, Oris and Ganaire were halfway across the planet on a business trip when Thane visited Jelucan to offer support to his friend Ciena, whose mother Verine Ree had been framed for embezzlement. Oris, Ganaire, and Dalven presumably believed that Thane had perished.\nOris Kyrell was a snobbish and temperamental human man who built a large house that had gold tiles. As a second-waver, he looked down upon the first wave of settlers who dwelled in Jelucan's valleys. Oris also had a hot temper and would use physical force to discipline his sons Dalven and Thane. He favored his older son Dalven over his younger son Thane. Having high hopes for Dalven, Oris used bribery to secure his older son a place at an Imperial Academy but left his younger son to do the hard work himself to attend one.\nBy contrast, Oris had a bad relationship with Thane. When Thane was fifteen years old, he beat up his younger son in a fit of rage. As a result, Thane developed a hatred for his father. As an adult, he did not maintain contact with his family, not wanting to endure Oris' drunken rages. On one occasion, Thane expressed anger when his friend Ciena likened him to his father. Oris was also a frequent consumer of alcoholic beverages. He frequented pubs and was known to enter into drunken rages which he would often take out on his family. Despite this, Oris loved his younger son at least a little, tolerating his friendship with Ciena Ree in spite that she was a First Waver, even letting her to go to their home, and he said farewell along her wife to Thane when he left for the Imperial Academy of Coruscant.\nOris Kyrell worked as an accountant and was regarded as dishonest and corrupt by his younger son Thane.\nOris Kyrell first appeared as a background character in the canon novel Lost Stars, which was written by Claudia Gray and published in 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jelucan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Second-wave",
  "/wiki/Kyrell_family",
  "/wiki/Planet",
  "/wiki/Marriage",
  "/wiki/Ganaire_Kyrell",
  "/wiki/Parent",
  "/wiki/Dalven_Kyrell",
  "/wiki/Thane_Kyrell",
  "/wiki/Ciena_Ree",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Annexation_of_Jelucan",
  "/wiki/11_BBY",
  "/wiki/Hovercraft",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/First_Wavers",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Academy",
  "/wiki/Standard_year",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Lieutenant_Commander",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Hoth",
  "/wiki/Verine_Ree",
  "/wiki/Accountant/Legends",
  "/wiki/Lost_Stars",
  "/wiki/Claudia_Gray",
  "/wiki/2015",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Lost_Stars_(webcomic)"
 ]
}