{
 "name": "Orka",
 "display_name": "Orka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chad"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.05 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Office of Acquisitions",
      "Team Colossus"
     ]
    }
   ]
  }
 ],
 "content": "Orka was a male Chadra-Fan who ran the Office of Acquisitions on the Colossus with his partner Flix. Of the pair, it was Orka who took care of negotiations.\nOrka and his partner Flix ran the Office of Acquisitions, a starship parts shop on the Colossus platform. Of the pair, it was Orka who took care of negotiations. They had a DUM-series pit droid named G-LN who assisted them.\nDuring the New Republic era, Orka and Flix were visited by the \"mechanic\" and undercover Resistance spy Kazuda Xiono, who had unwittingly entered into a race with Ace Squadron pilot Torra Doza. Orka and Flix did not take Xiono seriously until Xiono's fellow mechanic Neeku Vozo produced Xiono's acquisitions order. Since Xiono lacked the funds to pay for the starship parts, Orka agreed to give Xiono second-hand parts in return for a gorg for lunch. Xiono managed to obtain the gorg but found Orka and Flix eating. Still honoring their agreement, they gave Xiono three boxes of spareparts that they did not need.\nOrka and Flix were later present at their shop when Xiono visited to purchase a ZX-19 compressor. The two giggled with Orka asking if Kaz had brought credits this time. While Kaz was purchasing the compressor, the two took an interest in Kaz's lucky trophy but the youth refused to part with his prize, which he had won during a space race. Orka responded that Xiono could live comfortably for a few months if he sold his trophy. Xiono reiterated his refusal to sell his trophy.\nShortly later, another of Jarek Yeager's employees Tam Ryvora entered the store and chastised Xiono for running behind schedule. Later that day, the Colossus was raided by the Quarren pirate Kragan Gorr's Warbird gang during a Triple dark storm.\nWhile Team Fireball were working on upgrading the Colossus' anti-air defense system, Xiono and BB-8 visited the Office of Acquisitions seeking a CoMar Tri-Tracker chip. Orka claimed that his store had five of those chips, six hyperdrive cores, and a crate of kyber crystals. Flix however pointed out that Orka was joking. Orka laughed and quipped that they barely had five credits for lunch. After Flix directed Xiono to the scavengers, Orka was pessimistic about the youth's chances of success. Xiono managed to obtain a tri-tracker chip from the undercover pirate Synara San. Later, Kragan's Warbirds raided the Colossus as second time.\nLater, Orka and Flix were manning the counter when they were robbed by the Snivvian criminal Narb, who forced them at gunpoint to hand over several crates. Orka and Flix complied. As Narb backed out of the shop, Orka activated a trapdoor while Flix retrieved the crates. When Narb's brother Nod came into the shop look for Narb, he fell for the same trap.\nOrka and Flix later obtained a treasure chest from the salvager and undercover pirate Synara San. The two returned to their shop where Orka opened the chest only to discover that it was full of thermal detonators. Orka accidentally triggered the detonator's countdown mechanism. Fortunately, the detonators did not explode. After disposing of the detonators in the sea, Orka and Flix bought a new one from Synara San.\nLater, Flix and Orka went for drinks at Aunt Z's Tavern, bring their pit droid G-LN. Sensing that G-LN was down, Orka tried to cheer him up by serving him blurrgfire. However, this cause G-LN to go on a rampage through the Tavern, annoying two service droids including Glitch and the Klatooinian merchant Bolza Grool. These droids and Grool roughed up G-LN. Flix and Orka soon found G-LN on the floor and decided that the blurrgfire did not agree with their droid. Unperturbed, Orka called for a refill.\nAce leader Hype Fazon later brought his astromech droid R4-G77, telling Orka and Flix that he thought that the droid had a bad motivator. Orka led a reluctant R4-G77 behind the counter to have a look. However, R4 refused to be worked on and fought back with a spark projector, throwing the shop into disarray. Orka managed to subdue R4. Flix remarked that it was not so bad and Orka expressed agreement before slumping to the floor.\nIn return for supplying Team Fireball with spareparts for the Fireball, Orka and Flix managed to hire Kaz and BB-8 to look after their shop for a day while they visited Flix's mother. While the two were on holiday, the shop was visited by Teroj Kee, an alien First Order agent who wanted to obtain their phase connector. Following a struggle with BB-8, Teroj stole the phase connector. However, Kaz managed to prevent him from escaping offworld by downing his ship with the help of Bitey.\nWhen Orka and Flix returned, they expressed shock at the messy state of their shop. Kaz related to them Teroj's attempted heist of the phase connector. Orka praised Kaz for preventing Teroj from escaping offworld with the technology and explained that Teroj was an enemy of him and Flix, who had been trying to hurt their business for years. While Orka and Flix were grateful to Kaz for stopping Teroj, they still insisted that he clean up the mess.\nAs the First Order occupation grew more repressive, Orka and Flix came up with a plan to escape the Colossus by smuggling themselves in a crate with their pet Gorg Bitey and and G-LN to Flix's mother on Talivar. They encountered Kaz and CB-23, who were on a mission to free Yeager and liberate the Colossus. Orka and Flix were skeptical that Kaz's plan would succeed. However, they were proven wrong and Kaz's resistance cell not only succeeded in expelling the First Order but taking the Colossus into hyperspace.\nFollowing the Battle of Castilon, Orka and Flix remained aboard the Colossus after the space station fled into hyperspace. The two friends visited Aunt Z's Tavern when the station experienced problems with its gravity generator, causing them to float. While Flix was despondent, Orka enjoyed floating around in zero gravity.\nWhile traveling through space, the Colossus began to run out of supplies particularly food. Following two attempts, Kaz and Torra Doza managed to hunt down a giant flying jakoosk on the icy world of Celsor 3. When the jakoosk's flesh was served to the public, Orka helped himself to a plate.\nWith the Colossus running low on fuel, Orka accompanied Flix, Kaz, Torra, and CB-23 on a mission to Drahgor III to obtain fuel for the space station. The refueling station on Drahgor III was run by several relatives of Flix, whom he had strained relations. Against the wishes of his family, Flix had attempted a career as a cantina singer before settling in the Colossus with Orka. Unaware of this famil history, Orka tried to reassure Flix that his family would welcome him. However, Flix was pessimistic.\nDue to the turbulent atmosphere on Drahgor III, the descent proved dangerous for the group's Star Commuter 2000 shuttle, with Orka and Flix almost being sucked out. Following for a rough landing, the group met several of Flix's relatives including his cousin Flanx, who was contemptous towards Flix. Flix also disagreed with Flanx's deep core drilling operations, believing that they were disturbing the indigenous Karnex dragons' habitat. Flanx dismissed Flix's concerns, regarding the dragons to be legend. Despite a frosty reception, Kaz managed to convince a reluctant Flanx to give them fuel in return for helping to restart a driller that had gone offline.\nOrka accompanied Flix, Kaz, Torra, CB-23 and Flanx down an elevator into the depths of Drahgor III. During the descent, the elevator was disturbed by a karnex dragon, which dislodged rocks that cause the elevator carriage to jam. Orka along with Torra were stuck on the shaft while the others descended in the carriage into the depths of the planet. Flix and the others managed to escape the doomed carriage and find their way to the bottom.\nAt Kaz's suggestion, Orka and Torra agreed to climb the shaft to the surface in order to get a shuttle to rescue their friends. Due to his small physique, Orka was exhausted by the climb and piggy-backed on Torra for a while. Orka wanted to give up but Torra urged him to continue by telling him that she needed his help to fly the shuttle. Reaching the surface, Orka and Torra met the other Gozzos and convinced them to let them fly a shuttle down to help rescue Flix, Flanx and the others. Orka also convinced the other Gozzos that Flix was entitled to get access to fuel as a member of the family. Orka's resolve gained him the respect of Flix's cousins.\nOrka and Torra then flew the shuttle into the depths of Drahgor III. By that stage, Flix and the others had escaped several Karnex dragons by using bright lights to temporarily blind them. Realizing that his driling activities was encroaching on the dragons' natural habitat, Flanx used the drill to seal the cave and announced that all deep drilling operations would end. Together, the group returned to the surface on a shuttle. Flix and Flanx reconciled, with the latter allowing Team Colossus to obtain two giant tanks of fuel. Orka and the others then returned to the Colossus with their cargo.\nOrka and Flix accompanied the rest of the Colossus community when they attempted to settle on the ocean world of Aeos, which had a similar environment to Castilon. Despite an initially hostile first contact with the indigenous Aeosians, the Aeosian Queen agreed to let them settle on the planet after Kaz helped to broke peace. However, the Colossus inhabitants were forced to leave after the First Order discovered their presence and attacked them.\nOrka, Flix, and G-LN later attended a townhall meeting hosted by Captain Doza where the residents agreed to aid Kanan, Yeager, and Tamara to fight against the pursuing First Order Resurgent-class Star Destroyer Thunderer during a battle in the Barabesh system.\nOrka had brown fur, a gray beard and eyebrows, and black eyes. He had a good sense for business and negotiations. Orka was also known for his sense of humor. He once joked about his business, the Office of Acquisitions, stocking things that they did not have.\nOrka regarded Teroj Kee as a \"slimy womp rat\" who had been trying to steal from their business for years. While he was grateful towards Kaz for stopping Teroj from stealing their phase connector, he still insisted that Kaz clean the mess left by Teroj during his heist.\nDue to his short physique, Orka had trouble climbing a long shaft while on Drahgor III. Orka was also a loyal friend who spoke up for Flix, insisting that he was entitled to access some of his flock's fuel as a member of the family. Orka also rescued his friends who were stranded in the depths of Drahgor III.\nOrka and Flix were skeptical that Kaz's plan to liberate the Colossus from the First Order would succeed due to the military might of the First Order.\nIn addition to his mechanical skills, Orka was also able to pilot a Star Commuter 2000 shuttle.\nOrka is a character created and developed for the show Star Wars Resistance. He is voiced by Bobby Moynihan. During the Coffee with Kenobi podcast on September 30, 2019, producers Justin Ridge and Brandon Auman confirmed that Orka was in a romantic relationship with Flix. When Moynihan first received the script, Orka was referred to as \"Oscar.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ace_Squadron_(Star_Wars_Encyclopedia)",
  "/wiki/Special:Upload",
  "/wiki/Chad",
  "/wiki/Chadra-Fan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Office_of_Acquisitions",
  "/wiki/Team_Colossus",
  "/wiki/Colossus",
  "/wiki/Flix",
  "/wiki/DUM-series_pit_droid",
  "/wiki/G-LN",
  "/wiki/New_Republic_era",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Kazuda_Xiono",
  "/wiki/Race_between_Kazuda_Xiono_and_Torra_Doza",
  "/wiki/Ace_Squadron",
  "/wiki/Pilot",
  "/wiki/Torra_Doza",
  "/wiki/Neeku_Vozo",
  "/wiki/Gorg",
  "/wiki/ZX-19_compressor",
  "/wiki/Credit",
  "/wiki/Kaz%27s_lucky_trophy",
  "/wiki/Jarek_Yeager",
  "/wiki/Tamara_Ryvora",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Quarren",
  "/wiki/Pirate",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Triple_dark",
  "/wiki/Team_Fireball",
  "/wiki/CoMar_Tri-Tracker_chip",
  "/wiki/Hyperdrive",
  "/wiki/Synara_San",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Snivvian",
  "/wiki/Narb",
  "/wiki/Nod",
  "/wiki/Thermal_detonator",
  "/wiki/Blurrgfire",
  "/wiki/Service_droid",
  "/wiki/G1-7CH",
  "/wiki/Klatooinian",
  "/wiki/Bolza_Grool",
  "/wiki/Hype_Fazon",
  "/wiki/Astromech_droid",
  "/wiki/R4-G77",
  "/wiki/Spark_projector",
  "/wiki/Fireball",
  "/wiki/Flix%27s_mother",
  "/wiki/Teroj_Kee",
  "/wiki/First_Order",
  "/wiki/Phase_connector",
  "/wiki/Theft_of_the_phase_connector",
  "/wiki/Talivar",
  "/wiki/Battle_of_Castilon",
  "/wiki/Hyperspace",
  "/wiki/Jakoosk",
  "/wiki/Celsor_3",
  "/wiki/CB-23",
  "/wiki/Mission_to_Drahgor_III",
  "/wiki/Star_Commuter_2000",
  "/wiki/Flanx",
  "/wiki/Karnex_dragon",
  "/wiki/Aeos_Prime",
  "/wiki/Aeosian",
  "/wiki/Unidentified_Aeosian_Queen",
  "/wiki/Escape_from_Aeos_Prime",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Thunderer",
  "/wiki/Rescue_of_Tamara_Ryvora",
  "/wiki/Barabesh_system",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Womp_rat",
  "/wiki/Amy_Beth_Christenson",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Bobby_Moynihan",
  "/wiki/September_30",
  "/wiki/2019",
  "/wiki/Justin_Ridge",
  "/wiki/Brandon_Auman",
  "/wiki/The_Recruit",
  "/wiki/The_Triple_Dark",
  "/wiki/Synara%27s_Score",
  "/wiki/The_Platform_Classic",
  "/wiki/When_Thieves_Drop_By",
  "/wiki/Treasure_Chest",
  "/wiki/G-LN_(episode)",
  "/wiki/Bucket%27s_Quest",
  "/wiki/Unmotivated",
  "/wiki/Dangerous_Business",
  "/wiki/No_Escape:_Part_1",
  "/wiki/Into_the_Unknown",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/From_Beneath",
  "/wiki/The_New_World",
  "/wiki/The_Escape",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Databank_(website)",
  "/wiki/No_Place_Safe",
  "/wiki/October_1"
 ]
}