{
 "name": "Orla_Jareni",
 "display_name": "Orla Jareni",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 230 BBY",
      "Starlight Beacon",
      "Eiram system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Umbaran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Silver"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Orla Jareni's youngling group",
      "Orla Jareni's youngling group"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Laret Soveral"
     ]
    }
   ]
  }
 ],
 "content": "Orla Jareni was an Umbaran female Jedi Master and Wayseeker during the time of the High Republic, operating independently of the Jedi High Council. As the Padawan of Jedi Master Laret Soveral, Jareni was involved in the Eiram–E'ronoh crisis. Twenty-five years later, she was one of four Jedi aboard the starship Vessel on a trip to the Starlight Beacon, having recently declared her status as a Wayseeker when the Great Hyperspace Disaster occurred. Nearly a year later and moving forward, she aided the Jedi of Starlight Beacon in personal, Drengir and Nihil related conflicts. She then helped Jedi Master Elzar Mann regain his mental balance after the Attack on Valo destabilized him, before her return with him to Starlight Beacon put her on the hunt for a dangerous, hidden threat. This threat unfortunately ended her life soon after. Many years later, her role and life would be forgotten by the Jedi Order, her file in the Jedi Archives remaining untouched until inquiries by a young Obi-Wan Kenobi rediscovered her life and story.\nDuring the High Republic Era, Orla Jareni was taken into the Jedi Order at a young age, and became friendly with Cohmac Vitus during their time together in the crèche. A notable incident in this early time was when Orla and her youngling group were able to go to the roof of the Jedi Temple to play in and experience a rare snowfall on Coruscant. The group was overseen by Master Yoda, and at one point, Orla stumbled and nearly fell off the roof. However, Yoda prevented her from falling and moved her to safety.\nOrla Jareni eventually became the Padawan of Master Laret Soveral and viewed her master as a paragon of Jedi teachings. However, as Jareni grew older, she began to question the decisions of the Jedi Council. At first, her master heard her out, and gently debated her. Eventually, Master Soveral grew exasperated, telling her that a Jedi's role was to serve, and that questioning everything was an obstruction to that goal. This recrimination hurt Jareni, and she endeavored to obey rather than question, as well as not let her master down.\nSometime during these younger years, when a self-described rebellious Padawan sneaking around the Jedi Temple, Orla Jareni found a mysterious planet carved into the wall of the Jedi Temple banquet hall. It was hidden behind a small pillar and indicated by a trail of carved stars. Orla and Cohmac, who perhaps found the carving together, then carved their full names below the image of the planet.\n\nDuring her time as a Padawn, Orla, her master, Padawan Vitus, and his master, Simmix, were asked to intervene in the burgeoning Eiram–E'ronoh crisis. It was the first mission the two Padawans had been on and both of them were elated to be allowed to fly the A-1 shuttle given to the team. This was because it was both a departure from more mundane tasks Padawans normally performed and a sign of confidence in their abilities. During their approach into the Eiram system, their masters were together in the passenger area of the craft in deep meditation. The Padawans detected an apparent distress call from a survivor of Monarch Cassel's ship, and Orla was the one to respond, steering the Jedi shuttle toward the signal. Master Soveral entered the cabin and demanded to know what had happened. Upon being filled in on the situation, the master grimly commented that the signal had only come from the ship, not a survivor. The shuttle was then shot down and crashed onto the surface of the lost moon that sat between Eiram and E'ronoh.\nFollowing the crash, Jareni and her master were unharmed, though Master Simmix had died, leaving Cohmac extremely distressed. However, their situation urged them on, and they proceeded into a nearby cave system that made up a broader network across the area. Orla's master urged them forward to keep ahead of their pursuers and to seek out the kidnapped monarchs. However, their progress was stalled by the sudden attack of a large white serpent native to the moon.\nThey fought their way through five such creatures, with Orla Jareni forced to face down one alone in an awkward position. She was unable to attack it properly, though it was equally unable to reach her. She eventually broke the deadlock and slew it. She felt pity for killing the animals, who were merely looking for food. Master Soveral gently noted to Orla that the Padawan wasn't using all of her skills in combating their nonsapient foes, which hardened Jareni to follow her master's lead. As they navigated deeper into the tunnels, Master Soveral moved on ahead, leaving Jareni to talk with Vitus. She attempted to console him over his master's loss but he proved resistant to her arguments, and they ended up walking silently for a time.\nEventually, Master Soveral stopped the group and informed them that they were under the kidnapper's base of operations, leading to the three getting ready to find a way up through the cavern tunnels. It was at this time that Queen Consort Thandeka was able to get her hands on a handheld communicator, opening an uncoded channel and helping lead the Jedi to their position. As the three waited to spring into action, Orla felt an enormous urge to reject her tactical training, which called for them to move in when sounds were furthest from the door and to instead rush in and take out the kidnappers. She resisted this urge, and the three entered the space together, protecting themselves from shots thrown their way and moving to guard the hostages. Lord Isamer, however, leapt over all of them and shot at the hostages. Master Soveral cut him in half, but the Lasat's shot struck Monarch Cassel, who had dove in the way of Isamer's efforts to kill the Queen Consort. Monarch Cassel died mere moments later, and Orla Jareni was left deeply shaken by the event, questioning for many more years both Jedi decision making and whether she should follow the call of the Force without hesitation.\nAnother notable event during Orla's time as a Padawn was when she traveled to a world whose sculptors made incredibly lifelike statues from their planet's unique stone. The statues had a sense of vitality to them that was enormously impressive and beautiful.\nTwenty-five years after the Eiram–E'ronoh crisis, Orla Jareni was now a Jedi Master and had largely come to terms with the events of the crisis. Despite this closure, she felt that certain decisions of the Jedi High Council were wrong and that she should be allowed to fully trust in her own feelings. As a result, she anointed herself as a Wayseeker and sought to leave the Core to instead travel to the frontier of the Republic. The first step in this new life was to travel to the Starlight Beacon, where she intended to buy a ship for herself to begin her journey. Orla found herself accompanying three other Jedi, Padawan Reath Silas, Jedi Knight Dez Rydan, and her old friend, now Jedi Master, Cohmas Vitus, as they were all bound for the same destination. The two friends briefly commented on the change in their lives, and that they were returning to that same area of space from a quarter of a century ago. The starship that had been hired for the mission, however, was unavailable, resulting in a last-minute replacement in the form of the Vessel, crewed by Captain Leox Gyasi, co-pilot Affie Hollow, and navigator Geode.\nJareni settled onto the ship, though she found the transit into hyperspace rougher than what she was used to. She also briefly pondered her decision to become a Wayseeker and concluded that returning to the origin point of her issues was likely the right choice. Due to her desire to find and buy a new ship, she considered it prudent to talk with the ship's crew on what sort of vessels might be suitable for her needs as she believed, unlike some other Jedi, that all non-Force-sensitives knew at least one thing she did not. The Vessel's crew also had prudent experience. However, she found herself putting off the conversation, instead making Chandrilan tea in the ship's mess, again questioning her decision. She felt that talking about buying a ship would make her choice all the more real, and she wondered aloud if she was deluding herself, and if she could find the answers she was seeking out in the wider galaxy. Realizing she was talking in the open, she agreed to keep her thoughts within for the rest of the trip.\nIt was at this point that the Great Hyperspace Disaster began, the event echoing through the Force and affecting all of the Jedi aboard the Vessel. The ship itself was suddenly hit with debris from the destroyed Legacy Run while in hyperspace, forcing repairs conducted by Reath Silas and Affie Hollow. The craft then exited hyperspace in an unknown region of space near a volatile star. Orla meanwhile, was able to sense an enormous amount of death, which rattled her, and the Jedi all moved to the communications area to contact the Starlight Beacon. There, they learned the extent of the disaster, multiple signals from across the galaxy overlapping. However, a broadcast from the Republic cut through the panic and called on all hyperspace travel to cease due to the dangers of using it. The ship then received a message from a signal beacon, only for Jareni to advise caution, her mind briefly going back to the events of the Eiram–E'ronoh crisis.\nThe others on the bridge agreed, and they assessed the situation first, with Orla fetching Cohmac, being followed by Reath. She was shaken by the parallels between the current situation, and the crisis that had occurred a quarter-century ago. Her distress was easily sensed by both Master Vitus and Padawan Silas, but she snapped out of her mood upon the discovery of the Amaxine space station, as she was given the task of readying exosuits for boarding, and arranging an order of boarding for the eleven vessels also seeking refuge on the station.\nOnce the station proved safe to enter, Jareni stood with Master Vitus, Knight Rydan, Padawan Silas and crewmate Hollow to welcome apparent refugees Nan and her guardian Hague, whose ship had been rescued by the Vessel's crew and was the first to dock. However, she went back onto the Vessel after a short time, returning to Cohmac Vitus' side to ask him to delegate his roles as a leader to investigate the mysterious statues and technologies the boarding team had found. Jareni knew exactly what sort of teases would get Vitus' attention, specifically mentioning unknown languages, and the two moved off to investigate. Orla then directly addressed the parallels to their current situation and their first mission years ago but was stopped by the sudden feeling of the shadow and accompanying chill earlier reported by Reath and Dez.\nA short time later, the pair were standing in the central sphere of the station, Orla commenting on the muggy air and the impressive lasting power of the arboretum. She and Cohmac then discussed the idols, herself commenting that they might not be gods, instead monarchs or historical leaders, which Cohmac did consider. However, another chill accompanying a breeze wafted over them, and the pair discussed what might be happening. Moving to check the nearby corridor, concerned a dark force was approaching them, Orla Jareni was instead suddenly sucked into an intense Force vision. She was forced to crouch to avoid being knocked down by gale-force winds, while sharp flecks of debris ripped through the air. Calling out to her friend, she pushed herself up, seeing collapsed beams of metal in the distance and an ominous glow, which filled her with nothing but horror.\nShe was ripped back to reality, and she rushed to find Master Vitus. She found him lying in the grass before the humanoid statue, having experienced a similar disturbing vision. She helped him to his feet, putting her arm around his shoulder to head back to the ship as he stated that it wasn't a vision, but a warning. By the time they reached Reath Silas and Dez Rydan, a battle had broken out onboard the station between the passengers and crews of the newly arriving ships, who were looting supplies, and a few were even attempting to seize others for unsavory purposes.\nWith Master Vitus able to stand on his own and rushing to action, Orla also moved to stop the fighting, igniting her lightsaber and leaping away through the use of the Force to the station atrium's second level. After Cohmac Vitus performed an act of awe which forced the looters and combatants into compliance, Orla Jareni tended to the arm of a red-scarfed man who had attempted to kidnap Nan for unsavory purposes and had lost half of his arm due to the intervention of Reath Silas. Jareni displayed a degree of patience but also contempt for the man. After he was treated, the Umbaran Wayseeker kicked him and the vessel he was from out of the station due to their violent mentality, resisting their protests by arguing that they had enough supplies and oxygen to serve their immediate needs. She then went into the mess of the Vessel.\nSome time later, as an effort was made to breach the lower levels of the station by a small group including Nan, Affie Hollow, Dez Rydan, and Reath Silas, Orla Jareni was walking between the mysterious idols studying them for herself. While she was not a scholar, she trusted her almost primal attunement to the Force and allowed it to steer her in her analysis of the different figures, entering a trance-like state as she did so. Her analysis focused on the humanoid queen, and she suddenly concluded the figure was both defiant and defeated. The supposed bracelets on each figure were actually chains, and the revelation shocked Orla, though she was unable to learn more following this.\nShe soon returned to the Vessel and witnessed Affie Hollow storm out of the ship, keeping her distance and deeming it not a good time to talk to any of the crew about starships. Instead, she sought out Master Vitus onboard the craft and entered a discussion with him once more about the parallels between the present and their shared past. However, she was shut down by Cohmac, and before she could change the subject, the pair of them were thrown into another intense, terrifying vision.\nThe four Jedi later grouped within the Vessel's tiny communication's area, Reath Silas having also experienced a vision and the need to address the unseen threat having grown too significant to put off any longer. Orla gave them a rundown of what they knew about the darkness on board of the station and agreed with Master Cohmac's assessment of the idols as keeping a darkness sealed within, with a psychic warning seal placed over them. Jareni suggested the group consider all of the possibilities and offered that the solution was to remove the idols from the station rather than destroy them. However, Knight Rydan's comment on a possible connection between the shadow and the lower areas of the station caused Jareni to instruct him to find a way for his group to make their way down there successfully . Orla made a joke about avoiding being pruned to death, which invoked a laugh, something she saw as necessary to keep them away from the Dark side and closer to the light.\nOrla Jareni later pieced together the terrible events from this second attempt to breach the lower levels, where Dez Rydan was supposedly incinerated, and she resolved to push forward despite the difficulties. Cohmac Vitus retreated to his quarters, forcing her to rally the crew of the Vessel, Nan, and Reath Silas together, taking up Vitus' leadership role. After confirming that no one needed medical attention, she asked Nan to relay to the other refugees what had happened and asked that someone return the plants taken from the arboretum, as the T-8 droids were hovering at the edge of the ship's airlock, with Leox Gyasi obliging.\nShe said a few words about Dez Rydan, commending him as a good man, and a great Jedi. She also said that they would search for answers about his death later, once they all had time to think about who he was and acknowledge his joining with the Force. She, unfortunately, did not grant herself time to reflect on what was happening with Master Vitus and Padawan Silas, who she could sense were both out of balance, as she needed to determine what they were going to do about the idols.\nSoon after this meeting, the refugees aboard the Amaxine station received word from the Republic that hyperlanes were conditionally open, with enough information fed to starships by the Republic to allow for essential travel. Jareni met with Geode and Gyasi in the Vessel's bridge, stating that they had unfinished business onboard the station. Her statement, with the added comment that they needed to take the idols with them when they eventually left, was met with disdain by Gyasi at first, but after she assured them they would take precautions, he urged the Jedi to work their dark magic. Jareni corrected him, stating it was light magic.\nWayseeker Jareni then met with Padawan Reath Silas, Master Coham Vitus, Captain Leox Gyasi and co-pilot Affie Hollow in another area of the ship, where she listened attentively to the Padawan's description of Force artifacts. When he briefly suggested that these artifacts showed up more in legend than reality, she interjected that they were not to ignore legends, with Reath plowing on afterward. She agreed with his assessment that the idols were Force containers, as well as with Master Cohmac's belief that they should be removed from the station. The Jedi then agreed to perform a binding ritual on the idols, to make sure the darkness contained within stayed that way.\nAfter the meeting though, Orla went to confront Cohmac Vitus, feeling he was neglecting his duties and allowing the death of Dez Rydan to impact him more than was natural. When Vitus angrily bit back, railing against the Jedi practices around death and mourning, Jareni realized that her friend's feelings were deeply entangled with the death of Master Simmix from a quarter-century ago. She carefully rebuffed his arguments, as she didn't disagree with the Jedi teachings he felt were problems, and tried to reassure him that what had happened all those years ago was not solely his fault and that all had made mistakes on that mission. Vitus didn't accept the argument, but Jareni felt like she could pry no further. Ultimately, she was left wondering if her decision to become a Wayseeker was truly to follow the path of the Force, or if it was merely her pushing herself away from others.\nSoon after this she, Reath Silas, and Cohmac Vitus went into the center of the Amaxine station's central sphere and commenced their binding ritual on the idols. It was somewhat taxing, but ultimately accomplished, with Jareni quipping afterward that the hard part was now transporting the heavy statues to the Vessel.\nUpon the Vessel returning to hyperspace, Orla Jareni unpleasantly discovered that she could still get motion sickness, commenting to Cohmac Vitus that it felt like they had flown into an asteroid belt as both Jedi stood guard over the bejeweled idols. Their discussion into the aftereffects of the Great Disaster on hyperspace was brief and ended with her pondering the mental condition of Reath Silas and Master Vitus, though the storm of emotions she'd sensed in her old friend had seemingly calmed for now. When a shake of the ship rattled the idols in the cargo bay, she asked what the chances would be of the darkness in the idols getting out if one fell over and broke. Master Vitus replied with the hope that they did not find out.\nThey were briefly waylaid by a personal carrier in distress, with Jareni and the other Jedi charging onboard the ship to help get the remaining passengers to safety. She and her robes did not get any soot or damage on them in the effort, appearing immaculate, and she helped rescue Reath Silas from a terrified Wookiee child that had attached itself to him after he had saved them from the flames.\nUpon the group's return to Coruscant, Jareni was placed in charge of transporting the idols from the Vessel to the Jedi Temple, and then through the hallways to the Shrine in the Depths. She noted with a lack of ease the effect the idols had on the Jedi and non-Jedi personnel in the hallways of the temple and overdramatically thought, as the idols were moved into the Shrine, that they were coming home. She immediately dismissed the notion and focused on helping lead their transport.\nA short time later, she joined Masters Cohmac Vitus, Poreht La, Tia Mirabel, and Giktoo Nelmo in surrounding the idols, and entering a deep trance. While in the trance, she connected herself profoundly to the other Jedi, and they were all in a deep harmony that would allow them to best combat whatever darkness lay within the idols. However, upon removing the Force barrier around the idols, the group learned there was nothing present, and instead, the idols had been keeping a darkness contained aboard the ancient station.\nJareni was deeply dismayed at the mistake, though the others in the group of experts attempted to alleviate the guilt she and Master Vitus were experiencing. She also grew irritated that the Force had not been precise in its warnings of staying completely away from the statues. Upon learning that the Jedi Council would delay sending out a team to return the idols due to the continued demands of the Great Disaster's aftermath, she conspired with Master Vitus to take the idols and return them to the space station themselves. She went and hired the crew of the Vessel before also taking the idols onboard, greeting Master Vitus and Padawan Silas as they arrived, having sought to hire the ship's crew for the same purpose. The group of Jedi then huddled to discuss their plan.\nOn the way to the Amaxine station, Orla Jareni confronted Leox Gyasi about the fact that the Vessel was hauling spice, which Gyasi assured her was a hundred and ten percent legal as it was medicinal. She was highly skeptical, but ultimately let it go as the Vessel and its crew were willing to go on this dangerous mission with them, but also because she believed Gyasi to not be foolish enough to directly lie to her about the cargo's legal status. Upon emerging from hyperspace, and realizing a Nihil Storm frigate was anchored with the station, the Vessel hid from the much larger ship, but there was still the question of how to get aboard the facility. Jareni then joined Affie Hollow, Cohmac Vitus, and Reath Silas in getting into exosuits as a plan was formed to move through space from their present location to an airlock. Jareni also decided to allow Hollow to perform her own mission aboard the station, as she did not wish to use force to stop her. The group then exited the spacecraft and used their thrusters to reach the airlock, with the three Jedi using the Force to pull the idols to safety, and into the station.\nOnce aboard, the darkness the Jedi had been sensing before was overwhelming, and the group split up. Jareni commented on the spread of the darkness, and Vitus agreed with her. She further commented that the visions they had seen before had a strange familiarity to them now, but she dismissed it before the two of them headed into the dense brush. As they walked, Vitus brought up the clay warriors of Zardossa Stix, which Jareni had heard of and was immediately put on edge by him mentioning those ominous statues which she vocalized. Vitus speculated that the idols were keeping an army in place due to the nature of what they were feeling in the Force around them, though Jareni couldn't see an army.\nHowever, the two were suddenly approached by plantlike beings, the Drengir, who expressed pleasure at having encountered meat. The pair were gradually surrounded by the creatures, and an oppressive sensation in the Force itself settled over them. In their discussions amongst themselves, the Drengir revealed the fact that they had been captured by the Sith which gave the Jedi pause before moving in to attack. Jareni jumped over the lead Drengir's head and cut into the creature with her lightsaber, only for the being to laugh and strike back at her, the damage to its body rapidly healing. Jareni then cut off some of the lower tentacles of a different Drengir, causing it to collapse, and the two Jedi continued to duel against the increasingly large number of Drengir closing in on their position.\nUnfortunately, early into the fight, one of her calves had been grazed by a whip-like Drengir protrusion with poisonous thorns, causing said calf to ache from toe to hip, and leading to swelling stiffening her ankle and knee. Just then, her damaged foot ran into an 8-T unit, and she was sent sprawling. Initially, her fall irked her, but she soon realized she could use the gardening droids against the Drengir. She grabbed the one that had caused her to trip, but she found no way to alter its programming, so she was forced to use their existing directives. She then stood and jumped through the air, severing a bower connected to the atrium's ceiling which began to collapse. Landing on the ground with a stab of pain from her poisoned leg, she joined Vitus in deflecting the probes of the Drengir while backing up, bringing the Drengir to a point directly beneath the collapsing bower.\nThe architecture, drenched in vegetation, fell right on top of the Drengir, temporarily waylaying them. When they sought to cut themselves free, they damaged the vegetation which resulted in swarms of 8-Ts descending on them as they were perceived as harming the station's plant life. Jareni and Vitus watched on before centering themselves and forming a new Force container out of the idols sitting in the atrium. The act appeared like a green flash to Jareni, and its effect was instantaneous, the Drengir melting into the vegetation of the station. The two Jedi then rushed to find Hollow and Silas but were instead encountered by the Nihil member Hague.\nThe elderly Zabrak attempted to shoot his blaster at the pair, but Jareni used the Force to slow the bolt, the Jedi stepping to the side of it, before she released it, allowing it to crash into the nearby wall. Their confrontation continued, with Hague's earlier hidden rage freely flowing to the surface, and he trapped the pair of them with him in the airlock ring by shooting the door controls. After alerting the other Nihil on the station of the Jedi, a group soon closed in on their position as the Nihil vessel was directly moored to the airlock ring. Jareni considered their proximity to be a lesson from the Force in humility, as she had earlier bragged to Hague about the two Jedi having their lightsabers with them. However, a grenade thrown by Affie Hollow disrupted the Nihil's charge, allowing Master Vitus and Wayseeker Jareni to charge forward themselves.\nJareni moved on Hague first, slicing his blaster into three parts before dodging his attempted attacks with the remains of his weapon. She then retreated, witnessing Vitus holding the remaining Nihil at bay in an archway, not allowing them through. She determined that they were in a combat stalemate, and moved to activate nearby emergency doors to give herself and Vitus more time by blocking the Nihil's approach. She proceeded to the manual door controls on the ceiling, spinning her lightsaber to create a shield from Nihil blaster fire which reflected a fair number of the blasts right back to their source, and then used the Force to trigger the controls.\nUnfortunately, they realized too late that they had trapped Affie Hollow on the other side of the doors with the majority of the Nihil, and so moved in to assist her, drawing off a portion of her attackers in their approach. Jareni ended up dueling a pair of Nihil wielding energized polearms that could parry a lightsaber thrust, but she had the upper hand, slowly pushing them back. Next to her, Master Vitus performed a leg sweep with a metal beam controlled through the Force, causing many Nihil to fall over. They then engaged in a strategic retreat, allowing for the two senior Jedi to regroup to find Hollow and Silas. While Leox Gyasi found Hollow, and Vitus found Reath Silas and a surprisingly alive Dez Rydan, Jareni continued to scout the damaged station for anything they could use strategically against the Nihil. Upon realizing that there was no other option, she decided to free the Drengir but moved to reunite with the rest of her group to inform them of the plan.\nOn the way, she ran into Padawan Silas and was filled in on the survival of Knight Rydan, in addition to the unique hyperspace pods aboard the station. She resolved to break the Force barrier with Silas, and the two rushed off to inform the others. On the way, they ran into Hollow and Gyasi and urged them to leave without them if they didn't return in ten minutes, though the two pilots refused to leave them behind. They were eventually convinced by the Jedi to return and prepare the Vessel for departure, with Jareni and Silas moving toward the arboretum to unleash the Drengir. Upon arriving, they realized that the new barrier was too difficult to bring down with just two Jedi. Jareni then picked up a blaster, apologized to Silas for desecrating history, and shot the idol of the humanoid queen between the eyes, causing a wave of energy to knock both her and the Padawan off their feet.\nDazed, the pair managed to stand and started to retreat, the rapidly reforming Drengir hot on their tail. When the two Jedi reached the entryway to the equatorial ring, they found the Nihil marshaling to attack them, a gas grenade being fired in their direction upon their arrival. The pair ducked the grenade, which flew into the ranks of the Drengir, seeming to awaken a desire for combat in the plant creatures. They rushed past the Jedi to engage the Nihil, allowing Wayseeker Jareni and Padawan Silas to flee back to their ship. On the way, they ran into Master Vitus, who informed them of the plants which had grown around the Vessel, keeping it attached to the station. Jareni and Vitus were distracted by this new development and didn't notice until they reached the airlock that Silas had left.\nReath Silas then vented the arboretum into space, while also launching all of the hyperspace-capable pods. The station was not significantly damaged, but the death of Drengir and most of the Nihil allowed the group to take their time cutting away the vines that had tried to trap the Vessel before departing. At this time, Jareni felt the need to answer the call of wild, open space, and was looking forward to leaving. Just before their departure, she also bore witness to Leox Gyasi using the spice on board the ship to help keep the haggard Dez Rydan stable.\nUpon their return to Coruscant, Orla Jareni, Cohmac Vitus, and Reath Silas were called before the Jedi High Council to account for their actions. Jareni did not agree with everything in the speech spoken to them by Master Adampo, but all three ultimately went undisciplined for their actions due to the net benefit, and that it was out of their character to disobey the rules of the Jedi.\nSoon after this ruling, Jareni traveled to a spaceship depot to acquire a new ship for her role as a Wayseeker. She haggled with the sales droid, but ultimately came to a fair price, and gave the ship the name Lightseeker. Speaking with Geode, who had accompanied her to the purchase, she offered him an opportunity to join her, but he declined, so she climbed aboard alone. She promptly sent a message to her old friend Vitus, who congratulated her on the fine ship. The two then spoke of his state following the affairs of the past few weeks, and while she ultimately did not feel the Jedi Order was right for her friend, she respected his decision to stay with them and raised her hand in a farewell.\nSometime after she had left Coruscant to begin her time as a Wayseeker, Orla Jareni was drawn to the inhabited astronomical object Chortose when the Force allowed her to sense that Jedi Knight Keeve Trennis was in danger of losing herself to her self-loathing and sadness. Upon arrival, Jareni managed to arrest an unknown number of Nihil who were attacking Agricultural Hub 42, before finding and using her lightsaber to force another Nihil to surrender rather than harm the hostage they were holding on to. After cuffing this individual, she then turned to purging the Hub of the toxic gasses that the Nihil had released into the facility, resisting Keeve Trennis' questions until the essential work was done. When Trennis asked which temple she was from, Jareni replied none and informed the Knight of her status before revealing why she had come, and what she had sensed from the other Jedi.\nKeeve initially resisted the assertion, before Orla Jareni tore down the dismissal by pointing out that the other Jedi was proceeding in the opposite direction from an all priority call for as many Jedi as possible put out by Marshal Avarr Kriss who was battling with the Drengir forces of the Great Progenitor. Trennis countered that Jareni was doing the same, but Orla Jareni pointed out that unlike Keeve, she could sense both in the other and in the Force that Trennis belonged with those distant, embattled Jedi. Trennis stated that they did not need her, with Jareni asking if any of them had directly told her that, repeating the question as the younger Jedi started to cry.\nKeeve Trennis spun around to face Jareni, distressed and admitting to her many recent difficulties following her connection to the Drengir Root-Mind. As she despaired, Orla Jareni largely let her speak and didn't interrupt, but eventually asserted that Keeve Trennis' master must have thought her ready to make her a Jedi Knight when Trennis questioned if she deserved the position. Keeve spoke of how her own master, Sskeer, had also experienced hardship after making a connection with the Drengir, before stating that her presence in the field might get other Jedi killed or worse. When Jareni pushed, asking to know what worse things could happen, Trennis was suddenly struck with a vision from the Root-Mind, causing her to clutch her head and the Wayseeker to concernedly ask after her. When Keeve Trennis revealed that the Root-Mind had spoken with her, Jareni asked what it had said, to which Jedi Knight Trennis stated that it claimed the conflict was over, and that the Jedi had lost.\nFollowing this vision, Orla Jareni and Keeve Trennis decided to head to Mulita in Wild Space to help the embattled Jedi combat the Drengir. They arrived on the planet with Jareni's personal starship, the Lightbringer, using the ship's weapons before they disembarked to destroy several unidentified native arthropods the Drengir had taken control of. Knight Trennis introduced Jareni to the assembled Jedi and Hutt forces, though Jareni expressed an pre-existing deep familiarity with Trennis' master Sskeer that exasperated both the Trandoshan, Keeve Trennis and Jedi Master Cohmac Vitus . Jareni complimented Sskeer, stating he was as handsome as ever, with Sskeer grumbling at her overfamiliarity, asking her not to do so in front of the Hutts. As Trennis left to find Marshal Avar Kriss, she asked Orla to fill Sskeer in on Trennis' plan, to which the Umbaran Wayseeker coyly replied that it would be her pleasure, and not for the first time, causing yet further exasperation from Trennis.\nOrla Jareni soon joined the other Jedi in mentally bonding together through the Force, and using the strength of this connection to cut the Great Progenitor off from the Root-Mind. She then joined the other Jedi in containing the creature in a stasis field, and supplied to a questioning Myarga the Hutt that the Jedi would hold the Progenitor in the Bogan Collection on Starlight Beacon. The Wayseeker then stood with the other Jedi in making the Hutt forces stand down lest the two sides enter battle, and was still with the group when news of the destruction of the Republic Fair reached them.\nSeveral months following the attack on the Republic Fair, Orla Jareni was still in the orbit of the Jedi serving aboard Starlight Beacon. She was made a part of a plan Jedi Master Avar Kriss had crafted to infiltrate the Nihil through the insertion of Jedi Knights Keeve Trennis and Terec into their ranks. The Wayseeker was surveying the Soola System using her ship the Lightseeker to ensure it was clear of Nihil raiders. She confirmed there were none, reporting such to Starlight Beacon, before her targes scanner detected an incoming ship. This turned out to be the Ransacker, piloted by Knights Trennis and Terec, who immediately began attacking her. Orla continued her communications with the Beacon, commenting that the ship was armed like an entire fleet. She transmitted her position, but the Lightseeker had its communications disabled shortly afterward, and the vessel began to drift. Jareni used the ship's weapons to keep fighting back, long enough for the Ataraxia to jump in and save her, launching Jedi Vectors to attack the Ransacker.\nSometime after her engagement in the Soola system, Orla Jareni was awoken to the memory of the mysterious planet she and Cohmac Vitus had found carved on the wall of the Jedi Temple when they were Padawans. After informing the Jedi Council of her intention to investigate, she made use of old star charts and half-lost records to travel to the planet in question, Lenahra. She initially believed she had found a Force nexus planet. However, she came to realize soon after that the world was a closed system, mimicking aspects of the Force in a simpler biomechanical parallel. She admired and respected the delicate balance that existed within this closed system, and her senses informing her of that balance were confirmed when she discovered the remains of a civilization which had upset that balance, and died off to a single member sometime before her arrival.\nDuring her time on the world, she examined the temple that the unknown civilization had created showing their rise and fall. Near the end of her trip, she felt she had been tested by Lenahra, and was confident that the Force had guided her to the planet starting all those years ago in the Jedi Temple. She made further findings on the world but was unable to continue her studies, as she needed to help Jedi Master Elzar Mann find balance after his destabilization following the Nihil's attack on the Republic Fair. As this mission would not return her to Coruscant, she instead took what information she had and put it onto a datachip, returning to the unknown species' temple and using her blade to cut a hole next to the final mural image where she then stored the device. She hoped that another Jedi would be able to pick up her work someday, while also having the stray idea that other Jedi would find the planet instructive in the ways of balance. The datachip contained holographic information, including a brief interaction Orla had with a gobbler, with her mirthfully stating at the same time that there was a need for balance.\nA short time after her voyage to Lenahra, Orla Jareni brought Elzar Mann to the planet Ledalau to help him regain his mental balance and reforge his connection to the Force after he tapped into the Dark side throughout the events of the Nihil's attack on the Republic Fair on the planet Valo. The two were connected by Stellan Gios, which was an odd situation given Gios did not have a high opinion of Wayseekers, yet she proved an excellent teacher to the struggling Elzar. While he had imaged the retreat to be something tropical and relaxing, Orla had strongly dissuaded him of this notion and resisted his efforts at flirtation with a sharp wit.\nDuring their time on Lenahra, Orla and Elzar got along well and had many discussions. She advised him early on to stop his experimentation with the Force that had for a long time been his specialty, and that the cold weather of the island made practice more difficult, which was suitable for someone who wanted to test himself like Elzar. She also stated that guarding against darkness was more than simply avoiding an excess of fear or anger, instead that the real danger lay with emotions that, while positive at first, eventually rooted themselves and took over one's thoughts and actions. Early on into their stay, Orla and Elzar had also discussed working on him meditating in the waters that surrounded the small island. Despite Elzar explaining he already did meditation in the water, Orla firmly suggested a different method, telling the master to walk into the surf, enter a handstand, and hold it despite the tide in an exploration of standing firm against the water, but to also be in coexistence with it. He attempted this, and failed, but as the weeks wore on, he grew better at the task. Elzar ultimately found that Orla's tutelage had focused him faster than he ever thought possible.\nOne day, several weeks after their time together had started, Orla was again watching Elzar perform the meditation exercise she had recommended. He had greatly improved so she was impressed and praised him, a gesture she hoped he valued. Elzar stated he did value her praise, before announcing he would refrain from his experiments with the Force going forward. Orla countered, stating her earlier suggestion had not been something she felt was a permanent condition, since Elzar was naturally intuitive to the Force, and his connection was a valuable strength though he would need to establish boundaries. Elzar stated he had yet to form those boundaries, and he would continue as he was now as he felt he was strong enough even without his intuition. Orla stated he was still limiting himself, not just in how he used the Force but also in using the Force overall, as he had neglected other abilities and skills. Elzar compared his weakness to an injured leg, which Orla agreed with.\nAfter toweling his hair, Elzar asked Orla when the time would come for them to leave Ledalau. In response, with a wicked smile, Orla stated that Elzar only needed to trust himself before adding that he should finish drying off and pack up his things. Surprising Elzar, she refined their departure time to within the hour if he was quick enough, before leaving her pupil. When he emerged from his hutt with his belongings, mist shrouded her from him. When he called for Orla, she called back, beckoning him away from the shoreline into the interior of the small island. Orla soon ran into Elzar, who was standing before what he thought to be a plinth, and the Umbaran Wayseeker proceeded to introduce him to Geode, navigator for the Vessel. Seemingly unconcerned by his reaction, Orla then returned to the fog and led the way to the ship which was waiting for them with its ramp down. There, Orla made further introductions, acquainting Elzar with Affie Hollow and Leox Gyasi.\nHowever, it was then that the group was informed through a comm piece in Affie's ear that the Nihil were attacking several locations simultaneously across the galaxy. Orla swore aloud at the news, but was relieved that despite the events, a safe path back to Starlight Beacon appeared to be intact. Orla and Elzar came aboard, and were preparing themselves in the passenger area when Affie joined Leox in the cockpit. The Vessel soon took off, and while the initial voyage into hyperspace went well, the crew received a warning that something Nihil-related was taking place in their flightpath. When Leox was able to confirm that the disturbance wasn't at Starlight Beacon, Orla expressed her relief, but it was then that the ship exited hyperspace in the Echerta system where the ship found itself in the middle of an ongoing space battle.\nAs the ship entered the surprise fray, Orla Jareni called out the question of if the Vessel had any weapons. Upon being told that the ship had a singular, weak-powered gun, she exchanged a worried glance with Elzar Mann, before Elzar sent her to take the gun to provide a minimum of defensive fire. She stated that they were going to find out if it was as she headed to the back of the ship where the gun was located. Jareni soon returned however, protesting the ship's plan to leave without making an effort to save any lives, insisting that they could hurt the Nihil enough to allow the survival of some of their victims. She then elbowed Mann aside and continued at the prompting of Leox Gyasi, saying that the Nihil were a threat because they worked in concert through the use of their communication systems. As the small team discussed the idea, Elzar stated that the Nihil would have screened them out, to which Orla wickedly grinned and stated the Nihil would only screen warships, combat vessels, or larger ships, not a tiny hauler like the Vessel.\nWhen Leox stated it would only confuse the Nihil for a few minutes, Orla stated that would be enough to allow ships nearby to get away. Elzar Mann then mentally assessed that Orla Jareni had, while refusing to match an opponent, taken what limited strengths they had to use to their advantage, thus saving hundreds of lives. At Leox Gyasi's suggestion and delight, the Vessel then pumped the margengai slide at full volume over the communications channels, Orla commenting that unfortunately, all non-Nihil ships would likely also hear the same music though likely not mind the inconvenience. The distraction allowed ships to flee as planned, and even gave a nearby space station enough time to restore its shields, though the Nihil soon narrowed in on the cause of the communication chaos. Despite shots fired their way and taking some damage as a result, the Vessel managed to escape into hyperspace. Orla left the cockpit first, followed by Elzar Mann. He asked her what had made her think of her plan, to be small, playful and not aggressive in a fight. She gently replied that she did not need to be reminded to not be aggressive, and Elzar would see the same if he continued on his current path.\nAs the Vessel reached Starlight Beacon, they moved to help a damaged Japealean cutter that was struggling in space with a blown engine, having taken fire from the Nihil. When they towed the starship below them however, the other engine blew, showering the underside of the Vessel with shrapnel. The explosion and shake it caused saw both Orla Jareni and Elzar Mann appear in the cockpit, calm but alert, Orla asking about the situation. Despite the explosion below them, the Vessel was able to complete the approach to Starlight Beacon, and land in the station's docking bay.\nWayseeker Orla Jareni and Master Elzar Mann led the group off the Vessel to assess the damage, and disembark in general. When Leox Gyasi mentioned that he had an old-fashioned tool kit, and was capable of making his own couplings, Orla commented that she didn't think anyone did that anymore with Leox grinning back that he was an old-fashioned kind of person. When Padawans Bell Zettifar and Burryaga approached the ship, accompanied by Ember the charhound, Elzar greeted them first, followed by Orla, though she did so more absentmindedly. Already moving to her next task, she offered to help the crew of the Vessel with its repairs. However, when Burryaga stated that Master Stellan Gios, temporarily in charge of Starlight Beacon while Avar Kriss was away hunting the Eye of the Nihil, would want to see the pair of Jedi first, Elzar and Orla turned to go. The Wayseeker quickly emphasized with a smile that if the crew needed any assistance, they were free to ask for it. The team of Jedi then left the docking bay.\nAfter departing with the other Jedi, Orla whistled, causing Ember to cock her head as she came alongside the group. However, unlike the other Jedi, Orla allowed the Force to guide her through Starlight's corridors, taking her to wherever it willed. She believed the destination to be the station's main cargo bay, but the closer she got to it, the less sure she became. Eventually, she crossed paths with Jedi Knight Regald Coll at the threshold to the cavernous space, who explained that he had also been feeling the strange disturbance in the Force. The pair introduced themselves to each other, before investigating the manifest of the bay, only to find nothing unusual other than a ship that had been hauling rathtars.\nThe pair of Jedi briefly discussed the proper terminology for groups of species and beings, with Orla ending on the dark note that a group of Rathars was known as a remorse. Jareni then internally questioned whether or not the disturbance was the rathtars or whether it was something else, before her comlink chirped. Answering it, she learned that Stellan Gios was calling for her. He welcomed her to Starlight, and asked to meet her in his office to discuss Elzar's progress whilst they were on Ledalau. Jareni decided that she would continue her investigation later on, after other matters had been attended to and the pair of Jedi left the main cargo bay.\nWhen Orla Jareni reached the marshal's office, taken over by Stellan Gios while Avar Kriss was away, the Jedi Master was speaking with fellow Master Elzar Mann. Stopping short upon seeing the worn state of Master Gios, she bluntly stated that he looked terrible. While Gios brushed off the statement, claiming it to be Orla being tactful in a coy way, she expressed real concern by stepping in closer and asking if Stellan would discuss what was wearing at him so actively. Stellan insisted the issue would wait for another time, and that what the two other Jedi could do was help him with matters he had set aside for the time being, primarily involving captured Nihil prisoners that had recently arrived on Starlight Beacon. Elzar agreed, since he was the main target of the request, and departed to take care of the matter leaving Jareni and Gios alone.\nOrla chose to try and break through Stellan's layer of privacy by confronting him about the issue or issues that obviously plagued him. She fixed him with her full intensity, and assured him that he would tell her what was wrong eventually, with him insisting there was not much to tell, just nightmares, insomnia, and fatigue from running the station. Orla countered that for most men, that might reduce them to Gios' state but she knew Stellan as an exemplary Jedi capable of much. She ended by sliding a quip about how despite those skills, she had still saved him back on Pamarthe, to which Stellan groaned in a more usual fashion, grumbling about if she was really never going to let him forget that situation. She replied with a frank negative, and for a moment, she felt like she was cracking his shell.\nHowever, he suddenly added that he felt she was wasted as a Wayseeker, and should have instead been serving as an investigator like their colleague Emerick Caphtor. Orla was hurt by the attempt at a joke, since it revealed the underlying disdain he had in her choice. She asked him why he held this feeling, stating she had her own theory but she wanted to hear Stellan's point of view. He articulated a viewpoint that suggested Wayseekers forsook the duties of a Jedi for tempting desires, which Orla strongly countered as she felt it was time Stellan heard some honesty. She gave her own opinion, that Stellan was uncomfortable with the spotlight that had been shined onto him from an early age, always the Order's golden boy and now, a symbol for the Jedi and Republic following the Nihil's attack on the Republic Fair. As a result, he had never been able to explore and be free, forced to walk a line and so he resented Wayseekers who had freedoms he lacked, even feeling threatened by this.\nMaster Gios coldly stated he was not threatened, and that Jedi were meant to follow the path both the Jedi Order and Force had laid out for them. Orla shook her head, stating that was where their core difference lay, because in her mind the Force and the Order were not the same thing. She rose to her feet, and concluded that she did not say these things to hurt or start an argument with Stellan, as while they were opposites, she respected him and was worried about him. Stellan was able to manage a stiff reply, stating he understood and that he hoped she knew that he also respected her. Orla then airily breezed from the room, commenting that he couldn't not do so.\nLater on, Orla resumed her investigation of the main cargo bay with the approval of Master Gios. Getting in the turbolift first, she resolved to focus this time and not get diverted by trivialities like rathtars. She was joined first by Master Indeera Stokes, whom she acknowledged with a nod, and then Knight Regald Coll, who offered a half wave of his own before they all resumed their trip down. Jareni expressed her thanks that they were doing this task together because it would allow them to cover more ground. After Coll sheepishly admitted that having the other two Jedi with him was better than his earlier probing which had been on his own since it may have gotten him into trouble, Jareni reminded both of them that Master Gios had authorized this effort. However, all three were ill at ease due to the permeating presence that threatened the station, causing them to doubt themselves, but Jareni pressed on by telling them that they had to keep going.\nWhen the three Jedi reached the level above the engineering section, they all disembarked from the elevator and split up in three different directions, with the engineering area beneath them monitored by the watchful eyes of Jedi Master Estala Maru and his astromech KC-78 who was aware of the unnerving presence spreading through the station. Orla then had the team split up, the Wayseeker heading to the left, Indeera Stokes proceeding to the right, and Regald Coll going straight ahead. While agreeing that it was a good plan to keep in touch at the suggestion of a raised comlink by Knight Coll, Orla was already turning her attention ahead as she avoided the cargo bay with its unnerving rathtars.\nA short time later, on intuition, she had wedged herself into a maintenance shaft where she sensed something had been done recently when she received a distress call from Regald Coll. Due to her position, she had to waste precious time pulling herself out of the narrow area before breaking into a run as she gripped the hilt of her lightsaber, ready to unfold it. She reached forward with the Force and while muffled, she was able to sense something moving away, possibly retreating, though she did not slow down in her run as she assessed its departure had been more a result of satiation. She skidded around a corridor bend and almost fell down due to the sprawled unconscious form of Indeera Stokes, who Orla quickly assessed as being unconscious, though with shallow breathing and cold, clammy skin. Rushing forward, Orla increased her speed before suddenly coming into a large empty cargo area. The Umbaran took a moment to adjust to the change in lighting but soon saw a form lying on the ground close by. Moving forward, Orla called out for Regald Coll, initially believing she could resuscitate him, but to her horror, she instead discovered a desiccated husk mimicking his form.\nOrla promptly contacted Stellan Gios via comlink to tell him that Regald Coll was dead. Shocked by this, he requested confirmation of what she had said, which she repeated, stating that he was in fact worse than dead, instead his entire body being changed into a dry, almost powdery version of itself. She was afraid to touch the body in case it collapsed. When Stellan commented to the other Jedi in the Hub with him, Nib Assek and Elzar Mann, of another husk, Orla immediately demanded to know more information, unaware of the fate of Loden Greatstorm. Stellan replied that as a Wayseeker, she had been cut off from the business and knowledge of the Jedi Order, but she would be briefed in full upon her return. She countered that first he needed to send a medical team to her location, or droids and a hovergurney, because of the state of Indeera Stokes. At this statement, Nib Assek blurted out horror at Indeera's condition, before Orla assured them that Indeed was alive but unconscious, and needed medical help right away. Master Gios promptly sent a med droid to her location, and asked that once Master Stokes had been seen to safety, Orla was to return to Ops, the comlink deactivating at this point.\nA short time later, Orla Jareni met Elzar Mann in the cargo bay area, the other Jedi having come down to check on the situation and not as affected by the cloud that was hanging steadily heavier over the heads of his fellow Jedi. Calling to Elzar from further down the corridor, Jareni then led him to the corpse of Regald Coll. Orla asked with a whispered tone what power could have done this act, of ripping the life from their compatriot. She then accompanied the hovergurney up into the medical tower where Indeera Stokes was to receive medical care.\nShe was present for an analysis of Regald Coll's body carried out by droids of Starlight Beacon, hazmat pod protocols keeping the body secure though filling the air with artificial sterility due to the activation of many filters. Orla looked over the body of the Jedi with deep sadness and horror, remembering her mission to a world in her days as a Padawan where the locals created lifelike statues from their native stone, only the \"statue\" before her lacked any such vitality. Despite the efforts of the droids around her, Jareni doubted that mere data analysis would determine what had happened here.\nElzar Mann then gravely entered the room, and spoke of the fate of Loden Greatstorm, how the Twi'lek's body had suffered a similar fate though it had collapsed immediately at the first touch. Jareni grimly commented that Coll's body has more substance, and wanted assurance that Elzar felt it was the same phenomena. Elzar affirmed his belief, and she then ominously reached for the next question, asking if he felt the disturbance affecting the station's Jedi was responsible. The male Jedi stated he didn't know, as it had yet to hit him as badly as some of the others, with Jareni agreeing.\nShe assessed that Elzar hadn't been reaching into the Force like he once had, and it was providing him a degree of protection, making him a source of hope for others which he did not seem comfortable with. However, the Wayseeker was confident that he would rise to the challenges that would confront them though she wished she had the same confidence in her own abilities. She had mastered her fear a long time ago as a Padawan, but at the mere thought of this current weakness, a wave of manic panic swept her, telling her to flee and abandon the station though she steadied herself with a deep breath. Expression never wavering, she stated that they needed to search again, and while Elzar was not enthusiastic about the task, she stated that unless they found the threat doing this, Regald Coll would not be the last to die.\nSoon after this however, with the return of the Ataraxia commanded by Avar Kriss, the Nihil sprung their trap. Explosions crippled Starlight Beacon, and during this period, Orla Jareni was in her quarters. It took a considerable amount of her skills to remain upright as the destruction ripped across the station, and she then waited fifteen seconds for the agony of being sucked into space, and to her death. When this did not come, she knew she was not dead and the real work would need to begin.\nIn the initial stages of the disaster on Starlight Beacon, Orla worked to assist as she was able. Approaching the quartermaster's office, she encountered Elzar Mann trying to relay some form of a signal anywhere given that they were under a communications black out. Elzar quipped that she would have to tell him someday how she kept her robe so immaculate in a crisis. Orla was in no mood for explaining this, and told Elzar to cut to the chase rather than make wisecracks. He informed her of the unfortunate state of the station, that both upper and lower ends were severed from each other communications and movement-wise, and that they might physically break apart, with the sole area of access being the medical tower. Orla took in the information, and stated that as long as both halves remained airtight, things could still be fixed. Stellan Gios came out of his office and asked if Elzar had had any luck, with a negative reply seeing Orla Jareni suggest their first priorities be getting the refugees and their ships off of the station. Stellan agreed, and put Orla and Elzar in charge of the effort.\nA short time later, with a chain of astromechs networked together, Stellan Gios, Elzar Mann, Orla Jareni and Nib Assek gathered to study what information had been gathered from their jury-rigged network. Having connected with Eiram's satellites, Orla guessed an unfortunate truth, that the station was not where it should have been. This was confirmed soon after, and with a hand going to her chest, Orla refined her statement to confirm the truth, that Starlight Beacon had drifted into the planet Eiram's gravitational pull, which was now setting it on a downward trajectory.\nAs more information was gathered by the growing astromech network, and Stellan Gios realized that the holding cells had all their systems deactivated some time ago, Orla Jareni chose this time to interject as he and Elzar Mann turned to speculation about the culprits. She asked what they were going to do about the release of all their prisoners, with Stellan replying that they could do very little besides helping the injured. Jareni interrupted him, and stated that they could tell those onboard and capable of hearing it the truth, that their lives were in danger.\nStellan disagreed, stating that if he knew more of the people onboard especially now with many travelers and refugees trapped on the station, he wouldn't hesitate but as he did not, it might create a panic and cause the situation to get worse. Orla stated that if the short fuses in the group figured out the danger before others, there would be an even worse panic. Stellan finished his reasoning by stating that considering the lengths the Jedi had needed to go to to learn their limited information, few others if at all would be capable of knowing what was happening.\nOrla ended up pacing outside of Stellan's office and considering a range of things. Her first thoughts were a wish that she had brought her ship the Lightseeker with her to the station, so she could be safe and know it was waiting for her once the crisis passed. Her second thought was on her latent desire to leave, though she never would, despite the murder of Regald Coll that haunted her mind. Regardless of the current situation, she felt this threat could not be ignored, especially as the disturbance in the Force grew in power. She pondered what the source could be, and by what mechanism the threat was capable of both blocking a Jedi's connection to the Force and killing individuals in such a horrifying way. Despite now knowing the situation faced by Jedi Knights Terec and Ceret, as well as the fate of Jedi Master Loden Greatstorm, she still felt it didn't equal what had happened to Coll. While lacking answers, she was struck by a realization and stopped pacing. She concluded that this threat had to have been brought to the station by the Nihil, and if the Nihil had such a power, than they were far more deadly a threat than anyone thought.\nA short time after, Orla was arguing again with Stellan Gios that they needed to tell the public about the fact that the station was falling out of orbit, while he resisted. She saw wisdom in Stellan's position, to wait to tell them until after the Jedi had a plan, but she also saw flaws, commenting that the idea of a plan relied on them making contact with the Republic soon which was an enormous unknown factor at this time. After Stellan made an impassioned insistence that it had to be possible, Orla resisted the urge to snap about how the Nihil had been able to outwit the Jedi over and over. She barely succeeded, and told him that she hoped he was right, because the stakes were too high if he was wrong. Stalking off after this confrontation, she realized that she was not herself, angry words boiling inside of her almost breaking her self-control. She came to a determination that they, specifically she, had to do something to prevent the dark force that was chipping away at her and the other Jedi from spreading any further.\nAs she left to go on the hunt, Elzar Mann noticed the sweep of her robes and briefly waylaid her, asking where she was going. She questioned if she was in trouble for defying Stellan's rules, with Mann replying that he was the last person to critique others for their bending of the rules, though added that they shouldn't split up, especially as radiation levels began to rise across the station. Orla stated she knew this, but that she intended to find the disturbance in the Force that threatened them and the station, asking if he could sense it. Elzar could not, and his senses had been warning him against using the Force, which Orla said was something he should definitely listen to. Despite this, Elzar gripped Jareni's arm, and tried to argue with her that given what had happened to Regald Coll and Indeera Stokes, they needed to stick together. However, the Umbaran would not be deterred, and insisted that she could be surprisingly careful. Elzar stated if she wasn't back within the hour, he would go after her, with her replying she expected nothing less. She then grinned and told him to keep his temper in check before moving away.\nUpon reaching the main cargo bay, Orla decided she needed to seal the area off, realizing that the Jedi should have done this at the very beginning but that whatever was happening to them was clouding their judgment to a major degree. While sealing the area wouldn't fix the effects, it would contain whatever was the source of the problem, and would allow for it to be better pursued. Orla Jareni approached the spot that Regald Coll had fallen just as the climate controls for the space began to fail, filling the air with cold and causing her to see her breath. She remembered the occasion when she and her group of younglings were able to play in the snow, overseen by Yoda, but the memory was turned dark and filled with terror as she considered what could have gone wrong when she had nearly fallen off the roof. She used the Force to bolster and guide her, for what little it did in her current situation, and carried on through the space.\nShe soon came to a long corridor with storage bins stacked along the stretch of hallway. However, Orla soon noticed puffs of breath emerging from behind a tall stack of bins, coming from an elevated point and far too large to represent any sort of humanoid. Even while Orla tried to convince herself it might not be the threat currently plaguing the station, she was filled with terror. Her steps forward became a struggle, and she thought of waves like those Elzar had faced on Ledalu, except these were worse far worse. She suddenly realized that the creature knew she was coming, and then without knowing how, also became aware that it was hungry, not for her flesh but something worse.\nShe attempted to reach out with her feelings, but that became impossible as she was unable to focus anymore. Motion without shape came from the end of the hallway, except now it was a thousand shapes, roiling and wriggling, yet she was unable to run. She though the station, in fact the galaxy, was melting as these shapes all poured downward, falling without end. She then realized that she had slipped past the point of comprehending anything, and her mind was no longer her own. She was unable to sense the Force, but she knew it existed, only to doubt for a moment that it did. She soon reinforced herself, stating that the Force would find her, and she wouldn't vanish, becoming nothing, or no-one.\nOrla Jareni then found a cold consuming her body and going as deep as her bones. She wanted to hug herself, but her arms did not obey her commands, nor any part of her body. It was then that Wayseeker Orla Jareni became even whiter than before, then as gray as ash before falling onto the floor unable to ever move again. All that was left of her was her fear and silence in the Force.\nAt the same time, across the galaxy, as Masters Cohmac Vitus and Kantam Sy worked to counter the final stages of the Nihil's operations on Corellia, the pair of Jedi were alerted through the Force to the painful and chaotic events taking place on Starlight Beacon. While Kantam Sy was able to keep themselves relatively stable, Cohmac Vitus could not, and was extremely emotional, almost abandoning his current mission to go to the station. When Kantam demanded to know why, and insisted that he was needed here, Cohmac resisted and stated she, before he corrected himself to state that they, needed the Jedi on Corellia.\nThe other Jedi immediately guessed that Cohmac really meant Orla Jareni needed him, which was true as Cohmac emotionally crumpled, rasping out that Orla currently faced a horrible threat, the same threat that had killed Loden Greatstorm and infected the Jedi twins Terec and Ceret. Kantam was able to steady and draw their companion back into the moment by mentioning Cohmac's Padawn, Reath Silas, as well as the current threat on the planet which Cohmac agreed to help stop. However, when the battle was over, and after Reath Silas was knighted, Cohmac Vitus' emotions overwhelmed him. Likely able to sense Orla's death through the Force, the pain pushed the Master to resign from the Jedi Order, vanishing into the Corellian night.\nMany decades later in 41 BBY, a 16-year-old Padawn Obi-Wan Kenobi stumbled onto the same carved planet Orla Jareni had during her own Padawan training at the Jedi Temple on Coruscant. Drawn to the names carved beneath the mysterious world, Obi-Wan rushed to the Jedi Archives and read the files on both Orla Jareni and Cohmac Vitus, but remained focused mainly on Orla. Her file contained her planned flight path to Lenahra, but had seemingly not been touched since the time of the High Republic.\nObi-Wan eagerly informed his Jedi Master, Qui-Gon Jinn, of what he had discovered, hoping that the two would be able to go on a mission together like the sort his friends had with their masters. While Master Qui-Gon seemed interested in the mystery and had his Padawan plan a mission alongside acquiring a ship for them, Qui-Gon was ultimately missing when the time came for the mission to launch. As a result, Obi-Wan angrily left without him after a long period of waiting. While the events of the mission initially caused Obi-Wan great confusion on what or where Orla Jareni had gone on the planet, he eventually discovered the Lenahra temple and the datachip hidden within by the Umbaran. But, by Obi-Wan's time, the technology of the datachip was old, and it took the astromech A6-G2  a period of time to recover even partial data from the device.\nUpon the successful retrieval of parts of the information stored within, Obi-Wan Kenobi used a holoprojector to play the information he had access to in an effort to provide answers to both himself and the local group of teenagers and youths trapped on the planet who were unaware of its history. Orla's recording of her basic findings then appeared alongside her head, spelling out her interactions on Lenahra before glitching and ending on her interaction with a gobbler. The rest of the information on the datachip was not accessible at that time. At the end of Obi-Wan's adventure and return to the Jedi Temple, Qui-Gon revealed that he had not come on the mission hoping it would teach his Padawan to loosen up, and rely on more than academic-based education. As they walked, Obi-Wan informed him of the recording of Orla Jareni, with Qui-Gon stating he would be eager to hear about it, after the pair had meditated.\nAs an Umbaran, Jareni had stark pale skin and high cheekbones common to her species. Her hair was drawn back into a smooth knot and was a silver nearly as dark as black.\nJareni, while dedicated to serving the Jedi Order as a whole, had private disagreements with the Jedi High Council, specifically regarding their emphasis on training and instruction. Jareni felt that this came at the expense of being open to Force-inspired instinct. In part, because of these disagreements, she opted to become a Wayseeker, taking on missions of her own rather than from the High Council. She was noted to have a sharp wit and a wry nature, as well as a blunt disposition. She rarely minced words, but never meant to be hurtful in what she said, only desiring to be honest and caring for those she spoke frankly with. Orla also believed strongly in the importance of balance near the end of her life, experiencing and commenting on the phenomena in her holorecording recovered from Lenahra and then again during and after her time with Elzar Mann. She also had a strong ability to read and understand others. However, one of her flaws was her anger. While her self control was great and she was able to often keep it in check, that control was significantly frayed in the final hours of her life due to the situation that plagued Starlight Beacon.\nAs a Jedi Master, Orla Jareni had a strong connection to the Force. Like many other Force-sensitives, with this connection, Jareni was granted many notable abilities. Jareni had demonstrated the ability to sense the energies of the Dark side of the Force. On the Amaxine station, she felt the cold chills and invasive visions associated with sensing powerful dark energies. Like most Jedi, Jareni could use the Force to jump many meters into the air with ease. She possessed the ability to slow blaster bolts midair, and her primal connection to the Force granted her a uniquely analytical mind when she focused. Before leaving the Amaxine station for the first time, she learned from Cohmac Vitus the binding ritual to bind the statues, completing the task with some exertion. She later assisted the meditation on the statues by joining minds with other Jedi on Coruscant in the Shrines in the Depths.\nJareni was skilled in the usage of a lightsaber. She fought off two Nihil warriors at once, using the Force to augment her reflexes, as well as combatted multiple Drengir effectively despite a physical injury and an unfamiliarity with the creatures. She additionally was a competent pilot, and had some familiarity with repairing a starship.\nShe also had the uncanny ability to avoid getting herself or her stark-white robes marred with dirt, grime, ash, and other similar substances. This fact was commented on by people around her.\nJareni wore snowy robes. She wielded a white hinged double-bladed lightsaber. After the events on the Amaxine station, Jareni purchased a ship which she named the Lightseeker.\nOrla Jareni was first mentioned in the 2021 novel The High Republic: Light of the Jedi, written by Charles Soule, in which Jareni was described as a Jedi Knight. The novel The High Republic: Into the Dark by Claudia Gray, however, states that Jareni was a Jedi Master.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Special:Upload",
  "/wiki/230_BBY",
  "/wiki/Starlight_Beacon",
  "/wiki/Eiram_system",
  "/wiki/Umbaran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Orla_Jareni%27s_youngling_group",
  "/wiki/Laret_Soveral",
  "/wiki/Jedi_Master",
  "/wiki/Wayseeker",
  "/wiki/High_Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_High_Council",
  "/wiki/Padawan",
  "/wiki/Eiram%E2%80%93E%27ronoh_crisis",
  "/wiki/Standard_year",
  "/wiki/Starship",
  "/wiki/Vessel",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Drengir",
  "/wiki/Elzar_Mann",
  "/wiki/Attack_on_Valo",
  "/wiki/Nameless",
  "/wiki/Jedi_Archives",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Cohmac_Vitus",
  "/wiki/Jedi_Temple_Cr%C3%A8che",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Yoda",
  "/wiki/Jedi",
  "/wiki/Simmix",
  "/wiki/A-1_shuttle",
  "/wiki/Meditation",
  "/wiki/Monarch",
  "/wiki/Cassel",
  "/wiki/Lost_moon",
  "/wiki/Eiram",
  "/wiki/E%27ronoh",
  "/wiki/Unidentified_white_serpent_species",
  "/wiki/Queen",
  "/wiki/Thandeka",
  "/wiki/Comlink",
  "/wiki/Lord",
  "/wiki/Isamer",
  "/wiki/Lasat",
  "/wiki/The_Force",
  "/wiki/Core_Worlds",
  "/wiki/Reath_Silas",
  "/wiki/Dez_Rydan",
  "/wiki/Leox_Gyasi",
  "/wiki/Affie_Hollow",
  "/wiki/Geode",
  "/wiki/Hyperspace",
  "/wiki/Force-sensitive",
  "/wiki/Chandrilan_tea",
  "/wiki/Legacy_Run",
  "/wiki/Amaxine_space_station",
  "/wiki/Exosuit",
  "/wiki/Nan",
  "/wiki/Hague",
  "/wiki/Binding_statues",
  "/wiki/Force_vision",
  "/wiki/Lightsaber",
  "/wiki/8-T_gardening_model",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Hyperspace_route",
  "/wiki/Force_artifact",
  "/wiki/Wookiee",
  "/wiki/Shrine_in_the_Depths",
  "/wiki/Poreht_La",
  "/wiki/Tia_Mirabel",
  "/wiki/Giktoo_Nelmo",
  "/wiki/Force_barrier",
  "/wiki/Spice",
  "/wiki/Nihil",
  "/wiki/Zardossa_Stix",
  "/wiki/Sith",
  "/wiki/Zabrak",
  "/wiki/Blaster",
  "/wiki/Polearm",
  "/wiki/Gas_grenade",
  "/wiki/Adampo",
  "/wiki/Lightseeker",
  "/wiki/Chortose",
  "/wiki/Keeve_Trennis",
  "/wiki/Agricultural_Hub_42",
  "/wiki/Marshal",
  "/wiki/Great_Progenitor",
  "/wiki/Sskeer",
  "/wiki/Mulita",
  "/wiki/Wild_Space",
  "/wiki/Assault_on_Mulita",
  "/wiki/Arthropod",
  "/wiki/Hutt",
  "/wiki/Trandoshan",
  "/wiki/Stasis_field",
  "/wiki/Myarga",
  "/wiki/Bogan_Collection",
  "/wiki/Republic_Fair",
  "/wiki/Skirmish_in_the_Soola_system",
  "/wiki/Targes_scanner",
  "/wiki/Ransacker",
  "/wiki/Fleet",
  "/wiki/Ataraxia",
  "/wiki/Jedi_Vector",
  "/wiki/Lenahra",
  "/wiki/Datachip",
  "/wiki/Ledalau",
  "/wiki/Valo",
  "/wiki/Stellan_Gios",
  "/wiki/Echerta_system",
  "/wiki/Bell_Zettifar",
  "/wiki/Burryaga",
  "/wiki/Ember",
  "/wiki/Charhound",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Regald_Coll",
  "/wiki/Rathtar",
  "/wiki/Pamarthe",
  "/wiki/Emerick_Caphtor",
  "/wiki/Turbolift",
  "/wiki/Indeera_Stokes",
  "/wiki/Estala_Maru",
  "/wiki/Astromech",
  "/wiki/KC-78",
  "/wiki/Nib_Assek",
  "/wiki/Loden_Greatstorm",
  "/wiki/Hovergurney",
  "/wiki/Ops_(Starlight_Beacon)",
  "/wiki/Twi%27lek",
  "/wiki/Satellite",
  "/wiki/Starlight_Beacon_detention_center",
  "/wiki/Terec",
  "/wiki/Ceret",
  "/wiki/Kantam_Sy",
  "/wiki/Infiltration_on_Corellia",
  "/wiki/Battle_on_Corellia",
  "/wiki/Corellian",
  "/wiki/41_BBY",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/A6-G2",
  "/wiki/Holoprojector",
  "/wiki/Jedi_robes",
  "/wiki/Hinged_double-bladed_lightsaber",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Charles_Soule",
  "/wiki/Jedi_Knight",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/Claudia_Gray",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic_(2021)_7",
  "/wiki/The_High_Republic_(2021)_8",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/No_Stone_Unturned",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/Padawan_(novel)",
  "/wiki/Padawan_(audiobook)",
  "/wiki/Brotherhood",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_The_Bogan_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/Vernestra_Rwoh",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/Death"
 ]
}