{
 "name": "Orlo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ewok tribe"
     ]
    }
   ]
  }
 ],
 "content": "Orlo was an Ewok male who lived in Bright Tree Village on the Forest Moon of Endor. He worked as a bordok master and was responsible for sweeping the village's bordok stables. Around 3 ABY, Orlo was appointed an assistant, the young Ewok Wicket Wystri Warrick, who had failed his skills test for becoming a warrior. However, Warrick left the position shortly after to pursue his dreams of being a warrior again.\nOrlo was an Ewok male who resided on Endor, a forested moon in the Outer Rim Territories. He was a member of the tribe that inhabited Bright Tree Village, serving as the village's bordok master. By 3 ABY, when the young Ewok Wicket Wystri Warrick failed his skills test for becoming a warrior, Chief Chirpa assigned Warrick to become Orlo's assistant stable sweeper. Chirpa brought Warrick to Orlo, who congratulated the younger Ewok and informed him that training would begin the following day.\nWarrick became disillusioned with his dream of becoming a warrior and resigned to his duties as Orlo's assistant. However, after being chided by his friend Latara, Warrick left the village and retreated to the Cavern of Broken Dreams. When Latara, along with her friends Teebo and Kneesaa a Jari Kintaka, followed Warrick to the cavern and were attacked by a ferocious creature, Warrick defended them. With the creature defeated and his warrior dream renewed, Warrick gave his stable sweeping equipment to a disheartened lucksprite and suggested that he apply to be Orlo's assistant. Sometime later, when the wokling Malani was doubting her skills as a painter, Warrick told her his story of becoming Orlo's assistant.\nOrlo had gray fur and dark-colored eyes. He was missing several teeth and spoke with a lisp. When Orlo was introduced to Warrick, he spoke enthusiastically and congratulated the young Ewok.\nAs the appointed bordok master of Bright Tree Village, Orlo was responsible for sweeping the village's stables. Bordoks, which were pony-like beasts of burden, often formed strong bonds with their owners. The job was a low-qualifying position.\nOrlo wore an orange, green-patched cloak with a hood and carried a broom.\nOrlo appeared during a flashback sequence in \"Just My Luck,\" the eighteenth episode in the second season of the animated television series Ewoks. The episode was written by Michael Dubil and premiered on November 22, 1986.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bright_Tree_Village_tribe",
  "/wiki/File:Orlo-Ewoks.ogg",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Bordok/Legends",
  "/wiki/Beast_master",
  "/wiki/City/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Skills_test",
  "/wiki/Soldier/Legends",
  "/wiki/File:BordokSweeper-Ewoks.ogg",
  "/wiki/Forest/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Chirpa/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Latara",
  "/wiki/Cavern_of_Broken_Dreams",
  "/wiki/Teebo/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Cave/Legends",
  "/wiki/Unidentified_Endor_arachnid",
  "/wiki/Teebo%27s_lucksprite",
  "/wiki/Wokling/Legends",
  "/wiki/Malani",
  "/wiki/Artist/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/File:AssistantSweeper-Ewoks.ogg",
  "/wiki/Horse/Legends",
  "/wiki/Cloak/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Broom",
  "/wiki/Just_My_Luck",
  "/wiki/Ewoks:_Season_Two",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/Michael_Dubil",
  "/wiki/November_22",
  "/wiki/1986",
  "/wiki/Category:Images_of_Orlo",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27"
 ]
}