{
 "name": "Orn_Belden",
 "display_name": "Orn Belden",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bakura"
     ]
    },
    {
     "name": "Born",
     "values": [
      "160 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Bakura"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bakuran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Belden family",
      "Bakuran Senate"
     ]
    }
   ]
  }
 ],
 "content": "Orn Belden was a Bakuran male senator in the Bakuran Senate, a position he held since before the foundation of the Galactic Empire and represented the Bakur RepulsorCorp in the Senate that was instrumental in the export industry that Bakura was chiefly known for. He was 164 years old by the time of the Bakura Incident.\nA member of the Belden family, Orn was presumably one of the original Bakur Mining Corporation settlers of Bakura. He was described as being tall in terms of both height and courage.\nHe married Eppie Antruse in 97 BBY, the same year as a droid uprising on Bakura. Sometime afterward, they had their only child, Roviden. Along with his wife and son, Orn sympathized with the Rebel Alliance during the Galactic Civil War, but unlike them, he took no steps to help them.\nThus, when the Galactic Empire occupied Bakura in 1 ABY, his son was executed and his wife slated to be so; however, he convinced Governor Wilek Nereus to save her life by giving up his voice box. Nereus still punished Eppie, however, by inserting a senility-creating parasite into her brain.\nBy the time of the Imperial occupation of Bakura, he had become Senior Senator, despite the fact that he had two prosthetic hearts and now required a voice amplifier to speak. Of the handful of Bakuran senators who opposed the actions of the Imperial governor, Belden was the most vociferous. Along with Prime Minister Yeorg Captison, Belden secretly oversaw the existence of the underground resistance—although they numbered only ten cells with around ten members each.\nIt was the plan to activate these resistance cells against the occupation force during the Battle of Bakura that got Belden, Captison, and Rebel ambassador Leia Organa arrested. The shock was too much for the elderly Belden, and he died in captivity of an  cerebral hemorrhage.\nThe rebel cells rose anyways, under the leadership of the cured Eppie, and both Organa and Captison—as well as the planet—were free from Imperial control.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bakura/Legends",
  "/wiki/160_BBY",
  "/wiki/4_ABY/Legends",
  "/wiki/Bakuran",
  "/wiki/Gender/Legends",
  "/wiki/Belden_family",
  "/wiki/Bakuran_Senate",
  "/wiki/Senator/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bakur_RepulsorCorp",
  "/wiki/Standard_year/Legends",
  "/wiki/Bakura_Incident",
  "/wiki/Bakur_Mining_Corporation",
  "/wiki/Eppie_Belden",
  "/wiki/97_BBY",
  "/wiki/Roviden_Belden",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Wilek_Nereus",
  "/wiki/Prime_Minister_(Bakura)",
  "/wiki/Yeorg_Captison",
  "/wiki/Battle_of_Bakura",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Star_Wars_Adventure_Journal_6",
  "/wiki/The_Truce_at_Bakura",
  "/wiki/The_Truce_at_Bakura_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_23",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}