{
 "name": "Oro_Freatt",
 "display_name": "Oro Freatt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shownar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Shownarri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Oro Freatt was a crime lord who was the de facto ruler of the planet Shownar during the Galactic Civil War. Although a criminal, Freatt was also largely responsible for the success of Shownar's booming tourism industry. A small, officious man with a slimy, irritating manner, Freatt was fond of dressing in garish, tasteless clothing, and ostentatiously throwing cash around. Oro Freatt made his considerable fortune by using shrewd marketing to transform the naturally beautiful world of Shownar into a major tourist destination, as well as a world in which smugglers and other criminals could do business.\nTo gain and maintain power, Freatt built up a disciplined, professional criminal organization. Unlike most crime lords, Freatt made sure that the vast majority of the individuals in his organization were trained business people, rather than common criminals. This allowed him to maintain Shownarr's image as a peaceful, pleasant, and safe destination. In particular, Freatt controlled the local law enforcement. This meant that profitable vices, such as gambling and smuggling, were allowed and even encouraged, while violent crimes and theft were cracked down on harshly.\nFreatt cut deals with various organizations which allowed each of them to control one aspect of Shownar's economy, in return for providing a percentage of the profits to Freatt. In addition, Freatt gained direct control over certain high profit industries, including communications and energy. As Freatt was also the owner of all property on Shownar, he was able to make a great deal of money collecting rent from tenants. In order to keep his operations running smoothly, Freatt made sure to send appropriate taxes and bribes to the Empire and its local representatives.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shownar/Legends",
  "/wiki/Shownarri",
  "/wiki/Gender/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim"
 ]
}