{
 "name": "Orr'UrRuuR'R",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tusken Raider"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Orr'UrRuuR'R's tribe"
     ]
    }
   ]
  }
 ],
 "content": "Orr'UrRuuR'R was a Tusken Raider male who lived on the desert planet Tatooine in the Outer Rim. In the year 32 BBY, he and several other Tuskens took up position on top of the Canyon Dune Turn portion of the Boonta Eve Classic podracing course and fired on the podracers passing by.\nOrr'UrRuuR'R was a Tusken Raider male who lived as part of a tribe that roamed the Jundland Wastes of his homeworld of Tatooine in the Outer Rim. In the year 32 BBY, Orr'UrRuuR'R was among a group of at least four Tuskens who fired from a cliff top at the podracers competing in the Boonta Eve Classic race as the competitors passed through the Canyon Dune Turn portion of the course. During the first lap of the course, Orr'UrRuuR'R and the other Tusken Raiders huddled together to communicate before spreading out to fire on the podracers.\nThe Troig commentators Fodesinbeed Annodue mentioned the Tuskens in their commentary of the race. Despite not taking out any of the vehicles, the Tuskens then cheered while raising their rifles above their heads. When the podracers returned to the Canyon Dune Turn during the second lap, the racer Teemto Pagalies' vehicle was hit by a shot from one of the Tuskens and subsequently crashed.\nOrr'UrRuuR'R found his nomadic lifestyle among the Jundland Wastes' inhospitable desert terrain somewhat dull but enjoyed taking pot shots at podracers whenever he got the chance.\nOrr'UrRuuR'R wore a brown robe and head wrap that completely covered his body. His outfit also included gloves, a bandolier, and a belt of pouches. The Tusken Raider used a cycler rifle to fire on the podracers.\nOrr'UrRuuR'R was portrayed by an uncredited extra in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. The character's name was originally established by the \"Orr'UrRuuR'R\" card as part of the 2001 Reflections expansion set of the Star Wars Legends Young Jedi Collectible Card Game.\nThe name was then first used in the new Star Wars canon in the mobile game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Orr%27UrRuuR%27R",
  "/wiki/Orr%27UrRuuR%27R/Legends",
  "/wiki/Tatooine",
  "/wiki/Tusken_Raider",
  "/wiki/Gender",
  "/wiki/Orr%27UrRuuR%27R%27s_tribe",
  "/wiki/File:Fode-Tusken_Raiders.ogg",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Standard_year",
  "/wiki/32_BBY",
  "/wiki/Canyon_Dune_Turn",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Podracing",
  "/wiki/Podracer",
  "/wiki/Jundland_Wastes",
  "/wiki/Homeworld",
  "/wiki/Podracer_(profession)",
  "/wiki/Troig",
  "/wiki/Fodesinbeed_Annodue",
  "/wiki/Rifle",
  "/wiki/Teemto_Pagalies",
  "/wiki/Color",
  "/wiki/Robe",
  "/wiki/Glove",
  "/wiki/Bandolier",
  "/wiki/Belt",
  "/wiki/Cycler_rifle",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/2001",
  "/wiki/Young_Jedi_Reflections",
  "/wiki/Star_Wars_Legends",
  "/wiki/Young_Jedi_Collectible_Card_Game",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/Boonta_Eve_Podrace_(YJCCG)",
  "/wiki/StarWars.com",
  "/wiki/File:Leland_Chee_Force_Collection.png",
  "/wiki/In-universe"
 ]
}