{
 "name": "Orrin_Gault",
 "display_name": "Orrin Gault",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 69 BBY",
      "Tatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Settlers' Call Fund",
      "A'Yark's tribe"
     ]
    }
   ]
  }
 ],
 "content": "Orrin Gault was a male human moisture farmer and the father of Mullen and the twins Varan and Veeka. Gault led the Settlers' Call Fund, a vigilante organization meant to protect the farmers of Tatooine from Tusken Raiders. Gault had turned the Fund into a protection racket, and one from which he stole credits to pay off his debts to a bank and Jabba the Hutt.\nOrrin Gault was a moisture farmer who lived in the Pika Oasis on Tatooine. At some point in his life he married Liselle, and had three children: Mullen and the twins Varan and Veeka. His wife left him before 19 BBY, and he had a close relationship with the Calwell family. After his friend, Dannar Calwell, died Orrin borrowed a lot of money from Jabba the Hutt in order to perfect the water he harvested. He began to accumulate a huge debt. At first he thought he would be able to pay the money back as soon as he got a good harvest, but the day never came and Orrin turned to desperate measures. He set up the Settlers' Call Fund, and had people put their money into an account to get it off the ground. Unknown to them, Orrin kept a lot of their money for himself to help pay off his debt.\nWhen the plan backfired, he was taken into service by the Tusken clan he had tried to exterminate.\nOrrin was a cosmopolitan which meant that any being that was willing to puts its back into hard work was fine with him. Orrin was in debt to Jabba the Hutt and embezzled money from his protection racket disguised as a subscription based response system called the Settler's Call; which was intended to mobilize farmers into a temporary militia. Gault used this as a front to incite attacks against the Tuskens in order to sell weapons, supplies and more subscriptions in order to pay back his debts.\nOrrin Gault served as the main antagonist for the 2013 novel Kenobi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Tatooine/Legends",
  "/wiki/69_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Settlers%27_Call_Fund",
  "/wiki/A%27Yark%27s_tribe",
  "/wiki/Moisture_farmer/Legends",
  "/wiki/Mullen_Gault",
  "/wiki/Varan_Gault",
  "/wiki/Veeka_Gault",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Pika_Oasis/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Liselle_Gault",
  "/wiki/Twin/Legends",
  "/wiki/Dannar_Calwell",
  "/wiki/Death/Legends",
  "/wiki/2013",
  "/wiki/Kenobi_(novel)",
  "/wiki/Kenobi_(audiobook)"
 ]
}