{
 "name": "Orri Tenro",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Lavender-white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Delphi Kloda's combat school"
     ]
    }
   ]
  }
 ],
 "content": "Orri Tenro was a Pantoran male who trained as a spy at the retired pirate Delphi Kloda's combat school on the planet Chaaktil.\nOrri Tenro was trained as a spy in the combat school run by retired pirate Delphi Kloda. Once Kloda had given Tenro enough training to make him a decent fighter, he sent the Pantoran on a mission with one of his former students, the mercenary Bazine Netal, in order to improve the kid's street smarts. Netal, who had agreed to train Tenro only so she could borrow Kloda's Gauntlet fighter, the Sparrowhawk, brought him with her to the planet Vashka, where she hoped to find the retired stormtrooper Jor Tribulus and recover a steel case from him that she had been hired to find. En route to Vashka, Netal provided Tenro with various training and advice on being a spy, even revealing some of her own past to him despite suspecting he might betray her. Once on Vashka, Tenro and Netal infiltrated Vashka City Medcenter One, Tribulus's last known location, and after separating from Netal, the Pantoran managed to hack into the medcenter's database to find that the retired trooper's last known address was a closed down retirement home known as Vashka Valley Retirement Facility 48. Tenro then met up with Netal at the Sparrowhawk and told her what he had learned, after which the mercenary injected the Pantoran with a poison that knocked him out so that she could complete the next part of the mission alone. By the time Tenro woke up and contacted Netal, she had successfully retrieved the steel case from Tribulus, who had been long dead, and killed Kloda, who had followed Netal to Vashka and betrayed her, trying to claim the case for himself.\nOrri Tenro appeared in the 2015 short story \"The Perfect Weapon,\" written by Delilah S. Dawson in 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Delphi_Kloda%27s_combat_school",
  "/wiki/Spy",
  "/wiki/Pirate",
  "/wiki/Delphi_Kloda",
  "/wiki/Planet",
  "/wiki/Chaaktil",
  "/wiki/Mercenary",
  "/wiki/Bazine_Netal",
  "/wiki/Kom%27rk-class_fighter/transport",
  "/wiki/Sparrowhawk",
  "/wiki/Vashka",
  "/wiki/Stormtrooper",
  "/wiki/Jor_Tribulus",
  "/wiki/Steel",
  "/wiki/Vashka_City_Medcenter_One",
  "/wiki/Medcenter",
  "/wiki/Vashka_Valley_Retirement_Facility_48",
  "/wiki/Mission_to_Vashka",
  "/wiki/Death",
  "/wiki/2015",
  "/wiki/The_Perfect_Weapon",
  "/wiki/Delilah_S._Dawson"
 ]
}