{
 "name": "Orth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pijal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pijali monarchy",
      "Assembly"
     ]
    }
   ]
  }
 ],
 "content": "Orth was a human female who served as a minister for the Pijali monarchy on the Inner Rim Territories planet Pijal. During the Republic Era, she worked under the world's regent, the Jedi Rael Averross, and the Pijali Crown Princess Fanry. Orth was a fierce supporter of Pijali tradition, and as a native to the planet she cared greatly for the monarchy and her future queen. During Averross' time as lord regent, she began to resent him greatly for his unshakeable support for the Czerka Corporation, a company with significant power on Pijal. Her role as minister allowed her to advise him and Fanry on matters concerning Pijal, despite their frequent arguments. When attacks seemingly spurred by the Opposition performance troupe began to occur on Pijal, Orth was one of the first to question whether Qui-Gon Jinn and Obi-Wan Kenobi, Jedi sent to assist, would be able to do anything Averross could not.\nMinister Orth took care to be present at several important milestones leading up to Fanry's coronation, including a special concert, crown selection session, and the ceremonial Grand Hunt. She was also present at the coronation itself, and escaped the violent seizure of power when her princess decided to spare her, citing Orth's lack of love for Czerka and her honesty. After Fanry unsuccessfully attempted to violently revolt against the Czerka Corporation, the Pijali monarchy was ended and Orth became the governor in a new democratic Assembly. As governor of Pijal, Orth intended to end Czerka Corporation's influence in the Pijal system.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pijal",
  "/wiki/Human",
  "/wiki/Pijali",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Pijali_monarchy",
  "/wiki/Assembly_(Pijal)",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Minister",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/Jedi",
  "/wiki/Rael_Averross",
  "/wiki/Crown",
  "/wiki/Prince",
  "/wiki/Fanry",
  "/wiki/Homeworld",
  "/wiki/Queen",
  "/wiki/Time",
  "/wiki/Czerka_Arms",
  "/wiki/Opposition",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Grand_Hunt",
  "/wiki/Governor",
  "/wiki/Democracy",
  "/wiki/Pijal_system",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Orth",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Master_%26_Apprentice_(audiobook)"
 ]
}