{
 "name": "Oruba",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nal Hutta"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.01 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "Grand Hutt Council",
      "Grand Hutt Council"
     ]
    }
   ]
  }
 ],
 "content": "Oruba was a male Hutt crime lord and a ruling member of the Grand Hutt Council during the Clone Wars. Oruba was born with a genetic defect that left his skin devoid of pigment, giving him a dissimilar look to most other Hutts. For this reason, he was one of the select few Hutts to wear any form of clothing, sporting an elaborate cape and a beret. When Maul and Death Watch came before the Hutt Council to demand an alliance, Oruba asked them if they had anything to trade in exchange for such a thing. All of the Hutts present laughed heartily at the proposal before ordering their deaths, but the expected execution became a skirmish in which Oruba lost his life at the hands of Savage Opress, but not before giving Maul the location of Jabba's Palace, Tatooine.\nOruba was the last member of the Grand Hutt Council to answer Jabba's summons with his hologram appearing in Jabba's throne room. For the first part of the meeting, Oruba did not speak. After Jabba responded to Arok's question of what was to happen to Ziro after he was freed, Oruba stated that he believed that the council would be better off if Ziro was under their protection. With Jabba agreeing, the elder Hutt asked who would undertake the task. Oruba received his answer as bounty hunter Cad Bane stepped through his hologram and presented himself to the council. Oruba agreed, along with Jabba and the rest of the Hutt council, that Cad Bane break Ziro out of Republic custody and deliver him to the council.\nOruba was present when Ziro was brought before the Hutt Grand Council on the planet Nal Hutta after being freed by Bane. As Ziro conversed with the council about the detail surrounding his release and the damaging information about the council's deeds, Oruba did not speak.\nAfter Ziro had been taken away to the detention block, Oruba and the rest of the council were entertained by a performance of Da Hutt Moda by Pa'lowick singer Sy Snootles. At the start of the performance, the elder Hutt nodded his approval to his fellow colleagues. Oruba chuckled as Snootles danced her way past him and along the other council members.\nAfter Snootle's performance, Oruba was enjoying the entertainment of the Twi'lek dancers when Jedi Knights Obi-Wan Kenobi and Quinlan Vos entered the council chamber. Oruba did not speak when Kenobi informed the council of Ziro's escape and leered at the pair after Vos stated he felt the council had been behind Ziro's escape. As the Jedi left, Oruba went back to watching the dancing Twi'lek.\nIn 20 BBY, the renegade Sith Lords Maul and Savage Opress as well as Death Watch leader Pre Vizsla, came before the Grand Hutt Council to seek an alliance for their Shadow Collective. Oruba was physically present with Arok and Marlo, along with Gorga and Jabba appearing by hologram. During the meeting, a skirmish broke out. While Arok and Marlo were able to escape, the Oruba was caught and Maul demanded the location of Jabba. After the frightened Hutt gave the location of Jabba's Palace, he was killed by Savage on the orders of Maul, who was dissatisfied that all the information Oruba could disclose was that Jabba was in his palace on Tatooine.\nOruba was identified by his relatively narrow head for a Hutt and the fact that he wore clothes. He also wore a kind of beret on his head. Oruba's pale skin was due to a genetic defect that left it without pigment and prone to chafe. He wore clothes to hide his condition.\nLike most Hutts, Oruba was fond of musical entertainment. When captured and interrogated by rogue Sith Lords Maul and Savage Opress, Oruba showed his cowardice and was terrified and willing to give up Jabba's location, though he had to give clarification when providing the two brothers the location of Jabba's Palace. Moments before his death, Oruba screamed in terror as Savage struck him down with his double-bladed lightsaber.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Oruba",
  "/wiki/Oruba/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Nal_Hutta",
  "/wiki/19_BBY",
  "/wiki/Hutt",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Albinism",
  "/wiki/Hutt_Clan",
  "/wiki/Grand_Hutt_Council",
  "/wiki/TC-70",
  "/wiki/Clone_Wars",
  "/wiki/Reproduction",
  "/wiki/Maul",
  "/wiki/Death_Watch",
  "/wiki/Mission_to_Nal_Hutta",
  "/wiki/Savage_Opress",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Tatooine",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hologram",
  "/wiki/Boba_Fett%27s_Palace#Throne_room",
  "/wiki/Arok",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Cad_Bane",
  "/wiki/Planet",
  "/wiki/Pa%27lowick",
  "/wiki/Sy_Snootles",
  "/wiki/Twi%27lek",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Quinlan_Vos",
  "/wiki/20_BBY",
  "/wiki/Sith_Lord",
  "/wiki/Pre_Vizsla",
  "/wiki/Shadow_Collective",
  "/wiki/Savage_Opress%27s_lightsaber",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Evil_Plans",
  "/wiki/Hunt_for_Ziro",
  "/wiki/Eminence_(episode)",
  "/wiki/Bounty_Hunters_13",
  "/wiki/Bounty_Hunters_14",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}