{
 "name": "Orvek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "18 BBY",
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ferren Barr's disciples"
     ]
    }
   ]
  }
 ],
 "content": "Orvek was a human male who became an acolyte to the Jedi Padawan Ferren Barr after the Galactic Empire bulldozed his home. Orvek worked with Barr on Mon Cala until Darth Vader discovered them. Orvek sacrificed himself to slow the Sith Lord down.\nShortly after the founding of the Galactic Empire, Orvek's home was bulldozed for an Imperial relay facility. One of the citizens protested to the troopers but they pointed their guns at them and Orvek was forced to leave. Sometime later Orvek met Ferren Barr, an Iktotchi Jedi Padawan who claimed to be a Jedi Master. Barr convinced Orvek into joining him using a Jedi mind trick and Orvek subsequently became one of Barr's six acolytes.\nBarr took Orvek and the other acolytes to Mon Cala, where Barr came to influence the King in his negotiations with the Empire. The king's way of negotiating caught the attention of the Emperor who sent Darth Vader, three Inquisitors and a squad of elite Purge Troopers. When Barr assassinated Ambassador Telvar, the man's superior, Moff Wilhuff Tarkin, sent forces down to invade Mon Cala.\nMany battles broke out and Vader obtained the location of Barr and his acolytes. The king told Barr that Vader was coming and Barr ordered the evacuation of his refuge. However, when leaving the refuge, the acolytes ran into Vader on his Imperial submarine. One of the other acolytes, Nipaltoo shot at Vader's submarine and Vader crushed his helmet. The others fled for Bel City and Orvek realized Vader was catching up. Orvek turned around and attacked Vader's submarine head on. Orvek was killed but he slowed Vader down enough for the others to make it to Bel City.\nOrvek had blond hair, brown eyes, and pale skin. He cared for the Mon Calamari's plight, as he was reluctant to abandon them.\nOrvek first appeared in Darth Vader  14, a 2017 canon comic written by Charles Soule and illustrated by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/18_BBY",
  "/wiki/Mon_Cala",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Ferren_Barr%27s_disciples",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ferren_Barr",
  "/wiki/Galactic_Empire",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sith_Lord",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Trooper",
  "/wiki/Iktotchi",
  "/wiki/Jedi_Master",
  "/wiki/Mind_trick",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/King",
  "/wiki/Inquisitorius",
  "/wiki/Purge_Trooper",
  "/wiki/Ambassador",
  "/wiki/Telvar",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Battle_of_Dac_City",
  "/wiki/Attack_on_Bergon%27s_sky-base",
  "/wiki/Ferren_Barr%27s_cave_refuge",
  "/wiki/Imperial_submarine",
  "/wiki/Nipaltoo",
  "/wiki/Bel_City",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/2017",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/Darth_Sidious",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Darth_Vader_(2017)_15"
 ]
}