{
 "name": "Osi_Sobeck",
 "display_name": "Osi Sobeck",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Phindar",
      "Lola Sayu"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Lola Sayu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Phindian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.03 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Khaki"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Osi Sobeck was a Phindian male who served the Confederacy of Independent Systems as a commandant during the Clone Wars. As warden of the Citadel on the planet Lola Sayu, Sobeck was in command of a prison designed to hold fallen Jedi. During the Battle of Lola Sayu, he tried to kill Captain Wilhuff Tarkin of the Galactic Republic, but was killed by Padawan Ahsoka Tano after she noticed Sobeck threatening the Republic officer's life.\nAbout one year into the Clone Wars, Separatist forces captured Jedi General Even Piell, who was returning to Coruscant from a mission. Piell and some of his men were imprisoned in the Citadel to be handled by Sobeck. Count Dooku ordered Sobeck to get valuable information about hyperspace coordinates known as the Nexus Route from Piell and his Captain Wilhuff Tarkin, as each possessed half of the information.\nThe Jedi Order and Galactic Republic launched a mission to rescue Piell and his men, using a Separatist shuttle and reprogrammed pilot droids to get a rescue team, led by Jedi Generals Anakin Skywalker and Obi-Wan Kenobi, on Lola Sayu. Sobeck suspected that the Jedi would attempt to rescue Piell and had his T-series tactical droid second in command, K2-B4, scan the shuttle for life forms when it asked permission to land on the planet. The scanners didn't detect any life, as the rescue team had been frozen in carbonite, and K2-B4 gave permission to land. Sobeck grew suspicious when the shuttle didn't arrive on the landing platform. When a clone trooper accidentally activated an electro mine, Sobeck was sure a rescue team had entered the Citadel and ordered the facility on high alert.\nThe Jedi managed to rescue Piell from the interrogation cell but Sobeck activated a super magnet, that pulled the group's weapons to it, as well as Anakin, who had a cybernetic arm, and had them surrounded by BX-series droid commandos. Anakin, however, managed to destroy the magnet, allowing his fellows to take their weapons back and destroy the droids, much to Sobeck's frustration. The team went on to retrieve Tarkin and Piell's other men from their cell and split up into two groups. The first group, led by Piell and Kenobi, used thermal denotators to create some explosions on the upper levels of the prison as a diversion, wreaking havoc in the facility, while the second group, led by Tarkin, Skywalker and his padawan Ahsoka Tano, escaped the building on the lower levels into a series of tunnels.\nCount Dooku contacted Sobeck after learning of the escape, and Sobeck assured him that the situation was under control and that he would soon have the information. Meanwhile, Skywalker had his astromech droid R2-D2, who was in charge of the shuttle and the reprogrammed battle droids, landed their shuttle on the Citadel's landing platform so he could pick up Kenobi's group, who were still in the building. Kenobi's group, however, had been captured by Sobeck's troops and brought before Sobeck, who demanded Piell's half of the information, executing a clone and threatening to kill the rest if he refused to speak. Before he could kill a second clone, K2-B4 informed him that Skywalker's group had been located, and he ordered the prisoners be taken to the interrogation level for torture while he focused on Skywalker's group. R2-D2's droids managed to take over Kenobi's group from the security droids escorting them and a droid soon reported that the prisoners had not arrived at the interrogation level, angering Sobeck. K2-B4 told him that Count Dooku wanted to speak him, but Sobeck ignored this and ordered all units to the landing platform, as the shuttle was the prisoner's only chance to escape the planet. When Kenobi's group tried to board the shuttle by acting as prisoners of the reprogrammed droids, K2-B4 informed the units on the platform of the deception. This resulted in a battle on the landing platform. Skywalker's group soon arrived, but a commando droid managed to blow up the shuttle, destroying the team's only chance of escape. The team retreated into the lower caves of Lola Sayu.\nSobeck was almost certain that the Republic would launch a second mission to evacuate the prisoners, and had K2-B4 command the blockade fleet while he focussed on recapturing the team. Count Dooku contacted him again, demanding the truth about the prisoners. Sobeck told Dooku that his troops would soon capture them now that their ship was destroyed, to which Dooku replied that Sobeck's honesty was the only thing keeping him alive. Sobeck released a pack of Anoobas to track down the prisoners, which killed Piell after he had passed on his half of the information to Ahsoka.\nWhen a droid reported that the Anoobas had located the prisoners, Sobeck personally commanded a squad of droids on STAPs to deal with them. Sobeck and his party found the group on a small island and engaged them. Without success, as Anakin and Obi-Wan destroyed most of Sobeck's squad, while R2-D2 created a cloud of smoke, blinding Sobeck, which allowed ARC trooper Fives to shoot his STAP down. Tarkin tried to shoot Sobeck but missed, and Sobeck grabbed his throat. Realizing he could never have the information, Sobeck lifted Tarkin and attempted to throw him into the lava, so that no one would have it. Ahsoka, however, spotted this and impaled Sobeck through the back with one of her lightsabers, killing him. Not long thereafter, the Republic broke through the blockade of Lola Sayu and evacuated the prisoners.\nAs the warden of the infamously inescapable Citadel, Sobeck was extremely prideful of his reputation and would often take any means necessary to capture fleeing prisoners. Despite his position as warden requiring him to stay in his security room, he was often called a coward by adversaries for this reluctance from direct engagement. Sobeck became increasingly angry as his droid guards failed to subdue the Republic intruders, even to execute valuable BX-series commando droids simply for reporting that prisoners had escaped. He was also impatient and easily provoked; one time threatening his tactical droid for not informing him of Dooku's transmission before accepting it, telling him that he needs time to prepare.\nSobeck primarily oversaw the facility's operations from his command center via security cameras and reports from droid guards. His range of control of the prison's systems included from being able to remotely close blast doors within the ventilation shafts to halt intruders' movement and activating magnetic ceilings to disarm them. Although he rarely involved himself in matters personally, moments of desperation saw him wielding E-5 blaster rifles as he chased escapees. As far as physical capabilities go, Sobeck was quite stronger than the average person, being able to easily lift an adult male human with both arms.\nOsi Sobeck first appeared in \"The Citadel,\" the eighteenth episode of the Star Wars: The Clone Wars television series' third season, which aired on February 18, 2011. He was voiced by James Arnold Taylor. According to Taylor, Sobeck's voice is a combination of \"Christopher Walken and a little Al Pacino.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Osi_Sobeck",
  "/wiki/Osi_Sobeck/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Phindar",
  "/wiki/Lola_Sayu",
  "/wiki/20_BBY",
  "/wiki/Phindian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Commandant",
  "/wiki/Clone_Wars",
  "/wiki/Warden",
  "/wiki/Citadel",
  "/wiki/Planet",
  "/wiki/Prison",
  "/wiki/Prisoner",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Jedi",
  "/wiki/Battle_of_Lola_Sayu",
  "/wiki/Death",
  "/wiki/Captain",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Galactic_Republic",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Republic_officer",
  "/wiki/Standard_year",
  "/wiki/Capture_of_Even_Piell",
  "/wiki/Jedi_General",
  "/wiki/Even_Piell",
  "/wiki/Coruscant",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Hyperspace",
  "/wiki/Nexus_Route",
  "/wiki/Jedi_Order",
  "/wiki/Sheathipede-class_Type_B_shuttle",
  "/wiki/OOM_pilot_battle_droid",
  "/wiki/Anakin_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/K2-B4",
  "/wiki/Shuttle",
  "/wiki/Carbonite",
  "/wiki/Charger",
  "/wiki/Cybernetics",
  "/wiki/BX-series_droid_commando",
  "/wiki/Thermal_detonator",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Anooba",
  "/wiki/Single_Trooper_Aerial_Platform",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5555",
  "/wiki/Lightsaber",
  "/wiki/E-5_blaster_rifle",
  "/wiki/The_Citadel",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/February_18",
  "/wiki/2011",
  "/wiki/James_Arnold_Taylor",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Counterattack",
  "/wiki/Citadel_Rescue",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ghosts_of_Mortis",
  "/wiki/Water_War",
  "/wiki/StarWars.com"
 ]
}