{
 "name": "Osika_Kirske",
 "display_name": "Osika Kirske",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Before 22 BBY",
      "Rattatak"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vollick"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Osika Kirske was a Vollick male warlord on the planet Rattatak. Kirske ordered the death of the Jedi Knight Ky Narec, capturing the Padawan Asajj Ventress, forcing her to serve as a gladiator in his arena. He was killed by the Sith Lord Dooku, who took Ventress to become his apprentice.\nDuring the time of the Galactic Republic, Osika Kirske ruled as a warlord on the planet Rattatak, running a gladiatorial arena. Sometime prior to 22 BBY, Weequay raiders working for Kirske harassed the inhabitants of Velenki, a settlement on Rattatak. The Jedi Knight Ky Narec and his Padawan, former slave Asajj Ventress, went to assist the villagers. Kirske threatened to torch the village unless its inhabitants handed the two Jedi over to him. The villagers followed Kirske's orders, but the warlord had the village burned regardless.\nKirske's Weequay raiders surrounded the two Jedi, shooting and killing Narec. Angered by the death of her Master, Ventress retaliated against their attackers, slaughtering the raiders and the Rattataki who had conspired to kill Narec, including Zol Kramer and Rynn'k-lee. However, Kirske led Ventress into a trap when she attempted to kill him, using himself as bait. Ventress was captured and forced to fight in Kirske's arena. During one of Ventress' fights, the Sith Lord Dooku visited the arena in search of an assassin, watching Ventress from Kirske's viewing gallery. Choosing to take Ventress as his Sith apprentice, Dooku used his lightsaber to behead Kirske, killing the warlord.\nA Vollick male, Osika Kirske was a cruel warlord, and enjoyed watching his enslaved gladiators fight. Kirske promised to let the villagers of Velenki survive if they handed over Narec and Ventress, but betrayed his word and burned their village despite their agreement.\nOsika Kirske was first mentioned in the new Star Wars canon in the 2019 audiobook Dooku: Jedi Lost, written by Cavan Scott. In the Star Wars Legends continuity, Osika Kirske first appeared in the 2004 comic Republic 60.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Osika_Kirske",
  "/wiki/Osika_Kirske/Legends",
  "/wiki/22_BBY",
  "/wiki/Rattatak",
  "/wiki/Vollick",
  "/wiki/Gender",
  "/wiki/Warlord",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Jedi_Knight",
  "/wiki/Ky_Narec",
  "/wiki/Padawan",
  "/wiki/Asajj_Ventress",
  "/wiki/Gladiator",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Dooku",
  "/wiki/Sith_apprentice",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Weequay",
  "/wiki/Pirate",
  "/wiki/Velenki",
  "/wiki/Slavery",
  "/wiki/Jedi",
  "/wiki/Fire",
  "/wiki/Rattataki",
  "/wiki/Zol_Kramer",
  "/wiki/Rynn%27k-lee",
  "/wiki/Assassin",
  "/wiki/Dooku%27s_lightsaber",
  "/wiki/Star_Wars",
  "/wiki/2019",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Cavan_Scott",
  "/wiki/Star_Wars_Legends",
  "/wiki/2004",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Republic_60",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}