{
 "name": "Ostan Atur",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Low'n"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lowen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    }
   ]
  }
 ],
 "content": "Ostan Atur was a a skilled Lowen saboteur who proved to be a hindrance to several key Republic installations like the Qua'Tahc meleenium mines on Af'El under the jurisdiction of the New Republic.\nOstan Atur was born on Low'n, a Mid Rim planet where she was surrounded by mercenaries and smugglers. Tempted by the amount of money she could earn, Atur decided to become a saboteur in the Lesser Plooriod Cluster and eventually began working for the Ithorian gangster Tolad Dor. She worked for Dor for close to two years, during which time she killed Imperial Colonel Sil Ompren by rigging detonators to a repulsorcraft. Atur also crippled many starships, to allow Dor's minions to collect their cargo to sell on the invisible market.\nShe eventually elocated to the little-known Minos Cluster and entered a partnership with the Reigat Talak. Atur was chosen by Rani Quanic to aid in the theft of 100 kilograms of meleenium from New Republic mines. During the heist, Atur disabled several of the security systems and several B1 worker droids on duty in one of the Qua'Tahc tunnels' southeast shafts enabling the criminals to escape relatively easily.\nHowever, a group of three Republic operatives came upon the fleeing thieves. Atur and her companions sprayed the area with blaster fire, which caused the three Republic operatives to be seriously wounded. After the heist, there was a reward for her capture of 25,000 credits.\nAs a result of being raised among cutthroat mercenaries, smugglers and other lawbreakers, she took to the customs and became both quite independent and dauntless, seeking bigger and better opportunities and more challenging assignments.\nHaving learned a great deal about technology of all sorts while frequenting Low'n spaceports and tech shops, she was capable of computer and droid programming and repair, demolition, first aid, repulsorlift and transports repair, and was skilled in disabling all these types of equipment.\nShe was usually seen with a blaster pistol, a comlink, a datapad, a pocket computer, and a security tool kit.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Low%27n",
  "/wiki/Lowen",
  "/wiki/Gender/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Qua%27Tahc",
  "/wiki/Meleenium/Legends",
  "/wiki/Af%27El",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Lesser_Plooriod_Cluster/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Tolad_Dor",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Sil_Ompren",
  "/wiki/Detonator/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Reigat",
  "/wiki/Talak",
  "/wiki/Rani_Quanic",
  "/wiki/B1_worker_droid",
  "/wiki/Thief/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Credit",
  "/wiki/Droid/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_10"
 ]
}