{
 "name": "Osvald_Teshik",
 "display_name": "Osvald Teshik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green ; red"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "75% of his body"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Osvald Teshik was a Human male who served as a Grand Admiral in the Imperial Navy. A respected strategist, he was one of the original twelve individuals to be appointed to the rank of Grand Admiral by Emperor Palpatine two years before the Battle of Yavin. In this position, Teshik commanded the Imperial Center Oversector, a vast region of space that included the galactic capital of Imperial Center and all of the oversector's fleets.\nIn 0 ABY, Teshik was tasked with recovering Imperial Advisor Coh Veshiv after the advisor was captured by the Rebel privateer frigate Far Orbit. He failed to rescue Veshiv or deal with the vessel's renegade captain, prompting Palpatine to send him into the Hapes Cluster to engage the Hapan Royal Navy with insufficient firepower and supplies. Nearly killed in the battle, the Grand Admiral was left to drift in space until he was retrieved by an Imperial snoopship. As a result of injuries he sustained during the engagement, seventy-five percent of his body had to be replaced with cybernetic parts. Teshik was shunned by many as a result, who saw him as a weak and repulsive cyborg.\nFour years after the incident at Andalia, Teshik was present aboard the second Death Star during the Rebel Alliance's attack on the battlestation. When the tide of the battle turned against the Empire, he narrowly escaped the Death Star before its destruction to continue the fight against the Alliance from his flagship, the Star Destroyer Eleemosynary. For four hours after the remnants of the Imperial fleet fled into hyperspace, Teshik pursued battle with the Rebels until his Star Destroyer was disabled by concentrated ion cannon fire. Captured by the Alliance and sentenced to death for committing crimes against galactic citizens, Teshik mocked his captors with mechanical laughter, warning them that their fight was far from over.\nOsvald Teshik was a Human male who lived during the reign of the Galactic Empire. Though generations of his family resided in the Sirpar Hills of the planet Anaxes, Teshik spent summers on the planet Kallistas when he was young, staring at the stars in the night sky. In later years, he served as an admiral in the Imperial Navy, and it was through this service that he earned the reputation of being a renowned strategist. In 2 BBY, Teshik was elevated to the newly created rank of Grand Admiral by Emperor Palpatine. As one of the twelve Grand Admirals, he answered directly to the Emperor and served as a leader of the Imperial Military. Teshik was one of Palpatine's most important and trusted Grand Admirals, as he commanded Imperial Center Oversector, which embraced the very capital of the Empire and the government's most developed, wealthy worlds, such as Anaxes. This position put him in command of the various fleets that were attached to the galaxy's most important oversector, one of which was the Azure Hammer Command, which included the Executor-class Star Dreadnought Whelm and fifty-seven other capital ships. Teshik took his duty to keep the Core Worlds safe very seriously, but Azure Hammer Command and the Anaxes Citadel, the center of government on the planet of the same name, only answered to him until the Battle of Yavin.\nIn 0 ABY, Imperial Advisor Coh Veshiv was abducted from a space station above Esseles by the privateer Nebulon-B frigate Far Orbit. Because Esseles fell within Teshik's domain, Palpatine tasked the Grand Admiral with retrieving Veshiv. As an added incentive, the Emperor personally threatened Teshik with execution if he did not immediately deal with the ship and its captain, Dhas Fenoep Vedij. When Teshik failed to rescue Veshiv and kill Vedij, Palpatine ordered the Grand Admiral to attack the isolationist Hapes Consortium with insufficient forces and matériel as an example to the other Grand Admirals that even they were not beyond reproach. Teshik was placed in command of a Pursuit-class light cruiser, the Shepherd, and a small fleet comprised of eight gunships and two TIE fighter squadrons before being dispatched to Consortium space.\nUpon arrival above the planet Hapes, Teshik received orders to proceed to Andalia, where he was to attack the Hapan fleet. The Hapan Battle Dragons and Nova-class battle cruisers present at Andalia ripped Teshik's forces apart with ease, and once the Shepherd was damaged, the Grand Admiral sealed himself in a vac suit before being sucked out into space through a hull breach. Shortly after regaining consciousness while floating in the void, he experienced a vision, which—as he later claimed—showed him the past and the future of the galaxy. Eventually, he was picked up by an Imperial snoopship sent there so the Emperor could observe Teshik's doomed mission. Teshik had not escaped unhurt, however, and seventy-five percent of his body had to be replaced with cybernetic parts. Though he retained his position of Grand Admiral, Teshik became the target of much abuse and discrimination due to his extensive cybernetics. As a result, the Grand Admiral completely cut himself off from his emotions.\nFour years later, alongside Grand Admirals Nial Declann, Miltin Takel, and Afsheen Makati, Teshik accompanied Emperor Palpatine to the second Death Star as the battlestation was being constructed above the Forest Moon of Endor. The Rebel Alliance, learning of Palpatine's presence aboard the new Death Star, launched an attack against the station, believing the Imperial fleet to be scattered across the galaxy. However, it was a ruse orchestrated by the Emperor, and the Rebels had fallen into the trap. Under the command of Admiral Firmus Piett aboard the Star Dreadnought Executor, the Imperial fleet engaged the Rebels in an effort to annihilate them once and for all. However, when the ambush backfired and the Death Star became critically damaged, Teshik attempted to escape the station, only to be pinned beneath a fallen column. Of the myriad of Imperials fleeing the station, only one—a construction worker—stopped to free him. The worker's generosity and kindness moved Teshik, who regained the long-lost compassion he had once shown toward others.\nEscaping the station, Teshik arrived aboard his personal command ship, the Star Destroyer Eleemosynary. With the Emperor, Darth Vader, and Grand Admiral Declann dead, and Grand Admirals Takel and Makati fleeing, Teshik assumed command of the remaining Imperial forces and prosecuted the fight against the Alliance Fleet. He fought off the Rebels on his own after the remnants of the Imperial fleet fled under Captain Gilad Pellaeon, commander of the Star Destroyer Chimaera. It took four hours of intense fighting before Teshik's flagship was finally disabled by a barrage of ion cannon fire. The Alliance captured Teshik alive, put him on trial for \"inhuman atrocities committed against the citizens of the galaxy,\" convicted him, and sentenced him to death. The irony of the sentencing did not escape Teshik, and before his execution, he responded with mechanical laughter. In his final statement, he relayed the story of his experiences at Andalia, warning the Rebels that their fight with the Empire was far from over. Teshik became one of the few Imperials executed for war crimes by the New Republic, the Alliance's successor government.\nOsvald Teshik was notable for his confidence and compassion, something very rare among high Imperial officials. He was dedicated to the Imperial cause, taking his position as commander of Imperial Center Oversector seriously, and he had a keen mind for military strategy. As a testament to his ability, Teshik was able to stand his ground against the enemy even when they outnumbered him. He refused to surrender even when the odds were against him, such as in his engagements with the Hapan navy in the Hapes Cluster and the Alliance Fleet at Endor. In both situations his losses were personal: he lost seventy-five percent of his organic body in the skirmish with the Hapan fleet, and he persevered when he led the remnants of the Imperial fleet at Endor even when faced with utter hopelessness. At times, his Academy training would unconsciously kick in.\nDuring his near-death experience at Andalia, Teshik experienced a vision while floating in the void, a vision he later relayed to his Rebel captors. Over the course of the experience, the Grand Admiral saw \"beings made of light\" and several battles from both the distant past and future, images that convinced him that all warriors merge into one otherworldly collective upon death. In the epiphany, Teshik concluded that conflict between beings was unavoidable, and that individual struggles were merely small parts of a much larger, all-encompassing war.\nHe was also known for the cybernetic replacements he received following his encounter with the Hapan navy. He had a red prosthetic right eye, numerous wires entering both his skull and throat, and metal plates bolted to his forehead. However, because the Empire discriminated against the ill and weak—serious mutilations were rare due to widespread use of bacta—Teshik was universally shunned and an object of revulsion. Being ostracized, the shame and unending prejudice he experienced hardened his heart. As a result, he lost his compassion, and it was not until he was freed from the fallen column aboard the second Death Star that he regained this. He also admitted he wasn't sure why Palpatine was Emperor prior to his execution, citing that \"being Emperor was its own why\" when asked why he nearly had him executed, and reiterated this statement regarding why Palpatine bothered to save him.\nOsvald Teshik was first mentioned in 1998's The Far Orbit Project, written by Timothy S. O'Brien and published by West End Games. It was not until 2003's Who's Who: Imperial Grand Admirals, by Abel G. Peña and Daniel Wallace, that Teshik was given a backstory. Along with Captain Xamuel Lennox of the Tyrant and Force-sensitive TIE pilot Maarek Stele, Abel G. Peña considers Teshik to be one of his \"good\" Imperials, \"making the best of ethically impossible circumstances.\" Peña has also said that Teshik's story was intended to be a tragic one. Teshik received an entry in 2008's The Complete Star Wars Encyclopedia.\nBefore appearing in Star Wars Insider 66, the article Who's Who: Imperial Grand Admirals was originally planned to appear in an issue of Star Wars Gamer under the name \"Dirty Dozen: The Imperial Grand Admirals\" until the magazine was discontinued. There are few differences between the biography present in Dirty Dozen and the final one present in Who's Who; for example, while the initial version of the article established his flagship, the Eleemosynary, as an Imperial-class Star Destroyer, Who's Who eliminated any mention of its class. Three additional pieces of information that did not make it into the final article are described in the accompanying section below.\nTeshik never had reservations about the Empire. When sent to eliminate the crew of the Far Orbit, he was also tasked with securing the spacelanes from Vedij's plundering of the Ringali Shell, home to half a dozen highly-populated star systems. If he failed, Palpatine threatened to behead the Grand Admiral. Following the engagement with the Hapan fleet and his reconstruction as a cyborg with a built-in blaster cannon, Teshik did not become a droid-hater like stormtrooper-turned-bounty hunter Beilert Valance or end up infuriated with organics like the largely-cybernetic recluse Kligson. At the time of his execution, his artificial, hollow laughter was the saddest sound the Rebels present ever heard.\nThere is an issue over when the Imperial retreat was called during the Battle of Endor. Who's Who states that the retreat was ordered hours before Teshik was captured by the Alliance, but The New Essential Chronology says that Captain Gilad Pellaeon called the retreat after Teshik's flagship was disabled. The Essential Guide to Warfare reaffirms the former, stating that Pellaeon and the fleet fled four hours before Teshik was captured.\nWhile The Essential Guide to Warfare clarifies the timing of the Imperial retreat, it introduces a slight inconsistency regarding the Grand Admiral's homeworld. In the book's prologue, which consists of Teshik's final words, he states that he spent time on Kallistas as a youth, hinting that he is from the planet. However, later in the book, it is implied that Teshiks had resided on Anaxes for generations. This article has attempted to reconcile these two pieces of information.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/4_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Imperial_Center_Oversector",
  "/wiki/Realspace/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Oversector/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Imperial_Advisor",
  "/wiki/Coh_Veshiv",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Far_Orbit",
  "/wiki/Dhas_Fenoep_Vedij",
  "/wiki/Hapes_Cluster/Legends",
  "/wiki/Battle_of_Andalia",
  "/wiki/Hapan_Royal_Navy",
  "/wiki/Snoopship",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Battlestation",
  "/wiki/Death_Star/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Eleemosynary",
  "/wiki/Hyperspace/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Death/Legends",
  "/wiki/File:Anaxes.jpg",
  "/wiki/Sirpar_Hills",
  "/wiki/Planet/Legends",
  "/wiki/Anaxes/Legends",
  "/wiki/Kallistas",
  "/wiki/Star/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/First_Army",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Whelm",
  "/wiki/Capital_ship/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Anaxes_Citadel",
  "/wiki/Space_station/Legends",
  "/wiki/Esseles/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Pursuit-class_light_cruiser",
  "/wiki/Shepherd",
  "/wiki/Gunship/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Squadron/Legends",
  "/wiki/Hapes/Legends",
  "/wiki/Hapan_Battle_Dragon",
  "/wiki/Nova-class_battle_cruiser",
  "/wiki/Enviro-suit",
  "/wiki/File:BattleOfAndalia-EGW.jpg",
  "/wiki/Nial_Declann",
  "/wiki/Miltin_Takel",
  "/wiki/Afsheen_Makati",
  "/wiki/Endor/Legends",
  "/wiki/Firmus_Piett/Legends",
  "/wiki/Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Command_ship/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Chimaera/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Celestial/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Heart/Legends",
  "/wiki/1998",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Timothy_S._O%27Brien",
  "/wiki/West_End_Games",
  "/wiki/2003",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Daniel_Wallace",
  "/wiki/Xamuel_Lennox",
  "/wiki/Rebel_Dream",
  "/wiki/Force-sensitive/Legends",
  "/wiki/TIE_pilot",
  "/wiki/Maarek_Stele/Legends",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Dirty_Dozen:_The_Imperial_Grand_Admirals",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Star_Wars",
  "/wiki/Hyperlane",
  "/wiki/Ringali_Shell",
  "/wiki/Star_system/Legends",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Beilert_Valance/Legends",
  "/wiki/Kligson",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_67",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/January_26",
  "/wiki/2005",
  "/wiki/Wookieepedia:Interview/Abel_G._Pe%C3%B1a",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Martio_Batch",
  "/wiki/Octavian_Grant",
  "/wiki/Josef_Grunger",
  "/wiki/Ishin-Il-Raz",
  "/wiki/Danetta_Pitta",
  "/wiki/Peccati_Syn",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Rufaan_Tigellinus",
  "/wiki/Demetrius_Zaarin",
  "/wiki/Balanhai_Savit"
 ]
}