{
 "name": "Oteg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Before 3843 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yoda's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic",
      "Republic Navy",
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Oteg was a revered male Jedi Master and Fleet Admiral who served the Jedi Order and the Galactic Republic during the Great Galactic War and the ensuing Cold War. Oteg commanded the Republic's First Expeditionary Fleet, which fought against the Sith Empire during the Cold War and the Galactic War.\nA Force-sensitive member of a long-lived species, Oteg was educated in the ways of the Force by the Jedi Order two centuries before the start of the Great Galactic War. Earning the rank of Jedi Master, Oteg was serving aboard the Republic starship Sarapin Wanderer during the Great Galactic War with the resurgent Sith Empire when it was attacked and its captain killed. Taking command and organizing a counterattack, Oteg proved his prowess in warfare when he drove the Imperial fleet into a nearby nebula and tricked them into detonating the gases of the nebula to destroy the fleet.\nUpon returning to Republic space after the Treaty of Coruscant went into effect, Oteg was appointed to the Jedi High Council and would aid in leading the Order until the peace brought on by the treaty began to erode. As conflicts began to shatter the peace, Supreme Chancellor Dorian Janarus recommended that Oteg fill the role of Fleet Admiral. With the approval of Grand Master Satele Shan, Oteg left the Council and took command of the first expeditionary fleet from the bridge of the Republic dreadnought Telos.\nDuring the war he summoned an elite four man strike team to converse with the Force ghost of Meetra Surik, telling them of a Jedi Master held prisoner by the Sith Empire. He directed the ensuing operation to obtain the means to liberate the Jedi Master—later revealed to be the legendary Revan—which involved obtaining a Gree key. Once the computer had been obtained, the Jedi Master went on to command the fleet into the Maelstrom and engage the Imperial Fifth Fleet under Grand Moff Rycus Kilran, stationed at the prison facility. Being cornered by both the Imperial fleet and the station's weaponry, he would communicate to the Republic strike team inside the station and informing them of the situation, they would tell him to pull back, in effect saving Oteg's life and the flagship, while they freed Revan. After Revan's rescue, Master Oteg welcomed him aboard the Telos.\nOteg was voiced by Jim Cummings.\nIf the player chooses the dark side option in the Maelstrom Prison flashpoint, Oteg dies as the bridge of the Telos is destroyed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3843_BBY",
  "/wiki/Yoda%27s_species/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Fleet_Admiral/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/First_Expeditionary_Fleet",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_War",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sarapin_Wanderer",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Dorian_Janarus",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Valor-class_cruiser",
  "/wiki/Telos_(Valor-class)",
  "/wiki/Force_ghost",
  "/wiki/Meetra_Surik",
  "/wiki/Battle_of_Taral_V",
  "/wiki/Revan/Legends",
  "/wiki/Gree/Legends",
  "/wiki/Gree_computer",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Rycus_Kilran",
  "/wiki/Jim_Cummings",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}