{
 "name": "Ott_Klemp",
 "display_name": "Ott Klemp",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ott Klemp was a member of the Rebel Alliance who served in the Scavenger Squadron around 4 ABY.\nOtt Klemp was one of the younger and less experienced pilots of the Scavenger Squadron. Commander Gennad Rozhdenst assigned Klemp the duty of transferring him from their mobile base-support ship to the KDY construction docks, to give the young pilot more flight time.\nKlemp was able to share with his Commander his belief that Scavenger Squadron should try to claim the completed Warships that awaited the Imperial Navy on the KDY construction docks. Rozhdenst explained that the poorly equipped squadron would fail in that attempt.\nDuring the attempted destruction of the construction docks at KDY by Kuat of Kuat, Ott Klemp and the Scavenger Squadron did try to save these warships. Klemp flew his Y-Wing down to the dock, transferred into a Tug module connected to a Lancer-class frigate and successfully piloted it below a falling construction crane to safety.\nScavenger Squadron was able to save four Lancer-class frigates and an unspecified number of Zebulon-B frigates. Unfortunately, Scavenger Squadron lost 2 pilots during the mission.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Scavenger_Squadron",
  "/wiki/4_ABY/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Gennad_Rozhdenst",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Kuat_of_Kuat",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Tug_module",
  "/wiki/Lancer-class_frigate/Legends",
  "/wiki/Zebulon-B_frigate",
  "/wiki/Hard_Merchandise"
 ]
}