{
 "name": "Otto",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "63 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown",
      "later white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army",
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Otto was a Human male from the planet of Coruscant who served in the Imperial Military, the armed forces of the Galactic Empire. As a general, he took part in the Galactic Civil War, a conflict between the Empire and the Rebel Alliance. Despite his status, Otto was regarded as largely incompetent. If it had not been the intervention of his friend, Admiral Conan Antonio Motti, Otto would have lost both his career and his life at the hands of Darth Vader, the Supreme Commander of the Imperial Fleet. The general was relocated to the barren planet of Lok, where he was tasked with commanding an Imperial outpost. During his tenure on Lok, the general was forced to deal with an intruder who had been sent by the Rebel hero Han Solo to sow discord in the outpost. Dissatisfied with his situation, General Otto later deserted the Empire and entered Jabba the Hutt's demolition games with a stolen AT-ST. The general hoped he could garner enough money in the contest to fulfill his dream of buying a luxury apartment in Cloud City, a floating metropolis suspended high among the clouds of the planet Bespin.\nA male of the Human species, Otto hailed from the planet of Coruscant. He was born in 63 BBY, in the final decades of the Galactic Republic. At some point in the period that followed the establishment of the Galactic Empire by the former Supreme Chancellor Palpatine in 19 BBY, Otto embraced a career in the Imperial Military. A bumbling, insignificant man, the Coruscanti climbed the promotion ladder only thanks to his connections with Admiral Conan Antonio Motti, an Imperial Navy officer who had not hesitated to pad his own record himself. Eventually, Otto attained the rank of Army general.\nAs an Imperial general, Otto got involved in the Galactic Civil War, a galaxy-wide conflict between the Empire and a resistance group called the Rebel Alliance. Though overzealous and loyal to Galactic Emperor Palpatine to the point of fanaticism, he lost many key battles to the Rebels during the early stages of the war. He was also rumored to have been a drug addict. Otto's career may have been damaged by his major blunders had it not been for another intervention of Admiral Motti, who saved him from the wrath of Darth Vader, the Emperor's second-in-command and Supreme Commander of the Imperial Fleet. Thanks to the machinations of Motti, Otto was quietly shipped to the planet of Lok, a desolate world in the Outer Rim Territories, where he was tasked with manning a massive Imperial outpost. On the disused wasteland of Lok, Motti hoped that his embarrassing friend would maintain a low profile.\nInstead of fighting against organized crime on Lok, Otto chose to make an arrangement with its members. The general reached an understanding with Nym, the pirate leader of the Lok Revenants, promising that his activities would not be interfered with if he refrained from attacking the Imperial outpost. Despite his arrangements, Otto once faced a brutal assault on his outpost led by a notorious local mercenary warlord, but his troops were able to thwart that attack. The general also experienced trouble with his fellow members of the Empire. According to the discharged Sergeant Moore, Otto was also at odds with other Imperials on Lok who sought to keep their activities secret from the general. Those activities included a mining facility where gases and minerals were extracted, and the associated research facility, where a new type of grenade was being developed.\nAt some point following the Battle of Yavin in 0 BBY, a defunct R4-series agromech droid that had once belonged to Otto fell into the clutches of the Sulfur Lake Pirates, who maintained a hideout on Lok. The droid's memory core, however, ended up in the hands of the mercenary Vana Sage, who wanted to blackmail Otto based on its contents. Around the same time, the Rebel hero Han Solo sent one of his agents to cause mayhem in the Imperial outpost and show General Otto that being assigned on a backwater planet was not going to be easy. Otto confronted the Rebel agent that had come to torment him, but despite being a martial artist, the Imperial was beaten during the showdown. However, the general successfully escaped his opponent before being killed. Ultimately, the Rebel intruder returned to Solo to claim their reward, leaving Otto with combat injuries and hurt feelings.\nSuch bad encounters and the sad spectacle of Lok's barren landscape made Otto dwell on his dream of retiring to a luxury apartment on Cloud City, a haven of airy platforms, spires, and towers floating in the atmosphere of the gas giant Bespin. Eventually, in pursuit of that dream, Otto stole a transport and abandoned the Empire, taking an AT-ST bipedal walker with him. Wanted by Imperial forces for desertion, Otto traveled to Tatooine, a Hutt-controlled planet of the Outer Rim. Around 4 ABY, he had entered the demolition contests organized by the Hutt crime lord Jabba Desilijic Tiure, hoping to gather the riches he needed to achieve his dream. On the contest field of the Dune Sea, Otto confronted various worthy adversaries such as the bounty hunters Boba Fett and Aurra Sing, the Human smuggler named Wade Vox, the Dug Podracer Pugwis and the Wookiee engineer Quagga. The general also faced Malakili, the keeper of Jabba's rancor, as well as other accomplices of the Hutt, such as Wittin the Jawa. Unbeknownst to the general, three heroes of the Rebel Alliance had also entered the derby: the Princess of Alderaan and Rebel leader Leia Organa, disguised as the bounty hunter Boushh, the former Baron Administrator of Cloud City Lando Calrissian, posing as a guard named Tamtel Skreej, and the latter's cyborg assistant Lobot.\nWhile he was manning the Lok outpost, General Otto sported dark brown hair and a horseshoe-shaped mustache. However, by the time of Jabba's demolition derby, the general looked very different. He had gained excessive weight, his hair had gone entirely white, and he had grown a full beard with two points. As an officer, Otto was thought to lack dignity in his manners and appearance, and even the Rebel hero Han Solo thought of him as unimportant, rather than a serious threat. At the time, Otto had no compunction about turning a blind eye to Lok's criminality, and the climate between the general and the other Imperials stationed there remained unsettled.\nIn spite of his grandfatherly looks, his fancy uniform and his poor reputation, Otto was still a dangerous individual. As a derby fighter, he suffered delusions of grandeur and a misplaced sense of superiority that fueled his sense of pugnacity. He was convinced that he had become the most powerful being in the Known Universe and that nothing or no one could stop him. Among his many flaws, if rumors about him were true, the general was addicted to the mind-altering spice. In fact, Otto would sometimes threaten his defeated opponents with a transfer to the Spice Mines of Kessel. Despite being a deserter and a self-obsessed man, General Otto maintained a certain degree of loyalty toward the Empire and Palpatine, as he would sometimes enter the demolition contests yelling \"Long live the Emperor!\"\nAs part of his Imperial officer training, General Otto was a master of ranged combat using blaster carbines. He had also learned the rudiments of Teräs Käsi, a weaponless martial art. He was also capable of piloting his modified AT-ST all by himself, while manning that vehicle normally required two crewmen, a pilot, and a gunner.\nIn the Lok Imperial Outpost, Otto simply wore the Empire's standard uniform, which consisted of a double-breasted grey tunic with matching trousers, black leather belt, black boots, and a hat. On the left side of the upper chest, he sported a single Imperial code cylinder and the insignia of an army general. His cap and belt were also equipped with an officer's disc, which contained coded information. When taking part in Jabba's contests, he wore a garish version of an Imperial Army trooper dress uniform with red pants, a golden plastron, a blue cape and a wide array of medals and festoons. He also wore a fancy rank plaque made of twelve golden squares.\nGeneral Otto first appeared as a playable character in Star Wars: Demolition, a vehicular combat video game featuring characters, locations and vehicles from around the Star Wars universe. Voice actor Tom Kane voiced Otto in that game, along with Bib Fortuna, Boba Fett and Lobot.\nIn Star Wars: Demolition, depending on the player's success, Otto could either win the tournament, which led him to fulfill his dream, or lose it, which had him turned over to a pair of Imperial stormtroopers by one of his fellow contestants, Boba Fett, and ultimately left at Darth Vader's mercy. Otto's AT-ST walker was the first vehicle created for the game. It was also a favorite of the graphician Edvard Toth, who modeled some and textured all vehicles in Star Wars: Demolition.\nThe general also appeared in the now-defunct MMORPG Star Wars Galaxies. Originally, Otto in Star Wars Galaxies did not appear like he did in Star Wars: Demolition. However, the events depicted in Galaxies occurred between 0 and 3 ABY, a few years at best before Jabba's demolition games. Otto's appearance in Galaxies was later changed by the developers so he would wear a mustache, but he still looked younger, taller, and thinner than his Demolition incarnation. In the 2000 video game, Otto was shown to be overweight and a head shorter than two stormtroopers, while his Galaxies incarnation was of average height with a smaller waistline.\nIn Star Wars Galaxies, Rebel players could be tasked by Han Solo with fighting and killing Otto. In actuality, the general would not die. Once the player got his health to 10%, Otto would yell \"Aaaah! Get away from me!!\" and run away by despawning.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/63_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Planet/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/General/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Conan_Antonio_Motti/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Imperial_Outpost_(Lok)",
  "/wiki/Han_Solo/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Jabba%27s_demolition_games",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/City/Legends",
  "/wiki/Cloud/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Species/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscanti/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/File:GeneralOttoSWG.jpg",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Unidentified_mercenary_warlord",
  "/wiki/Mercenary/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Moore",
  "/wiki/Mining/Legends",
  "/wiki/Imperial_mining_facility",
  "/wiki/Mineral/Legends",
  "/wiki/Imperial_Research_Facility_(Lok)",
  "/wiki/Imperial_Military_Grenade_Casing_Unit",
  "/wiki/Grenade/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/R4-series_agromech_droid",
  "/wiki/Agromech_droid",
  "/wiki/Sulfur_Lake_Pirates",
  "/wiki/Sulfur_Lake_Pirates_Hideout",
  "/wiki/Droid/Legends",
  "/wiki/Memory_core",
  "/wiki/Vana_Sage",
  "/wiki/Martial_artist",
  "/wiki/File:Ottos_walker.png",
  "/wiki/Atmosphere/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Wade_Vox",
  "/wiki/Dug/Legends",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Pugwis",
  "/wiki/Wookiee/Legends",
  "/wiki/Quagga",
  "/wiki/Malakili/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Wittin/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Boushh/Legends",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Tamtel_Skreej/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Lobot/Legends",
  "/wiki/File:Otto.png",
  "/wiki/Hair/Legends",
  "/wiki/Uniform",
  "/wiki/Known_Universe",
  "/wiki/Spice/Legends",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/Kessel/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Ter%C3%A4s_K%C3%A4si/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Vehicle_Command_Crewer",
  "/wiki/Gunner/Legends",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Leather/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Hat/Legends",
  "/wiki/Imperial_code_cylinder",
  "/wiki/Rank_insignia_plaque/Legends",
  "/wiki/Imperial_officer%27s_disc",
  "/wiki/Imperial_Army_trooper/Legends",
  "/wiki/Gold/Legends",
  "/wiki/File:GeneralOtto.jpg",
  "/wiki/Star_Wars:_Demolition",
  "/wiki/Video_game",
  "/wiki/Star_Wars",
  "/wiki/Tom_Kane",
  "/wiki/Bib_Fortuna/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Edvard_Toth",
  "/wiki/3_ABY/Legends",
  "/wiki/StarWars.com",
  "/wiki/Demolition:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Star_Wars_Galaxies",
  "/wiki/Star_Wars_Insider_65",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Galactic_Hunters",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Official_Star_Wars_Fact_File_91",
  "/wiki/Template:SWGTCG",
  "/wiki/Star_Wars:_Complete_Locations_(2005)",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/December_6",
  "/wiki/2017",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/0_ABY/Legends"
 ]
}