{
 "name": "Otua Blank",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Quarzite"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Belugan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Grey"
     ]
    }
   ]
  }
 ],
 "content": "Lord Otua Blank was a Belugan male dictator who ruled the planet Quarzite during the year 20 BBY. Lord Blank's regime was tied down with an internal conflict on Quarzite between the Belugan populace and the planet's other native species, the Kage. Blank lusted over the Kage female Pluma Sodi, and in a bid to make her his unwilling bride, Belugan troopers kidnapped Sodi. The young Kage was stored in a box and was set to be delivered to Blank's stronghold via subtram under the supervision of Major Rigosso. Fearing a Kage rescue mission, Blank and Rigosso sought out a team of six bounty hunters to thwart it. The bid failed, however, and Blank was deprived of his bride.\nDuring the year 20 BBY, the planet Quarzite was ruled by the Belugan dictator Lord Otua Blank. Engaged in a conflict with Quarzite's other native population, the Kage, Blank found his subtrams constantly under attack by Kage Warriors. Although Blank's troops were considered elite, they proved ineffective against the Kage.\nAt some point, Blank became infatuated with a young Kage female named Pluma Sodi. Blank desired Sodi to be his bride, and had her kidnapped by his soldiers. Set to be delivered on a subtram under the supervision of Blank's military officer Major Rigosso, Blank feared the possibility of a Kage rescue mission, and as such hired six bounty hunters to escort the subtram and keep Sodi safe from her people. The job was eventually accepted by a team of hunters led by Boba Fett.\nHowever, almost as soon as the subtram departed for Lord Blank's stronghold, it was set upon by Kage Warriors led by Sodi's brother, Krismo. The majority of the bounty hunters were thrown from the tram and Rigosso was killed. After the bounty hunter Asajj Ventress had a change of heart regarding the mission objective, she freed Sodi. Upon arriving to Blank's stronghold, Ventress, under the guise of still having Sodi locked in a crate, accepted Blank's payment of 600,000 unmarked credits and left. When Blank opened the chest, he found a bound and gagged Fett instead of a young Kage girl, much to his displeasure.\nLoathsome and indulgent were both words used to describe Otua Blank at some point or another. Despite this, his followers, such as Rigosso, were staunchly loyal to Blank. When presented with what Blank thought to be Pluma Sodi, Blank eagerly rubbed his hands together and drooled over the prospect of meeting Sodi. However, he paid Ventress for the mission before he could actually verify that Sodi was locked away in the box Ventress presented. When confronted with a bound Boba Fett, Blank could only act surprised.\nBlank was a large, fat Belugan with gray-colored skin, with the skin flaps on his face being blue. Blank also had white eyes with black irises.\nOtua Blank was created for the animated series Star Wars: The Clone Wars and appeared in the fourth season episode \"Bounty.\" Blank was voiced by Ben Diskin, who also voiced Blank's nemesis Krismo Sodi in the episode.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Otua_Blank",
  "/wiki/Otua_Blank/Legends",
  "/wiki/Quarzite",
  "/wiki/Belugan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Lord",
  "/wiki/Politics#Dictatorship",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/20_BBY",
  "/wiki/Species",
  "/wiki/Kage",
  "/wiki/Pluma_Sodi",
  "/wiki/Marriage",
  "/wiki/Trooper",
  "/wiki/Safe_cargo_objective",
  "/wiki/Otua_Blank%27s_stronghold",
  "/wiki/Subtram",
  "/wiki/Major",
  "/wiki/Rigosso",
  "/wiki/Bounty_hunter",
  "/wiki/Kage_Warriors",
  "/wiki/Troop",
  "/wiki/Soldier",
  "/wiki/Officer",
  "/wiki/Krayt%27s_Claw",
  "/wiki/Boba_Fett",
  "/wiki/Krismo_Sodi",
  "/wiki/Death",
  "/wiki/Asajj_Ventress",
  "/wiki/Credit",
  "/wiki/Eye",
  "/wiki/Darren_Marshall",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Bounty_(episode)",
  "/wiki/Ben_Diskin",
  "/wiki/The_Lost_Nightsister",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_66",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Massacre",
  "/wiki/Brothers"
 ]
}