{
 "name": "Ovus Buckell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nihil"
     ]
    }
   ]
  }
 ],
 "content": "Ovus Buckell was a human male who lived in Coronet City on the planet Corellia during the High Republic Era. He held the position of Finance Minister. Around 230 BBY, Buckell had desires to become Corellia's leader and worked with the Nihil Respriler to achieve this. Buckell requested the Nihil occasionally launch small attacks on Corellia that could be fought off easily in an attempt to rally the Corellians to have the planet closed off to outsiders. During one attack, Respriler had the city's current Father of Finances, Nomar Tralmat, disappeared and apparently murdered. Buckell was unaware, however, that Tralmat and Respriler were in fact the same person. Buckell was chosen to replace Tralmat as the Father of Finances, and he also took over Coronet's municipal police which he used to gain supremacy in the city. Buckell's bid for power was thwarted when Respriler revealed himself to be Tralmat and attempted to assassinate Buckell for not agreeing with his vision. Buckell was saved by the bodyguard Dizcaro, who sacrificed himself for the Father of Finances and was killed. After the attempt, Ovus was taken by one of Dizcaro's employees, the Lasat Powlo, to safety.\nSometime later, after the Nihil forces on Corellia were defeated, Buckell again made a move to consolidate power on Corellia. Alys Ongwa noted that Buckell had a chance of pulling it off and informed the Jedi Padawans Reath Silas and Ram Jomaram that she intended to stop him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nihil",
  "/wiki/Coronet_City",
  "/wiki/Planet",
  "/wiki/High_Republic_Era",
  "/wiki/Finance_Minister_(Coronet_City)",
  "/wiki/230_BBY",
  "/wiki/Nomar_Tralmat",
  "/wiki/City",
  "/wiki/Father_of_Finances",
  "/wiki/Death",
  "/wiki/Bodyguard",
  "/wiki/Dizcaro",
  "/wiki/Lasat",
  "/wiki/Powlo",
  "/wiki/Battle_on_Corellia",
  "/wiki/Alys_Ongwa",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Reath_Silas",
  "/wiki/Ram_Jomaram",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ovus_Buckell",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/StarWars.com"
 ]
}