{
 "name": "Owen_Lars",
 "display_name": "Owen Lars",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lars family",
      "White Suns"
     ]
    }
   ]
  }
 ],
 "content": "Owen Lars was a human male from the desert planet Tatooine who worked as a moisture farmer. He was the son of Aika and Cliegg Lars, and he became the stepbrother of Jedi Knight Anakin Skywalker when Cliegg married Anakin's mother, Shmi Skywalker. In 22 BBY, Shmi was killed by Tusken Raiders, and Cliegg passed away soon after. Lars married his girlfriend, Beru Whitesun, and they toiled to maintain the homestead.\nIn 19 BBY, Lars and his wife were contacted by Skywalker's Jedi Master, Obi-Wan Kenobi, and they were tasked with caring for Skywalker's infant son, Luke. Lars believed that Skywalker had died due to his role as a Jedi, so to protect Luke, the farmer forbade Kenobi from visiting or training the boy. In the following years, Lars prevented Luke from knowing the truth about his father, and he kept the boy busy with farm work.\nIn 0 BBY, Lars and Luke Skywalker purchased the droid R2-D2, who, unbeknownst to them, possessed stolen plans for the Death Star, an Imperial superweapon. Imperial stormtroopers tracked the droid to Lars' homestead, where they interrogated and murdered both him and his wife. When Skywalker discovered that his family had been killed, he left Tatooine with Kenobi to train as a Jedi, joining the Rebel Alliance and destroying the Death Star in the Battle of Yavin.\nOwen Lars was a human male born to the moisture farmer Cliegg Lars and his wife, Aika, after they met on a bustling Core World. When Aika died, the father and son traveled to Cliegg's homeworld, the desert planet of Tatooine, where they lived on the Lars family's homestead near the township of Anchorhead. As a young man, Lars had a strong vision of who he wanted to become, believing that he should be rooted on Tatooine and focused on improving the homestead. During or after the year 32 BBY, Cliegg went to Mos Espa in search of a new farmhand, and he met Shmi Skywalker, a slave owned by the Toydarian junk dealer Watto. Cliegg fell in love with Shmi, so he purchased her, set her free, and married her. Lars loved his stepmother very much, but he saw her sadness whenever she thought of her son, Anakin Skywalker, who had left Tatooine to join the Jedi Order on Coruscant. Seeing his mother's sadness made Lars wonder how anyone could have left her behind. In the following years, the family lived quietly, and at some point, during a trip to Anchorhead, Lars met a local girl named Beru Whitesun, a third-generation moisture farmer. The two fell in love and began dating.\nThough Lars planned for a comfortable future on his family homestead, the peace was broken by 22 BBY, when one morning, Shmi was attacked and abducted by Tusken Raiders. Furious, Lars' father rallied 29 other moisture farmers to help search for her. When the group returned, there were only four survivors, including Cliegg, who had lost a leg and was confined to a repulsorlift chair. As time passed, Lars and his father had little hope for Shmi's survival. A month later, Anakin Skywalker returned to Tatooine after a ten year absence to look for his mother. He found that she had been sold to Cliegg, so he, along with Senator Padmé Amidala, visited the homestead. Lars introduced himself and Whitesun to the visitors, and when Skywalker asked about Shmi, Cliegg introduced himself, inviting the Jedi inside to talk. Cliegg told the Jedi about Shmi's kidnapping, telling the Jedi that she was dead. Refusing to believe his stepfather, Skywalker borrowed Lars' swoop and tracked the Tusken Raiders.\nThe next day, Skywalker returned with Shmi's corpse. The Lars family buried Shmi outside their home and held a quiet funeral. Following the funeral, Skywalker and Amidala left, and Lars never saw them again. However, seeing how well Owen and Whitesun worked together convinced Skywalker to marry Amidala. After the wedding, although he was unsure if he wanted to go down the road of reaching out to his stepbrother, he also realized that Owen was the only person in his life whom he could ask for advice about married life. Meanwhile, Lars' father was determined to continue the life he worked hard to create, but the tragedy weakened Cliegg, and he died soon after of a broken heart, leaving his farm and traditions to Lars. Soon after, Lars and Whitesun married, and together they toiled to maintain the farm. Owen and Beru decided to have a child, but problems of infertility precluded them to have one, leading them to consider seeing one of the fertility droids at Mos Eisley.\nIn 19 BBY, Lars and his wife were contacted by Obi-Wan Kenobi, the Jedi Master who had trained Skywalker, and he tasked the couple with protecting Skywalker's infant son, Luke. Although Lars was initially reluctant, Beru convinced him to adopt the child. When Kenobi arrived at the moisture farm, he presented Lars and Beru with the infant Skywalker, and the couple held their newly adopted child as they watched the binary sunset of Tatooine. Lars came to believe that his stepbrother had died and that Kenobi was responsible. However, in secret, Lars' stepbrother was alive, having turned to the dark side of the Force, betraying the Jedi Order and becoming the Sith Lord Darth Vader. After delivering the child, Kenobi went into exile, changing his name to \"Ben\" and keeping watch over the young Skywalker. In an effort to protect Luke, Lars forbade Kenobi from training the boy and from visiting.\nWhen Skywalker was seven years old, Lars found him alone, planning to watch a meteor shower. Fearing that his nephew could have been attacked by Tusken Raiders, Lars scolded him and then argued with Beru, stating he would keep the boy occupied with more chores. The following morning, Lars told Skywalker that he could not protect him all the time, and that he would teach him the safety basics of the farm. Then, to Beru and Skywalker's surprise, Lars revealed he planned to show him how to use a blaster rifle. Although Beru felt Skywalker was too young, Lars went forward with his plan to teach his excited nephew.\nWhile Skywalker was still a boy, Tatooine was plagued by the Great Drought, which halted water collection for moisture farmers. During the drought, Jabba Desilijic Tiure, the Hutt crime lord of Tatooine, declared a water tax, and he had his enforcers take the farmers' harvests, sometimes by force. However, unknown to Lars, Kenobi was protecting the Lars homestead from Jabba's thugs, so the family was never forced to pay. Still, the drought continued to worsen, and one night, Skywalker left the moisture farm to steal water from the Hutt's thugs. When Lars and Beru realized that Skywalker was missing, they searched for the boy, but they were unable to find him. Kenobi, however, sensed that Skywalker was in danger, and the Jedi found and rescued the boy, bringing him back to the homestead. In the morning, Beru found Skywalker, and called for her husband. Lars rushed to Skywalker's side, asking if he was all right. Skywalker, was unharmed, but he was unable to recall any of the previous night's events. About a week later, the drought lifted, and the moisture vaporators began collecting water again.\nA year after the Great Drought's end, Skywalker took interest in piloting his family's T-16 skyhopper, and during one adventurous flight, Skywalker became overconfident in his abilities, wrecking the skyhopper in Beggar's Canyon. Lars grounded Skywalker, enraged that they were short a speeder and could not afford repairs. When Skywalker suggested entering a race at Anchorhead and using prize money, Lars rejected the idea, telling Skywalker that he would never fly again. In the following days, Lars and Skywalker went to a market to purchase an astromech droid and a droid capable of speaking Bocce. While Lars was looking at droids, Skywalker was approached by two Jawas, who handed him a box filled with the parts needed to repair the skyhopper. Skywalker believed it was a gift from his uncle, and the boy thanked him and rushed off; in actuality, the parts were from Kenobi, who believed that Skywalker needed more practice piloting. However, Lars immediately realized that Kenobi had interfered, also recalling the unusual absence of Tusken Raiders and Hutt thugs at the homestead. Furious, Lars visited Kenobi's home, bringing the skyhopper parts with him. Reasserting that he did not want Kenobi's help, Lars told the hermit to leave Skywalker alone, saying it was his own job to protect Skywalker, and that the Jedi was whom Skywalker needed protection from.\nSoon after, Lars purchased skyhoppper parts at Tosche Station, hoping to fix the speeder with Skywalker and amend their strained relationship. However, when Lars returned home, the farmer was attacked by Krrsantan, a Wookiee bounty hunter searching for the man who had defied Jabba's tax collectors the year before. Krrsantan took Lars to a clifftop near the Dune Sea, where the Wookiee cuffed and beat the farmer with an electric baton, hoping to elicit a scream. Lars begged Krrsantan to stop, saying that he could not understand the Wookiee's language and was unable to answer his questions. The bounty hunter continued to attack until Kenobi appeared atop the cliff, revealing himself to be the man marked for bounty. Krrsantan immediately attacked Kenobi, quickly snaring the Jedi in a stun net. While Krrsantan's back was turned, Lars charged, but the Wookiee knocked him back, sending the farmer over the cliff edge. Lars caught himself on a protrusion from the cliff, hanging on as Kenobi summoned his lightsaber, cutting the net and reengaging the Wookiee. Kenobi knocked the Wookiee over with the Force and turned his attention to rescuing Lars.\nHowever, Krrsantan quickly stood back up, grabbing a boulder and preparing to kill his target. Kenobi sliced the boulder in half, but one chunk fell and broke the rock which had been supporting Lars. The farmer began to fall, but he was saved by Kenobi, who held him through the Force. Kenobi struggled to concentrate on holding Lars and fending off the Wookiee, and the Jedi lost his grip on the farmer, who began to plummet toward the ground. As Lars fell, however, Skywalker who had repaired the skyhopper and went in search of his captured uncle—arrived, catching him on one of the skyhopper's cannons. Skywalker landed the skyhopper and apologized, and Lars embraced his nephew, looking up to see Kenobi standing victorious on the clifftop. After the event, Lars and Kenobi never spoke, and they both returned to their homes.\n\nIn 9 BBY, Lars and Skywalker were carrying out work at the homestead when they were observed from a distance by Kenobi, who left some spare parts for a toy T-16 skyhopper for Luke. Lars later confronted Kenobi in a stable in Anchorhead, tossing the toy parts on the ground and asking the Jedi to stay away from his family. When Kenobi reminded Lars that Skywalker must be trained when he grows up, the farmer reminded him of his failure to train Anakin Skywalker. As Lars left the stable, Inquisitors Fifth Brother and Third Sister—hunting a supposed fugitive Jedi residing on Tatooine—arrived at the town square, with Lars caught in the ordeal.\nAfter amputating the hand of an insubordinate woman with her lightsaber, the Third Sister approached Lars, questioning him about his family and threatening to kill them unless someone in the town square provided information on the fugitive Jedi. As she held Lars at lightsaber-point, the Fifth Brother interfered and ordered the Third Sister to stand down. Afterward, Kenobi thanked Lars for not revealing anything about him or his whereabouts, with Lars retorting that it was not for him.\nLater, Owen and Luke visited a mechanic at Mos Eisley in order to obtain a new belt for their landspeeder. During the course of their visit, the shop owner assumed that Luke's uncle was a patient man, to which Owen emphasised that he was not patient. Just then, Dardin Shull approached Owen and informed him that the Third Sister had inquired about Owen's whereabouts, as she was on the hunt to kill Luke. Horrified, Owen rushed back to the homestead, where he urged Beru to come inside. Once Owen had told Beru about the situation, he started to fret that they had to run, hide, and find help. However, to Owen's surprise, Beru retorted that the two of them were enough, then handed Owen a blaster. That night, as the Third Sister approached the homestead, Owen warned Luke that if anything went wrong, he needed to run from the Tusken Raiders, who Owen told Luke were on the attack. Reva soon entered the homestead, and Owen and Beru opened fire on the Inquisitor. She then faced Owen, who attacked her with a metal stick. The Third Sister pointed out that Owen loved Luke like he was his own, to which Owen pointed out that Luke was his own. The Third Sister eventually managed to defeat Owen, who called out to Beru that the Inquisitor was coming, prompting her to distract Reva long enough for Luke to escape. In the course of the skirmish, Kenobi returned to the homestead, where he found Owen and Beru frantically searching for their nephew. Soon enough, the Third Sister appeared and returned Luke to his aunt and uncle, having shown the boy mercy.\nThe next day, as Owen worked at the homestead, Kenobi approached. Owen asked Kenobi was doing, as he had promised to keep his distance, and Kenobi replied that he had accept that Luke should be allowed to grow up as a normal boy instead of being trained as a Jedi. He went on to say that the only protectors Luke needed were Owen and Beru, and Owen said he would care of the boy. Kenobi then started to ride off into the desert, but Owen called out if Kenobi wanted to meet Luke. Kenobi accepted Owen's offer, then continued on his journey in the desert.\nYears later, when Skywalker was twelve years old, Beru compared Skywalker to his father after Lars noted he was proud of his nephew's hard work. Refusing to discuss Anakin any further, Lars told Beru that his nephew was like a son to him. Not wanting Skywalker to experience war in his lifetime, he admitted he would not let him join the Imperial Academy. Later that day, Skywalker and his friend Windy got lost in a sandstorm and encountered a krayt dragon. The two boys were saved by Kenobi, who took them back home. Lars thanked Kenobi for bringing Skywalker back safely, but again told the Jedi to stay away from the boy. In return, Kenobi revealed he had been observing Skywalker, informing Lars that the Force was strong in him and that he would leave the farm one day. Lars responded by saying that the Jedi went extinct with the Galactic Republic, warning Kenobi to never visit the homestead again.\nIn 0 BBY, a company of Jawas came by the homestead to sell miscellaneous droids. Lars, requiring an astromech droid and a droid capable of programming moisture vaporators, settled on purchasing the astromech droid R5-D4 and the protocol droid C-3PO, respectively. With the droids selected, Lars told Skywalker to clean them, despite the boy's plans of going to Tosche Station with his friends. However, Skywalker discovered that the R5 unit had a bad motivator, and he informed his uncle. At the suggestion of C-3PO, Lars bought the astromech droid R2-D2 in place of R5-D4.\nLater, while Skywalker was cleaning R2-D2, he discovered a holographic message for \"Obi-Wan Kenobi.\" Wondering if the droid was referring to Ben Kenobi, Skywalker asked his uncle during dinner. Lars replied that Kenobi was just a crazy old wizard, telling Skywalker to take the droid to Anchorhead and have its memory erased. When Skywalker asked about the possibility of \"Obi-Wan\" coming to look for the droid, Lars denied the thought, telling Skywalker that the man had died around the same time as his father. The mention of his father piqued Skywalker's interest, and he asked if the man had known his father. Lars told Skywalker to forget it, telling his nephew to take care of the droids by morning. Thinking the droids would provide extra help on the farm, Skywalker, who desired to enroll in the Imperial Academy like his friends, asked Lars if he could join that year. Fearing that Skywalker was too much like his father, Lars denied his nephew's wish, stating that his help was still needed and that he could enroll in the following year. Disappointed, Skywalker left, leaving Lars and Beru to discuss if and when to let him join.\nWhen the morning came, Lars could not find his nephew, so he asked his wife if she knew where he was. Beru believed that Skywalker was doing chores, but in actuality, Skywalker was searching for R2-D2, who had run off in search of Kenobi. Unknown to Lars, R2-D2 was carrying stolen plans of the Death Star, the Galactic Empire's recently completed superweapon capable of destroying entire planets. Imperial stormtroopers, desperate to reclaim the data, traced the droid to the Lars homestead, where they proceeded to interrogate Lars and Beru. Failing to acquire the plans, the stormtroopers killed the couple, burning the home and leaving. When Skywalker returned, finding his family murdered and home in ruins, he decided to leave Tatooine with Kenobi and train to become a Jedi Knight like his father. The pair traveled to the Mos Eisley spaceport, where they met Han Solo, a smuggler who agreed to take them to the planet Alderaan aboard the Millennium Falcon.\nThe deaths of Lars and Beru prompted Skywalker to leave Tatooine with Kenobi and join the Alliance to Restore the Republic. Upon joining the Rebels, Skywalker fought in the Battle of Yavin, destroying the Death Star and becoming a Rebellion hero. Even beyond the realm of the living, Owen's wife Beru speculated that perhaps if Owen had allowed Luke to leave Tatooine sooner they could be still alive, but she ended up resting comfortably acknowledging what heroic actions Luke made after their deaths. Despite the recent loss of his family, Skywalker did not grieve until soon after the battle, when his love interest, Nakari Kelen, was killed on the planet Omereth. Kelen's death provided Skywalker a moment to consider his losses, and he wept upon thinking of his aunt and uncle.\nSkywalker later returned to Tatooine to recover Kenobi's journal, which contained stories of the Jedi's few encounters with the Lars family. In the weeks after the Battle of Yavin, Darth Vader searched for the pilot responsible for destroying the Death Star, discovering that the pilot was the son he never knew he had. Vader, accompanied by Doctor Chelli Lona Aphra, revisited the abandoned homestead and followed Skywalker's trail. While assessing the destruction, Aphra speculated that Skywalker might have never left Tatooine, had his family been spared.\nAs Luke never liked Lars' moisture farm and didn't want to become a farmer, he eventually became a Jedi Knight like his father before him and eventually a Jedi Master following the end of the Galactic Empire. However, after the destruction of his Jedi students at the hands of his nephew Ben Solo, Luke went into exile and temporarily became a farmer on the legendary planet of Ahch-To. In 34 ABY, before the Force-sensitive scavenger Rey's coming to Ahch-To, Skywalker had a dream about an alternate life where he ignored Organa's message and never joined the rebellion, remaining in the moisture farming business with Owen and getting married to his friend Camie Marstrap. In his dream, Skywalker, afraid of Owen's fury, retrieved C-3PO and R2-D2 earlier than he had. Owen also was taken by the stormtroopers to be interrogated, but released three days later, though remained silent and pale during the long ride back from Mos Eisley.\nLars was a male human with light skin and blue eyes, and he stood at a height of 1.7 meters . He had dark brown hair in his youth, and it turned gray with age. As his stepmother Shmi Skywalker recounted, the young Lars was a pragmatic and strong worker, who was also thankful for life's simple delights. The son of Cliegg, Lars was raised in the traditions of discipline and hard work, and taught this to his nephew. Lars was gruff and strict with the boy. As soon as Luke was able to hold a hydrospanner, he put him to work, and his nephew began to learn to fix vaporators, clean garden filters, and keep machinery working far past its prime from an early age. There was often tension between Lars and Skywalker, which forced Beru to mediate. Due to his Uncle's impatience, Skywalker could be fearful of his fury and reactions, something which he even dreamed about during his exile. Despite having a complicated relationship with his nephew, and initially reluctant to take him in, he still grew to care for him in his own gruff way. When the Third Sister attacked the Lars moisture farm, she noted that Lars loved Luke, like he was his own; Lars replied that Luke was his own.\nFeeling great disdain towards the Jedi Order, Lars believed that Kenobi had warped Anakin's mind into leaving Shmi on Tatooine, an act he considered to be unimaginable. Lars also held Kenobi responsible for the deaths of Shmi and Anakin , believing that the Jedi's actions had torn the family apart. When Kenobi left Skywalker under Lars' reluctant protection, the farmer told the Jedi to stay away from them, fearing that Kenobi would create similar consequences with the boy. Despite his feelings about Kenobi, Lars helped him fight the Wookiee Krrsantan, which the Jedi viewed as an act of bravery, and Lars allowed Kenobi to meet with Skywalker when he allowed his nephew to grow like a normal child. To keep Skywalker out of trouble, Lars kept his nephew's Jedi lineage a secret, claiming that Skywalker's father was simply a navigator on a spice freighter. When Luke desired to leave Tatooine, Lars found it difficult to ignore his gruff, protective attitude, which had become a habit over the years.\nKenobi believed Lars was a proud man, so he feared the farmer would rather fight than pay the protection money Jabba the Hutt demanded. The Jedi Master thought this would be a foolish choice, especially after he promised to raise Luke, though he also realized Lars was smart enough to know when to fight his battles. Lars was not much given to expressing affection in words, but often did small things for Beru, surprising kindnesses that would cause her to smile and her eyes to light up.\nLars spoke Galactic Basic Standard. However, he didn't know how to speak Shyriiwook, the language of the Wookiees, something which nearly costed him his live at the hands of Black Krrsantan, if not for Obi-Wan Kenobi's lucky intervention.\nIn his youth, Lars owned a red swoop bike, which Anakin used while searching for Shmi. Later in life, Lars acquired an inexpensive V-35 Courier, and he allowed Skywalker to pilot a T-16 skyhopper and an old, battered X-34 landspeeder in which he kept a blaster rifle. In his work, Lars used an SX-14 Field Hover-Ute, and he constantly maintained numerous GX-8 Moisture Vaporators throughout the farm. To conserve power and solar radiation, Lars would shut the farm down each night, only leaving on perimeter sensors to warn him of approaching Tusken Raiders or dangerous fauna. To assist in Lars' work, he owned an R5 astromech droid, a WED 15 \"Septoid 2\" Treadwell toolkit droid, and a centuries-old EG-6 power droid among others, which were destroyed when the Galactic Empire razed the home. Lars dressed in rough clothing made in Anchorhead, also wearing a tool pouch and a simple overcoat to provide warmth on cold desert evenings.\nOwen Lars first appeared in the 1977 film Star Wars: Episode IV A New Hope, which was written and directed by George Lucas. In A New Hope, Lars was portrayed by Phil Brown and credited as \"Uncle Owen\". Historically, Lars was first mentioned in the rough draft of A New Hope, in which he and Beru were anthropologists working on Yavin. In the film's second draft, titled Adventures of the Starkiller, Episode I: The Star Wars, Lars and Beru were rewritten to be the guardians of twins Biggs and Windy Starkiller, and it was in this draft that Lars and Beru became the uncle and aunt of Luke Skywalker. In the second draft, Lars was also a Jedi, and it was not until the third draft, The Star Wars: From The Adventures of Luke Starkiller, that Lars became a farmer. Lars' origins as an anthropologist were a self-reference by Lucas, who had intended to study anthropology at San Francisco State University before he switched to cinematography. Later, the screenplay for Star Wars: Episode VI Return of the Jedi also revealed that Lars and Ben Kenobi were brothers, although the idea was removed from the script's final cut.\nIn 2002, a younger Lars, portrayed by Joel Edgerton, appeared in the film Star Wars: Episode II Attack of the Clones, the second installment of the Star Wars prequel trilogy. Lucas casted Edgerton as Owen for the film. Canonically, Attack of the Clones is the first time Lars' name is mentioned in full. In 2005, Edgerton returned to the role for Star Wars: Episode III Revenge of the Sith, the prequel trilogy's conclusion,. Other than Brown and Edgerton, Lars has been portrayed by Charles Howerton, who voiced the character in the young readers book Episode IV: A New Hope Read-Along Storybook and CD, and Michael Donovan, who voiced Lars in \"Mission to Mos Eisley,\" an episode of the non-canon television show LEGO Star Wars: Droid Tales.\nWhile shooting Episode II in Tunisia, Edgerton filmed a scene for Episode III in which he is delivered the infant Luke by Obi-Wan, played by a stand-in actor rather than Ewan McGregor, as Lucas didn't desire to return to Tunisia for that single shot years later. However, the scene was changed during the Episode III shoot in September 2003, where McGregor playing Kenobi was filmed handing baby Luke to Bonnie Maree Piesse playing Beru, this time with Owen being played by a stand-in as Lucas \"felt it would be better if Luke were handed over to a woman\". Edgerton still appears in the scene, thanks to a specially-filmed chroma key shot that was added in post-production.\nIn 2014, Edgerton expressed enthusiasm in reprising the role for a rumored Obi-Wan Kenobi Anthology film. In 2017, Edgerton still wanted to reprise his role in the film and suggested that \"he could go out and have some adventure and then he comes back and slips back into that unassuming moisture farmer role.\" On March 29, 2021, Lucasfilm Ltd. confirmed Edgerton was a cast member of the live-action Disney+ television series Obi-Wan Kenobi. Director Deborah Chow was very excited to bring Edgerton and Piesse back to play Owen and Beru Lars, respectively, and she said their return was part of what made the series special. Edgerton relished the opportunity to reprise his role in the Star Wars franchise.\nIn 2015, a Korean webcomic by Hong Jac Ga simply titled Star Wars adapted the original trilogy, beginning with the events leading into A New Hope. The comic features Lars in its first four chapters: \"An Old Friend,\" \"Meeting the Droids,\" \"Beginning of an Adventure,\" and \"Only Hope.\" Chapters one and two involve an original story set during Skywalker's childhood, beginning in 12 BBY and jumping forward to 6 BBY. The third, fourth chapters adapt early scenes from A New Hope. Due to cultural leeway, the comic is canonically in a \"grey area,\" but it is recounted in this article. Star Wars: The Complete Visual Dictionary, New Edition later retconned part of the comic to occur in 7 BBY instead of 6 BBY.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Owen_Lars",
  "/wiki/Owen_Lars/Legends",
  "/wiki/Lars_(disambiguation)",
  "/wiki/Queen%27s_Hope",
  "/wiki/Part_VI",
  "/wiki/Obi-Wan_3",
  "/wiki/Time_of_Death",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Tatooine",
  "/wiki/0_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Lars_family",
  "/wiki/White_Suns",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Moisture_farmer",
  "/wiki/Aika_Lars",
  "/wiki/Cliegg_Lars",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Marriage",
  "/wiki/Shmi_Skywalker_Lars",
  "/wiki/22_BBY",
  "/wiki/Death",
  "/wiki/Tusken_Raider",
  "/wiki/Beru_Whitesun_Lars",
  "/wiki/Lars_Homestead",
  "/wiki/19_BBY",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi",
  "/wiki/Farmer",
  "/wiki/Jedi_training",
  "/wiki/Standard_year",
  "/wiki/Farm",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Galactic_Empire",
  "/wiki/Superweapon",
  "/wiki/Stormtrooper",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Yavin",
  "/wiki/Core_Worlds",
  "/wiki/Parent",
  "/wiki/Homeworld",
  "/wiki/City",
  "/wiki/Anchorhead",
  "/wiki/32_BBY",
  "/wiki/Mos_Espa",
  "/wiki/Slavery",
  "/wiki/Toydarian",
  "/wiki/Watto",
  "/wiki/Jedi_Order",
  "/wiki/Coruscant",
  "/wiki/Limb",
  "/wiki/Repulsorlift_chair",
  "/wiki/Time",
  "/wiki/Standard_month",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Swoop",
  "/wiki/Standard_day",
  "/wiki/Wedding_of_Anakin_Skywalker_and_Padm%C3%A9_Amidala",
  "/wiki/Fertility_droid",
  "/wiki/Mos_Eisley",
  "/wiki/Binary_star",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Meteor_shower",
  "/wiki/Blaster",
  "/wiki/Great_Drought",
  "/wiki/Water",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Water_tax",
  "/wiki/Standard_week",
  "/wiki/Moisture_vaporator",
  "/wiki/Pilot",
  "/wiki/T-16_skyhopper",
  "/wiki/Beggar%27s_Canyon",
  "/wiki/Astromech_droid",
  "/wiki/Bocce",
  "/wiki/Jawa",
  "/wiki/Ben_Kenobi%27s_home",
  "/wiki/Tosche_Station",
  "/wiki/Krrsantan",
  "/wiki/Wookiee",
  "/wiki/Bounty_hunter",
  "/wiki/Dune_Sea",
  "/wiki/Stuncuffs",
  "/wiki/Shyriiwook",
  "/wiki/Bounty",
  "/wiki/Stun_net",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/The_Force",
  "/wiki/Cannon",
  "/wiki/9_BBY",
  "/wiki/Luke_Skywalker%27s_toy_T-16_skyhopper",
  "/wiki/Inquisitorius",
  "/wiki/Fifth_Brother",
  "/wiki/Reva_Sevander",
  "/wiki/Reva%27s_double-bladed_Inquisitor_Lightsaber",
  "/wiki/Landspeeder",
  "/wiki/Dardin_Shull",
  "/wiki/Windy",
  "/wiki/Sandstorm",
  "/wiki/Krayt_dragon",
  "/wiki/Galactic_Republic",
  "/wiki/R5-D4",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/R5_series_astromech_droid",
  "/wiki/Motivator",
  "/wiki/Hologram",
  "/wiki/Memory_wipe",
  "/wiki/Imperial_Academy",
  "/wiki/Spaceport",
  "/wiki/Han_Solo",
  "/wiki/Smuggler",
  "/wiki/Alderaan",
  "/wiki/Millennium_Falcon",
  "/wiki/Nakari_Kelen",
  "/wiki/Omereth",
  "/wiki/The_Journals_of_Ben_Kenobi",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Battle_of_Jakku",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Jedi_Order#A_new_generation",
  "/wiki/Ben_Solo",
  "/wiki/Exile_(punishment)",
  "/wiki/Ahch-To",
  "/wiki/34_ABY",
  "/wiki/Scavenger",
  "/wiki/Rey_Skywalker",
  "/wiki/Dream",
  "/wiki/Camie_Marstrap",
  "/wiki/Eye",
  "/wiki/Foot",
  "/wiki/Hair",
  "/wiki/Navigator",
  "/wiki/Spice",
  "/wiki/Freighter",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/V-35_Courier",
  "/wiki/X-34_landspeeder",
  "/wiki/Blaster_rifle",
  "/wiki/SX-14_Field_Hover-Ute",
  "/wiki/GX-8_Moisture_Vaporator",
  "/wiki/Star",
  "/wiki/Sensor",
  "/wiki/Species",
  "/wiki/WED_15_%22Septoid_2%22_Treadwell_toolkit_droid",
  "/wiki/Standard_century/Legends",
  "/wiki/EG-6_power_droid",
  "/wiki/Clothing",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/George_Lucas",
  "/wiki/Phil_Brown",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/Yavin_4",
  "/wiki/Adventures_of_the_Starkiller,_Episode_I:_The_Star_Wars",
  "/wiki/Twin",
  "/wiki/Biggs_Darklighter",
  "/wiki/The_Star_Wars:_From_The_Adventures_of_Luke_Starkiller",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/2002",
  "/wiki/Joel_Edgerton",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Charles_Howerton",
  "/wiki/Episode_IV:_A_New_Hope_Read-Along_Storybook_and_CD",
  "/wiki/Michael_Donovan",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Tunisia",
  "/wiki/Ewan_McGregor",
  "/wiki/September",
  "/wiki/2003",
  "/wiki/Bonnie_Maree_Piesse",
  "/wiki/2014",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/2017",
  "/wiki/March_29",
  "/wiki/2021",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/2015",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Hong_Jac_Ga",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Original_trilogy",
  "/wiki/12_BBY",
  "/wiki/6_BBY",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/7_BBY",
  "/wiki/Category:Images_of_Owen_Lars",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Revenge_of_the_Sith_(Golden_Book)",
  "/wiki/Revenge_of_the_Sith_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Part_I",
  "/wiki/Part_V",
  "/wiki/Star_Wars_(2015)_7",
  "/wiki/Star_Wars_(2015)_15",
  "/wiki/Star_Wars_(2015)_20",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_A_New_Hope_Graphic_Novel_Adaptation",
  "/wiki/The_Original_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/The_Rise_of_a_Hero",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Hero%27s_Journey_Begins",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/Reirin_(short_story)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/The_Red_One",
  "/wiki/Master_and_Apprentice_(short_story)",
  "/wiki/Beru_Whitesun_Lars_(short_story)",
  "/wiki/Added_Muscle",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/Heir_to_the_Jedi_(audiobook)",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure_(audiobook)",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Doctor_Aphra_(script)",
  "/wiki/Star_Wars_(2015)_5",
  "/wiki/Darth_Vader_(2015)_7",
  "/wiki/Doctor_Aphra_(2016)_7",
  "/wiki/Star_Wars_(2015)_32",
  "/wiki/Star_Wars_(2015)_41",
  "/wiki/Star_Wars_(2015)_58",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Darth_Vader_(2020)_1",
  "/wiki/Darth_Vader_(2020)_19",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_A_New_Hope",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Insider",
  "/wiki/Classic_Moment",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/50_Greatest_Reasons_to_Love_the_Original_Trilogy",
  "/wiki/Star_Wars_Insider_154",
  "/wiki/What_is_a_Wookiee%3F_(2015)",
  "/wiki/Bantha_Tracks_(newsletter)",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Revenge_of_the_Sith:_In_Their_Own_Words",
  "/wiki/Star_Wars_Insider_157",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_100_Defining_Moments",
  "/wiki/The_Return_of_the_Jedi_Archives_of_James_Kahn,_Part_II",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/The_Art_of_Star_Wars:_The_Force_Awakens",
  "/wiki/Red_Five_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_164",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Prequels_Unseen!",
  "/wiki/Star_Wars_Insider_165",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_3",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_4",
  "/wiki/Building_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_5",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_1",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_72",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Practical",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/LEGO",
  "/wiki/LEGO_Classic_Star_Wars",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/LEGO_Star_Wars_in_100_Scenes",
  "/wiki/LEGO_Star_Wars:_Chronicles_of_the_Force",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/The_Cinema_of_George_Lucas",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Entertainment_Weekly",
  "/wiki/March_9",
  "/wiki/2022",
  "/wiki/March_11",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith",
  "/wiki/October_9",
  "/wiki/October_2",
  "/wiki/2018",
  "/wiki/June_8",
  "/wiki/March_10",
  "/wiki/May_11",
  "/wiki/Jennifer_Heddle",
  "/wiki/File:LINE_Webtoon_Tweet.png"
 ]
}