{
 "name": "Owen  (Kenobi)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Owen was the perceived brother of Jedi Master Obi-Wan Kenobi seen through a vision from the Force. In reality, Kenobi was actually seeing Owen Lars, Anakin Skywalker's stepbrother.\nWhile Obi-Wan Kenobi was born to parents on the planet Stewjon, he was identified as Force-sensitive as an infant and was quickly taken to the Coruscant Jedi Temple for training in the ways of the Force by the Jedi Order. Despite this, during his apprenticeship to Jedi Master Qui-Gon Jinn, Kenobi began having dreams of his parents and of a brother named Owen. Recounting his dreams to his master, Jinn cautioned him that dreams could sometimes be visions of the past or the future. For much of his life before the Clone Wars, Kenobi believed that he must have returned to Stewjon early on and met his parents, thus forming the memory of them and his brother.\nIt wasn't until the first few months of the Clone Wars when Kenobi learned that his Padawan, Anakin Skywalker, had met his stepbrother on Tatooine in the days before he journeyed to Geonosis. After telling Kenobi of meeting Lars and learning of the death of his mother, Shmi, Kenobi began having doubts as to the true identity of his brother Owen. It wasn't until the end of the Clone Wars and the destruction of the Order that Kenobi began connecting all of the pieces of this decades-long puzzle. As he fled persecution on Nar Shaddaa with the infant Luke Skywalker in his custody, Kenobi prepared to take the boy to the Lars Homestead on Tatooine. Finally, Kenobi concluded that the dreams he had as a boy were a vision of Owen Lars, his student's stepbrother. The fraternity he felt between himself and Owen was true, from a certain point of view. As Kenobi felt a brotherly bond with his former student, Lars too would be his brother.\nThe idea that Obi-Wan Kenobi and Owen Lars, the adoptive uncle of Luke Skywalker, were brothers, was introduced in the screenplay of the 1983 movie Star Wars: Episode VI Return of the Jedi, but did not make it in the final cut. The movie novelization, however, did include a line in which Kenobi referred to \" brother Owen.\" Similarly, Owen Lars was explicitly described as the \"brother of Obi-Wan Kenobi\" in the Premiere Limited set of the Star Wars Customizable Card Game released by Decipher, Inc. in 1995. Said brother named Owen was later alluded to in the 1999 novel Jedi Apprentice: The Hidden Past, during a dream of Kenobi's. However, the 2002 movie Star Wars: Episode II Attack of the Clones revealed Luke's uncle as Anakin Skywalker's step-brother, rather than Kenobi's brother. Abel G. Peña's short story \"Lone Wolf: A Tale of Obi-Wan and Luke\", released online in 2015, explained Kenobi's dreams as a vision of his future, rather than a specter of his past.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Owen_Lars/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Stewjon/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Shmi_Skywalker_Lars/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(novel)",
  "/wiki/Premiere_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Decipher,_Inc.",
  "/wiki/1995",
  "/wiki/1999",
  "/wiki/Jedi_Apprentice:_The_Hidden_Past",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Lone_Wolf:_A_Tale_of_Obi-Wan_and_Luke",
  "/wiki/2015",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/Retcon",
  "/wiki/Heir_to_the_Empire_Sourcebook",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Obi-Wan_Kenobi,_Jedi_Knight",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}