{
 "name": "Ownellco",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lutrillian"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Ownellco was a Lutrillian that spent time in Chalmun's Spaceport Cantina in Mos Eisley spaceport on the planet Tatooine in 0 BBY. When the local moisture farmer Luke Skywalker and his droids R2-D2 and C-3PO entered the cantina, Ownellco was stood with the Qiraash Leesub Sirln near one of the establishment's tables. Ownellco then moved across the room and sat with a drink in hand at a table between two of the cantina's booths with another Lutrillian, looking up at Skywalker as the moisture farmer approached the bar.\nThe Lutrillian later left the cantina and walked past Skywalker and the Jedi Obi-Wan Kenobi as they hurried through the streets of Mos Eisley toward Docking Bay 94. Ownellco had fair skin, brown hair and black eyes. While in Mos Eisley the Lutrillian wore a light brown jacket, black pants, and a cream ascot.\nOwnellco was created for the 1977 original trilogy film, Star Wars: Episode IV A New Hope. Two Lutrillian costumes were created for the film by creature designer Stuart Freeborn based on a costume sketch by concept artist John Mollo. Mollo's name for Ownellco was \"Colonel\", which was used on set.\nIn the new Star Wars canon, the character was first identified as Ownellco in the 2016 reference book Star Wars, Objets du mythe, which was written by Patrice Girod and Arnaud Grunberg. The name was based on the original \"Colonel\" name, and originated in the Star Wars Legends continuity, where it was first used in the article \"Rogues Gallery: The Unusual Suspects: Who's Who in Mos Eisley\", which was written by Leland Chee and published in Star Wars Insider 130 on December 13, 2011.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ownellco",
  "/wiki/Ownellco/Legends",
  "/wiki/Lutrillian",
  "/wiki/Color",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/0_BBY",
  "/wiki/Moisture_farmer",
  "/wiki/Luke_Skywalker",
  "/wiki/Gender",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Cantina",
  "/wiki/Qiraash",
  "/wiki/Leesub_Sirln",
  "/wiki/Limb",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Docking_Bay_94",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Jacket",
  "/wiki/Scarf",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Stuart_Freeborn",
  "/wiki/John_Mollo",
  "/wiki/Star_Wars",
  "/wiki/2016",
  "/wiki/Star_Wars,_Objets_du_mythe",
  "/wiki/Patrice_Girod",
  "/wiki/Star_Wars_Legends",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars_Insider_130",
  "/wiki/December_13",
  "/wiki/2011",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Yavin",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/Star_Wars_Insider"
 ]
}