{
 "name": "Ozurist",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lethan Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Ozurist was a male Lethan Twi'lek who lived on Coruscant during the Cold War. A chief engineer who was employed in The Works throughout much of the Great Galactic War and the Cold War, Ozurist developed a strong devotion to both his fellow biologicals and the machines he served. During the Cold War, Ozurist asked a Republic-allied individual for help saving one of the \"great machines\" from destruction by rogue droids known as \"mobiles.\"\nA male Lethan Twi'lek, Ozurist lived on the Galactic Republic's capital world of Coruscant during the Great Galactic War and the subsequent Cold War between the Republic and the Sith Empire. During the Cold War, he worked as chief engineer in The Works, the heart of Coruscant's Industrial District. Ozurist believed that the \"great machines\" as he called them—the giant machines and computers that comprised Coruscant's infrastructure—were alive.\nAfter the Sacking of Coruscant by the Sith Empire and the widespread devastation it caused, much of the planet's infrastructure was heavily damaged, and the programming of many of the droids in The Works became corrupted. These droids went rogue and attacked any living being that entered The Works. They became so much of a threat that the Republic was forced to send troops down into The Works to combat the droids.\nThese droids, known to Ozurist and the \"great machines\" as \"mobiles,\" believed that they should kill all living beings on Coruscant and rule the planet themselves. However, the \"great machines\" disagreed, as their programming was still intact. In 3643 BBY, several of the droids damaged the machine Ozurist called Thermodraft, intending to cause a massive explosion and a radiation leak that would kill an untold number of civilians.\nOzurist asked a Republic combatant to enter The Works and save Thermodraft, so as to prevent the disaster. That individual ventured into The Works, braving attacks from rogue droids and the savage, native humanoids known as Cthon, and was able to release the control valves on Thermodraft. That released the pent-up pressure, fixing the machine and preventing the explosion. The individual then returned to Ozurist and informed him of their success. Ozurist thanked them for their help and their service to the great ones.\nAs a yellow-eyed Lethan Twi'lek, Ozurist was one of the red-skinned members of his species. Ozurist was seen as slightly insane by the individual who aided him, as he considered the machines of the undercity to be alive. That, combined with his role as an engineer, developed into a heartfelt devotion to the machines that Ozurist considered his masters. That devotion, however, did not prevent Ozurist for feeling empathy towards his fellow biologicals—Ozurist feared that Thermodraft's destruction would result in catastrophic loss of life, something that he believed should be prevented at all costs.\nOzurist appears in Star Wars: The Old Republic, a massively multiplayer online role-playing game  released by BioWare on December 20, 2011. He gives players the optional mission \"Meltdown!\" in the Works on Coruscant, where he asks the player character to travel deeper into the Works and release the pressure valves.\nAs Coruscant is the Republic capital, the quest is only available to the four Republic classes: Jedi Knight, Jedi Consular, trooper, and smuggler. Unlike many quests in the game, \"Meltdown!\" does not feature any light or dark side choices for the player. The player may choose different conversation options, but the different options do not have any effect on the course of the quest, unless the player chooses to decline the quest.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/Lethan",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Engineer/Legends",
  "/wiki/Sector_943",
  "/wiki/Great_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Mobile",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Industrial_District_(Coruscant)",
  "/wiki/Computer/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Programmer/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Ground_warfare",
  "/wiki/Death/Legends",
  "/wiki/3643_BBY",
  "/wiki/Thermodraft",
  "/wiki/Radiation/Legends",
  "/wiki/Canon",
  "/wiki/Humanoid/Legends",
  "/wiki/Cthon/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Hero_of_Tython",
  "/wiki/The_Barsen%27thor",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}