{
 "name": "Ozzik_Sturn",
 "display_name": "Ozzik Sturn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "2 BBY",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "Ozzik Sturn was a Human male Imperial captain and big game hunter. Using family connections, Sturn rose through the ranks of the military. When assigned to various worlds, he would spend time hunting native creatures, taking their heads as trophies. Sturn desperately wished for an opportunity to hunt a fugitive Jedi during the Great Jedi Purge. He did not get his wish, however, as he was installed as Chief Magistrate on the Mid Rim world Malastare.\nNo longer satisfied with hunting animals, Sturn had sentient prisoners released into a private hunting reserve, in which he would hunt them down. This outraged Malastare's native Dugs and Grans, so the captain was transferred to the Wookiee homeworld of Kashyyyk and tasked with overseeing the construction of a large skyhook in orbit by Wookiee slaves. There, he would hunt the native Wookiees, going so far as to wear their pelts as part of his uniform. He even had a private trophy room to display the severed heads of animals he had killed.\nIn 2 BBY, Princess Leia Organa of Alderaan arrived on Kashyyyk as part of a trap set by Emperor Palpatine to prevent her father, Senator Bail Organa, from rebelling against the Empire. Should Senator Organa rebel, Sturn promised Leia that she would die in a Wookiee uprising. Jedi Master Rahm Kota, an ally of Senator Organa's who had led a brief rebellion against the Empire months earlier, learned of Leia's situation and tasked Galen Marek—\"Starkiller,\" the secret apprentice of Darth Vader—with rescuing her from Kashyyyk. Leia then, in turn, tasked Marek with destroying the skyhook, and so Sturn finally saw his chance to hunt the man he assumed to be a Jedi. While Starkiller was busy removing the tractor pins that anchored the skyhook to the planet's surface, Sturn entered his personal AT-KT and attempted to kill him. Starkiller destroyed his AT-KT and killed the captain instead, just before destroying the skyhook itself.\nOzzik Sturn, a Human male, was born into a privileged and wealthy family of big game hunters. Using his family's connections, Sturn entered the Imperial Military and rose through the ranks. Assigned to many worlds throughout his career, his deployments allowed him to carry on the family tradition of hunting the galaxy's most wild and exotic animals, often taking their heads as trophies. As his rank increased, however, Sturn's assignments left no room for hunting. During the Great Jedi Purge led by Dark Lord of the Sith Darth Vader, Sturn desperately longed for a chance to hunt a fugitive Jedi.\nSturn was instead transferred to various outposts in the Outer Rim Territories, and he became frustrated with his assignments. Eventually, he was installed as a Chief Magistrate on Malastare in the Mid Rim. There, he was again able to hunt, but he had grown tired with hunting non-sentient animals. Instead, he had political prisoners released into a private hunting reserve, where he stalked and killed them. Though hidden, the hunting reserve was eventually discovered by the planet's native Dugs and Grans. Outraged, they revolted against Imperial rule, and the Empire suffered a high casualty rate as a result. Sturn was transferred to Kashyyyk, the homeworld of the Wookiees, as a result; as of a year later, the Empire had been unable to bring Malastare's population back under control.\nWhile on Kashyyyk, Captain Sturn supervised the construction of a skyhook that, when completed, would ferry Wookiee slaves across the galaxy to serve in the construction of Imperial projects, including the first Death Star. On Kashyyyk, Sturn hunted Wookiees, wearing their pelts and braids of hair on his uniform. He maintained a trophy room as part of his personal quarters, and within the room he displayed the heads of a reek, an acklay, a nexu, a wampa, a tauntaun, a krayt dragon, and a Gorax, among many others. On one wall hung a Gungan encased in carbonite.\nIn 2 BBY, opposition against the Empire was taking hold in the galaxy. Bail Organa, senator of Alderaan in the Imperial Senate and viceroy of the House of Organa, was one of several senators who felt that a change was needed. Organa, along with Senator Mon Mothma of Chandrila and Senator Garm Bel Iblis of Corellia, had been planning to create an organized rebellion against the Empire, but they were unwilling to take direct action. The Emperor knew of the growing dissent in the Imperial Senate, so he had Princess Leia Organa, Bail's adopted daughter, sent to Kashyyyk as a \"senatorial observer\"—in reality, she was there as a hostage, so that her father would think twice about rebelling.\nThe princess arrived on Kashyyyk in a Lambda-class shuttle, escorted by the Emperor's Royal Guards. Sturn greeted her when she landed, but Organa knew the truth behind her visit. Sturn responded that, as long as her father remained loyal to the Empire, no harm would come to her. If, however, she did not, Sturn would have her executed and blame her death on a Wookiee uprising. Sturn had Organa and her astromech droid R2-D2 sealed in his quarters.\nNews of his daughter's imprisonment reached Bail Organa, who then asked his ally Jedi Master Rahm Kota, who had previously led his militia in the capture of a TIE Fighter Construction Facility above Nar Shaddaa months earlier, to rescue her. Kota assigned the task to Starkiller, Darth Vader's secret apprentice who had defeated Kota and his militia aboard the construction facility. Starkiller had secretly been tasked by his master with uniting the rebellious elements so the Empire could crush them once and for all, and he had been instructed to do whatever was necessary to complete the task. This included seeking out Kota, earning the trust of the would-be rebel leaders, and killing any Imperials.\nStarkiller landed on Kashyyyk and discovered Organa in Sturn's quarters, but she refused to leave until the skyhook was destroyed and the Wookiees could be liberated. Starkiller fought his way to the skyhook's mooring structure and began removing the tractor pins that kept the skyhook anchored to the ground, cutting through any stormtroopers, scout troopers, jumptroopers, or purge troopers that stood in his way. Before all the pins could be removed, Sturn entered the scene in his personal AT-KT and engaged the man he assumed to be a Jedi, fulfilling his desire to hunt one. Using his lightsaber and the Force, Starkiller destroyed the AT-KT and killed Sturn, before destroying the skyhook itself.\nWith Sturn and the majority of the Imperial forces in the area dead, the Wookiees began celebrating. Princess Organa was able to return to her father unharmed, and, after a series of confrontations with the Empire, Starkiller convinced senators Organa, Mothma, and Bel Iblis to sign the Corellian Treaty, officially forming the Alliance to Restore the Republic.\nOzzik Sturn was an overconfident commander, believing that he could easily defeat a Jedi with whatever means were at his disposal. Rahm Kota had even described him as a madman. This proved to be the Captain's downfall, as Starkiller was able to destroy his AT-KT and kill him. As he had been born into a family of big game hunters, Sturn had also taken up hunting. But hunting non-sentient creatures was not enough; he made the move from hunting animals to hunting sentients while stationed as Chief Magistrate on Malastare. This sudden desire to hunt prisoners led to a revolt against the Empire, but Sturn remained an Imperial officer. Transferred to Kashyyyk, he started to hunt the native Wookiees, despite being assigned there to oversee their enslavement. He proudly wore a Wookiee pelt draped across his uniform and brands of Wookiee hair on his left shoulder.\nOzzik Sturn first appeared in the 2008 novelization of The Force Unleashed. In the video game, he was voiced by Tom Kane, who also provided his likeness for the captain. Sturn was given a brief entry in The Complete Star Wars Encyclopedia. The Art and Making of Star Wars: The Force Unleashed provides details of Sturn's development over time, including concept art of a shape-shifting Sturn.\nIn the Xbox 360 and PlayStation 3 version of The Force Unleashed video game, Sturn is depicted as wearing a white uniform that strongly resembles that of the Imperial Grand Admirals or even the uniform of an Imperial Security Bureau officer like Wullf Yularen, despite the fact that he is stated to be a captain. Additionally, his rank badge would seem to denote him as a colonel, major, or even general, according to the tabulation presented in the Imperial Sourcebook.\nIn the PlayStation 2, PlayStation Portable, and Wii version of The Force Unleashed, Sturn wears the uniform of an AT-ST pilot with his Wookiee pelt. In this version of the game, Sturn emerges from his destroyed AT-KT, only to be impaled by Starkiller with his lightsaber. In the Nintendo DS version of the game, Sturn pilots an AT-RT instead of an AT-KT. In the cell phone version, the Imperial commander on Kashyyyk wears a standard uniform and is equipped with a lightwhip, although he is never identified as Sturn.\nIn the N-Gage and the iPhone/iPod Touch versions of the game, Starkiller rescues Organa from a group of escorting stormtroopers in the forest. Not willing to leave while the planet's population is enslaved, Organa sends Starkiller to liberate Wookiees from a nearby prison compound. After he has set the slaves free, Starkiller faces off against an electrostaff-wielding Sturn inside the prison. The captain is also assisted by two AT-STs. Starkiller, however, manages to push the AT-STs out of the prison building and closes the doors through which they have come. When Sturn charges him with the electrostaff, Starkiller kills him with a discharge of Force lightning.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Ozzik",
  "/wiki/2_BBY/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Chief_Magistrate_(Galactic_Empire)",
  "/wiki/Mid_Rim",
  "/wiki/Malastare/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Skyhook_(Kashyyyk)",
  "/wiki/Orbit/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alderaan/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Battle_of_the_TIE_Fighter_Construction_Facility",
  "/wiki/Galen_Marek",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mission_to_Kashyyyk_(Great_Jedi_Purge)",
  "/wiki/Skyhook/Legends",
  "/wiki/Tractor_beam/Legends",
  "/wiki/All_Terrain_Kashyyyk_Transport",
  "/wiki/Big-game_hunter",
  "/wiki/The_galaxy/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Politics/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/File:SturnLeiaConvo-TFU.ogg",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Reek/Legends",
  "/wiki/Acklay/Legends",
  "/wiki/Nexu/Legends",
  "/wiki/Wampa/Legends",
  "/wiki/Tauntaun/Legends",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/Gorax/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Viceroy/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Chandrila/Legends",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Death/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Kota%27s_Militia",
  "/wiki/TIE_Fighter_Construction_Facility",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Scout_trooper/Legends",
  "/wiki/Imperial_jumptrooper",
  "/wiki/Purge_trooper",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Corellian_Treaty",
  "/wiki/Magistrate/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Amy_Beth_Christenson",
  "/wiki/2008",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/Video_game",
  "/wiki/Tom_Kane",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Force_Unleashed",
  "/wiki/Changeling/Legends",
  "/wiki/Xbox_360",
  "/wiki/PlayStation_3",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Wullf_Yularen/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Major/Legends",
  "/wiki/General/Legends",
  "/wiki/Imperial_Sourcebook",
  "/wiki/PlayStation_2",
  "/wiki/PlayStation_Portable",
  "/wiki/Wii",
  "/wiki/Imperial_Army_pilot#AT-ST_pilot",
  "/wiki/Shiak",
  "/wiki/Nintendo_DS",
  "/wiki/All_Terrain_Recon_Transport/Legends",
  "/wiki/Lightwhip/Legends",
  "/wiki/Electrostaff/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/The_Force_Unleashed_II_(novel)",
  "/wiki/Star_Wars:_The_Force_Unleashed:_Prima_Official_Game_Guide",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blood_Feud!",
  "/wiki/Star_Wars_Insider_124",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Category:Images_of_Ozzik_Sturn",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)#The_Force_Unleashed_Databank",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope"
 ]
}