{
 "name": "P%27nll_Vun",
 "display_name": "P'nll Vun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jakku"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "P'nll Vun was a male Nautolan who lived in Reestkii on the planet Jakku. He was taken captive and detained in Reestkii's town hall along with the other residents when his village came under attack by Zygerrian slavers.\nP'nll Vun lived in the small isolated settlement of Reestkii, a town which was sometimes visited by the wanderer Bobbajo. During one of Bobbajo's visits, a band of Zygerrian slavers descended upon the town in their cruiser. Vun, Bobbajo, and the rest of the citizens of Reestkii were forced into the town hall building and held there while the Zygerrians raided the town for supplies. To calm the frightened villagers, who could not see out of the building's high windows, Bobbajo told a story. While Vun and the other captives listened to the story inside the building, Bobbajo's trained pets on the outside rendered all of the slavers unconscious, setting the villagers free.\nVun reacted with disbelief and denial after Reestkii's capture. Along with Jol Bengim, Xavi Brightsun, and Thaddeeus Marien, he was skeptical of Bobbajo's fanciful story about the destruction of the Death Star.\nP'nll Vun first appeared in the short story \"All Creatures Great and Small\" by Landry Q. Walker, which was published in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jakku",
  "/wiki/Nautolan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Reestkii",
  "/wiki/Planet",
  "/wiki/Reestkii_town_hall",
  "/wiki/Zygerrian",
  "/wiki/Slavery",
  "/wiki/Bobbajo",
  "/wiki/Cruiser",
  "/wiki/Jol_Bengim",
  "/wiki/Xavi_Brightsun",
  "/wiki/Thaddeeus_Marien",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/All_Creatures_Great_and_Small",
  "/wiki/Landry_Q._Walker",
  "/wiki/2015",
  "/wiki/Tales_from_a_Galaxy_Far,_Far_Away:_Aliens:_Volume_I"
 ]
}