{
 "name": "Pa_Vau",
 "display_name": "Pa Vau",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Irmenu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Irmenu Navy"
     ]
    }
   ]
  }
 ],
 "content": "\"Pa\" Vau was the abusive father of Walon Vau and the Count of Gesl on the isolated, feudal ocean world of Irmenu.\nVau served as an Admiral in the Imperial Irmenu Navy, which made his son want to follow in his footsteps. However, Walon was rebuked by his father for not being good enough. He later refused a marriage between Walon and the princess of a neighboring province whom his son had fallen in love with. Walon's dalliance would later lead to his temporary exile from Irmenu by the Imperius priesthood, and he later joined the Mandalorians. For this he was disowned by his own family and had his inheritance revoked. After \"Pa\" Vau died, his title passed to Walon's cousin.\nDespite the aversion of the Irmenu to offworld contact, \"Pa\" Vau maintained a bank vault in the Dressian Kiolsh Merchant Bank on Mygeeto in which he stored the family fortune. Walon would steal this fortune and his inheritance back many years later, along with many other family heirlooms. While he beat Walon often in his youth, he was never able to beat the feeling out of Walon, who still felt sympathy and compassion for others, as he gave most of the family heirlooms to Kal Skirata to help fund his attempt to slow the aging process of clone troopers.\nWalon Vau remembered his father as a domineering brute with a cold, black heart, for whom nothing was ever good enough, not even his own son.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Irmenu",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_Irmenu_Navy",
  "/wiki/Walon_Vau",
  "/wiki/Count_of_Gesl",
  "/wiki/Admiral/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Imperius",
  "/wiki/Mandalorian/Legends",
  "/wiki/Cousin_Vau",
  "/wiki/Dressian_Kiolsh_Merchant_Bank",
  "/wiki/Mygeeto/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut"
 ]
}