{
 "name": "Padak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Qulok's Fist"
     ]
    }
   ]
  }
 ],
 "content": "Padak was a Human male bounty hunter who utilized a customized suit of armor. Part of the Qulok's Fist bounty hunter gang, he worked with them in slavery, smuggling, and mercenary operations throughout the Outer Rim Territories, the Minos Cluster, and the Kathol sector. In 8 ABY, Padak assisted the group in its mission to tail the New Republic CR90 corvette FarStar on the orders of Imperial Moff Kentor Sarne, former warlord of the Kathol sector, and engaged the vessel in battle in the Shintel system.\nA Human male, Padak was a bounty hunter who worked with Qulok's Fist, a group of criminals who were involved in bounty hunting, smuggling, slavery, and mercenary work. He worked alongside Kolig, the group leader, the murderer Sufar, and former Imperial soldier Thanis Gul-Rah. Clad in a customized suit of yellow-gold armor, Padak was the walking arsenal of the group. Blasters and grenades hung from bandoleers and holsters all over his body.\nAlong with Qulok's Fist, Padak worked in the Outer Rim Territories, the Minos Cluster, and the Kathol sector. During the group's time in the Kathol sector, they were contracted by Moff Kentor Sarne, a former Imperial officer who had withdrawn the sector from the Empire and set himself up as a warlord following the death of Emperor Palpatine in 4 ABY. Sometime during this period, Padak participated in a hunt on a backwater planet that turned into a massacre. This incident led to Thanis Gul-Rah leaving the organization in disgust.\nAfter the New Republic liberated the sector capital Kal'Shebbol in 8 ABY, Sarne was forced to flee into the Kathol sector. Qulok's Fist was hired by the warlord to tail the CR90 corvette FarStar, which had been assigned by the New Republic to locate Sarne.\nSarne, in an effort to delay and harass the FarStar, arranged for the corvette to divert to the Shintel system through the use of false information passed onto them by one of his agents, Colonel Olaver Lansel, on the planet Gandle Ott. Sarne intended for the FarStar to locate him, since he wished to draw regional New Republic forces into a trap of his own design, which would then clear the way for his reconquest of the Kathol sector. At Shintel, the FarStar encountered a supply depot that had been abandoned by Sarne. One of the officers at the base, Lieutenant Palme—also a deep-cover agent of Sarne's—managed to upload a virus into the FarStar's systems. When the corvette attempted to leave the Shintel system, the virus programming overloaded the hyperdrive, stranding the starship. As arranged, Qulok's Fist arrived in their transport, the Steel Fist, and executed a series of fast attacks on the stricken ship. Padak crewed on the Steel Fist during the brief engagement.\nPadak was a man not only looking for a fight, but for a war. His vast array of personal weaponry included a blaster rifle, a blaster pistol, and a hold-out blaster, two knives, four grenades, and two thermal detonators. He also carried a magna-grapple with seventy-five meters of thincord. He was trained to use blasters, and was proficient in melee combat and throwing weapons. He could ride animals, and operate the weapons aboard starships. He could be stealthily if he needed to be, and had first aid training.\nSealed in his customized armor and helmet, Padak presented an emotionless, anonymous face to the galaxy. He was considered to be evil and violent, and extremely dangerous. He had no regrets or remorse about killing other beings, and was on the verge of being out of control, which made him unpredictable. Padak's only goal was \"to do good death.\" He followed Kolig's orders, but was disgruntled by the prospect of little killing, preferring heated combat and the obliteration of his enemies. Although a fierce warrior, he was not as tactically minded as the other members of Qulok's Fist, and had to be reigned in during missions to prevent him from blowing a trap or plan.\nPadak was created for The DarkStryder Campaign, a supplement for Star Wars: The Roleplaying Game by West End Games. Padak appeared in the \"Rogues Gallery\" section written by Peter M. Schweighofer, and was included so the Gamemaster could use him—and Qulok's Fist—in an original adventure. Qulok's Fist would go on to appear in the adventure Shintel Downtime, although they would only be encountered aboard their ship, the Steel Fist.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Qulok%27s_Fist",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Kathol_sector",
  "/wiki/8_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/FarStar",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Warlord/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Skirmish_at_Shintel",
  "/wiki/Shintel_system",
  "/wiki/Kolig",
  "/wiki/Death/Legends",
  "/wiki/Sufar",
  "/wiki/Soldier/Legends",
  "/wiki/Thanis_Gul-Rah",
  "/wiki/Color/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Time/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/Capital/Legends",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/DarkStryder_Campaign",
  "/wiki/Corvette/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Olaver_Lansel",
  "/wiki/Gandle_Ott",
  "/wiki/Shintel",
  "/wiki/Imperial_Depot_4290-1",
  "/wiki/Lieutenant/Legends",
  "/wiki/Palme",
  "/wiki/Star_system/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Steel_Fist",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Magna-grapple",
  "/wiki/Thincord",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Gunner/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/Peter_M._Schweighofer",
  "/wiki/Shintel_Downtime",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/The_DarkStryder_Campaign,_Deluxe",
  "/wiki/The_Saga_Begins",
  "/wiki/Death_Is_Remotely_Possible",
  "/wiki/The_Kathol_Outback"
 ]
}