{
 "name": "Padu Cherd",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Padu Cherd was a human male who worked as a laborer at Tibidon Station, a tibidon sand whale–harvesting station on the desert planet Tatooine. After one shift in 9 BBY, he discovered that he had only received half his pay and pleaded with foreman Groff Ditcher for the rest as he had a family. Ditcher shoved Cherd and sent him away with a threat that he would take the rest of the worker's pay if he spoke another word.\nPaul Cherd was a human male who worked as a laborer at Tibidon Station, a sand whaling station in the deserts of the planet Tatooine. The workers at the station harvested meat from the carcass of a huge tibidon sand whale that they then chopped up into bricks on an assembly line. In 9 BBY, Cherd completed a shift at the site, and when the whistle sounded, he went to collect his pay from a power droid with a payment dispenser attached to its head.\nAfter inserting his punch disc and collecting the credits that were dispensed, Cherd realized he had only been paid half of his wages. He approached the foreman, Groff Ditcher, and pleaded with him for the rest in order to support his family. Ditcher shoved Cherd away, slamming him in the stomach, and threatened to take the rest of his pay if he said another word. Clutching his stomach, Cherd silently moved away toward the transport that returned workers to the town of Anchorhead. Jedi-in-hiding Obi-Wan Kenobi, who also worked at the station, watched the encounter but did not intervene.\nPadu Cherd pleaded with Ditcher for his family's sake but accepted the half pay without further complaint after the foreman pushed and threatened him. Cherd had light skin, brown eyes, and graying hair that included a grizzled goatee.\nCherd wore a red shirt, brown pants, brown boots, a brown apron, and a blue cap. He used a large knife while working a the station.\nPadu Cherd was portrayed by Chad Parker in the first episode of the Obi-Wan Kenobi television series, which aired on May 27, 2022. Cherd's name is not spoken in the episode, but it appears in the credits.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Padu_Cherd",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/File:Cherd-Ditcher-OBK1.ogg",
  "/wiki/Tibidon_Station",
  "/wiki/Tibidon_sand_whale",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/9_BBY",
  "/wiki/Foreman",
  "/wiki/Groff_Ditcher",
  "/wiki/File:Ditcher-Moving-OBK1.ogg",
  "/wiki/Foodstuff",
  "/wiki/Power_droid",
  "/wiki/Payment_dispenser",
  "/wiki/Punch_disc",
  "/wiki/Credit",
  "/wiki/Stomach",
  "/wiki/Anchorhead",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Hat",
  "/wiki/Knife",
  "/wiki/Chad_Parker",
  "/wiki/Part_I",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/May_27",
  "/wiki/2022",
  "/wiki/Obi-Wan_Kenobi:_A_Jedi%27s_Return",
  "/wiki/Category:Images_of_Padu_Cherd",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}