{
 "name": "Pagda_Gevtes",
 "display_name": "Pagda Gevtes",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Exocron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Devisors"
     ]
    }
   ]
  }
 ],
 "content": "Pagda Gevtes was a Human male from the planet Exocron. He was a Master Devisor and the adjunct to the Ruling Council. He used his position to manipulate and control the council to do the Devisors bidding.\nIn 8 ABY, Gevtes met in a closed session with the Ruling Council, Captain Horzao Darr of the Exocron Airfleet, and Captain Kaiya Adrimetrum of the New Republic vessel FarStar. Recognizing that the power base of the Devisors would be threatened by exposing Exocron to outside influences, he decreed that the FarStar would be held for examination, and the crew of the vessel would remain on the planet for the rest of their lives. Claiming it was for security purposes to keep the planet safe, Gevtes hoped that study of the FarStar's advanced technology would increase the Devisors' power base.\nDuring the liberation of Captain Kaiya Adrimetrum from the Ministry of Technology, Gevtes engaged the New Republic rescue team in a personal walker mounted with a blaster cannon. During the firefight, one of the rescuers used a flash pistol to temporarily blind Gevtes and lured him towards a staircase. Gevtes attempted to negotiate the stairs in the walker, but the machine became unbalanced and rolled down the staircase. Trapped in the wreckage at the bottom of the stairs, Gevtes was arrested by council guards and troops from the sky-dreadnaught Maxion, later being tried for his crimes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Exocron",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Devisors",
  "/wiki/Planet/Legends",
  "/wiki/Master_Devisor",
  "/wiki/Ruling_Council",
  "/wiki/8_ABY/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Horzao_Darr",
  "/wiki/Exocron_Airfleet",
  "/wiki/Kaiya_Adrimetrum",
  "/wiki/New_Republic/Legends",
  "/wiki/FarStar",
  "/wiki/Ministry_of_Technology_(Exocron)",
  "/wiki/Flash_pistol",
  "/wiki/Sky-dreadnaught",
  "/wiki/Maxion",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/The_Masters_of_Exocron",
  "/wiki/The_Kathol_Outback",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}