{
 "name": "Pagetti Rook",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Pagetti Rook was a Weequay male who worked for the crime lord Jabba Desilijic Tiure as a skiff guard on the planet Tatooine. In 4 ABY, Jabba ordered that Luke Skywalker, Han Solo and Chewbacca—three agents of the Alliance to Restore the Republic whom he held prisoner—be executed at the Great Pit of Carkoon. Rook was assigned to the Bantha-II cargo skiff that carried the prisoners to the pit, where they were to be fed to a sarlacc that lived there.\nPagetti Rook was a Weequay who served the Hutt crime lord Jabba Desilijic Tiure as a skiff guard during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire.\nIn 10 BBY, alongside a Klatooinian guard, Rook was assigned by his master to follow the Wookiee bounty hunter Krrsantan to the Dune Sea to track down the man that stopped his water tax during the Great Drought. They went to the Lars moisture farm and took Owen Lars as hostage. However, the attempt ended in failure as the exiled Jedi Master Obi-Wan Kenobi, the one responsible of stopping Jabba's water tax, came to fight the Wookiee and both him and Lars defeated him, prompting Krrsantan to leave Tatooine to avoid Jabba's wrath.\nHis master obtained the smuggler Han Solo frozen in carbonite in 3 ABY, and chose to display Solo at his palace on the desert planet Tatooine, where Rook worked. In 4 ABY, several of Solo's friends in the Alliance then initiated a plan to free the smuggler from Jabba's clutches, which started with the former smuggler Lando Calrissian taking a job alongside Rook as a skiff guard at the palace. The Jedi Knight Luke Skywalker then gifted the droids R2-D2 and C-3PO to Jabba, and they two were given roles within the palace. With these allies in place, Leia Organa disguised herself as the bounty hunter Boushh and then brought Chewbacca to Jabba as a prisoner, but soon after arriving she was caught thawing Solo out of his carbonite and captured. Skywalker himself was the last to journey to the palace, and after he killed Jabba's pet rancor, the Hutt ordered that Solo, Chewbacca and Skywalker be executed.\nRook was one of five guards assigned to escort the prisoners on a Bantha-II cargo skiff piloted by the Kadas'sa'Nikto Vedain, with Calrissian and the slave Kithaba being two of the other men assigned to the skiff. The skiff would take Skywalker and his companions to the Great Pit of Carkoon, where they would be fed to the sarlacc that dwelt there and digested over one thousand years. Jabba and his court traveled in the sail barge Khetanna to watch the spectacle and a second skiff of guards traveled alongside the vehicle carrying Rook. Upon reaching the pit, Skywalker used a Jedi mind trick to convince one of his guards to take off his handcuffs before Rook forced him out onto a gangplank over the sarlacc's pit. Jabba offered the prisoners a chance to beg for mercy, but all three refused, and Skywalker warned the Hutt that this was his last chance to free them. Jabba chose to ignore the threat and ordered Rook to push Skywalker into the pit.\nRook stepped forward and jabbed at the Jedi with his BD-1 Cutter vibro-ax, forcing Skywalker to step off the end of the plank; however, the Jedi spun and caught the plank and then leapt back up and over Rook. After landing, Skywalker caught his lightsaber, which had been launched to him by R2-D2 on board the sail barge, and attacked Rook and his colleagues. At some point during the ensuing battle, Rook was killed.\nPagetti Rook was a Weequay male with black hair and brown skin.\nRook was able to speak Galactic Basic Standard. He was also capable of understand Huttese, as demonstrated during his tenure as Jabba Desilijic Tiure's guard.\nRook carried a BD-1 Cutter vibro-ax while on the skiff and wore a pair of beige pants with a blue shirt and brown armor. His outfit also included boots and a belt.\nPagetti Rook was one of several Weequay characters created for Star Wars: Episode VI Return of the Jedi, all of whom were known as \"Queequay\" during production in reference to the fictional Polynesian harpononer Queequeg from Herman Melville's book Moby-Dick. The Weequay species were named after the Polynesian Queequeg but were originally named Queequay by the crew of Return of the Jedi. Rook himself, who was portrayed by stuntman Peter Diamond and known as \"Queequeg 2\" in production, was identified by the nickname \"Queequeg\" in Star Wars: The Action Figure Archive, a reference book released in 1999. The character then received proper identification in the Rogues Gallery section of Star Wars Insider 143, where Leland Chee identified him by the full name of Pagetti Rook.\nAll of the non-human skiff guard costumes, including Rook's, were made through cooperation between the costume and creature design departments working on the film. Clay sculpts of the alien heads were used to make plaster molds into which latex could be poured to create the final product. Velcro and harnesses hidden with clothing were used to make sure the masks did not fall off the performers' heads during filming. Rook's clothing consisted of a quilted suede tabard over a simple turquoise shirt. The pants were made using a cotton waffle weave fabric that was used extensively in many of the film's costumes and then dyed, aged and distressed with mud. The leather straps and belt that lay over the tabard were secured at the front of the costume with a medallion buckle. An early costume sketch for the character made by Nilo Rodis-Jamero also included a helmet and armed the Weequay with a blaster as well as a vibro-ax.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pagetti_Rook",
  "/wiki/Pagetti_Rook/Legends",
  "/wiki/Rook_(disambiguation)",
  "/wiki/Star_Wars_(2015)_20",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Weequay",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Skiff",
  "/wiki/Planet",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Death",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Sarlacc",
  "/wiki/Hutt",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/10_BBY",
  "/wiki/Klatooinian",
  "/wiki/Wookiee",
  "/wiki/Bounty_hunter",
  "/wiki/Krrsantan",
  "/wiki/Dune_Sea",
  "/wiki/Water_tax",
  "/wiki/Great_Drought",
  "/wiki/Lars_Homestead",
  "/wiki/Owen_Lars",
  "/wiki/Exile_(punishment)",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Smuggler",
  "/wiki/Carbonite",
  "/wiki/3_ABY",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Desert",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Jedi_Knight",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boushh",
  "/wiki/Rancor",
  "/wiki/Pilot",
  "/wiki/Kadas%27sa%27Nikto",
  "/wiki/Vedain",
  "/wiki/Slavery",
  "/wiki/Kithaba",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Mind_trick",
  "/wiki/Stuncuffs",
  "/wiki/BD-1_Cutter_vibro-ax",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Hair",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Huttese",
  "/wiki/Vibro-ax",
  "/wiki/Armor",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Peter_Diamond",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/1999",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_143",
  "/wiki/Leland_Chee",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/Blaster",
  "/wiki/Category:Images_of_Pagetti_Rook",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Tatooine_Rhapsody",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_Majordomo,_Major_Problems",
  "/wiki/Star_Wars_Adventures_(2017)_23",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/5-Minute_Star_Wars_Villain_Stories",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Rescue_from_Jabba%27s_Palace_(World_of_Reading)",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Luke_vs._Jabba_-_Sail_Barge_Escape",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Complete_Vehicles",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_32",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Empire_at_War_(Star_Wars:_Destiny)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/The_Consequence_of_Choice",
  "/wiki/Star_Wars_Insider_191",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Databank_(original)",
  "/wiki/Set_Piece",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/December_13",
  "/wiki/2020"
 ]
}