{
 "name": "Paige_Tico",
 "display_name": "Paige Tico",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hays Minor"
     ]
    },
    {
     "name": "Born",
     "values": [
      "6 ABY",
      "Hays Minor"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Cobalt Hammer",
      "Ileenium system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tico family",
      "Central Ridge Mining Company",
      "Resistance",
      "Cobalt Squadron",
      "Cobalt Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Paige Tico, nicknamed Pae-Pae by her sister, was a human female who served as a gunner on a MG-100 StarFortress SF-17 in the Resistance during their conflict with the First Order. She was the sister of Rose Tico, a Resistance maintenance worker. During the evacuation of the Resistance base on D'Qar, Tico's bomber flew against the First Order Mandator IV-class Siege Dreadnought Fulminatrix and successfully destroyed it with the bomber's payload. However, the resulting explosion engulfed the bomber and took Tico's life. Her final actions allowed the Resistance's fleet to escape D'Qar's system.\nPaige Tico had at least one sibling, a younger sister named Rose Tico. After witnessing firsthand the brutality of the First Order on their homeworld in the Otomok system, both Paige and Rose fled from the Otomok system and joined the Resistance.\nThe First Order had come to their world, Hays Minor, to mine its ores, regardless of the effect it had on the people. Seeing how it devastated the planet, she and Rose sabotaged First Order ships, but their action did little to stop the strip mining. Their parents told both sisters to join the Resistance, which they did. Later they would learn in horror that the First Order had blockaded and torn apart the planet. Vowing vengeance, they decided to strike against them, but were persuaded against it by Leia Organa, who told them staying with the Resistance would be more effective than a personal crusade.\nAs a Resistance soldier, Paige became an exceptional gunner and pilot. She survived several missions, leading her to become superstitious, occasionally wrapping her snowgrape-shaped Haysian smelt medallion around the struts of her cannons for good luck. During their downtime between bombing runs, the two sisters always discussed their chance to see the galaxy.\nIn 34 ABY, during the evacuation of D'Qar, Paige's bomber, the Cobalt Hammer, flew against the First Order's Mandator IV-class Siege Dreadnought Fulminatrix, commanded by Captain Moden Canady. When Paige was ordered to release the proton bombs of her bomber, she hurriedly climbed out of her bomber's hold to the bombardier station, where she took the control to release the bombs, but the laser cannon of a First Order TIE Fighter hit the Hammer, causing her to fall off the ladder and lose consciousness.\nWhen Paige regained consciousness, she discovered that the Resistance was in trouble. Unfortunately, the control to release the proton bombs had been left at the top of the ladder. Knowing that she would not have enough time to get back into the cockpit and activate the bombs with the control, Paige kicked the ladder so that the control could fall into her hands. After several kicks, the control fell into the abyss, but Paige managed to catch it. Then, Paige released the proton bombs, which fell on the Fulminatrix, destroying the ship and killing Captain Canady and his crew. As it was too late for escape but knowing her sacrifice would keep the Resistance safe, Paige closed her eyes and accepted her death, as the fire engulfed the Hammer.\nEventually, Paige's sacrifice allowed the Resistance's fleet to escape D'Qar's system for good, although the First Order would eventually follow them. Paige's sister, Rose, took her death very hard. Writing a brief epitaph at the end of the journal Paige had kept, Rose described her part in the battle, commending her older sister as having died a hero and swearing that she wouldn't let the First Order destroy the Resistance and would find a way to defeat them.\nWhen Rose saw Finn trying to \"escape\" from the Raddus, she stunned him and attempted to bring him to the Resistance as a coward because her sister was killed during the battle, but she was ultimately convinced that Finn was not trying to escape.\nOne year after the Battle of Crait, as part of her new work leading the Engineering Corps of the Resistance to counter any new advancements the First Order might come up with, Rose developed a custom proton bomb named the \"Paiger\" in honor of Paige's sacrifice.\nPaige was extremely close to her younger sister, Rose, since childhood, feeling incomplete when they were separated. When they joined the Resistance, Paige insisted that she and Rose be assigned to the same ship. The two sisters frequently sat together at Paige's gunner station while traveling to and from missions. Paige thought that Rose underestimated herself and her importance in the Resistance and often provided moral support.\nWhile Paige hated the First Order's leadership for the destruction of her homeworld and their other atrocities, she didn't hold the same vitriol for the First Order soldiers and pilots. She felt that many of them were people like her, thrown into a situation that some would have wanted to escape, a belief she found vindicated by the stormtrooper Finn, who defected from the First Order and helped the Resistance destroy Starkiller Base.\nPaige had a fascination for fathiers, deciding that they were the one creature above all else she wanted to see in person. On her suggestion, the crew of the Hammer used imaginary stables of fathiers as markers in the crew's card games. Paige also wanted to see a live fathier race. While she never got to see a fathier or a race, her sister Rose got to see and ride one on her mission with Finn to Canto Bight.\nPaige Tico was portrayed by Vietnamese actress Veronica Ngo in Star Wars: Episode VIII The Last Jedi. Tico was first shown in the Behind The Scenes video for The Last Jedi, which was released on July 15, 2017 for the D23 Expo. Director Rian Johnson confirmed Paige's appearance in the footage on Twitter.\nIn one of the film's early drafts, featuring a different version of the evacuation of D'Qar, Paige was going to die after releasing the proton bombs over the Fulminatrix in the arms of Finn, who would have been the gunner of the Cobalt Hammer instead of being hospitalized aboard the Raddus. Concept art for the planned scene showed Paige's last moments in which she would have left a bloody handprint on Finn's heart, echoing FN-2003's bloody handprint scene of Star Wars: Episode VII The Force Awakens, including how Finn pulled her lifeless body from the bomber inside the Resistance hangar, but director Rian Johnson cut the scene in a later revision of the script, because he ultimately found that \"he couldn't pay it off.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Age_of_Resistance_-_Rose_Tico_1",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Rose_%26_Paige",
  "/wiki/The_Last_Jedi:_Cobalt_Squadron",
  "/wiki/The_Last_Jedi:_Bomber_Command",
  "/wiki/Star_Wars_Look_and_Find_(Journey_to_Star_Wars:_The_Last_Jedi)",
  "/wiki/Rose_Knows",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Special:Upload",
  "/wiki/Hays_Minor",
  "/wiki/6_ABY",
  "/wiki/34_ABY",
  "/wiki/Cobalt_Hammer",
  "/wiki/Ileenium_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Tico_family",
  "/wiki/Central_Ridge_Mining_Company",
  "/wiki/Resistance",
  "/wiki/Cobalt_Squadron",
  "/wiki/Gunner",
  "/wiki/MG-100_StarFortress_SF-17",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Rose_Tico",
  "/wiki/Technician",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/Fulminatrix",
  "/wiki/Otomok_system",
  "/wiki/Sabotage_of_First_Order_OreDiggers",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Pilot",
  "/wiki/Snowgrape",
  "/wiki/Haysian_smelt",
  "/wiki/Paige%27s_medallion",
  "/wiki/Cannon",
  "/wiki/Captain",
  "/wiki/Moden_Canady",
  "/wiki/Proton_bomb",
  "/wiki/Bombardier",
  "/wiki/Laser_cannon",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Starship",
  "/wiki/Death",
  "/wiki/Finn",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/35_ABY",
  "/wiki/Battle_of_Crait",
  "/wiki/Engineering_Corps",
  "/wiki/Paiger",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Starkiller_Base",
  "/wiki/Fathier",
  "/wiki/Canto_Bight",
  "/wiki/Rian_Johnson",
  "/wiki/Veronica_Ngo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/July_15",
  "/wiki/2017",
  "/wiki/FN-2003",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/The_Last_Jedi:_Cobalt_Squadron_(audiobook)",
  "/wiki/Rose_and_Paige_Fight_for_the_Resistance",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_6",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi:_Rose_and_Finn%27s_Secret_Mission",
  "/wiki/The_Last_Jedi_Adaptation_1",
  "/wiki/The_Last_Jedi_Adaptation_2",
  "/wiki/The_Last_Jedi_Adaptation_3",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/Spark_of_the_Resistance",
  "/wiki/Spark_of_the_Resistance_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/Scouting_for_Leia/A_Mission_with_Maz",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_VIII:_The_Last_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Last_Jedi_(toy_line)",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_Incredible_Cross-Sections",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Last_Jedi:_Heroes_of_the_Galaxy",
  "/wiki/The_Last_Jedi:_Rose_Tico:_Resistance_Fighter",
  "/wiki/Star_Wars:_Resistance_Bomber_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Resistance_Conversion_Kit",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Hotshots_and_Aces_Reinforcements_Pack",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_95",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Reproduction",
  "/wiki/11_ABY",
  "/wiki/The_Last_Jedi_(storybook)",
  "/wiki/The_Art_of_Star_Wars:_The_Last_Jedi",
  "/wiki/Electronic_Arts"
 ]
}