{
 "name": "Pakmillu",
 "display_name": "Pakmillu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "27 BBY",
      "Outbound Flight"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Judicial Department",
      "Judicial Department"
     ]
    }
   ]
  }
 ],
 "content": "Pakmillu was male Mon Calamari captain of the Outbound Flight, as well as a officer on the Judicial Forces. In 27 BBY, Outbound Flight left the Galactic Republic's space, and began its journey which would end in another galaxy beyond the Unknown Regions, throughout the journey, Pakmillu led the massive starship and led the crew and people aboard the vessel. Before the Outbound Flight reached Roxuli, Jedi Master Jorus C'baoth, the leader of the expedition, attempted to kidnap a Rodian child in the middle of the night, which prompted the child's parents to form a protest. After Jedi Knight Obi-Wan Kenobi discussed the issue, Pakmillu arrived and suggested that they held a meeting the next day about the topic. When they arrived at Roxuli, Supreme Chancellor Sheev Palpatine of the Republic asked Kenobi and Skywalker to leave so a dispute with Roxuli's government could be fixed by the Jedi Master, which saddened Pakmillu, as he would have liked them to experience entering a new galaxy. At that point, C'baoth and the Jedi aboard had taken control of the starship, making Pakmillu's authority non-existing.\nLater on, when Chiss Force Commander Mitth'raw'nuruodo with the Core name \"Thrawn\" brought Outbound Fligt out of hyperspace with a gravity well projector, Pakmillu was present at the bridge. Although the Chiss attempted to negotiate with Outbound Flight so the starship would not pass across the alien's territory—although the Chiss wanted to destroy it so Outbound Flight did not bring the Yuuzhan Vong or \"Far Outsiders\" into the galaxy—C'baoth ignored the Chiss, which forced the Chiss to destroy Outbound Flight. Thrawn bombarded the Outbound Flight with his droid starfighters and used radiation bombs to kill every passenger aboard Outbound Flight. During the bombardment, Pakmillu was slained.\nBefore Outbound Flight's departure, Jedi Master Obi-Wan Kenobi and Padawan Anakin Skywalker visited Pakmillu aboard Dreadnaught-One, the command center of Outbound Flight. There, Pakmillu showcased the abilities of the command center, sharing the ability to activate or deactivate emergency protocols or systems from there in any of the dreadnaughts without sending anyone to assist the dreadnaught. Kenobi and Pakmillu then engaged in a conversation on the starship's use of a fleet of swoops and speeder bikes instead of turbolifts, although Kenobi heavily insisted on changing the bikes for turbolifts, Skywalker stated that it worked well, which Pakmillu confirmed, ending the conversation.\nShortly after, Kenobi and Pakmillu discussed the starship's future stops, Pakmillu called most of them \"flybys,\" as they would not stop unless there were actual problems. Pakmillu stated the length of their travels, which he estimated to several years, and told Skywalker that the storage core had supplies for ten years, which he expected to supplement along the way. Following the group's discussion on the safety of the possible colonisers, Pakmillu entered a brief conversation on Skywalker getting a new teacher aboard the starship, which was interrupted by C'baoth, which was informed by Kenobi on he and his Padawan joining the expedition. As the Jedi discussed their possible search for Vergere, a Jedi that had become lost, Pakmillu expressed worry on the Outbound Flight possibly becoming a search and rescue mission. Getting a warning from C'baoth after he expresseed his concerns, Kenobi and C'baoth continued their conversation. Then, the arrogant individual, C'baoth, ordered the captain to arrange quarters for the new members of the expedition.\nEventually, before the Outbound Flight reached Roxuli, Jedi Master Jorus C'baoth, the founder and leader of the expedition, attempted to kidnap a Rodian child in the middle of the night, which made the child's parents to form a protest. After Jedi Knight Obi-Wan Kenobi discussed the issue, Pakmillu arrived and suggested that they held a meeting the next day about the topic. When they arrived at Roxuli, Supreme Chancellor Sheev Palpatine of the Republic asked Kenobi and Skywalker to leave so a dispute with Roxuli's government could be fixed by the Jedi Master, which saddened Pakmillu, as he wanted them to experience entering a new galaxy. Kenobi and Skywalker then left the expedition. At that time, C'baoth and the Jedi aboard had taken control of the starship, making Pakmillu's authority non-existing.\nAfterward, Chiss Force Commander Mitth'raw'nuruodo with the Core name \"Thrawn\" brought Outbound Fligt out of hyperspace with a gravity well projector, Pakmillu was present at the bridge. Although the Chiss attempted to negotiate with Outbound Flight so the starship would not pass across the alien's territory—although the Chiss wanted to destroy it so Outbound Flight did not bring the Extra-galactic \"Far Outsiders\" into the galaxy—C'baoth ignored the Chiss, which forced the Chiss to destroy Outbound Flight. Thrawn bombarded the Outbound Flight with his droid starfighters and used radiation bombs to kill every passenger aboard Outbound Flight. During the bombardment, Pakmillu was slain.\nPakmillu was a male member of the Mon Calamari species, he was calm and intelligent.\nThe Mon Calamari was able to pilot starships, even the likes of Outbound Flight, as well as being able to lead thousands of people in a starship.\nPakmillu appeared in the 2007 novel Outbound Flight written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Outbound_Flight",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Judicial_Department/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Judicial_Forces/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Roxuli/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jorus_C%27baoth",
  "/wiki/Rodian/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Force_Commander",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Core_name/Legends",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/The_galaxy/Legends",
  "/wiki/Bombardier/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Radiation_bomb",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Dreadnaught-One",
  "/wiki/Fleet/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Turbolift/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Vergere",
  "/wiki/Extra-galactic",
  "/wiki/2007",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/Timothy_Zahn",
  "/wiki/Outbound_Flight_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/32_BBY/Legends"
 ]
}