{
 "name": "Paladius",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireSphere of Ancient Knowledge",
      "Sphere of Ancient Knowledge",
      "Cult of the Screaming Blade"
     ]
    }
   ]
  }
 ],
 "content": "Paladius was a Sith Pureblood male and a renegade Sith Lord of the resurgent Sith Empire during the Cold War. He established his own cult on Nar Shaddaa and possessed one of Tulak Hord's artifacts.\nInitially, Lord Paladius led an undistinguished career as a charismatic, but petty Sith Lord. Because he had been uninterested in conquest or the pursuit of dark secrets of the Force, he left Imperial space for Nar Shaddaa.\nThere he found countless downtrodden people who were easy to manipulate. Greatly benefiting from their zealous devotion, he established his own Cult of the Screaming Blade.\nWhen Darth Zash sent her apprentice, Kallig, to Nar Shaddaa, Paladius encountered them. With the help of Rylee Dray and Destris Veran, they managed to infiltrate Paladius's rally. Paladius ordered his cultists to attack Kallig, but they were defeated. Afterwards, Paladius contacted Kallig and said he would give Kallig the artifact without any further confrontation. Kallig, along with Dray and Veran, visited Paladius's main base. When they arrived, Paladius calmly offered Kallig a drink, but it was quickly revealed that it was all a trap. Paladius had severed Kallig's connection to the Force and attacked the young Sith. However, Paladius was overwhelmed and defeated by Kallig. Paladius immediately offered his complete loyalty to Kallig. Veran and Dray protested, but Kallig betrayed them and killed Veran by throwing him off the main platform of the base. Paladius then assured Dray that she would survive, but be punished. Dray attempted to flee, but Paladius killed her with Force lightning. Kallig then left Paladius in charge of the cult in their name.\nWhen Moff Pyron contacted the now Lord Kallig, Pyron agreed to side with him against Darth Thanaton if Kallig could deliver him the CN-12 sensor chip. He told Kallig that his cult on Nar Shaddaa would be able to assist. Kallig met with his cult on Nar Shaddaa, where Paladius welcomed them and assured them they were the future of the Sith. When Kallig asked if he had any CN-12 chips, Paladius answered that the Veil had bothered them and made them temporarily unavailable. Kallig then traveled to the Veil's safehouse, where three men all claimed to be \"the Veil\". They wanted Kallig to hand the cult over to them and Kallig would gain many members of the Veil as his servants across the galaxy. Kallig was not fooled, however and killed them all. Kallig returned to Paladius, who greeted him and thanked him. Kallig then told Pyron of his success.\nPaladius was among those who swore their loyalty to Darth Nox when they ascended to the Dark Council.\nPaladius was capable of using Force lightning and Force push. It is hinted during his conversation with Kallig that he could also use Force choke.\nPaladius had a special ability that allowed him to drain the essence of other beings in his immediate vicinity. He also could disrupt their connection to the Force. He relied heavily on this ability.\nDespite how overweight he was, Paladius still had some skill with a lightsaber, as he was confident enough in his skill that he could beat Kallig, who had had his connection to the Force disrupted. In spite of this, Kallig still defeated Paladius.\nThe player can also choose to kill Paladius and hand the cult over to Dray and Veran.\nIf Paladius is spared and the player later agrees to let the Veil takeover the cult, Paladius is shocked and scolds the player for letting their power go to their head. He tells Kallig that they should be taught a lesson, Paladius then attacks the player, but he was defeated for a second time and killed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sphere_of_Ancient_Knowledge",
  "/wiki/Cult_of_the_Screaming_Blade",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Tulak_Hord",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Darth_Zash",
  "/wiki/Darth_Nox",
  "/wiki/Rylee_Dray",
  "/wiki/Destris_Veran",
  "/wiki/The_Force/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Valion_Pyron",
  "/wiki/Darth_Thanaton",
  "/wiki/CN-12_sensor_chip",
  "/wiki/The_galaxy/Legends",
  "/wiki/Dark_Council",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_drain/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Paladius",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}