{
 "name": "Palabar",
 "display_name": "Palabar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Palabar was a male Quarren slave shortly after the Battle of Endor. He and his fellow slaves, the Weequay Hatchet and the Wookiee Greybok took opportunity of the Battle of Sevarcos to rise up against their Imperial and Zygerrian slave masters and free several rancors, which turned the battle's tide in favor of the New Republic. Later, Palabar and his companions were recruited by the Zabrak bounty hunter Jas Emari for the liberation of Kashyyyk\nPalabar was a male Quarren who lived during the Age of the Empire. In 4 ABY, Palabar worked as a slave miner in the spice mines of the planet Sevarcos. Palabar and the other slaves were mistreated by their Imperial and Zygerrian slave masters. He was so traumatized that he often cowered, nodded, and whimpered in the dark. When New Republic forces attacked their mine, Palabar agreed with the Weequay slave Hatchet that they should take the opportunity to run away. Greybok disagreed and urged them to stand and fight despite having only one arm.\nWhen Hatchet disagreed with Greybok, Palabar angrily responded that the Wookiee could be right and that they should take their chance to fight against their slavemasters. Led by Greybok, the three slaves headed to the corral and proceeded to free the three captive rancors. The freed rancors then scattered the Imperial forces, turning the tide of the battle in the New Republic's favor. Following a struggle between Greybok and a Zygerrian slaver, Hatchet killed the slaver. After learning that the New Republic soldiers had won, Palabar asked what would happen now. A female New Republic soldier subsequently informed that that they were now free.\nFollowing their emancipation, Palabar, Hatchet, and Greybok became smugglers. In 5 ABY, the three former slaves were recruited by the Zabrack bounty hunter Jas Emari for Han Solo and Chewbacca's campaign to liberate the Wookiee homeworld of Kashyyyk from the Empire. During the attack on Camp Sardo, Palabar conceived of a plan to climb the wroshyr trees by anchoring massive eyebolts into the wood with pneumo-hammers. This allowed Solo and his team to take up position so that they could destroy the camp's deflector shield generator.\nAfter the former Imperial loyalty officer Sinjir Rath Velus disabled the inhibitor chips controlling the Wookiees, Palabar and his fellow slaves manned the guns aboard Jas Emari's gunship Halo. They attacked Imperial forces including forest troopers, LAIT gunships, and Imperial walkers.\nPalabar was a male Quarren with a tentacled face. Due to the harsh and dry environment on Sevarcos, his tentacled face was chapped, chafed, and peeling. Due to his maltreatment, he was so traumatized that he often cowered, nodded, and whimpered in the dark. Despite his traumatize state, Palabar mustered enough courage to support Greybok in helping the New Republic defeat their Imperial and Zygerrian slavers. While he was scared of combat, Palabar was tech-savvy and good with technology. He came up with the idea of using pneumo-hammers to hammer eyebolts into wroshyr trees so that Han and his team could take up position and destroy Camp Sardo's shield generator.\nPalabar first appeared as a minor character in Chuck Wendig's 2015 novel Aftermath and its 2016 sequel Aftermath: Life Debt. His lines are told from the point of view of the Wookiee Greybok.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Quarren",
  "/wiki/Gender",
  "/wiki/Slavery",
  "/wiki/Battle_of_Endor",
  "/wiki/Weequay",
  "/wiki/Hatchet_(slave)",
  "/wiki/Wookiee",
  "/wiki/Greybok",
  "/wiki/Battle_of_Sevarcos",
  "/wiki/Zygerrian",
  "/wiki/Rancor",
  "/wiki/Zabrak",
  "/wiki/Bounty_hunter",
  "/wiki/Jas_Emari",
  "/wiki/Liberation_of_Kashyyyk",
  "/wiki/Kashyyyk",
  "/wiki/Imperial_Era",
  "/wiki/4_ABY",
  "/wiki/Spice",
  "/wiki/Mining",
  "/wiki/Sevarcos",
  "/wiki/Galactic_Empire",
  "/wiki/New_Republic",
  "/wiki/New_Republic_soldier",
  "/wiki/5_ABY",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Camp_Sardo",
  "/wiki/Wroshyr_tree",
  "/wiki/Pneumo-hammer",
  "/wiki/Deflector_shield_generator",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Halo",
  "/wiki/Forest_trooper",
  "/wiki/Low-altitude_Imperial_transport",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(novel)",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}