{
 "name": "Palejo_Reshad",
 "display_name": "Palejo Reshad",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Palejo Reshad was a male native of the planet Corellia. He worked as a spice trader, and operated out of his homeworld's city of Bela Vistal. Sometime after the year 0 BBY, Reshad was doing trading business with associates of the crime lord Shalera the Hutt when he was blackmailed by a man who recorded the conversation. Reshad did not want to pay the blackmailer, and he hired a spacer to kill him. In 4 ABY, Reshad was affiliated with the crime lord Jabba the Hutt on the planet Tatooine, and he made a large profit selling spice in the Hutt's court. He secretly used part of it to fund the Alliance to Restore the Republic. That year, Reshad was present in the Hutt's palace when several allies of Jabba's prisoner Han Solo arrived to bargain for his freedom, for which Jabba eventually sentenced them to die at the Great Pit of Carkoon.\nThe Human male Palejo Reshad hailed from the planet Corellia. He was a spice trader who operated out of Bela Vistal, a mountain city located on his homeworld.\nSometime after 0 BBY, Palejo Reshad operated out of a cantina in Bela Vistal. While there, he did trading business with associates of the crime lord Shalera the Hutt. After one of their meetings, Reshad was blackmailed by a man who overheard and recorded their conversation. Reshad did not notice the man until after he concluded his business. Instead of paying the blackmailer, Reshad instead wished to eliminate him.\nFortunately for Reshad, he encountered a spacer who was willing to help. After Reshad explained his plight, the spacer set out to find the blackmailer in the surrounding mountains of Corellia. The spacer found and killed the blackmailer. The spacer then returned to Reshad and was awarded with 500. Reshad thanked the spacer, and assured himself that he would be more careful about where he conducted his business.\nBy 4 ABY, Reshad was affiliated with the crime lord Jabba the Hutt's criminal empire on the planet Tatooine. He made a large profit by selling spice in Jabba's court, and secretly used part of this profit to fund the Alliance to Restore the Republic. That year, Reshad was present in the audience chamber of the Hutt's palace when the droids R2-D2 and C-3PO arrived in order to bargain for their master Luke Skywalker's friend Han Solo, who was frozen in carbonite and hung on display in the palace. Shortly afterward, Reshad watched as Jabba dropped his slave dancer Oola into the pit of his rancor.\nA short time later, Reshad was still in the audience chamber when Leia Organa, another of Solo's allies, arrived in the disguise of the bounty hunter Boushh. Organa had come with the Wookiee Chewbacca as her alleged \"prisoner,\" and threatened to destroy the palace with a thermal detonator. Organa won Jabba's favor, but later rescued Solo and attempted to escape the palace with him, for which they were caught and imprisoned. Skywalker himself then arrived to demand their release, and Reshad witnessed Jabba subsequently drop him down into the rancor pit. However, Skywalker killed Jabba's rancor, prompting the Hutt to sentence him, Solo and Chewbacca to death in Tatooine's Great Pit of Carkoon.\nPalejo Reshad insisted that he operated mostly within the law. However, he took part in illegal activities, and was eager to eliminate the blackmailer who had recorded an illicit conversation between himself and Shalera's associates. He had no issue with killing those who got in the way of his business, and he even used the help of a spacer into whom he happened to run in that regard. When the spacer succeeded in killing the blackmailer, Reshad was thankful, and made it clear that he would seek the spacer's help again if he ever needed it. During Reshad's time selling spice in Jabba's palace, he funded the Alliance to Restore the Republic with part of his profits. Reshad had fair skin, brown hair and gray eyes. During the time he interacted with the spacer following his dealings with Shalera, Reshad wore his hair in a mohawk.\nPortrayed by an uncredited extra, Palejo Reshad first appeared in 1983's Star Wars: Episode VI Return of the Jedi as a background character during the scenes in Jabba's palace. In 1998, he was given a name, and his backstory was slightly expanded, in the Jabba's Palace Limited set of the Star Wars Customizable Card Game. According to a Star Wars CCG fan site, Palejo Reshad was named as an anagram of Decipher employee Joseph Alread.\nReshad appeared as a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. Players who performed a single quest for Reshad had to kill a blackmailer outside of town. Although the player could choose not to do Reshad's quest, this article assumes 100% game completion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Corellian/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/City/Legends",
  "/wiki/Bela_Vistal/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Shalera",
  "/wiki/Hutt/Legends",
  "/wiki/Unidentified_blackmailer",
  "/wiki/Spacer/Legends",
  "/wiki/Death/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Prisoner/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Siege_of_Jabba%27s_Palace",
  "/wiki/Great_Pit_of_Carkoon/Legends",
  "/wiki/Mountain/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Canon",
  "/wiki/Credit",
  "/wiki/Droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Oola/Legends",
  "/wiki/Jabba%27s_rancor",
  "/wiki/Time/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boushh/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Rescue_of_Han_Solo/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/1998",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Tuckerization",
  "/wiki/Decipher,_Inc.",
  "/wiki/Joseph_Alread",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Inside_the_Worlds_of_Star_Wars_Trilogy",
  "/wiki/Star_Wars:_Complete_Locations_(2005)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/August_15",
  "/wiki/2005",
  "/wiki/April_6",
  "/wiki/2016",
  "/wiki/June_27",
  "/wiki/March_24",
  "/wiki/StarWars.com"
 ]
}