{
 "name": "Palfa",
 "display_name": "Palfa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 BBY",
      "Cynda"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cyndan Mining Guild"
     ]
    }
   ]
  }
 ],
 "content": "Palfa was a male Neimoidian who acted as director of the Cyndan Mining Guild during the time of the Galactic Empire. He was in charge of supervising the Guild's mining operations on Gorse's moon Cynda, which was rich in thorilide deposits. When Palfa objected to the Imperial Count Denetrius Vidian's dismissal of elderly workers, Vidian beat the Neimoidian to death with his cybernetic hands.\nPalfa served as the Director of the Cyndan Mining Guild during the Age of the Empire. In 11 BBY, eight years after the establishment of the Galactic Empire, Palfa was the leader of a delegation of mining firm representatives that greeted the Imperial Count Denetrius Vidian, the Emperor Palpatine's economic efficiency expert who had been sent to the Gorse system to speed up production of thorilide. Palfa greeted the Count and accompanied him on his tour of the Cynda mine. While Palfa was a big fan of Vidian's management philosophy, the workaholic Count did not even bother to return his greeting.\nThroughout the inspection, Palfa was confounded by Vidian's efficiency and ruthlessness. After the Count reprimanded for doubling his company's work pace on short notice, he reluctantly accepted Vidian's proposal to create morale officers for each work crew. After Vidian ordered him to apply age caps on all laborers, Palfa, who felt that the workers were still productive, attempted to suggest an alternative and was beaten to death by Vidian in front of his stormtrooper escort. Vidian announced to the stunned witnesses that Palfa's death was an industrial accident and moved on. Later that night, Vidian erased his recording of his murder of Palfa.\nAs Director of the Cyndan Mining Guild, Palfa occupied a management position and was a fan of Count Vidian's management philosophy. Prior to Vidian's inspection of the Cyndan mines, Palfa doubled his company's production pace in a vain attempt to please Vidian. However, Vidian saw through his subterfuge by consulting his reports via life feed. While Palfa reluctantly acceded to Vidian's request to create morale officers for his work crew, he disagreed with the Count's decision to place an age cap on all workers. For his dissent, he was brutally murdered by Vidian; who was preoccupied with increasing economic productivity.\nPalfa first appeared as a supporting character in John Jackson Miller's 2014 novel A New Dawn, the first in a line of new canon literature produced in consultation with the Lucasfilm Story Group.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/11_BBY",
  "/wiki/Cynda",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cyndan_Mining_Guild",
  "/wiki/Director",
  "/wiki/Time",
  "/wiki/Galactic_Empire",
  "/wiki/Gorse",
  "/wiki/Thorilide",
  "/wiki/Count",
  "/wiki/Denetrius_Vidian",
  "/wiki/Imperial_Era",
  "/wiki/Standard_year",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Gorse_system",
  "/wiki/Morale_officer",
  "/wiki/Stormtrooper",
  "/wiki/Death",
  "/wiki/John_Jackson_Miller",
  "/wiki/2014",
  "/wiki/A_New_Dawn_(novel)",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/A_New_Dawn_(audiobook)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope"
 ]
}