{
 "name": "Palo_Jemabie",
 "display_name": "Palo Jemabie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 46 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Legislative Youth Program",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Palo Jemabie was a human male from Naboo. As a teenager, he was involved in the Legislative Youth Program alongside Padmé Amidala, with whom he fell in love. The two ended their relationship when Jemabie became an artist, while Amidala pursued a career in politics. After the Galactic Republic was replaced by the Galactic Empire, Jemabie was sentenced to a labor camp before eventually joining the Alliance to Restore the Republic. Due to his allegiance to the Rebellion, he was abducted by the Imperial Security Bureau before the end of the Galactic Civil War.\nA dark, curly-haired human male, Palo Jemabie hailed from the planet Naboo. He was born over fourteen years before the invasion of his homeworld by the Trade Federation. As a teenager, Jemabie participated in the Legislative Youth Program, where he met a twelve-year-old girl by the name of Padmé Naberrie. The two had a brief relationship, but ultimately parted ways when Jemabie elected to become an artist, while Naberrie began a career in the public service.\nWhen Naberrie was elected Queen of Naboo at age fourteen under the regnal name of Amidala, Jemabie created a poster entitled Naboo Coronation, inviting the Naboo to the inauguration of their new monarch that was set to take place on the 34th of Grizm, 835th Year of Kwilaan.\nShortly before the onslaught of the Clone Wars in 22 BBY, Amidala spoke fondly of her young romance with Jemabie to her future husband, the Jedi apprentice Anakin Skywalker. As they were sharing a moment in the idyllic countryside of Naboo, Amidala reminisced about her first love in detail, prompting Skywalker to react with mild jealousy.\nAt the conclusion of the Clone Wars in 19 BBY, the democratic Galactic Republic was replaced by the Galactic Empire, an authoritarian regime created by Galactic Emperor Sheev Palpatine, former Supreme Chancellor of the Republic. During the reign of Palpatine's New Order, Jemabie was sentenced to work in a labor camp. After achieving his freedom, he allied himself with the anti-Imperial Alliance to Restore the Republic, using his skills as an artist to create posters for the resistance movement. The Naboo artist, however, would be captured and disappeared by the Imperial Security Bureau before the end of the Galactic Civil War.\nPalo was first mentioned in the 2002 film Star Wars: Episode II Attack of the Clones, the second installment in the prequel trilogy of Star Wars.\n He was originally set to return as Amidala's love interest in \"Senate Spy,\" the fourth episode in season two of the Star Wars: The Clone Wars television series, but this idea was abandoned early on when the crew remembered that Palo had left politics to become an artist. The show's creators also felt that the relationship between Amidala and the \"Senate Spy\" character needed to be more recent than the one between her and Palo, so that the theme of Anakin Skywalker's jealousy would be better supported. Palo's role as love interest was thus assumed by a new character, Rush Clovis.\nIn his 2016 reference book Star Wars Propaganda: A History of Persuasive Art in the Galaxy, Pablo Hidalgo gave Palo the last name \"Jemabie\" and slightly expanded on his biography.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Palo_Jemabie",
  "/wiki/Palo",
  "/wiki/Palo_(disambiguation)",
  "/wiki/Naboo",
  "/wiki/46_BBY",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Legislative_Youth_Program",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Artist",
  "/wiki/Politics",
  "/wiki/Galactic_Republic",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Labor_camp",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galactic_Civil_War",
  "/wiki/Hair",
  "/wiki/Planet",
  "/wiki/Reproduction",
  "/wiki/Standard_year",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Homeworld",
  "/wiki/Trade_Federation",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Painting",
  "/wiki/Naboo_Coronation",
  "/wiki/Coronation_of_Queen_Amidala",
  "/wiki/Grizm",
  "/wiki/Naboo_calendar",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Clone_Wars",
  "/wiki/22_BBY",
  "/wiki/Marriage",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Lake_Country",
  "/wiki/19_BBY",
  "/wiki/Democracy",
  "/wiki/Dictatorship",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Supreme_Chancellor",
  "/wiki/Imperial_Era",
  "/wiki/New_Order",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars",
  "/wiki/Senate_Spy",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Rush_Clovis",
  "/wiki/2016",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Pablo_Hidalgo",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith"
 ]
}