{
 "name": "Paloma D'asima",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mistryl Shadow Guard",
      "Eleven Elders of the People"
     ]
    }
   ]
  }
 ],
 "content": "Paloma D'asima was one of the Eleven Elders of Emberlene at the time of the Caamas Document crisis.\nOn Karoly D'ulin's recommendation, D'asima met with Moff Disra and Grodin Tierce to discuss a Mistryl Shadow Guard/Imperial Remnant alliance on Yaga Minor. The con-artist Flim, disguised as Grand Admiral Thrawn, was also involved in the negotiations, providing the appearance of confident leadership necessary to make Paloma consider the otherwise unthinkable alliance. Disra and Tierce were aware that Garm Bel Iblis planned an information raid on the Ubiqtorate base on Yaga Minor for a copy of the Caamas Document, and timed the meeting to occur just as his assault commenced, in the hopes that it would prove to D'asima that the Remnant was a serious contender for ultimate controller of the galaxy. Ultimately, however, the meeting was interrupted by the timely arrival of Admiral Gilad Pellaeon, who revealed Disra's shady financial connections, Tierce's clone heritage, and \"Grand Admiral Thrawn's\" true identity, destroying the alliance before it even began.\nSeeing how close she had come to allying the Eleven, and the Mistryl, with a con man, D'asima reluctantly acknowledged Shada D'ukal's role in averting the disaster, and agreed to lift the death warrant issued against her, although Shada's exile from Emberlene remained permanent.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mistryl_Shadow_Guard",
  "/wiki/Eleven_Elders_of_the_People",
  "/wiki/Emberlene",
  "/wiki/Caamas_Document",
  "/wiki/Karoly_D%27ulin",
  "/wiki/Moff/Legends",
  "/wiki/Vilim_Disra",
  "/wiki/Grodin_Tierce",
  "/wiki/Imperial_Remnant",
  "/wiki/Yaga_Minor/Legends",
  "/wiki/Flim",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/Ubiqtorate/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Shada_D%27ukal",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}