{
 "name": "Palpatine family",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Family type",
     "values": [
      "Nobility"
     ]
    },
    {
     "name": "Species",
     "values": [
      "Human",
      "Cloned strandcasts",
      "Cloned strandcasts"
     ]
    },
    {
     "name": "First member(s)",
     "values": [
      "Sheev Palpatine"
     ]
    },
    {
     "name": "Relatives",
     "values": [
      "Miramir's family"
     ]
    },
    {
     "name": "Planet(s) of origin",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "Coruscant",
      "Exegol",
      "Hyperkarn",
      "Jakku"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Prominence",
     "values": [
      "32 BBY–4 ABY",
      "34 ABY",
      "–35 ABY"
     ]
    },
    {
     "name": "Fragmented",
     "values": [
      "21 ABY"
     ]
    },
    {
     "name": "Extinction of family name",
     "values": [
      "35 ABY"
     ]
    },
    {
     "name": "Affiliation",
     "values": [
      "Sith",
      "Royal House of Naboo",
      "Galactic Republic",
      "Naboo delegation",
      "Office of the Chancellor",
      "Naboo delegation",
      "Office of the Chancellor",
      "Trade Federation",
      "Confederacy of Independent Systems",
      "Galactic Empire",
      "First Order",
      "Resistance",
      "Jedi Order",
      "Sith Eternal"
     ]
    }
   ]
  }
 ],
 "content": "The Palpatine family, also known as the Palpatine bloodline or House Palpatine, was a dynastic noble human family originally from the planet Naboo in the Mid Rim Territories of the galaxy. A member of the family, Sheev Palpatine, rose to prominence through galactic politics. During the Republic Era, Palpatine represented the people of Naboo as a senator in the Galactic Senate prior to his election as Supreme Chancellor of the Galactic Republic in 32 BBY. Unbeknownst to the public, Palpatine was Darth Sidious, the Dark Lord of the Sith. The heir to Darth Bane's legacy, Sidious endeavored to finish the work of generations of Sith Lords by destroying their adversary, the Jedi Order, and restoring the Sith to power. He was the mastermind behind the Invasion of Naboo, the Separatist Crisis, and the Clone Wars—conflicts designed to facilitate Sidious' rise to power. In 19 BBY, Sidious systematically exterminated the Jedi for treason before claiming the title of Galactic Emperor, transforming the Republic into the Galactic Empire. From then on Sidious ceased to live a double life; the name of Palpatine was largely forgotten during the Imperial Era, and the galaxy came to know him simply as \"the Emperor.\"\nObsessed with eternal life, Sidious revived himself after his first death in 4 ABY. Through the dark side of the Force, he transferred his essence to a clone of his original body, although the new vessel proved unstable. Using the Emperor's genetic material, the Sith Eternal engineered various failed attempts to create a stronger host body. One byproduct of the Sith cult's experiments was Dathan, an artificial strandcast engineered from Sidious' genetic template. Although Dathan was Sidious' clone and genetic son, he did not possess his father's strength with the Force. However, in 15 ABY, Dathan sired a Force-sensitive daughter, Rey, with his wife Miramir. Sidious regarded his granddaughter as the ideal host for his spirit, but his plans were thwarted by Dathan and Miramir, who sold Rey to Unkar Plutt on Jakku to ensure her safety. Dathan and his wife were subsequently killed by Sidious' assassin, Ochi, in 21 ABY.\nIn 35 ABY, Sidious announced his return to the galaxy at the time of the First Order-Resistance War. By then, the Sith Eternal's fleet, the Final Order, was completed and ready to depart from Exegol. During the Battle of Exegol, he attempted to convert his granddaughter to the dark side, telling Rey that it was her birthright to rule the galaxy as an empress and heir to the Palpatine bloodline. The Jedi apprentice rejected her grandfather and ultimately destroyed him with the help of Ben Solo and the spirits of the Jedi from the past, ending both Sidious and his goal of ruling a new Sith Empire for an eternity.\nWealthy and influential, House Palpatine was a dynastic, noble family that belonged to the affluent class of society. One of the oldest, most prestigious and influential houses among the Naboo people, their ancestral home was the Convergence in the Lake Country area on the planet Naboo, which was located in the galaxy's Mid Rim Territories.\nNaboo became a member world of the Galactic Republic in 867 BBY. The Naboo commemorated the union of their homeworld and the Republic through an annual event known as the Festival of Light. In 20 BBY, eight-hundred and forty-seven years after Naboo was admitted to the Republic, the festival was hosted by Supreme Chancellor Sheev Palpatine amidst the pan-galactic Clone Wars.\nBorn in 82 BBY, the human Dark Lord of the Sith Darth Sidious was born into the nobility on the affluent planet Naboo as Sheev Palpatine and became its most prominent member as his life carried on. During his youth, Palpatine lived in the capital city of Naboo, Theed, where he formed connections with a reputable host of credible politicians produced over the centuries. As a result, he gained a great amount of knowledge on governance and the subtleties of power. He slowly but surely rose in political power, having been skilled in manipulation since his boyhood. With the support of his Sith Master, Darth Plagueis, Sidious—in his public identity of Palpatine—rose to become senator of the Chommell sector in the Galactic Senate, which made him representative for a total of thirty-six planets.\nSidious and Palpatine were two personas of the same individual, cultivated to achieve the Grand Plan of the Sith Order. Palpatine served in the Senate as the senator of Naboo during the final years of the Republic Era, and was generally seen by the public as an \"honest and trustworthy servant of the people.\" Padawan Anakin Skywalker called Palpatine \"a good man\" who did not appear to be corrupted by politics, which was the reputation of the Senate at the time. Contrary to Skywalker's view of the chancellor, Jedi Knight Obi-Wan Kenobi, who was distrustful of politicians, observed Palpatine to be a skilled manipulator. In his secret life as a Sith Lord, Sidious was trained to use the dark side of the Force by Darth Plagueis. In time, he replaced his Sith Master by killing Plagueis and taking Darth Maul as his Sith apprentice in accordance with the Rule of Two.\nSenator Palpatine was a trusted advisor of Queen Padmé Amidala, the young elected Monarch of Naboo at the time of the Invasion of Naboo in 32 BBY. Sidious had orchestrated the blockade and invasion of his homeworld by the Trade Federation in order to gain support in the Senate. Although the Trade Federation Droid Army was defeated by the Royal House of Naboo and the Gungan Grand Army, Palpatine succeeded in replacing Finis Valorum as the Supreme Chancellor of the Galactic Republic. By then, Sidious began training Count Dooku—a fallen Jedi who secretly adopted the identity of Darth Tyranus—as his new apprentice, believing at the time that Maul had died in the Battle of Naboo.\nAs leader of the Senate, Chancellor Palpatine became increasingly popular while guiding the Republic through times of conflict, in particular the Separatist Crisis and the Clone Wars, both of which he secretly engineered as a Sith Lord. The Galactic Constitution was amended multiple times during Palpatine's chancellery, allowing him to remain in office beyond its constitutional limits and empowering the executive branch with emergency wartime powers. Three years of constant warfare disrupted a millennium of peace; as such, Republic citizens willingly supported the chancellor's increased authority at the cost of their liberties.\nShortly after the Battle of Coruscant in 19 BBY, Palpatine revealed his secret identity to the Jedi High Council, resulting in a confrontation which he used as a pretext for the Great Jedi Purge. At the same time, Sidious took Darth Vader as his new Sith apprentice, having successfully turned Anakin Skywalker to the dark side of the Force. The Sith's thousand-year revenge plot was achieved with the Jedi Order effectively destroyed through Order 66, after which Sidious issued the proclamation of the New Order, declaring himself Galactic Emperor. The Republic consequently ceased to exist at that point, replaced by the New Order of the Galactic Empire.\nAlthough the Emperor retained his public identity, he ceased his efforts to maintain two personas and was thenceforth Darth Sidious \"in thought and action.\" The name of Palpatine was largely forgotten during the Imperial Era. It was by the title of Emperor that Sidious was known to the galaxy's population. In addition to his desire for power, Sidious was obsessed with immortality and devoted his reign to achieving this goal through further study of the dark side, withdrawing from public life in the process.\nSidious remained virtually unchallenged as Emperor for nearly two decades, and though he brought peace like promised, it was through a brutal repression. In that time he consolidated his reign over the galaxy by eliminating rivals and directing the Imperial Military to conquer planets beyond the Empire's frontier. During his reign, he also constructed a base of power on the hidden Sith planet of Exegol, reading the ancient Throne of the Sith within the Citadel on the world's surface to mark in plans to make the location his permanent seat of power.\nAlhough Sidious held absolute power in a sovereignty position, he allowed the Imperial Senate to remain in place for most of his rule, constituting one of the last remnants of the Old Republic. Ultimately, the Senate was truly preserved by Sidious in order to make Imperial worlds believe that they still had a part to play in the government, though secretly he planned to dissolve since his rise to power, needing them until a superweapon, the Death Star, was complete and he could rule through sheer terror.\nSidious designated the enforcing of his will to his underlings, such as his apprentice Darth Vader, and other high ranking generals during his withdraw from the public view. With the Dissolution of the Imperial Senate in 0 BBY, Grand Moff Wilhuff Tarkin and the regional governors were free to exercise full authority over their territories on the Emperor's behalf.\nHowever, Sidious' subjugation of the galaxy culminated in the Alliance to Restore the Republic, a faction opposing his reign as Galactic Emperor, leading to the destruction of the first Death Star by the Rebel Alliance. The battle station's destruction was seen as a significant loss by the Emperor, who had neither a ceremonial Senate to keep the star systems in line nor a superweapon to enforce his rule. For the next five years, the Galactic Civil War would rage, and Sidious was determined to quell any threat to his reign with the aid of his enforcer Vader.\nDathan was an artificially constructed strandcast and the lone specimen that lived through the cloning process. Created in 12 BBY during the reign of his progenitor, he was engineered from the Emperor's cloned tissue samples and blood cells donated from other genetic sources. While not entirely identical in appearance to that of his donor, the strandcast was thriving in health. Little was known of his life, but the boy was the genetic \"son\" of the Emperor. However, Sidious found his son to be a source of much disappointment. Despite having the Palpatine family blood rushing through his veins, the unnamed strandcast—known only as \"the Abomination\" throughout his youth demonstrated no Force-sensitivity like his father. Sidious, who relished his power in the Force, was ultimately disgusted with the son that he sired through science. The name of the Emperor's son was lost to history, in addition the reason he survived, by neglect or purpose, being unknown.\nDisdaining the boy for his ordinariness, the Sith Lord effectively rejected the \"inferior child\" spawned from his flesh, shunning and deeming him unworthy of inheriting his legacy. Despite this, Sidious chose to allow his son to continue living, surmising the fact that his Palpatine blood rushing within the useless clone's veins would at some point prove to be useful. What the Emperor intended for his son was to continue living for the sake of continuing the Palpatine bloodline, hoping to achieve more favorable results of producing a cradle for his essence through more natural methods.\nIn addition to not inheriting his donor's sensitivity to the Force, the cloned son's character was vastly different as well, for he desired the life of an ordinary man with a family. Despite being cloned from the Sith Lord who masterminded the fall of the Galactic Republic and ruled the galaxy through his Galactic Empire through fear, in return for his own rejection, the clone boy shunned his father and the ways of his Sith Order.\nWithin a generation of his accession, the Emperor's reign ended with his death in the Battle of Endor in 4 ABY. Although Sidious had long suspected his apprentice's capacity for betrayal, Vader acted sooner than the Emperor anticipated, sacrificing his life to save Luke Skywalker, his son who rejected the dark side and became a Jedi Knight. Vader died as Anakin Skywalker, achieving redemption in the light side of the Force and fulfilling his destiny as the Chosen One, while the Emperor was physically destroyed as a result of Vader's actions. The destruction of both Sith Lords marked the end of the Sith lineage from Darth Bane to Darth Vader.\nAs the New Republic gained momentum in the Galactic Civil War, it was believed that the Emperor had no living relatives, and consequently there was no clear chain of succession, leading to the Empire's defeat and capitulation in the Galactic Civil War. Unbeknownst to the Empire, its downfall was engineered by the Emperor who considered his death as evidence that the Empire was a failed state. The Emperor's protégé, Fleet Admiral Gallius Rax, was entrusted with the task of ensuring that the Empire did not survive its founder. Various worlds were targeted for devastation under Operation: Cinder, including the Emperor's homeworld of Naboo and the Imperial loyalist world of Vardos. The Empire effectively ceased to exist after signing the Galactic Concordance, reduced to a rump state in the Core Worlds and Inner Rim Territories.\nDestroying the Galactic Empire through Operation: Cinder was only part of the Contingency, the overall plan of which was to build a new empire in the Unknown Regions. During the New Republic Era, the First Order was formed by Imperial officers, nobles, and technologists. As such, the First Order was modeled on the principles of the Old Empire and therefore sought to reclaim the Imperial legacy by overthrowing the New Republic. In time, the Centrists—political adversaries of the Populists in the New Republic Senate—broke away from the New Republic and officially joined the First Order, marking the organization's official formation as a polity in 29 ABY.\nAlthough Sidious achieved the goal of galactic domination set by generations of Sith Lords, he was unwilling to die or be replaced in spite of Sith tradition. Determined to become immortal, he used unnatural methods to preserve his consciousness after death. Utilizing modified cloning technology and the knowledge that Sidious gained during his apprenticeship to Darth Plagueis, the combination of modern science and arcane Sith sorcery resulted in his resurrection on the Sith world of Exegol, where his consciousness transferred to a clone of his original body. Due to using an imperfect cloning process, however, Sidious' host body rapidly deteriorated. In order to survive, Sidious was forced to rely on life support devices, such as an ancient Ommin harness and vials of restorative fluid, as well as his Sith cult, the Sith Eternal, that sought to prevent the Emperor from dying permanently.\nSnoke was a humanoid genetic strandcast who originated from the Sith Eternal's experiments conducted to produce a new vessel for the Emperor's spirit. He was created by the cultists as one the earliest attempts at engineering a superior clone body to the one inhabited by Sidious' consciousness. Despite his damaged and scarred body and the difficulty behind cloning a force-sensitive, Snoke was naturally strong with it and obtained mastery over the dark side. However, his body, though strong in the Force, was nevertheless rejected by Sidious, who regarded the strandcast as another \"unworthy\" host for his essence.\nRegardless of being discarded as a potential replacement vessel for Sidious' consciousness, Sidious elected to utilize Snoke as a proxy; under Sidious' influence, Snoke transformed the First Order into a powerful military force following his rise to power as Supreme Leader. Despite his self-appointed title, Snoke was a figurehead whom Sidious used to control the First Order, and though he had free will, his personality was influenced by Sidious nonetheless. Snoke's knowledge and power saved the First Order from certain destruction and made him the undisputed heir for the Emperor's contingency. However Snoke's mysterious nature made even the highest echelons of the First Order oblivious to their new leader's origins, who denied any connection to the Sith lineage and was more prone to concentrate on spiritual matters instead of trivial propaganda matters and allowed the generals to wield the First Order military in his name. However, this led some, like Enric Pryde, to suspect that Snoke himself was subservient to a higher power.\nIn addition to restoring himself to power, Sidious sought to convert the next generation of the Skywalker family to the dark side of the Force. Sidious also utilized Snoke as his proxy for such an endeavor. Therefore, Snoke was designed by the Sith Eternal cultists to mold Ben Solo, the son of Princess Leia Organa and General Han Solo, into an heir that was worthy of the Sith legacy. The grandson of Anakin Skywalker, Ben Solo was born with prodigious strength in the Force as a result of his bloodline. Because of this famous lineage as a Skywalker and power abilities as a Force wielder, Solo became the ultimate prize to both Snoke and his creator, Sidious, who had been manipulating both of the two inferior users of the Force from afar without their knowledge.\nThrough the Force, Sidious watched over Solo throughout his life, using telepathy to communicate with him in several voices, including that of Darth Vader and Snoke as well as his own. Following the destruction of the Jedi Temple of Luke Skywalker, Solo renounced the Jedi Order and adopted the identity of Kylo Ren, becoming the master of the Knights of Ren and a champion of the First Order while apprenticed to Supreme Leader Snoke. Due to the secrecy of Snoke's origins and Sidious' return from death, Ren was unaware that his mentor was only a proxy for his true dark-side master. The Sith Eternal cultists designed Snoke to test Ren's worthiness as a potential heir to the Sith legacy. For Sidious, Snoke's existence allowed the Dark Lord to circumvent the Sith tradition of an apprentice killing his master to achieve ascension in the dark side of the Force.\nDuring the ensuing decades following the Sith Lord's resurrection, the Sith cultists labored to replace Sidious' cloned body with a more suitable host, leading to the experimentation with his genetic template. In the shadows of the Unknown Regions, the Palpatine family bloodline would prosper through modified cloning technology and other traditional, more natural methods.\nUtilizing advanced cloning technology and a variety of dark sciences, in addition to a method known as Strand-Casting, the cultists produced various modified clones of Sidious. The clone offshoots and abominations, however, were all but complete and utter failures, none surviving except for one; The Sith Eternal's cloning efforts, splicing genes and bolstering tissue, were almost entirely in vain, as nothing seemed to work, though a single modified clone managed to live through the experimentation.\nDuring the Era of the New Republic, having rejected his cruel Sith father, the Emperor's son, who had eventually fled away from Exegol to pursue a life apart from the dark side of the Force, took the name \"Dathan\" from a kind Symeong slave. However, through his son, the Palpatine bloodline would prosper, being continued on through more natural methods, as the Sith Lord predicted would happen.\nWhile Sidious had not anticipated his son Dathan's marriage to Miramir, who gave birth to their daughter Rey in 15 ABY, he nonetheless regarded his new grandchild as an opportunity to prolong his existence. Knowing that Rey had inherited his power, Sidious considered her the perfect cradle for his dark consciousness, unlike her powerless father, and was determined to capture her at any cost.\nSidious foresaw what his granddaughter had the capability of becoming; the Sith Lord could sense the strength Rey possessed within the Force, and was aware that such a thing was not ordinary power, but his own. This made him desire to see to it that one day Rey would embrace her destiny and the Palpatine name by inheriting the Sith legacy as his successor.\nRey's parents sought to protect their daughter, however, using their own anonymity to keep their family hidden from the Emperor and his followers. Life was difficult for the poor, frightened couple eking out a meager existence, surviving on the edge of desperation. Dathan and Miramir both died in 21 ABY. Hunted by agents of Dathan's father, the couple fled with their child into Wild Space only to return to Jakku to hide their daughter before being captured by Ochi of Bestoon. The Jedi hunter had been tasked by Sidious to hunt Rey and bring her to Exegol. Though Ochi succeeded in capturing Dathan and his wife, their actions prevented him from finding Rey. As a result, Ochi killed Rey's parents on the Emperor's orders. Deceived by the Aki-Aki beads Miramir had been hiding on her person, Ochi did exactly as she hoped by believing Rey was on the planet Pasaana instead of Jakku below, leading to the assassin's demise in the Forbidden Valley of Pasaana.\nAbandoned on the desert world of Jakku, Rey was raised in the care of a Crolute junk boss, Unkar Plutt, and learned to support herself as a scavenger. By her nineteenth year, Rey had become a capable combatant, mechanic and pilot, but opted to remain on her backwater homeworld due to her childhood dream of reuniting with her family. Unaware of her dormant Force powers, she believed her survival was owed to chance. With nothing but her feelings of isolation and abandonment, she felt utterly alone throughout her years on Jakku, never knowing that she had always been part of a Force dyad—a unique Force-bond connecting her with Kylo Ren across the stars.\nIn 34 ABY, Rey encountered the astromech droid BB-8, and subsequently befriended Ren's father, the smuggler Han Solo, while attempting to return the droid to the Resistance. Though her journey took Rey offworld to Takodana, Rey was determined to return to Jakku, believing her family would eventually return. Solo's contact, Maz Kanata, candidly told Rey that no one was coming back for her.\nFollowing the Battle of Starkiller Base, Rey tracked Jedi Master Luke Skywalker to the lost world of Ahch-To, birthplace of the Jedi Order. While attempting to gain his support in the war between the First Order and the Resistance, Rey discovered that she could commune with Skywalker's nephew and former Jedi apprentice, Kylo Ren, across the galaxy as a result of the bond they shared through the Force. The connection between Rey and Ren caused them to gain deeper insights into one another, with Rey sensing the dark apprentice's internal struggle against the pull to the light. However, the bridging of their minds allowed Ren to discover the insecurities Rey harbored about her past and, in particular, her parents, much to the scavenger's dismay. Although Rey regarded Ren as a monster for committing the act of patricide, Ren believed they shared much in common, with both having been abandoned as children.\nUpon discovering a cave with a strong connection to the dark side, Rey tried to use its powers to discover the identities of her parents. Her efforts ended in failure, leaving Rey distraught and seeking the company of Kylo Ren, whom she now saw as the only person who understood her feelings of isolation and abandonment. Although Rey felt more lost than ever due to her experience in the cave, Ren assured her that she was not alone. Rey responded by reaching out to toych Ren's hand, assuring him that he was not alone either, and that it was not too late for him. They were both amazed by the discovery that they could touch each other through the Force, regardless of the actual light-years separating them.\nConvinced there was still good in the former Ben Solo, Rey confronted him in the flesh and together they overthrew Ren's dark master, Supreme Leader Snoke. Seizing the chance to claim Snoke's mantle as Supreme Leader of the First Order, Ren invited Rey to rule by his side as leaders of a new galactic order. He then compelled Rey to confront her worst fears by admitting the truth she had long suppressed—her parents were nobody and dead. Ren elaborated, telling Rey that they were mere junk traders who bartered their daughter away for drinking money. Ultimately, the two believed the dead bodies were buried in a pauper's grave in the Jakku desert. The revelation brought tears to Rey's eyes, for she sensed no deception in Ren's intentions. Nevertheless, Rey resisted Ren's entreaty and helped the Resistance survive the Battle of Crait. She further hindered Ren's plans by continuing her studies in the Jedi arts, ensuring the Jedi Order would not end with the death of Luke Skywalker.\nDespite the efforts to sustain the Emperor's cloned body, the Sith Eternal cultists were fighting a losing battle to keep Sidious alive. With Snoke's death, however, Ren usurped political and military control of the First Order as the new Supreme Leader. Within a year of Ren's accession, a message was transmitted across the galaxy, broadcasting the voice of Sidious who announced his return and the imminent rebirth of the Sith. This turn of events motivated Ren to seek the phantom Emperor's location, unwilling to tolerate any threat to his reign. Using a Sith wayfinder that once belonged to his grandfather, he made his way to Exegol where he confirmed the existence of the Sith Eternal cult. In addition to learning that the cultists had secretly groomed him as the heir to a new Sith Empire, Ren discovered their various experiments, such as multiple copies of his late Master as well as the decaying clone of the late Emperor.\nRen could sense the essence of Sidious within the clone vessel, but its decrepit condition revealed that the Sith Lord was living on borrowed time. Sidious had made use of that time by overseeing Ren's progression as the heir to the Sith legacy, and commended the young warrior on destroying Snoke. Having molded Ren as a successor and having constructed a fleet—referred to as the Final Order—of Xyston-class Star Destroyers, Sidious declared that Ren would succeed him by ruling over all the galaxy as the new Emperor, on the condition that he kill Rey before she could complete her Jedi training. He also revealed his connection to the Jedi apprentice, informing Ren that Rey was, in fact, his granddaughter.\nRen had been honest with Rey when he told her that her parents were irrelevant, having seen a glimpse of their lives in a vision. He thought little of the poor, frightened couple that initially raised Rey, but her blood relation to the phantom Emperor intrigued Ren. He was now convinced that the dark side was as much a part of Rey's nature as it was with him, pushing Ren to renew his efforts to convert her despite the Emperor's mandate to kill her. During their confrontation on Pasaana, Ren pushed Rey to give in to her anger, resulting in a burst of Force lightning from her hand. After witnessing the demonstration of Rey's capacity for darkness, Ren revealed that the Emperor was not only her grandfather, but that he was also responsible for the deaths of her mother and father. Additionally, Ren made a discovery relating to the bond between him and Rey—they were a dyad, two separate beings who were one in the Force. He kept this information a secret from Sidious, hoping that he and Rey could destroy the Sith Lord and usurp the Throne of the Sith with their combined power.\nDespite all of her training as a Jedi, the revelation of her blood ties to Sidious pushed Rey to give in to her impulses, including the impulse to avenge her parents. Sensing that she was closer than ever to embracing the dark side, Ren goaded Rey in to fighting him in the wreckage of the second Death Star on Kef Bir. However, Sidious' plan was disrupted by the actions of Ren's mother, Leia Organa, who sacrificed her life to restore her son's persona as Ben Solo. During the Battle of Exegol, Sidious urged Rey to succeed him and become \"Empress Palpatine.\" He used Rey's attachment to her friends as leverage in turning her to the dark side. Rey found her grandfather's power intoxicating and was tempted by his offer, believing the galaxy would have no choice but to accept salvation if she became the Empress. In actuality, Sidious planned to transfer his spirit into Rey's body with the aid of a Sith ability he pilfered from Plagueis.\nWith the help of a redeemed Ben Solo, however, Rey defied her grandfather by refusing to kill him in anger, affirming her commitment to the light. Angered at the sight of Solo and Rey standing together as Jedi, Sidious unleashed his power against them, and discovered the truth that Kylo Ren concealed from him—their nature as a dyad in the Force. Realizing the power of their bond could heal his clone body, Sidious restored his strength by almost completely draining both Solo and Rey of their life force. After becoming whole again, he declared his return as the one true Emperor, no longer requiring a host body. Nearly deprived of her power, Rey called on the spirits of all past Jedi to help her defeat Sidious. With their help, she managed to turn the Emperor's newfound power against him, utterly destroying Sidious. The effort killed Rey, however, though Solo found that he had the power to save her from death by sacrificing his life.\nSidious' family, the Palpatine bloodline, was considered to be one of the two most powerful families to ever exist in the galactic history, next to the legendary Skywalker dynasty; Darth Sidious was to be one of most powerful Force-users in galactic history, with no one proving to be his equal in the dark side, for as a Sith Lord, he possessed a very powerful connection to Force that allowed to using various Force powers that were beyond the abilities of even the most powerful Jedi Masters.\nBeing the one who brought the Sith Grand Plan to fruition, Darth Sidious was realized as being greatest Dark Lord of the Sith to ever live afterwards among the order's rankings to Darth Bane himself. Because of Sidious' actions through Order 66 and transforming the Galactic Republic into his Galactic Empire in 19 BBY, even after his second and final death a the hands of his Jedi granddaughter over fifty years year later, the Jedi Order still had not returned to its former glory and remained in ashes. His conquering of the Jedi and subsequent further purging of the survivors and their teachings also led to the near suppression and erasure their history, to a point they were a distant memory from a bygone era and were mythologized and only stories and legends remained.\nAfter Palpatine was revealed as Sidious, he tried to create a dyad with his apprentice, Darth Vader, who was Anakin Skywalker. However, it was unsuccessful. The failure to produce a dyad between the two strongest Force bloodlines led Sidious to doubt whether it was possible for a dyad to exist. However, many years later, a prophecy of a dyad was fulfilled through Sidious' granddaughter, Rey and Vader's grandson, Ben Solo.\nWhile revered by Sith cultists and the fervent supporters of the New Order, Darth Sidious was reviled as a tyrant by the galaxy that he ruled for a generation. The galaxy rejoiced at his first death, and his reign as Emperor was remembered as an \"era of tyranny.\" Sidious' legacy also brought shame to his homeworld, with Queen Sosha Soruna officially denouncing Sheev Palpatine as a \"stain\" to the people of Naboo. Despite the connection between Sidious and Naboo, Princess Leia Organa praised the Emperor's home planet as a world that embodied the best qualities of the former Galactic Republic, and as such invited its government to support the Rebel Alliance as they worked toward the restoration of the Senate and the formation of the New Republic.\nAlthough Rey rejected her grandfather's legacy, she accepted her parents despite remembering very little about them. After learning that they had died while protecting her, Rey used their memory to keep herself anchored to the light, resisting Sidious' efforts to tempt her into surrendering to the dark side.\nAnakin Skywalker's bloodline ended with his grandson, Ben Solo, becoming the last Skywalker. However, Rey decided to adopt \"Skywalker\" as a surname during her visit to Luke Skywalker's childhood home on Tatooine, having rejected her heritage as the granddaughter of a Sith Lord. She kept her origins as a Palpatine a secret, uncertain about what her allies would think if they knew the truth, or if they cared about bloodlines at all. During the fight to restore galactic peace, Rey became a Jedi Master.\nIn the first eight films of the Star Wars saga, there were no hints or references to Sheev Palpatine having relationships or offspring. J.J. Abrams, director of The Force Awakens and The Rise of Skywalker, hinted the revelation that Palpatine was Rey's grandfather in the ninth installment was an early idea when working on the seventh chapter. \"That's not to say there was a bible and we knew what happens at every step,\" he said, \"but when Larry Kasdan and I worked on The Force Awakens, we didn't do it in a vacuum.\" After the release of The Force Awakens, Daisy Ridley, the actress who portrays Rey in the sequel trilogy, recalled feeling surprised that many saw the film and came away speculating about the identity of Rey's parents, explaining, \"I thought a lot was answered in The Force Awakens. Then after the screening, I went for a drink with my agent and everyone, and we were chatting away and I realized that oh, in their minds it's not answered at all!\" She later revealed that Obi-Wan Kenobi was considered as one of the possibilities for her grandfather; According to Ridley, Abrams went back-and-forth on Rey's lineage, even during filming of The Rise of Skywalker, and making her a descendant of Kenobi was still in the mix. She said she wasn't clear on the final decision until the end of filming.\nRian Johnson, the director of The Last Jedi, opted to reveal that Rey did not come from a special bloodline. As a result, her parents were nobodies. In an interview, Johnson stated that it was a dramatic decision of \"What is the toughest thing she could hear about her parents? What is the thing for her and for us what will make her have to stand on her own two feet and will make things the hardest for her?\" After the release of The Last Jedi, Simon Pegg said \"I know what J.J. kind of intended, well, at least what was sort of being chucked around. I think that's kind of been undone slightly by the last one. There was some talk about, you know, a kind of relevant lineage for her. But I honestly don't know, and I don't know if anybody knows. We shall see.\" However, Abrams said he felt The Last Jedi's script \"didn't get in the way of anything Larry and I talked about that I thought I'd get to. There were some very specific things we did get to do in this movie that we were laughing and going, 'Oh my god, we're finally doing that thing we talked about five years ago.'\" He elaborated thematically that \"one of the themes of the movie is that anyone can be anything regardless of where you're from, and I don't know if it resonates for everyone but I think there are quite a few people who appreciate that idea of not coming from a place that you're not particularly excited about following or proud of. And though I completely understand 'you're nobody' is a devastating thing, to me the more painful, the more shocking thing was the idea that you're from the worst possible place. And is that thing that you feel that you know is part of you somehow, that you're haunted by, is that your destiny? And the idea that there are things more powerful than blood, as Luke says, that thing was a really important thing to convey for us.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Palpatine_family",
  "/wiki/Imperial_family",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Palpatine_family",
  "/wiki/TIE_Fighter_4",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Nexus_of_Power",
  "/wiki/Noble",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Cloning",
  "/wiki/Strand-Cast",
  "/wiki/Darth_Sidious",
  "/wiki/Miramir%27s_family",
  "/wiki/Marriage",
  "/wiki/Naboo",
  "/wiki/Coruscant",
  "/wiki/Exegol",
  "/wiki/Hyperkarn",
  "/wiki/Jakku",
  "/wiki/32_BBY",
  "/wiki/4_ABY",
  "/wiki/34_ABY",
  "/wiki/35_ABY",
  "/wiki/21_ABY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Sith",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Galactic_Republic",
  "/wiki/Naboo_delegation",
  "/wiki/Office_of_the_Chancellor",
  "/wiki/Trade_Federation",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Galactic_Empire",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Jedi_Order",
  "/wiki/Sith_Eternal",
  "/wiki/Planet",
  "/wiki/Mid_Rim_Territories",
  "/wiki/The_galaxy",
  "/wiki/Galaxy",
  "/wiki/Politics",
  "/wiki/Republic_Era",
  "/wiki/Senator",
  "/wiki/Galactic_Senate",
  "/wiki/Supreme_Chancellor_Election,_32_BBY",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Bane",
  "/wiki/Rule_of_Two",
  "/wiki/Grand_Plan",
  "/wiki/Sith_Lord",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Separatist_Crisis",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY",
  "/wiki/Order_66",
  "/wiki/Jedi",
  "/wiki/Treason",
  "/wiki/Galactic_Emperor",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Era",
  "/wiki/Emperor",
  "/wiki/Immortality",
  "/wiki/Death",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Transference",
  "/wiki/Clone_template",
  "/wiki/DNA",
  "/wiki/Bioengineering",
  "/wiki/Sith_cult",
  "/wiki/Dathan",
  "/wiki/Parent",
  "/wiki/The_Force",
  "/wiki/15_ABY",
  "/wiki/Force-sensitive",
  "/wiki/Rey_Skywalker",
  "/wiki/Miramir",
  "/wiki/Unkar_Plutt",
  "/wiki/Assassin",
  "/wiki/Ochi",
  "/wiki/Palpatine%27s_broadcast",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Fleet",
  "/wiki/Final_Order",
  "/wiki/Battle_of_Exegol",
  "/wiki/Padawan",
  "/wiki/Sith_Empire",
  "/wiki/Convergence",
  "/wiki/Lake_Country",
  "/wiki/867_BBY",
  "/wiki/Homeworld",
  "/wiki/Festival_of_Light",
  "/wiki/20_BBY",
  "/wiki/Standard_year",
  "/wiki/Reproduction",
  "/wiki/82_BBY",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Theed",
  "/wiki/Standard_century",
  "/wiki/Sith_Master",
  "/wiki/Darth_Plagueis",
  "/wiki/Chommell_sector",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Time",
  "/wiki/Maul",
  "/wiki/Sith_apprentice",
  "/wiki/Advisor",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Democracy",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Blockade",
  "/wiki/Trade_Federation_Droid_Army",
  "/wiki/Gungan_Grand_Army",
  "/wiki/Finis_Valorum",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Battle_of_Naboo",
  "/wiki/Lord",
  "/wiki/Galactic_Constitution",
  "/wiki/Dictatorship",
  "/wiki/Millennium",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Jedi_High_Council",
  "/wiki/Duel_in_Palpatine%27s_office",
  "/wiki/Great_Jedi_Purge",
  "/wiki/New_Order",
  "/wiki/Throne_of_the_Sith",
  "/wiki/Sith_Citadel",
  "/wiki/Imperial_Senate",
  "/wiki/Death_Star",
  "/wiki/Dissolution_of_the_Imperial_Senate",
  "/wiki/0_BBY",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_station",
  "/wiki/Star",
  "/wiki/Superweapon",
  "/wiki/Galactic_Civil_War",
  "/wiki/12_BBY",
  "/wiki/Blood",
  "/wiki/Battle_of_Endor",
  "/wiki/Luke_Skywalker",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Chosen_One",
  "/wiki/New_Republic",
  "/wiki/Battle_of_Jakku",
  "/wiki/Imperial_Instruments_of_Surrender",
  "/wiki/Fleet_Admiral",
  "/wiki/Gallius_Rax",
  "/wiki/Operation:_Cinder",
  "/wiki/Battle_of_Theed",
  "/wiki/Skirmish_on_Vardos",
  "/wiki/Vardos",
  "/wiki/Galactic_Concordance",
  "/wiki/Imperial_remnant_(Core_and_Inner_Rim)",
  "/wiki/Core_Worlds",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Contingency",
  "/wiki/Unknown_Regions",
  "/wiki/New_Republic_Era",
  "/wiki/Imperial_officer",
  "/wiki/Scientist",
  "/wiki/Centrists",
  "/wiki/Populists",
  "/wiki/New_Republic_Senate",
  "/wiki/29_ABY",
  "/wiki/Life_support",
  "/wiki/Ommin_harness",
  "/wiki/Snoke",
  "/wiki/Humanoid",
  "/wiki/First_Order_military",
  "/wiki/Supreme_Leader",
  "/wiki/Skywalker_family",
  "/wiki/Ben_Solo",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/General",
  "/wiki/Han_Solo",
  "/wiki/Telepathy",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Jedi_Temple_of_Luke_Skywalker",
  "/wiki/Master_of_the_Knights_of_Ren",
  "/wiki/Knights_of_Ren",
  "/wiki/Sith_cultist",
  "/wiki/Symeong",
  "/wiki/Dathan_(Symeong)",
  "/wiki/Wild_Space",
  "/wiki/Bestoon",
  "/wiki/Jedi_hunter",
  "/wiki/Aki-Aki",
  "/wiki/Pasaana",
  "/wiki/Forbidden_Valley",
  "/wiki/Desert",
  "/wiki/Crolute",
  "/wiki/Junk_boss",
  "/wiki/Scavenger",
  "/wiki/Technician",
  "/wiki/Pilot",
  "/wiki/Western_Reaches",
  "/wiki/Force_power",
  "/wiki/Force_dyad",
  "/wiki/Force-bond",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Smuggler",
  "/wiki/Droid",
  "/wiki/Takodana",
  "/wiki/Maz_Kanata",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Map_to_Skywalker",
  "/wiki/Jedi_Master",
  "/wiki/Ahch-To",
  "/wiki/First_Jedi_Temple",
  "/wiki/Mind_probe_(Force_power)",
  "/wiki/Brain",
  "/wiki/Youngling",
  "/wiki/Mirror_cave",
  "/wiki/Cave",
  "/wiki/Light-year",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Junk_dealer",
  "/wiki/Alcohol",
  "/wiki/Burial",
  "/wiki/Eye",
  "/wiki/Battle_of_Crait",
  "/wiki/Sith_wayfinder",
  "/wiki/Vader%27s_wayfinder",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Mission_to_Pasaana_(Resistance)",
  "/wiki/Force_lightning",
  "/wiki/Mission_to_Kijimi",
  "/wiki/Mission_to_Kef_Bir",
  "/wiki/Death_Star_ruins",
  "/wiki/Kef_Bir",
  "/wiki/Force_drain",
  "/wiki/Force_healing",
  "/wiki/Unidentified_Sith_Eternal_prophecy",
  "/wiki/Sosha_Soruna",
  "/wiki/Lars_Homestead",
  "/wiki/Tatooine",
  "/wiki/Chris_Terrio",
  "/wiki/Star_Wars_saga",
  "/wiki/J.J._Abrams",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Lawrence_Kasdan",
  "/wiki/Daisy_Ridley",
  "/wiki/Sequel_trilogy",
  "/wiki/Rian_Johnson",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Simon_Pegg",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Palpatine_family",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Darth_Maul_(2017)_1",
  "/wiki/Darth_Maul_(2017)_2",
  "/wiki/Darth_Maul_(2017)_5",
  "/wiki/Age_of_Republic_-_Darth_Maul_1",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/5-Minute_Star_Wars_Stories_(2015)",
  "/wiki/5-Minute_Star_Wars_Stories_Strike_Back",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/The_Sith_Lord",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_1",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volumes_1_%26_2",
  "/wiki/Obi-Wan_and_Anakin_1",
  "/wiki/Obi-Wan_and_Anakin_2",
  "/wiki/Obi-Wan_and_Anakin_3",
  "/wiki/Obi-Wan_and_Anakin_4",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Age_of_Republic_-_Count_Dooku_1",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Queen%27s_Hope",
  "/wiki/Brotherhood",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Ambush",
  "/wiki/Rising_Malevolence",
  "/wiki/Bombad_Jedi",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Dooku_Captured",
  "/wiki/The_Gungan_General",
  "/wiki/Storm_Over_Ryloth",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/Holocron_Heist",
  "/wiki/Cargo_of_Doom",
  "/wiki/Hologram",
  "/wiki/Children_of_the_Force",
  "/wiki/The_Zillo_Beast",
  "/wiki/The_Zillo_Beast_Strikes_Back",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Lightsaber_Lost",
  "/wiki/Voyage_of_Temptation",
  "/wiki/Duchess_of_Mandalore",
  "/wiki/Corruption_(episode)",
  "/wiki/Sphere_of_Influence",
  "/wiki/Evil_Plans",
  "/wiki/Hostage_Crisis",
  "/wiki/Hostage_Crisis_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Senate_Murders",
  "/wiki/Nightsisters_(episode)",
  "/wiki/Ghosts_of_Mortis",
  "/wiki/Shadow_Warrior",
  "/wiki/Escape_from_Kadavo",
  "/wiki/Deception",
  "/wiki/Friends_and_Enemies",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Revival_(episode)",
  "/wiki/The_Lawless",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/The_Wrong_Jedi",
  "/wiki/The_Unknown",
  "/wiki/Conspiracy",
  "/wiki/Orders",
  "/wiki/An_Old_Friend",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/The_Lost_One",
  "/wiki/Voices",
  "/wiki/Sacrifice",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_1",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_4",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Revenge_of_the_Sith_Read-Along_Storybook_and_CD",
  "/wiki/Revenge_of_the_Sith_(Golden_Book)",
  "/wiki/Shattered",
  "/wiki/Kanan_1",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Aftermath_(episode)",
  "/wiki/Darth_Vader_(2017)_1",
  "/wiki/Darth_Vader_(2017)_5",
  "/wiki/Darth_Vader_(2017)_6",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Darth_Vader_(2017)_8",
  "/wiki/Darth_Vader_(2017)_10",
  "/wiki/The_Lesson_(Darth_Vader)",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/Darth_Vader_(2017)_11",
  "/wiki/Darth_Vader_(2017)_12",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Darth_Vader_Annual_2",
  "/wiki/Star_Wars_Insider",
  "/wiki/Orientation",
  "/wiki/Star_Wars_Insider_157",
  "/wiki/Lords_of_the_Sith",
  "/wiki/Lords_of_the_Sith_(audiobook)",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Age_of_Rebellion_-_Darth_Vader_1",
  "/wiki/Darth_Vader_(2017)_20",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/Most_Wanted",
  "/wiki/Most_Wanted_(audiobook)",
  "/wiki/Thrawn_(novel)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn_1",
  "/wiki/Thrawn_4",
  "/wiki/Thrawn_6",
  "/wiki/Bottleneck_(short_story)",
  "/wiki/The_Rise_of_the_Empire",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Part_I",
  "/wiki/Part_VI",
  "/wiki/Lost_Stars",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Empire_Day_(episode)",
  "/wiki/HoloNet_News",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Leia,_Princess_of_Alderaan_(audiobook)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Thrawn:_Treason",
  "/wiki/Thrawn:_Treason_(audiobook)",
  "/wiki/Wolves_and_a_Door",
  "/wiki/A_World_Between_Worlds",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Palpatine_(short_story)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Darth_Vader_(2015)_5",
  "/wiki/Darth_Vader_(2015)_6",
  "/wiki/Star_Wars_Annual_(2015)_1",
  "/wiki/Darth_Vader_(2015)_16",
  "/wiki/Darth_Vader_(2015)_19",
  "/wiki/Darth_Vader_(2015)_20",
  "/wiki/Darth_Vader_(2015)_22",
  "/wiki/Darth_Vader_(2015)_24",
  "/wiki/Darth_Vader_(2015)_25",
  "/wiki/Star_Wars_(2015)_37",
  "/wiki/Star_Wars_(2015)_47",
  "/wiki/Doctor_Aphra_(2016)_31",
  "/wiki/Star_Wars_(2015)_55",
  "/wiki/Doctor_Aphra_(2016)_33",
  "/wiki/Doctor_Aphra_(2016)_36",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Target_Vader_1",
  "/wiki/Lando_1",
  "/wiki/Lando_2",
  "/wiki/Lando_5",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Yoda_%E2%80%93_The_Jedi_Master",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Episode_V:_The_Empire_Strikes_Back_Read-Along_Storybook_and_CD",
  "/wiki/Disturbance",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Darth_Vader_(2020)_9",
  "/wiki/Darth_Vader_(2020)_10",
  "/wiki/Darth_Vader_(2020)_11",
  "/wiki/Darth_Vader_(2020)_12",
  "/wiki/Darth_Vader_(2020)_13",
  "/wiki/Darth_Vader_(2020)_16",
  "/wiki/Darth_Vader_(2020)_17",
  "/wiki/Crimson_Reign_1",
  "/wiki/Crimson_Reign_2",
  "/wiki/Crimson_Reign_3",
  "/wiki/Darth_Vader_(2020)_18",
  "/wiki/Darth_Vader_(2020)_20",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/Darth_Vader_(2020)_28",
  "/wiki/Crimson_Reign_5",
  "/wiki/Hidden_Empire_1",
  "/wiki/Revelations_1",
  "/wiki/Age_of_Rebellion_-_Luke_Skywalker_1",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Luke_vs._Emperor_Palpatine_-_Rise_to_Evil",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Return_of_the_Jedi_(Golden_Book)",
  "/wiki/Masters",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Shattered_Empire_1",
  "/wiki/Shattered_Empire_2",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Hare-Brained_Heist",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Better_the_Devil_You_Know,_Part_I",
  "/wiki/Star_Wars_Adventures_(2017)_1",
  "/wiki/Better_the_Devil_You_Know,_Part_II",
  "/wiki/Star_Wars_Adventures_(2017)_2",
  "/wiki/Before_the_Awakening",
  "/wiki/Rey%27s_First_Flight",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/The_Happabore_Hazard",
  "/wiki/Forces_of_Destiny:_The_Rey_Chronicles",
  "/wiki/Forces_of_Destiny:_The_Leia_Chronicles_%26_The_Rey_Chronicles",
  "/wiki/Run_Rey_Run",
  "/wiki/Choose_Your_Destiny:_A_Scavenger_Mission",
  "/wiki/Destroyer_Down",
  "/wiki/Star_Wars_Adventures:_Destroyer_Down",
  "/wiki/Force_Collector",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens:_Rey%27s_Story",
  "/wiki/The_Force_Awakens:_Rey%27s_Story_(audiobook)",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/Lightsaber_Rescue",
  "/wiki/Rolling_with_BB-8!",
  "/wiki/The_Force_Awakens_(storybook)",
  "/wiki/The_Force_Awakens_Read-Along_Storybook_and_CD",
  "/wiki/The_Force_Awakens_(Golden_Book)",
  "/wiki/Finn_%26_the_First_Order",
  "/wiki/Rey_Meets_BB-8",
  "/wiki/Rey_to_the_Rescue!",
  "/wiki/Finn_%26_Rey_Escape!",
  "/wiki/Han_%26_Chewie_Return!",
  "/wiki/Chaos_at_the_Castle",
  "/wiki/The_Fight_in_the_Forest",
  "/wiki/Join_the_Resistance:_Attack_on_Starkiller_Base",
  "/wiki/Join_the_Resistance:_Books_1-3",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_1",
  "/wiki/The_Force_Awakens_Adaptation_2",
  "/wiki/The_Force_Awakens_Adaptation_3",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/The_Force_Awakens_Adaptation_5",
  "/wiki/The_Force_Awakens_Adaptation_6",
  "/wiki/BB-8_on_the_Run",
  "/wiki/Sands_of_Jakku",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Rey",
  "/wiki/BB-8_Bandits",
  "/wiki/Tracker_Trouble",
  "/wiki/Perilous_Pursuit",
  "/wiki/A_Call_for_Heroes",
  "/wiki/Captain_Phasma_1",
  "/wiki/Age_of_Resistance_-_Rey_1",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/The_Last_Jedi:_Rey%27s_Journey",
  "/wiki/The_Last_Jedi:_Rose_and_Finn%27s_Secret_Mission",
  "/wiki/The_Last_Jedi_Adaptation_1",
  "/wiki/The_Last_Jedi_Adaptation_2",
  "/wiki/The_Last_Jedi_Adaptation_3",
  "/wiki/The_Last_Jedi_Adaptation_4",
  "/wiki/The_Last_Jedi_Adaptation_5",
  "/wiki/The_Last_Jedi_Adaptation_6",
  "/wiki/Chewie_and_the_Porgs",
  "/wiki/Life_Lessons",
  "/wiki/Star_Wars_Adventures_(2017)_26",
  "/wiki/Tales_from_Wild_Space:_The_Best_Pet",
  "/wiki/Star_Wars_Adventures_(2017)_5",
  "/wiki/Porg_Problems",
  "/wiki/Poe_Dameron_26",
  "/wiki/Poe_Dameron_27",
  "/wiki/Poe_Dameron_28",
  "/wiki/Poe_Dameron_31",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/Through_the_Turbulence",
  "/wiki/Allegiance_1",
  "/wiki/Allegiance_2",
  "/wiki/Allegiance_3",
  "/wiki/Allegiance_4",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Spark_of_the_Resistance",
  "/wiki/Spark_of_the_Resistance_(audiobook)",
  "/wiki/Squad_Goals",
  "/wiki/Star_Wars_Adventures_(2017)_31",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Rise_of_the_Resistance",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Star_Wars:_Galactic_Starcruiser",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/The_Obstacle_Course,_Part_1",
  "/wiki/Star_Wars_Adventures_(2020)_1",
  "/wiki/The_Obstacle_Course,_Part_2",
  "/wiki/Star_Wars_Adventures_(2020)_2",
  "/wiki/Repair_Stop",
  "/wiki/Star_Wars_Adventures_(2020)_13",
  "/wiki/Repair_Stop,_Part_II",
  "/wiki/Star_Wars_Adventures_(2020)_14",
  "/wiki/Hyperspace_Stories_4",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/Resistance_Heroes",
  "/wiki/First_Order_Villains",
  "/wiki/Journey_to_Star_Wars:_The_Rise_of_Skywalker:_The_Resistance",
  "/wiki/Star_Wars:_The_Ultimate_Pop-Up_Galaxy",
  "/wiki/Star_Wars:_We_Are_the_Resistance",
  "/wiki/Star_Wars:_The_Galaxy_Needs_You",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_54",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Awakenings",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_6",
  "/wiki/Droid_Directory",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Starships_and_Speeders",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Saga_of_Rey",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_1",
  "/wiki/Star_Wars_Universe",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Palpatine%27s_Contingency_Plan",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Cad_Bane",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/0_ABY",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/December_30",
  "/wiki/2019",
  "/wiki/January_21",
  "/wiki/2020",
  "/wiki/November_25",
  "/wiki/January_13",
  "/wiki/December_5",
  "/wiki/2016",
  "/wiki/October_8",
  "/wiki/2018",
  "/wiki/September_9",
  "/wiki/February_2",
  "/wiki/April_4",
  "/wiki/April_22",
  "/wiki/2021",
  "/wiki/December_23",
  "/wiki/January_5"
 ]
}