{
 "name": "Paltr_Carvin",
 "display_name": "Paltr Carvin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Ruling Council",
      "Imperial Army",
      "Imperial Ruling Council"
     ]
    }
   ]
  }
 ],
 "content": "Paltr Carvin was an Imperial general and Tribune who briefly ruled the Galactic Empire in 5 ABY. A member of the Imperial Ruling Council, Carvin seized control after Sate Pestage was accused of treason and fled Imperial Center. Working with Director of Imperial Intelligence Ysanne Isard, Carvin put out a warrant for Pestage's arrest, and as a result the former Grand Vizier was captured on Ciutric IV.\nCarvin appointed Admiral Delak Krennel to retrieve Pestage and bring him back to Imperial Center, but the ensuing evacuation of Ciutric prevented that. Pestage had been rescued by New Republic agents, but the agents themselves had been forced to stay on the planet due to the presence of the Interdictor Star Destroyer Binder. Krennel initially failed to take control of the situation, however, turning it into a fiasco. Meanwhile, Isard had Carvin's closest colleagues assassinated, before having the general himself arrested. As control over the Empire was wrested from his grasp, Carvin was taken to the Lusankya prison facility, where he was to be reconditioned to serve Isard loyally.\nA general in the Imperial Military, Paltr Carvin was appointed to the Imperial Ruling Council at some stage around 5 ABY. After Emperor Palpatine's first death over the forest moon of Endor in 4 ABY, the council and Grand Vizier Sate Pestage became embroiled in a brief power struggle for control of the Empire, with Pestage eventually taking the Imperial throne for himself. The council, eager to overthrow Pestage and take the reins of the Empire themselves, became informally allied with Director of Imperial Intelligence Ysanne Isard, who acted as a neutral intermediary between it and Pestage. Following the disastrous Battle of Brentaal IV, the council, headed by Carvin, was summoned to a meeting by Isard. She insinuated that Pestage had entered into a pact with the New Republic and intended to effectively turn the Empire over to them. Specifically, Isard suspected that Pestage had met with Princess Leia Organa of the New Republic on the crime-ridden planet Axxila and had subsequently given orders to let her escape.\nCarvin was dubious, and when Isard informed him that she had obtained incriminating data files from \"confidential sources\" he accused her of being a liar. Isard did not balk at the accusation, and instead insisted that her prime interest was state security. Musing over her report, Carvin surmised that the council would have to rule in Pestage's stead, if what Isard said was true. Council member Challer was quick to caution the general, however, and went on to question Isard. The director requested that the council strip Pestage of power and put an end to his treason, and Carvin complied with her request.\nAs a result, Isard was given carte blanche to ground ships in order to prevent Pestage's escape from Imperial Center. Meanwhile, Carvin and his tribunal charged the Grand Vizier with treason, put out a warrant for his arrest, and assumed control of the Galactic Empire. Since Carvin headed the tribunal, he effectively ruled the Empire. In his new position as Tribune, Carvin sported the rank insignia of an admiral. Despite the curfew, Pestage was able to escape to Ciutric IV, but was subsequently placed in custody by Governor Brothic. Isard prepared to send her own men to \"recover\" him, to apparently stand trial on Imperial Center. Carvin would have none of it, however, and ordered Isard to have her people merely secure Pestage and not transport him. At the same time, he had Admiral Delak Krennel travel to Ciutric IV in the Star Destroyer Reckoning, to fetch Pestage personally.\nIsard protested at first, and then requested permission to personally observe Pestage's retrieval. Carvin was incredulous, questioning Isard as to whether she actually had any responsibilities to attend to on Imperial Center itself. He and his colleagues denied Isard permission, ordering her to leave the task to Krennel and attend to her duties on the capital. The director disobeyed the tribunal, however, and sent her agents to Ciutric IV. Simultaneously, Republic commandos attacked the planet and broke Pestage out of custody. Both Krennel and Isard's men had failed to stop the enemy, but the participation of the Intel Director's Interdictor Star Destroyer, Binder—which was able to prevent ships from entering hyperspace—had kept the Republic from escaping and had forced them to retreat to the wilderness of Ciutric IV.\nCarvin and the tribunal placed sole blame for the fiasco on Isard's shoulders and fiercely upbraided her for disobedience. The general warned the director that if she did not cooperate with the tribunal in the future, her career under their rule would be stopped short and abruptly terminated. Carvin then provided Krennel with more fighters with which to smoke the Republic agents out, but the TIE craft were subsequently destroyed by Rogue Squadron.\nBecause of the tribunal's criticism of her actions and with her position as Intelligence Director in jeopardy, Isard decided to accelerate her timetable for the elimination of the council. While Krennel was engaging Rogue Squadron over Ciutric, Isard was eliminating the tribunes, one by one. She had her agents assassinate Tribunes Challer and Plumba, alarming Carvin. Yet before he could act, Isard sent Royal Guards to apprehend him. The general was beaten by the guards before being brought before the triumphant Isard. He could do little more than cry treason, helpless before the director. Isard planned to make Carvin serve her as she stepped into his role as ruler of the Empire, but the general insisted that he would not cooperate. The director was not fazed at all, as she was confident that a stint in the Lusankya prison facility would make the general change his mind. With that, Carvin was hauled out of Isard's presence and taken into captivity.\nA power-hungry man, Paltr Carvin was eager and quick to take Sate Pestage's role when the Grand Vizier was accused of being a traitor to the Empire. He was, on occasion, pulled back into line by his colleagues, such as Challer, but was essentially considered to be the head of the Empire following Pestage's departure from Imperial Center. His leadership initially inspired confidence in others, such as Delak Krennel, but he would later shift blame to cover his own mistakes, shaking the faith some people had in him.\nCarvin thought Ysanne Isard insignificant and was quick to deflate her arguments during meetings. The feeling was mutual on Isard's end—the Director of Imperial Intelligence considered the general a fool. Carvin was quick to shoot down Isard's request to travel to Ciutric IV and, together with his colleagues, mocked the director by reeling off a list of objectives she had failed to accomplish. Later, when beaten and bloodied before Isard, he remained defiant and refused to serve her, although she was confident that the Lusankya prison facility would help change his mind.\nPaltr Carvin made his first appearance in X-Wing Rogue Squadron 32 written by Michael A. Stackpole and penciled by Steve Crespo, the first issue of Mandatory Retirement, the final story arc of the Star Wars: X-Wing Rogue Squadron comic series. Carvin made appearances in the three subsequent issues of Mandatory Retirement, all of which were likewise written by Stackpole with pencils by Crespo and John Nadeau.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Imperial_Ruling_Council/Legends",
  "/wiki/General/Legends",
  "/wiki/Tribune",
  "/wiki/5_ABY/Legends",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Ysanne_Isard",
  "/wiki/Grand_Vizier/Legends",
  "/wiki/Ciutric_IV",
  "/wiki/Admiral/Legends",
  "/wiki/Delak_Krennel",
  "/wiki/Evacuation_of_Ciutric",
  "/wiki/New_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Interdictor-class_Star_Destroyer/Legends",
  "/wiki/Binder",
  "/wiki/Assassin/Legends",
  "/wiki/Lusankya/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Battle_of_Endor/Legends#Demise_of_the_Sith",
  "/wiki/Moon/Legends",
  "/wiki/Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Battle_of_Brentaal_IV_(Galactic_Civil_War)",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Axxila/Legends",
  "/wiki/Challer",
  "/wiki/Starship/Legends",
  "/wiki/Rank_insignia_plaque/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Brothic",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Reckoning_(Imperial_II-class)",
  "/wiki/Commando_Team_One",
  "/wiki/Hyperspace/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/TIE_Series",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Plumba",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Blood/Legends",
  "/wiki/X-Wing_Rogue_Squadron_32",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Steve_Crespo",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Mandatory_Retirement",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron",
  "/wiki/Star_Wars_comic_books",
  "/wiki/John_Nadeau",
  "/wiki/X-Wing_Rogue_Squadron_33",
  "/wiki/X-Wing_Rogue_Squadron_34",
  "/wiki/X-Wing_Rogue_Squadron_35",
  "/wiki/Category:Images_of_Paltr_Carvin",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Trioculus",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/X-Wing_Rogue_Squadron_31",
  "/wiki/Imperial_Sourcebook"
 ]
}