{
 "name": "Palu Zerk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Palu Zerk was a Human female townsperson from Naboo's moon of Rori who lived during the time of the Galactic Civil War. She was the older sister of Feinu Zerk, both of whom ended up working for Jabba Desilijic Tiure's criminal empire on Tatooine sometime following the Battle of Yavin in 0 BBY. Working from her shop in the small town of Wayfar, Palu tailored specially designed disease-resistant clothing and other high-quality garbs exclusively for Jabba's elite forces. Her sister, working as a delivery courier, would then deliver this equipment to the Hutt's elite guard. During one of her deliveries, Palu's sister found herself ambushed by thugs of the rival Valarian Syndicate, who attempted to kidnap her and hold her for ransom. Before they could follow through with their plan, Feinu was rescued by a spacer dispatched by Palu. For rescuing her younger sister, Palu bestowed to the heroic individual a Treated Protective Coverall, which the spacer used to acquire bile from the sarlacc at the Great Pit of Carkoon, an essential ingredient used to construct the Zicx-bug bomb.\nAs the older sister of Feinu Zerk, Palu Zerk was a Human female townsperson from Naboo's moon of Rori. During the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, both Palu and her sister ended up in the small town of Wayfar on the Outer Rim desert world of Tatooine. By the time following the Battle of Yavin in 0 BBY, the two sisters formed a business agreement with the criminal enterprise led by the Hutt crime lord Jabba Desilijic Tiure. Palu also established a friendship with another fellow criminal who worked for Jabba, a Sullustan named Jowir Ar'Lensa. Working from her shop in Wayfar, Palu tailored specially designed disease-resistant clothing and other high-quality garbs exclusively for Jabba's elite forces. Feinu would then deliver this newly created equipment to Jabba's elite guard on the short, yet dangerous road from Wayfar to Jabba's Palace. Feinu traveled the road alone, despite her older sister's objections. Their arrangement drew attention and ire from Jabba's rival, Lady Valarian. During one of her treks back from the palace, Feinu ended up running late. When Palu learned from the palace scouts that she had left to come back several hours ago, she began to fear the worst, and rightly assumed that the Valarian Syndicate may be involved in her disappearance.\nFortunately for Palu, a spacer referred to her by Jowir Ar'Lensa agreed to search the edge of town to locate her sister. As it turned out, Feinu was indeed ambushed by a group of three Valarian thugs directed by a Valarian swooper leader. The Valarian thugs warned Feinu that if she moved, they would disintegrate her on the spot. She screamed for help as the gang attempted to kidnap her and hold her for ransom. Before they could follow through with their plan, however, the spacer dispatched by Palu spotted the troubled young lady, and killed the four thugs who were attacking her. Feinu thanked her rescuer, and as the spacer escorted her back to Palu's shop in Wayfar, she vowed to one day enact revenge against the Valarian swoopers. Once Feinu was safely back in town, her older sister expressed her sincerest gratitude. In thanks, she provided the spacer some credits and a Treated Protective Coverall, a special suit which was resistant to disease. The spacer required such a suit in order to acquire corrosive bile from the sarlacc at the Great Pit of Carkoon. The spacer required the bile as a constructive component for the Zicx-bug bomb. However, gifting the spacer such a suit was an especially risky prospect for Palu. Because of her exclusive agreement with Jabba's elite guard, Palu knew that if Jabba found out that she gave the suit away, the Hutt crime lord would have the two of them killed. For this reason, she urged the spacer to leave her be, despite being grateful to individual for saving her younger sister.\nPalu Zerk had fair skin, brown hair, and brown colored eyes. Somewhat standoffish, Palu would at times turn away passers by whenever she was busy making her specially designed clothing for Jabba's elite forces. If someone she did not know approached her, she would direct the individual to her friend Jowir, who she claimed loved meeting new people. Palu was particularly protective of her younger sister. She disapproved of her making the journey to and from Jabba's Palace alone, rightly fearing that the rival Valarian gang could cause her trouble. When Feinu ran several hours late, Palu feared for her sister's welfare, and implored the spacer referred to her by Jowir to search the edge of town to find her. The spacer agreed, and Palu urged the individual to hurry. She did not appreciate any delay in locating her younger sister, and was willing to use her friendship with Jabba to her advantage if any harm befell her. Fortunately for the spacer tasked with the responsibility of rescuing the young lady, this would not be necessary. Feinu was duly located, and saved from the group of Valarian thugs. For saving her little sister, Palu expressed a great deal of gratitude, going so far as to provide the spacer a Treated Protective Coverall, designed exclusively for Jabba's people. She did this, despite knowing that Jabba would have her killed if he found out. However, Palu's generosity had limits. After she provided the spacer with the coverall and a few credits, she urged the individual to leave her alone, as she did not have anything left to give.\nWhile working at her shop in Wayfar, Palu wore a flex-form shirt colored in shades of beige and gray. She also wore a similarly colored pleated skirt and gray dress slippers. Around her neck, she wore a silver colored elegant gemstone necklace. As part of her agreement with Jabba the Hutt, Palu tailored specially designed disease-resistant clothing and other high-quality garbs for Jabba's elite forces.\nPalu Zerk was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. She was included as part of the Zicx-bug bomb quest, added to the game on August 12, 2003. During one part of the quest, players were required to locate Feinu, save her from four Valarian thugs, and escort her safely back to Palu in the town of Wayfar. Completing this task would earn the player 100 credits and a Treated Protective Coverall. The coverall could then be used for the next portion of the quest, allowing players to acquire bile from the nearby sarlacc without suffering ill-effects. Palu's surname of Zerk never appeared in the game. However, the Star Wars Galaxies: Jump to Lightspeed: Prima Official Game Guide  lists her full name as Palu Zerk. The reference guide also lists her as a townsperson found on Rori. This attribute never appeared in the game, as Palu only appeared as part a quest issued on Tatooine. Although the player could choose not to do the tasks associated with the Zicx-bug bomb quest, this article assumes 100% game completion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rori/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Naboo/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Feinu_Zerk",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Tatooine/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/City/Legends",
  "/wiki/Wayfar",
  "/wiki/Disease/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Courier/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Valarian_Syndicate",
  "/wiki/Ransom/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Sarlacc/Legends",
  "/wiki/Great_Pit_of_Carkoon/Legends",
  "/wiki/Zicx-bug_bomb",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Jowir_Ar%27Lensa",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Lord/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Canon",
  "/wiki/Swooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Shirt",
  "/wiki/Silver/Legends",
  "/wiki/Gemstone/Legends",
  "/wiki/Necklace/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_12",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed:_Prima_Official_Game_Guide",
  "/wiki/2004",
  "/wiki/The_New_Essential_Chronology"
 ]
}