{
 "name": "Pan_Eyta",
 "display_name": "Pan Eyta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dowut"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 431 BBY",
      "Dowut"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 231 BBY",
      "Restitution"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dowutin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "200 kilograms"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nihil",
      "Pan Eyta's Tempest",
      "Pan Eyta's Tempest",
      "Pan Eyta's crew"
     ]
    }
   ]
  }
 ],
 "content": "Pan Eyta was a Dowutin male who was one of the three Tempest Runners in the Nihil marauder group. As a Tempest Runner, Eyta commanded a Tempest and the starship Elegencia.\nPan Eyta was a Dowutin male who was born on Dowut in 431 BBY. At eight years old, like all Dowutin children, he was kicked out of his nest. He nearly died the day he left after being attacked by a beast from his planet. That night he nearly died from the fever brought by his wounds and fantasized about killing and eating the creature. He soon would relish in his victory over his would-be killer.\nEyta later travelled to the nearest spaceport where he stowed away on a departing ship. He held a blade to the two pilots and ate them soon after. Eyta joined the Nihil, a group of anarchist pirates during its early days. He eventually became became a Tempest Runner whose Tempest was considered to be thinkers and flamboyant. This drew disgust and was considered contradictory by Nihil of other Tempests, especially by his fellow Runner Kassav Milliko.\nIn 232 BBY, Eyta and his Tempest were assisted by the others in a raid on Ab Dalis after the Great Hyperspace Disaster. He then lead a feast at the Great Hall of the Nihil in No-Space to celebrate this raid. After congratulating the Nihil he ordered Zagyar, a Storm in Lourna Dee's Tempest who was blamed for partially screwing up the raid, to explain himself. It is unknown if Zagyar was punished or another Nihil. Afterward, the Eye of the Nihil Marchion Ro summoned the other Runners and asked them to stop raiding until the Galactic Republic reopened the hyperspace routes. Pan Eyta was concerned for his Tempest but reluctantly agreed.\nThe Eye and the Tempest Runners reunited in order to discuss what to do after Kassav Milliko accidentally destroyed Eriadu's inhabited moon. Pan Eyta was intimidated by Ro's attack on Milliko in a display of dominance. The Dowutin quickly fell in line with his new leader and unprofessionally asked Ro about what he wants Eyta to do much to the former's surprise.\nAfter the Battle of Kur the surviving Nihil gathered to the Great Hall. Marchion Ro gave a speech and demonstration on Milliko's Tempest's \"sacrifice\" that he had engineered which moved Eyta and the rest of the Nihil. Pan Eyta then took off his mask with the rest of the organization in an act of solidarity with their new leader.\nAfter a failed attack by Sarn Starbreaker, a Cloud from Eyta's own Tempest, on the Cyclor Shipyards, Eyta was summoned by his fellow Tempest Runners to Grizal, the location of a central Nihil base established to support Marchion Ro's plans to grow the organization and expand their operations beyond the Outer Rim. Upon arriving, Pan nearly came to blows with Tempest Runner Zeetar, goaded by a newly constructed powersuit that made the Talpini stand taller than Eyta. Lourna Dee stepped in to stop the fight, and Pan went on to express his distaste for Ro's increasing influence over the Nihil to the other Runners. Marchion himself arrived to the Runners' meeting as Pan was speaking and overheard Eyta's comments. Ro then made Pan hold his helmet in a show of superiority and chided Pan for allowing his Tempest to launch a raid when Ro had forbidden such action. When Eyta attempted to return to the topic of Ro's authority over the Nihil, Ro activated a device hidden within the helmet, electrifying it and beginning to electrocute Pan. Ro left Eyta to die in agony, but while he nearly succumbed to the booby trap, Pan eventually managed to break Ro's mask in half and save himself.\nAfter surviving Ro's attempt on his life, Pan pushed his fellow Tempest Runners to move together against the Eye. He revealed to Zeetar and Lourna that the hyperspace Paths used by the Nihil came not from Ro but from Mari San Tekka. The Dowutin then staged a public argument with Ro regarding the Nihil's recent inactivity following the Great Disaster, drawing the attention of the other Nihil Forces gathered on Grizal. There, he revealed the same secret of the Paths to the Tempests to undermine Ro's authority. However, Ro managed to diffuse Eyta's challenge to his position by turning the crowd's attention to the Nihil's next operation: an attack on the Republic Fair with the aim of killing Republic Chancellor Lina Soh. With the Nihil stirred into a frenzy, Eyta was left with no choice but to join in with their renewed support of Ro.\nEyta then joined the massive Nihil force that attacked the Republic Fair on Valo. Eyta remained aboard the Elegencia during the raid, coordinating the overall operation and attacking ships in orbit while Lourna's Tempest handled the ground attack and Zeetar's picked off ships that attempted to flee past Pan's forces. The original Nihil attack plan called for a bombardment from Pan's ship once as much damage as possible had been caused by Lourna's Tempest. However, when the tide of the ground battle turned against the Nihil, Pan ordered the bombing early with Nihil forces still planetside. One particular bomb severely injured Chancellor Soh. Lourna Dee, who had been attacking the Chancellor and her companions at the time, was also injured. A small force of Skyhawks and Jedi Vectors, led by Indeera Stokes, then attacked Pan's ships in hopes of stopping the carpet bombing. While their attack did draw Eyta's attention, all of the Skyhawks were destroyed in the attack, and Stokes was left alone as her fellow Jedi were forced to retreat with damaged Vectors. Before Indeera's ship could be destroyed, the Togruta fleet arrived, summoned to rescue their imperiled ruler on the planet below. Outmatched by these new arrivals, Pan ordered his forces to retreat, leaving his fellow Tempest Runners and their forces to fend for themselves.\nAfter the successful attack, Eyta once again came to conflict with the Eye, who once again caught him in a trap, this time with a poisonous blade. He was given an antidote by Lourna Dee, who told him that she agreed with his frustrations with Ro's leadership. Dee told the Dowutin that another attack on the Cyclor Shipyards would catch the Republic off balance and vulnerable. Eyta agreed with this move, and moved to attack the shipyards alongside Dee's Tempest.\nUpon arriving at Cyclor, the Tempest Runner was greeted by a large Republic and Jedi task force. Moreover, he discovered that Dee had sent him into this trap to rid herself of the other Tempest Runner. Eyta's Tempest suffered major casualties during the ensuing battle, prompting him to make use of a secret escape ship within the Elegencia. Still wounded from Ro's poison, Eyta escaped into hyperspace dreading his return to Dowut.\nFollowing his defeat at Cyclor, Eyta hunted Lourna Dee and Marchion Ro seeking revenge, gathering a new crew to aid him. Still wounded by Ro's poison, Eyta now had to wear a ventilator on his back. After failing to kill her on the forest world of Arbra, Eyta was killed by Dee aboard the Restitution.\nPan Eyta, along with the rest of his Tempest, loved to live luxuriously and did so by wearing fancy suits and outfitting his ship, the Elegencia, with a fancy interior as well. Eyta also enjoyed visiting the opera and drinking fancy beverages such as spiced wine. Eyta and his people were considered thinkers.\nDespite enjoying luxury, Pan Eyta was no less vicious than any other Nihil and closely followed the rules of the organization. For example, he asked for permission from Lourna Dee before he dispensed justice on Zaygar because the Storm belonged to her Tempest. Eyta greatly cared for his Tempest since he was concerned for their well-being after Ro told them not to raid until the heat died down. Eyta was also shown to be very loyal to those who displayed dominance and a talent for leadership given how quick he was to follow Marchion Ro.\nEyta would change as he became increasingly frustrated with Ro's leadership. He was prone to outbursts of disobedience and would commonly deride his fellow Tempest Runners. This only got worse after Ro's attempted assassinations on Eyta. The Dowutin would nonchalantly as well as personally kill any Nihil who questioned his methods. The nonstop abuse at the hands of Ro would lead to his desertion from the pirates he knew and was loyal to for over a century.\nPan Eyta was dressed in a leather suit with pale turquoise lapels designed to set off of his yellow skin. Like all Nihil, he wore a mask which protected his identity and himself from the poisonous gas the Nihil frequently use. Eyta's mask had the stylized image of a Dowutin face with horns and a beard. He had a blaster pistol in a leg holster that had enough firepower to decapitate a being with a single shot.\nIn the 2021 audio drama The High Republic: Tempest Runner, Eyta was voiced by Marc Thompson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_1",
  "/wiki/Dowut",
  "/wiki/431_BBY",
  "/wiki/231_BBY",
  "/wiki/Lourna_Dee_(prison_ship)",
  "/wiki/Dowutin",
  "/wiki/Gender",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Nihil",
  "/wiki/Pan_Eyta%27s_Tempest",
  "/wiki/Tempest_Runner",
  "/wiki/Pirate",
  "/wiki/Starship",
  "/wiki/Elegencia",
  "/wiki/Standard_year",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Spaceport",
  "/wiki/Pilot",
  "/wiki/Tempest",
  "/wiki/Kassav_Milliko",
  "/wiki/232_BBY",
  "/wiki/Ab_Dalis",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/No-Space",
  "/wiki/Zagyar",
  "/wiki/Storm_(rank)",
  "/wiki/Lourna_Dee",
  "/wiki/Lourna_Dee%27s_Tempest",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Marchion_Ro",
  "/wiki/Galactic_Republic",
  "/wiki/Hyperspace_route",
  "/wiki/Eriadu%27s_inhabited_moon",
  "/wiki/Battle_of_Kur",
  "/wiki/Sarn_Starbreaker",
  "/wiki/Cyclor",
  "/wiki/Cyclor_Shipyards",
  "/wiki/Grizal",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Zeetar",
  "/wiki/Talpini",
  "/wiki/Mari_San_Tekka",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Attack_on_Valo",
  "/wiki/Valo",
  "/wiki/Z-29_Skyhawk",
  "/wiki/Jedi_Vector",
  "/wiki/Indeera_Stokes",
  "/wiki/Elarec_Yovet",
  "/wiki/Battle_of_Cyclor",
  "/wiki/Ventilator",
  "/wiki/Arbra",
  "/wiki/Opera",
  "/wiki/Wine",
  "/wiki/Standard_century",
  "/wiki/Helmet",
  "/wiki/Blaster_pistol",
  "/wiki/2021",
  "/wiki/Marc_Thompson",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/Star_Wars_Insider",
  "/wiki/Soule_Man",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/StarWars.com",
  "/wiki/Battle_of_Grizal",
  "/wiki/Standard_month",
  "/wiki/252_BBY",
  "/wiki/Shalla_Ro",
  "/wiki/Asgar_Ro",
  "/wiki/242_BBY",
  "/wiki/Xanaven",
  "/wiki/Kara_Xoo"
 ]
}