{
 "name": "Pars Varqom",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Pars Varqom was a retired Palace Guard for the Royal Naboo Security Forces. Varqom served as a \"Pearl Hat\" for 18 years under seven monarchs, from King Ars Veruna to Queen Mairayni.\nVarqom was in service during the Invasion of Naboo by the Trade Federation in 32 BBY. Having received training in guerrilla tactics from Captain Quarsh Panaka, Varqom and his unit retreated from Theed up the Solleu River to set up a resistance cell in the Penladen Hills.\nWhen Queen Amidala returned from Coruscant to lead the liberation of the planet, Varqom and his men were too far away to assist in the raid on Theed. Instead, Panaka ordered them to liberate Theed citizens from the Penladen detention camp. After disabling the shield generator protecting the camp, Varqom witnessed Theed gentry destroying B1-Series battle droids with their bare hands as they escaped.\nMany years later, Varqom's memoirs were recorded in the 2,453th volume of the Royal Archives of Naboo. Remembering the Trade Federation's battle droids, he still harbored a deep distrust for droids. In his old age he acquired a degenerative eye condition, but refused to have it treated with cybernetics as he equated such treatments with droids.\nEver since the Invasion of Naboo, Varqom acquired life-long aversion and mistrust towards droids, going so far as to avoid having a chipped ocular implant for his degenerative eye condition, as recommended by a Kulma Narrows doctor. Varqom also boycotted products manufactured by Neimoidians, Duros or from corporations that aided both sides of the Clone Wars, such as Tagge Company and the ones based on Balmorra and Kuat. The guard preferred to buy from within the Chommell sector. His great-granddaughter Lesia deemed him \"old-fashioned.\"\nJason Fry, writer of The Essential Guide to Warfare, eventually cut any mentioning of Pars Varqom in the final product. The character was later made canonical in the StarWars.com blog post Star Wars: The Essential Guide to Warfare: Author's Cut, Part 6 — Showdown at Naboo. For Varqom's story, Fry took inspiraton from World War II veterans he knew who swore to never buy cars made in Japan after the conflict.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Royal_House_of_Naboo/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Palace_Guard_(Naboo)",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Pearl_Hat",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/King/Legends",
  "/wiki/Ars_Veruna/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Mairayni",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/32_BBY/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Quarsh_Panaka/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Solleu_River/Legends",
  "/wiki/Penladen_Hills",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Penladen_detention_camp",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Royal_Archives_of_Naboo",
  "/wiki/Battle_droid/Legends",
  "/wiki/Anti-droid_sentiment/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Kulma_Narrows",
  "/wiki/Doctor/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Tagge_Company",
  "/wiki/Balmorra/Legends",
  "/wiki/Kuat/Legends",
  "/wiki/Chommell_sector/Legends",
  "/wiki/Lesia",
  "/wiki/Jason_Fry",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Canon",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut"
 ]
}