{
 "name": "Pashna_Starkiller",
 "display_name": "Pashna Starkiller",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Pashna Starkiller was a Human male who served as a respected Imperial general who received the title Warlord of the Empire. Coming out of retirement, he was approached by the Rebel Alliance at a time when it sought experienced leaders to help formulate strategy for its new military. Starkiller defected to the Alliance's cause, and rose to become one of the Alliance's highest-ranked members. A seasoned military officer, Starkiller's skills helped shape Rebel Alliance military planning. As a younger generation of military men and women rose, Starkiller relinquished some of his responsibility, though he continued to advise the Rebellion on strategic matters. In 0 BBY, Starkiller was present in the ceremony held in honor of Luke Skywalker and other heroes of the Battle of Yavin.\nIn time, Starkiller retired again, only to find himself called upon by famed Rebel strategist Jan Dodonna during the fight against the resurrected Palpatine. Starkiller joined a number of other retired officers, including Vanden Willard and Adar Tallon, in an advisory body that called itself the \"Gray Cadre.\" Providing strategic planning for what was now the New Republic, Starkiller and his peers were responsible for saving millions of lives in the war. When that crisis was averted, he returned to a state of semi-retirement, continuing to receive intelligence briefings and regularly meeting with Dodonna and the others to advise the New Republic on its continuing war against the Empire.\nA Human male, Pashna Starkiller was a respected Imperial general, and recipient of the elite title of Warlord of the Empire. He ultimately retired as a Marshal early in the Galactic Civil War. When he was approached by the Rebel Alliance, he defected to their cause. With his help and that of several fellow officers recruited into the Alliance, Rebel military doctrine was transformed from the vague idealism it had been founded on into that of a true fighting force. Starkiller rose to become one of the highest-ranking members of the Rebel Alliance. In this time, he participated in a number of field missions with a young tactical genius named Risiev Credal.\nIn 0 BBY, the Alliance achieved a major victory at Yavin IV when Rebel pilot Luke Skywalker destroyed the Death Star by firing proton torpedoes into the thermal exhaust port, causing a chain reaction that destroyed the whole battlestation. Following the battle, Starkiller was present in a ceremony when the Medal of Bravery was awarded to Skywalker, Han Solo, and Chewbacca. After that event, Starkiller began to pass on his responsibility to the next generation of soldiers, though he continued to serve as a valuable asset in Rebel strategic planning.\nIn time, the Rebel Alliance transitioned into the New Republic, and by 10 ABY, when Emperor Palpatine returned from seeming death in a cloned body and set about waging war on the New Republic, Starkiller had once again retired from active duty. When Jan Dodonna, still serving as a strategist for the Republic, realized that he could not fulfill the commitment that post required by himself, he called upon a number of retired military men, including Starkiller, Vanden Willard, and Adar Tallon, to form an advisory group that jokingly nicknamed itself the \"Gray Cadre.\" Starkiller and his cohorts used their experience to advise the commanders of the New Republic on vital military areas in a time of extreme crisis.\nStarkiller and the rest of the cadre had their time to shine in the Battle of Mon Calamari during Operation Shadow Hand. The advice they gave the New Republic allowed its military to design some of its most successful combat strategies during the battle, and ultimately saved millions of lives. After the Republic's victory, Starkiller and the others returned to a state of semi-retirement, meeting monthly to discuss matters of strategic planning and anticipate the goals of the Empire. If their expertise was needed again, they were prepared to give whatever information and analysis the commanders of the front-line fighting needed. Sometime after the battle with Palpatine, Starkiller, once again retired, received a carbon copy of a memo from the Mon Calamari Zgorth'sth of the newly-formed New Republic Department of Threat Assessment, providing intelligence about a number of organizations in the galaxy that might pose a threat to Republic interests.\nThough retired from his position as a respected Imperial general and a former Warlord of the Empire, when the Rebel Alliance approached Starkiller, he nonetheless chose to join in their fight. Starkiller was one of the Alliance's best, and those who trained under him reflected his ability in their own work. After his second retirement, Starkiller did not seek to return to full-time service, content to allow the next generation of officers to come into their own. His experience was nonetheless considered invaluable by the New Republic, and along with his fellow officers Starkiller's knowledge of tactics and strategy made a significant difference in the war against the reborn Palpatine. He remained dedicated to the New Republic even after the immediate crisis ended, forgoing complete retirement to lend his services to their continuing fight against the Empire. Starkiller had brown hair and fair skin.\nAn individual named Pashna Starkiller was first mentioned in Michael Allen Horne's Dark Empire Sourcebook, published in 1993. In 2003, the Star Wars Galaxies Multiplayer Online game included a Mon Calamari named Pashna Starkiller among its non-player characters. Since no previous source had established Starkiller's physical appearance, gender and species, it was assumed to be the first physical depiction of the character, even though fan reaction ranged from surprise to belief that \"Starkiller\" was not a name fitting a Mon Calamari.\nIn 2012, the article Rogues Gallery in Star Wars Insider 133 identified one of the Humans present at the Rebel celebration in the Massassi Temple at the end of Star Wars: Episode IV A New Hope, portrayed by George Stock, as Pashna Starkiller, creating further controversy. When asked about the subject, the article's author Leland Chee explained that it was decided to treat the two Starkillers as separate characters. Galaxies had been known for creating such duplicates of existing characters before, attaching Near-Human Zekka Thyne's name to a Bothan and Selonian Chertyl Ruluwoor's name to a Human.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Alliance_Military/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Pashna_Starkiller_(Mon_Calamari)",
  "/wiki/Starkiller_(disambiguation)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/Warlord_of_the_Empire",
  "/wiki/0_BBY/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Vanden_Willard/Legends",
  "/wiki/Adar_Tallon/Legends",
  "/wiki/Gray_Cadre",
  "/wiki/Operation_Shadow_Hand",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Surface_Marshal",
  "/wiki/Risiev_Credal",
  "/wiki/Yavin_4/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Thermal_exhaust_port/Legends",
  "/wiki/Battlestation",
  "/wiki/Medal_of_Bravery/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Battle_of_Calamari",
  "/wiki/Zgorth%27sth",
  "/wiki/Department_of_Threat_Assessment",
  "/wiki/Hair/Legends",
  "/wiki/Michael_Allen_Horne",
  "/wiki/Dark_Empire_Sourcebook",
  "/wiki/1993",
  "/wiki/2003",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/2012",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/Great_Temple/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/George_Stock",
  "/wiki/Leland_Chee",
  "/wiki/Near-Human",
  "/wiki/Zekka_Thyne",
  "/wiki/Zekka_Thyne_(Bothan)",
  "/wiki/Selonian/Legends",
  "/wiki/Chertyl_Ruluwoor_(Selonian)",
  "/wiki/Chertyl_Ruluwoor_(Human)",
  "/wiki/Retcon",
  "/wiki/The_Star_Wars_Storybook",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(PhotoComic)",
  "/wiki/Star_Wars_Manga:_A_New_Hope_4",
  "/wiki/Empire_15",
  "/wiki/Star_Wars_Official_Poster_Monthly_9",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Rules_of_Engagement:_The_Rebel_SpecForce_Handbook",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Special_Military_Unit_Intelligence_Update",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Premiere_Limited",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_1",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Star_Wars_Insider",
  "/wiki/StarWars.com",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_in_100_Scenes",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/May_8",
  "/wiki/Jedi_Council_Forums",
  "/wiki/March_6",
  "/wiki/2013"
 ]
}