{
 "name": "Pashna_Starkiller_(Mon_Calamari)",
 "display_name": "Pashna Starkiller  (Mon Calamari)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Pashna Starkiller was a male Mon Calamari member of the Rebel Alliance. In 1 ABY, he spent some time in the city of Bela Vistal on Corellia, where he ordered the assassination of an Imperial officer who threatened Rebel operations on Tralus.\nA Mon Calamari male, Pashna Starkiller resided in the city of Bela Vistal on Corellia in 1 ABY, when he heard word of a plot by a particularly ruthless Imperial commander—one who the Alliance had marked ever since he had first been promoted. This Imperial had managed to seize a Rebel CR90 corvette and kill its crew, and was prepared to crash it into a Rebel city on Tralus. Though Starkiller did not enjoy the prospect of having him killed, he realized that it was the only way to save the city, and so he recruited a spacer with Rebel ties into making his way onto the corvette and assassinating the commander. Starkiller first sent his associate to retrieve the necessary documentation they would need to infiltrate the vessel, then once that was accomplished, had them transported to the corvette, where they were able to stop the commander and save the Rebels on Tralus.\nDespite being a commander of wartime operations, Starkiller did not like to resort to assassination, and it took a lot to drive him to consider such means. He was nonetheless willing to forgo his personal qualms on the matter when it was required to preserve the security of the Rebellion.\nAn individual named Pashna Starkiller was first mentioned in Michael Allen Horne's Dark Empire Sourcebook, published in 1993. The name was mentioned again in publications such as Alliance Intelligence Reports and Rules of Engagement: The Rebel SpecForce Handbook as one of a group of Rebels including Jan Dodonna and Vanden Willard. In 2003, Star Wars Galaxies Multiplayer Online game included a Mon Calamari named Pashna Starkiller among its non-player characters. Since none of the previous sources established Starkiller's physical appearance, gender and species, it was assumed to be the first physical depiction of the character, even though fan reaction ranged from surprise to belief that \"Starkiller\" was not a name fitting a Mon Calamari.\nIn 2012, the article Rogues Gallery in Star Wars Insider 133 identified one of the Humans present at the Rebel celebration in the Massassi Temple at the end of Star Wars: Episode IV A New Hope as Pashna Starkiller, creating further controversy. When asked about the subject, the article's author Leland Chee explained that it was decided to treat two Starkillers as separate characters. Galaxies had been known for creating such duplicates of existing characters before, portraying Near-Human Zekka Thyne as a Bothan and Selonian Chertyl Ruluwoor as a Human.\nThe name \"Starkiller\" dates back to the earliest drafts of the Star Wars script, where it was the surname of a number of characters, elements of whom would later be used to create Luke and Anakin Skywalker. Other individuals named \"Starkiller\" in canon include Bendak Starkiller from Knights of the Old Republic and Banol Starkiller from Galaxies. The latter being a Rodian and the former's species being unknown, there is little to no likelihood of a family relation between Pashna and them. Starkiller is also the codename of Galen Marek, Darth Vader's secret apprentice from the video game The Force Unleashed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Starkiller_(disambiguation)",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/1_ABY/Legends",
  "/wiki/Bela_Vistal/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Tralus/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Pashna_Starkiller",
  "/wiki/Michael_Allen_Horne",
  "/wiki/Dark_Empire_Sourcebook",
  "/wiki/1993",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Rules_of_Engagement:_The_Rebel_SpecForce_Handbook",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Vanden_Willard/Legends",
  "/wiki/2003",
  "/wiki/2012",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/Human/Legends",
  "/wiki/Great_Temple/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Leland_Chee",
  "/wiki/Near-Human",
  "/wiki/Zekka_Thyne",
  "/wiki/Zekka_Thyne_(Bothan)",
  "/wiki/Selonian/Legends",
  "/wiki/Chertyl_Ruluwoor_(Selonian)",
  "/wiki/Chertyl_Ruluwoor_(Human)",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Canon",
  "/wiki/Gorse_Bendak",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Banol_Starkiller",
  "/wiki/Galen_Marek",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/Sony",
  "/wiki/Jedi_Council_Forums",
  "/wiki/March_6",
  "/wiki/2013",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film"
 ]
}