{
 "name": "Pashna_Veyaad",
 "display_name": "Pashna Veyaad",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Empire",
      "Eternal Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Pashna Veyaad was a male Human citizen of the Eternal Empire of Zakuul. Following the assassination of Valkorion in 3636 BBY, his son Arcann took the throne and began cracking down on various dissidents. Pashna sought justice for those condemned to exile in the Endless Swamp, which caused him to become a target of repressions himself. He eventually joined a group of exiles trying to survive in the swamp. In 3630 BBY their homes were assaulted and burned by the Skytroopers, who were searching for the Havoc Squad. Pashna and the others were rescued by Aric Jorgan and The Commander, who provided them shelter at Havoc encampment. The next day Havoc assaulted an outpost of the Knights of Zakuul with the goal to plant a wiretap on their communications. While the squad was cornered, Pashna led a group of rebels to assist them, personally downing a Zakuul dropship with a rocket launcher. As Jorgan departed with the Outlander to Odessen, he left Havoc Squad on Zakuul to teach Pashna and his rebels and get them to a proper fighting shape.\nPashna Veyaad appears in Star Wars: The Old Republic: Knights of the Fallen Empire Chapter 11: Disavowed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Zakuulan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Eternal_Alliance",
  "/wiki/Zakuul",
  "/wiki/Assassination_of_Valkorion",
  "/wiki/3636_BBY",
  "/wiki/Arcann",
  "/wiki/Endless_Swamp",
  "/wiki/3630_BBY",
  "/wiki/Skytrooper",
  "/wiki/Havoc_Squad",
  "/wiki/Aric_Jorgan",
  "/wiki/Alliance_Commander",
  "/wiki/Knights_of_Zakuul",
  "/wiki/Odessen",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire"
 ]
}