{
 "name": "Passel Argente's uncle",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Koorivar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Corporate Alliance Magistrate Passel Argente's uncle was a Koorivar male. He bribed Senator Bezz Drexx during the Clone Wars on behalf of the Confederacy of Independent Systems in exchange for Drexx's loyalty. However, he was caught in the act while giving Drexx credits at a party hosted by the senator, and evidence of Drexx's corruption ended up in the hands of the Republic.\nThe uncle of Corporate Alliance Magistrate Passel Argente was a Koorivar male who worked for the Confederacy of Independent Systems. During the Clone Wars fought between the Confederacy and Galactic Republic, the individual bribed the Republic's Senator Bezz Drexx with credits in exchange for Drexx's loyalty to the Separatists. Senator Bail Organa suspected that Drexx had been receiving bribes, but he never obtained any proof.\nThe Koorivar delivered one such payment at a party hosted by Drexx on the planet Coruscant. In order to get the senator alone, he had to pull Drexx away from talking with Senator Padmé Amidala and one of Senator Organa's aides, Sheltay Retrac, both of whom were already wary of Drexx after discussing his suspicious wealth with Organa.\nThe pair followed the Koorivar and senator, finding the Koorivar presenting Drexx with a case of money. The Separatist expressed his hope that it would be enough to keep Drexx loyal to the Confederacy, but the senator was more focused on a Narglatch speeder that the money would allow him to buy. However, he then noticed Amidala spying on their conversation and called for his guards to deal with her. She was able to escape with the evidence, which included a holovid of the Koorivar bribing the senator that she brought to the Republic.\nThe Koorivar was willing to bribe high officials for the Separatist cause. He had light blue skin and light blue eyes.\nArgente's uncle wore an orange robe made of shimmerbird tongues.\nPassel Argente's uncle appeared in \"Spy Girls,\" a short comic story written by Ryan Kaufman, illustrated by Stewart McKenny, and published in the seventh volume of the Star Wars: Clone Wars Adventures graphic novel series on January 31, 2007.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Koorivar/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Corporate_Alliance/Legends",
  "/wiki/Magistrate/Legends",
  "/wiki/Passel_Argente/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Bezz_Drexx",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Sheltay_Retrac/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Narglatch_AirTech/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Security_guard/Legends",
  "/wiki/Holovid/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Shimmerbird_tongue_robe/Legends",
  "/wiki/Shimmerbird/Legends",
  "/wiki/Tongue/Legends",
  "/wiki/Spy_Girls",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Stewart_McKenny",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_7",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/January_31",
  "/wiki/2007",
  "/wiki/Category:Images_of_Passel_Argente%27s_uncle",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Atlas",
  "/wiki/Dark_Horse_Comics"
 ]
}