{
 "name": "Patra_Tebut",
 "display_name": "Patra Tebut",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Anakin Solo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free AlliancesGalactic Alliance Guard",
      "Galactic Alliance Guard"
     ]
    }
   ]
  }
 ],
 "content": "Patra Tebut was a female watch officer on the starship Anakin Solo.\nShortly after the battle of Gilatter VIII, Patra Tebut was working on the Anakin Solo when Ben Skywalker docked the Sith Meditation Sphere he had recovered while on his mission to Ziost in the Anakin Solo's hangar bay. Colonel Jacen Solo ordered her to remove all traces of the ship from the records, and that nobody had seen it, it hadn't docked, and for most purposes, the sphere did not exist. She complied quickly and effectively, leading Solo to muse that like Captain Lon Shevu, Tebut was utterly reliable.\nFollowing the escape of the Anakin Solo from Kashyyyk after their attack on that world, Tebut became an executive officer candidate, and began training on all of the bridge stations present on the Anakin Solo. It was Tebut who discovered that the Jedi had placed a tracking beacon on the cloak that Darth Caedus, once Jacen Solo, had been wearing. While upset that he had allowed the Jedi to plant a tracer on his cloak, Caedus was pleased with Tebut's performance, and ordered the ship's Captain Kral Nevil to place a commendation in her permanent record.\nA short time later, the Anakin Solo encountered General Tycho Celchu's shuttle, apparently being chased by a squadron of Confederation X-Wings. The shuttle broadcast all the correct identification codes and passwords, and Tebut allowed the shuttle to land. What she did not know was that General Celchu was not on board the shuttle, instead a strike team consisting of Jedi and their allies were on board. The Jedi infiltrated the Anakin Solo, and were able to successfully rescue Tenel Ka's daughter Allana from the ship.\nAfter the Jedi had departed, Darth Caedus returned to the bridge and demanded to know who had allowed the shuttle to dock. Tebut admitted that she had allowed the shuttle to dock, but that the shuttle had broadcasted all the correct codes and passwords. Caedus, however, disagreed and began choking her with the Force. Captain Nevil attempted to stop him, only to be telekinetically hurled against a bulkhead. In her last moments, Tebut protested her loyalty to Caedus, but only succeeded in enraging him to the point where he was literally seeing red. Finally, after vociferously accosting her for her failure, Caedus snapped her neck and unceremoniously slammed her down onto the deck and stormed off the bridge. This act, committed in such anger, truly bound Caedus to the ways of his grandfather, Darth Vader.\nCaedus's Co-Chief of State, Admiral Cha Niathal, was alarmed at Tebut's murder and began considering having Caedus removed from power. However at this point Niathal was still unwilling to overtly oppose Caedus, and refused to have Caedus taken out immediately. Niathal later informed Luke Skywalker of the nature of Tebut's death and that his nephew was responsible; Skywalker was not particularly surprised that this had happened. Caedus himself would later regret his outburst, having deprived himself of a valuable officer and in turn harming his reputation amongst the ranks.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Patra_Tebut",
  "/wiki/40_ABY",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Officer/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Battle_of_Gilatter_VIII",
  "/wiki/Gilatter_VIII",
  "/wiki/Ben_Skywalker",
  "/wiki/Ship_(Sith_Meditation_Sphere)",
  "/wiki/Ziost/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Captain/Legends",
  "/wiki/Lon_Shevu",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Battle_of_Kashyyyk_(Second_Galactic_Civil_War)",
  "/wiki/Kral_Nevil",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Confederation",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Allana_Solo",
  "/wiki/Telekinesis/Legends#Force_Choke",
  "/wiki/Cha_Niathal",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}