{
 "name": "Pax Maripher",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  }
 ],
 "content": "Pax Maripher was a human male involved with illegal gemstone trading with his partner Rahara Wick. Maripher survived an attack by Delphidian pirates when he was only five years old by hiding in an equipment hatch, but everyone else onboard, including his parents, were killed. Maripher was raised by protocol droids for the next fifteen years on a derelict starship in the middle of Wild Space before being rescued by a Galactic Republic cruiser at the age of twenty. As a result, Maripher's behavior and mannerisms were distinctly unusual. Although he had a trademark bad attitude, Maripher was a loyal friend and had a good heart.\nMaripher and Wick traveled to the planet Pijal, where they looked to profit off of kohlen crystals, which could pass as kyber crystals to the unexperienced eye. However, shortly into their venture on Pijal's moon, they were approached by Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi. Maripher tried to resist speaking with them, pretending his shovel was in fact a blaster and refusing to lower his \"weapon,\" but Wick called him out and allowed the Jedi onboard their ship, the Meryx. Although Maripher was unhappy about collaborating with the Jedi, Wick agreed to help the two Jedi search for signs of the Opposition, a terrorist group that was causing trouble on Pijal. Later, he helped break Wick out of enslavement by Czerka Corporation.\nPax Maripher first appeared in the canon novel Master \u0026 Apprentice, which was written by Claudia Gray and published in 2019. Gray imagined Maripher as being portrayed by actor Shaun Evans.\nIn an interview with StarWars.com, Gray described the process of creating Maripher, stating that he and his partner Wick were based on the dynamic of the characters from the Sherlock Holmes television series Elementary. As Wick's character was created as a \"female, more no-nonsense Watson character,\" Maripher was designed from the beginning as a \"know-it-all.\" Gray further developed the character by exploring how he had become that way, imagining him as having been raised by protocol droids.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pax_(disambiguation)",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Coruscanti",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Gemstone",
  "/wiki/Rahara_Wick",
  "/wiki/Delphidian",
  "/wiki/Pirate",
  "/wiki/Protocol_droid",
  "/wiki/Standard_year",
  "/wiki/Starship",
  "/wiki/Wild_Space",
  "/wiki/Galactic_Republic",
  "/wiki/Cruiser",
  "/wiki/Planet",
  "/wiki/Pijal",
  "/wiki/Kohlen_crystal",
  "/wiki/Kyber_crystal",
  "/wiki/Pijal%27s_moon",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Blaster",
  "/wiki/Meryx",
  "/wiki/Jedi",
  "/wiki/Opposition",
  "/wiki/Czerka_Arms",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Pax_Maripher",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Claudia_Gray",
  "/wiki/2019",
  "/wiki/StarWars.com",
  "/wiki/Master_%26_Apprentice_(audiobook)"
 ]
}