{
 "name": "Pax_Bonkik",
 "display_name": "Pax Bonkik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mars Guo"
     ]
    }
   ]
  }
 ],
 "content": "Pax Bonkik was a male Rodian mechanic, and along with his brother, Trax Bonkik, served as a slave to the Podracer Mars Guo. Guo worked the siblings to near-exhaustion. Pax eventually struck up a friendship with the racer Teemto Pagalies, who abhorred slavery, especially since the object of his affections, Ann Gella, was herself a slave. By some point around the Boonta Eve Classic of 32 BBY, Pax Bonkik became a mercenary. During the event, Guo sustained crippling damage from another Podracer, Sebulba. While Guo was healing from his wounds, Sebulba arranged to have Guo's possessions auctioned off.\nPagalies, who had himself survived a crash during the race, was only able to free Pax, with Trax being sold off to Sebulba. Pax, however, was determined to save his brother, and worked for Pagalies until he had earned enough to repay the racer. When Pagalies won the Aleen Classic, he had enough credits to free Ann Gella, but at the last moment, he chose to free Trax, finally reuniting him with his brother.\nThe Rodian male Pax Bonkik hailed from Rodia, and had a bond with his brother, Trax. Their parents were spice addicts and shiftless, selling their children into slavery. Pax decided to look out for his brother during those times, and the two drifted from owner to owner, eventually learning skills to increase their worth. They primarily worked as mechanics, and ended up working for a minor league Podracer, Mars Guo.\nGuo forced the siblings to work to near-exhaustion on his Podracer, a Plug-2 Behemoth, and the pair were also subjected to Guo's constant boasting. In a rare moment of peace and quiet, Pax befriended Teemto Pagalies, another Podracer. Pagalies was staunchly against slavery, particularly because the object of his affections, Ann Gella, was in fact a slave of another Podracer, Sebulba.\nIn 32 BBY, Guo intended to compete in the Boonta Eve Classic on Tatooine, one of the largest and most prestigious of all Podraces. By that time, Pax Bonkik had also become a mercenary. Shortly before the race, Trax entered into an argument with Guo, and the latter mercilessly beat the Rodian mercilessly and claimed that after the race, he would sell Trax off, thereby separating the siblings.\nPax, seeking to avert such an occurrence, contacted Pagalies, who was also participating in the race. He explained the situation, and also told Pagalies that Guo had his eyes on Gella, and likely intended to purchase her from Sebulba. Pagalies was skeptical, but he disliked the idea of having the Bonkiks separated, or worse, the thought of Gella in the clutches of Guo.\nDuring the race, Guo's Podracer was destroyed by Sebulba. While this could have proved advantageous for the Bonkiks, it turned out to be disastrous. A bitter Sebulba, who had lost the race to Anakin Skywalker, a local boy, arranged to have Guo's possessions auctioned while Guo lay in the infirmary. Pagalies had also sustained the loss of his Podracer during the tumultuous race, and was only able to afford to buy Pax at the auction, while Trax fell into the possession of Sebulba.\nDespite the fact that he was free, Pax decided to stay on with Pagalies, and served as his mechanic, traveling the racing circuit and on the lookout for Sebulba or Trax. Eventually, Pax was able to raise enough credits to pay Pagalies back for his kindness on Tatooine. Pagalies won the Aleen Classic, and was finally able to purchase Ann Gella's freedom. At the last minute, however, Pagalies relented, and purchased Trax, reuniting the Rodians. The siblings would never again be apart.\nPax Bonkik had a strong companionship with his brother, Trax. They stayed together through their slavery, and the well-being of Trax was high in Pax's priorities. He became friends with Teemto Pagalies, and sought out the latter's help when he felt that Guo would sell off Trax and purchase Ann Gella. When the machinations of Sebulba threatened to tear them apart, and Pagalies was only able to pay for freeing Pax, the Rodian stayed in the Podracer's company, and even though he did not have to, worked as a mechanic for Pagalies. Pax Bonkik stood at a height of 1.7 meters and had green skin and black eyes.\nPax Bonkik was armed with a blaster pistol, and used repair tools during his work as a mechanic. He also wore a green jumpsuit with a blue vest.\nPax Bonkik first appeared in George Lucas' 1999 prequel trilogy film Star Wars: Episode I The Phantom Menace, during the Boonta Eve Podrace scene. With the character as of then not having any official name, the Rebellion Era Sourcebook, published in 2001, includes an image of Bonkik next to the entry of another Rodian, Clezo. In 2005, however, the character would be established as separate from Clezo, when user javajawas, through the StarWars.com Hyperspace feature \"What's The Story?,\" gave an entry for Bonkik.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Pax_(disambiguation)",
  "/wiki/Rodia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Mars_Guo/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Trax_Bonkik",
  "/wiki/Slavery/Legends",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Teemto_Pagalies/Legends",
  "/wiki/Ann_Gella/Legends",
  "/wiki/Boonta_Eve_Classic_(32_BBY)",
  "/wiki/32_BBY/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Sebulba/Legends",
  "/wiki/Boonta_Eve_Classic/Legends",
  "/wiki/Aleen_Classic",
  "/wiki/Spice/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Plug-2_Behemoth",
  "/wiki/Tatooine/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Time/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/George_Lucas",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/2001",
  "/wiki/Clezo",
  "/wiki/2005",
  "/wiki/Javajawas",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Young_Jedi_Collectible_Card_Game",
  "/wiki/The_Jedi_Council",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Category:Images_of_Pax_Bonkik",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Racer_Revenge"
 ]
}