{
 "name": "Paz_Vizsla",
 "display_name": "Paz Vizsla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.91 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "House Vizsla",
      "Clan Vizsla",
      "Clan Vizsla"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "The Tribe",
      "The Tribe"
     ]
    }
   ]
  }
 ],
 "content": "Paz Vizsla was a male human Heavy Infantry Mandalorian from the planet Mandalore who was a member of the Tribe, a part of the Children of the Watch, during the reign of the New Republic, living in a hidden covert on the planet Nevarro. Vizsla had a great disdain for the fallen Galactic Empire and anyone affiliated with it due to the Empire's role in the Great Purge of Mandalore against the Mandalorians.\nWhen the Mandalorian bounty hunter Din Djarin used Imperial-seized beskar provided to him by the forces of an Imperial remnant to create his armor, Vizsla confronted and fought Djarin for doing business with the Empire. The altercation was broken up by the Tribe's armorer. Vizsla and other members of the Tribe later protected Djarin from a number of bounty hunters, allowing him to escape to his starship with a child he had rescued from the Imperial remnant. As a result of the rescue, the Imperial remnant discovered the tribe and attacked it, killing most of its members, although Vizsla survived and was able to escape.\nVizsla, joined by the Armorer, founded a new covert on the space station Glavis Ringworld. There, they were eventually joined by Djarin, who had wounded himself with the Darksaber. Vizsla tended to his wounds, and observed Djarin's training with the Armorer. Seeing that Djarin was not successful in his training, he challenged Djarin to a duel, as he wanted to restore the Darksaber, which was created by his ancestor Tarre Vizsla, back to his clan. During the duel, Vizsla was able to take the Darksaber from Djarin, but he was ultimately defeated. When Vizsla later learned that Djarin had removed his helmet, he called him an apostate and told him to leave, which Djarin did, with the Darksaber still at his possession.\nHailing from the planet Mandalore, the Mandalorian Paz Vizsla of Clan Vizsla was a descendant of Mandalore Tarre Vizsla, a Jedi Mandalorian who founded the larger faction of House Vizsla and created the Darksaber—a legendary black lightsaber which gave its wielder claim to the throne of Mandalore—over a millenia before Vizsla's lifetime. During the Galactic Empire's reign, the Mandalorian Bo-Katan Kryze laid claim to rule Mandalore based purely on her blood and her ownership of the Darksaber, which was gifted to her. Vizlsa was a member of the Children of the Watch, who were dedicated followers of the ancient creed Way of the Mandalore. Followers of the Way like Vizsla did not believe in Kryze's claim as she had not won the lightsaber in combat, but had been given it by fellow Mandalorian Sabine Wren. With Kryze and her Mandalorian followers defying the Empire, the larger faction carried out the Great Purge of Mandalore, heavily bombing the surface of the planet and massacring many Mandalorians in what became known as the Night of a Thousand Tears.\nVizsla and other followers of the ancient way had been on Mandalore's moon of Concordia, and so survived the onslaught of the Night. The remaining Mandalorians subsequently scattered throughout the galaxy thereafter and hid in Mandalorian coverts to preserve their numbers. During the reign of the New Republic, Vizsla resided with the Tribe in a covert on the planet Nevarro. Due to the Great Purge, the Tribe's members were forced to remain hidden in their enclave, with Vizsla guarding the armory within as a heavy infantry Mandalorian. In around 9 ABY, Vizsla witnessed the Mandalorian bounty hunter Din Djarin enter the covert with a camtono of beskar. Vizsla and several other Mandalorians watched as Djarin gave the beskar to the Tribe's armorer and leader, intending to have armor forged from it.\nVizsla inspected the beskar, which had been taken by the Empire during the Great Purge and given to Djarin by an Imperial remnant in return for the delivery of the infant Grogu. Accusing Djarin of cowardice, Vizsla confronted him, the anger in his voice growing, leading to an altercation between the two Mandalorians. As Djarin and Vizsla held their vibroblades at each other, the Armorer broke up the fight, asking them if they had removed their helmets, and reminding them of the Way of the Mandalore. Vizsla stepped aside, allowing the Armorer to forge armor for Djarin.\nShortly afterward, Djarin was confronted by a number of Bounty Hunters' Guild members led by Greef Karga after he rescued Grogu from the Imperial remnant. Karga intended to kill Djarin if he did not hand over Grogu, but the members of the Tribe arrived to protect the bounty hunter, descending from above with their jetpacks. Vizsla landed near Djarin, forming a tightly organized fire team.\nShooting down a number of bounty hunters with his blaster cannon, he helped force the Guild members back and created an escape route for Djarin. Turning to Djarin, Vizsla told him to escape while the Tribe held off the bounty hunters. Djarin stated that the enclave would need to be moved due to the Tribe's interference, which Vizsla acknowledged, citing the Way of the Mandalore. Vizsla provided cover as Djarin escaped to his starship, the Razor Crest, leaving Nevarro. As the Razor Crest departed, Vizsla flew alongside the vessel with his jetpack and saluted Djarin before turning back towards the ground.\nAs a result of the rescue, the Bounty Hunters' Guild lost control of Nevarro, and the Imperial remnant cracked down on the Tribe for their part in the incident. The covert was attacked by forces of the remnant, and most of its members were killed. Vizsla was able to escape the massacre, though, and the Armorer, who had also survived, stayed at the covert to gather her resources. She believed that some Mandalorians like Vizsla had managed to escape the planet.\nOne of the few survivors of the Tribe, Vizsla sought refuge on the space station Glavis Ringworld with the Armorer, trying to help her rebuild their forge and settlement from the caverns of Nevarro. They left signs leading to their new covert along Glavis Ringworld's Kolzoc Alley that were visible to vision settings in a macrobinocular viewplate. Soon enough, Din Djarin was able to find the signs and make his way into the covert, collapsing before the Armorer due to his injuries. The Armorer had Vizsla tend to the new arrival, and the heavy infantry Mandalorian took some bacta spray to heal a wound on Djarin's left leg.\nAs Vizsla healed the fellow Mandalorian's injury, Djarin thanked him for saving him on Nevarro and apologized for Vizsla having to sacrifice the covert, Vizsla replying that there were now three of them and promising that Djarin would be put to work soon. The Armorer inquired what weapon caused Djarin's wound and the Mandalorian revealed the Darksaber. Vizsla stared at the weapon of his ancestor, Tarre Vizsla, and the Armorer asked him to bring it to her, which he did so. The heavy infantry Mandalorian then watched as the Armorer inspected the black lightsaber and discussed its significance with Djarin.\nAfter the Armorer confirmed that Djarin had completed his quest in returning Grogu to the Jedi, she welcomed him back into the covert and the Mandalorian and Vizsla set up a new forge for her. Vizsla asked Djarin how he had acquired the Darksaber, and the fellow Mandalorian confirmed he done so by defeating Moff Gideon, who had been involved in the Great Purge. The heavy infantry Mandalorian asked if Gideon was killed in the duel, only to hear that the moff had been sent to the New Republic instead to face justice. Vizsla declared that death would have been justice for Gideon, the Armorer agreeing as millions of Mandalorians had died because of the moff. Vizsla remained present as the Armorer and Djarin talked about the curse that led to the Great Purge.\nDjarin later underwent training with the Darksaber under the Armorer, who criticized the Mandalorian's lack of focus with wielding the blade. Watching the session, Vizsla yearned for the saber which had spawned from his lineage and approached the pair, challenging Djarin to a duel for the Darksaber. Djarin accepted, and the pair removed their jetpacks and prepared to fight. Vizsla drew his vibroblade and activated his Personal Combat Shield whilst his opponent activated the Darksaber. In the ensuing fight, both combatants clashed their blades against one another, with Vizsla soon having his knife cut in two.\nTaking advantage of Djarin's more sluggish movements with the Darksaber, Viszla forced his opponent's blade downwards and threw him to a lower level. Smacking his downed opponent into a wall, Vizsla proudly picked up the Darksaber and proclaimed that fate had returned it to his clan and decided Djarin's demise. Unfortunately for him, he too wielded the blade sluggishly, allowing Djarin to outmaneuver him swiftly stab him in the gaps of his armor. Djarin held his vibroblade around his challenger's throat, and the Armorer concluded the duel over, with Djarin being the winner.\nThe Armorer asked whether any of them had removed their helmet around anyone. Vizsla confirmed that he had not; however, Djarin begrudgingly admitted that he had. Vizsla called the Mandalorian an apostate of the Way of the Mandalore and told him to leave. The Armorer told the disgraced Mandalorian that he could only find atonement in the living waters beneath the mines of Mandalore, which Djarin believed was destroyed. Djarin thus left and took the Darksaber with him.\nA human male Mandalorian, Paz Vizsla despised the Galactic Empire and anyone who affiliated themselves with it due to the events that had happened to the Mandalorians during the Great Purge. A born survivor, he was determined to help preserve the Mandalorian heritage after the event. Vizsla accused the Mandalorian bounty hunter Din Djarin of being a coward for taking jobs from former Imperials. However, despite their differences, Vizsla followed the Way of the Mandalore foremost, protecting Djarin when he was attacked by the Bounty Hunters' Guild. Vizsla was extremely devoted to the Way and to his lineage, claiming to be the rightful owner of the Darksaber due to his ancestry and calling Djarin an \"apostate\" for his admittance to removing his helmet in front of others. When he observed that Djarin was unsuccessful in his training with the Darksaber, he was sure that he could beat Djarin and thought that he was more worthy to wield the Darksaber. However, he was unable to defeat Djarin in combat.\nVizsla was skilled in combat, able to wield a heavy blaster cannon and fend off a number of attackers at once. During his duel against Djarin, he showed himself rather formidable and used his great strength to his advantage. However, he ultimately lost.\nPaz Vizsla wore heavy Mandalorian armor made of beskar with a blue color and a mythosaur skull emblem on his pauldron. His left vambrace held a large wrist-mounted flamethrower. He also wore a jetpack, a kama, and gravity stabilizer for flight balance, had a Personal Combat Shield and carried both a heavy blaster cannon and a vibroblade. His helmet had infrared scope.\nPaz Vizsla appeared in \"Chapter 3: The Sin\" of the live-action Disney+ series The Mandalorian, released on November 22, 2019. While not identified in the episode, Paz Vizsla's name was given in the credits. When \"The Sin\" originally aired, its credits identified him as \"Paz Vizla,\" though they were later updated to read \"Paz Vizsla.\" Vizsla was voiced by series creator Jon Favreau—a nod to his first role for Dave Filoni, the character of Pre Vizsla in the animated series Star Wars: The Clone Wars—and portrayed by Tait Fletcher, who previously appeared as a trawler in the first episode of the series. In \"Chapter 5: Return of the Mandalorian\" of the live-action series The Book of Boba Fett, which was directed by Bryce Dallas Howard and released on January 26, 2022, Vizsla was portrayed once again by Fletcher, with Rich Cetrone serving as stunt double.\nFletcher learned about his part as Vizsla shortly after he received the news that he was chosen to play the trawler character, but was unaware of the exact role until construction of the suit was underway. Fletcher claimed that playing his two characters was an incredible experience, remarking on the galvanizing nature of Vizsla's character.\nVizsla was designed by Brian Matyas, who was influenced by the Brutalist and geometric shapes of Art Deco and the German Expressionist movement when designing Vizsla's angular helmet. The blaster cannon Vizsla carried was a nod to the M56 Smartgun from the science fiction film Aliens. Matyas created concept art of Vizsla in the Mandalorian covert and during the Nevarro skirmish, while art depicting a Mandalorian using a jetpack to fly alongside the Razor Crest was created by Doug Chiang and John Park; however, the pictured Mandalorian's armor appears similar to Djarin's rather than Vizsla's.\nDin Djarin and Other Bounty Hunters and Criminals, an issue of De Agostini's Star Wars Encyclopedia series, claims that Vizsla's homeworld was Concordia and that his height was 1.93 meters. The 2021 reference book Star Wars: Character Encyclopedia, Updated and Expanded Edition contradicts both details, stating that the homeworld was Mandalore and that Vizsla's height was 1.91 meters. This article uses the information from the latter source.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Mandalore",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/House_Vizsla",
  "/wiki/Clan_Vizsla",
  "/wiki/Mandalorian",
  "/wiki/The_Tribe",
  "/wiki/Heavy_Infantry_Mandalorian",
  "/wiki/Planet",
  "/wiki/Children_of_the_Watch",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Mandalorian_covert",
  "/wiki/Nevarro",
  "/wiki/Galactic_Empire",
  "/wiki/Great_Purge_of_Mandalore",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Beskar",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Mandalorian_armor",
  "/wiki/The_Armorer",
  "/wiki/Starship",
  "/wiki/Grogu",
  "/wiki/Incident_on_Nevarro",
  "/wiki/Attack_on_the_Tribe",
  "/wiki/Mandalorian_covert_(Glavis_Ringworld)",
  "/wiki/Space_station",
  "/wiki/Glavis_Ringworld",
  "/wiki/Darksaber",
  "/wiki/Duel_on_Glavis_Ringworld",
  "/wiki/Tarre_Vizsla",
  "/wiki/File:PazVizlaCoward-TMS01CH03.ogg",
  "/wiki/Homeworld",
  "/wiki/Mandalore_(title)",
  "/wiki/Jedi",
  "/wiki/Color",
  "/wiki/Lightsaber",
  "/wiki/Imperial_Era",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Way_of_the_Mandalore",
  "/wiki/Sabine_Wren",
  "/wiki/Night_of_a_Thousand_Tears",
  "/wiki/Moon",
  "/wiki/Concordia",
  "/wiki/The_galaxy",
  "/wiki/New_Republic_era",
  "/wiki/9_ABY",
  "/wiki/Camtono",
  "/wiki/Vibroblade",
  "/wiki/Mandalorian_Armorer",
  "/wiki/Armor",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Greef_Karga",
  "/wiki/Death",
  "/wiki/Jetpack",
  "/wiki/Blaster_cannon",
  "/wiki/Razor_Crest",
  "/wiki/Armorer",
  "/wiki/Kolzoc_Alley",
  "/wiki/Macrobinocular_viewplate",
  "/wiki/Bacta_spray",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Personal_Combat_Shield",
  "/wiki/Living_waters",
  "/wiki/Mines_of_Mandalore",
  "/wiki/File:PazVizlaStrength-TMS01CH03.ogg",
  "/wiki/Mythosaur",
  "/wiki/Pauldron",
  "/wiki/Mandalorian_vambrace",
  "/wiki/Flamethrower",
  "/wiki/Kama",
  "/wiki/Chapter_3:_The_Sin",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/November_22",
  "/wiki/Jon_Favreau",
  "/wiki/Dave_Filoni",
  "/wiki/Pre_Vizsla",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Tait_Fletcher",
  "/wiki/Unidentified_alpha_trawler",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Bryce_Dallas_Howard",
  "/wiki/January_26",
  "/wiki/2022",
  "/wiki/Brian_Matyas",
  "/wiki/Doug_Chiang",
  "/wiki/John_Park",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/2021",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Category:Audio_files_of_Paz_Vizsla",
  "/wiki/Category:Images_of_Paz_Vizsla",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian:_A_Clan_of_Two",
  "/wiki/The_Mandalorian:_Magnetic_Fun",
  "/wiki/The_Mandalorian_3",
  "/wiki/The_Mandalorian_Season_Three",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_195",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_One",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Cast",
  "/wiki/Process",
  "/wiki/StarWars.com",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Mandalorian:_Allies_%26_Enemies",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Mandalorian",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_11:_The_Heiress",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore",
  "/wiki/Chapter_7:_The_Reckoning",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_8:_Redemption",
  "/wiki/February_10",
  "/wiki/2020",
  "/wiki/November_1",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/September_24",
  "/wiki/2019",
  "/wiki/June_23"
 ]
}