{
 "name": "Pedrin Gaul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Denon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Red Squadron"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Harb Binli"
     ]
    }
   ]
  }
 ],
 "content": "Pedrin Gaul was a human male who flew as a Rebel pilot in the Alliance to Restore the Republic, operating under the callsign \"Red Five.\" He was once a transport pilot before helping fugitives who were hunted by the Galactic Empire escape from Denon, for which he was branded a traitor of the Empire. He, as a Cadet, was killed in action while flying his T-65B X-wing starfighter for the Alliance during the Battle of Scarif. Gaul's callsign was later taken by Luke Skywalker, who destroyed the Death Star during the Battle of Yavin.\nPedrin Gaul hailed from the planet Denon and was born some time prior to the Galactic Civil War. On his homeworld, he was a transport pilot and ferried both passengers and freight throughout the metropolitan skylanes of Denon. He remained in this career until he helped fugitives who were hunted by the Galactic Empire escape from Denon. For his actions in this exodus, the Empire branded Gaul a traitor and he fled his homeworld.\nGaul joined the Alliance to Restore the Republic, became a cadet in the Alliance Fleet, and was stationed at the Great Temple on Yavin 4. He flew a T-65B X-wing starfighter for Red Squadron and was given the callsign Red Five.\nAt some point prior to 0 BBY, Gaul was scheduled Shift Cycle 2 of an X-wing flight patrol mission along with fellow pilots Cdt. Harb Binli  and Lt. Nozzo Naytaan . Their mission was to route from Yavin to Gordian Trace Relays, perform a flyby of surrounding space, then after verifying visual and sensor all clear, perform close uplink of passive relay recordings.\nLater, Gaul flew with his squadron during the Battle of Scarif, where they and the rest of the Alliance Fleet provided support for Jyn Erso and her team, Rogue One, as they fought to steal the plans to the Empire's planet-killing superweapon, the Death Star. Gaul was killed in action during the battle, as the Alliance attempted to destroy the Shield Gate that protected Scarif and, for a time, prevented Rogue One from transmitting the Death Star plans to the Alliance Fleet. The plans were ultimately transmitted and given to Princess Leia Organa.\nUpon the moment of Gaul's death, Admiral Raddus could hear his anguished scream over the starfighter's frequency.\nThe Red Five callsign was left vacant as a result of Gaul's death. Not long after the Battle of Scarif, aspiring Jedi Luke Skywalker helped Princess Leia bring the plans stolen from Scarif to Yavin 4. The Alliance found the weakness built into the battle station by its designer, Galen Erso, and launched the Battle of Yavin to destroy the Death Star. Skywalker flew under the Red Five callsign and fired the shot that destroyed the Death Star, honoring the sacrifice of Pedrin Gaul and all those who died on Scarif.\nPedrin Gaul was a human male with black hair, brown eyes, and light skin. Base One's Fighter Boss Nera Kase considered him to be awkward yet eager. His signs of eagerness was shown when he was a teacher and wingmate to Cadet Harb Binli.\nPedrin Gaul was created for the 2016 film Rogue One: A Star Wars Story. His backstory was fleshed out in the reference book Star Wars: Rogue One: The Ultimate Visual Guide, by Lucasfilm Story Group creative executive Pablo Hidalgo.\nHe was portrayed by stunt performer David Forman.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Denon",
  "/wiki/0_BBY",
  "/wiki/Scarif",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Harb_Binli",
  "/wiki/Rebel_pilot",
  "/wiki/Callsign",
  "/wiki/Red_Five",
  "/wiki/Transport",
  "/wiki/Pilot",
  "/wiki/Galactic_Empire",
  "/wiki/Treason",
  "/wiki/Cadet",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Battle_of_Scarif",
  "/wiki/Luke_Skywalker",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Galactic_Civil_War",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Red_Seven",
  "/wiki/Lieutenant",
  "/wiki/Nozzo_Naytaan",
  "/wiki/Red_Nine",
  "/wiki/Yavin_Prime",
  "/wiki/Gordian_Reach",
  "/wiki/Garven_Dreis",
  "/wiki/Squadron",
  "/wiki/Jyn_Erso",
  "/wiki/Rogue_One",
  "/wiki/Death_Star_plans",
  "/wiki/Death",
  "/wiki/Superweapon",
  "/wiki/Shield_Gate",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Jedi",
  "/wiki/Battle_station",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Nera_Kase",
  "/wiki/2016",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Duty_Roster",
  "/wiki/Grounded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/August_8",
  "/wiki/2019"
 ]
}