{
 "name": "Peet_Deretalia",
 "display_name": "Peet Deretalia",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance ground crew",
      "Resistance ground crew"
     ]
    }
   ]
  }
 ],
 "content": "Peet Deretalia was a human female who worked as a technician for the Resistance ground crew. During Deretalia's service, she became affectionate toward X-wing pilot Theo Meltsa, but she was too timid to introduce herself. By 34 ABY, the astromech droid BB-8 enacted a scheme that introduced Deretalia to Meltsa, and the two humans immediately bonded. Deretalia thanked BB-8 with an extra oil bath, and she sent a commendation of the droid to Commander Poe Dameron.\nA human female, Peet Deretalia was a technician who served in the Resistance against the First Order. Working for the ground crew at the Resistance base on D'Qar, Deretalia serviced and maintained T-70 X-wing starfighters and Resistance droids. During her time as a technician, Deretalia fell in love with Resistance pilot Theo Meltsa. Likewise, Meltsa had feelings for Deretalia, but they were both too shy to introduce themselves.\nBy 34 ABY, the astromech droid BB-8 took notice of Deretalia and Meltsa's mutual feelings, so the droid formed a plan to introduce them. BB-8 sabotaged Meltsa's X-wing starfighter and approached Deretalia, halting her work by repeatedly bumping into her. Deretalia quickly grew irritated of BB-8's antics and told the droid to stop, but the droid continued, knocking her off balance and causing her to fall into Meltsa.\nDeretalia and Meltsa immediately bonded, and the pilot introduced himself, asking Deretalia if she could repair his ship. Deretalia cheerfully obliged, and she invited Meltsa to get a meal, stating that she knew the chef in the mess hall. Meltsa accepted her offer, and before the two left, Deretalia thanked BB-8 with a kiss. Hand-in-hand, Deretalia and Meltsa departed for the mess hall.\nLater, Deretalia spoiled BB-8 with an extra oil bath, and she sent a note to Commander Poe Dameron, praising BB-8's wisdom. In the note, Deretalia also expressed concern for Meltsa's safety, and she requested that Dameron watch over him.\nDeretalia had black hair, green eyes, and dark skin. She had affectionate feelings for Meltsa, but she was too bashful to introduce herself. When Deretalia's work was disrupted by BB-8, she was annoyed, but she became grateful once she understood the droid's plan. Deretalia worried for Meltsa every time he entered his X-wing, and she voiced her concerns to Commander Dameron.\nAs a technician, Deretalia performed maintenance tasks on T-70 X-wing starfighters, and she was also responsible for servicing Resistance droids. When Meltsa's X-wing motivator was sabotaged by BB-8, Deretalia was easily able to repair the ship.\nDeretalia wore brown gloves, black boots, and green overalls over a dark-green shirt. When working on Resistance starfighters, Deretalia carried a toolbox containing an assortment of devices. As a technician for the Resistance's droid pool, Deretalia had access to oil baths.\nPeet Deretalia appeared in \"SaBBotage,\" a comic story created by Chris Eliopoulos and Jordie Bellaire. The story was first published in issue 1 of the Star Wars: Poe Dameron comic book series in 2016. The name \"Peet Deretalia\" is a tuckerization of \"Pete The Retailer,\" a co-host of the Star Wars Minute fan podcast.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Peet_(disambiguation)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_ground_crew",
  "/wiki/Resistance_technician",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Resistance_pilot",
  "/wiki/Theo_Meltsa",
  "/wiki/34_ABY",
  "/wiki/BB-series_astromech_droid",
  "/wiki/BB-8",
  "/wiki/Oil_bath",
  "/wiki/Astromech_droid",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Droid",
  "/wiki/Time",
  "/wiki/Saboteur",
  "/wiki/X-wing_starfighter",
  "/wiki/Pilot",
  "/wiki/Starship",
  "/wiki/Foodstuff",
  "/wiki/Unidentified_Resistance_chef",
  "/wiki/Limb",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Starfighter",
  "/wiki/Motivator",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Clothing",
  "/wiki/Oil",
  "/wiki/SaBBotage",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Chris_Eliopoulos",
  "/wiki/Jordie_Bellaire",
  "/wiki/Poe_Dameron_1",
  "/wiki/Star_Wars:_Poe_Dameron",
  "/wiki/2016",
  "/wiki/Tuckerization",
  "/wiki/Category:Images_of_Peet_Deretalia",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_62",
  "/wiki/Droid_Directory",
  "/wiki/Attack_on_Tuanul",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Tuanul",
  "/wiki/Standard_year"
 ]
}