{
 "name": "Pela",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Pela was a human female who resided in Wyke Town on the Galactic Frontier astronomical object Loreth during the High Republic Era. She was the niece of Layton Wyke, the community's founder, who believed she was often too frightened to survive on the frontier. On one occasion, Pela stole Wyke's receiver unit and, after being caught by her uncle, insisted she had only been wanting to hear the Jedi signal broadcast from Starlight Beacon. Wyke scolded her, telling Pela there was no need to be so frightened, though a loud and distant noise led her to question her uncle. The settlement was eventually attacked by a Gretalax, a creature from the nearby mountain of Temple Peak. Following the attack, Pela became mute, with Wyke claiming that her vocal cords had been damaged after she inhaled rhydonium fumes during the attack. After Wyke hired the monster hunter Ty Yorrick to deal with the Gretalax, Pela interrupted the two, and was stopped by Wyke, who informed Yorrick of the girl's condition. As Yorrick departed for Temple Peak atop a lyuna, Pela watched her go, and the two momentarily locked eyes, though Yorrick continued on her way to carry out her task.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Wyke_Town",
  "/wiki/Galactic_Frontier",
  "/wiki/Loreth",
  "/wiki/High_Republic_Era",
  "/wiki/Layton_Wyke",
  "/wiki/Jedi",
  "/wiki/Starlight_Beacon",
  "/wiki/Gretalax",
  "/wiki/Mountain",
  "/wiki/Temple_Peak",
  "/wiki/Rhydonium",
  "/wiki/Hunting",
  "/wiki/Ty_Yorrick",
  "/wiki/Lyuna",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Pela",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_1",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_2",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_3",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_4"
 ]
}