{
 "name": "Pelf_Pachoola",
 "display_name": "Pelf Pachoola",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wroonian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Pelf Pachoola was a Wroonian female who was the daughter of the wealthy aristocrat Fume Pachoola. During the waning years of the Galactic Republic, Pelf became engaged in preparation for an arranged marriage, and Fume gifted her and her fiancé with a pair of Kobarian swamp dogs as both a wedding gift and part of her dowry. Pelf quickly came to adore the two dogs, which she named Higgs and Twiggs, and she put them to use as show dogs. Prior to her wedding, Pelf and Fume journeyed aboard the liner Salin Mariner on a luxury cruise, and during the voyage they encountered the Weequay pirate Hondo Ohnaka, who had disguised himself as a businessman. Ohnaka sought to kidnap several wealthy individuals aboard the liner and after arranged for an explosive device to be detonated aboard the ship, he persuaded Pelf, Fume and the Gotal liquor seller Dix Tarfait to accompany him into an escape pod. Though Pelf and her father were subsequently held hostage by Ohnaka, the Weequay was unable to secure a ransom for their release, because Fume refused to pay and Pelf's fiancé opted not to petition for her freedom. The Wroonians later regained their freedom when Ohnaka captured a passing delivery freighter and forced the crew at blasterpoint to take the Wroonians and their pets off his hands.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wroonian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Fume_Pachoola",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Pelf_Pachoola%27s_fianc%C3%A9",
  "/wiki/Kobarian_swamp_dog",
  "/wiki/Dog/Legends",
  "/wiki/Higgs",
  "/wiki/Twiggs",
  "/wiki/Luxury_liner/Legends",
  "/wiki/Salin_Mariner",
  "/wiki/Weequay/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Hondo_Ohnaka/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Dix_Tarfait",
  "/wiki/Escape_pod/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars_Insider",
  "/wiki/Hondo_Ohnaka%27s_Not-So-Big_Score",
  "/wiki/Star_Wars_Insider_144"
 ]
}