{
 "name": "Peli Motto",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.55 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Peli Motto was a human female who managed Hangar 3-5 at Mos Eisley spaceport on the planet Tatooine. Motto was a skilled engineer and made her living repairing and refueling starships. Though scrappy and brutally honest, she was a compassionate and hardworking proprietor.\nYears after the fall of the Galactic Empire, the bounty hunter Din Djarin—known simply by the alias, the Mandalorian—landed at Peli Motto's hangar in desperate need of repairs. When he left to find work to cover Motto's bill, the mechanic discovered an infant being, Grogu, alone aboard his gunship. Hoping to charge Djarin, Motto began caring for the child. Unknown to Motto, however, was that both Djarin and Grogu had a bounty on their heads, and rookie bounty hunter Toro Calican took Motto and Grogu hostage in a bid to collect on the prize. After a standoff with Djarin that left Calican dead, he paid Motto for the repairs and left with Grogu.\nA short time after his first visit, Djarin returned to Tatooine and met with Motto for aid in his search for fellow Mandalorians. Motto sent him to the town Mos Pelgo, which was run by a marshal donning Mandalorian armor. When Djarin returned, having found that the sheriff was not a Mandalorian himself, Motto helped him once more by arranging a job that would lead him to a group of Mandalorians on Trask.\nDjarin later returned to Peli, and with the help of her droids and Jawas, they helped him to modify an N-1 starfighter that Peli had found as a replacement for his Razor Crest, which had been destroyed.\nPeli Motto was a human female who ran Hangar 3-5 in Mos Eisley spaceport on the planet Tatooine during the reign of the New Republic. By that time, she had never been outside of that planet. In 9 ABY, the gunship known as the Razor Crest was directed to land in bay 3-5 and upon the vessel landing, Motto's three DUM-series pit droids gathered their tools and approached the ship to see what repair work was needed. The ship's owner, the bounty hunter, Din Djarin, known simply as the Mandalorian, emerged and scared off the droids by firing a blaster bolt at them. Annoyed at the treatment of her droids, Motto yelled at the bounty hunter from her office area and emerged to inspect the ship herself.\nWhile examining the ship, Motto found a fuel leak and various other repairs that were needed, as well as signs of a recent battle. Djarin made clear that he did not want the droids working on his ship, and offered five hundred Imperial credits for the work to be done. After consulting her droids, Motto explained that the credits would only be enough to cover using the hangar, so the bounty hunter promised to return with more and left to find work.\nWhile waiting for the Djarin to return, Motto played sabacc with her droids, betting three bolts and a motivator on her hand. Before they could continue the round, however, strange noises began emerging from within the Razor Crest. Ordering one of her droids to fetch her blaster rifle, Motto cautiously approached the ship and yelled a warning to whoever was inside, but lowered the weapon when Grogu emerged alone. Picking up the child, she talked soothingly to it and ordered a pit droid to fetch Grogu some food.\nMotto worked on Djarin's ship, slowed by the fact that her droids were forbidden to help her, and started repairing the fuel leak before encountering several issues she needed to discuss with the hunter. She eventually got Grogu to fall asleep and also dozed off herself within the hangar. When Djarin returned, having found work with a rookie bounty hunter named Toro Calican, he discovered the missing baby and angrily woke Motto. The hangar owner scolded him for leaving Grogu alone and updated him on her repairs before following him outside, where Calican was waiting.\nMotto looked after Grogu while the two bounty hunters left to track their target, but Calican returned before Djarin, having learned that there was a bounty on the other hunter and Grogu. The rookie captured Motto and Grogu and waited with them inside the Razor Crest for the Djarin's return, emerging with Motto at blaster point and the infant in his arms once Djarin entered the hangar. Djarin dropped his blaster and surrendered as Calican threatened Motto, after which the rookie hunter ordered her to place him in binders.\nAs she followed his orders, Djarin revealed that he was still holding a flash charge to her which he then fired off, blinding Calican. Motto used the opportunity to hide behind some crates, while Djarin avoided Calican's blaster fire and shot him dead, causing him to tumble off the Razor Crest's ramp while still holding Grogu. Motto and Djarin rushed to check if Grogu was alright, but discovered he had crawled away to safety behind some crates. After she cradled the infant to soothe it following the ordeal, Djarin paid her with what credits Calican had been carrying. As the bounty hunter boarded his ship and left Tatooine, Motto ordered her droids to remove Calican's body from the hangar and dump it in Beggar's Canyon.\nSome time after their previous encounter, Djarin returned to Tatooine and landed the Razor Crest in Hangar 3-5. Motto expressed her pleasure at seeing Grogu and warned her droids not to go near Djarin's ship. However, when Djarin admitted his ship needed a once-over, Motto let her droids have at it. Djarin said that he was here on business, asking Motto for directions to Mos Pelgo. After seeing Grogu one more time, she directed the astromech droid R5-D4 to show Djarin an old planetary map of Tatooine, on which she indicated where Mos Pelgo used to be. Motto warned that it was an abandoned town and that she was not even sure it was still there. She allowed Djarin to take her speeder to travel to the town while she looked after his ship.\nSometime later, Djarin returned from his mission, having walked to Mos Eisley after a skirmish left the speeder destroyed. He entered Chalmun's Spaceport Cantina, where he met with Motto, who was in the middle of a sabacc game with \"Doctor Mandible.\" Motto noticed Djarin carrying a set of Mandalorian armor, snidely inquiring whether or not Djarin had met with the Mandalorian he sought and killed him. Djarin told her that he had simply acquired the armor from its owner by helping him kill a Krayt Dragon. Doctor Mandible, hearing the conversation, told Motto that he knew a contact who could help Djarin on his quest to find Mandalorians. Motto, translating for Mandible, told Djarin to cover Mandible's call in the game in return for the information. Djarin gave Mandible 500 credits, and Motto assured him that Mandible was on a \"hot streak.\" Motto won the game with an Idiot's Array, but Mandible kept his word and told Motto about the contact, who he said would rendezvous with Motto and Djarin at the hangar.\nMotto and Djarin met at the hangar soon afterward, where Motto had a Treadwell droid cook the Krayt Dragon meat Djarin had brought with him. Motto told Djarin that Mandible knew of a Mandalorian covert in the sector, and that his contact would bring Djarin to them. Djarin asked whether the covert was part of the Tribe that left Nevarro, but Motto did not know. She added that it wouldn't cost Djarin anything, but he would have to give the contact passage to the system without hyperdrive. Djarin protested that traveling sub-light was too dangerous and called off the deal, but Motto vouched for the contact, the \"Frog Lady,\" who had entered the hangar. Translating for the Frog Lady, Motto told Djarin how the only cargo would be the Frog Lady and her spawn, adding that entering hyperspace would kill her eggs. Djarin, still unsure, asked whether the Frog Lady was sure that there were Mandalorians at their destination, though all Motto was told was that the Frog Lady's husband had seen them. Djarin's hesitance was not eased by Motto, who remarked that she did not know the Frog Lady or her husband, but telling him to trust her as she had an \"excellent judge of character.\"\nSome time after the rescue of Grogu from Moff Gideon, Djarin had informed Motto that he required a replacement for his former vessel, the Razor Crest, which had been destroyed during the mission to Tython. Upon receiving a message that she had found one, Djarin traveled to Tatooine, appearing at Hangar 3-5 just in time to save Motto from the grip of a womp rat which had snatched up a BD-unit droid she owned.\nDirecting Djarin to another side of the hangar, Motto inquired of Grogu's whereabouts, remarking in jest that she could have made a fortune displaying him in a petting zoo. Upon reaching a storage bay, Peli removed a covering to reveal a decrepit N-1 starfighter. Unamused by the ship's dissimilarity to his former spacecraft, Djarin attempted to leave, but agreed to Motto's plea to let her elaborate on the starfighter's history and specifications. Peli attempted to persuade Djarin to allow her to complete the starship's repairs before he made a final judgment, the bounty hunter conceded to the effort and agreed to help her with the modifications.\nAs Djarin conducted repairs on the ship, Motto enthusiastically returned with a vital modification component - a turbonic venturi power assimilator. Djarin inquired as to where Motto attained this part; the mechanic stated that it came from Jawas, to Djarin's relative surprise. Motto explained to a perplexed Djarin that she simply provided the Jawas with a list of items – in exchange for them finding and delivering the objects, she authorised them to raid her dumpsters. Djarin asked if he could meet them, to which Motto instructed R5-D4 to ascertain if they were present out back and to send for them. Motto then claimed that she had dated a Jawa for period of time.\nDjarin requested parts from the Jawas, and Peli assured him that she knew what she was doing, and sent the Jawas to find the parts. Peli and Djarin returned to work on the ship while the pit droids helped with the refurbishment. While working on the ship, Peli observed that Djain was always in a hurry, and admitted that she had never left Tatooine, describing herself as a local \"gal.\" Djarin observed that the entire vapor manifold was missing, but Peli replied that he does not need it, and that she had fabricated the intake charger to ensure that it doubled his output coefficient. Peli showed him a Kineso-switch that could accelerate the ship.\nPeli used a MPH power droid to help charge of the ship, while Djarin thanked her BD unit for his help with the construction. Peli asked if Djarin was interested in how she got the N-1 ship, prompting him to reply that he preferred a ship similar to the Razor Crest. Peli grumbled that this ship was harder to come by than a Razor Quest. Working together, Djarin, Peli and her droids covered the N-1's hull. The Jawas returned with a cryogenic density combustion booster that they had stolen it from a Pyke spice runner that was refueling. Peli complained to Djarin about the Pyke's spice trade, and that even law enforcement were afraid of them. Djarin thanked the Jawas and paid them, to which Peli replied that Djarin was spoiling them, before installing the combustion booster.\nDjarin asked her about the droid port, and Peli replied that she removed it since she was aware of his earlier aversion for droids. While Peli reprimanded R5-D4 for his foul language, Djarin asked her if the fighter was ready, to which Peli agreed, and told him to start up the ship, and that diagnostic tests were not needed. Djarin departed with the ship, flying above Mos Eisley. When Djarin complained that the ship was a little bumpy, Peli replied that he was used to a gunship, and that he should treat it like a starfighter.\nDuring the flight, Motto instructed Djarin to point his navigational disposition between Tatooine's twin suns, which led him to Beggar's Canyon. Motto asked Djarin how was the handling, to which Djarin replied the ship tracked like a railspeeder. Motto mocked the Razor Crest in return. After Djarin was intercepted by two New Republic X-wing starfighter, he escaped and landed back on Peli's hangar. Djarin was impressed with the ship, and Peli was pleased with the performance of the J-type pulse engines. She told him that an \"old friend\" of his dropped by. Not trusting the person, Peli had locked her out and engaged the hangar security system. When Djarin asked what her name was, they heard Fennec Shand's voice. Peli was surprised, believing that the hangar security system was activated. Shand recruited Djarin to serve as muscle for Boba Fett, while Motto scolded her droids for letting Shand evade the security system. Djarin left to visit a \"little friend.\"\nAfter Djarin left a gift for Grogu, Grogu chose to leave his training. R2-D2 flew him in an X-wing starfighter to Tatooine, searching for Djarin, and landed at Peli's hangar. Peli was surprised to find Grogu in the X-wing, as she thought the X-wing was piloted by a New Republic officer and even filed for her New Republic certification seal. R2 asked where was the Mandalorian, and Motto replied he was on a job in Mos Espa, as Djarin found himself in the middle of a gang war between Boba Fett's gotra, whom Djarin was aiding, and the Pyke Syndicate. When Motto called Grogu 'bright eyes', R2 informed her about Grogu's name, and Peli stated that not only was it a terrible name, but also that she wasn't planning on ever calling him that. She noticed his armor underneath his robes and commented on him being all fancy. Despite R2's insistence that Grogu needed to be brought to Djarin immediately, as R2 was in a rush to return to his master, Motto instead instructed her pit droids to bring Grogu some Dung worms for him to eat.\nPeli Motto was a female human with fair skin, curly brown hair, and brown eyes. The proprietor of Mos Eisley hangar bay 3-5, she made a living refueling and repairing ships. Under her ownership were several droids who aided her in her job. She was protective of her droids due to what it would cost to repair them, and consulted them about repair work that needed to be done. Despite relying on her droids to help her she was willing to take on any job herself for an additional fee. Motto never left the city walls of Mos Eisley following the fall of the Empire, seeing Tatooine as a dangerous free-for-all of bandits. Despite this she knew many people and species, though was unfamiliar with Grogu's kind. A sabacc player, Motto often played against her droids or in Chalmun's Cantina. She was additionally a skilled translator, able to speak and understand multiple different languages, including Galactic Basic Standard, Jawaese, and Frog.\nDuring her second encounter with the Mandalorian, she translated both Doctor Mandible and the Frog Lady for him, although she was prone to paraphrasing their words. Motto vouched for the Frog Lady in order to ease the Mandalorian, though admitted that she had known her for only ten minutes and, considering herself an excellent judge of it, simply trusted her sense of character.\nDespite Motto's rude and sarcastic character, she doesn't like foul language in front of customers, going so far as to scold her droids for it.\nDuring her first encounter with the Mandalorian, Motto complained about the Mandalorian not being able to pay enough up front, but began repair work on his ship before learning that he had been able to acquire paying work. Upon discovering Grogu she cooed over him and cradled him in her arms, making sure he was cared for and fed, but also pleased that she could charge the Mandalorian extra for watching over him. Motto scolded him for leaving Grogu alone and warned that he needed to improve his parenting skills. She initially thought of the Mandalorian as a \"womp rat,\" but complimented his strategy during the fight with Calican. After the fight she feared for Grogu's safety, and was relieved to see him unharmed. During her second encounter with the Mandalorian, Motto excitedly said that she was glad Grogu was doing well, jokingly asking if she could purchase him. Motto helped the Mandalorian as he tried to find leads on where other Mandalorians could be located, first lending him her speeder after directing him to Mos Pelgo, then helping set up his passage of the Frog Lady with Doctor Mandible.\nPeli Motto wore a brown jumpsuit with black and brown gloves and brown boots. She owned a blaster rifle and a scanner capable of analyzing vessels for damage, as well as three DUM-series pit droid that cost her a large amount of credits to keep active. In addition to her pit droid crew, she also had the astromech R5-D4, a WED-15 Treadwell droid, an MPH power droid, and a BD unit\nPeli Motto appeared in Chapter 5 of Jon Favreau's 2019 Disney+ television series The Mandalorian, which aired on December 6, 2019. She was portrayed by Amy Sedaris, with Milly Nalin serving as a stunt double. In Chapter 7 of the series The Book of Boba Fett, Mandy Kowalski served as stunt double.\nConcept art initially depicted Motto as an elderly woman wearing tattered clothing, with a cowl over her head.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Image",
  "/wiki/Template:Expand",
  "/wiki/Template:Update",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Hangar_3-5",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Planet",
  "/wiki/Engineer",
  "/wiki/Starship",
  "/wiki/Standard_year",
  "/wiki/Galactic_Empire",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Mandalorian",
  "/wiki/Grogu",
  "/wiki/Razor_Crest",
  "/wiki/Toro_Calican",
  "/wiki/Death",
  "/wiki/Mission_to_Tatooine_(Din_Djarin)",
  "/wiki/Freetown",
  "/wiki/Cobb_Vanth",
  "/wiki/Mandalorian_armor",
  "/wiki/Mission_to_Trask",
  "/wiki/Mandalorian_resistance",
  "/wiki/Trask",
  "/wiki/Jawa",
  "/wiki/Din_Djarin%27s_N-1_starfighter",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/9_ABY",
  "/wiki/Gunship",
  "/wiki/Hangar",
  "/wiki/DUM-series_pit_droid",
  "/wiki/Droid",
  "/wiki/Blaster",
  "/wiki/Fuel",
  "/wiki/Credit",
  "/wiki/Sabacc",
  "/wiki/Motivator",
  "/wiki/Blaster_rifle",
  "/wiki/Foodstuff",
  "/wiki/Fennec_Shand",
  "/wiki/Bounty",
  "/wiki/Stuncuffs",
  "/wiki/Flash_charge",
  "/wiki/Beggar%27s_Canyon",
  "/wiki/Astromech_droid",
  "/wiki/R5-D4",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Doctor_Mandible",
  "/wiki/Boba_Fett%27s_armor",
  "/wiki/Krayt_dragon",
  "/wiki/Idiot%27s_Array",
  "/wiki/WED-15_Treadwell_droid",
  "/wiki/The_Tribe",
  "/wiki/Nevarro",
  "/wiki/Frog_Lady",
  "/wiki/Frog_Man",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Gideon",
  "/wiki/Mission_to_Tython",
  "/wiki/Womp_rat",
  "/wiki/BD-72",
  "/wiki/Zoo",
  "/wiki/N-1_starfighter",
  "/wiki/Turbonic_venturi_power_assimilator",
  "/wiki/Kineso-switch",
  "/wiki/MPH_power_droid",
  "/wiki/BD_unit",
  "/wiki/Cryogenic_density_combustion_booster",
  "/wiki/Pyke",
  "/wiki/Spice",
  "/wiki/Law_enforcement_agency",
  "/wiki/Anti-droid_sentiment",
  "/wiki/Tatoo_I",
  "/wiki/Tatoo_II",
  "/wiki/Railspeeder",
  "/wiki/X-wing_starfighter",
  "/wiki/J-type",
  "/wiki/Boba_Fett",
  "/wiki/Grogu%27s_armor",
  "/wiki/R2-D2",
  "/wiki/Mos_Espa",
  "/wiki/Dung_worm",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Jawaese",
  "/wiki/Frog_(language)",
  "/wiki/Parent",
  "/wiki/Clothing",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Scanner",
  "/wiki/Chapter_5:_The_Gunslinger",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/December_6",
  "/wiki/Amy_Sedaris",
  "/wiki/Milly_Nalin",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Mandy_Kowalski",
  "/wiki/Category:Audio_files_of_Amy_Sedaris",
  "/wiki/Category:Images_of_Peli_Motto",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian_5",
  "/wiki/Chapter_9:_The_Marshal",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/The_Mandalorian_Season_Three",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Technology",
  "/wiki/Score",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Star_Wars",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/The_Mandalorian:_Allies_%26_Enemies",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Mando_Mania",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Book_of_Boba_Fett",
  "/wiki/Ships_of_the_Galaxy:_Naboo_N-1_Starfighter",
  "/wiki/StarWarsKids.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}