{
 "name": "Pell Baylo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Prior to 84 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "14 BBY",
      "Defiance",
      "Christoph system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Defiance Flight Training Institute",
      "Galactic Republic",
      "Galactic Republic Navy",
      "Galactic Republic Navy",
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Pell Baylo was a male human who operated the Defiance Flight Training Institute for nearly fifty years, both under the Galactic Republic and its successor state, the Galactic Empire. Baylo's life ended when he tried to assassinate Emperor Palpatine by plunging the starship Defiance into Christophsis's sun. The Emperor's enforcer, Darth Vader, managed to foil his plan and strangled the elderly man to death.\nPell Baylo was born over 84 years before the Battle of Yavin. During the last decades of the Galactic Republic, he created the Defiance Flight Training Institute. With the outbreak of the Clone Wars, Baylo's institute was brought under the direct authority of the Republic. When that government was reorganized into an authoritarian Galactic Empire at the end of the war, Baylo continued to serve for a time, although reluctantly, with the title of Commandant.\nEventually, Baylo plotted against Emperor Palpatine. One day, the Emperor elected to meet several of his naval chiefs on the starship Defiance, and he brought his personal enforcer, a black-armored man called Darth Vader. Baylo programmed the Defiance so that it would emerge from hyperspace around the planet Christophsis and plunge into its sun, which would cause the Emperor's demise. The Commandant then confronted Palpatine in his office, tendering his resignation.\nHowever, Baylo's plan had failed, as Darth Vader had seen through his ruse and countermanded the Commandant's orders; when the Defiance reverted to realspace, there were still millions of kilometers between the ship and the star of Christophsis. With his plan thwarted, Baylo expressed his disgust of Palpatine and his methods. When Baylo compared the Emperor's minions to mindless robots in front of Vader, the Commandant made his last mistake. Vader, who was a cyborg himself, Force choked the old man to death. The Emperor, disappointed at Vader's actions, reprimanded him for killing Baylo for he had not ordered it. He explained that he wanted to keep Baylo alive and force him to watch his beloved Navy be turned into something he hated and have the Defiance be melted down into cafeteria trays. Above all, the Emperor believed he could have used Baylo, a man who was willing to kill his own students for a cause, for his own ambitions. Vader defended himself, saying his way was more efficient, but Palpatine dismissed Vader's reasons as irrelevant, stating that because he was not ordered to kill Baylo, he should not have done so.\nFollowing Baylo's execution, his body was unceremoniously thrown out of the airlock with the ship's refuse and he was officially reported to have died of old age. His training vessel Defiance was renamed Obedience as a final subtle jab toward Baylo as well as a not-so-subtle hint toward Vader to know his place. Despite chafing under the harsh discipline of Baylo, years later, one of his former cadets Rae Sloane looked back favorably on his advice to remain stoic and expressionless in the presence of her bridge crew to avoid demoralizing them. This advice served Admiral Sloane well when she commanded the Imperial Star Destroyer Vigilance during the Battle of Endor in 4 ABY.\nA male human, Baylo had a stumpy body, fair skin, brown eyes, and a long nose. In his old age, his hair had turned gray, and the sequela of a spine injury gave him an exaggerated limp.\nAlthough he was cantankerous and sometimes foul-mouthed, Baylo had high ideals. He regarded naval service as a noble calling, thinking that navies should only be used to protect people, never as an offensive force. Baylo had an almost mythical status among his students and other members of the Imperial navy. He had become famous fighting pilots on the Defiance, and his constant battle with pain due to injuries sustained in those battles was seen as bravery.\nA staunch Republic loyalist, Baylo did not recognize the Empire, viewing it as a hostile power instead. He thought that the Galactic Senate had betrayed its people the day they agreed to become the Empire. He also viewed all his colleagues as traitors who betrayed all they believed in to keep their posts, and was willing to let them die in his plot to kill the Emperor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/84_BBY",
  "/wiki/14_BBY",
  "/wiki/Obedience",
  "/wiki/Christoph_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Defiance_Flight_Training_Institute",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Standard_year",
  "/wiki/Death",
  "/wiki/Assassin",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Starship",
  "/wiki/Christophsis",
  "/wiki/Star",
  "/wiki/Anakin_Skywalker",
  "/wiki/Force_choke",
  "/wiki/Battle_of_Yavin",
  "/wiki/Clone_Wars",
  "/wiki/Commandant",
  "/wiki/Standard_day",
  "/wiki/Naval_chief",
  "/wiki/Armor",
  "/wiki/Hyperspace",
  "/wiki/Planet",
  "/wiki/Christophsis%27_sun",
  "/wiki/Realspace",
  "/wiki/Kilometer",
  "/wiki/Droid",
  "/wiki/Cyborg",
  "/wiki/Airlock",
  "/wiki/Imperial_cadet",
  "/wiki/Rae_Sloane",
  "/wiki/Admiral",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Vigilance_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Eye",
  "/wiki/Nose",
  "/wiki/Galactic_Senate",
  "/wiki/Category:Images_of_Pell_Baylo",
  "/wiki/Star_Wars_Insider",
  "/wiki/Orientation",
  "/wiki/Star_Wars_Insider_157",
  "/wiki/Bottleneck_(short_story)",
  "/wiki/The_Rise_of_the_Empire",
  "/wiki/The_Levers_of_Power",
  "/wiki/Tarkin_(novel)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}