{
 "name": "Penzaren",
 "display_name": "Penzaren",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3631 BBY",
      "Makeb"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Cult of Gethul"
     ]
    }
   ]
  }
 ],
 "content": "Penzaren  was a male Human Chief Engineer of the Galactic Republic living during the war against Zakuul. Following the death of the Eternal Empire Empress Vaylin and the formation of the Eternal Alliance in 3631 BBY, he was part of the team that Jedi Master Adelade took to Makeb acting on the anonymous intel. What they found there, was Gethul, a creature of an unknown origin and immense power that hibernated beneath the planet's surface for millenia. Hearing Gethul's \"song\", Adelade fell under Gethul's sway, forming a Cult of Gethul and attempting to fully awaken the creature. Penzaren at first tried to stop them, but eventually heard the song and joined the cult himself. Learning of this and fearing that in its full power Gethul could destabilize Makeb's core and obliterate the planet, Alliance military Admiral Bey'wan Aygo sent a strike team to stop Adelade's plan. Adelade ordered Penzaren to stop the interlopers, which he did by sending a massive amount of droids against them. However, the Alliance team prevailed and Penzaren's own energy shield eventually gave way, allowing them to strike him down and proceed to Adelade.\nChief Engineer Penzaren appears in Star Wars: The Old Republic: Knights of the Eternal Throne as a boss during the \"Destroyer Of Worlds\" Uprising.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3631_BBY",
  "/wiki/Makeb",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cult_of_Gethul",
  "/wiki/Chief_Engineer",
  "/wiki/War_against_Zakuul",
  "/wiki/Eternal_Empire",
  "/wiki/Emperor/Legends",
  "/wiki/Vaylin",
  "/wiki/Eternal_Alliance",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Adelade",
  "/wiki/Gethul",
  "/wiki/Bey%27wan_Aygo",
  "/wiki/Personal_energy_shield",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}