{
 "name": "PePe_Rossh",
 "display_name": "PePe Rossh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "67 BBY",
      "Woebegone"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaleesh"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Scarlet"
     ]
    }
   ]
  }
 ],
 "content": "PePe Rossh was a male Kaleesh crew member of the starship known as the Woebegone in 67 BBY. That year, he and the other crew of the freighter departed the world of Bal'demnic. However, on course to their next stop, the Kaleesh and the rest of the crew were killed by the Dark Lord of the Sith Darth Plagueis, who had stowed upon the ship to get off the planet unnoticed.\nA male Kaleesh, PePe Rossh became a crew member under the Togruta Captain Ellin Lah on the freighter Woebegone in the years preceding 67 BBY. Along with the rest of the crew of the starship, Rossh frequented places such as Vestral, Sikkem IV, Carlix's Folly, and the planet Bal'demnic. In 67 BBY, after coming from the world of Ord Mantell, the freighter picked up a cargo of fresh sea life on Bal'demnic. After boarding the ship for departure to the planet Ithor, Rossh, along with crew members Doo Zuto and Wandau, checked that the cargo had been stored. As the Woebegone was in hyperspace on route to their next destination, it was discovered that the freighter had picked up a stowaway in one of its cargo bays. Rossh and members of the crew confronted the Muun stowaway, who, although he would not give his name, was in secret the Sith Lord Darth Plagueis.\nAt the Muun's request, Lah spoke to the stowaway in private. Upon her return, Lah informed the crew that the Muun was looking to travel unnoticed to the Muun homeworld of Muunilinst, which was close to Ithor. Rossh and the crew members discussed what action they should take, with the Kaleesh leaning towards taking the stowaway to his destination, or even use him as a hostage, as most Muuns were quite wealthy. Even though the crew led clean lives, the money that could be gained from that would help them greatly. However, another decision was reached: the Woebegone would drop out of hyperspace, and comm the authorities on Bal'demnic to see if the Muun was a fugitive, as transporting a fugitive would damage their reputation. If he was, the freighter would go back to Bal'demnic. If not, the crew would take him to Ithor. Lah then went to inform the Muun of their decision.\nAs the stowaway did not wish being noticed as he left Bal'demnic in order to keep his business there a secret, the Muun did not accept the deal, and killed Lah. Just as the freighter came out of hyperspace, the Muun rushed with an activated lightsaber in his hand into the cabin where Rossh, Wandau, Zuto, and first mate Maa Kaap were. Allowing Rossh and the others just enough time to draw their blasters, the stowaway attacked. Aided by the pilot Blir' and the navigator Semasalli, who arrived shortly after, the crew members attempted to take out the Muun. However, after Blir', Semasalli, Wandau, and Kaap were felled by the stowaway, Rossh was decapitated as he and Zuto tried to attack the Muun assailant with their hands after blasters proved ineffective. In the end, all of the crew save the ship's medical droid, 11-4D, were killed.\nRossh was a scarlet colored scaly skinned Kaleesh with a tusked face, and emitted potent pheromones. During the discussion on what to do with the stowaway, Rossh favored taking the Muun to Ithor, and from there maybe all the way to Muunilinst. The Kaleesh considered the stowaway worth far more than ten years of cargo, and also liked the idea of taking him hostage. He also thought that all Muuns were cowards, and would not fight. Rossh had good combat skills for a crew member of a freighter, but despite this, he was killed quickly by Plagueis.\nPePe Rossh's appeared in the 2012 novel Darth Plagueis, written by James Luceno.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/67_BBY",
  "/wiki/Woebegone",
  "/wiki/Kaleesh/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bal%27demnic",
  "/wiki/Death/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Massacre_on_the_Woebegone",
  "/wiki/Togruta/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Ellin_Lah",
  "/wiki/Vestral",
  "/wiki/Sikkem_IV",
  "/wiki/Carlix%27s_Folly",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Ithor/Legends",
  "/wiki/Doo_Zuto",
  "/wiki/Wandau",
  "/wiki/Hyperspace/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Muunilinst/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/Force_speed",
  "/wiki/Lightsaber/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Maa_Kaap",
  "/wiki/Blaster/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Blir%27",
  "/wiki/Navigator/Legends",
  "/wiki/Semasalli",
  "/wiki/Sai_cha/Legends",
  "/wiki/Medical_droid/Legends",
  "/wiki/11-4D/Legends",
  "/wiki/Pheromone/Legends",
  "/wiki/2012",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/James_Luceno",
  "/wiki/Darth_Plagueis_(audiobook)"
 ]
}