{
 "name": "Peragus_Mining_Facility_Dock_Officer",
 "display_name": "Peragus Mining Facility Dock Officer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Peragus Mining Facility"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Peragus Mining Facility",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "The dock officer at the Peragus Mining Facility was responsible for the hangar where the Ebon Hawk landed.\nWhen Meetra Surik arrived on the Ebon Hawk, the dock officer placed much of the cargo in the hold, including some programming spikes, remarking that the only way to access it was to blow the door open with explosives. He was also surprised that the mining droids had managed to repair the Ebon Hawk since this was at the time when about half the miners were in med-bay due to some accidents caused by the mining droids. While he was off shift, he caught the droids repairing the port stabilizers. This was most likely due to commands issued by the HK-50, who went to maintenance as a mere protocol droid, but because the ship's navigation computer was voiced-locked, he knew that there was no way he could get the ship could to take off.\nWhen the accidents became more frequent and the emergency lockdown protocol was initiated, the dock officer was among those who made it to the dormitories. He was trying to use the holo-transmitter to beam a transmission to the administration level to end the lockdown, but because the administration console had been severed from the main hub, the plan failed. He knew that there was no way to break the dormitory seal from the inside. He tried, unsuccessfully, to circumvent the lockdown. He sent distress calls, hoping for a passing by ship or a Telos freighter to arrive. He also hoped any surviving miners could reach the administration levels to make contact with a ship to help rescue those trapped in the dormitory. He managed to use the holo-transmitter to send a distress signal on the transmitter reaching outside the facility to possibly beyond the asteroid field. It consisted of a simple flash code of the turbolift controls, but the signal was weak, and it would have taken a long time before a ship received it unless it was actively scouting the area.\nThe dock officer's attempts to save the facility's personnel would be all for naught, as by the time Surik woke up, they would all be dead due to the toxic fumes in the ventilation system.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3951_BBY",
  "/wiki/Peragus_Mining_Facility",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Meetra_Surik",
  "/wiki/HK-50_series_assassin_droid",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}