{
 "name": "Peragus Mining Facility Administration Officer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Peragus Mining Facility"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Peragus Mining Facility",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "The administration officer of the Peragus Mining Facility was the head of the mining colony at the time of the Skirmish at Peragus II in 3951 BBY, when Meetra Surik escaped a Sith ambush on the Republic warship Harbinger, and docked the Ebon Hawk with the station for critical repairs.\nWhen the Ebon Hawk was tractored in, his crew found the unconscious bodies of Kreia and Surik, a deactivated T3-M4, and an HK-50 Jedi hunter which presented itself as a mere protocol droid. The administration officer had the Jedi brought to the medical bay and the ship's cargo inventoried by security, he questioned HK-50 about what had happened to the battered ship, then sent the droids to maintenance until their master recovered. In a fruitless effort to find more information about the mysterious vessel and its occupants, he contacted officials on Telos IV for Republic records on Surik and sent out a broad comm transmission for records on the Ebon Hawk.\nWhile Surik remained unconscious, the administration officer struggled to keep her identity quiet, fearing a miner riot. Eventually, however, word of the Jedi survivor leaked out and miners such as Coorta began plotting about claiming the bounty the Exchange had posted on Jedi.\nWhen HK-50 initiated the emergency lockdown at the facility in an attempt to claim Surik's bounty for himself, the administration officer was trapped in the dormitory level and killed as toxic fumes built up in the ventilation system. Surik would later recover his datapad with a partial code to open the turbolift to the administration level.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3951_BBY",
  "/wiki/Peragus_Mining_Facility",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Skirmish_at_Peragus_II",
  "/wiki/Meetra_Surik",
  "/wiki/Sith/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Harbinger_(Hammerhead-class)",
  "/wiki/Ebon_Hawk",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Kreia",
  "/wiki/T3-M4",
  "/wiki/HK-50_series_assassin_droid",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Telos_IV",
  "/wiki/Coorta",
  "/wiki/Exchange",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}