{
 "name": "Peragus_Mining_Facility_Medical_Officer",
 "display_name": "Peragus Mining Facility Medical Officer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Peragus Mining Facility"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Peragus Mining Facility",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "The medical officer at the Peragus Mining Facility oversaw the colony's medical facilities by the time of the Skirmish at Peragus II in 3951 BBY.\nWhen the skirmishes began with the arrival of Meetra Surik and the Ebon Hawk at the facility, the medical officer placed the unconscious Surik in a kolto tank and put the other passenger—Kreia, whom she believed to be dead—in the morgue. She also put two droids on board: T3-M4 and an HK-50 assassin droid, who were under the care of the maintenance officer.\nAs the subtle sabotage of the facility by HK-50 intensified, the medical officer became in charge of not only Surik but the growing number of miners who had been injured or killed by explosions or mining droid attacks. When HK-50 triggered a fuel detonation in the mining tunnels that caused an emergency lockdown, she, along with other crew at the facility such as the administration officer and the dock officer, retreated to the Peragus dormitories.\nOnce there, she suggested that the surviving miners use their holo-transmitter to contact Surik in her kolto tank—an idea that was quickly shot down because the medical computer had already been severed from the main hub. The medical officer, like all the miners with her, was killed when toxic fumes built up in the dormitory ventilation system.\nSurik, who would go on to escape the facility, later learned the fate of the medical officer and the other miners when she visited the dormitories herself.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3951_BBY",
  "/wiki/Peragus_Mining_Facility",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Skirmish_at_Peragus_II",
  "/wiki/Meetra_Surik",
  "/wiki/Ebon_Hawk",
  "/wiki/Kolto/Legends",
  "/wiki/Kreia",
  "/wiki/T3-M4",
  "/wiki/HK-50_series_assassin_droid",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Peragus_Mining_Facility_Maintenance_Officer",
  "/wiki/Peragus_Mining_Facility_Administration_Officer",
  "/wiki/Peragus_Mining_Facility_Dock_Officer",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}