{
 "name": "Perrin Fertha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chandrila"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Mothma's family"
     ]
    }
   ]
  }
 ],
 "content": "Perrin Fertha was a human male who was the husband and consort of Imperial senator Mon Mothma as well as the father to her daughter Leida. According to Luthen Rael, Fertha had an interest in military artifacts though Mothma claimed that she was trying to expand Fertha's tastes beyond fighting implements. Fertha and his family resided at their residence on the planet Coruscant—the capital of the galaxy—during the reign of the Galactic Empire.\nIn 5 BBY, Fertha hosted a dinner party for his regimental friend, the governor of Hanna. However, he upset his wife by inviting Ars Dangor and Sly Moore, who often opposed her and had the day before cut off the Ghorman shipping lanes, leading to starvation.\nThe next morning Fertha joined Mothma and their daughter Leida for breakfast. He did not intervene when the two started arguing and Leida insisted that her mother was only thinking of herself, upsetting his wife. Later that night, Fertha and Mothma attended an event together. As they rode in a speeder, Fertha noted that he saw her watching his conversation with Gar Tafeed, who he said knew more about what she was up to than he did. Fertha then asked his wife when she was going to tell him about her new foundation, to which Mothma replied that she did not think that he would be interested because it was charitable. Fertha ignored her jibe and followed up by asking Mothma for the driver's name. Mothma reminded him for the second time that day that it was Kloris, and Fertha then addressed him and asked him to take the Expressway.\nA short while after Mothma hosted a party at the family home which Fertha attended. During the party he told Leida that she needed to ask Mothma if she wanted to be excused which she did. Later Fertha approached Mothma who was talking with Tay Kolma in the living room and inquired if they were reminiscing on their school days and reminding the pair of an upcoming reunion. Mothma then joined Fertha to speak with the other guests.\nPerrin Fartha was portrayed by Alastair Mackenzie. He made his first appearance in the fourth episode of the live-action series Andor, which was released on September 28, 2022.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Chandrila",
  "/wiki/Human",
  "/wiki/Chandrilan",
  "/wiki/Gender",
  "/wiki/Mon_Mothma%27s_family",
  "/wiki/Marriage",
  "/wiki/Consort",
  "/wiki/Imperial_Senate",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/Reproduction",
  "/wiki/Leida_Mothma",
  "/wiki/Luthen_Rael",
  "/wiki/Chandrilan_Embassy/Canon",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Capital",
  "/wiki/The_galaxy",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/5_BBY",
  "/wiki/Governor",
  "/wiki/Hanna_City",
  "/wiki/Ars_Dangor",
  "/wiki/Sly_Moore",
  "/wiki/Ghorman",
  "/wiki/Hyperspace_route",
  "/wiki/Foodstuff",
  "/wiki/Parent",
  "/wiki/Speeder",
  "/wiki/Gar_Tafeed",
  "/wiki/Kloris",
  "/wiki/Tay_Kolma",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Perrin_Fertha",
  "/wiki/Alastair_Mackenzie",
  "/wiki/Aldhani_(episode)",
  "/wiki/September_28",
  "/wiki/2022",
  "/wiki/The_Axe_Forgets",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Kassa_(episode)",
  "/wiki/September_2"
 ]
}