{
 "name": "Pershing",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps",
      "Gideon's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "Pershing was a human male doctor and clone engineer affiliated with a remnant of the Galactic Empire during the New Republic Era. By 9 ABY, Pershing and \"the Client\" placed a bounty on Grogu in hopes of acquiring it. One of the bounty hunters who accepted the commission was Din Djarin who met with the Client and Pershing while they were under the protection of Remnant Stormtroopers.\nDjarin retrieved Grogu for the Imperials, and delivered him directly to the Client and Pershing, who verified he was healthy. The doctor and the Client then argued about extracting material from the child, with Pershing ensuring that it remained alive. After having a change of heart, Djarin returned and fought his way through the facility where Pershing was working on Grogu. The bounty hunter confronted Pershing who begged for his and the child's life, causing Djarin to spare the scientist and leave with the infant.\nAfter the kidnapping, Pershing continued his work for Gideon, injecting Grogu's blood into the bodies of volunteers, ultimately resulting in their deaths after initial promising results. In need of more of Grogu's blood, the doctor sent a hologram to Gideon revealing that he was unable to continue his work. Gideon eventually recaptured Grogu on the planet Tython, but as Pershing was being transported aboard a shuttle, the vessel was attacked by the bounty hunter Boba Fett, who used the ion cannons on his ship, the Slave I, the disable the shuttle. Djarin boarded the vessel along with his ally Cara Dune, but Pershing was held hostage by one of the shuttle pilots. Dune shot and killed the pilot, grazing Pershing's ear. Pershing then betrayed Gideon and offered his master's enemies valuable intel that allowed them to successfully infiltrate Gideon's light cruiser and rescue Grogu.\nDoctor Pershing was a human male who worked as a scientist for an Imperial remnant on Nevarro following the collapse of the Galactic Empire. In around 9 ABY, Pershing worked with an individual known as \"the Client\" to attempt to acquire a Force-sensitive child named Grogu, whose connection to the Force Pershing had been tasked with investigating. The Client placed a bounty on the infant with the Bounty Hunters' Guild, who sent many hunters to accept the contract. One of these hunters was Din Djarin who met with the Client and four stormtrooper guards face to face.\nAfter the Client greeted Djarin, Pershing joined the meeting unannounced, causing Djarin to quickly draw his weapons. The doctor cowered and apologized for surprising the bounty hunter while the four stormtroopers kept their weapons aimed at Djarin. The Client then defused the situation and had the stormtroopers lower their weapons, after which Djarin took a seat and listened to the Client's description of the job. When the Client stated that the hunter could provide proof of termination instead of bringing the infant in alive, Pershing interrupted and complained that termination was not what they had previously agreed, but the Client dismissed the complaint and claimed he was \"simply being pragmatic.\"\nDjarin successfully recovered the infant and delivered it directly to the Client and Pershing. Upon seeing the infant the pair rushed up, the Client first verifying its identity with a fob while Pershing scanned it to check that it was in good health. Pleased with the infant, the Client paid Djarin while Pershing escorted it from the room. Once Djarin was gone, the Client and Pershing argued about the infant, with the Client demanding he simply remove the material they needed from the Child even if it killed it. Pershing refused, reminding the Client that they had orders to deliver it alive, after which the Client warned Pershing they could no longer assure his safety and left. Pershing would harvest a small amount of blood from the Child to be used for his project.\nDjarin later had a change of heart and returned, attacking the facility where Pershing was working on Grogu. After fighting his way through a number of stormtrooper guards, Djarin blasted open the door to the room where Pershing was working. A stormtrooper inside shot the bounty hunter, only for the bolt to rebound off his beskar armor. Djarin then killed the trooper and shot an IT-O Interrogation Unit while Pershing begged for his and the child's lives. After the scientist explained it was only because of him that the baby had not been killed, the bounty hunter took the baby and left, sparing Pershing.\nPershing continued to serve Moff Gideon and continue his experimentations. In the Imperial base on Nevarro, he worked on volunteers, injecting Grogu's blood into their bodies. After seeing promising results for two weeks, the bodies rejected the blood and did not survive. Pershing was unable to continue his work because he exhausted the supply of blood gathered from the Child. Knowing it would be difficult to obtain any more blood with such a high \"M-count\", referring to the midi-chlorians, he recorded a hologram message for Gideon revealing his failure but promised that he would ultimately succeed. Three days later, Din Djarin returned to Nevarro, where he, Greef Karga and Marshal Cara Dune came across Pershing's recording. The group later evacuated the base after setting the reactor to explode, which destroyed the base.\nFollowing the abduction of Grogu by Moff Gideon, Pershing was being transported aboard Shuttle 2743 when the ship came under attack from Boba Fett in Slave I, and was disabled by Fett's ion cannon. Thinking the shuttle was under attack by pirates, Pershing suggested they fight back, but the co-pilot said he didn't have a death wish and refused. When Djarin and his mercenary ally Cara Dune boarded the shuttle, the co-pilot held a blaster to Pershing's head, stressing the clone engineer's importance to Gideon and the New Republic, although Pershing confirmed to Djarin that Grogu was alive aboard Gideon's light cruiser. After goading Dune about the destruction of Alderaan, she shot and killed the pilot. Pershing's ear was grazed by the blaster bolt, leaving a partial hole.\nAfter Djarin obtained the help of the Mandalorians Bo-Katan Kryze and Koska Reeves, Pershing gave them valuable intel for their raid on Gideon's cruiser, including Grogu's location, and the presence and power-up time of a platoon of third-generation dark troopers. During the raid, Djarin used Pershing's code cylinder to access the brig, and to seal the cargo bay housing the dark troopers.\nPershing was a nervous scientist, and according to the Client, his enthusiasm outweighed his discretion. The doctor was eager to learn about Grogu and was dedicated to his work, but he was also a fearful man, especially when confronted with weapons at the hand of alert Mandalorians. In contrast to the Client, who was willing to acquire Grogu at all costs, Pershing sought to avoid harming the child, and though immediately contradicted by the Client, informed Djarin that Grogu had to be returned alive. When Djarin returned the asset, Pershing refused the Client's demands to do whatever was necessary extract needed material, stating that they had very specific instructions to keep the child alive. This decision ended up saving Pershing's life when Djarin returned to rescue the child, as the Mandalorian realized Pershing was the only one in the facility trying to protect Grogu. He stood 1.7 meters, or 5 feet 7 inches, tall.\nAs a former Imperial scientist, Pershing wore an Imperial scientist officer's uniform, along with a pair of plasspecs. The black belt on his uniform included a compartment with a hidden location device.\nPershing first appeared in the first episode of the 2019 Disney+ television series The Mandalorian, which aired on November 12, 2019. He was portrayed by Omid Abtahi. The design of Pershing's uniform resembles the livery worn by Galen Erso and his colleagues in the 2016 film Rogue One: A Star Wars Story, and the symbol on his right shoulder was inspired by the emblem worn by clone troopers on Kamino in the 2002 film Star Wars: Episode II Attack of the Clones. For the character's entire appearance, including his hairstyle and posture, Brian Matyas took inspiration from Nazi scientists, making everything clean and simplified. Jon Favreau, writer and executive producer of The Mandalorian, felt that glasses were the right look for the character, though design supervisor Doug Chiang was initially nervous about the concept. In the season one finale of the 2021 animated series Star Wars: The Bad Batch, titled \"Kamino Lost,\" a medical officer wearing a uniform similar to that of Doctor Pershing approaches the Kaminoan Nala Se.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Doctor",
  "/wiki/Cloning",
  "/wiki/Bioengineering",
  "/wiki/New_Republic_Era",
  "/wiki/9_ABY",
  "/wiki/The_Client",
  "/wiki/Hunt_for_Grogu",
  "/wiki/Bounty",
  "/wiki/Grogu",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Stormtrooper",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Incident_on_Nevarro",
  "/wiki/Imperial_Remnant_safe_house",
  "/wiki/Death",
  "/wiki/Tython",
  "/wiki/Shuttle_2743",
  "/wiki/Boba_Fett",
  "/wiki/Ion_cannon",
  "/wiki/Starship",
  "/wiki/Slave_I",
  "/wiki/Carasynthia_Dune",
  "/wiki/Pilot",
  "/wiki/Gideon%27s_light_cruiser",
  "/wiki/Scientist",
  "/wiki/Nevarro",
  "/wiki/Force-sensitive",
  "/wiki/Youngling",
  "/wiki/The_Force",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/File:DjarinPershing-Child-TMS1C3.ogg",
  "/wiki/Blood",
  "/wiki/Beskar",
  "/wiki/Mandalorian_armor",
  "/wiki/IT-O_Interrogation_Unit",
  "/wiki/Nevarro_Imperial_base",
  "/wiki/Midi-chlorian",
  "/wiki/Unidentified_Imperial_shuttle_co-pilot",
  "/wiki/Mercenary",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Koska_Reeves",
  "/wiki/Third-generation_design_Dark_Trooper",
  "/wiki/Code_cylinder",
  "/wiki/Imperial_scientist_officer%27s_uniform",
  "/wiki/Plasspecs",
  "/wiki/Belt",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/November_12",
  "/wiki/Omid_Abtahi",
  "/wiki/Galen_Walton_Erso",
  "/wiki/2016",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Clone_trooper",
  "/wiki/Kamino",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Brian_Matyas",
  "/wiki/Jon_Favreau",
  "/wiki/Doug_Chiang",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Kamino_Lost",
  "/wiki/Unidentified_medical_officer",
  "/wiki/Kaminoan",
  "/wiki/Nala_Se",
  "/wiki/Category:Images_of_Pershing",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_(manga)",
  "/wiki/The_Mandalorian_1",
  "/wiki/Chapter_3:_The_Sin",
  "/wiki/The_Mandalorian_3",
  "/wiki/The_Mandalorian:_This_is_the_Way",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/The_Mandalorian:_The_Path_of_the_Force",
  "/wiki/Chapter_12:_The_Siege",
  "/wiki/Chapter_14:_The_Tragedy",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/The_Mandalorian:_The_Rescue",
  "/wiki/The_Mandalorian_Season_Three",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Technology",
  "/wiki/Practical",
  "/wiki/Process",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/The_Mandalorian:_Allies_%26_Enemies",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Mando_Mania",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Databank_(website)",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}