{
 "name": "Pertaal Shenvehr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 36 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.5 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Colonial News Nets",
      "Alliance to Restore the Republic",
      "Alliance Intelligence",
      "Alliance Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Pertaal Shenvehr was a Human, who worked for the Alliance to Restore the Republic during the Galactic Civil War.\nShenvehr worked on Findris, as an Assistant Features Editor for Colonial News Net, a daily data publication. Shenvehr wrote various columns for the publication, including one titled \"Ask Argothil Anything,\" in which he put encrypted messages for members of the Rebel Alliance. Alliance operatives would supply Shenvahr with information through questions on the Imperial NetPost, which he would then write into his column, in a metaphoric form.\nShenvehr received his information through a friend that worked in the Imperial Sector Command on Findris. Shenvehr's messages were widely available to members of the Alliance, but General Airen Cracken considered them to be of little help, as they were difficult to interpret. Despite working for the same company he was unaware that Fionna Flannis was also a Rebel operative.\nShenveehr was a Human male who was only 1.5 meters tall. He wore his beard a bit longer then what was considered fashionable and appeared to wear the same business tunic every day. He was not particularly outgoing and took his editorial work very seriously.\nShenveehr was a talented reporter who had considerable knowledge of the Colonies. He was skilled at uncovering information, but he was not a field operative and did not have combat training.\nAll Shenveehr carried with him was a datapad and a recording rod.\nPertaal Shenveehr was designed by Peter M. Schweighofer for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Brian Schomburg.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/36_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Colonial_News_Nets",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Findris",
  "/wiki/Assistant_Features_Editor",
  "/wiki/Colonial_News_Net",
  "/wiki/Imperial_NetPost",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sector_Command",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Fionna_Flannis",
  "/wiki/Colonies/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Recording_rod",
  "/wiki/Peter_M._Schweighofer",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Brian_Schomburg"
 ]
}