{
 "name": "Perwin_Gedde",
 "display_name": "Perwin Gedde",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Halo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Perwin Gedde was a human male officer of the Galactic Empire. With the rank of Vice Admiral in the Imperial Navy, he spearheaded one of the Empire's most brutal biological weapons programs, which included testing \"ancient diseases\" on subjugated worlds. Following the Imperial defeat at Endor, he fled the Empire with a good deal of Imperial credits, eventually hiding out on Vorlag with slaver Slussen Canker. He was tracked down by a team of New Republic Imperial hunters led by pilot Norra Wexley sometime following the Rebellion on Akiva. Despite temporarily capturing them with the help of Jas Emari, her betrayal led to his capture, and he was placed in isolation on the Halo, their SS-54 assault ship. He died before the team reached Chandrila, poisoned with mycotoxin by bounty hunter Mercurial Swift, under the orders of Admiral Rae Sloane.\nPerwin Gedde was a Vice Admiral who oversaw one of the Galactic Empire's biological weapons programs, which involved testing \"ancient diseases\" on captive worlds. Following the Battle of Endor, Gedde resigned his commission in the Imperial Navy and fled the Empire, absconding with a large sum of credits. He sought refuge with the Vorlaggn crime lord and slaver Slussen Canker on the planet Vorlag. Slussen hosted him in his volcanic palace and plied him with slaves and spice to feed his addiction.\nDue to his involvement in war crimes, Gedde was the subject of a galactic-wide manhunt for Imperial war criminals imposed by the New Republic; the successor government to the Rebel Alliance. In 5 ABY, the New Republic starfighter pilot Norra Wexley and her team of hunters including the bounty hunter Jas Emari, the former Imperial loyalty officer Sinjir Rath Velus, and the New Republic Special Forces soldier Jom Barell tracked Gedde down to Slussen's palace. Prior to the mission, Jas infiltrated the palace through the hroth-beast feeding room in order to disable the crackling laser portcullis.\nIn secret, Jas made a deal with both Gedde and Slussen to betray Norra and her team. Jas was heavily in debt and wanted to trick Gedde and Slussen into helping her pay off her debts. In return for alerting him to the New Republic hunters, Gedde paid Jas while Slussen paid her a 15% finder's fee. Unknown to Gedde and Slussen, Jas was still secretly loyal to Norra and was lulling them into complacency so that she could kidnap Gedde and bring him offworld.\nAfter Norra and her team were ambushed by Slussen's henchmen, Gedde appeared with a seemingly captive Jas. He ordered the New Republic operatives to surrender if they wanted to save their friend Jas. After the rebels laid down their arms, Gedde announced that he was going to sell the \"rebel fools\" to the Empire so that he could secure a full pardon. Jas then publicly claimed that she had double-crossed Norra and her team in order to pay her debts. Gedde laughed and then told Slussen and the guards to load the prisoners into their cages.\nSlussen's triumph was short-lived. While Norra and her team freed themselves using a key that Jas had attached to the neck of one of Slussen's hroth-beasts, Perwin returned to his quarters. There, Jas turned on him, bound his hands with wire, and gagged his mouth. After reuniting with Norra and the rest of her team, the rebel operatives then fled aboard Jas's ship Halo, which was being piloted by Norra's teenage son Temmin Wexley. After escaping Slussen's henchmen and several Imperial starships, the rebels jumped into hyperspace and traveled to Chandrila.\nDespite the efforts of Norra and her team, Perwin perished during the journey due to kytrogorgia poisoning. Perwin had been poisoned by the bounty hunter Mercurial Swift under Grand Admiral Rae Sloane's orders to prevent him from divulging his secrets to the New Republic.\nPerwin Gedde was a thin human man with sallow skin and a bloated belly due to his spice addiction. He wore an unbuttoned gray and filthy shirt. The former Vice Admiral ran a ruthless biological weapons program that tested ancient diseases on captive worlds. Gedde later earned the wrath of the Empire by absconding with a large sum of credits and seeking shelter with the crime lord Slussen Canker. Later, Gedde tried to regain the Empire's favor by capturing Norra Wexley and her team of New Republic hunters. Gedde was later outwitted by Jas Emari, who tricked him and Slussen into believing that she had betrayed her friends, but was still loyal to Norra's team.\nPerwin Gedde first appeared in the novel Aftermath: Life Debt, which was written by Chuck Wendig and released in 2016.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Halo",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Imperial_officer",
  "/wiki/Vice_Admiral",
  "/wiki/Battle_of_Endor",
  "/wiki/Endor",
  "/wiki/Credit",
  "/wiki/Vorlag",
  "/wiki/Slaver",
  "/wiki/Slussen_Urla-fir_Kal_Kethin-wa_Canker",
  "/wiki/New_Republic",
  "/wiki/Imperial_hunter",
  "/wiki/Pilot",
  "/wiki/Norra_Wexley",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Jas_Emari",
  "/wiki/SS-54_assault_ship",
  "/wiki/Death",
  "/wiki/Chandrila",
  "/wiki/Mycotoxin",
  "/wiki/Bounty_hunter",
  "/wiki/Mercurial_Swift",
  "/wiki/Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Planet",
  "/wiki/Vorlaggn",
  "/wiki/Crime_lord",
  "/wiki/Slavery",
  "/wiki/Volcano",
  "/wiki/Slussen_Canker%27s_palace",
  "/wiki/Spice",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galaxy",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Starfighter",
  "/wiki/New_Republic_pilot",
  "/wiki/Hunting",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/Soldier",
  "/wiki/Jom_Barell",
  "/wiki/Capture_of_Perwin_Gedde",
  "/wiki/Hroth-beast",
  "/wiki/Laser",
  "/wiki/Prisoner",
  "/wiki/Starship",
  "/wiki/Temmin_Wexley",
  "/wiki/Hyperspace",
  "/wiki/Kytrogorgia",
  "/wiki/Grand_Admiral",
  "/wiki/Color",
  "/wiki/Lord",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Chuck_Wendig",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}