{
 "name": "Peteen",
 "display_name": "Peteen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bardotta"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Zardossa Stix"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bardottan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dagoyan Order",
      "Bahk-tov Council",
      "Bahk-tov Council",
      "Frangawl Cult"
     ]
    }
   ]
  }
 ],
 "content": "High Seneschal Peteen was a Bardottan politician and member of the Bardotta Bahk-tov Council.\nDuring the Clone Wars, Peteen was the secret leader of a resurgent Frangawl Cult. In league with the Dathomirian Nightsister Mother Talzin, Peteen's cult kidnapped other Dagoyan Masters in order to suck out their living Force. Among his captives was the Dagoyan Master Joseph. However, his ultimate target was the Bardottan queen, Julia. However, due to the cult's activities, Julia contacted the Galactic Republic for assistance, personally requesting the aide of her lover, Jar Jar Binks. Binks arrived, accompanied by the Jedi Master Mace Windu, and they were received by Peteen's welcoming committee. Shortly after the pair's arrival, Julia was captured by the cult. Holding up his guise as a helpful bureaucrat, Peteen handed over the task of finding Julia to Binks, Windu, and the Bardottan guard Savatte.\nBinks was later captured, but rescued by Windu. In addition, they discovered the cult's secret chambers underneath the Bardotta surface. Windu fought Peteen's soldiers, while the traitorous Bardottan made off with Julia, and took her to the planet Zardossa Stix. Windu and Binks tailed him, and eventually confronted Peteen and the remaining cult members at a Zardossa Stix pyramid, where the cultists prepared to suck the living Force out of Julia. Binks and Windu battled the guards, and eventually came face to face with Talzin, who was overseeing the operation. Windu fought Talzin, while Binks rescued Julia. Peteen, however, stumbled into the path of the Force sucking beam, and was promptly disintegrated.\nPeteen appeared in the Star Wars: The Clone Wars television series' episodes \"The Disappeared, Part I\" and \"The Disappeared, Part II.\" He was voiced by Cas Anvar. Although not explicitly stated in the episodes, the guides revealed that Peteen was also the Frangawl Cult leader, in a role that mimicked the character of Chattar Lal from the film Indiana Jones and the Temple of Doom, from which the two episodes draw heavy inspiration.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Peteen",
  "/wiki/Peteen/Legends",
  "/wiki/Bardotta",
  "/wiki/19_BBY",
  "/wiki/Zardossa_Stix",
  "/wiki/Bardottan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Dagoyan_Order",
  "/wiki/Bahk-tov_Council",
  "/wiki/Frangawl_Cult",
  "/wiki/High_Seneschal",
  "/wiki/Politics",
  "/wiki/Clone_Wars",
  "/wiki/Frangawl_cult_leader",
  "/wiki/Dathomirian",
  "/wiki/Nightsisters",
  "/wiki/Talzin",
  "/wiki/The_Force",
  "/wiki/Joseph",
  "/wiki/Queen",
  "/wiki/Julia",
  "/wiki/Galactic_Republic",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Savatte",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/The_Disappeared,_Part_II",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau",
  "/wiki/Standard_year",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2018_Star_Wars_Clone_Wars_10th_Anniversary"
 ]
}