{
 "name": "Petigar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 BBY",
      "Aldhani"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Petigar was a human male Imperial colonel and engineer who was dispatched to Aldhani for the construction of a new airbase, replacing the Alkenzi Air Base and moving it closer to the Aldhani dam, where the Aldhani Garrison was located. Petigar was killed by Cinta Kaz during a rebel mission on Aldhani.\nIn 5 BBY Petigar was working as an Imperial engineer on Coruscant. He was dispatched to Aldhani where he was to oversee preparations for the construction of a new airbase next to the Nasma Klain dam to replace the Alkenzi installation. He arrived at the planet in a Lamdba-class shuttle a day before the Eye of Aldhani, a major celestial phenomenon, was due to take place and after being greeted by Commandant Jayhold Beehaz he immediately got to work on the dam.\nIn the morning of the Eye Petigar enjoyed his breakfast with Commandant Beehaz, who tried to charm him by describing how the garrison managed to significantly limit the number of Dhani pilgrims congregating in the valley temple. After getting dressed, he accompanied Beehaz and his family to the greeting ceremony where they, along with Lieutenant Gorn welcomed the pilgrims and exchanged furs with them. The welcoming party then headed back to the dam escorted by a unit of men from Alkenzi, in reality a rebel infiltrator party under former stormtrooper Taramyn Barcona. Once inside the base, the rebels pointed their weapons at the officers and the Commandant's family, ordering them not to move and to drop their weapons. Petigar, enraged with this, drew his sidearm and pointed it at Barcona instead, asking the rebels to let the kid go. Amid the chaos, fellow rebels Cinta Kaz and Vel Sartha descended from a nearby service ladder, having infiltrated the dam themselves, and Cinta immediately shot and killed Petigar.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/5_BBY",
  "/wiki/Aldhani",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Lieutenant",
  "/wiki/Gorn",
  "/wiki/Commandant",
  "/wiki/Jayhold_Beehaz",
  "/wiki/Imperial_officer",
  "/wiki/Colonel",
  "/wiki/Engineer",
  "/wiki/Alkenzi_Air_Base",
  "/wiki/Aldhani_dam",
  "/wiki/Aldhani_Garrison",
  "/wiki/Death",
  "/wiki/Cinta_Kaz",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Leonart_Beehaz",
  "/wiki/Coruscant",
  "/wiki/Nasma_Klain",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Eye_of_Aldhani",
  "/wiki/Dhani",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Stormtrooper",
  "/wiki/Taramyn_Barcona",
  "/wiki/Vel_Sartha",
  "/wiki/Aldhani_(episode)",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Kassa_(episode)"
 ]
}