{
 "name": "Petro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.26 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "A clan",
      "A clan",
      "Preigo's Traveling World of Wonder",
      "Animal Instincts",
      "Animal Instincts"
     ]
    }
   ]
  }
 ],
 "content": "Petro was a human male Jedi youngling who served the Jedi Order during the Clone Wars. Prior to the end of the conflict, he participated in an ancient Jedi rite of passage, known as The Gathering, to find a kyber crystal—the key component to the lightsaber he would construct after his visit to the planet Ilum.\nPetro was born on Corellia and being Force-sensitive, he was taken to the Jedi Temple on Coruscant to begin his Jedi training and learn the ways of the Force.\nBeing amongst the top of his class, Petro was one of six Jedi younglings, along with Ganodi, Byph, Katooni, Zatt, and Gungi, selected to travel to the sacred planet Ilum to take part in the ancient Jedi ritual known as The Gathering. As he entered the Crystal Cave to search for his crystal, he confidently and quickly found a crystal he believed to be his, but would watch it melt in his hand as he realized he had been to quick to think he had completed the task. As he saw a trapped Katooni, he begins to walk away before realizing he should help her. As he helped her use the Force to shatter the wall of ice blocking her, he saw his crystal returned from the cave.\nFollowing the successful nature of the Gathering, Petro and his fellow younglings returned to the Crucible, where Petro demonstrated a technique, seemingly of his own invention that he described as the Whirlwind of Destiny. Under the guidance of Professor Huyang, an Architect droid who had been teaching Jedi how to build a lightsaber for more than a thousand years, He showed different models of lightsabers and asked them to visualize what kind of lightsaber they wanted to build so that they could complete the construction of their lightsaber. Petro was the first one to finish building his saber and told Zatt that with his lightsaber, he would challenge Obi-Wan Kenobi to a duel and kill General Grievous. But after Huyang examined it, He noted that that the only person that Petro would kill would be himself as Petro incorrectly assembled his lightsaber because he inverted the emitter matrix which would cause the power grid to backfire. Huyang stated that if Petro tried to activate his lightsaber now that the only thing that would be left of him and his lightsaber would be his crystal. Huyang told Petro to start over and to follow the diagram.\nBut before Petro or any of the younglings could finish constructing their lightsaber, they were attacked by Hondo Ohnaka and his pirate gang. Huyang told the younglings to hand over their crystals for safekeeping, but Petro secretly kept his crystal. When they were attacked by the pirates, Petro activated his lightsaber, much to everyone's surprise, and allowed one of the pirates to take it. When if malfunctioned and exploded, the group escaped, with Petro reclaiming his crystal. Despite their efforts, Ahsoka was taken by the pirates and brought to their base on Florrum.\nPetro and the other younglings were left onboard the damaged Crucible. Katooni decided to try to make contact with someone, and she was able to reach Master Kenobi. He told the younglings to wait for him as he was about to engage Grievous and his fleet. Petro voiced his wishes to try to help Ahsoka themselves, and although Katooni did not agree, many of the others did. They then headed towards Florrum to mount a rescue mission. Upon landing, Ganodi decided to stay with Huyang to work on repairs as the others ventured off towards the pirate base.\nPetro and the others soon met Preigo's circus, who were traveling towards the pirate camp to perform for them. Petro took the lead, telling Preigo that they were acrobats, and after using their Force abilities to impress the Dug, he let them join his act. They then traveled with the circus to Hondo's base and successfully rescued Ahsoka.\nPetro, along with some of his fellow younglings were outside of the temple training with their lightsabers under Jedi Master Tera Sinube, when they witnessed a duel between Anakin Skywalker and Barriss Offee, who was the real culprit behind the Bombing of the Jedi Temple hangar and the framing of Ahsoka Tano. When Barriss kicked Anakin off the roof of a building they were dueling on, he fell to where the younglings were training. Master Sinube immediately activated his lightsaber to defend himself and the younglings if need be. Petro quickly warned Anakin to look out when Barriss leaped down to strike at Anakin. Anakin was able then to defeat Barriss and take her into custody.\nPetro was created and developed for the Star Wars: The Clone Wars animated television series. He was voiced by Jeff Fischer.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Petro",
  "/wiki/Petro/Legends",
  "/wiki/Petro_(disambiguation)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Unidentified_Clan_(The_Gathering)",
  "/wiki/Preigo%27s_Traveling_World_of_Wonder",
  "/wiki/Animal_Instincts",
  "/wiki/Jedi",
  "/wiki/Jedi_Initiate",
  "/wiki/Clone_Wars",
  "/wiki/The_Gathering",
  "/wiki/Kyber_crystal",
  "/wiki/Lightsaber",
  "/wiki/Planet",
  "/wiki/Ilum",
  "/wiki/Force-sensitive",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Jedi_training",
  "/wiki/The_Force",
  "/wiki/Ganodi",
  "/wiki/Byph",
  "/wiki/Katooni",
  "/wiki/Zatt",
  "/wiki/Gungi",
  "/wiki/Crystal_Cave",
  "/wiki/Youngling",
  "/wiki/Crucible",
  "/wiki/Whirlwind_of_Destiny",
  "/wiki/Huyang",
  "/wiki/Architect_droid",
  "/wiki/Standard_year",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Lightsaber_combat",
  "/wiki/Death",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Pirate",
  "/wiki/Ohnaka_Gang",
  "/wiki/Florrum",
  "/wiki/Preigo",
  "/wiki/Dug",
  "/wiki/Jedi_Master",
  "/wiki/Tera_Sinube",
  "/wiki/Anakin_Skywalker",
  "/wiki/Barriss_Offee",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Jeff_Fischer",
  "/wiki/The_Gathering_(episode)",
  "/wiki/A_Test_of_Strength",
  "/wiki/Bound_for_Rescue",
  "/wiki/A_Necessary_Bond",
  "/wiki/Almost_a_Jedi",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Destiny_(episode)",
  "/wiki/Yoda",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Pirate%27s_Price",
  "/wiki/Pirate%27s_Price_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars_Helmet_Collection_72",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Inside_Intel:_Lightsabers",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)"
 ]
}