{
 "name": "Peyar_Cortess",
 "display_name": "Peyar Cortess",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Cortess"
     ]
    }
   ]
  }
 ],
 "content": "Baron Peyar Cortess was a Human male who served as lord of House Cortess, one of the noble houses of Alderaan during the Cold War.\nAn ally of the House of Thul, and thus of the Sith Empire, Baron Peyar ruled his family in a period dominated by increased Killik activity. His estate was built to withstand an invading army - or a Killik swarm.\nDuring the Cold War, Imperial Intelligence dispatched their rising-star agent, code-name Cipher Nine, to search for information regarding a financial backer of the terrorist leader known as \"The Eagle\", responsible for the assassination of Darth Jadus, a member of the Dark Council. Despite initial hostility from the Baron's wife, Baroness Chay, Cipher Nine was able to secure an audience with the Baron and obtain his aid in hunting down the terrorist ally, the renowned mediator Denri Ayl. However, it was subsequently revealed that Baroness Chay was an ally of the Eagle, and attempted to warn Ayl.\nWith the aid of Joiner emissary Vector Hyllus and his Killik nest, Cipher Nine destroyed House Cortess' defenses and entered the throne room, where an enraged Baron Peyar condemned his wife for her treachery. Surrendering to the Imperial Agent, Baron Peyar ordered his guard captain Perovius to kill the Baroness, and pleaded with the Agent to spare House Cortess from the Killiks. Cipher Nine coldly instructed Vector to order the Killiks to attack, and then killed the Baron, his captain and his remaining guard.\nThe endgame in House Cortess can end one of two ways. The dark side option  is to allow Vector's Killiks to claim House Cortess as a new hive, and the player must then kill Baron Peyar, Captain Perovius and their guard. The light side option is to hold back the Killik attack and allow Baron Peyar and his troops to live.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/3643_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Cortess",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/House_of_Thul",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Killik/Legends",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Cipher_Nine",
  "/wiki/Eagle",
  "/wiki/Darth_Jadus",
  "/wiki/Dark_Council",
  "/wiki/Chay_Cortess",
  "/wiki/Denri_Ayl",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/Joiner",
  "/wiki/Vector_Hyllus",
  "/wiki/Perovius"
 ]
}