{
 "name": "Phenlass Sur",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Reesarian"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Phenlass Sur was a Reesarian that joined the Resistance with Odla Sur, to whom Phenlass was bonded and married. The pair served as soldiers and scouts, and used their keen senses to investigate the jungle beyond the perimeter of the Resistance's base on the jungle moon Ajan Kloss, discovering freshwater springs and fauna migratory patterns. In 35 ABY, the couple attended a meeting at the base where Resistance pilot Poe Dameron revealed that the Sith Lord Darth Sidious had returned.\nPhenlass Sur was a Reesarian who formed a bonded pair with fellow Reesarian Odla Sur and swore a vow of companionship as part of their marriage. The pair then joined the Resistance together and took part in its war against the First Order as soldiers and scouts. They were part of the Resistance forces stationed at a base on the jungle moon Ajan Kloss, where they carried out reconnaissance on the outlying jungle beyond the perimeter of the base. Using only sound and sent, the couple detected freshwater springs and by examination of the underbrush they were able to plot migratory routes of local fauna.\nIn 35 ABY, the pair stood under the cockpit of the CR90 corvette Tantive IV while attending a meeting at the base in which Resistance pilot Poe Dameron revealed that the Sith Lord Darth Sidious had returned and created a fleet on the planet Exegol that would allow the First Order to take control of the galaxy. During the meeting Odla placed a hand on Phenlass's shoulder and lent in to speak to the Reesarian.\nPhenlass Sur had precise senses, which were used in reconicense on Ajan Kloss. As a bonded couple, the Surs were highly attuned to each others whereabouts. Phenlass had red skin and hair, which were worn in traditional Reesarian locks.\nPhenlass Sur wore an outfit of various shades of brown consisting of a shirt with a vest over it, leg bindings to keep out insects and moisture, a pair of boots and a belt. The Reesarian also wore two scarves, one brown and one patterned, and carried a blaster in a holster.\nPhenlass Sur first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Reesarian",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Odla_Sur",
  "/wiki/Marriage",
  "/wiki/Soldier",
  "/wiki/Scout",
  "/wiki/Jungle",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Water",
  "/wiki/35_ABY",
  "/wiki/Resistance_pilot",
  "/wiki/Poe_Dameron",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Cockpit",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Final_Order",
  "/wiki/Planet",
  "/wiki/Exegol",
  "/wiki/The_galaxy",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Insect",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Blaster",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_Phenlass_Sur",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY"
 ]
}