{
 "name": "Philo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kinyen"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 21 BBY and 20 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Philo was a Gran male senator who served in the Galactic Senate during the Clone Wars. He was one of the senators who opposed the Enhanced Privacy Invasion Bill and called a meeting in the lobby to discuss it, unaware that bounty hunters were in the Senate too. He was killed during bounty hunter Cad Bane's raid on the Senate.\nPhilo was a male Gran member of the Galactic Senate during the Clone Wars. He was friends with Padmé Amidala and Bail Organa. During the war, Philo called a meeting with some of his fellow senators to discuss the Enhanced Privacy Invasion Bill, and hoped to stop the vote. None of the Senators knew, however that Cad Bane and a group of bounty hunters had infiltrated the Senate building. While in their discussion, Bane entered the lobby and let out two gunshots, causing the Senators to look round in surprise. Bane said they were now his prisoners. Philo scoffed, saying he refused to be part of this mockery and went to leave. Bane then shot the Gran in the back, killing him with the single shot. His body remained there when the hunters set explosive charges to kill the other senators if they moved. Bane then left, the first part of his mission a success. Bane succeeded in breaking Ziro Desilijic Tiure out of prison using the senate hostages to bargain. He then went to detonate the charges, but Anakin Skywalker was able to save them in time by cutting a hole in the floor. Philo's body was destroyed in the explosion. He was the only senator to die during the hostage crisis.\nPhilo wanted to stop the invasion bill from being voted on and had a mindset similar to his fellow senator, Padmé Amidala. He showed no fear in standing up to Cad Bane, which provoked Bane into shooting and killing him in a show of force to dissuade the remaining senators from speaking up against him.\nSenator Philo first appeared in the Star Wars: The Clone Wars television series' first season finale, \"Hostage Crisis.\" He was voiced by Phil LaMarr, who also portrayed several other characters throughout the series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Philo",
  "/wiki/Philo/Legends",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Kinyen",
  "/wiki/21_BBY",
  "/wiki/20_BBY",
  "/wiki/Coruscant",
  "/wiki/Gran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/File:BanePhilo.ogg",
  "/wiki/Senator",
  "/wiki/Clone_Wars",
  "/wiki/Enhanced_Privacy_Invasion_Bill",
  "/wiki/Death",
  "/wiki/Bounty_hunter",
  "/wiki/Cad_Bane",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Anakin_Skywalker",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Hostage_Crisis",
  "/wiki/Phil_LaMarr",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Philo",
  "/wiki/Lightsaber_Lost",
  "/wiki/The_Mandalore_Plot",
  "/wiki/Hostage_Crisis_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/ARC_Troopers",
  "/wiki/Nightsisters_(episode)",
  "/wiki/Standard_year"
 ]
}