{
 "name": "Philap_Bygar",
 "display_name": "Philap Bygar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance High Command",
      "Alliance High Command"
     ]
    }
   ]
  }
 ],
 "content": "Philap Bygar was a human male who served as a general in the Rebel Alliance's High Command during the Galactic Civil War. In 3 ABY, he was present at High Command's Echo Base on the planet Hoth, where he greeted members of the Alliance's 61st Mobile Infantry, also referred to as Twilight Company, who were escorting Imperial defector Governor Everi Chalis. Bygar made sure to commend the unit for its accomplishments.\nWhen one Twilight Company member, First Sergeant Hazram Namir, became involved in a fight at the base, Bygar disciplined the soldier but did not inform the company's captain, Micha Evon. Soon after, the Galactic Empire invaded the base, scattering the Alliance. Bygar died, and his death was reported sometime after to Namir when he contacted a rebel relay station.\nDuring the Galactic Civil War between the Rebel Alliance and the Galactic Empire, Philap Bygar served as a general in the Alliance High Command. In 3 ABY, he was stationed at Echo Base, the High Command's secret base on the planet Hoth, where a grand strategy conference was held by the High Command. Among the invited guests was Everi Chalis, a former Imperial governor and emissary to the Imperial Ruling Council who had defected to the Alliance's 61st Mobile Infantry, better known as Twilight Company. Backed by three armed rebel soldiers, Bygar met Chalis upon her arrival. Chalis, bound by stun cuffs per the High Command's conditions, arrived with Micha Evon, the captain of Twilight Company, and an escort comprised of First Sergeant Hazram Namir and the rebel soldiers Roja and Beak.\nBygar introduced himself to the members of Twilight Company and then eventually to Chalis, acknowledging the former governor's work as an artist and with the Imperial Ruling Council. When Chalis pointed out her stun cuffs, the general assured her that the Alliance believed in redemption. Bygar further commended Twilight Company for being able to survive some tough assignments, citing the times the company was sent to the astronomical objects Praktin and Blacktar Cyst. After expressing his gratitude for the group's service, Bygar then informed Chalis and Evon's escort that they were to be put to work, also telling them that all that the Alliance members could ever do with respect to spending time on Hoth was try and make the conditions there \"livable.\"\nTwo days later, Namir was involved in a fight with the Alliance Special Forces soldier Kryndal. Bygar greeted the former the next morning at the medical center, where he expressed his disappointment with the first sergeant. The general further explained to Namir that Evon had not been informed of his behavior, which Namir was grateful for. Despite this, Bygar still punished him with the approval of medical staff by assigning the first sergeant to carry shipping crates from the hangar bays to the base's interior.\nWhen holojournalist Corwi Selgrothe arrived at Echo Base to record stories of the Rebellion, she reported to Bygar. He welcomed her and then directed her to communications officer Toryn Farr for a briefing. The next day, however, the Empire attacked the Alliance at Hoth. The Alliance was on the run thereafter and High Command was scattered. Bygar himself died, and news of this reached Namir later that year when the first sergeant contacted a rebel at a relay station shortly before Twilight Company attacked the planet Sullust.\nPhilap Bygar was a human male with pale skin, graying hair, and a thick mustache. He held high hopes for the Imperial defector Everi Chalis and assured her that the Alliance believed in redemption. Bygar gave many compliments to the members of Twilight Company and kept Hazram Namir's unsatisfactory behavior a secret from his captain, Micha Evon.\nWhile on Hoth, Bygar wore a heavily padded jacket that had a hood and the rank insignia of an Alliance general.\nPhilap Bygar first appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alliance_High_Command",
  "/wiki/General",
  "/wiki/Galactic_Civil_War",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Company",
  "/wiki/Galactic_Empire",
  "/wiki/Governor",
  "/wiki/Everi_Chalis",
  "/wiki/First_Sergeant",
  "/wiki/Hazram_Namir",
  "/wiki/Rebel_trooper",
  "/wiki/Captain",
  "/wiki/Micha_Evon",
  "/wiki/Battle_of_Hoth",
  "/wiki/Death",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Stuncuffs",
  "/wiki/Soldier",
  "/wiki/Roja",
  "/wiki/Beak_(individual)",
  "/wiki/Artist",
  "/wiki/Stun",
  "/wiki/Praktin",
  "/wiki/Blacktar_Cyst",
  "/wiki/Time",
  "/wiki/Standard_day",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Kryndal",
  "/wiki/Echo_Base_medical_center",
  "/wiki/Sergeant",
  "/wiki/Hangar",
  "/wiki/Holojournalist",
  "/wiki/Corwi_Selgrothe",
  "/wiki/Communications_officer",
  "/wiki/Toryn_Farr",
  "/wiki/Standard_year",
  "/wiki/Unidentified_female_rebel",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/Sullust",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Rebel_command_insignia",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Heroes_of_the_Rebellion_(short_story)",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_32",
  "/wiki/Helmets",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}