{
 "name": "Philinda",
 "display_name": "Philinda",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Philinda was a female Human who lived during the waning years of the Republic Classic era.\nIn c. 31 BBY, Philinda accompanied a number of tourists that were visiting the droid production plants on the moon Uffel, in the Cularin system. During the trip, Philinda and some of the other tourists, the Humans Nia Reston, San Herrera, the Rodian Nikolo and the Sullustan Tret, were recruited by the droid LN-73 into assisting him at sabotaging the production facilities. LN-73 did this by lying to them by claiming that HG-211, Uffel's head of security, had been corrupted. Philinda and the rest of the group then attacked the Heroes of Cularin, who LN-73 falsely claimed were sabotaging the droid factories.\nFollowing the incident, San Herrera developed a romantic interest in Philinda and began to refer to her as \"the hot one\". He talked about her regularly to his friend Nia Reston and kept suggesting that he and Reston call Philinda and see if she knew about any new jobs that were available. Reston mentioned Herrera's feelings for Philinda to the reporter Yara Grugara while the pair were being interviewed for Eye on Cularin. Upon Grugara's inquiry, Herrera claimed that he and Philinda were a couple, while Reston denied that they were.\nPhilinda later left the Cularin system, to visit her parents on the planet Coruscant. During her absence, the conflict in the Cularin system between the Thaereian military and the Cularin Militia began to heat up, preventing her from returning to the system.\nGrugara later interviewed Reston and Herrera again about their newly-published paper Droid Rights, and asked them about how Herrera's relationship with Philinda was going. Herrera told the reporter about her departure from the Cularin system and once again claimed that he and Philinda were and item, while Reston once again claimed that they weren't.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Nia_Reston",
  "/wiki/San_Herrera",
  "/wiki/Standard_year/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/31_BBY/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Uffel",
  "/wiki/Cularin_system",
  "/wiki/Rodian/Legends",
  "/wiki/Nikolo",
  "/wiki/Sullustan/Legends",
  "/wiki/Tret",
  "/wiki/LN-73",
  "/wiki/HG-211",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Yara_Grugara",
  "/wiki/Eye_on_Cularin",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Thaereian_military",
  "/wiki/Cularin_Militia",
  "/wiki/Droid_Rights",
  "/wiki/Something_Uffel",
  "/wiki/Tilnes_Rising",
  "/wiki/Wizards.com",
  "/wiki/Trouble_Follows_Us",
  "/wiki/Cause_of_the_Month"
 ]
}