{
 "name": "Phloremirlla_Tenk",
 "display_name": "Phloremirlla Tenk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Haruun Kal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Balawai",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Phloremirlla Tenk, ubiquitously known simply as Flor, was a Republic Intelligence agent. She was a Human woman with a red face, roughly Mace Windu's age. She joined Republic Intelligence in 55 BBY. By 22 BBY, she held the rank of RS-17 and was planetary chief of Republic Intelligence on Haruun Kal.\nShe was stationed out of Pelek Baw, the capital city of the planet. Her cover was head of the Highland Green Washeteria; five of her 37 employees were also Intelligence agents. Flor became friends with Colonel Lorz Geptun, head of the Pelek Baw militia. During the early stages of the Clone Wars she became a double agent, and secretly worked for the Balawai and the Confederacy of Independent Systems.\nWhen Jedi Master Mace Windu traveled to Haruun Kal six months after the First Battle of Geonosis to look for the rogue Master Depa Billaba, he was instructed to contact Tenk, who would bring him to an upcountry team for the journey to Billaba and her band of Korunnai rebels. While leading Windu to the team, however, Tenk was hit by a blaster bolt, seemingly in the crossfire of a local street gang fight, and her entire left arm was severed. Windu attempted to save her by using the Force to pinch the brachial artery shut, but he was shot by the Balawai militia. Tenk promptly died of blood loss.\nWindu would later learn of Tenk's treachery after he confronted the \"upcountry team,\" which was merely a band of thugs on Tenk's payroll that were to assassinate Windu. He would also learn that she had been hit not by a misfired shot from a gang sniper but by Nick Rostu, who had been sent by Master Billaba for Windu and was aware of Tenk's treason.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Haruun_Kal/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Balawai",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/55_BBY/Legends",
  "/wiki/RS-17",
  "/wiki/Pelek_Baw",
  "/wiki/Planet/Legends",
  "/wiki/Highland_Green_Washeteria",
  "/wiki/Colonel/Legends",
  "/wiki/Lorz_Geptun",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Depa_Billaba/Legends",
  "/wiki/Korun/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Nick_Rostu",
  "/wiki/Treason/Legends",
  "/wiki/Shatterpoint_(novel)"
 ]
}