{
 "name": "Phoca_Soot",
 "display_name": "Phoca Soot",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "14 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Coruscant Security Force",
      "Coruscant Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Phoca Soot was a Twi'lek male police officer who lived during the early years of the Galactic Empire on the planet Coruscant. Soot served as an Imperial police prefect, charged with controlling crime on Level 1331. He was executed by the Sith Lord Darth Vader for taking bribes.\nPhoca Soot lived on the planet Coruscant during the early years of the Galactic Empire. He achieved the rank of an Imperial police prefect and was responsible crime control operations on Level 1331. However, Soot became greedy and began taking bribes from the crime lords under his supervision, specifically the Droid Gotra who were allies of the Crymorah Syndicate. With Soot on the Droid Gotra's payroll, crime in his sector flourished which brought the situation to the attention of the Sith Lord Darth Vader.\nIn 14 BBY, Soot was called to the Imperial Palace along with several members of the criminal underworld from Level 1331 in an apparent effort to discover the reason for the surge in crime. Moff Wilhuff Tarkin arrived on Coruscant for an audience with Emperor Sheev Palpatine just as the proceedings began. Tarkin accompanied Grand Vizier Mas Amedda into the courtroom where Darth Vader, Soot, and Deputy Director of the Imperial Security Bureau Harus Ison were midway through the proceedings. Vader, after threatening the criminals with imprisonment or death if they did not leave Coruscant, then revealed he knew the identity of the person responsible for the surge in crime. To make his point, Vader turned and used the Force to crush Soot's heart, killing him.\nSoot was a male Twi'lek with a thin build and red tails. Though he had risen to a position of command as prefect of one of Coruscant's sectors, he succumbed to the temptation of being on a crime syndicate's payroll, despite the risk of angering the Emperor. Shortly before executing Soot, Vader remarked that his actions were quite brazen and prideful or at the least, Soot failed to grasp the seriousness of the actions he had taken.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/14_BBY",
  "/wiki/Coruscant",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Police_officer",
  "/wiki/Standard_year",
  "/wiki/Planet",
  "/wiki/Prefect_(Coruscant_police)",
  "/wiki/Level_1331",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Crime_lord",
  "/wiki/Droid_Gotra",
  "/wiki/Crymorah_Syndicate",
  "/wiki/Imperial_Palace",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Grand_Vizier",
  "/wiki/Mas_Amedda",
  "/wiki/Darth",
  "/wiki/Deputy_Director",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Harus_Ison",
  "/wiki/Death",
  "/wiki/The_Force",
  "/wiki/Heart",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}