{
 "name": "Phoenix One  (Siege of Lothal)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Phoenix Cell",
      "Phoenix Squadron",
      "Phoenix Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A human male flew under the callsign \"Phoenix One\" four years before the Battle of Yavin. A member of Phoenix Squadron, a fleet composed of RZ-1 A-wing interceptors that operated under the command of Jun Sato, Phoenix One led the rest of the squadron during a mission to steal shield generators from the Galactic Empire. Phoenix One later participated in a dogfight with the Sith Lord Darth Vader which occurred during the Siege of Lothal. The Sith Lord dealt heavy damage to Sato's fleet, and Phoenix One's life was lost to Vader. After further fighting, Sato and the remainder of Phoenix Squadron escaped.\nA human male was a member of Phoenix Squadron, a small fleet of RZ-1 A-wing interceptors under the leadership of Commander Jun Sato, four years before the Battle of Yavin. The squadron opposed the rule of the Galactic Empire, and joined a rebel network led by Imperial senator Bail Organa and ex-Jedi Ahsoka Tano. The human pilot served Phoenix Squadron as Phoenix One.\nShortly before the Empire laid siege to the planet Lothal, Phoenix One participated in a mission to steal Imperial shield generators alongside by the starship Ghost and its crew, led by Captain Hera Syndulla. A CR90 corvette commanded by Sato was also present for the mission. Although Syndulla's co-pilot and gunner Kanan Jarrus felt discontented with working alongside a formal military unit such as Phoenix Squadron, the other members of the Ghost crew were accepting of the help. Encountering Imperial Gozanti-class cruisers in space, Phoenix Squadron and the Ghost battled the Imperial TIE/ln space superiority starfighter defenders. Phoenix One, alongside a pilot flying under the callsign Phoenix Two, made short work of several TIE fighters docked on the cruisers at the request of Captain Syndulla. With the remaining TIE fighters on the run, Phoenix One declared that the Ghost was clear to proceed.\nSabine Wren, piloting the Ghost's detachable shuttle, the Phantom, liberated on the Gozanti cruisers of its cargo. However, two Imperial Arquitens-class light cruisers arrived to support the cargo ships, thus strangulating the rebel force. Phoenix One was set upon by fresh TIE fighters, but Wren was able to destroy one of them, easing Phoenix One's load. Sato's corvette received the brunt of the light-cruisers' attacks, and Sato began to order a retreat. However, the Ghost first grabbed the supplies that they had come for.\nPhoenix Squadron made the jump to lightspeed, leaving Wren to dock the Phantom with the Ghost before they too left the Imperials behind. However, the supplies was revealed to not contain any shield generators as hoped.\nSometime later, the rebels learned of the Empire's blockade over Lothal. The crew of the Ghost sneaked through the blockade in an attempt to rescue an Imperial defector, but the mission turned disasterous when the defector was killed, which was followed by the appearance of the Sith Lord and Imperial enforcer Darth Vader. The crew escaped back to the Phoenix fleet, but were followed by Vader in his personal TIE Advanced x1 starfighter. Phoenix One led the other Phoenix pilots into battle against the solitary attacker, but were no match for Vader's superior piloting skills. Phoenix One and several other pilots, including Phoenix Two, lost their lives to the Sith Lord, who then destroyed Sato's command ship, Phoenix Home.\nAfter a difficult fight with Vader's reinforcements, the rebels eventually escaped the Empire one more time.\nPhoenix One was a human male with light-colored skin.\nWhile piloting his A-Wing, Phoenix One wore a red jumpsuit and a beige helmet. His A-Wing had blue markings across it. Later he had green and yellow markings.\n\"Phoenix One\" first appeared in the Star Wars Rebels: The Siege of Lothal, the television movie that acted as the season two premiere of the Star Wars Rebels television series. Phoenix One's voice was provided by Matthew Wood.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/4_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Phoenix_Cell",
  "/wiki/Phoenix_Squadron",
  "/wiki/Callsign",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Jun_Sato",
  "/wiki/Phoenix_One",
  "/wiki/Mission_to_steal_Imperial_shield_generators",
  "/wiki/Galactic_Empire",
  "/wiki/Attack_on_Phoenix_Squadron_(4_BBY)",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Siege_of_Lothal",
  "/wiki/Commander",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Jedi",
  "/wiki/Ahsoka_Tano",
  "/wiki/Pilot",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Captain",
  "/wiki/Hera_Syndulla",
  "/wiki/CR90_corvette",
  "/wiki/Kanan_Jarrus",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Phoenix_Two",
  "/wiki/Sabine_Wren",
  "/wiki/Shuttle",
  "/wiki/Phantom",
  "/wiki/Cruiser",
  "/wiki/Arquitens-class_light_cruiser",
  "/wiki/Corvette",
  "/wiki/Lightspeed",
  "/wiki/Deflector_shield_generator",
  "/wiki/Blockade",
  "/wiki/Maketh_Tua",
  "/wiki/TIE_Advanced_x1",
  "/wiki/Starfighter",
  "/wiki/Phoenix_Home",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Matthew_Wood",
  "/wiki/Star_Wars:_Force_Arena"
 ]
}