{
 "name": "Phoenix Leader  (Ibaar)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 BBY",
      "over Ibaar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Phoenix Cell",
      "Phoenix Squadron",
      "Phoenix Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A human male flew under the callsign \"Phoenix Leader\" for Phoenix Cell, an anti-Galactic Empire fleet composed of RZ-1 A-wing interceptors that operated under the command of Jun Sato. During 4 BBY, Phoenix Leader led the squadron in an attack against the Empire over the planet Ibaar in an attempt to break the Imperial's planetary blockade and deliver relief supplies to Ibaar's starving populace. When the supply ship Transport One was destroyed by the Imperial defenses the rebels ordered a full retreat. However, the life of Phoenix Leader was claimed by Imperial fire during the escape. Rebel pilot Hera Syndulla was later promoted as the human's successor after her participation in a second rebel strike against the blockade that proved successful.\nDuring the year 4 BBY a human male was a member of Phoenix Cell, a small fleet of RZ-1 A-wing interceptors under the leadership of Commander Jun Sato. The squadron opposed the rule of the Galactic Empire, and joined a rebel network led by Imperial senator Bail Organa and ex-Jedi Ahsoka Tano. Sometime after the Siege of Lothal, the human male pilot served Phoenix Squadron as Phoenix Leader.\nAs Phoenix Leader, he participated in a mission to deliver food to the Imperial occupied planet Ibaar, as an Imperial blockade cut off the planet's ability to receive off world resources needed for the world's populace to survive. The rebels' plan was to storm the blockade and send a transport loaded with food down to Ibaar's surface, where it would be received by local miner Eesh Fahm. Phoenix Leader and four other A-Wing starfighters joined the CR90 corvette Transport One, the chosen supply vessel, and the starship Ghost, captained by the Twi'lek Hera Syndulla, in the mission. After initially engaging the Imperial blockade, the Imperial commander, Agent Kallus of the Imperial Security Bureau, opened a communications line and ordered the approaching rebels to disperse. Instead, Syndulla and Phoenix Leader engaged the Imperial ships.\nSyndulla ordered Phoenix Leader to concentrate on the Imperial TIE fighters and cover the Ghost, which Phoenix Leader promised to do. Despite the rebels destroying several TIE fighters in the ensuing fight, the skirmish turned towards the Empire's favor when Transport One was destroyed. The order to retreat was given, and Phoenix Leader had his men fall back. However, Phoenix Leader's escape was cut short by Imperial fire. News of his death spread through the rebel comm channels, and the remainder of Phoenix Squadron escaped the system.\nDespite the initial failure, Syndulla returned to Ibaar with an experimental starfighter loaded with advanced weapons and helped the rebel forces break through the blockade and deliver food to the planet's populace. For her actions, Syndulla was promoted as the new Phoenix Leader.\nPhoenix Leader was a human male with light-colored skin and blue eyes. When Syndulla asked whether or not Phoenix Leader was ready for the assault on the Imperial blockade, Phoenix Leader acknowledged that he and his men were ready for the mission at hand. Phoenix Leader was a capable pilot, and fought Imperial fighters off during the early stages of the mission. However, he was unable to out-maneuver enemy fire as he made his retreat.\nWhile piloting his A-wing, Phoenix Leader wore a green jumpsuit and a beige helmet. His A-wing had blue, white, and red markings across it.\nPhoenix Leader first appeared in \"Wings of the Master,\" the fifth episode of season two of the Star Wars Rebels television series. Phoenix Leader's voice was provided by Steve Blum, who also provided the voice for series regular Garazeb Orrelios.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/4_BBY",
  "/wiki/Ibaar",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Phoenix_Cell",
  "/wiki/Phoenix_Squadron",
  "/wiki/Callsign",
  "/wiki/Phoenix_Leader",
  "/wiki/Galactic_Empire",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Jun_Sato",
  "/wiki/Planet",
  "/wiki/Blockade_of_Ibaar",
  "/wiki/Transport_One",
  "/wiki/Death",
  "/wiki/Pilot",
  "/wiki/Hera_Syndulla",
  "/wiki/Standard_year",
  "/wiki/Commander",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Jedi",
  "/wiki/Ahsoka_Tano",
  "/wiki/Siege_of_Lothal",
  "/wiki/Blockade",
  "/wiki/Miner",
  "/wiki/Eesh_Fahm",
  "/wiki/CR90_corvette",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Captain",
  "/wiki/Twi%27lek",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Star_system",
  "/wiki/Prototype_B6",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Wings_of_the_Master",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Steve_Blum",
  "/wiki/Garazeb_Orrelios",
  "/wiki/StarWars.com"
 ]
}