{
 "name": "Phor Cl-lan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lok Revenants"
     ]
    }
   ]
  }
 ],
 "content": "Phor Cl-lan was a male Quarren technician who lived on Lok at the time of the Galactic Civil War.\nAfter the Battle of Yavin, Phor Cl-lan worked for the pirate warlord Nym and the Lok Revenants as the water treatment technician of the city known as Nym's Stronghold.\nIn 1 ABY, the water treatment facility that supplied the city in drinkable water got broken and was unable to correctly filtrate the water, pumped in the sulfur rivers of Lok. Unfortunately, Phor Cl-lan missed the parts required to repair the filtration system. As such, the water provided to the inhabitants of Nym's Stronghold was contaminated with sulfur, causing the population to revolt against Nym. The warlord therefore tasked a loyal spacer to deal with the situation. The spacer accepted to help Phor Cl-lan who needed several chemicals and parts to fix the water treatment facility, namely cationic chemical coagulant, flow control valves and a motor power regulator. The spacer first obtained cationic chemical coagulant from the smuggler Dak Vox and used to resupply the mixing chamber of the filtration system. The spacer then found flow control valves from a pressurized liquid storage unit nearby and used to repair the sedimentation tank. Finally, the spacer acquired a motor power regulator from the quartermaster of the Lok Revenants Ralia Reeven and used it to fix the flocculation chamber. Thanks to the efforts of the spacer, Phor Cl-lan was able to repair the treatment facility and provide clean water to the city and its inhabitants.\nPhor Cl-lan was a Non-Player Character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Phor Cl-lan was added to the game as part of the revamped \"Nym's Theme Park,\" released with the \"Game Update 16,\" on March 23, 2010.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Water/Legends",
  "/wiki/Nym%27s_Stronghold",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Dak_Vox",
  "/wiki/Quartermaster/Legends",
  "/wiki/Ralia_Reeven",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_23",
  "/wiki/2010",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}