{
 "name": "Phow_Ji",
 "display_name": "Phow Ji",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bunduki"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Drongar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Followers of Palawa",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Phow Ji was a male Human mercenary from the planet Bunduki. He was hired as a hand-to-hand combat instructor for the Galactic Republic forces during the Battle of Drongar and made a lieutenant. He was later killed while single-handedly taking on a group of Salissian mercenaries.\nA former Teräs Käsi champion, Ji once defeated Jedi Knight Joclad Danva during a tournament on Bunduki. In 20 BBY he was appointed at Drongar's RMSU-7 as the unit's hand-to-hand combat instructor after the previous instructor had died. After a teräs käsi match against Usu Cley–RMSU-5's combat instructor–Ji met Padawan Barriss Offee with whom he had a miff due to his disbelief in the Force.\nWhile on Drongar, Ji killed three Salissian mercenaries in a hand-to-hand combat after which he took some kind of trophies from them. The battle was recorded by a cam droid that was found by Sullustan reporter Den Dhur. During another of his confrontations with Padawan Offee, she accused him of the mercenaries' murder based on the record. He tried to get her to demonstrate the Force to him, but when Offee did by making a towel hover in midair, he dismissed it. Later, while Ji was walking away Offee used her Jedi abilities to make him trip. As revenge for his humiliation Ji waited for Offee near her quarters the evening after Filba's death. After a quick scuffle he managed to drop the Padawan in the mud.\nAround that time Dhur started following the martial artist trying to make a story out of him. Dhur's original report depicted Ji as a violent thug, but his editor, feeling the Republic needed more heroes during turbulent times, edited it so that Ji came across as a hero.\nJi got into yet another confrontation with Padawan Offee after he killed seven Separatists near the Kondrus Sea. When he was poisoned by a hypo dart fired by a Separatist soldier, she saved his life by channelling the force to heal him, even though she thought him a vile murderer. Enraged not only that a Jedi had saved him but had shown him that the Force was in fact real, Ji walked into the jungle and started a firefight with a group of Salissian mercenaries who were on Drongar training for an assassination mission believed to be of vital importance to the Separatists. During the fight he was hit by a pellet from a slugthrower and was later attacked from the air by Separatist soldiers in a drop ship. Mortally wounded, Ji pulled a thermal grenade and triggered it. Ji died in the ensuing explosion, taking the drop ship and the Separatist soldiers with him. The entire fight was chronicled by a cam droid onto a holocron. The record was delivered to both Barris Offee and Den Dhur.\nIn one of his last acts as Chancellor, Palpatine had a statue of Ji erected in Monument Plaza.\nApart from being a master of Teräs Käsi, Ji was also a master of Hapan, Tae-Jitsu, the Echani, and a dozen other deadly styles.\nDue to his skills Phow Ji was extremely arrogant, taking his defeat of Jonclad Danva as proof the Force was a myth. As such he became enraged when his ego was bruised, violently attacking Barriss when she made him trip. When Barriss Offee healed him in a way that made it impossible to deny the Force's existence Ji decided to go out in a blaze of glory, unwilling to live in a world where he'd have to admit that the Jedi had the power to beat him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bunduki/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Drongar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Followers_of_Palawa",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Drongar",
  "/wiki/Lieutenant/Legends",
  "/wiki/Salissian/Legends",
  "/wiki/Ter%C3%A4s_K%C3%A4si/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Joclad_Danva",
  "/wiki/Palawa_Band",
  "/wiki/Republic_Mobile_Surgical_Unit_7",
  "/wiki/Death/Legends",
  "/wiki/Usu_Cley",
  "/wiki/Republic_Mobile_Surgical_Unit_5",
  "/wiki/Padawan/Legends",
  "/wiki/Barriss_Offee/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Cam_droid/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Den_Dhur",
  "/wiki/Telekinesis/Legends",
  "/wiki/Filba",
  "/wiki/Kondrus_Sea",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Slugthrower/Legends",
  "/wiki/Dropship/Legends",
  "/wiki/Thermal_grenade",
  "/wiki/Holocron/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Monument_Plaza/Legends",
  "/wiki/Hapan_(martial_art)",
  "/wiki/Tae-Jitsu",
  "/wiki/Echani_(martial_art)/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Phow_Ji",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_55",
  "/wiki/MedStar_I:_Battle_Surgeons",
  "/wiki/MedStar_II:_Jedi_Healer",
  "/wiki/Coruscant_Nights_I:_Jedi_Twilight",
  "/wiki/The_Last_Jedi_(novel)",
  "/wiki/Death_Star_(novel)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/Sports_in_the_Star_Wars_Galaxy"
 ]
}