{
 "name": "Phyne",
 "display_name": "Phyne",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Academy"
     ]
    }
   ]
  }
 ],
 "content": "Phyne was a female Human Sith Acolyte at the Sith Academy on Korriban during the Cold War.\nConsidered to be calm and compassionate, Phyne and her partner Teeno served as acolytes in Korriban's Sith Academy during the Cold War. They held a hostility toward Vemrin, who was very strong in the dark side. However, Phyne became interested in a new acolyte upon hearing that they had been summoned to meet with Darth Baras. Phyne, Teeno and two other acolytes intercepted the Warrior and offered to eliminate Vemrin so that they could avoid suspicion of foul play.\nThe Sith Warrior considered their help, hinting that they agreed with their proposal. They obviously failed, since Vemrin returned from his trials gloating over his murder of the acolytes sent against him.\nHowever, Phyne had survived - crippled for months, but pleased that her survival made her stronger. After waking from a coma, she realized the Sith Warrior's wisdom and sent a note of thanks for the valuable lesson in strength.\nIf their help was refused. Phyne and Teeno offered to prove their skills by fighting the Warrior then and there, to establish their qualifications to eliminate Vemrin. If the Warrior agreed and subsequently defeated all four 'supplicants', Phyne became convinced that they couldn't defeat Vemrin either. Phyne realized her shortcomings in the dark side, and decided to rethink her Sith training.\nLater, she would contact the Warrior after witnessing Vemrin defeating six acolytes and feeding their corpses to a tuk'ata. She thanked the Warrior for showing her the limits of her strength.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Sith_Acolyte",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Teeno",
  "/wiki/Vemrin",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Darth_Baras",
  "/wiki/Canon",
  "/wiki/Death/Legends",
  "/wiki/Tuk%27ata/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}