{
 "name": "Pierce",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ziost"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3671 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Army",
      "Outreach Bureau",
      "Imperial Army",
      "Outreach Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Pierce was a Human male who served as a black ops in the reconstituted Sith Empire during the Cold War. Whilst stationed on the planet Taris as a lieutenant, he met the Sith Lord who would one day become the Emperor's Wrath and was eventually assigned to serve under the Sith's command. By 3631 BBY, Pierce had been promoted to Major but was stationed in the Outreach Bureau of Imperial Intelligence. He was later recruited to join the Alliance against the Eternal Empire.\nOriginally from the planet Ziost, Pierce was a teenager when he joined the Imperial Military as a black ops soldier in the Great Galactic War. He served under General Greist during the Cleansing of Nopsin; the general promoted Phenter to Captain instead of him, but Pierce felt that it was the right decision and remained a mere Lieutenant. Eventually he formed his own team that consisted of himself, Lieutenant Tanido, Captain Lorant, and Sergeant Arlos. The team had participated in the assassination of Moff Terrick, the Massacre on Haruun Kal, and Operation Force Crush. Things were doing well until the Treaty of Coruscant, which led to the breakup of Pierce's squad.\nPierce was assigned to the command of Moff Hurdenn on Taris as a lieutenant during the Cold War. The Imperial contingent on the planet was assigned, essentially, to disruption of the Republic effort to rebuild the planet following the Destruction of Taris. Taris itself was not especially useful to the Sith Empire, but they would not allow the Republic to reclaim and rebuild the world.\nPierce was unhappy under Hurdenn's command, believing his talents wasted by a commander too mired in procedures and who was only interested in completing their mission–as opposed to Pierce's desire to do the job well.\nEventually, Pierce crossed paths with Darth Baras' apprentice and quickly found a capable ally. With Hurdenn's blessing, the two teamed up to bring down the Republic's War Trust generals, though Pierce lost his entire current squad in the process.\nAfter this mission was completed, Pierce was released from Hurdenn's command to join up as one of the Warrior's trusted companions. Pierce later admitted to the Sith that he blackmailed his way off Taris by threatening to reveal Hurdenn's affair with a Rodian mistress.\nPierce stayed loyal to the Warrior even after Baras betrayed his apprentice after the beginning of the Galactic War. Luckily, the Sith managed to survive with the intervention of the Emperor's Hand, who granted the Warrior the title of the Emperor's Wrath. The Hand gave the Sith and the crew various assignments meant to undermine Baras and stop him stop Baras from claiming the title of Voice of the Emperor. One of the missions involved reallocating the Armageddon Battalion from Hoth to assist Darth Vowrawn on Corellia. Pierce offered his opinion on General Greist, whom he once served with briefly, describing him \"as tough as they come and stubborn.\"\nAt one point General Arkos Rakton contacted Pierce and requested his team to bring down the Republic's Bastion on Corellia. With the Wrath's permission, Pierce reassembled his black ops team, consisting of Lieutenant Tanido, Captain Lorant, and Sergeant Arlos to penetrate the head of Republic military operations on Corellia. The operation was successful, and not only was the Bastion captured, but the black ops had finally made its place in history.\nUltimately, Pierce chose to remain under the Wrath's command to help train the warrior's future apprentices and soldiers.\nPierce was known to have a lust for action and his soldiering and bravery are stated to be beyond question, but was reckless and sometimes bent the rules to his will. He also had a dislike toward the Republic.\nHe also had a severe disdain towards authority, notably at Moff Hurdenn, Captain Malavai Quinn , General Greist, and Darth Baras. The only person in higher authority whom he respected was the Empire's Wrath, as the Sith also had a thrill for action and allowed the Lieutenant to act as he pleased.\nPierce possesses a wide range of armaments, including Blaster pistols, blaster rifles, fragmentation grenades, flare guns, electromagnetic pulse generators, and flamethrowers. He also wore heavy armor, which made him very resilient to damage.\nPierce had also studied Talzzi, as displayed when he translated Broonmark's request that he join the Emperor's Wrath, although he admitted it was \"spotty.\"\nPierce is a companion character for the Sith Warrior class of Star Wars: The Old Republic. He is voiced by Adam Leadbeater.\nPierce can be recruited into the Eternal Alliance if the player is a Sith Empire character. After the Wrath disappeared and the Eternal Empire of Zakuul proceeded to conquer most of the known galaxy, Pierce was promoted to Major for his efforts under the Wrath's command. But instead of continue in combat duties, he was assigned to Dromund Kaas as sort of a role model for new soldiers in the ongoing struggle with the Republic. Chafing at these duties, Pierce accepted a commission from a secret \"Alliance\" formed by both Republic and Imperial forces to bring down the Eternal Empire.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Pierce_(disambiguation)",
  "/wiki/Ziost/Legends",
  "/wiki/3671_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Army_(Sith_Empire)",
  "/wiki/Outreach_Bureau",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/3631_BBY",
  "/wiki/Major/Legends",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Eternal_Alliance",
  "/wiki/Eternal_Empire",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Great_Galactic_War",
  "/wiki/General/Legends",
  "/wiki/Greist",
  "/wiki/Cleansing_of_Nopsin",
  "/wiki/Nopsin",
  "/wiki/Phenter",
  "/wiki/Captain/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Pierce%27s_black_ops_team",
  "/wiki/Tanido",
  "/wiki/Lorant",
  "/wiki/Sergeant/Legends",
  "/wiki/Arlos",
  "/wiki/Assassin/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Tarrick_(Moff)",
  "/wiki/Massacre_at_Haruun_Kal",
  "/wiki/Haruun_Kal/Legends",
  "/wiki/Operation_Force_Crush",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Hurdenn",
  "/wiki/Destruction_of_Taris",
  "/wiki/Darth_Baras",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/War_Trust",
  "/wiki/Rodian/Legends",
  "/wiki/Galactic_War",
  "/wiki/Hand_of_the_Empire",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Armageddon_Battalion",
  "/wiki/Hoth/Legends",
  "/wiki/Darth_Vowrawn",
  "/wiki/Corellia/Legends",
  "/wiki/Arkos_Rakton",
  "/wiki/Bastion_(Corellia)",
  "/wiki/Malavai_Quinn",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Fragmentation_grenade/Legends",
  "/wiki/Flare_gun",
  "/wiki/Electromagnetic_pulse/Legends",
  "/wiki/Flamethrower/Legends",
  "/wiki/Talz_(language)",
  "/wiki/Broonmark",
  "/wiki/Adam_Leadbeater",
  "/wiki/Zakuul",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Dromund_Kaas",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}