{
 "name": "Pierce_Mantrell",
 "display_name": "Pierce Mantrell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Pierce Mantrell, a Human male, was a thief and con man who lived during the Galactic Civil War.\nPierce Mantrell, a Human male, was a thief and con man during the Galactic Civil War. Money earned from his crimes allowed him to live well, and he had worked for crime lords, as a pirate, an Imperial informer and smuggler. Sometime during the Galactic Civil War, he stole the Amber Eye from the Kubaz crime lord Schnil Hakoon on the planet Kirtania. Unable to escape the planet, he headed into the nearby rain forest. Hakoon struck a deal with a group of undercover Rebel agents to recover the Eye in exchange for supplies.\nIn the rain forest, Mantrell was attacked by a predator lizard and was rescued by the undercover Rebels. Mantrell readily admitted to stealing the eye, but concocted a heart-wrenching tale to win sympathy with his rescuers. He claimed that his daughter, Olina, was ill, and that he was seeking Doctor T'Jaleq Kith'Araquia's aid in curing her. He said that Hakoon had stolen his cargo, forcing him to steal the Eye to pay for medicine.\nMantrell's reason for being in the jungle was to hide among the Araquian tribe that Doctor Kith'Araquia belonged to. He had discovered the tribe a week previously, and reasoned that he would be safe with the tribe for a while after stealing the Eye. Once the hunt for him had died down, Mantrell intended to return to starport and arrange transport off-world. Before leaving, Mantrell intended to sell the location of the Araquia tribe to Imperial forces.\nA consummate thief and liar, Mantrell was always able to concoct believable lies to give him time to escape. He totally believed his own stories, sometimes getting caught up in them and was able to cry on command. He was loyal only to himself, and fancied himself as a ladies man.\nHe was trained to use a blaster, and carried a heavy blaster pistol. A skilled thief, he was an adept pick pocket and used sleight of hand effectively. He had an ear for languages, and was considered to be streetwise. He could be highly persuasive when needed, and was able to move stealthily in urban environments. Mantrell had an eye for valuable objects, and could operate security equipment. During his trek through the rain forest on Kirtania, he carried a medpac, canteen and survival pack.\nMantrell's features are dependent on the players. Mantrell is supposed to resemble one of the player characters to allow for a case of mistaken identity.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Scoundrel",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Crime_lord/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Amber_Eye",
  "/wiki/Kubaz/Legends",
  "/wiki/Schnil_Hakoon",
  "/wiki/Planet/Legends",
  "/wiki/Kirtania",
  "/wiki/Kinkosa_rain_forest",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Predator_lizard",
  "/wiki/Doctor/Legends",
  "/wiki/T%27Jaleq_Kith%27Araquia",
  "/wiki/Standard_week/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Quality_of_Mercy",
  "/wiki/Star_Wars_Adventure_Journal_1"
 ]
}