{
 "name": "Pikka_Adren",
 "display_name": "Pikka Adren",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Pikka Adren was a human female contractor and the wife of Joss Adren, who she worked alongside during the construction of the Starlight Beacon space station.\nThe two volunteered to help the combined Galactic Republic and Jedi Order effort to rescue the Hetzal system from debris of the Great Hyperspace Disaster. Her husband piloted the Republic Longbeam cruiser Aurora III above the Fruited Moon of Hetzal Prime, and Pikka served as his co-pilot.\nLater, Pikka returned to Starlight Beacon with her husband after an accident damaged the hyperdrive on their skiff. She met Stellan Gios in the docking bay and told him that she preferred to stay on Starlight Beacon until the Nihil threat had been dealt with. She and her husband joined a group of travelers who were bartering for parts and supplies. She asked if anyone knew how to fuse a new coupling, and Affie Hollow responded. Hollow and the Adrens agreed to cooperate. Pikka enjoyed a moment with Hollow's crewmate Geode which made her husband jealous.\nPikka ran into Hollow in the docking bay and told her that Koley Linn had been snooping around the Vessel. She offered to assist Hollow if her crewmates weren't around. Pikka sensed that something was upsetting Hollow who told her about the situation on the Starlight Beacon. Pikka returned to her ship and continued with repairs. She got more worried as the stranded people on the station grew restless and wanted to leave. She also felt some guilt as she and her husband had worked on the docking bay door installation. Hollow assured her that she wasn't responsible for the failure of the doors.\nThe Jedi aboard the station requested assistance from non-Force users to seal off parts of Starlight Beacon and Pikka volunteered. As Bell Zettifar explained the process, Adren sarcastically questioned if the padawan realized the assembled group were all experienced spacers. As the team worked to seal off the station, Zettifar came up with a plan to use ships already in the cargo bay to escape the failing station. Arden asked if people would be forced to leave or if they could stay behind with their ships in hopes of escaping later. While preparing the cargo bay for decompression, Adren and others investigated the ships. Several were listed as carrying rathtars and Adren said they could be ejected into space with no problems. The animals were accidentally released and one chased down Adren. She managed to kill it with her blaster with the assistance of Zettifar. She escaped the cargo hold and returned to her husband.\nHollow came up with a plan to salvage power cores from abandoned ships to power escape pods. Adren assisted her with wiring the power cores so they could launch the pods. When they were done, she tried to convince Hollow to abandon the station but she refused to leave her ship. Pikka and Joss boarded an escape pod and landed on Eiram. They later met up with the crew of the Vessel and agreed to help repair the ship in exchange for passage off Eiram.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Marriage",
  "/wiki/Joss_Adren",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Jedi_Order",
  "/wiki/Hetzal_system",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Pilot",
  "/wiki/Longbeam_cruiser",
  "/wiki/Aurora_III",
  "/wiki/Fruited_Moon",
  "/wiki/Hetzal_Prime",
  "/wiki/Hyperdrive",
  "/wiki/Skiff",
  "/wiki/Stellan_Gios",
  "/wiki/Nihil",
  "/wiki/Affie_Hollow",
  "/wiki/Geode",
  "/wiki/Koley_Linn",
  "/wiki/Vessel",
  "/wiki/Bell_Zettifar",
  "/wiki/Rathtar",
  "/wiki/Category:Images_of_Pikka_Adren",
  "/wiki/Star_Wars_Insider",
  "/wiki/Starlight:_Part_One:_Go_Together",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/Starlight:_Go_Together:_Part_Two",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/Soule_Man",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)"
 ]
}