{
 "name": "Pintu Son-El",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Moyn"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.88 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Pintu Son-El was a Moyn male who lived on Coruscant during the Clone Wars. He was a moneylender and would often use rough tactics to get his payments back.\nBy 19 BBY, Pintu had lent money to Rafa Martez. The young woman had failed to pay back the sum on time however, so Pintu took two of his henchmen and headed to the repair shop of her sister, Trace Martez. Pintu demanded to know where his money was when he entered the shop. The surprised Trace tried to make excuses. Pintu saw through her bluff and set his henchmen on her and a fight broke out. Trace was almost beaten senseless when Ahsoka Tano joined the fight and easily defeated the henchmen. Pintu was surprised and ran with his men out of the shop, while reminding Martez that her sister's debts were far from being paid. Rafa later paid off her debt to Son-El with credits she had gotten from the Twi'lek Lokann for building some binary loadlifter droids.\nPrior to the cancellation of Star Wars: The Clone Wars TV series, Pintu was to appear in an episode starring Ahsoka Tano. He was first revealed at the \"Ahsoka's Untold Tales\" panel at Celebration Europe in 2016, where a clip was shown where he confronted Nyx Okami for money that he had lent. The character's design was based on a piece of alien bounty hunter concept art drawn by Ralph McQuarrie for Star Wars: Episode V The Empire Strikes Back, which was realized in 2016 when Yushyn, who was of the same species, was introduced in the Star Wars Rebels episode \"The Call.\" Pintu later appeared in the 2020 episode \"Gone with a Trace,\" voiced by Bobby Moynihan, where the Martez sisters took Okami's place in the completed storyline.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Coruscant",
  "/wiki/Moyn",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Clone_Wars",
  "/wiki/Currency",
  "/wiki/19_BBY",
  "/wiki/Rafa_Martez",
  "/wiki/Time",
  "/wiki/Trace_Martez%27s_repair_shop",
  "/wiki/Trace_Martez",
  "/wiki/Ahsoka_Tano",
  "/wiki/Credit",
  "/wiki/Twi%27lek",
  "/wiki/Lokann",
  "/wiki/Binary_loadlifter",
  "/wiki/Droid",
  "/wiki/Celebration_Europe_(2016)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Nyx_Okami",
  "/wiki/Alien",
  "/wiki/Bounty_hunter",
  "/wiki/Ralph_McQuarrie",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/2016",
  "/wiki/Yushyn",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Call",
  "/wiki/2020",
  "/wiki/Gone_with_a_Trace",
  "/wiki/Bobby_Moynihan",
  "/wiki/Deal_No_Deal",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Order_66"
 ]
}