{
 "name": "Pippa_Rosheed",
 "display_name": "Pippa Rosheed",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.42 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fernandin Scouting Expedition",
      "Sperinad University"
     ]
    }
   ]
  }
 ],
 "content": "Pippa Rosheed was a Human female who worked as a doctor and a xenobiologist. She was a member of Lexi Fernandin's scouting expedition to Yavin 4 a couple of years after the Battle of Yavin.\nThe Human female Pippa Rosheed grew up with an interest in both exploration, and the study of other life forms. She attended university, and studied to become a xenobiologist, joining Fernandin Scouting Expedition after graduation. Rosheed began working for them in the early years of the Galactic Empire's reign, working for them for many years.\nRosheed participated in the exploration of dozens of star systems, until the Empire began to restrict non-military exploration. Accepting a teaching position at Sperinad University on the planet Esseles, she became a successful teacher and scholar although she missed field work. Rosheed maintained contact with Lexi Fernandin, head of Fernandin Scouting Company, and jumped at chance to get back into the field when the Empire awarded the company the rights to explore the Yavin system. She resigned her position at the university with immediate effect.\nPippa Rosheed was 1.42 meters tall, and although she looked aged, she had an ageless quality. She had a distant look to her eyes, giving the impression that she was looking past any individual she was talking to. Petite and nervous, Rosheed was constantly moving in a economical, alert fashion. A loner, she was shy and generally distrustful of strangers, although she had a hard, serious exterior and rarely showed emotion unless engaged in new biological or medical discoveries.\nRosheed was a skill biologist, doctor, and scholar, with knowledge in the practical application of first aid, and advanced medical knowledge. She was skilled in survival techniques, and was knowledgeable about alien species and computer programming and repair.\nDuring expeditions, Rosheed armed herself with a blaster pistol, and carried a backpack, a week's worth of ration packs, and a length of vine rope. She also carried a knife and comlink, as well as a medpac and an assortment of jungle herbs.\nPippa Rosheed was designed for inclusion in the first edition of Galaxy Guide 2: Yavin and Bespin, a supplement to Star Wars: The Roleplaying Game that was published by West End Games first in 1989 and then reprinted into a second edition in 1995.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Fernandin_Scouting_Expedition",
  "/wiki/Sperinad_University",
  "/wiki/Doctor/Legends",
  "/wiki/Xenobiologist/Legends",
  "/wiki/Lexi_Fernandin",
  "/wiki/Yavin_4/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Esseles/Legends",
  "/wiki/Yavin_system/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Backpack/Legends",
  "/wiki/Ration_pack/Legends",
  "/wiki/Rope/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Plant/Legends",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1989",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)",
  "/wiki/1995"
 ]
}