{
 "name": "Pir Cuvin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Qiilura"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Umbaran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Pir Cuvin was a male Umbaran who served the Confederacy of Independent Systems as one of the lieutenants of Ghez Hokan, a Mandalorian mercenary operating on the planet Qiilura. In 22 BBY, the lieutenant was with Hokan as they discovered the presence of clone commandos that were recently deployed to the planet. However, he later fell out of favor with Hokan after failing to acquire the results that the Mandalorian wanted. Cuvin later disappeared from his post, which Hokan presumed to be a desertion, but was captured and executed.\nA male Umbaran, Pir Cuvin served the Confederacy of Independent Systems as one of the lieutenants of Ghez Hokan, a Mandalorian mercenary operating on the planet Qiilura. The lieutenant was with Hokan when they investigated a battle droid contingent that had been destroyed by clone commandos. Cuvin did not find any traces of a camp that could have been used by the commandos, which annoyed Hokan. He was also present when the Mandalorian decided to move the Separatist scientist operating on Qiilura and her team from their lab to a different location, due to the presence of Republic commandos.\nHowever, later on, while burning some farm fields to give the commandos an incorrect view of their intentions, Hokan became annoyed when Cuvin did not see the true purpose of their actions. The Mandalorian told Second Lieutenant Hurati, another Umbaran officer, to keep an eye on Cuvin. As a result, the lieutenant \"didn't make captain\" and at some point after the field burning he disappeared from his post, which was presumed by Hokan to be a desertion. The Mandalorian ordered his troops to kill Cuvin on sight; when the Umbaran was found, he was quickly executed. Hurati was promoted to take his place.\nHis Mandalorian superior did not trust him fully, viewing Cuvin to not be as competent as Hurati, to the point that he asked the other Umbaran to keep an eye on the lieutenant. The man also believed that Pir Cuvin and Hurati were both \"academy theoreticians.\" Cuvin was nervous about disappointing his superior when they were examining some battle droids destroyed by clone commandos and continued to look around the area after reporting to Hokan. He ended up deserting, but was later caught and executed on Hokan's orders.\nPir Cuvin first appeared in the 2004 novel Republic Commando: Hard Contact and was later given a mention in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Qiilura",
  "/wiki/Umbaran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Ghez_Hokan",
  "/wiki/Mandalorian/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Second_Lieutenant/Legends",
  "/wiki/Hurati",
  "/wiki/Death/Legends",
  "/wiki/Republic_Commando:_Hard_Contact",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}