{
 "name": "Piter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY Trenchenovu shipyards"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Nath Tensent's squadron",
      "Nath Tensent's squadron",
      "Alliance to Restore the Republic",
      "Nath Tensent's squadron",
      "Nath Tensent's squadron"
     ]
    }
   ]
  }
 ],
 "content": "Piter was a human male TIE fighter pilot in a squadron led by fellow pilot Nath Tensent as a part of the Galactic Empire. Piter's squadron ran a criminal enterprise in the Outer Rim, but when the Empire discovered what they were doing, they all defected to the Rebel Alliance in 0 BBY. After flying over fifty missions for the Alliance in a BTL-A4 Y-wing assault starfighter/bomber, Piter and his squadron attacked the Trenchenovu shipyards. However, Piter was killed when the 204th Imperial Fighter Wing ambushed the squadron. Only Tensent survived the battle.\nDuring the Imperial Era, Piter served as the TIE fighter pilot in the Galactic Empire under a Colonel in the Western Reaches. He was part of a squadron led by the pilot Nath Tensent, which ran its own criminal enterprise through eight star systems in the Outer Rim. The squadron took a percentage from pirates and smugglers to look the other way on top of charging companies for protection from the same threats. When the Empire caught on and put the squadron under investigation, the entirety of Piter's squadron defected to the Rebel Alliance in 0 BBY.\nFlying a BTL-A4 Y-wing assault starfighter/bomber, Piter and his squadron served the Alliance in over fifty operations. Tensent protected the pilot and taught him everything he knew. Between the years 3 ABY and 4 ABY, Piter's squadron attacked the Trenchenovu shipyards. Having prepared and trained for the mission over six weeks, the squadron flew towards the shipyards for a bombing run. However, just seconds Piter could released his payload, he was ambushed and killed by a squadron of TIEs from the Empire's 204th Imperial Fighter Wing.\nUpon Piter's death, the rest of the squadron aborted the mission, but only Tensent was able to flee the shipyards alive. Around seven months later, Tensent told the story of his squadron's destruction, including Piter's death, to Lieutenant Yrica Quell, and later to the rest of the members of the New Republic's Alphabet Squadron, which Tensent became a member of that year. He also thought of the late pilot on numerous occasions.\nPiter was a human male. He was known to whine childishly but was nevertheless trustworthy for Nath Tensent and fought hard when he was cornered. Piter had a scared impression on Tensent.\nPiter flew a TIE line starfighter during his service in the Galactic Empire but later flew a BTL-A4 Y-wing assault starfighter/bomber after defecting to the Rebel Alliance.\nPiter was first mentioned in the 2019 novel Alphabet Squadron, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Victory%27s_Price",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Trenchenovu_shipyards",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Nath_Tensent%27s_squadron",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Squadron",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Pilot",
  "/wiki/Nath_Tensent",
  "/wiki/Outer_Rim_Territories",
  "/wiki/0_BBY",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Battle_at_Trenchenovu",
  "/wiki/Death",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Imperial_Era",
  "/wiki/Colonel",
  "/wiki/Western_Reaches",
  "/wiki/Star_system",
  "/wiki/Pirate",
  "/wiki/Smuggler",
  "/wiki/Standard_year",
  "/wiki/Standard_week",
  "/wiki/Shipyard",
  "/wiki/Standard_month",
  "/wiki/Lieutenant",
  "/wiki/Yrica_Quell",
  "/wiki/New_Republic",
  "/wiki/Alphabet_Squadron",
  "/wiki/TIE_line",
  "/wiki/Starfighter",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}