{
 "name": "Pix",
 "display_name": "Pix",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tyr"
     ]
    }
   ]
  }
 ],
 "content": "Pix, a Force-sensitive Human female, was a Padawan who served the Jedi Order during the last years of the Galactic Republic. Pix and her fellow Jedi were commissioned as officers in the Grand Army of the Republic as a result of the Clone Wars—a pan-galactic civil war between the Republic and the Confederacy of Independent Systems. Promoted to the rank of Jedi Commander, Pix served alongside her master, Jedi General Tyr, until he was killed by a suicide bomber on the Sephi homeworld of Thustra. As the situation grew dire, Grand Master Yoda attempted to end the conflict through diplomacy, leaving Pix in command of the clone army while he negotiated with King Alaric in person.\nDespite the parlay between their leaders, the Sephi forces gathered just beyond the range of the Republic command center's defenses, leading Clone Commander \"Clutch\" to believe that they were preparing to launch another attack. The clone advised Pix to strike first, but the Padawan was under strict orders from Yoda to not engage the Sephi in his absence. Later on, she was led to believe that Alaric betrayed the truce by having Yoda executed. Deceived by Senator Navi, the galactic representative of Thustra, Commander Pix led her clone troopers into battle, attempting to overtake the enemy and capture Alaric's palace before the Sephi could counterattack the Republic Military.\nThe Battle of Thustra ultimately galvanized sympathy for the Sephi, fully integrating Thustra and its allies into the Separatist cause despite the Republic's efforts to keep them in line. In the aftermath of the battle, Pix and Yoda returned to Republic capital of Coruscant where they revealed Navi's deception to the Galactic Senate, resulting in the senator's arrest on the charges of conspiracy and treason.\nPix was a member of the Jedi Order taken on by Jedi Master Tyr as his Padawan learner during the final years of the Galactic Republic. Like the other Jedi apprentices, she was granted the rank of Jedi Commander in the Grand Army of the Republic as the galaxy became engulfed by the Clone Wars. In 22 BBY she accompanied her master to the planet Thustra, at the head of an army of clone troopers, to present a small show of force against the Sephi who were on the verge of seceding from the Republic.\nWithin ten hours of the Republic's arrival, the Sephi attacked the offworlders using suicide tactics to inflict heavy losses on the Republic. A suicide bomber succeeded in killing the Jedi generals Tyr and Tyffix, although Pix's life was saved by her master seconds before the enemy starfighter crashed into the Republic command center. Having lost two generals and a portion of their troops, Pix sent a transmission to the Republic capital of Coruscant requesting the Jedi High Council to send reinforcements. At the time she and her fellow Padawan, Commander Cal, were expecting an army led by either Mace Windu or Oppo Rancisis to come to their aid. To their surprise, however, it was Grand Master Yoda who came to Thustra. The ancient Jedi Master did not bring additional troopers as Pix requested; Yoda had hoped that he would be able to negotiate an end to hostilities with King Alaric, the sovereign ruler of Thustra. As such, he journeyed to the capital city with Cal at his side, leaving Pix and Clone Commander \"Clutch\" in charge of the remaining clone troopers.\nAs Pix and Clutch awaited Yoda's return, the two officers noticed a force of Sephi soldiers amassing near the Republic army's position. The clone advised his Jedi commander to attack the Sephi first, having deemed this course of action as the most strategically sound option given the circumstances. Pix balked at Clutch's suggestion as it contradicted the direct orders of their Jedi general. Clutch stood by his recommendation, believing that Yoda's strategy conflicted with their ability to defend themselves. Nevertheless, they refrained from attacking the Sephi until Senator Navi—the galactic representative of Thustra—arrived at the Republic's new command center. Hoping to prevent his homeworld from seceding from the Republic, Navi deceived Pix into believing that Yoda and Cal had been lured to Alaric's palace and executed on the king's orders. As a result, Clutch believed that open war had become inevitable but could not give the order to attack without Pix's approval, given that she was the highest-ranking officer in Yoda's absence. He recommended requesting another general from Coruscant, but Pix silenced him by ordering the clone troopers to attack the Sephi.\nPix and Clutch led the Republic attack from a Low Altitude Assault Transport/infantry gunship. Their preemptive strike succeeded in catching the Sephi unprepared; Commander Dekluun was among the casualties sustained by the Sephi army. As the Republic achieved air supremacy with the use of their gunships, the clone infantry moved forward to control the field with the support of AT-TE and SPHA walkers. Pix and Clutch fought alongside each other on the front lines while simultaneously relaying orders to the clone troopers, commanding them to eliminate the enemy's tanks and speeders as they advanced on the capital. As the fighting continued, Pix had a bad feeling about both the battle and the senator. In the aftermath, Pix and Clutch returned to Coruscant with Yoda, who was revealed to be alive and well despite Senator Navi's claims. Entering the Grand Convocation Chamber of the Senate Building, they accused Navi of treason before the entire Galactic Senate. Pix witnessed the politician's fall from grace while standing at Mace Windu's side, watching as Clutch personally arrested Navi with the help two Senate Guards.\nPix was a light-skinned, brown-eyed Human female, with long black hair that she braided into a ponytail. She was loyal to both the Jedi Order and the Galactic Republic, fighting for both institutions against rebellious worlds that supported the secessionist cause of the Confederacy of Independent Systems. She was also loyal to her master, General Tyr, who taught her the ways of the Force prior to the battle of Thustra.\nAfter witnessing the death of her mentor via a suicide attack, Pix mourned Tyr's death and attempted to comfort Cal, a fellow Padawan whose own master, Tyffix, also perished. She then took the initiative to report the situation on Thustra to Coruscant, but was reprimanded by Yoda for not informing him directly. Unlike Cal, who openly questioned Yoda's decision to use diplomacy instead of force, Pix attempted to follow the Grand Master's plan and initially resisted Commander Clutch's proposition to launch a preemptive strike against the Sephi. The thought of Yoda and Cal dying in a trap set by King Alaric left Pix feeling distressed and more open to the option of taking military action against the Sephi, as proposed by Senator Navi and Commander Clutch. During the attack, Pix embraced her role as a tactician and battlefield commander. As such, she issued orders to her clone troopers and, at the same time, fought alongside them. However, she soon expressed doubt in both the battle and Navi, who claimed that the king executed Yoda, as her army drew closer to the palace.\nAt the time of the Clone Wars, Pix wielded a blue-bladed lightsaber but did not wear the traditional robes of the Jedi Order. Instead, her attire consisted of a tight, short-sleeved blue top and a short, beige skirt. She also occasionally wore a light-colored Jedi cloak.\nPix was a Force-sensitive individual, and therefore, trained in the Jedi arts. Her skills extended to the use Force techniques and lightsaber combat, making her capable of deflecting blaster fire with a lightsaber.\nPix first appeared in Jedi: Yoda, a Dark Horse comic written by Jeremy Barlow and released in 2004. In the comic, she was drawn by the American illustrator HOON. Pix was depicted in a concept art image, seen on HOON's website, where she is wearing a different attire and wields a sword-like weapon and standing next to a Sith Lord named Darth Homiiz. In 2008, Pix received an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Tyr",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Death/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Bomber/Legends",
  "/wiki/Sephi/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Thustra/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Army/Legends",
  "/wiki/King/Legends",
  "/wiki/Alaric_(Sephi)",
  "/wiki/Thustra_Republic_command_center",
  "/wiki/Clone_trooper_commander",
  "/wiki/TK-571",
  "/wiki/Senator/Legends",
  "/wiki/Navi",
  "/wiki/Galaxy/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Alaric%27s_palace",
  "/wiki/Republic_Military/Legends",
  "/wiki/Battle_of_Thustra",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Treason/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Planet",
  "/wiki/Thustra",
  "/wiki/Standard_hour/Legends",
  "/wiki/Tyffix",
  "/wiki/Standard_second",
  "/wiki/Starfighter/Legends",
  "/wiki/General/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Time/Legends",
  "/wiki/Cal_(Jedi)",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Oppo_Rancisis/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Monarchy/Legends",
  "/wiki/City/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Advisor/Legends",
  "/wiki/Second_Republic_command_center",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Dekluun",
  "/wiki/Infantry/Legends",
  "/wiki/All_Terrain_Tactical_Enforcer/Legends",
  "/wiki/Self-Propelled_Heavy_Artillery",
  "/wiki/Walker/Legends",
  "/wiki/Tank_(vehicle)/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Grand_Convocation_Chamber",
  "/wiki/Senate_Building",
  "/wiki/Politics/Legends",
  "/wiki/Senate_Guard/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Robe/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Cloak/Legends",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_training/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Fire/Legends",
  "/wiki/Jedi:_Yoda",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Jeremy_Barlow",
  "/wiki/2004",
  "/wiki/HOON",
  "/wiki/Sword/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Homiiz",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Category:Images_of_Pix",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Rattatak/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Standard_month/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/August_13",
  "/wiki/2007"
 ]
}