{
 "name": "Plat Mallar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Polneye"
     ]
    },
    {
     "name": "Died",
     "values": [
      "17 ABY",
      "over N'zoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Grannan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Polneye",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Plat Mallar was a Grannan from the Imperial colony world of Polneye in the Koornacht Cluster, and a member of that world's defense force, piloting several varieties of TIE fighters. He was the only son of Plat Hovath and Fall Topas.\nWhen the Yevetha attacked during the Great Purge, Plat Mallar was the only sentient in the entire Purge to kill a Yevetha and the sole survivor from Polneye, due to piloting his TIE Interceptor out into space in hopes of alerting someone to the situation. Days later, near death, he was found by New Republic forces, and the \"Plat Mallar tapes\" he had recorded in his cockpit would eventually become critical in swaying public opinion in the New Republic towards supporting retribution against the Yevetha.\nPlat Mallar was taken under Ackbar's wing, and thanks to his experience in a TIE—and the Admiral's influence—he quickly joined the New Republic armed forces, though as a ferry pilot only. He was part of the mission during which Commodore Han Solo was captured by the Duskhan League, and was flying one of the X-wing starfighters that came under an ion cannon barrage, but even then he tried with all his might to restart his fighter.\nDuring the final battle against the Yevetha, Plat Mallar was stationed aboard cruiser Mandjur. Mallar flew his shuttle on three rescue trip to save pilots; recovering a live one and two dead ones. Afterward Mallar boarded the X-wing of his commanding officer, Captain Tegett  and joined the battle, eventually sacrificing his life ramming a Yevethan ship which was intending to ram Mandjur. His final act saved hundreds of lives, just as his desperate flight from Polneye guaranteed other worlds near Koornacht would not have to fear a second Great Purge.\nWhen he joined the armed forces, Chief of State Leia Organa Solo admitted Polneye into the New Republic. As sole survivor, Plat Mallar was senator de facto and could have sat if he wished; however he chose to seek vengeance against the Yevetha. Organa Solo then decided to leave Polneye's seat open as a reminder of the Yevethan atrocities.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Polneye",
  "/wiki/17_ABY/Legends",
  "/wiki/N%27zoth",
  "/wiki/Grannan",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Koornacht_Cluster/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Plat_Hovath",
  "/wiki/Fall_Topas",
  "/wiki/Yevetha",
  "/wiki/Yevethan_Purge",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Duskhan_League",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Battle_of_N%27zoth",
  "/wiki/Mandjur",
  "/wiki/G-021",
  "/wiki/Tegett",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Before_the_Storm",
  "/wiki/Shield_of_Lies",
  "/wiki/Tyrant%27s_Test",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Senator/Legends",
  "/wiki/16_ABY/Legends"
 ]
}