{
 "name": "Platt Okeefe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Brentaal IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Platt Okeefe, nicknamed Oakie, was a human female who escaped slavery and became a famous smuggler, freedom fighter, and entrepreneur. Born on Brentaal IV, she lived during the reign of the Galactic Empire. Okeefe once came in possession of the Smuggler's Guide.\nPlatt Okeefe was a human female from the Core Worlds planet Brentaal IV, who escaped slavery and became a famous smuggler, freedom fighter, and entrepreneur. After she lost multiple ships due to her profession, such as the one she crashed on Tatooine while escaping from bounty hunters, Platt Okeefee purchased a YT-1300 light freighter. She heavily modified it and called it Last Chance. She owned a droid mechanic and Ghtroc 720 was her sentimental fave.\nOkeefe once came in possession of the Smuggler's Guide and listed the best things to smuggle, reliable haulers, list of shadowports and list of potential clients that hired freelance smugglers. She was also musing about the possibility of writing her own guide, that she'd only share with people who knew their stuff, granting basic access to those who completed five Sisar Runs with advanced access requiring three Kessel Runs.\nAurodium from Brentaal Trading Houses, greel wood from Pii system and oro-weave from Chandrila, and other cargoes like meleenium, durelium, hyperbarides, Corusca stones, beskar, quella gems and prismatic crystals. With spice, she recommended to stick with variants like andris, carsunum, and sansanna and warned against trafficking variants such as ryll or the strains of spice mined on Kessel.\nGhtroc 720, her sentimental fave, Lantillian ShipWrights GX1 short hauler, the spacer's \"old reliable,\" Surronian L19 heavy freighter, that pilots should never buy a new unless they had a good mechanic, and YT-2400 light freighter, that could be stolen if they can slip past void-droids in the Zero Drift. She suggested to skip Gymsnor, TL-1200 transport, or anything from Balmorran Heavyworks.\nJunkfort Station, Port Bianco, Byblos, Dandrian Ring, Gelgelar Free Port, Resh 9376 and Tanquilla Beach, but excluding Omze's Incredible Traveling Starport, especially if one was human. She also recommended to visit Batuu, despite not being a shadowport.\nGlasfir Ring, Klatooinian Trade Guild, Mandroxan Cartel, Ororo Transportation, Kheedar Ring, Droid Gotra, Lantillian Spacers' Brotherhood.\nAfter being hired to deliver a shipment of Jovaninan gorefruit to a drop-point agent on Panna's Redwater moon, Platt noted in the Smuggler's Guide logbook that she felt good about the job because she had wished to revisit a chance parlor in the Offworlders' Block.\nLater, she lost the guide, her Herglic chronometer and 603 credits to Lando Calrissian in a pazaak game because of her weakness to Novanian grog. As Lando made off with the logbook, Okeefe shouted at him, accusing him of using dishonest measures to acquire his winnings. The two later made amends at the Far Orbit bathhouses. After recovering from an injury inflicted on her by an Imperial officer, she published her own guide, known as Smuggler's Handbook, inspired by the Maz Kanata's Smuggler's Guide.\nPlatt Okeefe had light skin and blue eyes. She became a famous smuggler, freedom fighter, and entrepreneur. Platt jokingly called herself \"smuggler extraordinaire\" during her youth. She had a concern for her fellow smugglers, and was willing to share secrets of the smuggling trade both in the Maz Kanata's Smuggler's Guide, and in her own Smuggler's Handbook. However, she would only share it with people who knew their stuff.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Platt_Okeefe",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Brentaal_IV",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sana_Starros",
  "/wiki/Slavery",
  "/wiki/Smuggler",
  "/wiki/Reproduction",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Platt_Okeefe",
  "/wiki/Core_Worlds",
  "/wiki/Planet",
  "/wiki/Unidentified_ship_(Platt_Okeefe)",
  "/wiki/Tatooine",
  "/wiki/Bounty_hunter",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Last_Chance_(YT-1300_light_freighter)",
  "/wiki/Unidentified_droid_mechanic",
  "/wiki/720_light_freighter",
  "/wiki/Sisar_Run",
  "/wiki/Kessel_Run",
  "/wiki/Aurodium",
  "/wiki/Brentaal_Trading_Houses",
  "/wiki/Greel-wood",
  "/wiki/Pii_system",
  "/wiki/Oro-weave",
  "/wiki/Chandrila",
  "/wiki/Meleenium",
  "/wiki/Durelium",
  "/wiki/Hyperbaride",
  "/wiki/Corusca_gem",
  "/wiki/Beskar",
  "/wiki/Spice",
  "/wiki/Andris",
  "/wiki/Carsunum",
  "/wiki/Sansanna_spice",
  "/wiki/Ryll",
  "/wiki/Kessel_spice",
  "/wiki/Kessel",
  "/wiki/Lantillian_ShipWrights",
  "/wiki/GX1_short_hauler",
  "/wiki/Surronian_L19_heavy_freighter",
  "/wiki/Pilot",
  "/wiki/Technician",
  "/wiki/YT-2400_light_freighter",
  "/wiki/Void-droid",
  "/wiki/Zero_Drift",
  "/wiki/TL-1200_transport",
  "/wiki/Balmorran_Heavyworks",
  "/wiki/Junkfort_Station",
  "/wiki/Port_Bianco",
  "/wiki/Byblos",
  "/wiki/Dandrian_Ring",
  "/wiki/Gelgelar_Free_Port",
  "/wiki/Resh_9376",
  "/wiki/Tanquilla_Beach",
  "/wiki/Omze%27s_Incredible_Traveling_Starport",
  "/wiki/Batuu",
  "/wiki/Glasfir_Ring",
  "/wiki/Klatooinian_Trade_Guild",
  "/wiki/Mandroxan_Cartel",
  "/wiki/Ororo_Transportation",
  "/wiki/Kheedar_Ring",
  "/wiki/Droid_Gotra",
  "/wiki/Lantillian_Spacers%27_Brotherhood",
  "/wiki/Panna",
  "/wiki/Panna%27s_Redwater_moon",
  "/wiki/Offworlders%27_Block",
  "/wiki/Credit",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Pazaak",
  "/wiki/Novanian_grog",
  "/wiki/Far_Orbit_bathhouses",
  "/wiki/Imperial_officer",
  "/wiki/Smuggler%27s_Handbook",
  "/wiki/Maz_Kanata",
  "/wiki/Eye",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_66",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Category:Images_of_Platt_Okeefe",
  "/wiki/Tarkin_(novel)"
 ]
}