{
 "name": "Plesko_Marno",
 "display_name": "Plesko Marno",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ozrelanso"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Bureau of Ships and Services",
      "Bureau of Ships and Services"
     ]
    }
   ]
  }
 ],
 "content": "Plesko Marno was an Ozrelanso male who was a clerk at the Bureau of Ships and Services for the New Republic. Following the Hosnian Cataclysm, Marno escaped with a collection of navigational data that he had stolen during his years working for the agency. He began working as a navigator, using the stolen data to cut down on travel times, and in 35 ABY was in the Spice Runners' Den on the planet Kijimi shortly before the world's destruction.\nPlesko Marno was an Ozrelanso male who worked for the New Republic's Bureau of Ships and Services as a clerk. When the New Republic Senate and fleet were destroyed in the Hosnian Cataclysm in 34 ABY, Marno fled the destruction with a collection of navigational data he had stolen over the years.\nThe data contained insider information including shortcuts and prefered routes that had ordinarily been kept exclusively for government or corporate transport use. Keeping the data with him, Marno began working as a navigator for hire who could reliably cut down on travel times.\nIn 35 ABY, Marno was an inhabitant of Kijimi City on the planet Kijimi while the world was occupied by the First Order. He spent time in the Spice Runners' Den, and was stood against the building's bar when the Spice Runner Zorii Bliss led a group of Resistance agents through the room. Marno turned and watched the Resistance members Finn and C-3PO as they passed. Shortly after the encounter, the First Order pulled its forces from Kijimi and destroyed the planet.\nPlesko Marno had brown skin and eyes.\nMarno wore a red armored blast vest over a red and gray robe with jakobeast-fur sleeves. The vest had a data \"cold box\" ring module on the back in which he kept his stolen navigational data.\nPlesko Marno was created for the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was identified simultaneously in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo, and a card in the 2019 Topps Star Wars: The Rise of Skywalker Series 1 trading card set by The Topps Company, Inc.. Concept art of a less heavily armored Marno titled \"Wizard 37\" was drawn for the film by creature concept designer and senior sculptor Martin Rezard.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ozrelanso",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/Bureau_of_Ships_and_Services",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Standard_year",
  "/wiki/Navigator",
  "/wiki/35_ABY",
  "/wiki/Spice_Runners%27_Den",
  "/wiki/Planet",
  "/wiki/Kijimi",
  "/wiki/Destruction_of_Kijimi",
  "/wiki/New_Republic_Senate",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/34_ABY",
  "/wiki/Transport",
  "/wiki/Kijimi_City",
  "/wiki/First_Order",
  "/wiki/Time",
  "/wiki/Spice_Runners_of_Kijimi",
  "/wiki/Zorii_Bliss",
  "/wiki/Mission_to_Kijimi",
  "/wiki/Resistance",
  "/wiki/Finn",
  "/wiki/C-3PO",
  "/wiki/Protocol_13",
  "/wiki/Eye",
  "/wiki/Armor",
  "/wiki/Clothing",
  "/wiki/Jakobeast",
  "/wiki/Hair",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2019_Topps_Star_Wars:_The_Rise_of_Skywalker_Series_1",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Martin_Rezard",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Insider",
  "/wiki/Neal_Scanlan:_A_Force_Reawakended",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY"
 ]
}