{
 "name": "Plif",
 "display_name": "Plif",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arbra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hoojib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    }
   ]
  }
 ],
 "content": "Plif was a Hoojib male from Arbra who was a spokesperson for his species. The criminal Bralem Mopak captured many of the Hoojibs on Arbra, posing as a trader that sold the beings. In reality, Mopak was sending Hoojibs, including Plif, to other criminal elements, forcing them to act as spies and send intelligence back to him on Arbra.\nWhen the smugglers Han Solo and Chewbacca visited Arbra to collect a Hoojib for the menagerie of the crime lord Jabba the Hutt, Mopak gave them a caged Plif, who the smugglers took back to Jabba's Palace on Tatooine. Though Jabba rejected the supposed animal, Plif sent information on a deal the Hutt was set to make with the trader Zikk Keradd, who Mopak subsequently made contact with and convinced to ally with himself instead of Jabba. After Jabba imprisoned Solo and Chewbacca, believing they were responsible for the deal with Keradd falling through, Plif freed them and informed the two of the situation on Arbra. Solo and Chewbacca returned Plif to Arbra to mount a rescue, though Solo let himself and Chewbacca get caught so that Plif would rally his fellow Hoojibs to escape and overthrow Mopak. The Hoojibs were successful, and Plif remained behind on Arbra.\nIn the new Star Wars canon, Plif first appeared in \"The Hoojib Menace,\" a comic story written by Cavan Scott, illustrated by Arianna Florean, and published in Star Wars Adventures Annual 2021 by IDW Publishing on November 24, 2021. Plif was formerly introduced in the Star Wars Legends continuity in the 1981 fifty-fifth issue of Marvel Comics' Star Wars comic series, written by David Michelinie, penciled by Walt Simonson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Plif",
  "/wiki/Plif/Legends",
  "/wiki/Arbra",
  "/wiki/Hoojib",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Species",
  "/wiki/Bralem_Mopak",
  "/wiki/Merchant",
  "/wiki/Spy",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Tatooine",
  "/wiki/Hutt",
  "/wiki/Zikk_Keradd",
  "/wiki/Prison",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Plif",
  "/wiki/Star_Wars",
  "/wiki/The_Hoojib_Menace",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Cavan_Scott",
  "/wiki/Arianna_Florean",
  "/wiki/Star_Wars_Adventures_Annual_2021",
  "/wiki/IDW_Publishing",
  "/wiki/November_24",
  "/wiki/2021",
  "/wiki/Star_Wars_Legends",
  "/wiki/1981",
  "/wiki/Star_Wars_(1977)_55",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/David_Michelinie",
  "/wiki/Walter_Simonson",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Category:Images_of_Plif"
 ]
}