{
 "name": "Plun_Kil",
 "display_name": "Plun Kil",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Besalisk"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Beige"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Plun Kil was a Besalisk who lived during the reign of the Galactic Republic. Kil became a Jedi Master by the time of the Clone Wars and served as general of the Republic as the Jedi Order fought against the Confederacy of Independent Systems. The Jedi Master had black hair, yellow eyes and beige skin. On at least one occasion, Kil wore a tan shirt and brown pants held up by a belt, and possessed brown sandals. The Jedi Master also carried four lightsabers on occasion, three with blue blades and one with a green blade.\nPlun Kil was a character that was originally designed to appear in the second season of the canon animated series Star Wars: The Clone Wars. Concept art for the Besalisk Jedi Master was drawn by Kilian Plunkett during the production of the second season of the TV series. However, Kil never actually made it in to any episodes of the TV series. A Besalisk Jedi Master eventually debuted in the series in the form of Pong Krell, who appeared in the fourth season of The Clone Wars as an antagonist for the Umbara Arc.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Besalisk",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_General",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Jedi",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Lightsaber",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Kilian_Plunkett",
  "/wiki/Pong_Krell",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/StarWars.com"
 ]
}