{
 "name": "Po Bandis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Po Bandis was a male Jedi Master who, in addition to being a member of the Jedi Order, served as a General of the 313th Legion during the Clone Wars, a galaxy-spanning conflict between the Galactic Republic and the Confederacy of Independent Systems.\nPo Bandis was a Force-sensitive Zabrak male who was trained in the ways of the Force by the Jedi Order. After years of study and work with the Jedi High Council, Bandis would pass the Trials of Knighthood to reach the rank of Jedi Knight and finally made a Jedi Master.\nWhen the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Master Bandis dutifully took up the rank of General within the Grand Army of the Republic. Leading clone troopers against the Separatist Droid Army, Bandis was placed in command of the 313th Legion and tasked with locating a Separatist base located on Ando Prime. Discovering a massive droid production facility, Bandis led his troops to destroy it but were intercepted by General Terrus and his droid army. As they did battle, the Skakoan engineer Vylagos activated his experimental hyperspace wormhole transporter, which transported Bandis and his men off-planet to an unknown location in the Outer Rim Territories.\nDetecting Bandis's disappearance, the High Council dispatched Jedi Master Obi-Wan Kenobi to locate the Jedi and his clones. Leading Commander Vargus and Excelsior Company to Ando Prime, the Jedi encounter a medic, Gen-Goma, who helped them extract information from Vylagos about the experimental machine. Reactivating the machine, the Skakoan brought back Bandis and his troops, who then aided in shutting down the Separatist base.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/313th_Legion",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Ando_Prime/Legends",
  "/wiki/General/Legends",
  "/wiki/Terrus",
  "/wiki/Skakoan/Legends",
  "/wiki/Vylagos",
  "/wiki/Hyperspace_wormhole",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Vargus",
  "/wiki/Excelsior_Company",
  "/wiki/Gen-Goma/Legends",
  "/wiki/The_Clone_Wars:_Decide_Your_Destiny:_The_Lost_Legion"
 ]
}