{
 "name": "Poggle the Lesser",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Geonosis"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Geonosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "80 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Stalgasin hive",
      "Techno Union",
      "Confederacy of Independent Systems",
      "Executive Separatist Council",
      "Executive Separatist Council",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Archduke Poggle the Lesser was the public leader of the Geonosians during the Clone Wars. Though subservient to Queen Karina the Great, he was nominally in control of the Stalgasin hive, and with his oversight of the Geonosian Baktoid battle droid factories, became a powerful figure within the Confederacy of Independent Systems. The Archduke was a warlord, and commanded the droid armies that fought against the Republic during the first and second battles of Geonosis, the latter of which he was captured and brought into Republic custody. Incarcerated for two years on Coruscant, he was later recruited by the Republic Special Weapons Group to assist in the construction of the Ultimate Weapon battle station the Geonosians designed; however, later absconded to Confederate space after sabotaging the project. During the final stages of the war, he and the rest of the Separatist Council were relocated to Utapau and later on Mustafar, where he was killed by Darth Vader.\nOnce a member of the drone caste, Poggle the Lesser, with strategic aid from the manipulative Sith Lord Darth Sidious, rose to the position of Archduke of Geonosis, the public position of leadership that secretly answered to a Geonosian queen. Poggle also became controller of the large Geonosian droid factories on the planet. At some point after he became archduke, he also killed the current leader of the Geonosians, Hadiss the Vaulted, ensuring his control over Geonosis.\nDuring the Separatist Crisis, Poggle was one of the first and one of the most ardent supporters of its cause. He hosted a meeting of fellow Separatist conspirators on Geonosis. Poggle pledged the armies of his people to the former Jedi, Count Dooku, who had personally ensured the droid building contract between the Geonosians and Baktoid Armor Workshop continued on. Poggle profited greatly from the arrangement, and, thanks to Dooku, rose to a position of power like that of no other Geonosian ruler before him. Despite his prominence, Sidious and Dooku viewed Poggle as highly expendable.\nIn addition to dealings with the Separatists, Poggle continued to operate as an extension of Karina the Great's rule over the Stalgasin hive, the most dominant hive on Geonosis. He would receive instructions from her on how to run the hive. At some point, Poggle joined forces with San Hill, the Chairman of the InterGalactic Banking Clan, and Dooku to assassinate their volatile ally, the Kaleesh warlord General Grievous, who was then rebuilt as a super-cyborg of servitude by Separatist cybernetic specialists and Geonosian biotechnicians under the direction of Count Dooku.\nPoggle, Dooku, and the rest of their Separatist conspirators then went to the Petranaki Arena to watch the executions of Senator Padmé Amidala, Jedi Master Obi-Wan Kenobi, and Padawan Anakin Skywalker. However, Jedi Master Mace Windu and a team of 212 Jedi arrived to rescue Kenobi, Skywalker, and Amidala. As the battle droids overwhelmed the Jedi, they were then rescued by clone troopers under Grand Master Yoda. Poggle and the rest of the separatist conspirators then went to the underground Geonosian Command Center to oversee the battle. As the Republic Army forced their Droid Army to retreat, Poggle ordered his warriors to hide in the catacombs. He then gave Dooku the plans for their ultimate weapon, who assured that they would be safe with his Master, Darth Sidious.\nPoggle, along with Trade Federation Senator Lott Dod, conspired with Scipio Senator Baron Rush Clovis to rebuild the primary droid foundry on Geonosis. When Clovis arrived on Cato Neimoidia at Dod's palace, Poggle and Dod demanded a greater share of the profits the foundry would produce. When Clovis refused to change the terms, Poggle agreed with Dod's plan to poison his companion, Padmé Amidala. However, Clovis helped Amidala's guard who was really Anakin Skywalker in disguise, get the antidote for her. Poggle and Dod then confronted Clovis about the missing holodisc.\nPoggle later returned to Geonosis and served as the Overseer of the new Geonosis primary droid foundry. However, the war would soon return to the Geonosian homeworld. When the Galactic Republic invaded the planet, Poggle led both the droid army and the native Geonosians against the Republic. As the Republic forces approached his foundry, Poggle and his T-series tactical droid, TX-21 oversaw the construction of super tanks. They then deployed the ten garrisons of droids against the clone troopers serving under Jedi Generals Anakin Skywalker and Luminara Unduli. He and TX-21 then sent in the super tanks which were able to push the clones back. Poggle was then informed that two Jedi had infiltrated the reactor room. Poggle and TX-21 then went with a pair of his soldiers and one of his super tanks. There, he ordered his soldiers to take the bombs and kill the Jedi.\nAfter the foundry's destruction, Poggle took an AAT with several of his droids and soldiers with him to the Progate Temple. Along the way, Poggle dropped crates, leaving a trail for Unduli and clone trooper Buzz to follow. When Unduli and the trooper entered the temple, Poggle and several un-dead Geonosians killed Buzz and captured Unduli. He then took her into the catacombs of the temple and brought her before his queen, Karina the Great, as a gift. Together, they hoped they could use the brain worms to control Unduli. However, Poggle and Karina were then found by Kenobi and Skywalker. As they blinded the queen, Poggle was captured by Skywalker and Unduli. He was taken aboard the Venator-class Star Destroyer Resolute.\nOn board the Resolute, Poggle was interrogated by Kenobi, Ki-Adi-Mundi, and Unduli, but refused to answer their questions. When the worms were aboard his Padawan's supply ship, Skywalker interrogated Poggle alone. At first, Poggle refused but was then punched and Force-choked by the Jedi. He then revealed the worms' weakness to the cold. Poggle was then transported to Coruscant, where he was imprisoned in a cell at the Republic Center for Military Operations.\nDuring his time in prison, Poggle was subjected to routine interrogation by agents of Republic Intelligence. One of the main topics, even though information on it was removed by Poggle from the Stalgasin war room, of the interrogations was the supposed deep-space mobile battle station project, the \"Ultimate Weapon\" designed by the Stalgasin hive, that was thought to be under construction by the Confederacy. However, the Archduke repeatedly denied any Geonosian association, and feigned ignorance to the existence of the plans, which were actually in the possession of the Republic Special Weapons Group.\nPoggle was later approached by Lieutenant Commander Orson Krennic of the Special Weapons Group, in another attempt to garner information on the Confederacy's Ultimate Weapon. Krennic, who himself was attempting to spearhead the project to develop the station, was able to appeal to Poggle's loyalty to his people and convinced him to provide the Geonosian drone population as a workforce for the battle-station's construction. With this allegiance to the Republic, the Archduke was returned to his homeworld on the eve of Meckgin, in which, amidst bloody celebrations, was able to convince the Geonosians to assist in the Republic's construction efforts.\nHowever, Poggle had ulterior motives for providing such assistance to the Republic. Allotted with a private retinue of drones, Poggle secretly directed a massive uprising of the Geonosian soldiers servicing the battle-station as a diversion for his own escape to the Confederacy. In addition to sabotaging the construction project, the Archduke, with his own modified personal shuttle, was able to slip through the Republic flotilla in orbit and flee into hyperspace.\nAfter escaping from Geonosis, Poggle rejoined the Confederacy as the war began to draw to its close. Following a string of Republic victories, General Grievous ordered the members of the Separatist Council, including Poggle, to remain under his protection. Grievous hid them on Utapau while he prepared a strike on Coruscant. Following Count Dooku's death and Grievous's failure at Coruscant, Poggle and the other Separatist leaders met with Grievous on Utapau. During the meeting, he informed them that he was transferring them to the volcanic planet of Mustafar for their own safety. Grievous then dismissed the council, telling them that their ship was waiting.\nAfter arriving on Mustafar, Poggle and the rest of the Council settled in a fortified bunker. Soon after, they were contacted by Darth Sidious, who had informed them that his new apprentice, Darth Vader, would be arriving shortly, but claimed that he had come to make peace with them. When Vader arrived on Mustafar, the Separatist leaders discovered that he was sent not to reward the council, but to execute them. Poggle attempted to defend himself using his staff, to no avail, and was quickly decapitated.\nAfter Poggle's death, a new archduke was appointed by the hive queen. However, the appointment was really a way to placate the Geonosians, as the species now essentially belonged to the Republic's successor state, the Galactic Empire. The Geonosisans continued to be used in the battle station project the Republic had started, which was dubbed the \"Death Star.\" To keep the Death Star a secret, the Empire sterilized the population of Geonosis, with only one Geonosian surviving.\nA male Geonosian who rose to the rank of archduke from that of a drone, Poggle the Lesser was an early and loyal supporter of the Confederacy of Independent Systems, choosing to escape back to the Separatists instead of ever truly giving his loyalty over to the Republic. Poggle was a powerful and cunning leader, being skilled at military tactics as well as negotiating. He was also possessed a knowledge of engineering.\nPoggle wielded the Staff of Command, which was the symbol of his office. Made of bone allegedly taken from a conquered adversary, it also served as a walking stick and, due to its sharp point, a weapon if the Geonosian ruler ever felt the need to motivate or punish those around him. He was clothed in ornate and aristocratic garments that reflected his position, wealth, and power. For similar reasons, Poggle also wore jewels as well as chain-like visgura thread. His chosen emblem of rank was arachnid-inspired, crafted from the egg cases of an extinct giant cave spider.\nPoggle the Lesser was voiced by Marton Csokas in the 2002 film Star Wars: Episode II Attack of the Clones and the 2005 film Star Wars: Episode III Revenge of the Sith. He was also voiced by Matthew Wood in the Star Wars: The Clone Wars animated series.\nIn the DVD commentary, it is stated that Poggle was made to look different than other Geonosians so it was obvious he was their leader, similar to how Boss Nass was designed to look different from the other Gungans.\nIn a deleted scene for Attack of the Clones, Poggle sentences Anakin and Padmé to their deaths, finding them guilty of espionage, leading Nute Gunray to hurry him up to give the sentence.\nIn the final cut of Revenge of the Sith, Poggle gets cut in half by Darth Vader. However, in the illustrated screenplay of the film, Poggle was beheaded.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Poggle_the_Lesser/Legends",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/The_Separatists",
  "/wiki/Geonosis",
  "/wiki/19_BBY",
  "/wiki/Mustafar",
  "/wiki/Geonosian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Stalgasin_hive",
  "/wiki/Techno_Union",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Archduke",
  "/wiki/Clone_Wars",
  "/wiki/Queen",
  "/wiki/Karina_the_Great",
  "/wiki/Baktoid_Armor_Workshop",
  "/wiki/Battle_droid",
  "/wiki/Factory",
  "/wiki/Warlord",
  "/wiki/Separatist_Droid_Army",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Standard_year",
  "/wiki/Coruscant",
  "/wiki/Republic_Special_Weapons_Group",
  "/wiki/Project_Stardust",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Death_Star_plans",
  "/wiki/Realspace",
  "/wiki/Utapau",
  "/wiki/Death",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Controller",
  "/wiki/Geonosian_droid_factories",
  "/wiki/Planet",
  "/wiki/Hadiss",
  "/wiki/Separatist_Crisis",
  "/wiki/Geonosian_accord",
  "/wiki/Army",
  "/wiki/Jedi",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Droid",
  "/wiki/San_Hill",
  "/wiki/Chairman",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Assassin",
  "/wiki/Kaleesh",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Cyborg",
  "/wiki/Cybernetic",
  "/wiki/Petranaki_Arena",
  "/wiki/Death_penalty",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Padawan",
  "/wiki/Mace_Windu",
  "/wiki/Jedi_assault_team",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Geonosian_Command_Center",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Geonosian_catacombs",
  "/wiki/Sith_Master",
  "/wiki/Darth",
  "/wiki/Trade_Federation",
  "/wiki/Lott_Dod",
  "/wiki/Scipio",
  "/wiki/Baron",
  "/wiki/Rush_Clovis",
  "/wiki/Geonosis_primary_droid_foundry",
  "/wiki/Mission_to_Cato_Neimoidia",
  "/wiki/Cato_Neimoidia",
  "/wiki/Great_Vaults_of_Cato_Neimoidia",
  "/wiki/Poison",
  "/wiki/Antidote",
  "/wiki/Hologram_disc",
  "/wiki/Overseer_(assignment)",
  "/wiki/Homeworld",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/TX-21",
  "/wiki/Super_tank",
  "/wiki/Garrison",
  "/wiki/Cloning",
  "/wiki/Trooper",
  "/wiki/Jedi_General",
  "/wiki/Luminara_Unduli",
  "/wiki/Soldier",
  "/wiki/Bomb",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/Progate_Temple",
  "/wiki/Buzz",
  "/wiki/Zombie",
  "/wiki/Brain_worm",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Resolute",
  "/wiki/Torture",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/TB-73",
  "/wiki/Force-choke",
  "/wiki/Temperature",
  "/wiki/Prison",
  "/wiki/Imperial_Inspectorate_HQ",
  "/wiki/Time",
  "/wiki/Republic_Intelligence",
  "/wiki/Stalgasin_war_room",
  "/wiki/Weapon",
  "/wiki/Lieutenant_Commander",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Meckgin",
  "/wiki/Blood",
  "/wiki/Shuttle",
  "/wiki/Escape_from_Geonosis",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Orbit",
  "/wiki/Hyperspace",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Volcano",
  "/wiki/Klegger_Corp_Mining_Facility",
  "/wiki/Sith_apprentice",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Dismemberment",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Unidentified_Geonosian_archduke",
  "/wiki/Species",
  "/wiki/Galactic_Empire",
  "/wiki/Sterilization_of_Geonosis",
  "/wiki/Klik-Klak",
  "/wiki/Engineer",
  "/wiki/Staff_of_Command",
  "/wiki/Bone",
  "/wiki/Clothing",
  "/wiki/Spider",
  "/wiki/Egg",
  "/wiki/Marton_Csokas",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Matthew_Wood",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Boss",
  "/wiki/Rugor_Nass",
  "/wiki/Gungan",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Nute_Gunray",
  "/wiki/Star_Wars_Episode_III_Revenge_of_the_Sith:_Illustrated_Screenplay",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Senate_Spy",
  "/wiki/A_Jedi%27s_Duty",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Weapons_Factory",
  "/wiki/Legacy_of_Terror",
  "/wiki/Brain_Invaders",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Journey_Through_Space_(2015)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_19",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_35",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Nantex-class_Starfighter_Expansion_Pack",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Helmet_Collection_8"
 ]
}