{
 "name": "Pok_(Mon_Calamari)",
 "display_name": "Pok  (Mon Calamari)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Akiva"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic silver arm of a protocol droid"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pok's Place"
     ]
    }
   ]
  }
 ],
 "content": "Pok was a male Mon Calamari who worked as a bartender at Pok's Place, a cantina in Myrra, the capital city of the Outer Rim planet Akiva. He was old by 4 ABY, as indicated by the long and thick row of barbels under his chin. Pok was missing an arm, which had been replaced by a silver protocol droid limb which was attached crudely to his shoulder, with wire plugged unceremoniously into flesh. Pok made little effort to fraternize with his customers and spoke in his own language while taking orders. In response to requests that he speak Galactic Basic Standard, he responded in one Basic phrase: \"I don't speak Basic.\"\nIn the months following the Battle of Endor, a sign that read \"NO IMPERIALS\" was hung in the bar and enforced by Pok. Around this time, ex-Imperial loyalty officer Sinjir Rath Velus began frequenting the bar, sitting in the same seat and drinking day and night for a week. One morning, a group of Imperial officers and stormtroopers began to assault Velus and the Twi'lek Orgadomo Dokura after catching them watching a holovid of Princess Leia Organa, announcing the birth of the New Republic. Pok gave the Imperials a warning and referred them to the \"NO IMPERIALS\" sign, but they persisted, and the stormtroopers pointed their blaster rifles at Pok. When Velus and others in the bar fought back against the Imperials, Pok used his droid arm to throw a bottle of liquor at one of the stormtroopers, catching him in the helmet. The stormtrooper was promptly shot by Velus, and the Imperials were quickly subdued. When one of them mentioned an Imperial blockade over Akiva and a communications blackout on the planet, Valus asked Pok if he knew anything about it, to which the Mon Calamari simply shrugged.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mon_Calamari",
  "/wiki/Bartender",
  "/wiki/Pok_(Twi%27lek)",
  "/wiki/Pok",
  "/wiki/Akiva",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Limb",
  "/wiki/Protocol_droid",
  "/wiki/Pok%27s_Place",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Cantina",
  "/wiki/Myrra",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/4_ABY",
  "/wiki/Language",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Endor",
  "/wiki/Time",
  "/wiki/Galactic_Empire",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Imperial_officer",
  "/wiki/Stormtrooper",
  "/wiki/Twi%27lek",
  "/wiki/Orgadomo_Dokura",
  "/wiki/Hologram",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/New_Republic",
  "/wiki/Blaster_rifle",
  "/wiki/Droid",
  "/wiki/Liquor",
  "/wiki/Stormtrooper_armor",
  "/wiki/Blockade",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)"
 ]
}