{
 "name": "Pommat",
 "display_name": "Pommat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "980 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Pommat was a male Human smuggler and janitor living on the planet Doan around 980 BBY. He worked in a spaceport, where he broke into several unsuspecting travelers' ships and hid shipments of the spice glitterstim in them, which would then secretly be picked up by one of his contacts on the ship's home port.\nIn 980 BBY, Darth Zannah went on a mission to Doan to find out who was responsible for the murder of Jedi Knight Medd Tandar. While on Doan, she came across evidence of a Dark Jedi, Set Harth, who had been searching for Sith artifacts dug up by the planet's miners. She questioned a Rodian bartender, Quano, about Harth, but the Rodian didn't know where Harth had gone after leaving the planet, and so took her to Pommat. Pommat found Zannah attractive, although he initially was skeptical of her. She flirted with him a little, however, and Pommat told her he knew of the man she was looking for, before going on to tell her of his smuggling business. He charged Zannah four hundred credits, which he split with Quano, to tell her what he knew of the Dark Jedi. He revealed that the ship was registered to a man named Zun Haake, and that it came from Nal Hutta. When Zannah asked if he had hid any spice on her ship, he replied that he hadn't, as her's was the first ship to come from Ciutric IV. Zannah then abruptly killed him and Quano, as she couldn't risk letting them live with the knowledge of where she and her Master, Darth Bane, lived.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/980_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Janitor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Doan",
  "/wiki/Spaceport/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Glitterstim/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Mission_to_Doan",
  "/wiki/Massacre_on_Doan",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Medd_Tandar",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Set_Harth",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Bartender/Legends",
  "/wiki/Quano",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Victory_(Theta-class_T-1_vessel)",
  "/wiki/Ciutric_IV",
  "/wiki/Death/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)"
 ]
}