{
 "name": "Ponc_Gavrisom",
 "display_name": "Ponc Gavrisom",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Calibop"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pale blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New RepublicNew Republic Senate",
      "New Republic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Ponc Gavrisom was a Calibop New Republic senator and Chief of State.\nElected to the New Republic Senate in 11 ABY, Gavrisom gained popularity as a calm mediator in Senate proceedings and stood as a staunch supporter of Chief of State Leia Organa Solo.\nFollowing Organa Solo's post-Corellian Insurrection hiatus in 18 ABY, Gavrisom was elected by the Senate to fulfill the remainder of Organa Solo's term. During this time, the Caamas Document crisis nearly crippled the New Republic, and Gavrisom vainly attempted to unify the shattered coalition. He pointed out that Organa Solo was only on leave from the position of Chief of State and that she could be reinstated by a majority vote of the Senate. But she declined his offer to stand aside, on the assumption that changing the voice of the New Republic in the middle of the crisis would be a bad move.\nIn orbit at Bothawui, Han and Lando discovered the three cloaked Star Destroyers waiting to pounce on the ships after the battle. Leia took control of the Ishori war cruiser she and the President were on to go to aid Han. A move made retroactively legal when the President, his faith in her unshaken, used an obscure law in order to take command of the ship. When the Imperial fleet revealed itself, Leia advised Gavrisom to find a leader both sides of the Caamas argument could rally behind. Gavrisom reinstated General Lando Calrissian, who led the combined fleet in forcing the Star Destroyers to retreat.\nA few weeks later, Gavrisom signed the peace accords with Admiral Gilad Pellaeon, ending the Galactic Civil War. Gavrisom was critical in healing the wounds between the New Republic and the Empire, helping Pellaeon create the new Imperial Remnant and joining Talon Karrde's joint information program. Gavrisom also healed the wounds that the Caamas Document crisis brought, and teamed up with Senator Borsk Fey'lya to end dissent in the Senate.\nHe presided over the signing of the peace accords with the Imperial Remnant, and resigned his office to Organa Solo upon her return in 21 ABY.\nHan Solo considered Gavrisom overly verbose and referred to him as \"Puffers\". Reversely, Chewbacca was a staunch supporter of Gavrisom. It was one of the handful of things they disagreed on.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Calibop",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/11_ABY/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Corellian_Crisis",
  "/wiki/18_ABY/Legends",
  "/wiki/Caamas_Document",
  "/wiki/Bothawui/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Pellaeon%E2%80%93Gavrisom_Treaty",
  "/wiki/Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Talon_Karrde",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/New_Republic_Presidential_election,_21_ABY",
  "/wiki/21_ABY/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_94",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/17_ABY/Legends",
  "/wiki/23_ABY/Legends",
  "/wiki/27_ABY/Legends",
  "/wiki/Cal_Omas",
  "/wiki/28_ABY/Legends"
 ]
}