{
 "name": "Ponda_Baba",
 "display_name": "Ponda Baba",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ando"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aqualish"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.85 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Ponda Baba was a male Aqualish thug who rescued Dr. Cornelius Evazan from a bounty hunter. The two formed a partnership and began to smuggle spice for the crime lord Jabba the Hutt, resulting in him becoming a wanted man. Shortly before the Battle of Yavin, he was a patron in Chalmun's Spaceport Cantina on the planet Tatooine, where he instigated an argument with Luke Skywalker while bored and drunk. Evazan claimed that Baba did not like Skywalker and began to threaten the youth, leading to a brief confrontation with Obi-Wan Kenobi, who, after failing to calm tensions with the pirates, used his lightsaber to sever Baba's right arm. Kenobi, who was secretly one of the last remaining Jedi Masters of the nearly extinct Jedi Order, wounded Evazan with a slash across the torso when the pair drew their blaster pistols on the old man. Evazan later tried to reattach Baba's arm using his medical training, but ended up nearly killing the Aqualish in the process when the procedure failed.\nOriginally from the planet Ando, Ponda Baba was a burly Aqualish thug who rescued Cornelius Evazan, a former doctor who was infamous for the cruelty he inflicted upon his patients, from a bounty hunter. The two formed a partnership after Evazan hired him for protection. They began to smuggle spice for Jabba the Hutt. The pirates were successful at their trade and became infamous. However, they became wanted men in several star systems, although they were mainly wanted because of Evazan's failed and sadistic surgeries. Their working relationship wasn't always pleasant, however, and Baba even briefly considered turning Evazan in to collect the bounty on his head before realizing that their ongoing partnership was more profitable. Still, the two considered each other friends despite their differences.\nThe pair eventually adopted the aliases \"Roofoo\" and \"Sawkee,\" and when visiting Milvayne, they committed a series of crimes including kidnapping, forced servitude, and surgical alteration. The Milvayne Authority officer Tam Posla looked into their case and despite being taken off it by his superior officer he managed to track them to Jedha, where the two began creating the decraniated. Posla traveled to Jedha to look for them and found their decraniated prototype Caysin Bog, whom he fell in love with. While on their way off-world, Baba and Evazan bumped into the rebel operatives Jyn Erso and Cassian Andor. Evazan told them to watch themselves and Andor said they would be careful. The two parties then continued their routes. Baba and Evazan departed from the city prior to its destruction by the Death Star and traveled to the planet Tatooine.\nPrior to the Battle of Yavin, Baba and Evazan were patrons at Chalmun's Spaceport Cantina on Tatooine. Bored and looking for excitement, a drunk Baba decided to pick a fight with Luke Skywalker, a young farmboy. Evazan quickly escalated the argument, even beginning to threaten the boy before attracting the attention of Obi-Wan Kenobi, Skywalker's guardian. The hermit attempted to ease tensions by offering to purchase the pair drinks, but Evazan and Baba both failed to realize Kenobi was asking them to stop. Thus, Evazan refused to back down and tossed Skywalker out of his way, and, along with Baba, drew his blaster pistol on the old man, despite the protest of Wuher, the cantina's bartender. Before the pirates were even able to discharge their weapons, however, Kenobi had already ignited his lightsaber, swiftly removing Baba's right arm and wounding Evazan with a slash across his torso, decisively ending the argument.\nFollowing the altercation, those present in the cantina briefly turned to see what had transpired before returning to their business. However, a departing patron, Garouf Lafoe, decided to inform a squad of Mos Eisley's sandtroopers of the attack. After the troopers had entered the establishment and reached the counter, Wuher indicated to them where Kenobi and Skywalker had taken a seat, though the pair found another exit before they could be apprehended. Evazan tried to reattach Baba's arm using his medical training, but ended up nearly killing the Aqualish in the process when the procedure failed. Ponda would later regret bullying that \"blond human teenager.\"\nSkywalker later recalled his encounter with Baba while he was training with his own lightsaber in the Temple of Eedit on Devaron.\nBaba's severed arm eventually came into the hands of Posla when he continued investigating the pair. Posla put the arm in a jar and stored it on his ship. Following Posla's death, Evazan stole the ship and rendezvoused with Baba in deep space. As he boarded Baba's ship, Evazan took Baba's arm with him to return to his companion. As Evazan worked on finishing a cybernetic arm for Baba, they watched the chase on Milvayne unfold via a broadcast from assassin droid 0-0-0's photoreceptors until they were captured by hunters Nokk and Winloss. Additionally, the new arm was very poorly attached, leading to a permanent falling out between Evezan and Baba.\nFearsome and strong, Ponda Baba was an alcoholic and ill-tempered thug who enjoyed bullying those whom he considered to be an easy target.\nBaba was a burly male Aqualish who stood 1.85 meters tall. He had gray skin, black eyes, black hair on the lower part of his face, and a pair of pink tusks.\nPonda Baba wore an orange jacket, a brown pair of pants, a black pair of boots, and a black belt with a gold buckle which had a holster attached to its left side to carry his SE-14C blaster pistol. Evazan gave Ponda a new cybernetic arm, which replaced the arm he lost to Kenobi, with a flamethrower installed into it.\nPonda Baba first appeared in the 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy, in which he was played by Tommy Ilsley. The original 1976 novelization of Star Wars, ghostwritten by Alan Dean Foster, described the character, then nameless, as a \"multi-eyed alien\". This story's version of events, which closely matches the film's revised fourth draft, describes Obi-Wan Kenobi as cutting off not Baba's arm, rather Evazan's. The Evazan character dates back as early as The Star Wars: Rough Draft from May 1974.\nWhen filming the Ponda and Evazan's confrontation with Luke and Ben Kenobi, Ponda's blood was made from raspberry yogurt and red tempera paint. This was seen when Kenobi cut off his arm.\nA walrus named Petula was used by Ben Burtt to supply Ponda Baba's vocalizations, although Tim Veekhoven and Mark Newbold, the authors of the Star Wars Blog entry \"Drawing from the Present: Familiar Creatures in a Galaxy Far, Far Away\", were unable confirm whether the walrus was Petulia or not. Baba also appears alongside Evazan in the 2016 Anthology Series film Rogue One: A Star Wars Story and was portrayed by an uncredited performer. Rogue One writer Gary Whitta disagreed with Baba and Evazan's inclusion in the film, opining that he \"thought having Evazan and Walrus Man was a little too much. You have to reign in that instinct to go back and put things in just because you loved them when you were a kid\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ponda_Baba",
  "/wiki/Ponda_Baba/Legends",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Han_Solo_%26_Chewbacca_6",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Doctor_Aphra_Book_VI:_Worst_Among_Equals",
  "/wiki/Force_Collector",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Ando",
  "/wiki/Aqualish",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Limb",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/File:PondaBabaDoesn%27tLikeYou.ogg",
  "/wiki/Doctor",
  "/wiki/Cornelius_Evazan",
  "/wiki/Bounty_hunter",
  "/wiki/Smuggler",
  "/wiki/Spice",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Battle_of_Yavin",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Luke_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Pirate",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_Order",
  "/wiki/Blaster_pistol",
  "/wiki/Death",
  "/wiki/Unidentified_bounty_hunter_(Cornelius_Evazan)",
  "/wiki/Star_system",
  "/wiki/Bounty",
  "/wiki/Milvayne",
  "/wiki/Milvayne_Authority",
  "/wiki/Officer",
  "/wiki/Tam_Posla",
  "/wiki/Tam_Posla%27s_superior_officer",
  "/wiki/Jedha",
  "/wiki/Decraniated",
  "/wiki/Caysin_Bog",
  "/wiki/Jyn_Erso",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Farm",
  "/wiki/Wuher",
  "/wiki/Cantina",
  "/wiki/Bartender",
  "/wiki/Lightsaber",
  "/wiki/Dismemberment",
  "/wiki/Garouf_Lafoe",
  "/wiki/Squad",
  "/wiki/Desert_stormtrooper",
  "/wiki/Trooper",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Temple_of_Eedit",
  "/wiki/Devaron",
  "/wiki/Tam_Posla%27s_ship",
  "/wiki/Cybernetics",
  "/wiki/Chase_on_Milvayne",
  "/wiki/Assassin_droid",
  "/wiki/0-0-0",
  "/wiki/Photoreceptor",
  "/wiki/Hunter",
  "/wiki/Nokk",
  "/wiki/Winloss",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Boot",
  "/wiki/SE-14C_blaster_pistol",
  "/wiki/Flamethrower",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Tommy_Ilsley",
  "/wiki/1976",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Alan_Dean_Foster",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/May",
  "/wiki/1974",
  "/wiki/Blood",
  "/wiki/Yogurt",
  "/wiki/Petula",
  "/wiki/Ben_Burtt",
  "/wiki/Tim_Veekhoven",
  "/wiki/Mark_Newbold",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Gary_Whitta",
  "/wiki/Category:Images_of_Ponda_Baba",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Bounty_Hunt",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/A_New_Hope_(Little_Golden_Book)",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Luckless_Rodian",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Not_for_Nothing",
  "/wiki/We_Don%27t_Serve_Their_Kind_Here",
  "/wiki/The_Kloo_Horn_Cantina_Caper",
  "/wiki/The_Secrets_of_Long_Snoot",
  "/wiki/Born_in_the_Storm",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure_(audiobook)",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_25",
  "/wiki/Doctor_Aphra_(2016)_26",
  "/wiki/Doctor_Aphra_(2016)_27",
  "/wiki/Doctor_Aphra_(2016)_28",
  "/wiki/Doctor_Aphra_(2016)_30",
  "/wiki/Doctor_Aphra_(2016)_31",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Minecraft_Star_Wars",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Trip_to_the_Light_Side",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_4",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/The_Star_Wars_Book_of_Monsters,_Ooze_and_Slime",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Practical",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars:_Exploring_Tatooine",
  "/wiki/Databank_(website)",
  "/wiki/Doctor_Aphra_(2016)_18",
  "/wiki/File:Evazan_escape.png",
  "/wiki/September_13",
  "/wiki/2017",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/Drawing_from_the_Present:_Familiar_Creatures_in_a_Galaxy_Far,_Far_Away",
  "/wiki/March_24",
  "/wiki/December_3"
 ]
}