{
 "name": "Porg_(bounty_hunter)",
 "display_name": "Porg  (bounty hunter)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green-yellow"
     ]
    }
   ]
  }
 ],
 "content": "Porg was a Trandoshan male bounty hunter who was active during the time of the New Republic. In 5 ABY, the droid information broker 8t88 hired Porg as an extra hand to kill the former Rebel Alliance agent Kyle Katarn if Katarn managed to escape death at the hands of other hirelings at the Rimmer's Rest cantina, located on the moon Nar Shaddaa.\nIndeed, Katarn evaded 8t88's hirelings in the bar and, after blowing off one of 8t88's arms, ran into the sewers, where he encountered Porg and an Aqualish bounty hunter. Porg attacked Katarn with a vibro-ax but was quickly incapacitated. When the Trandoshan tried to attack again, he inadvertently moved into the crossfire between Katarn and the Aqualish and was simultaneously gunned down by both combatants.\nA Trandoshan male, Porg picked up work as a bounty hunter on the moon Nar Shaddaa by the time of the New Republic. During the year 5 ABY, the droid information broker 8t88 planned to double-cross one of his clients, the former Rebel Alliance agent Kyle Katarn, on Nar Shaddaa, lest Katarn agreed to the droid's demands. However, predicting that Katarn may not comply, 8t88 hired a variety of bounty hunters and mercenaries, including Porg, to serve as backup.\nAlong with a Gran and another bounty hunter, 8t88 met Katarn at the Rimmer's Rest cantina. As 8t88 predicted, Katarn rebuffed the droid's demands, and 8t88 departed the bar, leaving his companions behind to kill Katarn. However, Katarn escaped the cantina and tracked 8t88 to a landing platform, where he opened fire on the droid and shot off one of 8t88's arms. Nevertheless, the droid escaped aboard his Lambda-class shuttle, while the severed arm fell off the platform and into the sewers below. Clutched in the arm's hand was a datadisc, which was what Katarn was after.\nPorg, who wanted to secure the datadisc before Katarn, located the arm in the sewers before his adversary and hid himself in the sewage. When Katarn recovered 8t88's severed arm, Porg rushed from the muck with a vibro-ax in hand. Katarn stated that he did not think that the bounty hunter had an advantage in bringing a vibro-ax to a blaster fight, inadvertently giving Porg enough time to disarm Katarn of his own weapon. Porg attacked again, but his Human quarry blocked the blow with 8t88's arm and followed up with a swift kick to the Trandoshan's groin, which incapacitated the bounty hunter.\nAfter Katarn retrieved his Bryar blaster pistol, an Aqualish bounty hunter entered the sewers, looking for Porg after overhearing the brief struggle. Katarn tried to shoot him, but the Aqualish's body armor knocked the blaster bolt away. The two exchanged fire, during which Porg came to. Oblivious to the firefight, Porg sat up the moment that the Aqualish and Katarn fired their blasters at each other. Porg was fatally hit by both blasts, and his body fell back down into the sewage. Stunned by his accidental kill, the Aqualish was immediately shot in the head by Katarn, who ultimately escaped all of 8t88's men and left Nar Shaddaa.\nPorg was a bounty hunter who was displeased that Kyle Katarn would wield a ranged weapon against someone armed with a melee weapon, a tactic that he found to be dishonorable. Porg was subsequently infuriated when Katarn simply tried to avoid a \"righteous\" killing blow from the vibro-ax. However, Porg was proud of the manner in which he swung his ax and believed his feat, coupled with his plan to kill Katarn in a single blow, was exemplary of a warrior. The Trandoshan boasted about his skill with the ax and took pride in trapping Katarn while planning to cut his quarry's head in half. Porg had yellow eyes, greenish-yellow scales, and could speak Galactic Basic Standard.\nPorg used a vibro-ax when he confronted Kyle Katarn, claiming to know how to use it effectively. He demonstrated his ability by disarming Katarn with the weapon but was unable to strike a killing blow in his follow-up attack, which Katarn blocked. Porg stylized himself with silver body armor and a flowing red cape, as well as bandoliers around his ankles.\nPorg first appeared in the 1998 novella Dark Forces: Rebel Agent, written by William C. Dietz. Artist Ezra Tucker provided the book's illustration of Porg. The character also appears in the novella's full-cast audio drama, in which he has several lines of dialogue that were not included in the novella. The audio adaption does not specify who voices Porg, but voice actors Patrick Coyle, Tom Keith, Bill Slichter, and Tim Russell are all credited as having voiced either a bounty hunter or \"goon.\"\nThere are several inconsistencies between the Dark Forces: Rebel Agent novella and audio drama, as well as the 2008 The Complete Star Wars Encyclopedia, regarding Porg's encounter with Kyle Katarn.\nPorg's character entry in The Complete Star Wars Encyclopedia claims that the bounty hunter only wanted to capture Katarn, while the novella and audio drama clearly establish that Porg intended to kill Katarn. The entry also mentions that Porg was in a three-way battle with Katarn and the Aqualish, and that the Aqualish hunter purposely shot Porg. However, Rebel Agent notes that the Aqualish did not mean to shoot Porg and was subsequently stunned by his deed long enough for Katarn to kill him. This article considers the Rebel Agent novella and audio drama to take precedence as primary sources.\nAnother inconsistency arises between the Rebel Agent novella and audio drama regarding when exactly Katarn retrieves 8t88's arm. In the novella, Katarn obtains the arm and uses it in the subsequent fight against Porg. In the audio drama, Katarn spots the arm but cannot retrieve it before Porg ambushes him; Katarn then grabs the arm after subduing Porg.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Porg_(disambiguation)",
  "/wiki/5_ABY/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Time/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Model_88-series_administration_droid",
  "/wiki/Information_broker/Legends",
  "/wiki/8t88/Legends",
  "/wiki/Death/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Rimmer%27s_Rest/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Unidentified_Aqualish_(Nar_Shaddaa)",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Unidentified_Gran_(Rimmer%27s_Rest)",
  "/wiki/Unidentified_bounty_hunter_(Rimmer%27s_Rest)",
  "/wiki/Furious_(Lambda-class)",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Lightfight",
  "/wiki/Blaster/Legends",
  "/wiki/Human/Legends",
  "/wiki/Bryar_pistol/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Cape/Legends",
  "/wiki/Bandolier/Legends",
  "/wiki/1998",
  "/wiki/Dark_Forces:_Rebel_Agent",
  "/wiki/William_C._Dietz",
  "/wiki/Ezra_Tucker",
  "/wiki/Dark_Forces:_Rebel_Agent_audio_drama",
  "/wiki/Patrick_Coyle",
  "/wiki/Tom_Keith",
  "/wiki/Bill_Slichter",
  "/wiki/Tim_Russell",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II"
 ]
}