{
 "name": "Porter Engle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "By 532 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ikkrukkian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Porter Engle, known as the Blade of Bardotta, was an Ikkrukkian male Jedi Master and cook who lived during the High Republic Era. Sporting an enormous beard, Engle was once a legend within the Jedi Order. Eventually Engle stepped down to become a humble cook, becoming known for his recipes, such as Nine-Egg Stew. During the Great Hyperspace Disaster, he was stationed at the Jedi Outpost on Elphrona.\nPorter Engle joined the Jedi Order over three centuries before the Great Hyperspace Disaster. His long lifespan allowed Engle to take on many roles as a Jedi for extended periods of time. His years spent as a diplomat, an explorer, a teacher, and a warrior led to his legendary reputation within the Jedi Order. Among his many exploits was an incident that cost Engle his left eye and left a scar along his face. At some point he traveled on adventures as a gunslinger Jedi with his sister Barash Silvain. At some point he captured the Hutt Clan enforcer Ola Hest at Gardulla's Palace after the Ottegan had brought down a children's hospital on Novor.\nFollowing a five day siege on Bardotta, Engle earned the nickname the \"Blade of Bardotta.\". Engle later stepped down from that life after a series of events that horrified him convinced him to never work like a blade again. One of his memories involved a distant terror and a lightsaber falling out of someone's broken fingers. Despite the simple life he adopted, his mind would not be at true peace for years to come. Stories were spread amongst the Jedi of his actions during his youth. After serving as a Jedi for centuries, Porter became a cook on Elphrona in its Jedi Outpost as part of his new, simplier life. There, he created the Nine-Egg Stew.\nAround the time of the Great Hyperspace Disaster, Engle served as the cook at the Jedi outpost on the planet Elphrona. When the Nihil kidnapped the wealthy Blythe family on Elphrona, an anonymous being sent a message to the Elphrona outpost pleading for Jedi aid. Engle and fellow Jedi Indeera Stokes, Loden Greatstorm, Padawan Bell Zettifar, and the charhound Ember quickly responded to the call, traveling in a Vanguard to the family's homestead. However, the Nihil band had already seized the family and the Jedi found only a group of mole mines left as a trap by the marauders. The mines attacked Porter, Loden, and Bell while Indeera scouted ahead on a Veil speeder. Each Jedi dispatched the attacking mines in different ways, and Porter's precise and skilled technique caught the attention of both Greatstorm and Zettifar. This distraction allowed a mine to slip past the Jedi and destroy their Vanguard transport.\nWith their original vehicle lost, Porter suggested riding the three steelees left in the Blythes' corral to catch up to the Nihil before they could reach their ships and escape Elphrona. The three Jedi and their charhound companion pursued the escaping raiders, gradually closing the distance between the two groups until they reached a narrow canyon. The Nihil leader, having noticed their pursuers, stationed a pair of snipers high in the canyon. One of these shot and killed the steelee being ridden by Engle. The Ikkrukkian stayed behind to deal with the pair while Loden and Bell rode on after the remaining Nihil and the captive Blythes. Porter killed one sniper, throwing his lightsaber and slicing through the Nihil after deflecting the man's next blaster attack. He then leapt high into the rocks, where he discovered the second sniper attempting to coax a steelee into fleeing. The second raider shot at Engle and the Jedi deflected the bolt back into his attacker's face mask. However, as Porter calmed the man's frightened steelee and prepared to resume the chase for the rest of the Nihil, the injured sniper sat back up, not dead as the Jedi had assumed. As Engle prepared to die at the hands of the Nihil, knowing he would not be able to move quickly enough to avoid the next blaster shot, Ember arrived. The charhound saved the Jedi by shooting flames from her mouth and burning his would-be killer alive.\nPorter caught up with Loden and Bell and found that Erika Blythe was now in their care and in desperate need of medical attention. Engle, the best healer of the three Jedi, volunteered to take Erika back to their outpost for treatment. He left with the injured woman as Greatstorm and his Padawan continued their pursuit to rescue the rest of the settler family. The incident ended with most of the family rescued, but the father and Greatstorm himself were taken away by the Nihil, with Greatstorm assumed dead by his fellow Jedi. Porter later attended the dedication of the Republic's Starlight Beacon space station but seemed to pay the station's luxuries no mind, as he was instead lost in his own thoughts about his past as the Blade of Bardotta. While fighting the Nihil attack on Valo in the following year, Porter helped organize several of his fellow Jedi through the Force, with images of his life flooding into their minds as a way to bring their Jedi Vectors together. Stokes believed it was the first moment his mind was truly calm in years.\nAround 231 BBY, Porter Engle set a trap for the Nihil on Quilken, causing the Tempest Runner Lourna Dee to flee who directly recognized the Blade of Bardotta, leaving the Storm Slombo alone to face the Ikkrukkian Jedi, who was subsequently captured.\nElder Porter Engle was a very humble Jedi who no longer took himself too seriously. A good Jedi, he said, had to be humorous.\nBut he was also known for his frankness as proven by his warning to Bell Zettifar about Valo. according to Indeera Stokes, this character trait prevented him from having a seat on the Jedi High Council.\nPorter Engle was a male Ikkrukkian, like all members of his species he has two bulges on his skull. He had white skin and long hair and a long beard of the same color.\nHe had a right blue eye and would be blind on the left, this was visible with the scar on the eye that he hid with an eye patch.\nAt the age of 300, the Jedi was overweight, but in his youth, Porter Engle had an athletic body, black hair and beard, and he still had his left eye.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Engle_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/532_BBY",
  "/wiki/Ikkrukkian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/Chef",
  "/wiki/High_Republic_Era",
  "/wiki/Hair",
  "/wiki/Nine-Egg_Stew",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Elphrona_Outpost",
  "/wiki/Elphrona",
  "/wiki/Barash_Silvain",
  "/wiki/Hutt_Clan",
  "/wiki/Ola_Hest",
  "/wiki/Gardulla_the_Hutt%27s_Palace",
  "/wiki/Ottegan",
  "/wiki/Novor",
  "/wiki/Siege_on_Bardotta",
  "/wiki/Lightsaber",
  "/wiki/Standard_year",
  "/wiki/Standard_century",
  "/wiki/Planet",
  "/wiki/Nihil",
  "/wiki/Raid_on_Elphrona",
  "/wiki/Blythe_family",
  "/wiki/Marchion_Ro",
  "/wiki/Jedi",
  "/wiki/Indeera_Stokes",
  "/wiki/Loden_Greatstorm",
  "/wiki/Padawan",
  "/wiki/Bell_Zettifar",
  "/wiki/Charhound",
  "/wiki/Ember",
  "/wiki/Vanguard_(vehicle)",
  "/wiki/Mole_mine",
  "/wiki/Veil_speeder",
  "/wiki/Steelee",
  "/wiki/Canyon",
  "/wiki/Sniper",
  "/wiki/Blaster",
  "/wiki/Death",
  "/wiki/Erika_Blythe",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Attack_on_Valo",
  "/wiki/Jedi_Vector",
  "/wiki/231_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Quilken",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Slombo",
  "/wiki/Jedi_High_Council",
  "/wiki/The_High_Republic_%E2%80%94_The_Blade_1",
  "/wiki/The_High_Republic_%E2%80%94_The_Blade_2",
  "/wiki/The_High_Republic_%E2%80%94_The_Blade_3",
  "/wiki/The_High_Republic_%E2%80%94_The_Blade_4",
  "/wiki/Set_For_Life",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic_Adventures:_Galactic_Bake-Off_Spectacular",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/The_Haul",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic:_Mission_to_Disaster_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Soule_Man",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Geonosis_and_Other_Outer_Rim_Planets",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Star_Wars:_Inner_Jedi",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Category:Images_of_Porter_Engle",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}