{
 "name": "Pote Snitkin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Agriworld-2079"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Skrilling"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Pote Snitkin was a male Skrilling arms dealer and pilot who worked for the Hutt crime lord Jabba Desilijic Tiure. In 4 ABY, he viewed a perfomance of Jedi Rocks by the Max Rebo Band at Jabba's Palace on the planet Tatooine shortly before piloting one of Jabba's Bantha-II cargo skiffs to the Great Pit of Carkoon.\nJabba planned to feed a group of prisoners to the sarlacc that lived in the pit, but the Jedi Luke Skywalker broke free and managed to board Snitkin's skiff. Skywalker quickly defeated all of the guards on board the skiff and Snitkin himself before moving onto Jabba's sail barge, the Khetanna. Snitkin then fell into the sarlacc and was eaten.\nPote Snitkin was a male Skrilling pilot and contraband arms dealer and smuggler who served in the criminal empire of the Hutt crime lord Jabba Desilijic Tiure. In 4 ABY, He was amongst the members of Jabba's entourage present alongside their master in his palace on the planet Tatooine. In the palace's throne room, Snitkin stood with other court members and watched a performance of Jedi Rocks by the Max Rebo Band.\nDue to his experience as a pilot, Snitkin was later put in charge of one of two Bantha-II cargo skiffs that accompanied Jabba's sail barge Khetanna to the Great Pit of Carkoon in the Dune Sea, where the crime lord planned to feed a group of prisoners to the sarlacc that inhabited the pit. Snitkin's skiff only carried guards, with the prisoners being transported on the other skiff; however, during the attempted execution, the Jedi prisoner Luke Skywalker attacked and defeated the guards on the prisoner transport skiff.\nSnitkin then manoeuvred the second skiff so the guards on board could shoot at Skywalker and the other prisoners, but the Jedi leapt aboard the Skrilling's skiff and made short work of the guards it carried. Snitkin was one of the last on board the skiff to be defeated, and ended up lying on the floor of the skiff as Skywalker leapt from the vehicle onto the Khetanna. The pilot was then thrown overboard into the pit beneath the skiff, where the Skrilling was devoured by the sarlacc. Skywalker and his companions ultimately killed Jabba and destroyed his sail barge before escaping.\nPote Snitkin was a sturdy, green-skinned Skrilling.\nSnitkin wore a light brown shawl over an orange shirt with a dark brown shirt underneath. He also wore light brown pants and brown shoes.\nPote Snitkin first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The character was known as Snit Plotkin on set, but the name Pote Snitkin was used on the official creature list during production.\nThe name was first used in a published source in the current canon in the 2015 reference book Star Wars: Absolutely Everything You Need to Know, although it was previously first published in the Star Wars Legends continuity in A Guide to the Star Wars Universe, Second Edition, Revised and Expanded, which was written by Bill Slavicsek and released in 1994. A costume sketch of Snitkin was produced by costume designer Nilo Rodis-Jamero for Return of the Jedi based on a design by concept artist Ken Ralston.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pote_Snitkin",
  "/wiki/Pote_Snitkin/Legends",
  "/wiki/Tales_from_Wild_Space:_Majordomo,_Major_Problems",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Skrilling",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Arms_dealer",
  "/wiki/Pilot",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Jedi_Rocks",
  "/wiki/Max_Rebo_Band",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Sarlacc",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Smuggler",
  "/wiki/Dune_Sea",
  "/wiki/Death",
  "/wiki/Clothing",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/2015",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Legends",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Bill_Slavicsek",
  "/wiki/1994",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/Ken_Ralston",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Tatooine_Rhapsody",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Luke_vs._Jabba_-_Sail_Barge_Escape",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_23",
  "/wiki/Star_Wars:_Complete_Vehicles",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Star_Wars_Episode_VI:_Return_of_the_Jedi"
 ]
}