{
 "name": "Prahman_Su",
 "display_name": "Prahman Su",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  }
 ],
 "content": "Prahman Su was a Human from the planet Corellia who was considered one of the most disreputable scoundrels in the Corellian system during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire. Su became friends and rivals with fellow scoundrel Brali Ixxis when the pair worked together on a clotheslegging job near the Cron Drift, which they mutually botched. The pair then began running semi-regular games of sabacc in Coronet City on Su's homeworld, which became known as Ixxis and Su's Floating Game. A game would begin whenever the pair both found themselves in the city at the same time and would then move from location to location. Players who wished to enter required a personal invite from Ixxis or Su, as well as a 5000 initial stake. The game attracted large numbers of up and coming gamblers and card sharks, although those without the necessary money where beaten an robbed upon arrival.\nPrahman Su was first mentioned in Suns of Fortune, a sourcebook released in 2014 for Fantasy Flight Games Star Wars: Edge of the Empire roleplaying system. The book does not make clear Su's gender.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellian_system",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Brali_Ixxis",
  "/wiki/Clotheslegging",
  "/wiki/Cron_Drift/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/City/Legends",
  "/wiki/Credit",
  "/wiki/Gambling/Legends",
  "/wiki/Suns_of_Fortune",
  "/wiki/2014",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}