{
 "name": "Pram_Dramango",
 "display_name": "Pram Dramango",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Pram Dramango was a Human female microbiologist who lived during the time of the Galactic Civil War. Following the Battle of Yavin, Dramango was part of the Galactic Empire's science staff in the Imperial Research and Prison Facility on the planet Dathomir. There, scientists were secretly conducting dangerous scientific research for the Empire, intending to re-engineer the dreadful Blackwing virus into a bioweapon. Dr. Dramango operated on level 2 of the research laboratory. In 1 ABY, Pram Dramango was present when an accident took place in the Imperial Research and Prison Facility and the virus escaped containment. The virus killed most of the people in the area, turning them into undead creatures. However, Dr. Dramango survived the outbreak and joined a small group of survivors including Dr. Stane Tritan, Dr. Nomi Rhane, Marpo Glenfik and TK-217. The survivors barricaded themselves in a maintenance room with an access to an emergency escape ladder. They resisted the attacks of the undeads but they did not manage to open the magnetic hatch and were stuck in that room. A group of spacers finally entered the research facility. Following the indications communicated by Nomi Rhane, they successfully unlocked the hatch blocking the emergency exit. The survivors and the spacer then used the escape ladder to leave the facility. Once arriving at the surface, in the courtyard of the Imperial Research and Prison Facility, they were indeed attacked by the undeads. The spacers escorted the survivors to Camp Epsilon located nearby, where a group of refugees and a functional Lambda-class shuttle were awaiting them. The survivors, including Pram Dramango, the spacers and the refugees of Camp Epsilon eventually escaped the Quarantine Zone together in the shuttle.\nPram Dramango appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Pram Dramango was added to the game with the \"Game Update 14\", released on October 12, 2009.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Microbiologist",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Imperial_Research_and_Prison_Facility",
  "/wiki/Planet/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Imperial_bioweapons_Project_I71A",
  "/wiki/Bioweapon/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Blackwing_virus_outbreak_on_Dathomir",
  "/wiki/Quarantine_Zone_(Dathomir)",
  "/wiki/Zombie/Legends",
  "/wiki/Stane_Tritan",
  "/wiki/Nomi_Rhane",
  "/wiki/Marpo_Glenfik",
  "/wiki/TK-217",
  "/wiki/Camp_Epsilon",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/October_12",
  "/wiki/2009",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}