{
 "name": "Pran",
 "display_name": "Pran",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Carnelion IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Open"
     ]
    }
   ]
  }
 ],
 "content": "Pran, also known as Mother Pran, was a female human who resided on the planet Carnelion IV.\nIn 29 BBY, Pran, along with another Carnelion resident, Kolara, flew an airship in a battle over the planet's surface. Their craft came under heavy fire, and two Jedi who had recently crashed on the planet in response to a distress call they received, Jedi Knight Obi-Wan Kenobi and Padawan Anakin Skywalker, used the Force to pull their sinking ship toward a ledge, allowing them to escape. Pran quickly withdrew two pistols and aimed them at the robed figures, ordering Kolara to step away from Skywalker, who then informed her that they were Jedi sent to answer the distress call. Pran and Kolara shared a confused look with one another, and Pran asked Skywalker what a Jedi was.\nBefore the Jedi could explain, the group was attacked by a Closed airgun. Pran and Kolara hid behind a ridge, hoping the Closed airgun would take out the Jedi and leave them alone. When Obi-Wan and Anakin joined them in hiding, Pran was outraged and was certain that the Closed would follow them and wipe them all out. After Obi-Wan destroyed the airgun with a saber throw, Anakin rescued the pilot of the ship, Grecker. Pran was upset and wanted to know why the Jedi didn't let him fall to his death. Anakin explained it wasn't the Jedi way, so she drew her pistols and began a standoff with the Closed. Their guns were disabled by Anakin's lightsaber, so she and Grecker drew knives and attempted to attack each other until Obi-Wan disarmed them with the Force. The Jedi asked for an explanation why the Open and Closed wanted to kill each other, and Pran claimed the Closed had started the war that destroyed Carnelion IV. When Obi-Wan wanted to leave them on top of the mountain, Pran reluctantly agreed with Grecker that they would die without assistance.\nAs they descended into the Celadon Sea, Pran and Grecker overheard Anakin mention a distress signal. She then uncharacteristically sided with Grecker on Anakin's suggestion to build an airship out of the scavenged parts from the Open and Closed airships. After getting the ship working, Mother Pran proceeded to pilot it.\nOn the trip, Pran spied a kite with a package attached to it. She commanded Kolara to get to the back of the cabin while steered the airship close enough for Grecker to snag it out of the sky. Once they confirmed it was a piece of art sent up by the Scavenger, they tossed it out of the ship. Shortly afterwords, Kolara observed Anakin tinkering with his lightsaber, and realized he was very skilled at repairing technology. She called over Mother Pran who gave Anakin a central processor and asked if he could fix it. When he did, Mother Pran realized that he could repair all the Open's war machines which would allow them to win the war. She praised Kolara for recognizing Anakin's skills, and quickly hatched a plan to kidnap him. When their airship was attacked by fishers, Pran apologized and knocked the padawan unconscious, escaping along with him and Kolara on a small flyer. Once clear, she circled around and destroyed the airship with the guns on the flyer.\nPran flew to the Fortress-Home of the Open, and showed the rest of the clan what Anakin could do by restarting a battle droid with the repaired central processor. After getting all their war machines running, Pran asked Anakin where the distress signal was so that she could save Obi-Wan. The padawan realized she was lying, but told her the directions in hope that he could accompany her to help rescue his master. She gagged him and left him behind so that she and the other Open could go and finish their war.\nMother Pran arrived at Sera's fortress museum and found it under siege by the Closed. She proceeded to attack them and Obi-Wan, who was trying to defend the building. She confronted the Jedi and was about to shoot him when he was saved by Anakin. Pran stopped fighting when the Republic fleet that Obi-Wan had called appeared in the sky above the battle.\nPran had white hair and light blue eyes. She had a red tattoo over her right eye.\nPran was an aggressive and ruthless warrior and leader determined to achieve victory for her side. She was however sufficently weak minded to fall for a mind trick Obi-Wan used to get her to lower her weapons during their first encounter.\nPran used slugthrowers and knives in combat. She was able to pilot airships and mechs.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Carnelion_IV",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Tattoo",
  "/wiki/Open",
  "/wiki/Planet",
  "/wiki/29_BBY",
  "/wiki/Kolara",
  "/wiki/Jedi",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Slugthrower",
  "/wiki/Robe",
  "/wiki/Closed",
  "/wiki/Airgun",
  "/wiki/Saber_throw",
  "/wiki/Grecker",
  "/wiki/Lightsaber",
  "/wiki/Knife",
  "/wiki/Celadon_Sea",
  "/wiki/Central_processor",
  "/wiki/Fisher_(Carnelion_IV)",
  "/wiki/Fortress-Home_of_the_Open",
  "/wiki/Sera%27s_fortress_museum",
  "/wiki/Galactic_Republic",
  "/wiki/Mind_trick",
  "/wiki/Obi-Wan_and_Anakin_1",
  "/wiki/Obi-Wan_and_Anakin_2",
  "/wiki/Obi-Wan_and_Anakin_3",
  "/wiki/Obi-Wan_and_Anakin_4",
  "/wiki/Obi-Wan_and_Anakin_5",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)"
 ]
}