{
 "name": "Pratari_Cinn",
 "display_name": "Pratari Cinn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "23 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Pratari Cinn was a male Twi'lek black marketeer operating in the galaxy by 10 ABY.\nPratari Cinn was a Twi'lek black marketeer who operated in the Parmel sector of the Outer Rim Territories. Rumor had it that he maintained several facilities in uncharted asteroid belts.\nCinn developed a reputation as a being who concluded his deals with minimal delay and faster than his competitors, and he preferred to deal with high-value items that could be moved quickly. The Twi'lek employed several henchmen who were known to be zealous in defending their boss's interests, and also used a large of intermediaries to protect his position. Cinn also had a contacts in various smuggler guilds.\nCinn's TracSheet number was 89906544-TRHH-965777, and listed his crimes against the Empire which included the illegal possession of restricted weaponry, the sale of illegal weaponry, possession and distribution of illegal goods, violations of customs excise laws, and the aiding and abetting of known smugglers.\nCinn was a Twi'lek of muscular build, and he sported a blaster scar across his left cheek.\nCinn was competent in the use of a blaster, and was knowledgeable about criminal and black market operations. He was also a proficient pick-pocket.\nCinn wielded a hold-out blaster and a vibroblade for personal defense. He also carried a datapad and maintained a large credit reserve.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Black_marketeer",
  "/wiki/The_galaxy/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Parmel_sector",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Asteroid_belt",
  "/wiki/Smuggler/Legends",
  "/wiki/TracSheet",
  "/wiki/Galactic_Empire",
  "/wiki/Blaster/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Galaxy_Guide_11:_Criminal_Organizations"
 ]
}