{
 "name": "Prauf",
 "display_name": "Prauf",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Abednedo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "14 BBY",
      "Bracca"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Abednedo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Scrapper Guild"
     ]
    }
   ]
  }
 ],
 "content": "Prauf was an Abednedo male who worked for the Scrapper Guild on Bracca during the Clone Wars and the Imperial Era. Sometime after Order 66 was issued, the former Jedi Padawan Cal Kestis started working in disguise alongside Prauf. He was eventually killed by the Second Sister, an Imperial Inquisitor, trying to protect Kestis.\nAn Abednedo male native of the planet Abednedo, Prauf started working as an engineer on the planet Bracca before the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. He took part to the Scrapper Guild and helped to refit and rebuild broken-down ships.\nDuring the Clone Wars, some Scrapper Guild members aided the Separatists, trying to wrestle Bracca away from the Republic. In retaliation, the newly formed Galactic Empire cut wages and lowered safety standards on the planet. Prauf continued to work under the Empire, but he noticed that most of his fellow engineers were turned into scrappers. The Abednedo operated heavy-duty cutters and welders in order to dismantle derelict starships.\nSometime before 14 BBY, he befriended Cal Kestis, a former Jedi Padawan in hiding. Prauf, who was unaware of his friend's true nature, helped Kestis get jobs through the Scrapper Guild, and both were supervised by a foreman droid. He also believed that Kestis deserved better, as he wanted him to explore the galaxy and find his destiny, moving away from Bracca and the life of a scrapper. Both Prauf and Kestis were hardworking and avoided trouble, allowing them to be largely ignored by guild overseers. In 14 BBY, Prauf and Kestis were required to secure cables on line Ten-A, an area on the wing of a wrecked Venator-class Star Destroyer. Kestis said that the work was dangerous, but the chief offered them double pay for the maneuver. While trying to reach line Ten-A, after Prauf went on it, the stairs that led to a structure collapsed, forcing Kestis to pass through another way. After securing the cables, Prauf and Kestis noticed an Eta-2 Actis-class light interceptor, and they briefly discussed the Jedi.\nAs they were about to leave the Star Destroyer, the supports that prevented the starship to plummet broke, and Prauf and Kestis slid down. As they were about to fall, Kestis' leg got stuck in a tube, and he used the Force to slow down Prauf's fall. Kestis and Prauf landed on a damaged hover barge, but they were able to pilot it to the ground. Prauf asked Kestis if he had used the Force to save him, but Kestis made him promise not to tell anyone. Prauf suggested to the former Jedi to leave Bracca, and Kestis planned to take refuge on the moon Nar Shaddaa. However, an Imperial Probe Droid observed the event and contacted the Inquisitorius.\nThe Second Sister and the Ninth Sister, two Imperial Inquisitors, were dispatched to Bracca with a squadron of Purge Troopers to execute the Force-sensitive that worked as a scrapper. The train where the workers traveled was stopped by several stormtroopers and the scrappers got lined up. The Inquisitors, not knowing who among them was Force-sensitive, asked the scrappers if someone wanted to turn himself in freely, otherwise everyone would have faced summary execution. Prauf, to distract them, ranted about what the Empire had done to Bracca and the Scrapper Guild. The Second Sister agreed with him, before killing Prauf with her lightsaber. Kestis, in anger, tried to kill the Second Sister with his lightsaber. His strike, however, was blocked by the Inquisitor, and Kestis was forced to flee.\nPrauf's death led Kestis to escape from Bracca, fulfilling Prauf's wishes for him to leave the planet. Kestis later told Nightsister Merrin about how an old friend told him to find his place in the galaxy and fulfill his destiny.\nPrauf was a jovial and talkative Abednedo male with light brown skin. He remembered when the shipyards of Bracca focused on rebuilding ships instead of breaking them down. He always watched out for Cal Kestis and knew enough to not ask questions about Kestis' past, but he hoped that Kestis could have a better life than his.\nPrauf could operate cutters and welders thanks to his physical strength and his imposing size. He was a skilled engineer and was able to climb, jump and, with the help of Kestis, he was able to secure cables.\nPrauf wore a orange and blue garment and brown boots.\nPrauf was introduced in the 2019 video game Star Wars Jedi: Fallen Order, in which he is played by JB Blanc. The concept art for Prauf was created by Jose Daniel Cabrera Peña.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Abednedo_(planet)",
  "/wiki/14_BBY",
  "/wiki/Bracca",
  "/wiki/Abednedo",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Scrapper_Guild",
  "/wiki/Clone_Wars",
  "/wiki/Imperial_Era",
  "/wiki/Time",
  "/wiki/Order_66",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Cal_Kestis",
  "/wiki/Death",
  "/wiki/Second_Sister",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitor",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Engineer",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Starship",
  "/wiki/Unidentified_foreman_droid",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Line_Ten-A",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Eta-2_Actis-class_light_interceptor",
  "/wiki/Limb",
  "/wiki/The_Force",
  "/wiki/Moon",
  "/wiki/Nar_Shaddaa",
  "/wiki/Viper_probe_droid",
  "/wiki/Inquisitorius",
  "/wiki/Ninth_Sister",
  "/wiki/Purge_Trooper",
  "/wiki/Force-sensitive",
  "/wiki/Stormtrooper",
  "/wiki/Death_penalty",
  "/wiki/Second_Sister%27s_lightsaber",
  "/wiki/Jaro_Tapal%27s_lightsaber",
  "/wiki/Escape_from_Bracca",
  "/wiki/Nightsisters",
  "/wiki/Merrin",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/JB_Blanc",
  "/wiki/Jose_Daniel_Cabrera_Pe%C3%B1a",
  "/wiki/Category:Images_of_Prauf",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Template:JFODate",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game"
 ]
}