{
 "name": "Pre Vizsla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.84 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond",
      "later shaved"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "House Vizsla",
      "Clan Vizsla",
      "Clan Vizsla"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Death Watch",
      "Confederacy of Independent Systems",
      "Shadow Collective"
     ]
    }
   ]
  }
 ],
 "content": "Pre Vizsla  was a human male Mandalorian warrior who was a descendant of Tarre Vizsla and led a terrorist organization, known as Death Watch, during the final years of the Galactic Republic. Formerly the governor of Concordia, Vizsla longed to restore the warrior heritage of his homeworld, the planet Mandalore, by overthrowing Duchess Satine Kryze's pacifist regime. Drawing on the support of his Mandalorian commandos, Vizsla made his bid for power during the galaxy-wide Clone Wars but failed several times in his efforts to conquer Mandalore. Following his failed alliance with the Confederacy of Independent Systems, however, Vizsla joined the renegade Sith Lord Maul's Shadow Collective. As a result of their pact, he ultimately succeeded in taking over Mandalore with widespread public support following the collapse of order and stability due to Maul's machinations.\nHaving achieved his goal, Vizsla turned against Maul, leading to a lightsaber duel to the death. In the end, Vizsla was defeated and executed by Maul, who claimed his one-time ally's weapon—the Darksaber, a Jedi-Mandalorian relic of Clan Vizsla—and therefore leadership over all Mandalorians. Despite Maul's victory, his claim was opposed by one of the late Vizsla's lieutenants, Bo-Katan Kryze, who refused to accept an outsider as her leader. This act tore Death Watch asunder between Kryze's supporters and those who declared their loyalty to Maul, becoming known as his Mandalorian super commandos.\n\nSeeking to overthrow Duchess Satine Kryze and her pacifistic government, in order to restore Mandalore to its warrior past, Vizsla secretly allied himself with Count Dooku and his Confederacy of Independent Systems. While governing Mandalore's moon, Concordia, and maintaining loyalty to Kryze in public, Vizsla led Death Watch in secret from several Concordian mining camp bases. Death Watch's attack on a Jedi Cruiser and terrorist attacks on Mandalore came to a head when Jedi Master Obi-Wan Kenobi arrived on Concordia with Kryze to follow leads on Death Watch. When Kenobi discovered Death Watch's secret base, Vizsla revealed himself as the renegades' leader. He then addressed Kenobi, proclaiming that Kryze tarnished the Mandalorian people with her peace-seeking government. Returning Kenobi's lightsaber, which his men confiscated earlier during the Jedi's capture, Vizsla drew the Darksaber and explained some of its history before attacking Kenobi. Confident that he would be able to best the Jedi Master, Vizsla was quickly proven to be no match for him and was quickly forced onto the back foot, first by a Force-push that sent him hurling backwards several meters and then with a kick that knocked the Darksaber out of his grip. Vizsla continued his assault on Kenobi, who used unarmed combat techniques to create a temporary gap in the fighting to receive his fallen lightsaber.\nThis time, Vizsla used his jetpack to employ greater altitude in flight, but Kenobi simply jumped and intercepted him in the air, battering him toward the ground. Defeated, he decided to have his warriors finish the Jedi Master themselves. The three Death Watch members each fired a missile from their jet packs, but Kenobi and Satine retreated by jumping through a mine-shaft to avoid the explosives. The three warriors inspected the damage and told Vizsla if they can still go after Kenobi. However, Vizsla ordered them not to, since there wasn't time, but noted they will catch up with the Duchess soon enough.\nVizsla conspired with Mandalorian Senator Tal Merrik to capture Kryze during her journey to Coruscant, where she intended to plead her case directly to the Galactic Senate, but Merrik was defeated before he could complete his assignment. Amassing an army of Death Watch troops on Concordia in preparation to take over Mandalore, Vizsla was forced to wait until his and Dooku's plot to turn Mandalore against the Republic was completed. Vizsla dispatched an assassin to Coruscant to kill Kryze, as her death would remove the opposition to the Senate's upcoming vote to have Republic troops occupy Mandalore—an occupation which would allow Death Watch to gain the support of Mandalore's populace and \"liberate\" them from the Republic. However, the assassin failed to murder Kryze, and the plot itself fell through, with the Senate voting against occupying Mandalore. With this turn of events, Vizsla was forced to postpone his attack on Mandalore, as his forces would be unable to hold the planet without its people's support.\nFollowing the aborted takeover of Mandalore, Vizsla then met with Dooku. During this meeting, Vizsla was betrayed by Dooku and scarred across his cheek by the Sith Lord's lightsaber. Vizsla then broke ties with the Confederacy and vowed to kill Dooku.\n\nVizsla and Death Watch maintained a small base on the world Carlac, but the once strictly regulated army now was merely a group of ruthless outlaws. where they committed dishonorable acts against its native species, the Ming Po, forcing their women to work for them. Eventually Lux Bonteri, in an attempt take revenge against Count Dooku for death of his mother, Senator Mina Bonteri, allied himself with Vizsla. Death Watch used Bonteri to attempt to find and assassinate Dooku, but were unsuccessful. When Bonteri traveled to Carlac to meet with them, he brought along the Jedi Ahsoka Tano, who was disguised as Bonteri's close friend.Shortly after meeting with Bonteri, Vizsla was then confronted by the Ming Po elders who had demanded the return of their women. At first they complied, but Vizsla showed his true colours the next day when he attempted to murder the Ming Po chieftain with the Darksaber, caring not when the man's innocent granddaughter threw herself in front of him and took the blow instead, before ordering the village burned to the ground. However, Tano revealed herself as a Jedi, taking out several Death Watch members before being subdued. Upon return to Death Watch camp, Vizsla expressed his disappointment in Bonteri for bringing a Jedi. Despite Bonteri convincing him to spare her, Vizsla was adamant to execute her. Bonteri accused Vizsla of murderous dishonor before the latter retorted to the young boy that he was no different with his bloodlust towards Count Dooku. Bonteri insisted that he wanted justice, not revenge, yet Vizsla would not have it. Vizsla then stated like Bonteri wanting justice for his mother's death, Vizsla would kill Tano for the Jedi Order's supposed crimes against Mandalore, which in Vizsla's eyes, was justice as well. Before Vizsla could kill Tano, R2-D2 entered the hut, creating a distraction and arming Tano with her lightsabers. After freeing herself and decapitating four Death Watch soldiers who restrained her, she then dueled Vizsla for a time; but after the Jedi's saber caused Vizsla's jetpack to explode, she and Bonteri escaped.\n\nFollowing the events on Carlac, Vizsla and Death Watch established a camp on the swamp moon Zanbar, and once again set about plotting the downfall of Duchess Satine, and the restoration of the Mandalorian's warrior creed.Later, Vizsla and his soldiers came across an escape pod lost in deep space which held the stranded former Sith Lord Maul and his brother Savage Opress. His second-in-command, Bo-Katan Kryze, suggested they kill the two, but Vizsla decided to spare them and bring them back to Zanbar. Later, when Vizsla spoke with Maul, he realized they harbored a common hatred of Obi-Wan Kenobi for his actions against them, they planned on having their revenge after their planned conquest of Mandalore. Gathering an army of criminals including the Hutts, the Pykes, and the Black Sun, the two became the joint leaders of the Shadow Collective. However, once Maul revealed his intention to build a criminal empire, Vizsla secretly planned to betray his Sith allies after conquering Mandalore.\nThe criminal alliance attacked the capital, allowing Death Watch to act as heroes to a desperate population after the Duchess's forces failed to stop the criminals. With the support of the Mandalorian people, Vizsla ousted Satine and appointed himself Prime Minister, also assuming the title of Mand'alor. When Maul proposed to spread their success to the other neutral systems, Vizsla informed him that he had no intention of doing so, and that he would still honor their agreement about removing Kenobi, but that Maul would have to submit to his rule. Vizsla then had his warriors imprison Maul and Opress. After the Sith managed to escape, Maul challenged Vizsla to a duel to determine the true ruler of the Mandalorians. Vizsla was skilled, but eventually bested by Maul. After a long and difficult duel, Vizsla accepted his defeat and told Maul that like he said, only the strongest should rule, and closed his eyes as Maul publicly beheaded him in front of Death Watch with his own Darksaber, before claiming his position as leader of Death Watch.\nAfter his death, Vizsla was succeeded by the former Prime Minister Almec, whom Maul reinstated as a puppet leader. Almec would declare in front of the people that Vizsla had been murdered by Duchess Satine Kryze, and that the people of Mandalore would remember him as a hero who had saved them in time of need while Kryze had fled. The majority of Death Watch pledged loyalty to Maul, but because he was not a Mandalorian, Bo-Katan Kryze and the Nite Owls refused to follow him and would eventually ignite another Mandalorian civil war.\nAs a Mandalorian warrior, Vizsla had advanced training in many forms of combat from ranged weaponry to hand-to-hand combat. A skilled unarmed combatant, Vizsla was able to compete with Obi-Wan Kenobi and Maul in his duels with the two Force-wielding warriors. Vizsla was also a highly capable marksman, even able to shoot the lightsaber out of Maul's hand in their bout. In addition to his unarmed and ranged abilities, Vizsla had at least some degree of training with the Darksaber and was skilled enough to keep even a Jedi at bay.\nVizsla wore the traditional and resilient combat armor of the Mandalorian warriors. This armor was equipped with dual antennas, a jetpack variant, magnetized boots, and a pair of Mandalorian vambraces. Vizsla's vambraces were equipped with at least paired blaster barrels, a flamethrower, whipcord thrower, and a launcher that fired disc-shaped buzz saws. Before Death Watch was exiled, he wore a cape with a shriek-hawk sigil, which was the symbol for his House.\nIn addition to his armor, Vizsla wielded a pair of WESTAR-35 blaster pistols and the Darksaber, a legendary lightsaber created by his ancestor Tarre Vizsla that had been used by his clan and House to rule all of Mandalore long ago.\nThe character of Pre Vizsla was created for the Star Wars: The Clone Wars television series and first appeared in the series' 2010 second season after being mentioned in several issues of the Star Wars Insider magazine. He was featured as the primary antagonist of the episodes \"The Mandalore Plot,\" \"Voyage of Temptation,\" and \"Duchess of Mandalore,\" all of which formed a story arc centered around the Mandalorians in the series. Vizsla was voiced in his television appearances by American actor Jon Favreau, the director of the popular Iron Man film series, and later the creator of the first live-action Star Wars television series The Mandalorian. His role in portraying Vizsla marked his first contribution to Star Wars canon. Favreau was recruited for the part by Series Director Dave Filoni. According to an interview with Filoni that was featured in Star Wars Insider 115, the name \"Pre\" is a title of stature, like \"pre-eminent,\" while the \"Vizsla\" name came from Tor Vizsla, the original leader of Death Watch who was featured in the 2002 Jango Fett: Open Seasons comic book series. Vizsla was given an entry in the The Clone Wars Character Encyclopedia book, released in June 2010. He was also featured in Hasbro's 2010 toy figure line.\nA concept art model sheet that was published in Star Wars Insider 116 indicated that Vizsla's name was originally spelled \"Visla.\" On the same model sheet, the symbol on his cape was depicted as the Mythosaur, suggesting that the symbol was originally that of the Mandalorians and was adjusted to the shriek-hawk for the final version of \"The Mandalore Plot.\" Because \"Voyage of Temptation\" was produced with the television series' first season, well before the other installments in the Mandalorian story arc, the character model used for Vizsla in the episode was based on the Phase I clone trooper armor design—disguised only by his serape—instead of the finalized character design used in the later episodes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pre_Vizsla",
  "/wiki/Pre_Vizsla/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Pre_Vizsla",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Mandalore",
  "/wiki/19_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/House_Vizsla",
  "/wiki/Clan_Vizsla",
  "/wiki/Death_Watch",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Shadow_Collective",
  "/wiki/Mandalorian",
  "/wiki/Soldier",
  "/wiki/Tarre_Vizsla",
  "/wiki/Terrorist",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Governor",
  "/wiki/Concordia",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/New_Mandalorians",
  "/wiki/Commando",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Lightsaber_duel",
  "/wiki/Death",
  "/wiki/Lightsaber",
  "/wiki/Darksaber",
  "/wiki/Jedi",
  "/wiki/Mand%27alor",
  "/wiki/Lieutenant",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Mandalorian_civil_war_(Clone_Wars)",
  "/wiki/Nite_Owls",
  "/wiki/Mandalorian_super_commando",
  "/wiki/File:AgainstTheJedi-TMP.ogg",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Moon",
  "/wiki/Mining",
  "/wiki/Concordian_mines",
  "/wiki/File:Kenobi_vs_Vizsla.jpg",
  "/wiki/Attack_on_a_Republic_cruiser",
  "/wiki/Bombing_of_the_Memorial_Shrine",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Deathwatch_hideout",
  "/wiki/Force-push",
  "/wiki/Jetpack",
  "/wiki/File:VizslaArmy.png",
  "/wiki/Senator",
  "/wiki/Tal_Merrik",
  "/wiki/Coruscant",
  "/wiki/Galactic_Senate",
  "/wiki/Skirmish_aboard_the_Coronet",
  "/wiki/Army",
  "/wiki/Plot_to_assassinate_Satine_Kryze",
  "/wiki/Assassin",
  "/wiki/Mandalore_Defense_Resolution",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Dooku%27s_lightsaber",
  "/wiki/Carlac",
  "/wiki/Ming_Po",
  "/wiki/Lux_Bonteri",
  "/wiki/Mina_Bonteri",
  "/wiki/Ahsoka_Tano",
  "/wiki/File:VizslaDuelsAhsokaOnCarlac-AFIN.jpg",
  "/wiki/R2-D2",
  "/wiki/Zanbar_Death_Watch_camp",
  "/wiki/Zanbar",
  "/wiki/File:UneasyAlliance-Eminence.png",
  "/wiki/Escape_pod",
  "/wiki/Savage_Opress",
  "/wiki/Hutt",
  "/wiki/Pyke_Syndicate",
  "/wiki/Black_Sun",
  "/wiki/File:VizslaByeBye.jpg",
  "/wiki/Prime_Minister",
  "/wiki/Almec",
  "/wiki/File:Pre_vs_Maul-SOR.png",
  "/wiki/Hand-to-hand_combat",
  "/wiki/The_Force",
  "/wiki/File:Pre_Vizsla_Helmets.jpg",
  "/wiki/Mandalorian_armor",
  "/wiki/Magnet",
  "/wiki/Mandalorian_vambrace",
  "/wiki/Blaster",
  "/wiki/Flamethrower",
  "/wiki/Whipcord_thrower",
  "/wiki/Cape",
  "/wiki/Shriek-hawk",
  "/wiki/Sigil",
  "/wiki/WESTAR-35_blaster_pistol",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/2010",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Mandalore_Plot",
  "/wiki/Voyage_of_Temptation",
  "/wiki/Duchess_of_Mandalore",
  "/wiki/Jon_Favreau",
  "/wiki/The_Mandalorian",
  "/wiki/Star_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/Ready_for_Battle!",
  "/wiki/Star_Wars_Insider_115",
  "/wiki/Tor_Vizsla",
  "/wiki/2002",
  "/wiki/Jango_Fett:_Open_Seasons",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Clone_Wars_Character_Encyclopedia",
  "/wiki/Hasbro_Inc.",
  "/wiki/File:Serape.jpg",
  "/wiki/The_Art_of_Mandalore",
  "/wiki/Star_Wars_Insider_116",
  "/wiki/Mythosaur",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/A_Friend_in_Need",
  "/wiki/Eminence_(episode)",
  "/wiki/Shades_of_Reason",
  "/wiki/The_Lawless",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Pre_Vizsla",
  "/wiki/Category:Images_of_Pre_Vizsla",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Man_from_Mandalore",
  "/wiki/Star_Wars_Insider_193",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars_-_The_Official_Magazine",
  "/wiki/Star_Wars_-_The_Official_Magazine_101",
  "/wiki/Database",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Star_Wars_Inside_Intel:_Mandalorian_Armor",
  "/wiki/Databank_(website)",
  "/wiki/1032_BBY",
  "/wiki/1_BBY",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Protector_of_Concord_Dawn",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Art_History",
  "/wiki/Trials_of_the_Darksaber",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore"
 ]
}