{
 "name": "Prengahl_Kreen",
 "display_name": "Prengahl Kreen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Prengahl Kreen was a male Twi'lek arms dealer operating in the Empartheca system.\nKreen was very successful as an arms dealer and was one of the best in the region of the Outer Rim Territories that he operated in. He was able to provide almost any weapon that his customers wanted through his vast number of contacts that he had in various star systems. Rumors floated around about him associating with the Rebel Alliance, but he denied these accusations and the Alliance High Command did not either confirm or deny that they were supplied by him.\nPrengahl Kreen made his home in his hidden base on the planet Breshkall at the end of the Enarc Run. It was a refuge for him and his family along with his assorted servants, close friends and associates. He did not accept uninvited guests at his home and he did not do business there. It was rumored that his base was a floating fortress, but this was unconfirmed.\nKreen was known for his bargaining skills, and for never breaking a contract. When he was selling weapons, he wore a business suit and carried a datapad. He also had a heavy blaster pistol on his person for self defense. Kreen also was proficient in various types of weaponry, such as missile weapons, blasters, and various archaic weaponry.\nPrengahl Kreen was a gamemaster character in the West End Games supplement Heroes \u0026 Rogues.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Empartheca_system",
  "/wiki/Arms_dealer/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Breshkall",
  "/wiki/Enarc_Run/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/West_End_Games",
  "/wiki/Heroes_%26_Rogues"
 ]
}