{
 "name": "Priban",
 "display_name": "Priban",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Fex"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kelen Biolabs"
     ]
    }
   ]
  }
 ],
 "content": "Priban was a male Bith scientist who worked for the biotech company Kelen Biolabs during the Galactic Civil War. Shortly after the Battle of Yavin, he traveled as part of a collection crew for the Biolabs to the moon Fex in the Sha Qarot system, located in the Deep Core, to survey and find possible valuable biological samples. Once on the moon, he and two other members of the team disembarked from their starship the Harvester and began investigating Fex's wildlife. However, the trio were soon ambushed by the previously undiscovered apex predators of the moon, the Fexian skullborers, which quickly killed him and another compatriot before Hafner could stun them. They made recording valuable information with the holocam in their helmets. Before the Harvester could pick them up though, the Bith was attacked and killed by the skullborers, and his recordings were returned to Kellen Biolabs. The recordings were later viewed by the rebels Luke Skywalker and Nakari Kelen after they were sent on a follow up collection mission to the moon.\nWhile on Fex, Priban wore an armor suit with heavier protection around the head and shoulders. The suit included gloves and a helmet which was capable of recording video and communication with the Harvester. He also carried a blaster with a stun setting.\nPriban first appeared as a hologram in Heir to the Jedi, a canon novel written by Kevin Hearne and published in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/0_ABY",
  "/wiki/Fex",
  "/wiki/Bith",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kelen_Biolabs",
  "/wiki/Scientist",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Yavin",
  "/wiki/Moon",
  "/wiki/Sha_Qarot_system",
  "/wiki/Deep_Core",
  "/wiki/Starship",
  "/wiki/Harvester_(XS-800)",
  "/wiki/Fexian_skullborer",
  "/wiki/Death",
  "/wiki/Hafner",
  "/wiki/Stun",
  "/wiki/Holocam",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Luke_Skywalker",
  "/wiki/Nakari_Kelen",
  "/wiki/Mission_to_Fex",
  "/wiki/Armor",
  "/wiki/Glove",
  "/wiki/Blaster",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/Kevin_Hearne",
  "/wiki/2015",
  "/wiki/Heir_to_the_Jedi_(audiobook)"
 ]
}