{
 "name": "Pride_Aully",
 "display_name": "Pride Aully",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    }
   ]
  }
 ],
 "content": "Pride Aully was a humanoid scoundrel. Aully participated in a sabacc game on the planet Numidian Prime in 10 BBY, where the outlaw Han Solo won the starship Millennium Falcon from the gambler Lando Calrissian.\nAully was active years later, during the war between the First Order and the Resistance, and sought to buy a Z-6 jetpack. After hearing that such a jetpack could be found at Black Spire Outpost on the planet Batuu, Aully contacted a visitor to the town, requesting confirmation. The visitor investigated, confirming Aully's information, and the scoundrel intended to travel to Batuu to retrieve the jetpack.\nIn 10 BBY, Aully was present at a jungle outpost on the planet Numidian Prime, taking part in a game of sabacc alongside the gambler Lando Calrissian. During the game, the scoundrels Han Solo and Chewbacca, who had previously hired the gambler and his starship, the Millennium Falcon, as part of a heist, entered the outpost in search of Calrissian.\nCalrissian left the table to greet his former associates, who challenged the gambler to a game of sabacc. Aully spectated the sabacc game, during which Solo won the Millennium Falcon from Calrissian. Following the game, Aully and the other gamblers that had been present later told different accounts of the events, with each spectator emphasizing different details, though their accounts all agreed on the game's final moments.\nAround forty-four years later, during the war between the First Order and the Resistance, Aully wished to acquire a Z-6 jetpack, having heard that one could be found at the business Outer Rim Expedition and Supply in the town of Black Spire Outpost on the planet Batuu. Wanting to verify that the jetpack was available before flying to Batuu, Aully contacted a visitor to Black Spire Outpost, requesting confirmation. The visitor investigated the business' supply of crates and determined that Aully's information was correct. Aully thanked the visitor with a transfer of one hundred credits, intending to contact the business owner Kasif about collecting the jetpack.\nAully was a humanoid individual who was a self-proclaimed scoundrel. On Numidian Prime, Aully and the other gamblers were disgruntled while facing Calrissian in sabacc. Calrissian perceived his fellow gamblers to be ill-tempered and menacing. When searching for a Z-6 jetpack, Aully refused to put in the effort to travel to Batuu without knowing whether one was available there.\nAully wore red armor, a face-concealing helmet, and black gloves. Aully wished to acquire a Z-6 jetpack from Black Spire Outpost, and would not settle for any other model.\nPride Aully first appeared in the 2018 Anthology film, Solo: A Star Wars Story. The character's name was first revealed in Star Wars: Datapad, the mobile app companion to the Star Wars: Galaxy's Edge theme park land, which opened to guests at Disneyland Park and Disney's Hollywood Studios Park in 2019. Aully's armor was depicted as being entirely white in Star Wars: Solo Graphic Novel Adaptation, written by Alessandro Ferrari, illustrated by Roberto Santillo, and published by IDW Publishing on March 26, 2019. The chest armor worn by Aully in Solo was reused for the character Plesko Marno in the 2019 sequel trilogy film Star Wars: Episode IX The Rise of Skywalker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Humanoid",
  "/wiki/Sabacc",
  "/wiki/Planet",
  "/wiki/Numidian_Prime",
  "/wiki/10_BBY",
  "/wiki/Han_Solo",
  "/wiki/Starship",
  "/wiki/Millennium_Falcon",
  "/wiki/Gambler",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Standard_year",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Z-6_jetpack",
  "/wiki/Jetpack",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Batuu",
  "/wiki/City",
  "/wiki/Jungle_outpost",
  "/wiki/Chewbacca",
  "/wiki/Gender",
  "/wiki/Raid_on_Kessel",
  "/wiki/34_ABY",
  "/wiki/Outer_Rim_Expedition_and_Supply",
  "/wiki/Credit",
  "/wiki/Kasif",
  "/wiki/Color",
  "/wiki/Armor",
  "/wiki/Helmet",
  "/wiki/Glove",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/2019",
  "/wiki/Star_Wars:_Solo_Graphic_Novel_Adaptation",
  "/wiki/Alessandro_Ferrari",
  "/wiki/IDW_Publishing",
  "/wiki/March_26",
  "/wiki/Plesko_Marno",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Category:Images_of_Pride_Aully",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/File:PrideAullyMission-GEDatapad.jpg",
  "/wiki/File:PrideAullyConv-GEDatapad.png",
  "/wiki/File:PrideAullyConv2-GEDatapad.jpg",
  "/wiki/File:PrideAullyConv3-GEDatapad.jpg",
  "/wiki/File:PrideAullyComplete-GEDatapad.jpg",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Databank_(website)",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Battle_of_Batuu",
  "/wiki/Standard_month",
  "/wiki/Hosnian_Cataclysm"
 ]
}