{
 "name": "Primor  (Inleshat)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Iskalon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Iskalon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Inleshat"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The School"
     ]
    }
   ]
  }
 ],
 "content": "Primor was a male Inleshat who was the leader, or \"The First to Swim,\" of the Iskalonian School on Iskalon in 3 ABY. A calm leader who prided himself on knowing his people's inclinations, Primor presided over the School during the Galactic Empire's brutal subjugation of the Iskalon system during the Galactic Civil War—although Primor had Rebel leanings, the Empire's war crimes on nearby Telfrey and Gamandar cowed him into submission. Nevertheless Primor reluctantly sanctioned a Rebel operation on Gamandar in 3 ABY, only to die when Imperial forces triggered a massive tidal wave on Iskalon known as the Iskalon effect.\nA male Inleshat—an aquatic species that formed part of the Iskalonian School on the water-covered planet Iskalon—Primor became the School's leader, or \"The First to Swim,\" by the Galactic Civil War. Primor had a son, Mone, who was full-grown and married to a female named Kendle by 3 ABY, by which time the Galactic Empire had established a presence in the Iskalon system, after Rebel pilots Tay Vanis and Yom Argo, natives of nearby Telfrey, returned to their home system to foment rebellious sentiment. The Empire responded by rendering Telfrey uninhabitable, brutally subjugating neighboring Gamandar and occupying Iskalon itself, forcing Primor to accept a stormtrooper presence on his world.\nArgo and Vanis disappeared soon after, leading a Rebel team—led by Lando Calrissian, an old acquaintance of Primor's—to travel to Iskalon to investigate. Although they had previously learned Argo had perished in a crash on Lahsbane, they held hope that Vanis could still be alive. The Empire's tactics had instilled a deep fear in Primor, who attempted to convince Calrissian and his friends not to travel to Gamandar to attempt to find Vanis, but he reluctantly saw them off when Mone insisted he would travel with them. With Calrissian having only taken Mone and the Wookiee Chewbacca with him, Primor instead occupied his time with introducing their other two Human companions, Rebel leaders Luke Skywalker and Leia Organa, to the School's underwater way of life. However, unbeknownst to Primor, his daughter-in-law Kendle was an Imperial collaborator—after she informed Imperial Admiral Griggor Tower that Rebel agents were en route to Gamandar, he fired a missile into the Iskalon seas and triggered the Iskalon effect, a massive tidal wave that devastated the planet and killed Primor.\nA friendly man welcoming to outsiders, Primor took joy in showing the wonders of Iskalon to visitors, and introducing them to the School's lifestyle. Although Primor was the leader of the School, he bucked against any aspersions that he was a monarch—to him, his leadership came from being in tune with the wants and desires of the people, not from his title. Primor supported the Rebellion, but the Empire's incredibly violent subjugation of the Iskalon system succeeded in cowing the Inleshat, who feared to go against their occupiers. Most of all, he feared for his son Mone, whom he saw as a foolish pleasure-seeker without a real understanding of the consequences of rebellion.\nPrimor first appeared in Star Wars  74, written by Mary Jo Duffy, illustrated by Ron Frenz and released in 1983.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Primor",
  "/wiki/Iskalon/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Inleshat",
  "/wiki/Gender/Legends",
  "/wiki/The_School",
  "/wiki/Iskalonian",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Iskalon_system",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Telfrey",
  "/wiki/Gamandar",
  "/wiki/Death/Legends",
  "/wiki/Iskalon_effect",
  "/wiki/Species/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mone",
  "/wiki/Marriage/Legends",
  "/wiki/Kendle",
  "/wiki/Pilot/Legends",
  "/wiki/Tay_Vanis",
  "/wiki/Yom_Argo",
  "/wiki/Telfrey_Holocaust",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Lahsbane/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Human/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Admiral/Legends",
  "/wiki/Griggor_Tower",
  "/wiki/Missile/Legends",
  "/wiki/Star_Wars_(1977)_74",
  "/wiki/Mary_Jo_Duffy",
  "/wiki/Ron_Frenz",
  "/wiki/1983",
  "/wiki/Star_Wars_(1977)_75",
  "/wiki/Star_Wars_(1977)_76",
  "/wiki/Star_Wars_(1977)_82",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Magazine_3",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}