{
 "name": "Pritch",
 "display_name": "Pritch",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Baras"
     ]
    }
   ]
  }
 ],
 "content": "Pritch was a Human male who served as a Commander in the Imperial Army\nof the reconstituted Sith Empire, during the Cold War with the Galactic Republic. Pritch was Darth Baras's minion and was stationed in Dromund Kaas's jungles, overseeing the Dromund Kaas slave rebellion.\nA male Human, Pritch served in the Imperial Army of the Sith Empire during the time of the Cold War, a proxy conflict between the Empire and the Galactic Republic. During the Dromund Kaas slave rebellion, he was stationed near the Unfinished colossus under the command of the Sith Lord Darth Baras, the secret architect of the revolt.\nAround 3643 BBY, Darth Baras assigned his new apprentice to Pritch for a mission in Dromund Kaas' jungles. There, Pritch requested the assistance of the Sith apprentice to eliminate several slave captains who threatened to reveal Darth Baras' role in the slave rebellion unless they were supplied with better weaponry. After disposing of several rebel leaders, the Apprentice returned to Pritch who thanked him for his service.\nCommander Pritch first appears in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare. In the game, Pritch is featured on Dromund Kaas during the Sith Warrior's class quest \"Pull the Plug\". During the mission, the player has either the option of killing the slaves or finding evidence to blackmail the slave captains of their involvement in selling their own people back into slavery, an idea Pritch offers as an alternative to killing them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Army_(Sith_Empire)",
  "/wiki/Darth_Baras",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Commander/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Jungle/Legends",
  "/wiki/Dromund_Kaas_slave_rebellion",
  "/wiki/Time/Legends",
  "/wiki/Unfinished_colossus",
  "/wiki/Sith_Lord/Legends",
  "/wiki/3643_BBY",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Captain/Legends",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Sith_Warrior",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}