{
 "name": "Probus Tesla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "18 BBY",
      "Kantaros Station"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red strip"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireInquisitorius",
      "Inquisitorius"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kuthara",
      "Darth Vader"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Renefra Ren"
     ]
    }
   ]
  }
 ],
 "content": "Probus Tesla was a Human male Corellian who served as an Imperial Inquisitor assigned to find Jax Pavan and I-5YQ. He was wounded in a battle with untrained Force adept Kajin Savaros when Savaros threw a ball of condensed repulsor energy at him.\nTesla later faced off against Savaros again, and was again wounded. He was present at the confrontation between Darth Vader and Jax Pavan's team. He escaped the destruction of the building in which the encounter took place.\nDiscovered to be Force-sensitive, Probus was selected to train as an Inquisitor by Darth Vader and became a disciple of Inquisitor Kuthara. Following his training, he didn't understand the duality of power, even though he knew the definition. His master felt the incompetence of his profession as a student. After some time, Probus defeated his master, and eventually become one of the best Inquisitors. He was later assigned to search for Jedi Knight Jax Pavan. Searching every sector on Coruscant, Probus was getting closer to detect the Jedi, but received a call from the Sith's priority to search for a droid named I-Five. Probus believed that it should be a trivial task to some simple, but Vader assured him that the robot is more dangerous.\nWhile he continued his search in the market, Probus encountered a young boy named Kajin Savaros and sensed great potential power within him. Kajin made a run for it, but Probus couldn't let him get away, but before he could catch him, one of the field generators caused an explosion that stunned and burned Probus which allowed Kajin to escape. Probus survived the blast, but suffered numerous injuries that required to spend many hours in a bacta tank. During his healing treatment, Probus vowed to hunt down Pavan and the boy. However, Vader lost confidence in his strength and sent him two other Inquisitors named Yral Chael and Mas Sirrah to assist him.\nTogether, they started their search for the Jedi once more. However, when they stumbled across the Jedi's companions. After Yral was killed by I-Five, Probus was taken on goal by Kajin, but suffered a minor chest injury. When Tesla was hiding in the rubble to slightly heal his wounds, he didn't wait until his presence was detected and fled from the battle to report to Vader. After setting a trap, Tesla and Darth Vader extract ingested bots, which resulted in a significant increase in its power. A side effect was that it began to spread uncontrolled destruction. Pavan, seeing that the Sith Lord wanted to kill him, engaged Probus in a lightsaber duel. At the end of the fight, Probus was defeated, but was able to escape the destruction of the building.\nTesla fought with Jax Pavan in a brief lightsaber duel, and was about to win. However, Sacha activated a red Sith lightsaber behind him, and killed him. Pavan and Sacha dragged Tesla's body out of the hallway, and left it hidden from view in the medbay.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Last_Jedi_(novel)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Probus_Tesla",
  "/wiki/Corellia/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Kantaros_Station",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Kuthara",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Renefra_Ren",
  "/wiki/Corellian/Legends",
  "/wiki/Jax_Pavan",
  "/wiki/I-5YQ",
  "/wiki/Duel_near_Ploughtekal_Market",
  "/wiki/The_Force/Legends",
  "/wiki/Force_Adept",
  "/wiki/Kajin_Savaros",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Duel_at_Rainbow_Parkway_and_Gallery_Row",
  "/wiki/Battle_in_the_Imperial_Security_Bureau",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/I-Five",
  "/wiki/Yral_Chael",
  "/wiki/Mas_Sirrah",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_lightsaber/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Probus_Tesla",
  "/wiki/Coruscant_Nights_III:_Patterns_of_Force",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}