{
 "name": "Progenitor",
 "display_name": "Progenitor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Manaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Proto-firaxan shark"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "The Progenitor was a massive female firaxan shark that lived in the Hrakert Rift of Manaan. She was believed to be somehow responsible for producing kolto, and was the center of intense spiritualism by the Selkath, who believed her to be the ancestor of their species—which she possibly was. The Selkath also believed her to be the guardian of kolto. The Progenitor's immense size and strange capabilities seemed to be linked to the Star Map she swam about, which may have mutated her with the Force, as the Rakata were notorious for influencing the growth of planets and species. However, some scientists believed that she had reached her large size from feeding on kolto, which meant that she must have lived for a very long time.\nWhen the Galactic Republic established an undersea outpost within the Hrakert Rift, the Progenitor went berserk as the scientists began to harvest her precious kolto. The firaxan sharks, believed to be her children, began attacking the station, and a strange phenomenon initiated by their mother drove the Selkath scientists to insanity, causing them to attack and eat everyone around them.\nOnce distress calls were sent from the underwater base, the call was answered by the Jedi Revan. After fighting his way through the murderous Selkath, he discovered a fanatical scientist named Kono Nolan had worked on a poison which in theory could kill the Progenitor, but his assistant Sami believed that doing so would pollute the waters of Manaan in ways that might never be corrected.\nFollowing Sami's advice, Revan destroyed the kolto harvesting machine, and the Progenitor immediately calmed down, even allowing him to approach the Star Map.\nIf Revan chooses the dark side option, he instead pumps the toxin given to him through the ventilation system of the kolto harvesting machine, killing the Progenitor, polluting the waters of Manaan, and destroying all kolto on the planet that had not been harvested. In-game, the prices of medical equipment rise. Revan is also banned from Manaan for destroying the kolto, unless the player chooses the right responses to successfully blackmail the judges and avoid banishment. Also, if the player immediately admits to it, he or she will be executed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/Manaan/Legends",
  "/wiki/Firaxan_shark",
  "/wiki/Gender/Legends",
  "/wiki/Hrakert_Rift",
  "/wiki/Kolto/Legends",
  "/wiki/Selkath/Legends",
  "/wiki/Species/Legends",
  "/wiki/Star_Map",
  "/wiki/The_Force/Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hrakert_Station",
  "/wiki/Jedi/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Kono_Nolan",
  "/wiki/Sami_(Human)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Wizards.com",
  "/wiki/Creatures_of_KOTOR_1:_Firaxa_and_Gizka"
 ]
}