{
 "name": "Progga",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "27 BBY",
      "Unknown Regions"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Progga, also known as Progga the Hutt, was a male Hutt who was a minor crime lord and pirate. From the edge of the Unknown Regions, Progga was active during the last years of the Galactic Republic. In 27 BBY, Progga, aboard his starship, ambushed the smuggling freighter Bargain Hunter in the Outer Rim, hoping to steal the Bargain Hunter's cargo of rare furs and firegems. The Bargain Hunter fled into hyperspace, and Progga gave chase, eventually following the freighter to a remote star system in the Unknown Regions. However, when Progga finally trapped the Bargain Hunter in the system, Picket Force Two of the Chiss Ascendancy Expansionary Fleet attacked both parties. Progga's starship attempted to engage the new interlopers, but the Chiss forces proved too powerful, and the Hutt's starship was destroyed, killing Progga.\nOriginating from the fringes of the galaxy's Unknown Regions, Progga the Hutt was a temperamental pirate and minor crime lord who was active as of 67 BBY, during the waning days of the Galactic Republic. During this time Progga formed a rivalry with fellow Hutt crime lord Drixo. As a result, in 27 BBY, Progga and his crew, aboard Progga's starship, attempted to hijack the smuggling freighter Bargain Hunter in the Outer Rim Territories. Drixo hired the Bargain Hunter, captained by the Human Dubrak Qennto, to transport a cargo of rare furs and firegems to the planet Comra.\nWith Progga's starship firing on the smuggling freighter, the Bargain Hunter made a short jump into hyperspace, hoping to flee Progga's ambush. However, the Hutt pirate pursued the Bargain Hunter and continued his assault once the freighter had exited hyperspace. Desperate to escape, the Bargain Hunter made another jump into hyperspace, and Progga again followed the smugglers. During the resulting four-hour jump, both starships left the Outer Rim Territories, passed through the region known as Wild Space, and exited in the edges of the Unknown Regions.\nAfter leaving hyperspace Progga tracked the Bargain Hunter to a nearby star system, where the freighter was trapped, its hyperdrive unresponsive. Because the system was the only one in the area, Progga came to the conclusion that Qennto had fled to this system because the smuggler had hidden a treasure hoard there, believing no one would find it. The Hutt hailed the Bargain Hunter, demanding to know where Qennto had stashed his treasures; unbeknownst to Progga, the Bargain Hunter, in its haste to escape, had made a random jump and had emerged in that particular star system by happenstance.\nHowever, as Qennto tried to convince Progga that he did not have any base in the system, both ships were hit by large Conner nets, which released electromagnetic pulses designed to disable the vessels. While the attack knocked the Bargain Hunter out of commission, Progga's starship was built to resist the Conner nets, and the Hutt's starship turned to confront the beings who had launched the nets, Picket Force Two—composed of a cruiser and three fighter escorts—of the Chiss Ascendancy Expansionary Fleet. Progga ordered his crew to open fire on the Chiss cruiser, the Springhawk, and Chiss Force Commander Mitth'raw'nuruodo had his cruiser and two of his fighter escorts return fire. The Chiss numbers proved too overwhelming for the Hutt, and the pirate's starship was destroyed after six minutes of fighting, killing Progga in the process.\nA male Hutt, Progga was quick to anger and often did not think before acting; when attacked by the Chiss forces, instead of realizing that he was outnumbered and outgunned, Progga immediately engaged the Chiss, resulting in his death. Progga incorrectly assumed that the only reason Qennto would head to the Unknown Regions was because he had a secret treasure hoard there; it did not occur to Progga that Qennto had stumbled upon the star system by accident. The Hutt spoke Huttese but could understand Basic as well.\nProgga was created by author Timothy Zahn for his novel Outbound Flight, which was released on January 31, 2006.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/27_BBY/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Progga%27s_starship",
  "/wiki/Skirmish_between_Progga_and_the_Bargain_Hunter",
  "/wiki/Smuggler/Legends",
  "/wiki/Light_freighter/Legends",
  "/wiki/Bargain_Hunter",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Firegem",
  "/wiki/Hyperspace/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Unidentified_Unknown_Regions_star_system_(skirmish_between_Progga_and_Picket_Force_Two)",
  "/wiki/Star_system/Legends",
  "/wiki/Picket_Force_Two/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Chiss_Expansionary_Defense_Force",
  "/wiki/Skirmish_between_Progga_and_Picket_Force_Two",
  "/wiki/Starship/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/67_BBY",
  "/wiki/Standard_day/Legends",
  "/wiki/Time/Legends",
  "/wiki/Drixo",
  "/wiki/Captain/Legends",
  "/wiki/Human/Legends",
  "/wiki/Dubrak_Qennto",
  "/wiki/Planet/Legends",
  "/wiki/Comra/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Star/Legends",
  "/wiki/Conner_net",
  "/wiki/Electromagnetic_pulse/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Springhawk/Legends",
  "/wiki/Force_Commander",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Jorj_Car%27das",
  "/wiki/Huttese/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Timothy_Zahn",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/January_31",
  "/wiki/2006",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}