{
 "name": "Prosk",
 "display_name": "Prosk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Avesta Militia"
     ]
    }
   ]
  }
 ],
 "content": "Prosk was a male Weequay who lived on the planet Makeb where he worked as a mine foreman. When the Hutt Cartel attempted to take over Makeb, Prosk joined up with the Avesta family's militia who had sided with the Galactic Republic in an attempt to drive the Hutts off Makeb. Despite his inexperience with combat, Prosk was amongst militia forces sent to retrieve Lemda Avesta, one the Avesta family who had been investigating connections between the Hutts and a series of groundquakes that had occurred since their arrival. The militia was unable to get to her though as InterStellar Regulators, a mercenary group working for the Hutts, pushed them back to the landing zone in the Western Camps of the Frinn Mesa. There they held out until a Republic hero arrived to help get Avesta, at which point Prosk and Lane Ferow, another militia member, greeted the hero and asked for orders. Before the hero had a chance to give any, a group of Regulators attacked the landing zone, but the Militia and regulators held them off. Prosk and Ferow then gave the hero all the information they had on Lemda and her possible location so that she could be rescued. Prosk also asked that the hero save any other militia members who had been taken prisoner.\nProsk had little experience in combat but still joined up with Avesta's Militia to try and take back his home.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Avesta_Militia",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Planet/Legends",
  "/wiki/Makeb",
  "/wiki/Mining/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Conquest_of_Makeb",
  "/wiki/Avesta_family",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Lemda_Avesta",
  "/wiki/Groundquake/Legends",
  "/wiki/InterStellar_Regulators",
  "/wiki/Mercenary/Legends",
  "/wiki/Frinn_Mesa",
  "/wiki/Lane_Ferow",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}