{
 "name": "Proxima",
 "display_name": "Proxima",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Grindalid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "4.88 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Garavult Clan",
      "White Worms"
     ]
    }
   ]
  }
 ],
 "content": "Lady Proxima was a Grindalid female crime boss who operated out of a lair on Corellia during the Imperial Era and First Order-Resistance War. She was the leader of the White Worms, a group that took in young Corellians, their \"children,\" dubbing them \"scrumrats\" and giving them food and shelter in exchange for their participation in criminal activities on Lady Proxima's behalf. Han and Qi'ra were two of those children.\nLady Proxima was born on the planet Corellia. In her younger days during the High Republic Era, she was a member of the Garavult Clan. She joined several older Grindalids in helping to repel the Nihil raiders from Corellia around 230 BBY. During or prior to 24 BBY, she formed the White Worms.\nIn 13 BBY, Han was brought to Lady Proxima after a failing to claim coaxium. Proxima became angry because of his failure, and she ordered Rebolt to hit Han with his staff. Han blocked and grabbed the staff from Rebolt and said that he would hit back if threatened. Moloch then pulled out his blaster and pointed it at Han. Qi'ra ran in front of Moloch's blaster and suggested not to shoot at Han. After this, Han then grabbed a rock, which he first used in a bluff, trying to convince everyone in the room that it was a thermal detonator. Proxima was not fooled, calling Han's bluff and prompting him to throw the rock through a window, bringing sunlight pouring into the chamber, onto Proxima's face. This move left the left side of her face burned for years, and it caused her to retreat into the water. Han then took Qi'ra, escaped the White Worms and ran outside the den to escape on his M-68 landspeeder. Moloch, Rebolt, and several other members of the White Worms chased after Han and Qi'ra. They were able to capture Qi'ra but failed to capture Han.\nDoctor Chelli Aphra traveled to Corellia and convinced her ex, Sana Starros, to arrange a meeting between her and Proxima under the pretense of an introduction. However, Proxima had dealt with Aphra before, and was enraged by her arrival. Aphra presented Proxima a peace offering, seeking information regarding a Path engine.\nDuring the Galactic Civil War, Han returned to the planet Corellia with Chewbacca for parts for the Millennium Falcon. While talking with Em-Five, Moloch recognized Solo. Moloch captured Han and Chewbacca and brought them to Proxima. Proxima told Han he would be punished for failing to deliver her the coaxium he had failed to give to her in 10 BBY, and for scarring her face by exposing her to sunlight when he fled her. While Han was communicating with Proxima, Chewbacca gave Han a thermal detonator, which he used to detonate the window above her, exposing her to sunlight again. The sunlight permanently burned the right side of Proxima's face, and left her blind in her right eye. Han and Chewbacca then escaped and left Corellia after taking fire from Moloch.\nSometime after the Cold War, Bazine Netal arrived on Corellia to talk to Proxima about if she knew she had the location of the Millennium Falcon. Netal captured one of Proxima's most skilled White Worms children to force Proxima to talk about the Falcon. Proxima thus told Netal about the time when Han returned to Corellia for parts for the Falcon.\nAfter the story, Netal became unhappy at Proxima for not capturing the Falcon. Proxima gave advice to Netal that she should visit a man named Ducain on the planet Jakku. Ducain knew the location of the Falcon. Netal then left Proxima to find Ducain.\nLady Proxima is voiced by Linda Hunt in the 2018 Star Wars Anthology film Solo: A Star Wars Story. Screenwriter Jon Kasdan was the one who suggested casting Linda Hunt as Lady Proxima, having admired Hunt's haunting opening narration of Shelley Duvall's 1989 horror anthology TV show Nightmare Classics. Hunt had also worked previously with Kasdan in his 1985 Western film Silverado. During production of Solo, the character's name was Mother Proxima, but was changed to Lady Proxima late in production.\nProxima's design evolved through the development of Solo. In an interview with StarWars.com, creature concept designer Jake Lunt Davies revealed that the initial brief for the Den of the White Worms suggested Proxima's appearance, including the possibility of actually having tentacles underwater which might interconnect with her attendants. Though the creature effects concept team questioned whether Proxima was more like a worm or a serpent or whether she had scales or arms, they always designed her in a way she would be dominant over Han. Proxima's final design was produced by Ivan Manzella, but Davies designed her costume, comparing Proxima to Fagin, one of the antagonists in Charles Dickens' classic novel Oliver Twist, who also recruited children to give them food and shelter in exchange of performing criminal activities like pickpocketing. Proxima shares some similarities with Garris Shrike from the 1997 Star Wars Legends novel The Paradise Snare. Like Proxima, Shrike was a crime boss who offered Han Solo and other orphans on Corellia food and shelter in exchange for their participation in criminal activities on his behalf, and like Proxima, Solo eventually ran away from him and the planet as a young adult.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Proxima",
  "/wiki/Corellia",
  "/wiki/Grindalid",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Garavult_Clan",
  "/wiki/White_Worms",
  "/wiki/Lord",
  "/wiki/Crime_lord",
  "/wiki/Den_of_the_White_Worms",
  "/wiki/Imperial_Era",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Corellian",
  "/wiki/Youngling",
  "/wiki/Scrumrat",
  "/wiki/Foodstuff",
  "/wiki/Han_Solo",
  "/wiki/Qi%27ra",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Standard_day",
  "/wiki/High_Republic_Era",
  "/wiki/Battle_on_Corellia",
  "/wiki/Nihil",
  "/wiki/230_BBY",
  "/wiki/24_BBY",
  "/wiki/Coaxium",
  "/wiki/Rebolt",
  "/wiki/Moloch",
  "/wiki/Standard_year",
  "/wiki/M-68_landspeeder",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Sana_Starros",
  "/wiki/Path_engine",
  "/wiki/Galactic_Civil_War",
  "/wiki/Chewbacca",
  "/wiki/Millennium_Falcon",
  "/wiki/Em-Five",
  "/wiki/Eye",
  "/wiki/Cold_War",
  "/wiki/Bazine_Netal",
  "/wiki/Gannis_Ducain",
  "/wiki/Jakku",
  "/wiki/Linda_Hunt",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Jon_Kasdan",
  "/wiki/1989",
  "/wiki/1985",
  "/wiki/StarWars.com",
  "/wiki/Jake_Lunt_Davies",
  "/wiki/Ivan_Manzella",
  "/wiki/Garris_Shrike",
  "/wiki/1997",
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Paradise_Snare",
  "/wiki/Han_Solo/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Most_Wanted",
  "/wiki/Most_Wanted_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Read-Along_Storybook_and_CD",
  "/wiki/Solo:_A_Star_Wars_Story:_Meet_the_Crew",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Han_Solo_-_Imperial_Cadet_1",
  "/wiki/Han_Solo_-_Imperial_Cadet_2",
  "/wiki/Han_Solo_-_Imperial_Cadet_3",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Doctor_Aphra_(2020)_7",
  "/wiki/Bounty_Hunters_1",
  "/wiki/Star_Wars_(2020)_18",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Crimson_Reign_5",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Flight_of_the_Falcon,_Part_3:_Home_Again",
  "/wiki/Star_Wars_Adventures_(2017)_16",
  "/wiki/Flight_of_the_Falcon,_Part_4:_Lady_and_the_Tramp",
  "/wiki/Star_Wars_Adventures_(2017)_17",
  "/wiki/Flight_of_the_Falcon,_Part_5:_Grand_Theft_Falcon",
  "/wiki/Star_Wars_Adventures_(2017)_18",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/The_Chase_with_Han/Escape_with_Chewbacca",
  "/wiki/Star_Wars",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Solo:_A_Star_Wars_Story_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_30",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2021",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Han_Solo_(Star_Wars_Encyclopedia)",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/10_BBY",
  "/wiki/13_BBY",
  "/wiki/File:Jon-Kasdan-SoloFacts-September-14-2018.png",
  "/wiki/Phil_Szostak"
 ]
}