{
 "name": "Prudii_Skirata",
 "display_name": "Prudii Skirata",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "32 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "MandaloriansClan Skirata",
      "Clan Skirata"
     ]
    }
   ]
  }
 ],
 "content": "Prudii Skirata, formerly known as Null-5 or N-5 was one of twelve Null-class ARC troopers created for use in the Grand Army of the Republic as a lieutenant. Due to the genetic tampering, Prudii and his five brothers had slightly improved muscular structures, eidetic memory, and an enhanced intelligence that was at least a 35% higher intelligence score over the ordinary clones.\nWhen he and the other Nulls were two years old, Kal Skirata saved them from termination by the Kaminoan clone scientists. After that, they remained loyal only to Skirata.\nAfter the First Battle of Geonosis, Prudii and his brothers were scheduled for chill-down because they were uncommandable except by Kal Skirata. Skirata saved them from chill-down and eventually the Null Squad became Clone Intelligence Units  who worked for the Special Operations Brigade under the command of Jedi General Arligan Zey; as well as Kal Skirata's \"private army\", searching for the Kaminoan clone technician Ko Sai in order to force her to stop the age acceleration process.\nPrudii specialized in sabotage of droid factories. After installment as military intelligence unit, he spent the first year after Geonosis with sabotaging major droid factories throughout the galaxy, visiting 49 different planets and possibly interrogating and assassinating an important Separatist metallurgist who gave him vital clues on the metallurgic structure of droids. Instead of blowing the factories up, he developed a technique that couldn't be detected by Separatist quality control. Mereel used to call this technique \"Prudii's patented droid remover\". He wore specialized ARC trooper armor with stealth coating that couldn't be detected by droids, thus enabling him to enter droid factories unnoticed. He then sliced the main computers and slightly changed the recipe for creating droids by adding 5% extra carvanium. On the battlefield, these droids crumbled when hit with any weapon. His sabotage acts were so successful that the kill ratio for clone troopers in the field was raised from 1:20 droids to 1:50 droids during the first year of the Clone Wars.\n460 days after Geonosis, he trained clone commando RC-3222 on Olanet in his sabotage technique. Together they entered the droid factory on Olanet, which was regarded as a high value target by military intel, and sliced the main computer. Atin then returned to his squad at Coruscant HQ and introduced Omega Squad to the new technique while Prudii continued his work. In addition, he then joined his brothers in the search for Ko Sai.\nAt the conclusion of the Clone Wars, Prudii extracted to Kal Skirata's haven of Kyrimorut on Mandalore.\n\"Prudii\" means \"shadow\" in Mando'a. He was completely fluent in Mando'a because Kal Skirata taught this language to all his Null ARCs, together with the Mandalorian culture.\nAtin described Prudii as a \"glib cynic\" . Prudii hated being called \"Sir\" or \"Lieutenant\" by other clones because he was of the strong opinion that all clones were brothers—even the Alpha ARCs, who always appeared to have some personal differences with the Null ARCs. Atin had the impression that Prudii looked slightly older than his brothers Ordo and Mereel.\nPrudii wore the Phase 1 ARC armor with the blue markings due to him having the rank of Lieutenant and later went on to wear the 1.5 experimental armor. With the equipment he had, he carried two DC-17 hand blasters along with the DC-15a blaster rifle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Prudii_Skirata",
  "/wiki/Kamino/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Clan_Skirata",
  "/wiki/Null-class_Advanced_Recon_Commando",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Kaminoan/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Clone_Intelligence/Legends",
  "/wiki/Special_Operations_Brigade/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Arligan_Zey",
  "/wiki/Ko_Sai/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/ARC_trooper_armor/Legends",
  "/wiki/Carvanium",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/Atin_Skirata",
  "/wiki/Olanet",
  "/wiki/Sabotage_of_Olanet_Droid_Factory",
  "/wiki/Coruscant/Legends",
  "/wiki/Omega_Squad",
  "/wiki/Kyrimorut",
  "/wiki/Mandalore/Legends",
  "/wiki/Mando%27a/Legends",
  "/wiki/Alpha-class_Advanced_Recon_Commando",
  "/wiki/Ordo_Skirata",
  "/wiki/Mereel_Skirata",
  "/wiki/Lieutenant",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Star_Wars_Insider",
  "/wiki/Odds",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Kom%27rk_Skirata",
  "/wiki/Jaing_Skirata",
  "/wiki/A%27den_Skirata"
 ]
}