{
 "name": "Prudy",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lethan Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Reddish-pink"
     ]
    }
   ]
  }
 ],
 "content": "Prudy was a female Lethan Twi'lek from the planet Coruscant who worked as a doctor during the Cold War between the Galactic Republic and the reconstituted Sith Empire. She became engaged to a fellow doctor named Archiban Kimble on the planet Ord Mantell in 3644 BBY, but Kimble—better known as Doc—ended their relationship just before their wedding and left her with the refugee hospital he had bought for her on Alderaan. Two years later, Prudy was kidnapped by a group of criminals so they could blackmail Doc into delivering a shipment of valuable spice that he had failed to give them, and the gangsters burned her hospital to the ground before she was rescued.\nA female Twi'lek from the Galactic Republic's capital of Coruscant, Prudy became a fully trained medical doctor by the time of the Cold War with the Sith Empire. In 3644 BBY, Prudy was on the planet Ord Mantell when she encountered the xenopathologist and combat medic Archiban Kimble, better known as Doc. The two began a relationship and soon became engaged, and Doc purchased Prudy a refugee hospital on Alderaan using credits that he had stolen from a gang of criminals after scamming them with a false promise of a spice delivery. However, Prudy rushed their relationship and arranged a wedding before Doc was ready, causing him to break off their engagement just before the ceremony even after her mother and father arrived from Coruscant.\nPrudy spent the next two years running her hospital on Alderaan, and Doc did not contact her that entire time until the gang that Doc had scammed tracked down where their funds had gone. Learning that Prudy's hospital had been purchased with their credits, in 3642 BBY the gang took the Twi'lek hostage and burned the hospital to the ground before contacting Doc with a ransom demand: Prudy's life in return for the spice he owed them. Doc was able to secure Prudy's release by taking her place as the gang's hostage, though he managed to escape with the help of the Republic Customs Office and its hostage negotiators. Prudy later contacted Doc via holocomm and expressed her fury to him, and she terminated the transmission in anger after informing him that the gangsters had destroyed her hospital.\nA trained doctor who ran a refugee hospital, Prudy was a reddish-pink-skinned Lethan Twi'lek with yellow eyes whose two lekku sported a pattern of dark lines. Prudy was too clingy in her relationships for Doc's taste, and her speedy planning of a wedding led the commitment-wary Doc to end their engagement. She held a grudge against Doc for his departure, and the fact that he did not contact her and that his actions caused the destruction of her hospital did nothing to lessen the anger she felt toward him.\nPrudy first appeared as a hologram in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011, in which she is featured in the conversation \"Best Intentions\" with the Jedi Knight class companion Doc. The conversation was originally a full mission that would have included the player accompanying Doc to Alderaan to rescue Prudy from the pirate Cazzush in an old Imperial base on Alderaan, but that version was cut from the game before its release.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/Lethan",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Archiban_Frodrick_Kimble",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/3644_BBY",
  "/wiki/Marriage/Legends",
  "/wiki/Prudy%27s_hospital",
  "/wiki/Alderaan/Legends",
  "/wiki/3642_BBY",
  "/wiki/Standard_year/Legends",
  "/wiki/Unidentified_criminal_gang",
  "/wiki/Spice/Legends",
  "/wiki/Gangster/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Time/Legends",
  "/wiki/Xenopathologist",
  "/wiki/Medic/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Prudy%27s_mother",
  "/wiki/Prudy%27s_father",
  "/wiki/Republic_Customs_Office",
  "/wiki/Holocomm/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Lekku/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/2011",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Cazzush",
  "/wiki/Star_Wars:_Episode_I_The_Visual_Dictionary",
  "/wiki/Species/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3643_BBY",
  "/wiki/Hero_of_Tython",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Battle_of_Ilum",
  "/wiki/3640_BBY",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/3641_BBY"
 ]
}