{
 "name": "Pumav",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Selonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selonian"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray",
      "white",
      "and black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Pumav was a Selonian from the planet Selonia and an athlete active during the last years of the Galactic Republic. In 23 BBY, Pumav won the quadruped race in the annual Mobquet Presents: Fastest Land Beings racing meet on the planet Teyr. The Selonian later repeated as quadruped champion in the Mobquet Presents in 22 BBY, also placing seventh in the biped race at the same meet.\nA Selonian from the planet Selonia in the Core Worlds region, Pumav was a sprinter alive during the waning days of the Galactic Republic. Pumav was capable of racing on either two or four limbs, and, in 23 BBY, the Selonian won the quadruped race in the prestigious Mobquet Presents: Fastest Land Beings racing meet, held annually in the city of Pyre Folas on the planet Teyr. The next year, Pumav repeated as the Mobquet Presents' quadruped champion and also finished seventh in the meet's biped race, losing to the Teek Yeep, who easily outran Pumav and the rest of the competitors. Pumav received a medal for his victory, and he later posed for a picture along with Yeep and the meet's hexaped race winner, Yopaxtul. The events of that year's meet, including Pumav's participation, were later reported on by the HoloNet News.\nPumav had black eyes; was covered in a mixture of black, white, and gray fur; and could race on either two or four limbs.\nPumav's only appearance in Star Wars canon was in the in-universe HoloNet News Vol. 531 52 article New Galaxy's Fastest Hexaped, released on April 18, 2002.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Selonia/Legends",
  "/wiki/Selonian/Legends",
  "/wiki/Gray",
  "/wiki/White",
  "/wiki/Black",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Mobquet_Presents:_Fastest_Land_Beings",
  "/wiki/Teyr/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Limb/Legends",
  "/wiki/City/Legends",
  "/wiki/Pyre_Folas",
  "/wiki/Teek_(species)/Legends",
  "/wiki/Yeep",
  "/wiki/Medal/Legends",
  "/wiki/Yopaxtul",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/In-universe",
  "/wiki/HoloNet_News_Vol._531_52",
  "/wiki/April_18",
  "/wiki/2002",
  "/wiki/The_Essential_Atlas"
 ]
}