{
 "name": "Purpruff",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gigoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Vapetailers unit",
      "Vapetailers unit"
     ]
    }
   ]
  }
 ],
 "content": "Purpruff was a Gigoran female who served as a corporal in the Vapetailers unit of the Rebel Alliance Special Forces. During the Galactic Civil War against the Galactic Empire, she traveled to the planet Hoth while scouting for a new location for the Alliance's headquarters. Purpruff wrote up a report recommending Hoth as a good location for the base despite its freezing temperatures, which ultimately led to the Alliance establishing Echo Base on the planet. Purpruff was killed when the Empire attacked Echo Base in 3 ABY.\nDuring the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire, the Gigoran female Purpruff served in the Alliance to Restore the Republic's Special Forces as a corporal in the Vapetailers unit. During her time with the unit, the Vapetrailers sometimes played matches of pazaak for cantina chits against the Shrikes, another Special Forces unit that included Caluan Ematt.\nAt some point between 0 ABY and 3 ABY and following the start of the Alliance's Mid Rim Retreat, Purpruff traveled to the ice planet Hoth while scouting for a suitable location for the Alliance to construct its new headquarters. She noted her initial impressions in a scouting log entry from orbit and soon landed on the planet's surface. The Gigoran then hiked to the nearest entrance of a large subterranean cavern nearby that her terrain mapper had identified.\nPurpruff discovered that the cavern was spacious enough to house freighters inside and tested the structural integrity by detonating a sticky mine on a stalactite, which did not even shudder during the explosion. The corporal's life-form scanner then led her to a tauntaun herd in the cavern, of which she captured a surveillance image at five times zoom before feeding the creatures a ration stick by hand. Purpruff then compiled her findings into a report that recommended Hoth as a suitable location for a base. The report reached Colonel Anna Seertay, who sent it on to the head of Special Forces, General Pitt Onoran. It was also added to The Rebel Files, a collection of physical documents maintained by the archivist Hendri Underholt that tracked the history of the Alliance.\nThe Alliance ultimately chose to follow Purpruff's recommendation and constructed Echo Base on Hoth as its new headquarters. In 3 ABY, the Empire discovered and attacked Echo Base, forcing the Alliance to swiftly evacuate. Most of the Alliance forces escaped, but Purpruff was among those killed during the battle. In 34 ABY, Ematt saw Purpruff's report in The Rebel Files after they fell into the hands of the Resistance. Ematt annotated it with a note saying that he had known the Gigoran and that he had seen her name listed among the fallen at Hoth.\nAs a Gigoran, Purpruff's tolerance for cold temperatures was far higher than that of humans. As such, she considered the freezing temperatures of Hoth to be merely brisk. The corporal enjoyed the tingle of the planet's clean air in her nostrils upon first landing. She also considered Hoth's landscapes beautiful and its native tauntauns cute and pleasant smelling.\nPurpruff was mentioned in the 2017 reference book Star Wars: The Rebel Files, which was written by Daniel Wallace.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3_ABY",
  "/wiki/Hoth",
  "/wiki/Gigoran",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Vapetailers_unit",
  "/wiki/Corporal",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/Scout",
  "/wiki/Temperature",
  "/wiki/Echo_Base",
  "/wiki/Death",
  "/wiki/Battle_of_Hoth",
  "/wiki/Time",
  "/wiki/Pazaak",
  "/wiki/Cantina",
  "/wiki/Shrikes",
  "/wiki/Caluan_Ematt",
  "/wiki/0_ABY",
  "/wiki/Mid_Rim_Retreat",
  "/wiki/Water",
  "/wiki/Orbit",
  "/wiki/Cave",
  "/wiki/Terrain_mapper",
  "/wiki/Freighter",
  "/wiki/Sticky_mine",
  "/wiki/Scanner",
  "/wiki/Tauntaun",
  "/wiki/Ration_bar",
  "/wiki/Limb",
  "/wiki/Colonel",
  "/wiki/Anna_Seertay",
  "/wiki/General",
  "/wiki/Pitt_Onoran",
  "/wiki/The_Rebel_Files",
  "/wiki/Archivist",
  "/wiki/Hendri_Underholt",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/34_ABY",
  "/wiki/Resistance",
  "/wiki/Human",
  "/wiki/Nose",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Daniel_Wallace",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Durkteel",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY"
 ]
}