{
 "name": "Purr",
 "display_name": "Purr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tinnell homeworld"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tinnell"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Purr was a female Tinnell and Force-sensitive. She was an exceptionally skilled mechanic and worked for Dannen Lifehold, whom she also considered her best friend. She appeared not to be too bright, but that was primarily to be attributed to naïveté rather than stupidity. She spoke Basic fairly well, but did not understand irony.\nShe was born on a remote arboreal Mid Rim planet, but did not remember its name. Once a spaceship, called the Bottom Line landed on their planet, and Purr, who was curious by nature sneaked aboard to explore it. The spaceship took off without her knowing it, and she was found by the crew, who adopted her as their mascot. She would spend most of the time in the engine room, where she learned about repairing and how to speak Basic.\nThe Bottom Line was owned by a crimelord who made her do menial jobs. In her spare time, she would tinker around with the crimelord's collection of swoops. Impressed with her skills, he promoted her to a mechanic. After five years, a rival gang attacked the base of Purr's employer and killed almost everybody there. Purr, however, managed to escape on a landspeeder. She would travel the spaceways, until she met Dannen Lifehold.\nPurr got involved in the Galactic Civil War when she and Lifehold agreed to transport a shipment of bacta to a small Rebel base on Rafft and ended up playing a pivotal role in the evacuation of the entire Rebel group. Once the Rebels were safe, Lifehold was told that the Galactic Empire had destroyed Alderaan and decided to join the Rebellion. Purr followed her friend and joined as well.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tinnell_homeworld",
  "/wiki/Tinnell",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dannen_Lifehold",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Bottom_Line",
  "/wiki/Swoop/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Rafft",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Breaking_Free:_The_Adventures_of_Dannen_Lifehold",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/Changing_the_Odds:_The_Adventures_of_Dannen_Lifehold",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com"
 ]
}