{
 "name": "Putch_Gundarian",
 "display_name": "Putch Gundarian",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tyne's Horky"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Putch Gundarian, also known as Uncle Gundy, was an elderly miner who worked in the caverns of the planet Tyne's Horky. Gundarian's adventurous nephew Jann Tosh often assisted him in the grueling work.\nSeveral years prior to the Battle of Yavin, Tosh purchased two droids named C-3PO and R2-D2. He also befriended a simple-minded alien from Tammuz-an. The pragmatic Gundarian was upset with Tosh for purchasing a protocol and an astromech droid rather than the mining droid he had requested. Regardless, he put the droids to work and frequently abused R2-D2 by kicking him .\nOne day, Gundarian was working in the mines when a section of the shaft caved in. Tosh and the Tammuz-an ran in to aid him. The alien pulled Gundarian to safety before he could come to any serious harm. As a result, Gundarian named him Kez-Iban—a Bocce word that meant \"He That Returns from Death\". Gundarian eventually discovered that Kez-Iban was actually a deposed prince of Tammuz-an named Mon Julpa.\nBefore long, Jann Tosh, Mon Julpa, and the droids ran afoul of a criminal named Kleb Zellock. After driving Zellock away from Tyne's Horky, they took possession of his vast fortune of Keschel ore and paid Yorpo Mog as a miner. Jann gave the valuables to his uncle, turning him into a wealthy man.\nGundarian was a short, corpulent male Human with white hair tied in a ponytail and a long, unkempt mustache. He dressed in sturdy laborer's fatigues and was usually seen wearing a purple wide-brimmed hat. Gundarian was a hard-working and practical individual. He rarely tolerated his nephew Jann's sense of adventure and was prone to bouts of anxiety whenever things didn't turn out as expected. However, Gundarian was grateful to those around him and occasionally revealed that he did indeed have a soft heart where his nephew was concerned.\nDan Hennessey performed the voice of Uncle Gundy. Uncle Gundy was released as an action figure in 1985 as part of Kenner's Star Wars: Droids: The Adventures of R2-D2 and C-3PO line. These action figures were size-compatible with the other Kenner Star Wars action figures, but design-wise they represented a completely different toy line\nIn \"The Lost Prince\", Gundy was animated with only four fingers per hand instead of five.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tyne%27s_Horky",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jann_Tosh",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Tammuz-an/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Unidentified_mining_droid_model",
  "/wiki/Kez-Iban",
  "/wiki/Bocce/Legends",
  "/wiki/Mon_Julpa",
  "/wiki/Kleb_Zellock",
  "/wiki/Keschel",
  "/wiki/Yorpo_Mog",
  "/wiki/Dan_Hennessey",
  "/wiki/1985",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/Star_Wars",
  "/wiki/The_Lost_Prince",
  "/wiki/The_New_King",
  "/wiki/The_Lost_Prince:_A_Droid_Adventure",
  "/wiki/Star_Wars:_Droids_(toy_line)",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Around_the_Galaxy",
  "/wiki/Star_Wars_Galaxy_Collector_3",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/The_Droids_Re-Animated",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_159"
 ]
}