{
 "name": "Puullo",
 "display_name": "Puullo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Shettora's criminal faction"
     ]
    }
   ]
  }
 ],
 "content": "Puullo was a Hutt male criminal who served as a lieutenant with fellow Hutt Shettora's criminal faction on the planet Brentaal IV. He effectively controlled the black market on Brentaal IV and was fair in his dealings. In 0 ABY, the faction that Puullo was a part of made a deal with the crew of the privateer frigate Far Orbit, which gave the organization a share of the profits the Far Orbit captured in exchange for a shadowport from which to operate and other illegal goods and services.\nPuullo was a male Hutt criminal who served as a lieutenant in the criminal faction run by fellow Hutt Shettora. Puullo served at the forefront of the organization by 0 ABY and almost completely controlled the black market on the planet Brentaal IV—where Shettora's faction was based—because of his expertise in business. The Hutt was also involved with several other Core World criminal factions. Puullo was well-liked by individuals in the underworld and was fair in the dealings he made. During the Hutt's career as a criminal, a few individuals who tried to take advantage of him were never heard of again. Puullo, when traveling, was protected by a group of criminals who owed the Hutt a favor. The Hutt also specialized in procuring starships, and he only dealt in quality merchandise.\nIn 0 ABY, Captain Dhas Fenoep Vedij of the Alliance to Restore the Republic-aligned privateer EF76 Nebulon-B escort frigate Far Orbit contacted the Hutts on Brentaal IV. The Hutts dealt with Vedij, and an agreement was reached; for 30 percent of the goods and money the Far Orbit seized—excluding military hardware—the Hutts would grant them a hidden spaceport—known as a shadowport—to use, illegal weapons, and protection from any bounty hunters seeking the frigate's crew.\nUnlike most other Hutts, Puullo was, for the most part, well-liked by the individuals in the criminal underworld. He was soft spoken and was fair and even-handed in his negotiations, though he could be a bit uncompromising. Possessing a pleasant demeanor, the Hutt was patient and avoided violence when he could, though some individuals who tried to take advantage of him, after mistaking the Hutt as weak, were never seen again. Puullo was shrewd in nature and was quite good at dealing with businesses, which allowed him to practically control the black market on Brentaal IV. The Hutt also refused to deal in defective goods, instead preferring quality merchandise.\nHe took responsibility for his goods, and if an item that he sold malfunctioned, Puullo sometimes would refund the customer. He wore a vest with many pockets and owned a concealed hold-out blaster, an Imperial transit pass, as well as an encrypted datapad and comlink. The Hutt was also somewhat immune to the mind tricks that could be used by those strong in the Force. Puullo was competent in the many skills sometimes required in the underworld, from forgery to operating a repulsorlift vehicle.\nPuullo was first mentioned in 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games' Star Wars: The Roleplaying Game and had the same theme of the previous publication, Pirates \u0026 Privateers, as it followed the privateering vessel Far Orbit. In the scenario hook known as The Hutt Gambit, players may decide to get into contact with the Hutts to acquire extra supplies and services for a price; in the dealings that follow, although it is never actually stated, the book infers that Puullo takes part and is later the main character to whom the crew of the Far Orbit speak whenever they trade goods. Puullo and the Hutts may require the characters to pass a test before they sign the deal. If the crew of the Far Orbit raid a Xizor Transport Systems' transport, Puullo will back out of the deal with the frigate after declaring the agreement void.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Shettora%27s_criminal_faction",
  "/wiki/Lieutenant/Legends",
  "/wiki/Shettora",
  "/wiki/Planet/Legends",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/Black_market/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Far_Orbit",
  "/wiki/Shadowport/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Captain/Legends",
  "/wiki/Dhas_Fenoep_Vedij",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Spaceport/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/1998",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Timothy_S._O%27Brien",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Xizor_Transport_Systems/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}