{
 "name": "Puzell",
 "display_name": "Puzell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Epsis"
     ]
    }
   ]
  }
 ],
 "content": "Puzell was a male Duros underboss within the Epsis crime syndicate on Point Nadir.\nWhen Prello the Hutt, a member of Anjiliac kajidic, hired a group of individuals to find the Fell Star, a powerful Sith artifact, and obtain it for her, their path led them to Point Nadir, a shadowport in the Outer Rim located on the comet Resh 9376.\nAfter arriving at the starport, the group was detained by sentries of Epsis, a technologically proficient criminal organization and one of the three ruling syndicates of Point Nadir. They were brought before Puzell, who was newly appointed to the position of underboss within Epsis. Puzell questioned the group, wanting to know their reasons for coming to Point Nadir, who sent them, and what, or who, they are searching for. After tediously interviewing them, Puzell allowed them to continue on with their mission, providing them with information leading them to the safe house district controlled by Sable Dawn, another of Point Nadir's triumvirate syndicates.\nPuzell was a long-term member of Epsis, having been with the organization for over a decade at the time he was appointed underboss on Point Nadir. He enjoyed his newly-acquired position and had every intention of keeping it, using his no nonsense, all business mentality to clime the ladder of success. He was very technologically proficient and possessed a keen mind and thoughtful nature. He could speak Basic along with his native Durese in addition to Dosh, Sullustese and Ubese.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Epsis_(organization)",
  "/wiki/Point_Nadir",
  "/wiki/Prello_Anjiliac",
  "/wiki/Hutt/Legends",
  "/wiki/Anjiliac",
  "/wiki/Kajidic/Legends",
  "/wiki/Fell_Star",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Shadowport/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Resh_9376/Legends",
  "/wiki/Sable_Dawn",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Durese/Legends",
  "/wiki/Dosh/Legends",
  "/wiki/Sullustese/Legends",
  "/wiki/Ubese/Legends",
  "/wiki/Scum_and_Villainy_(sourcebook)"
 ]
}