{
 "name": "Pwwoz Pwwa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ithor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark gray with light gray spots"
     ]
    }
   ]
  }
 ],
 "content": "Pwwoz Pwwa was an Ithorian explorer who was present at the Mensix Mining Facility on Mustafar during the Galactic Civil War in 1 ABY.\nDuring his travels around the lava world, Pwwoz found a strange crystal and then later claimed to have seen the spirit of an old Human and wasn't sure what happened to him after that as he became possessed by the powers of the crystal. When Pwwoz lost the crystal, he requested that a passing spacer retrieve it for him. Upon the spacers return with the crystal, Pwwoz took and smashed it on the ground, taunted the spirit, and attempted to kill the confused spacer. When the spacer subdued Pwwoz, who later recovered and apologized for his actions, they took a shard of the crystal for themselves.\nPwwoz Pwwa was a non-playable character in the massively-multiplayer online roleplaying game Star Wars Galaxies prior to its closure on December 15, 2011. He was added to the game, along with the planet Mustafar in the expansion Star Wars Galaxies: Trials of Obi-Wan, which was released in late 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ithor/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/Mensix_Mining_Facility",
  "/wiki/Mustafar/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Magma/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Crystal/Legends",
  "/wiki/Force_ghost",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/2005"
 ]
}