{
 "name": "Pysk Lila",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Mon Calamari system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Calamari monarchy",
      "Mon Cala Mercantile Fleet",
      "Mon Cala Mercantile Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Pysk Lila was a Mon Calamari female who served the Mon Cala Mercantile Fleet as a captain of the Star Cruiser Aurora Flare.\nPysk Lila was a Mon Calamari female who served the Mon Cala Mercantile Fleet as a captain of the Star Cruiser Aurora Flare. In 1 ABY, after learning of the death of King Lee-Char, the Mercantile Fleet, which was stationed above the planet Mon Cala, began to rebel against the Imperial personnel aboard their ships, during this time Lila clubbed a stormtrooper to death with their helmet. Shortly after, the Empire blockaded the planet and as they began their plan to put down the Mon Cala resistance, a fleet of rebel starships, led by Admiral Gial Ackbar, emerged from hyperspace after being contacted by Regent Dors Urtya.\nIn an attempt to breach the blockade, Ackbar contacted Lila aboard the Aurora Flare asking the captain to volunteer for the act even though it was far from certain that the tactic would work and that she could end up dying for nothing. In response Lila recounted how she had volunteered when they clubbed a stormtrooper to death, before asking Ackbar what they had to do. Honored, Ackbar expressed his wish that there was more time for them to know one another as he informed her of his plan. After being informed of what had to be done, Lila had the Aurora Flare head towards the Star Destroyer commanded by Admiral Tyrus Meori with a full load of coaxium from Redhurne stored aboard.\nAs the ship made its way to the destroyer, Lila stood on the ship's bridge and was informed by crew members that the shields were failing as the Imperials were firing on the ship, she told the crew to do whatever they could and that they had to make it to the lead destroyer. As the Aurora Flare drew closer, Meori asked for the records to be checked and to identify the ship. When he learned of what the ship was carrying, he immediately ordered his crew to stop firing on the ship. However, it was too late and Lila's ship crashed into and significantly damaged the Star Destroyer, the act destroying the Aurora Flare in the process, killing Lila. Lila's sacrifice allowed the rebels and twelve Mon Cala cruisers to escape to the rebel's Mako-Ta Base.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lila",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/1_ABY",
  "/wiki/Mon_Calamari_system",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/Mon_Cala_Mercantile_Fleet",
  "/wiki/Captain",
  "/wiki/Star_Cruiser",
  "/wiki/Aurora_Flare",
  "/wiki/Death",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/Fleet",
  "/wiki/Planet",
  "/wiki/Mon_Cala",
  "/wiki/Mutiny_on_Mon_Cala",
  "/wiki/Galactic_Empire",
  "/wiki/Starship",
  "/wiki/Time",
  "/wiki/Stormtrooper",
  "/wiki/Stormtrooper_armor",
  "/wiki/Blockade",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Hyperspace",
  "/wiki/Regent",
  "/wiki/Dors_Urtya",
  "/wiki/Star_Destroyer",
  "/wiki/Tyrus_Meori",
  "/wiki/Coaxium",
  "/wiki/Redhurne_system",
  "/wiki/Turbolaser",
  "/wiki/Bridge_(starship)",
  "/wiki/Deflector_shield",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Star_Wars_(2015)_49",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_(2015)_44",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars_49"
 ]
}