{
 "name": "Qan_Gindoch",
 "display_name": "Qan Gindoch",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tralfin"
     ]
    },
    {
     "name": "Born",
     "values": [
      "28 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "80 kilograms"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pendor Gyrr"
     ]
    }
   ]
  }
 ],
 "content": "Qan Gindoch was a male Human who made his living as a smuggler during the Galactic Civil War.\nQan Gindoch was born in 28 BBY on the planet Tralfin. Working as a spice smuggler, he was employed by the Givin counterfeiter Pendor Gyrr. Gindoch was captured by New Republic agents during a raid on the planet Mantooine, and was found with a large amount of counterfeit credits on him, which had been paid to the smuggler by Gyrr. Gindoch cooperated with the New Republic, giving testimony about much of Gyrr's counterfeiting operation. The New Republic was satisfied that Gindoch was not part of Gyrr's counterfeiting operation, and was just a smuggler employed by the Givin. As a result, and given the minor severity of his crime, Gindoch was released after paying a small fine.\nGindoch returned to smuggling, and began working directly for both the Galactic Empire and other criminal organizations. He was implicated in the theft of a shipment of blasters bound for the New Republic training facilities on the planet Vessitoar. A portion of the shipment was recovered during a routine security check at a spaceport on Celanon, traced to a small time arms dealer who had obtained the samples from the Ithorian crime lord Rethorn. Interrogation of Rethorn's agents revealed that Gindoch had smuggled the weapons aboard a stolen freighter. The New Republic posted a reward of 3,500 credits for Gindoch's capture on charges of smuggling and theft.\nQan Gindoch was a Human male who was 1.75 meters tall and weighed eighty kilograms. He had a large earring in his right ear. Gindoch was adept at bargaining with, and conning individuals, and was known to enjoy gambling.\nQan Gindoch was skilled in the use of blasters and melee combat, and was trained in survival and stealth techniques. He was knowledgeable about other cultures and languages, and knew how to contact the criminal elements. Gindoch was capable of piloting transports through both realspace and hyperspace, and was also skilled in the use of the ship's weapons and in repairing them.\nGindoch was armed with a heavy blaster pistol.\nQan Gindoch was profiled in Wanted by Cracken a sourcebook published in 1993 by West End Games for use with Star Wars: The Roleplaying Game. His illustration was provided by Mike Jackson. Gindoch's prison number contains a reference to THX-1138.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tralfin",
  "/wiki/28_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Pendor_Gyrr",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Givin/Legends",
  "/wiki/Forger_(profession)/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Mantooine/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Vessitoar_training_facilities",
  "/wiki/Vessitoar",
  "/wiki/Spaceport/Legends",
  "/wiki/Celanon/Legends",
  "/wiki/Arms_dealer/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Rethorn",
  "/wiki/Freighter/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Mike_Jackson"
 ]
}