{
 "name": "Qet",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sphere of Production and Logistics",
      "Sphere of Production and Logistics"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Vowrawn"
     ]
    }
   ]
  }
 ],
 "content": "Qet was a male Human Sith Lord who was trained by the Sith Lord Darth Vowrawn during the Galactic War.\nTo honor his master, Qet brought in a massive army of slaves from offworld to secretly build a great statue of Vowrawn in the jungles of Dromund Kaas—an edifice that became known as the Unfinished colossus. The slaves quickly rebelled, seizing industrial drills to destroy the unfinished statue and killing all who came to suppress their rebellion.\nDuring the battle for Corellia, Qet stood by Vowrawn's side as his Master led the Imperial campaign to conquer the former Republic planet, while on the lookout for any potential assassins from Vowrawn's rival, Darth Baras. The Emperor's Wrath, formerly Baras' apprentice, soon arrived on Corellia to protect Vowrawn from Baras' assassins. However, Vowrawn was convinced that the rift between Baras and his apprentice was a ruse and his apprentices refused access to Vowrawn. After the Wrath was forced to kill Lord Haresh, Qet was the last line of defense for his Master but Vowrawn ordered his apprentice to stand down, willing to accept his fate. Amidst the Wrath's insistence of no longer being in Baras' service, Qet spotted a thermal detonator rolling up behind him. He barely put up a Force barrier to shield Vowrawn and his fellow Sith from the blast. The Wrath leaped to his defense and defeated the real assassin, convincing Vowrawn of the Wrath's sincerity. Qet then took to protecting his Master when they took to the Wrath's ship for safety and back to Korriban, where the Wrath would finally end Baras' bid to become the Voice of the Emperor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sphere_of_Production_and_Logistics",
  "/wiki/Darth_Vowrawn",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_training",
  "/wiki/Galactic_War",
  "/wiki/Slavery/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Unfinished_colossus",
  "/wiki/Dromund_Kaas_slave_rebellion",
  "/wiki/Death/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Mission_to_Corellia_(Emperor%27s_Wrath)",
  "/wiki/Haresh",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Force_barrier/Legends",
  "/wiki/Korriban",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}