{
 "name": "Qi%27ra",
 "display_name": "Qi'ra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "31 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.58 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue-Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "White Worms",
      "Crimson Dawn"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Dryden Vos",
      "Maul"
     ]
    }
   ]
  }
 ],
 "content": "Lady Qi'ra was a human female from the planet Corellia who lived during the reign of the Galactic Empire. She grew up on the streets along with Han as part of the White Worms. Though they were at first rivals, the two scrumrats eventually became lovers. Sometime after Qi'ra was made Head Girl by Lady Proxima, Han and Qi'ra attempted to escape with a vial of coaxium, but were separated at the Coronet Spaceport, with Han getting away, though he promised to return for her.\nQi'ra was sold into slavery by Proxima to the slave dealer Sarkin Enneb, who eventually sold her to Dryden Vos, the public leader of Crimson Dawn. Vos trained Qi'ra in martial arts and prompted her to kill Enneb, branding her right wrist with the Crimson Dawn symbol and making her his most trusted lieutenant.\nIn 10 BBY, Qi'ra reunited with Solo on Vandor and accompanied him and his friends on a mission to retrieve coaxium. She recommended a ship owned by the smuggler Lando Calrissian and rekindled her relationship with Solo. After the mission was unsuccessful, she returned to Vos, whom she betrayed and killed to save Han. Despite this, however, Qi'ra left Solo behind as she traveled to Dathomir to meet with Maul, the true leader of Crimson Dawn.\nBetween 3 ABY and 4 ABY, Crimson Dawn resurfaced under the leadership of Qi'ra. Having stolen Han Solo, who had been frozen in carbonite, from bounty hunter Boba Fett, she plotted to bring major galactic factions to her with Solo as the bait. Once the Attack on the Executor ended, with the Empire and Hutt Clan in conflict, Qi'ra moved forward with her next plans to begin the reign of Crimson Dawn.\nQi'ra hailed from the planet Corellia during the reign of the Galactic Empire, before the outbreak of the Galactic Civil War. She grew up on the streets and became friends with Han. By the time Qi'ra was eighteen years old, she was enmeshed in a criminal life working for the White Worms gang on Corellia. She was chosen by Lady Proxima to be the Head Girl after Han revealed to her that Qi'ra had turned down an opportunity to travel the galaxy, but to work for her instead. Qi'ra attempted to flee Corellia with Han, by this point her lover, who had stolen a vial of coaxium during a delivery for Proxima that had gone badly. After a confrontation with Proxima, in which Solo caused a distraction by shattering a window allowing light in, exploiting her vulnerablility of her skin, he and Qi'ra attempted to escape through the Imperial control zone using the coaxium to bribe Falthina Sharest, an Imperial Emigration Officer. Sharest agreed to allow them through, provided they handed over the coaxium before passing through the security gate. Solo reluctantly agreed, and instructed Qi'ra to hand it over. However, only Solo got through, Qi'ra was captured by several members of the White Worms, and the gate closed when Sharest triggered a security alert. Solo promised Qi'ra he would come back for her as soon as possible before he ran away from the gate.\nQi'ra lived an even more difficult life after being captured again by Proxima's gang. The blistered Proxima was displeased of her actions, opting to sell Qi'ra away. She was sold to a slave dealer, Sarkin Enneb, and later Dryden Vos, the leader of Crimson Dawn. After a year of failed escapes, she attempted to do so yet again, killing the guard outside her cell and reaching the escape pods, only to find Vos waiting. He offered her a position within the ranks of Crimson Dawn, having seen potential within her, but he demanded her lifelong loyalty in return. Vos later branded Qi'ra's forearm and the back of her neck with the Crimson Dawn symbol. Qi'ra also hunted down and killed Enneb.\nWith Crimson Dawn, Qi'ra lived a more opulent lifestyle, becoming Vos' top lieutenant. She was trained by Vos in the martial arts of Teräs Käsi.\nAt some point during her employment with Crimson Dawn, Qi'ra found herself being pursued by bounty hunter droid IG-88 on Ord Mantell. Qi'ra fell into a trap laid by IG-88 and his temporary partner, Weequay pirate Hondo Ohnaka. The two were planning on turning Qi'ra in for a bounty, but she was able to turn them against one another, giving her a chance to remove her bonds and capture them both, with intent to turn them in for bounties.\nAt some point following the Razzi warehouse raid, Qi'ra recorded details of the stolen cargo in the logbook known as the Smuggler's Guide, which had also been acquired in the raid. The cargo included crates with the fake Kitel Phard vases, HK8 Sawtooth, Weequay spherical objects with 50 kilogram of low-grade andris spice inside, disassembled HK-model gladiator droids bearing medallions of Grakkus Jahibakti Tingi, and a crate with exotic animal parts, including rancor fangs, aiwha sacs, shaved mynock silicate, sando tooth cuttings, dried octopod ink, two mummified tuk'ata specimens, various components of Corellian hound. The Smuggler's Guide later ended up in the possession of Val who found it in the crate they stole from the freight platform in Zarra on Cato Neimoidia and then passed to Tobias Beckett, with the smuggler Han Solo and the archaeologist Chelli Lona Aphra annotating the pages with their own comments when the book later fell into their possession.\nQi'ra's association with Crimson Dawn brought her back into contact with Solo, who was working with Vos' associate Tobias Beckett in order to obtain a large quantity of refined coaxium. Qi'ra attended the meeting between Vos, Beckett, and Solo on Vos' yacht. Vos berated Beckett and Solo for failing to obtain the coaxium shipment on Vandor, and considered killing them until Solo suggested that they instead retrieve unrefined coaxium from the spice mines of Kessel. Qi'ra advised Vos that the plan would work, and he agreed to allow Beckett to try, the penalty for failure being death. Vos sent Qi'ra to accompany Beckett's crew to make sure the plan would work.\nKnowing that they would need a particularly fast ship to transport the unrefined coaxium before it degraded and detonated, Qi'ra sought her old acquaintance, Captain Lando Calrissian of the Millennium Falcon. Qi'ra watched as Solo failed to win the Falcon at sabacc. However, Calrissian agreed to fly the Falcon for Qi'ra, Beckett, and Solo in exchange for a cut of the profits. En route to Kessel, Qi'ra and Solo rekindled their romance, kissing in the back of the Falcon.\nUpon arriving at Kessel, Qi'ra masqueraded as a slaver from the Federation of Trade Route Allocation and Monetization, Oksana Floren, selling Han and Chewbacca to Quay Tolsite of Pyke Syndicate in order to infiltrate the mines. Qi'ra, Beckett, and L3-37 secured the control room, allowing Solo to steal the coaxium. Qi'ra initially served as Solo's co-pilot during the escape from Kessel, but was replaced by Chewbacca as they fled from Imperial forces into the Akkadese Maelstrom. After using some of their stolen coaxium to escape a summa-verminoth, the crew flew the damaged ship and arrived on Savareen.\nOn Savareen, the Falcon crew refined the coaxium and awaited Vos' arrival. Calrissian soon left, angry with Solo for the damage to his ship. They were confronted by Enfys Nest, leader of the Cloud-Riders, who told them they were freedom fighters resisting the atrocities of Crimson Dawn, not pirates. Solo devised a plan to give Vos fake coaxium, and give the Cloud-Riders the real coaxium in order to fund their resistance. Qi'ra, Solo, and Chewbacca presented the coaxium to Vos aboard his yacht, but he saw through their plan, made aware in advance by Beckett, who had been Vos' double agent all along. Vos expressed his disappointment that Qi'ra betrayed him, and realized that Solo was her weakness.\nHowever, Solo foresaw Beckett's treachery, and double-crossed him: the coaxium containers left with the Cloud-Riders were empty, and Enfys Nest dispatched the Crimson Dawn agents sent to recover it. The coaxium they brought along was in fact genuine. Beckett captured Chewbacca, and left with the coaxium. Vos and Solo fought, but Qi'ra intervened, holding Solo at sword point. However, Qi'ra sided with Solo, dueling and killing Vos.\nSolo left to rescue Chewbacca and retrieve the coaxium for the Cloud-Riders. Qi'ra told Solo she would be right behind him, but as Solo left, she instead took Vos' ring, and used it to contact Maul, the actual leader of Crimson Dawn, informing him that Vos had failed to obtain the coaxium. After lying that Beckett had in fact killed Vos, Qi'ra was then ordered to bring the yacht to Dathomir, Maul's homeworld, and that she would be working more closely with Maul, leaving Solo behind. Qi'ra then assumed Vos' role as the public figurehead of Crimson Dawn and inherited control of the First Light. Maul also taught her about the Sith Order, revealing to her that Galactic Emperor Sheev Palpatine was the Dark Lord of the Sith Darth Sidious, and that the Imperial enforcer Darth Vader was his Sith apprentice. He explained to her about the Rule of Two, and that he had been the apprentice of Sidious, \"Darth Maul\", until his usefulness was over after his presumed death. Maul also trained her how to fight the Sith.\nIn the following years, while Qi'ra would manage to survive, Maul was separated from the rest of the galaxy after being stranded on the Outer Rim Sith planet Malachor. Later, Maul was slain on the Outer Rim world of Tatooine, Crimson Dawn was also thought to be destroyed by it's rivals. Even during the Galactic Civil War, Qi'ra and Solo remained separated and while on Hubin, Solo took the opportunity to tell his current lover Princess Leia Organa about his time in the Empire before defecting. When Organa opined that she could not imagine him in the role of a stormtrooper, Solo said that aside from not having many options, \"there was a girl,\" adding, \"Me and women have always been messes.\"\nQi'ra, earning the title of lady, came to control the remains of Crimson Dawn, plotting to use it in order to save herself from danger and to set the stage for a Syndicate War she could use to assassinate Vader and Palpatine. While recruiting allies to her cause, she traveled to a far-off world and saved a woman named Madelin Sun from a few stormtroopers. Sun was a former Sava from the University of Bar'leth who studied Force-related relics and devices. When Qi'ra asked her why she was forbidden from studying the Force, Sun explained that it was part of the Empire's effort to erase the Jedi from existence. To this, Qi'ra put the blame specifically on Palpatine and revealed to Sun that he was the Sith Lord Darth Sidious. Stunned that she never suspected his Sith allegiance and realizing that Sidious was the one who had taken her happiness from her, Sun was brought by Qi'ra to Crimson Dawn's flagship, the Vermillion, which housed dozens of dark side artifacts. Qi'ra explained that she had acquired many of them from her former master and would soon use them in her upcoming plan. She then revealed her plan to end the Sith's stranglehold on the galaxy and told Sun she would require her expertise in order to do so. In exchange for her service, Qi'ra would give Sun her artifacts and her old life back. Accepting Qi'ra's offer, Sun was given the task of locating the surviving Jedi Master Yoda, who Qi'ra believed would be a great asset to her plan. Sometime later, Sun returned to the Vermillion and reported to Qi'ra that Yoda was dead. Though Qi'ra was disappointed, she kept Sun around for her knowledge and conceded that Crimson Dawn would accomplish their plan themselves.\nHaving failed to recruit Yoda, Qi'ra was informed by Sun of a group of Force users who could aid her in her plan; the Knights of Ren. After telling Qi'ra about the knights' history and current status, Sun traveled with her to Varnak to meet with them. Finding them in a local bar, Qi'ra approached their leader, Ren and offered them glory and safety from the Sith if they completed a job for her in the near future. When Ren asked her what the job was, she explained that it was to steal a device called the Screaming Key from Fortress Vader on Mustafar. Much to his fellow knights' dismay, Ren accepted the offer.\nIn 3 ABY, Qi'ra learned that her old love Han Solo had been frozen in carbonite after becoming important to the Alliance to Restore the Republic, the Empire, the Hutt Clan, and other major galactic powers. She had several of her agents under the leadership of Margo capture the carbonite block from the notorious bounty hunter Boba Fett from Doctor Ragon on the moon of Nar Shaddaa. As Ragon had stabilized the carbonite, Solo remained alive as the agents transferred him to the Vermillion, where Qi'ra, wearing a hood that covered her face, greeted Margo and Trinia and learned Solo would likely remain alive. Understanding that their operation could therefore begin, Qi'ra ordered that pre-recorded invitations be sent out and tried to quell Margo's concerns about Fett coming after them.\nWith her hood covering her face to keep her identity secret, Qi'ra's hologram message was sent out to various parties, including crime lord Jabba the Hutt on the planet Tatooine and the rest of the Grand Hutt Council. In her message to Jabba, she announced the return of Crimson Dawn but claimed they would cause no friction with the galaxy's major powers, inviting him to the frozen Mid Rim planet Jekara and offering Solo as a gesture of good will. As Jabba traveled to Jerkara aboard his Shad'ruu war barge, Fett—who had received a bounty on his head after Jabba mistakenly believed he had sold Solo to Crimson Dawn—also began to journey to the planet after viewing the message Jabba received. Her message was also received by Sana Starros and Doctor Chelli Lona Aphra.\nShe also made sure the message ended up in the hands of a rebel agent named Amilyn Holdo, who would deliever the message to the wider Rebellion; Qi'ra truly hoped that Solo would end up back with the people he loved, yet she was unwilling to simply deliever him back to the Rebels, as she saw her wider plans to be more important than the happiness of individual people. As such, in her opinion, she did everything she could to ensure she could use Solo as bait while also setting the stage for the Rebels to reclaim him. Meanwhile, with the messages out, the Vermillion landed on Jekara. After landing, Qi'ra explained Solo's importance to galactic powers to Margo. Understanding that their guests would soon arrive, Qi'ra, finally putting down her hood, reflected that Solo would finally have a chance to save her. As she departed the room, she ordered Margo to finalize their preparations.\nAmidst her preparations despite truthly hoping that the Rebellion would be able to regain Solo, Qi'ra hired the Dathomirian Zabrak assassin Deathstick to pursue the bounty hunters Beilert Valance and Dengar. During her mission, Deathstick contacted Qi'ra and asked her why she couldn't just kill them. But Qi'ra told her that herding them in the right direction was an important part of her plan. She then assured Deathstick that she would get to kill them soon enough.\nAs the various syndicates began to arrive at the Vermillion, Qi'ra looked out at the crowd with Margo beside her. Margo pointed out that she seemed to be pleased, which Qi'ra confirmed, saying that she loved a good party. Once all of the bidders had arrived, Qi'ra thanked the syndicates for coming as she introduced herself and officially announced Crimson Dawn's return. She then revealed Solo to the crowd and started the bidding at one hundred thousand credits. After multiple bids from different parties, the present members of the Hutt Clan began to bid over one another with increasingly higher offers. But this soon ended when Jabba the Hutt bid with one million credits. With no other bids, Qi'ra congratulated Jabba and told him that the smuggler was his. However, the auction was then interrupted by the arrival of Darth Vader. Protected by two death troopers from his personal guard, Vader declared that Solo belonged to him, to which Qi'ra smiled and decided to see where this would go.\nAs Vader argued with Jabba over Solo, Margo asked Qi'ra how the Sith heard about the auction. Qir'a, however, replied that it didn't matter and remarked that she knew how to handle a Sith Lord. After Jabba agreed to relinquish Solo to the Empire, Qi'ra told Vader she would not interfere, but still required the one million credits promised to her. When Vader told her she was owed nothing, Qi'ra asked him if the Empire was too poor or cheap to pay its debts. This spurred Vader into igniting his lightsaber, to which Qi'ra bared her own pair of blades, intending to distract Vader so Rebel agents present at the auction had a chance to reclaim Solo. However, those agents were instead caught in a battle with Boba Fett, who had arrived to reclaim Solo as well. During the ensuing duel, Vader recognized Qi'ra's fighting style and inquired as to who had trained her, to which Qi'ra simply said someone who knew quite a bit about both Vader and his master.\nNoting that she did not have the Force and that her training would not save her, Vader used the Force to push Qi'ra back after the quick struggle, knocking her into Solo. His opponent subdued, Vader prepared to kill Qi'ra before he was distracted by the arrival of his son, Jedi Padawan and Rebel Commander Luke Skywalker. As Qi'ra retreated with Margo, she admitted that she may have been a bit overconfident in confronting the Sith. She then conceded that Vader was going to take Solo and reminded Margo of what she would have to do. Amidst the commotion on the ship, Qi'ra returned to one of her personal art galleries and studied a necklace confiscated from one of the interlopers at the auction, remarking that the amount of data stored within it would be priceless. She then told Margo to make sure that it would be secure in her absence. Returning to the gallery shortly after, Qi'ra explained to Margo that this both was and wasn't what she expected to happen. Though Vader's arrival hadn't been planned, the fact that Qi'ra fought him herself showed the galaxy that Crimson Dawn would not back down and disobey the Empire. Qi'ra then told Margo to leave her as she still had many messages to send and strings to pull.\nSoon after, she was watching from the Vermillion as the last remnants of the battle between the Hutt Council and the Empire came to a close. As Vukorah was brought into the room by Margo, Qi'ra noted the beauty in the demonstration of how the Hutts had shown the Empire's vulnerability. As their conversation continued, Qi'ra explained that Crimson Dawn would have to crush the syndicates that stood in their way. Qi'ra then emphasized that she wanted Vukorah to lead by Crimson Dawn's side as the leader of the Unbroken Clan. Qi'ra then had Margo open a box which contained something which would supposedly help Vukorah claim leadership of the Clan. Vukorah then pledged her allegiance to Crimson Dawn's cause. After Fett had regained Solo and returned him to Jabba, Qi'ra explained to her followers that the dawn had come and the real work would now begin, as they had successfully escalated tensions between the Empire and Hutts. She then told them to \"Await the reign\" as she met with more of her associates, including Ren and his knights.\nLater, Qi'ra was apparently captured by three members of the Assassins Guild and brought to the planet Saki. Acting under the orders of Darth Vader, Ochi of Bestoon traveled to the planet to deliver Vader's message that the Guild would now be serving him. The three assassins then revealed Qi'ra, offering her as a gift to Vader. Qi'ra briefly greeted Ochi, offering her regards to him and his master. After the assassins assured Ochi that no one outside of the people in the room knew of Qi'ra's imprisonment, he proceeded to kill them all before freeing Qi'ra and reciting his allegiance to Crimson Dawn.\nShortly after, Qi'ra used the Vermillion to intercept the Millennium Falcon. She then contacted the ship's current crew and asked to speak with Organa who was one of the Rebels who had tried to reclaim him at the auction. After offering her condolences to L3-37, Qi'ra was searched by Calrissian for weapons before he, Chewbacca and C-3PO left the room. Qi'ra apologized to Organa for what happened to Solo, to which Organa chastised her for auctioning Solo off and failing to save him, believing that he had been killed. Qi'ra admitted this wasn't how she wanted it to go, but that she did everything she could. She then explained that she intended for Organa to rescue Solo after the auction, though it didn't work out that way. Organa retorted that Qi'ra could've just given Solo to her, to which Qi'ra countered that she wouldn't have gotten anything out of that. She went on to say that unlike Organa, she manipulated people to get what she wanted, though she would do it Organa's way if she could.\nShe also claimed that being a rebel hero was the ending Solo deserved and that he would have walked a darker path had he stayed with her. To explain this, Qi'ra told Organa a story from her childhood on Corellia about how Solo had defended a child from a group of bullies. After this incident, Qi'ra asked Solo why he had done what he did despite not getting anything out of it. Solo responded that while that may be how the galaxy works, it might not have to be that way. With her story told, Qi'ra then revealed to Organa that Solo was in fact still alive and being held in Jabba's Palace. Chewbacca expressed joy at the news while Qi'ra asked Organa if they would rescue Solo together. Organa refused however, conceding that the Rebel Alliance needed her now more than Solo did at the moment. Qi'ra offered future aid to the Alliance before leaving the Falcon in the Vermillion.\nSoon after, Qi'ra met back up with Ochi and a few of her other new allies, including Sun, Chanath Cha and the Orphans. With all of her followers gathered, Qi'ra revealed her ultimate goal of killing Lord Sidious and Darth Vader to make the galaxy a more equal playing field for those wanting power as well as accomplishing Maul's dream to get revenge on the Emperor by stopping him and the Sith from being the galaxy's controlling interests. After sending her associates on their individual assignments, Qi'ra met with Lord Gyuti of the Black Sun. As they sat down for a drink, Qi'ra explained that Crimson Dawn wished to neutrally offer services to the larger syndicates. For if everyone needed them, then no one would destroy them. After informing the Falleen of the Empire's strained relations with the Hutts, Qi'ra suggested that the Black Sun make a play for power in case the Empire wanted a new partner in the criminal underworld. Soon, the Orphans began attacking multiple criminal strongholds, creating tension and conflict between the many syndicates, except for the Hutts. After being informed of this by Margo, Qi'ra told Trinia to have the Orphans lie low for the time being until their services were needed again. Qi'ra then said the assassins would be the next to act and that in the meantime, she would meet with Organa once more in order to recruit the Rebel Alliance.\nShortly after, Qi'ra arrived at Home One and met with Leia again. Qi'ra told her that Commander Ellian Zahra had wiped out most of the Rebel Alliance's fleet divisions and that she would give Leia the location of the last surviving one. When Leia asked Qi'ra why she was telling her this, Qi'ra said she preferred to make friends instead of enemies. Once Leia accepted Qi'ra's aid, Qi'ra asked her where Chewbacca was. Leia then took Qi'ra to a room where Chewbacca was using training remotes to prepare himself for breaking Solo out of Jabba's Palace. Qi'ra recommended that Leia take him with her to help them rescue the last division. She then offered Leia another gift; Zahra and her entire hunter squad. Qi'ra explained that she had an operative who would make sure Zahra and her group were exactly where Leia wanted them. Qi'ra went on to offer Leia one final gift; handling the Rebel Alliance's supply chain. Leia accepted Qi'ra's gifts and told her to coordinate the specifics with Holdo. Qi'ra then wished Leia luck in finding the last division before departing in the Vermillion.\nGoing onto the next phase of her plan, Qi'ra sent Ochi to assassinate the Emperor's Royal Guard on Coruscant. She then tasked Deathstick with bringing her a child named Cadeliah, who was the familial heir to both the Unbroken Clan and Mourner's Wail Syndicate. After Deathstick left, Qi'ra explained to Margo and Trinia why Ochi and Deathstick did what they did and how she had manipulated them into working for her. Sometime later, Deathstick returned to the Vermillion with Cadeliah in tow. Qi'ra then told Deathstick that the child's fate belonged to her. Upon awakening from stasis, Cadeliah asked where she was and who Qi'ra was, to which Qi'ra introduced herself and told the girl that they were going to be good friends. Later, Qi'ra had a full dinner prepared for her, Cadeliah and her own subjects. When Cadeliah hesitated to eat, Qi'ra told her that life was too short. Cadeliah then agreed before attacking Qi'ra with a knife. However, she was intercepted and held back by Vicrul, while Qi'ra reprimanded her and reminded her that her death would be just as convenient as her cooperation. Qi'ra then told Vicrul to release Cadeliah and insisted that she try the Caamasi cheese pies, to which Cadeliah begrudgingly complied.\nShortly after the heist at Fortress Vader, the Vermillion was infiltrated by T'onga and her crew aboard the Edgehawk while her wife Losha Tarkon stayed behind on their ship. Upon returning to the Vermillion, the Knights of Ren briefly fought T'onga's crew before they retreated. However, T'onga stayed on the Vermillion and tried to locate Cadeliah. In turn, Qi'ra had Margo bring T'onga before Cadeliah. T'onga attempted to bring Cadeliah with her, but Cadeliah refused, having lost trust in her after she turned on Nakano Lash. Qi'ra then entered the room alongside the Knights of Ren. T'onga ordered Qi'ra to release Cadeliah, though Qi'ra simply lowered her weapon and welcomed her aboard the Vermillion.\nAs Qi'ra and her followers watched on, T'onga tried and failed to convince Cadeliah, who believed she couldn't trust anybody, to leave with her. With Cadeliah believing that at least on the Vermillion she would be safe from those trying to capture her, T'onga fell to the floor in defeat, realizing the mission had all been for nothing. Qi'ra then assured T'onga that she and her crew could make the galaxy better by working for Crimson Dawn. Giving her a communicator, Qi'ra told T'onga to think about her offer, though not for too long since she was on a tight schedule. T'onga then returned to her wife and crew on the Edgehawk before they departed from the Vermillion.\nLater, Qi'ra was informed by Margo that the Emperor was on the verge of discovering Crimson Dawn's involvement with the Syndicate War. In response, Qi'ra told Margo to begin preparations for the next phase, inform Trinia and move their people to various staging points. She then thanked Margo for her service and hugged her before letting her go. She went on to ask Sun if she was ready. Sun said she was ready as she could be since she was relying on myths. Qi'ra told her to find the truth and had the Knights of Ren accompany her on her assignment. While the Archivist left, Qi'ra warned Cadeliah that things were going to happen very quickly and that they should talk since they might not get a later chance.\nMoving to another room, Qi'ra told Cadeliah that the crime syndicates she was the heir to had potential if they came together. When Cadeliah asked her what her point was, Qi'ra said that while they were both born into the underworld, Qi'ra did not grow up with an inheritance. She began with nothing as a child working with the White Worms and had to be better than the rest to work her way up to where she was now. She went on to explain that she couldn't trust anyone and had to make sure they would do what she wanted by either offering them something or taking something away. When Cadeliah asked if she was like that with Margo was well, Qi'ra revealed that Margo had previously tried to kill her, but started working for her when Qi'ra saw that she had value.\nJust then, she was interrupted by a transmission from her agents, informing her that the Imperial fleet had received an alert designating the Vermillion a high priority target. Qi'ra told Cadeliah to go with Trinia, saying she would do whatever she would have to. After returning to her throne, Qi'ra was contacted by Sun, who told her that what they were searching for was still there. Qi'ra thanked Sun and said she would hear from her soon before crushing her communicator. Qi'ra then explained to her followers that the Emperor would be coming for them, but she had people across the galaxy and had ordered them to cause chaos for the Empire. While the Empire was distracted, she would prepare her masterstroke and bring an end to the Sith with her \"hidden empire\".\nQi'ra was a Corellian human female with moderately short brown hair that was usually kept in a ponytail, blue eyes, and light skin. Qi'ra was a very complex woman. When she was younger she was hopeful that she could escape the criminal life and strove for something better. But as she grew older she realized that because of all the bad things she had done, there was no escaping the criminal life. Despite having grown up on the streets, she was able to adapt to a lusher lifestyle and fit in with Crimson Dawn. Having known Han for so many years, she believed she may have been the one person who could see him for who he truly was, thinking he was \"the good guy.\" She was a fighter and had been trained in combat by Vos, which helped her survive.\nA survivor at heart, she left Solo and continued to work for Crimson Dawn under Maul, later coming to lead the organization. While leader, she continued to focus on her survival, using Solo as bait to draw in various galactic powers, all while claiming Crimson Dawn would do no harm to the rest of the galaxy. Jabba the Hutt underestimated Qi'ra, claiming to the Grand Hutt Council he was certain they were ready to face the new leader of Crimson Dawn.\nUpon first seeing her old lover in carbonite, she questioned if he was conscious, disagreeing with Margo's assessment that such a state would be like Hell; to Qi'ra, if Solo was living in a fond memory or nice dream, it could be preferable to some aspects of life in the galaxy, yet she considered these musings to be unimportant when compared to her plans. She was also confident in Crimson Dawn's abilities, proclaiming that Boba Fett stood no chance against them alone. Unlike Margo, she could see how Solo united the galaxy due to his interactions with its factions, which she saw as something she could exploit. Even so, she hoped Solo would be regained by the Rebel Alliance, but she did not let that desire hold back her plans to use him.\nQi'ra had some overconfidence in her abilities, which could lead her to risky situations. Due to her training, Qi'ra thought she could handle Sith Lord Darth Vader when he barged into the auction and demanded that Solo be turned over to him. Although Qi'ra's ability impressed Vader, she was defeated when Vader used the Force against her and nearly killed her, which made her admit that she was overconfident in facing the Sith Lord.\nQi'ra was trained in the art of Teräs Käsi by Vos and later Maul. She could also wield a blaster. Qi'ra skill as a swordsman has evolved so much over time that during the auction of smuggler and rebel Han Solo, the Sith Lord Darth Vader was impressed by Qi'ra's skill when he faced her, while her skills allowed her to hold her own in a duel for a couple of minutes, her lack of Force-sensitivity ultimately meant that she stood no chance against the Dark Lord. On top of Teräs Käsi, Maul teached Qi'ra the arts of Sith combat in order to effectively counter them when faced with a Sith Lord. She was so effective at it that her style reminded Vader of Darth Sidious.\nAs a member of Crimson Dawn, Qi'ra wielded a S-195 blaster pistol. After the death of Vos, she took control of his starship First Light. When she served as leader of Crimson Dawn, Qi'ra wore a white cloak that could hide her identity with its hood. As leader, she also had the resources of Crimson Dawn at her command, leading from the starship Vermillion.\nIn combat Qi'ra wielded two electro-sword weapons which were capable of clashing with a lightsaber without being damaged.\nQi'ra was created for the 2018 Star Wars Anthology film Solo: A Star Wars Story, written by Lawrence and Jon Kasdan and directed by Ron Howard, and is portrayed by Emilia Clarke. Her casting was announced on November 18, 2016. In Star Wars: Forces of Destiny, Qi'ra was voiced by Olivia Hack.\nClarke said the filmmakers described the character to her as \"film noir\"; the character of Kathie Moffat of the 1947 seminal film noir Out of the Past was writer Lawrence Kasdan's early inspiration for Qi'ra. He conceptualized the character early in the development of the film, envisioning a Dickensian childhood for Han Solo and a young girl before other main creative talents joined the project, including his son, Jon. In this stage, the character's name was \"Kura,\" and early concept art depicted her as an alien. This design was later used as the character of Margo and her species.\nThe name Qi'ra is phonetically similar to \"Kira,\" a name that stems from George Lucas' early outline for the Star Wars sequel trilogy and was the original name for the character Rey during the development of the 2015 film Star Wars: Episode VII The Force Awakens.\nIn a series of Twitter posts featuring behind the scenes details from the production of Solo, Jon Kasdan stated that Han Solo eventually told Leia Organa how he and Qi'ra escaped from the Den of the White Worms, which led Leia to get the idea of using a thermal detonator when disguised as the bounty hunter Boushh to negotiate with Jabba Desilijic Tiure in the 1983 film Star Wars: Episode VI Return of the Jedi. However, this has not yet been stated in any canon source.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kira_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Qi%27ra",
  "/wiki/Most_Wanted",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters_Companion",
  "/wiki/Bounty_Hunters_13",
  "/wiki/Star_Wars:_Doctor_Aphra_Vol._3_%E2%80%94_War_of_the_Bounty_Hunters",
  "/wiki/Bounty_Hunters_16",
  "/wiki/Star_Wars_(2020)_18",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/Bounty_Hunters_20",
  "/wiki/Crimson_Reign_2",
  "/wiki/Crimson_Reign_5",
  "/wiki/Bounty_Hunters_23",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Corellia",
  "/wiki/31_BBY",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/White_Worms",
  "/wiki/Crimson_Dawn",
  "/wiki/Dryden_Vos",
  "/wiki/Ter%C3%A4s_K%C3%A4si",
  "/wiki/Maul",
  "/wiki/Lord",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Han_Solo",
  "/wiki/Scrumrat",
  "/wiki/Head",
  "/wiki/Proxima",
  "/wiki/Coaxium",
  "/wiki/Coronet_Spaceport",
  "/wiki/Slavery",
  "/wiki/Sarkin_Enneb",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/10_BBY",
  "/wiki/Vandor",
  "/wiki/Beckett%27s_gang",
  "/wiki/Raid_on_Kessel",
  "/wiki/Starship",
  "/wiki/Smuggler",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Dathomir",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Carbonite",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/The_galaxy",
  "/wiki/Attack_on_the_Executor",
  "/wiki/Hutt_Clan",
  "/wiki/Battle_of_Scarif",
  "/wiki/Galactic_Civil_War",
  "/wiki/Time",
  "/wiki/Standard_year",
  "/wiki/Falthina_Sharest",
  "/wiki/Imperial_Emigration_Officer",
  "/wiki/Prisoner",
  "/wiki/Mission_to_Ord_Mantell_(Qi%27ra)",
  "/wiki/IG-88B",
  "/wiki/Ord_Mantell",
  "/wiki/Weequay",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Razzi_warehouse_raid",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Kitel_Phard_vase",
  "/wiki/HK8_Sawtooth",
  "/wiki/Weequay_spherical_object",
  "/wiki/Kilogram",
  "/wiki/Andris",
  "/wiki/Spice",
  "/wiki/HK-model_gladiator_droid",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Rancor",
  "/wiki/Aiwha",
  "/wiki/Mynock",
  "/wiki/Sando",
  "/wiki/Octopod",
  "/wiki/Tuk%27ata",
  "/wiki/Corellian_hound",
  "/wiki/Val",
  "/wiki/Zarra",
  "/wiki/Cato_Neimoidia",
  "/wiki/Tobias_Beckett",
  "/wiki/Archaeologist",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/First_Light",
  "/wiki/Spice_mines_of_Kessel",
  "/wiki/Kessel",
  "/wiki/Captain",
  "/wiki/Millennium_Falcon",
  "/wiki/Sabacc",
  "/wiki/Slaver",
  "/wiki/Federation_of_Trade_Route_Allocation_and_Monetization",
  "/wiki/Chewbacca",
  "/wiki/Quay_Tolsite",
  "/wiki/Pyke_Syndicate",
  "/wiki/L3-37",
  "/wiki/Akkadese_Maelstrom",
  "/wiki/Summa-verminoth",
  "/wiki/Enfys_Nest",
  "/wiki/Cloud-Riders",
  "/wiki/Dryden_Vos%27_signet_ring",
  "/wiki/Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sith_apprentice",
  "/wiki/Rule_of_Two",
  "/wiki/Battle_of_Naboo",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Malachor",
  "/wiki/Mission_to_Tatooine_(Imperial_Era)",
  "/wiki/Tatooine",
  "/wiki/Hubin",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Stormtrooper",
  "/wiki/Syndicate_War",
  "/wiki/The_Archivist",
  "/wiki/Sava",
  "/wiki/University_of_Bar%27leth",
  "/wiki/Sith_Lord",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Knights_of_Ren",
  "/wiki/Varnak",
  "/wiki/Ren_(human)",
  "/wiki/Screaming_Key",
  "/wiki/Fortress_Vader",
  "/wiki/Mustafar",
  "/wiki/Gallin_Crae",
  "/wiki/Just_Lucky",
  "/wiki/Ariole_Yu",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Margo",
  "/wiki/Doctor",
  "/wiki/Ragon",
  "/wiki/Nar_Shaddaa",
  "/wiki/Trinia",
  "/wiki/Hologram",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Jekara",
  "/wiki/Jabba_the_Hutt%27s_Shad%27ruu_war_barge",
  "/wiki/Sana_Starros",
  "/wiki/Amilyn_Holdo",
  "/wiki/Dathomirian",
  "/wiki/Zabrak",
  "/wiki/Assassin",
  "/wiki/Deathstick",
  "/wiki/Beilert_Valance",
  "/wiki/Dengar",
  "/wiki/Death_trooper",
  "/wiki/Darth_Vader%27s_guard",
  "/wiki/Qi%27ra%27s_electro_swords",
  "/wiki/Duel_on_the_Vermillion",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Commander",
  "/wiki/Luke_Skywalker",
  "/wiki/Vukorah",
  "/wiki/Assassin%27s_Guild",
  "/wiki/Saki",
  "/wiki/Ochi",
  "/wiki/C-3PO",
  "/wiki/Unidentified_scrumrat",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Chanath_Cha",
  "/wiki/Orphans",
  "/wiki/Gyuti",
  "/wiki/Black_Sun",
  "/wiki/Falleen",
  "/wiki/Home_One",
  "/wiki/Ellian_Zahra",
  "/wiki/Remote",
  "/wiki/Hunter_Fleet",
  "/wiki/Assassination_of_the_Emperor%27s_Royal_Guard",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Coruscant",
  "/wiki/Cadeliah",
  "/wiki/Unbroken_Clan",
  "/wiki/Mourner%27s_Wail_Syndicate",
  "/wiki/Vicrul",
  "/wiki/Caamasi_cheese_pie",
  "/wiki/Heist_at_Fortress_Vader",
  "/wiki/Raid_on_the_Vermillion",
  "/wiki/T%27onga",
  "/wiki/T%27onga%27s_crew",
  "/wiki/Edgehawk_(starship)",
  "/wiki/Marriage",
  "/wiki/Losha_Tarkon",
  "/wiki/Nakano_Lash",
  "/wiki/Mission_to_a_dark_side_hellscape",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Chaos",
  "/wiki/Lightsaber_combat",
  "/wiki/S-195_blaster_pistol",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Lawrence_Kasdan",
  "/wiki/Jon_Kasdan",
  "/wiki/Ron_Howard",
  "/wiki/Emilia_Clarke",
  "/wiki/November_18",
  "/wiki/2016",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Olivia_Hack",
  "/wiki/1940s",
  "/wiki/Alien",
  "/wiki/Imroosian",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Rey_Skywalker",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Thermal_detonator",
  "/wiki/Boushh",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Category:Images_of_Qi%27ra",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Most_Wanted_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Read-Along_Storybook_and_CD",
  "/wiki/Solo:_A_Star_Wars_Story:_Meet_the_Crew",
  "/wiki/Solo:_A_Star_Wars_Story:_Han_on_the_Run",
  "/wiki/Star_Wars:_Solo_Graphic_Novel_Adaptation",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_4",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_5",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Chewbacca_-_Wookiee_Warrior",
  "/wiki/Han_Solo_-_Imperial_Cadet_1",
  "/wiki/Han_Solo_-_Imperial_Cadet_2",
  "/wiki/Han_Solo_-_Imperial_Cadet_3",
  "/wiki/Han_Solo_-_Imperial_Cadet_4",
  "/wiki/Han_Solo_-_Imperial_Cadet_5",
  "/wiki/Triplecross",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Han_Solo_%26_Chewbacca_3",
  "/wiki/Star_Wars_(2015)_58",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Jabba_the_Hutt_1",
  "/wiki/Bounty_Hunters_14",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/Star_Wars_(2020)_14",
  "/wiki/Darth_Vader_(2020)_14",
  "/wiki/War_of_the_Bounty_Hunters_2",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/Doctor_Aphra_(2020)_13",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/Star_Wars_(2020)_16",
  "/wiki/Doctor_Aphra_(2020)_14",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Darth_Vader_(2020)_17",
  "/wiki/Bounty_Hunters_17",
  "/wiki/Doctor_Aphra_(2020)_15",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_IG-88_1",
  "/wiki/Crimson_Reign_1",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Doctor_Aphra_(2020)_25",
  "/wiki/Bounty_Hunters_18",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Crimson_Reign_3",
  "/wiki/Crimson_Reign_4",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Bounty_Hunters_22",
  "/wiki/Bounty_Hunters_27",
  "/wiki/Star_Wars_(2020)_27",
  "/wiki/Star_Wars_(2020)_28",
  "/wiki/Star_Wars_(2020)_29",
  "/wiki/Hidden_Empire_1",
  "/wiki/Hidden_Empire_2",
  "/wiki/Revelations_1",
  "/wiki/Hidden_Empire_3",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/The_Chase_with_Han/Escape_with_Chewbacca",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2018_Topps_Denny%27s_Solo:_A_Star_Wars_Story",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Solo",
  "/wiki/Hasbro_Inc.",
  "/wiki/Solo:_A_Star_Wars_Story_(toy_line)",
  "/wiki/Entertainment_Weekly%27s_The_Ultimate_Guide_to_Han_Solo",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Solo:_A_Star_Wars_Story_Ultimate_Sticker_Collection",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Lando%27s_Millennium_Falcon_Expansion_Pack",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Across_the_Galaxy",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Gadgets_and_Gear",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Worldwide",
  "/wiki/Star_Wars_Insider_195",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_30",
  "/wiki/Starfighter_Aces",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Han_Solo_(Star_Wars_Encyclopedia)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Ships_of_the_Galaxy:_The_Millennium_Falcon",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Twin_Suns_(episode)",
  "/wiki/War_of_the_Bounty_Hunters_Alpha_1",
  "/wiki/Bounty_Hunters_25",
  "/wiki/February_7",
  "/wiki/June_13",
  "/wiki/May_23",
  "/wiki/July_3",
  "/wiki/2020",
  "/wiki/File:Jon-Kasdan-SoloFacts-September-14-2018.png",
  "/wiki/August_22",
  "/wiki/2017",
  "/wiki/May_19",
  "/wiki/The_Art_of_Star_Wars:_The_Last_Jedi",
  "/wiki/The_Art_of_Star_Wars:_The_Force_Awakens"
 ]
}