{
 "name": "Qiina",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Coppery red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Qiina was a female Human Jedi Master who served the Jedi Order and the Galactic Republic in the years following the Ruusan Reformation.\nA Force-sensitive Human, Qiina was trained in the ways of the Force by the Jedi Order, serving as a Jedi Master during the decade following the Ruusan Reformations that swept through the Galactic Senate and the Order. Ten years following the end of the New Sith Wars, Master Qiina resided within the Jedi Temple on Coruscant and enjoyed long days of study in the Temple Archives maintained by Chief Librarian Barra-Rona-Ban. Having studied as a Consular, Master Qiina was a learned Lore Keeper and specialized as a librarian.\nDuring one day in the Archives, Master Qiina unknowingly sat a few meters from one of the two existing Dark Lords of the Sith, Darth Zannah. The Sith, posing as Jedi Knight Nalia Adollu, sat at a nearby terminal studying the ways in which to remove the deadly orbalisks which plagued her master, Darth Bane. Qiina became openly annoyed when Zannah and her cousin Darovit, who were both trying to look up the hyperspace route to the planet Tython, started making too much noise in their haste to leave before Darovit could be questioned about his knowledge of Zannah and her master.\nNot minutes after the cousins left, Master Qiina, at the request of Master Valenthyne Farfalla, pointed out which terminal the cousins were using. After finding out where they were going, Farfalla organized a group of Jedi to follow them to Tython. There, he and the group were killed by the Sith Lords Bane and Zannah.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ruusan_Reformation",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Chief_Librarian/Legends",
  "/wiki/Barra-Rona-Ban",
  "/wiki/Jedi_Consular",
  "/wiki/Jedi_Lore_Keeper",
  "/wiki/Jedi_librarian/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Nalia_Adollu",
  "/wiki/Orbalisk",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Darovit",
  "/wiki/Hyperlane",
  "/wiki/Tython/Legends",
  "/wiki/Valenthyne_Farfalla",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}