{
 "name": "Qort",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zav Alox"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aloxian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tabakan Pak"
     ]
    }
   ]
  }
 ],
 "content": "Qort was a Aloxian male Jedi Knight in the Jedi Order during the High Republic Era. As a child, Qort was left at the doorstep of Maz Kanata, and was taken care of by Kanata and Sav Malagán before being sent away to the Order. Qort was the Padawan of Tabakan Pak, and the best friend of fellow Padawans Lula Talisola and Farzala Tarabal during his training, the former often keeping him and Tarabal out of mischief. The trio studied on the Padawan Academic Cruiser Star Hopper with Jedi Masters Yoda, Kantam Sy, and Torban Buck during the Nihil conflict.\nIn that capacity, Qort and the others were dispatched to assist the planet Trymant IV after an Emergence. In the wake of this hyperspace emergency, a group of Nihil arrived and threatened the citizens of Bralanak City. There, he witnessed Zeen Mrala use The Force, and fought the Nihil forces with the rest of the Star Hopper Jedi. After Marchion Ro escaped the planet with Krix Kamerat and Elder Tromak, Qort and the others welcomed Mrala into the care of the Jedi and returned to Starlight Beacon.\nAfter the Nihil were spotted on the Junk Moon of Quantxi, Qort, Tarabal, and Talisola followed Mrala, who had gone on her own to find Kamerat. Planetside, the Padawans once again found themselves facing scores of Nihil raiders, but were saved by an angry Savrip summoned by the Junk Mavens. Back on Starlight, Qort and Tarabal were relieved that Talisola and Mrala survived a close encounter with Kamerat.\nMonths of fighting the Nihil and the Drengir later, Qort and Tarabal were chosen to accompany Master Obratuk Glii on a diplomatic envoy to Nal Hutta aboard the Vessel. During the trip, Tarabal and Leox Gyasi went planetside while Qort stayed with his new friends Geode and Affie Hollow. Hutt Clan enforcers secretly boarded the Vessel and made it fire on the Hutts, ruining the diplomatic mission and putting Qort and Hollow at gunpoint. Thanks to Geode's fancy flying and Tarabal's conquering of his fear, Qort and his allies were able to successfully fight off the Hutt clan and open negotiations between the Hutts and the Jedi.\nAfter the attack on the Republic Fair, the Padawans reunited on Starlight, where Qort met Ram Jomaram, and the Padawans departed for Takodana to help defend the temple there from incoming Nihil attacks. During preparations, two Nihil double agents planted thermal detonators and blew up the temple, as Nihil starfighters approached. Qort's Vonduun crab mask was broken in the destruction, and as a result, he unleashed his unrestricted natural abilities, taking the Nihil on in the air and driving Kamerat away.\nBack on Starlight, Qort participated in the Great Jedi Rumble Race held by masters Buck and Sy, and later was part of a task force to find and capture Kamerat for good. Padawan Bibs found Kamerat's Nihil encampment on Dol'har Hyde, and the Padawans descended upon the world to finally capture Kamerat in the depths of his base. With Kamerat imprisoned on the Starhopper, Qort met a young Aloxian Jedi Initiate named Zint, with whom he bonded through meditation and play. On the trip back to Starlight, their masters considering their training complete, Qort and Tarabal were officially knighted as Jedi Knights, removing their Padawan braids and raising their lightsabers into the air.\nQort, a Force-sensitive Aloxian, was born during the High Republic Era. Following Aloxian custom, in order to curb the aggression members of the species were born with, he went through an initiation ritual which left him in possession of a vonduun crab skull, the wearing of which could suppress the violent tendencies. However, Qort was abducted by raiders as a young child, as Aloxians were considered valuable child soldiers. The raiders took away his helmet in order to increase his aggression.\nQort was somehow separated from his abductors, winding up among a shipment of goods that three criminals known to the pirate queen Maz Kanata were transporting. Due to the extreme strength that all Aloxians were born with, the trio were only able to contain Qort with serious difficulty, all of them being injured in the process. After they managed to seal the child in a box, the trio bandaged themselves up and delivered Qort to Kanata at Takodana Castle, hoping that she would be able to handle him, the criminals themselves having become terrified of the child. Initially assuming that the three were up to shenanigans, Kanata was surprised when she opened the box to find Qort inside. Bringing him inside the castle, Kanata enlisted the help of her loadlifter droid steward HURID-327, but despite HURID's best efforts Qort would not stop crying.\nWhen Kanata went off to get some milk to feed the child with, Qort used his natural strength and untrained Force powers to incapacitate the loadlifter droid, leaving him in pieces on the floor, before escaping to Takodana Castle's basement storerooms, full of the pirate queen's treasures. There, Qort found a vonduun crab skull Kanata had been given by her friend Farks, putting it on just before Kanata found him, having been directed after the child by HURID. Calmed by the helmet, Qort would not remove it and did not destroy anything else.\nTrying to discover the origins of the child, Kanata called on Farks for information about the skull, and the Patrolian told her about the Aloxians and the importance of the helmets to their culture. Farks further speculated that the child had been kidnapped by Argoban raiders, who were known for such practices. Qort surprised the Patrolian after having been played with by HURID, as Farks had not expected the child to be using the crab skull which had been gifted to Kanata. The pirate queen, deciding that the information changed things, decided to get some assistance from Sav Malagán, a Jedi Master stationed at the nearby Jedi Temple and a long-time friend of hers. Qort's Force-sensitivity was eventually discovered, and he was taken to the Jedi Order by Yoda. As a Jedi youngling, Qort became best friends with two other younglings, the Zygerrian Farzala Tarabal and the human Lula Talisola, and Talisola frequently looked out for Tarabal and Qort. As younglings, the three would eagerly watch holodramas of famed Jedi Master Tal Bota, eagerly imagining their future as Jedi.\nEventually, Qort became a member of a class of Padawans training aboard the Jedi cruiser Star Hopper under Grand Master Yoda and Jedi Master Torban Buck. The Star Hopper was dispatched to Trymant IV to aid the civilians during an Emergence. Yoda requested that Tarabal and Qort investigate the origin of the debris. They tracked it as a reaction from the Hetzal system. Once the Padawans landed, Qort and Bibs, another Padawan, followed Talisola and Tarabal with a hover platform with civilians. The Padawans confronted a group of Nihil raiders and requested their Spider Cruiser for transporting citizens offworld. The Nihil denied this request, and began fighting the Jedi. Qort deflected blaster bolts with his lightsaber as the group advanced towards the ship. Unbeknownst to the Padawans, a massive chunk of debris hurtled towards them, but Zeen Mrala, a Force-sensitive native saved their lives.\nSoon, Nihil reinforcements arrived and surrounded the Jedi. Masters Yoda and Buck arrived to rescue the young Padawans. While Yoda left to rescue Mrala's friend Krix Kamerat, Qort, Mrala, Bibs, Buck, Talisola, and Tarabal continued to fight the Nihil forces. Soon, Republic forces arrived as support, and the Star Hopper travelled back to Starlight Beacon. Onboard the ship, Qort and Tarabal comforted Mrala as she mourned all she had lost.\nOver the next week, Qort and his friends accepted Mrala into their group as they trained in the Jedi temple on the station. Avar Kriss, Estala Maru, Kantam Sy, Torban Buck, and Yoda debated whether or not Mrala should be trained as a Jedi. The Padawans defended her, and they told of her heroics. Qort mimicked the falling debris and her quick thinking in saving their lives. Later, the masters formulated a plan to board the Nihil Spider Cruiser. Qort, Tarabal, and Bibs played as Jedi and Nihil as they imagined a quick battle.\nThe masters allowed Mrala to stay on Starlight Beacon, and Talisola began teaching basic Force meditation practices. A routine Jedi patrol engaged with Nihil raiders in the Bright Jewel system. Qort and the other Padawans were left behind on Starlight Beacon for their safety. Tarabal and Qort agreed that they would be safer on Starlight Beacon, as Talisola was anxious to fight in the skirmish. The trio discovered Mrala's abandoned room and a message on Kamerat's holoprojector, revealing her intent to rescue Kamerat. They knew she would return, as her pet cru Cham Cham clung to Qort's mask. The trio crammed into a Vector and flew to rescue Mrala.\nThe signal from the holoprojector led to Quantxi, a junk moon orbiting Ord Mantell. The trio spotted Nihil raiders massacring native Junk Mavens and leapt to the rescue. While Talisola continued to search for Mrala, Qort and Tarabal fought for the Junk Mavens. As the Nihil became overwhelming for Qort and Tarabal, the Junk Mavens summoned a Savrip to defend them, and soon enough, Masters Buck, Sy, and Yoda came to the rescue. After realizing she needed their help more, Tarabal sent the Masters to help Talisola, while he and Qort held off the Nihil warriors. After the battle, Qort reunited with Talisola and Mrala at the Republic Outpost on Ord Mantell, thankful they survived the encounter with Kamerat.\nOn a diplomatic envoy to Bilbousa, the capital of Nal Hutta, Qort accompanied the crew of the Vessel, Tarabal, and his master, Obratuk Glii. The Hutts had requested the Jedi envoy because of their alliance against the Drengir. Because of Obratuk, the diplomat of the crew's hibernation, Tarabal was sent to meet the Hutts in his place, leaving Qort on the Vessel with Affie Hollow and Geode. The latter, he shared a bonding moment with. While the diplomatic mission was beginning planetside, several Hutt Cartel enforcers boarded the Vessel and forced it to fire on the planet, ruining the chances of successful negotiations, and leading to Tarabal and Leox Gyasi's imprisonment. With the help of Geode's piloting skills, Hollow's trickery, and his own Jedi abilities, Qort and the others engaged the enforcers. Caught in a standoff, they were saved by Master Obratuk and his many lightsabers, while Tarabal was able to complete the negotiations. Qort and Glii witnessed Tarabal's successful via hologram.\nBack on Starlight Beacon, Qort reunited with Lula Talisola and Zeen Mrala, introducing them to his new friend Ishnar Ti-Kharatal, and meeting fellow Padawan Ram Jomaram. The group made their way to the Beacon's meditation chambers to meet with Master Buck and Master Sy, as the two masters wanted to give the Padawans a chance to ask questions about the confusing goings-on of the Galaxy and Jedi Order in the recent months. After being bombarded with questions about Loden Greatstorm and the Nihil, the masters tell the Padawans about a specific Nihil cell that has been wreaking havoc on part of the Galaxy. They soon depart for the Jedi Temple on Takodana, to aid Sav Malagán against the Nihil that recently attempted to attack her temple.\nThe Star Hopper arrived on Takodana, Qort's former home, and the Jedi were met by Malagán and Maz Kanata, who greeted Qort with a hug. The preparations for defense began, and the Padawans were introduced to Bareen and Sabata Krill, sisters who supposedly defected from the Nihil and wanted to help. Qort was aiding Malagán and Talisola in setting up weaponry when Malagán spotted Sabata sneaking around, simultaneously receiving information that the Nihil were back. A moment later, Sabata ignited many hidden thermal detonators around the temple, causing a very large explosion.\nThe temple was largely destroyed, but the Padawans and Jedi survived. Qort's skull mask was also destroyed in the explosion, revealing his face and light hair. For a moment, he huddled over the crumbled mask and held it to his face, until he noticed several Nihil ships approaching the wreckage. Qort summoned his lightsaber and took to the skies, jumping from fighter to fighter, taking out the Nihil's ships as Malagán once did. After dealing with the immediate therat, Qort landed back on the ground and reintroduced his new self to his padawan friends, who embraced him with a hug.\nBack on Starlight Beacon, Masters Kantam Sy and Torban Buck brought back the Great Jedi Rumble Race from their childhood for the Padawans to have some fun during this difficult time. This race was a run around the beacon, and according to the masters, it had no rules at all, except to not blow anything up. Qort participated in the Rumble Race, even voicing his excitement by saying he's been waiting his whole life for this moment before it began. Throughout the beacon, Qort ran at the pace of his friends, despite being naturally faster than them, because he wanted to have as much fun as possible and keep pace. As him and his friends were approaching the finish line, Master Buck dove over and won the race for himself.\nAs part of a newly formed task force to find Krix Kamerat and his Nihil cell, Qort and many other Jedi gathered onboard Starlight Beacon for a briefing on a developing Nihil situation on Corellia. Master Sy volunteered to go, and placed Talisola and Buck in charge of the force while they were gone. Soon after, on a patrol, Bibs spotted Sabata Krill's fighter above the jungle planet Dol'har Hyde, confirming the location of the Nihil cell's encampment. Departing for the world, Qort and Farzala occupied a Vector together. Descending into a dogfight, the Jedi met the Nihil and their fighters in the skies above Dol'har Hyde. The battle roaring, Zeen Mrala's vector was heavily damaged, so she crashed into Kamerat's fighter, taking him down with her. Meeting Mrala on the ground, Qort and the other Padawans charged after Kamerat into the depths of the Nihil encampment. Eventually reaching Krix, the Padawans struggled to not ignite spilled Rhydonium in the chamber, but Tarabal eventually took Kamerat's gun and the Jedi finally captured the young man. Qort and Tarabal celebrated with a high-five after completing the mission.\nOnboard the Starhopper, Kamerat was imprisoned and questioned by Mrala about the Nihil's future plans. During this time, a new group of younglings arrived and were sent to their quarters Farzala. Shortly after, Qort met a young initiate named Zint, a fellow Aloxian who took special interest in Qort. They shared a moment and bonded over their kinship. later, Tarabal walked in on Qort and Zint meditating together and joined them. This eventually turned into playing with the young Aloxian, during which the two Padawans reflected on their time as friends and adventures together. Masters Tabakan Pak, Glii, and Buck soon approached the two and asked if they knew where Lula Talisola was, and to report to the bridge in their formal robes. Talisola then arrived, and was asked by Buck if she was ready to be knighted, to which she said no, as she didn't feel ready. Qort and Tarabal were surprised by this, but respected their friend's decision nonetheless. Masters Pak and Glii, with the help of Master Buck, then knighted their Padawans, and Qort and Farzala Tarabal officially became Knights of the Republic. They raised their lightsabers in the air and repeated the Jedi mantra \"for light and life\", accepting their new roles.\nDuring the Destruction of Starlight Beacon, Jedi investigator Emerick Caphtor and Sian Holt boarded the top half of the station to hopefully save survivors and to investigate the nameless creatures that killed Loden Greatstorm and several other Jedi. Qort, Zint, Master Buck, and many younglings, emerged from the shadows and were thankful to find the two newcomers, hoping they could help. The younglings boarded Caphtor's ship, while the Jedi, Beesar Tal-Apurna, and Kisma Uttersond pushed back into the station to face the creatures. Holt and Caphtor confronted one of them, and Caphtor managed to resist it's trickery so he could slice off its hand with his lightsaber. After this, Nihil soldiers charged in, and Qort and Buck provided cover as the group retreated. Returning back into the station to provide an exit for the others, Master Buck sent Qort with Caphtor as they departed the doomed beacon. Onboard the escaping craft, Qort comforted Zint and the other distraught younglings.\nQort had deep blue skin and brown eyes. The Padawan was also quite short, although he was taller than the diminutive Master Yoda. Qort understood Galactic Basic Standard but did not speak it at first, communicating in an alien language while he wore his mask, speaking a mix of basic and his original language once it was removed. Qort was kindly, being quick to back up Lula Talisola's statement that she and her friends would support Zeen Mrala while the Mikkian girl was crying over being separated from her best friend. As he grew up, Qort used his kindness with younglings like Zint in both making them feel welcome, playing with them, and comforting them when Starlight Beacon was destroyed.\nQort could use the Force, and was talented enough in lightsaber combat to battle pirates on Trymant IV, and Nihil and Drengir across the galaxy. Aloxians are born incredbly violent and strong, but their urges are balanced out by the crab skull they wore until maturity. Qort used this natural strength and power to fight the Nihil in the skies above Nymeve Lake. He was also, according to Farzala Tarabal, exceedingly quick.\nQort spoke in Aloxian, and as described by Zeen Mrala, spoke in a scratchy little voice. This came in handy and allowed him to speak with Zint when he first met the younger Aloxian.\nQort wore brown Jedi robes and wielded a blue-bladed lightsaber. Qort wore a sash on his robes that matched the color of his lightsaber, as was Jedi tradition. From his infancy until his return to Takodana, the Aloxian apprentice wore a traditional vonduun crab skull mask which covered almost all of Qort's head save for the eyes, mouth and chin. The mask had a texture of crown-like spikes radiating from it. The mask was destroyed during the Nihil attack on Takodana, which allowed Qort to fully unleash his skills.\nQort debuted in the first issue of the comic book series Star Wars: The High Republic Adventures. Qort's mask bears a striking resemblance to Darth Krayt's vonduun crab armor helmet from the Legends comic book Star Wars: Legacy. In the Canon comic Doctor Aphra  35, set during the Imperial Era, a helmet very similar to Qort's is visible in the Gallery of Peace.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Qort",
  "/wiki/Zav_Alox",
  "/wiki/Aloxian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Tabakan_Pak",
  "/wiki/Jedi_Knight",
  "/wiki/High_Republic_Era",
  "/wiki/Maz_Kanata",
  "/wiki/Sav_Malag%C3%A1n",
  "/wiki/Padawan",
  "/wiki/Lula_Talisola",
  "/wiki/Farzala_Tarabal",
  "/wiki/Padawan_Academic_Cruiser",
  "/wiki/Star_Hopper",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Kantam_Sy",
  "/wiki/Torban_Buck",
  "/wiki/Nihil_conflict",
  "/wiki/Planet",
  "/wiki/Trymant_IV",
  "/wiki/Trymant_IV_disaster",
  "/wiki/Emergences",
  "/wiki/Nihil",
  "/wiki/Bralanak_City",
  "/wiki/Zeen_Mrala",
  "/wiki/The_Force",
  "/wiki/Jedi",
  "/wiki/Marchion_Ro",
  "/wiki/Krix_Kamerat",
  "/wiki/Elders",
  "/wiki/Tromak",
  "/wiki/Starlight_Beacon",
  "/wiki/Quantxi",
  "/wiki/Mantellian_Savrip",
  "/wiki/Junk_Mavens",
  "/wiki/Drengir",
  "/wiki/Obratuk_Glii",
  "/wiki/Nal_Hutta",
  "/wiki/Vessel",
  "/wiki/Leox_Gyasi",
  "/wiki/Geode",
  "/wiki/Affie_Hollow",
  "/wiki/Hutt_Clan",
  "/wiki/Hutt",
  "/wiki/Attack_on_Valo",
  "/wiki/Republic_Fair",
  "/wiki/Ram_Jomaram",
  "/wiki/Takodana",
  "/wiki/Jedi_Temple_(Takodana)",
  "/wiki/Thermal_detonator",
  "/wiki/Vonduun_crab",
  "/wiki/Great_Jedi_Rumble_Race",
  "/wiki/Bibs",
  "/wiki/Dol%27har_Hyde",
  "/wiki/Battle_at_Dol%27har_Hyde",
  "/wiki/Jedi_Initiate",
  "/wiki/Zint",
  "/wiki/Knighting_ceremony",
  "/wiki/Padawan_braid",
  "/wiki/Lightsaber",
  "/wiki/Force-sensitive",
  "/wiki/Species",
  "/wiki/Bone",
  "/wiki/Soldier",
  "/wiki/Helmet",
  "/wiki/Pirate",
  "/wiki/Queen",
  "/wiki/Takodana_Castle",
  "/wiki/Loadlifter_droid",
  "/wiki/HURID-327",
  "/wiki/Milk",
  "/wiki/Force_power",
  "/wiki/Droid",
  "/wiki/Crab",
  "/wiki/Farks",
  "/wiki/Patrolian",
  "/wiki/Argoban",
  "/wiki/Zygerrian",
  "/wiki/Human",
  "/wiki/Holodrama",
  "/wiki/Tal_Bota",
  "/wiki/Cruiser",
  "/wiki/Grand_Master",
  "/wiki/Hetzal_system",
  "/wiki/Hover_platform",
  "/wiki/Spider_Cruiser",
  "/wiki/Starlight_Beacon%27s_Jedi_temple",
  "/wiki/Avar_Kriss",
  "/wiki/Estala_Maru",
  "/wiki/Bright_Jewel_system",
  "/wiki/Holoprojector",
  "/wiki/Cru",
  "/wiki/Cham_Cham",
  "/wiki/Jedi_Vector",
  "/wiki/Ord_Mantell",
  "/wiki/Savrip",
  "/wiki/Republic_Outpost",
  "/wiki/Bilbousa",
  "/wiki/Diplomat",
  "/wiki/Sleep",
  "/wiki/Hutt_Cartel",
  "/wiki/Pilot",
  "/wiki/Obratuk_Glii%27s_lightsabers",
  "/wiki/Hologram",
  "/wiki/Ishnar_Ti-Kharatal",
  "/wiki/Meditation_chamber",
  "/wiki/Loden_Greatstorm",
  "/wiki/Bareen_Krill",
  "/wiki/Sabata_Krill",
  "/wiki/Corellia",
  "/wiki/Rhydonium",
  "/wiki/Jedi_robes",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Jedi_investigator",
  "/wiki/Emerick_Caphtor",
  "/wiki/Sian_Holt",
  "/wiki/Nameless",
  "/wiki/Beesar_Tal-Apurna",
  "/wiki/Kisma_Uttersond",
  "/wiki/Eye",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Mikkian",
  "/wiki/Lightsaber_combat",
  "/wiki/Nymeve_Lake",
  "/wiki/Aloxian_(language)",
  "/wiki/Mouth",
  "/wiki/The_High_Republic_Adventures_(2021)_1",
  "/wiki/Star_Wars:_The_High_Republic_Adventures_(IDW_Publishing_2021)",
  "/wiki/Darth_Krayt",
  "/wiki/Vonduun_Skerr_Kyrric",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Doctor_Aphra_(2016)_35",
  "/wiki/Imperial_Era",
  "/wiki/Gallery_of_Peace",
  "/wiki/The_High_Republic_Adventures_(2021)_2",
  "/wiki/The_High_Republic_Adventures_(2021)_3",
  "/wiki/The_High_Republic_Adventures_(2021)_4",
  "/wiki/The_High_Republic_Adventures_(2021)_5",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/The_High_Republic_Adventures_(2021)_7",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_9",
  "/wiki/The_High_Republic_Adventures_(2021)_10",
  "/wiki/The_High_Republic_Adventures:_Galactic_Bake-Off_Spectacular",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_Midnight_Horizon_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/Category:Images_of_Qort",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Accessories_and_Structures",
  "/wiki/Databank_(website)",
  "/wiki/IDW_Publishing",
  "/wiki/Legacy_(2006)_1"
 ]
}