{
 "name": "Quarrie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown and white mottle"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Project Shantipole",
      "Project Shantipole"
     ]
    }
   ]
  }
 ],
 "content": "Quarrie was a Mon Calamari male who built a prototype B-wing starfighter on the remote planet Shantipole some time after the Siege of Lothal. After the B-wing was used in the blockade of Ibaar, Project Shantipole continued under Quarrie's supervision.\nQuarrie was a Mon Calamari starship engineer who lived on the remote planet of Shantipole during the Age of the Empire. After the early rebellion suffered losses against the Galactic Empire during an attempted blockade run, rebel Hera Syndulla and members of her crew came to Shantipole in order to retrieve the prototype B-wing, Prototype B6, which he dubbed the \"Blade Wing.\" Quarrie was initially uninterested, as he did not believe Syndulla to be the right pilot for his ship. However, her story of growing up and dreaming of being a pilot swayed Quarrie, and he allowed her to test the starfighter.\nAfter a successful test run, the starfighter was taken back to the network's fleet. For the journey, he also installed a hyperdrive and an exterior astromech socket on Hera's shuttle Phantom. The Phantom then towed the B-wing prototype to the planet Ibaar. With the B-wing's advanced weaponry, the rebels broke the Imperial blockade over the planet Ibaar and delivered food to the planet's starving populace. Afterwards, Quarrie, along with his Lothal astromech droid BG-81, left the network fleet in order to oversee the production of more B-wings for the rebel cause.\nQuarrie and BG-81 eventually joined the Alliance to Restore the Republic on Home One, where he served as a mechanic alongside the Freemakers.\nQuarrie was a short, male Mon Calamari master engineer who specialized in building starships. He took pride in his work and was eager to experiment with speed, agility, and weapons. Quarrie was not a pilot, and was only willing to let the best pilot fly his Prototype B6 starfighter. His prototype B6 became the basis for the rebellion's A/SF-01 B-wing starfighter.\nQuarrie's name is derived from the name of concept artist Ralph McQuarrie. He first appeared in the Star Wars Rebels Season Two episode \"Wings of the Master,\" which premiered on Disney XD on November 11, 2015. He was voiced by Corey Burton, who later reprised the role in the second season of LEGO Star Wars: The Freemaker Adventures.\nIn the second season of The Freemaker Adventures, Quarrie works as an engineer for the Rebel Alliance, serving aboard the rebel flagship Home One. Quarrie encountered Rowan Freemaker while running an errand for General Syndulla. After learning that Quarrie was looking for spare parts to build a starship that could change the tide of the Galactic Civil War, Rowan invited Quarrie to accompany his family on a salvage run to the planet Tibalt. There they encountered the Emperor Palpatine's new hunter droid M-OC but escaped the droid.\nAfter Rowan experienced a Force vision calling him to build a powerful starship called the Arrowhead, he related his vision to Quarrie. Since Rowan was unable to describe the ship, Quarrie took him and the B1-series battle droid Roger to the city of Alistan Nor on the planet Alistan Nor to get a sense of style and craftsmanship. There, Rowan experienced a vision of the Arrowhead. Though they were attacked by M-OC again, the trio managed to escape.\nQuarrie assisted the Freemakers by helping to build the Arrowhead. He stayed aboard the Home One while the Freemakers embarked on a quest to gather the components of the starship including an embersteel blade, a proton suspension housing, an energy matrix activator, and a giant kyber crystal.\nThough the Freemakers found a giant kyber crystal, their return coincided with an Imperial attack on the rebel fleet. Since it was dangerous to assemble the Arrowhead during a space battle, Quarrie got the Freemakers and Alliance pilot Lieutenant Colvett Valeria to take the Arrowhead to the deserted planet of Jakku. After the Arrowhead sank into quick sand and exploded, Quarrie and Rowan worked together to rebuild the ship. Though the ship's energy matrix activator fell into the hands of the Imperial officers Durpin and Plumestriker, the two rebuilt the Arrowhead, which played an important role in defeating the Imperial fleet and forcing them to retreat.\nFollowing the quest to build the Arrowhead, Quarrie recommended that Rowan take the time to rest while Rowan's older siblings Zander and Kordi Freemaker flew the Arrowhead in combat and advised Alliance High Command. However, Rowan and a reluctant Roger embarked on a mission to rescue his Lurmen friend Maynar. However, this turned out to be a trap by M-OC, who captured Rowan. Darth Vader then captured Rowan, wanting to use the boy to find more kyber crystals.\nFollowing the Freemakers' mission to rescue Rowan, Quarrie flew the Freemakers' ship StarScavenger into the Coruscant system and rescued them from M-OC, who had acquired the Arrowhead. With M-OC pursuing them, Quarrie convinced the Freemakers to flee to Shantipole, where he still had a base. There, Quarrie and the Freemakers worked together to trap and destroy M-OC. In a skirmish, both the Arrowhead and the StarScavenger were destroyed, but M-OC survived. Before M-OC could kill Rowan, Rowan convinced him to end the hunt but accidentally convinced the droid that the Empire had a flaw in the second Death Star.\nAfter Rowan rebuilt the StarScavenger incorporating parts of the Arrowhead, Quarrie accompanied the Freemakers to Sullust, only to discover that the rebel fleet had departed for the Battle of Endor. After Rowan retrieved the Kyber Saber from the lava fields of Sullust, Quarrie and the Freemakers took part in the Battle of Endor. They breached the second Death Star's deflector shield but were captured by stormtroopers. However, they were freed by Zander's love interest Becky Smoochenbacher. Quarrie, Zander, Kordi, and Roger returned to their ship and rescued Rowan, who defeated M-OC and allowed the rebels to destroy the second Death Star's reactor core. Following the Battle of Endor, Quarrie was present at the rebel celebrations at Bright Tree Village, where he suggested modifications to the X-wing design to Lieutenant Valeria.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Databank_A-Z",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Mon_Cala",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Project_Shantipole",
  "/wiki/Sabine_Wren",
  "/wiki/Prototype_B6",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Planet",
  "/wiki/Shantipole",
  "/wiki/Siege_of_Lothal",
  "/wiki/Blockade_of_Ibaar",
  "/wiki/Starship",
  "/wiki/Engineer",
  "/wiki/Imperial_Era",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/Galactic_Empire",
  "/wiki/Blockade",
  "/wiki/Hera_Syndulla",
  "/wiki/Spectres",
  "/wiki/Pilot",
  "/wiki/Starfighter",
  "/wiki/Hyperdrive",
  "/wiki/Shuttle",
  "/wiki/Phantom",
  "/wiki/Ibaar",
  "/wiki/Foodstuff",
  "/wiki/Lothal_astromech_droid",
  "/wiki/BG-81",
  "/wiki/Fleet",
  "/wiki/Home_One",
  "/wiki/Freemakers",
  "/wiki/Ralph_McQuarrie",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Wings_of_the_Master",
  "/wiki/Disney_XD",
  "/wiki/November_11",
  "/wiki/2015",
  "/wiki/Corey_Burton",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures_Season_Two",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Rowan_Freemaker/LEGO",
  "/wiki/General",
  "/wiki/Galactic_Civil_War",
  "/wiki/Freemakers/LEGO",
  "/wiki/Mission_to_Tibalt",
  "/wiki/Tibalt/LEGO",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Hunter_droid/LEGO",
  "/wiki/M-OC/LEGO",
  "/wiki/Force_vision",
  "/wiki/Arrowhead_(Freemakers)",
  "/wiki/Mission_to_Alistan_Nor",
  "/wiki/B1-series_battle_droid",
  "/wiki/R0-GR/LEGO",
  "/wiki/Alistan_Nor",
  "/wiki/Alistan_Nor_(planet)",
  "/wiki/Quest_to_build_the_Arrowhead",
  "/wiki/Embersteel",
  "/wiki/Kyber_crystal",
  "/wiki/Attack_on_the_Rebel_Fleet",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Lieutenant",
  "/wiki/Colvett_Valeria",
  "/wiki/Jakku",
  "/wiki/Imperial_officer",
  "/wiki/Durpin",
  "/wiki/Plumestriker",
  "/wiki/Zander_Freemaker",
  "/wiki/Kordi_Freemaker/LEGO",
  "/wiki/Alliance_High_Command",
  "/wiki/Lurmen",
  "/wiki/Maynar",
  "/wiki/Capture_of_Rowan_Freemaker",
  "/wiki/Anakin_Skywalker",
  "/wiki/Rescue_of_Rowan_Freemaker",
  "/wiki/StarScavenger",
  "/wiki/Coruscant_system",
  "/wiki/Skirmish_on_Shantipole",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Sullust",
  "/wiki/Battle_of_Endor",
  "/wiki/Kyber_Saber",
  "/wiki/Deflector_shield",
  "/wiki/Becky_Smoochenbacher",
  "/wiki/Bright_Tree_Village",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Trouble_on_Tibalt",
  "/wiki/The_Tower_of_Alistan_Nor",
  "/wiki/The_Embersteel_Blade",
  "/wiki/The_Storms_of_Taul",
  "/wiki/Return_to_the_Wheel",
  "/wiki/The_Lost_Crystals_of_Qalydon",
  "/wiki/Flight_of_the_Arrowhead",
  "/wiki/A_Perilous_Rescue",
  "/wiki/Free_Fall",
  "/wiki/Return_of_the_Return_of_the_Jedi",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_The_Last_Jedi:_Incredible_Cross-Sections",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Droidography",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Databank_(website)"
 ]
}