{
 "name": "Quarg%27s_father",
 "display_name": "Quarg's father",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Korteen asteroid belt"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Ship-dwellers"
     ]
    }
   ]
  }
 ],
 "content": "Quarg's father was the original leader of the ship-dwellers after they were stranded on the planet Drexel.\nThe father of the future Governor Quarg was the governor of the Korteen asteroid belt during the days of the Galactic Republic, where he used his authority to cover up space-wrecking. Under his leadership the asteroid miners, really scavengers, used sonic jammers to disrupt starships and cause them to crash into asteroids. The governor then got a portion of the scavenger's profits from recovering and selling the cargo and scrap. Eventually, however, this drew the attention of the Jedi Order, and Quarg's father was forced to flee from Jedi Knights. His ship was badly damaged, but he and his followers managed to escape to the Drexel system, where they wrecked on the planet Drexel. These people became the ship-dwellers, and Quarg's father became their first governor.\nDrexel was short on metal, so to gather needed supplies Quarg's father continued to use a sonic jammer to wreck ships that passed into the system. His technicians warned that this policy was causing attacks from the native Sea-dragons, but Quarg's father did not listen. The technicians revolted, but Quarg's father put down the uprising. However, rather than kill the mutineers he instead set them adrift, intending for them to perish on Drexel's endless ocean. These technicians survived and became the Dragon Lords, enemies of the ship-dwellers.\nQuarg's father was a greedy man who abused the power of his office to gain wealth, but ultimately was either not clever enough or not lucky enough to hide his misdeeds from the Jedi Order. Governor Quarg spoke of his father often, but ultimately thought him a fool who was never able to tame the planet Drexel. Quarg considered the most foolish move of his father's life to be his mercy during the technician's rebellion. Quarg's father chose to set the ringleaders of the rebellion adrift rather than killing them, a move Quarg dismissed as \"stupid\".\nQuarg's father had a superstitious view of the Jedi Knights, both hating and fearing them, and likening them to warrior priests or wizards.\nQuarg's father wore a blue uniform with a red cape and a green helmet, which he passed down to Quarg who wore it when he met Luke Skywalker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Korteen_asteroid_belt",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ship-dweller",
  "/wiki/Planet/Legends",
  "/wiki/Drexel/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Quarg",
  "/wiki/Asteroid_mine",
  "/wiki/Scavenger",
  "/wiki/Sonic_jammer",
  "/wiki/Starship/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Drexel_system",
  "/wiki/Technician/Legends",
  "/wiki/Sea-dragon",
  "/wiki/Dragon_Lords",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Star_Wars_(1977)_12",
  "/wiki/Star_Wars_(1977)_13",
  "/wiki/Star_Wars_(1977)_14"
 ]
}