{
 "name": "Quarsh_Panaka",
 "display_name": "Quarsh Panaka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Onoam"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later with flecks of gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Royal Naboo Security Forces",
      "Royal Naboo Security Forces",
      "Galactic Republic",
      "Republic Special Task Force",
      "Republic Special Task Force",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Quarsh Panaka was a human male native to the planet Naboo and a security forces captain who served the Royal House of Naboo as the Head of Security during the final years of the Galactic Republic. When the Trade Federation invaded Naboo in 32 BBY, Panaka fled the planet, accompanying Queen Padmé Amidala to Tatooine and then Coruscant before ultimately returning to Naboo in order to liberate their homeworld. He later acquired the title of Moff during the rise of the Galactic Empire. He was assassinated by Saw Gerrera's Partisans in 3 BBY.\nThe human male Quarsh Panaka was born during the final decades of the Galactic Republic. He hailed from Naboo, an idyllic planet that was inhabited by peaceful humans known as the Naboo and a species of sentient amphibians called the Gungans. In his youth, he gained combat experience in a Republic Special Task Force that fought against space pirates in his native Chommell sector. Eventually, he became Head of Security for the Royal House of Naboo, overseeing every branch of the volunteer Royal Naboo Security Forces, namely the Naboo Palace Guard, the Security Guard, and the Space Fighter Corps. He lived in his private residence in Theed. Panaka was married to Mariek Panaka and had a niece named Versé and a nephew named Gregar Typho.\nBy 32 BBY, Panaka served under the fourteen year old Queen Padmé Amidala of the Naboo, whose safety he was personally entrusted with. Because he knew his world was vulnerable to planetary assaults, Panaka advocated for stronger security measures, but the Queen's Advisory Council convinced her otherwise. That year, however, the shipping and trade conglomerate known as the Trade Federation decided to blockade and invade Naboo in retaliation to the taxation of the Free Trade Zone voted by the Republic's Galactic Senate.\nWhen the battle droids of the Trade Federation raided the palace, both Panaka and his queen were taken into custody. However, unbeknownst to the enemy, the captain initiated a scheme in which one of the Amidala's handmaidens served as a decoy. Although the real queen was captured as well, the Neimoidian overlords of the Federation were fooled, and focused on the impersonator, a handmaiden named Sabé. Along with the queen, Governor Sio Bibble, and several security guards, Panaka was escorted out of the palace.\nAs the Naboo party were on their way to a detention camp, two Jedi and a Gungan jumped from a balcony to begin an attack and rescue the queen. Said Jedi, Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi, were Republic ambassadors that had been sent to resolve the dispute behind the blockade. However, this attempt was to no avail, so Panaka begrudgingly agreed with the Jedi's plan to take the queen with them to Coruscant, capital of the Republic, where she would plead her cause before the Senate. The party then retook the Theed Hangar from the battle droids stationed there, entered Amidala's Royal Starship, and quickly fled Naboo. However, in trying to slip through the blockade, the ship's hyperdrive engine took heavy damage. When Kenobi suggested that they land on the desert world of Tatooine for repairs, Panaka protested vigorously, arguing that the planet was ruled by Hutt gangsters. The queen, in contrast, sided with the Jedi.\nOnce they arrived at Tatooine, Panaka remained on the ship while Jinn, their Gungan ally Jar Jar Binks, the astromech droid R2-D2, and Amidala—disguised as a mere handmaiden—went scouting for spare parts for the hyperdrive. At one point, the ship received a garbled transmission of a Sio Bibble hologram in which he pleaded with the Queen to contact him. However, Kenobi suspected a trick, and he ordered Panaka and the others to send no reply nor transmission of any kind.\nEventually, Jinn and Amidala managed to obtain the missing hyperdrive parts thanks to the help of a local slave boy named Anakin Skywalker, who earned his freedom in the process. The party then traveled to Coruscant, where they met Naboo's representative in the Senate, Sheev Palpatine. Anticipating an ambush by the Federation, Panaka accompanied Amidala to the Senate Chamber, where she and Palpatine pleaded their cause. The Senate, however, would not budge, so the Queen decided to return to Naboo and take the matter into her own hands. Panaka strongly objected, claiming that she would be captured and forced to sign a treaty that would legitimize the invasion.\nWhile the Queen set off to make contact with Boss Rugor Nass, leader of the Gungan people, Panaka organized the few Naboo security volunteers not captured by the Trade Federation into battle groups, who brought with them Flash speeders and Gian heavy patrol speeders. Eventually, the leaders met to discuss strategy. It was decided that the militiagungs of the Gungan Grand Army would engage the droid army out of the city, while the Jedi and the Naboo would infiltrate the Royal Palace to try and capture Nute Gunray, Viceroy of the Trade Federation.\nUsing secret passages on the waterfall side of Theed, Panaka divided his forces in two. His group created a diversion, while the other, including the Jedi, liberated the N-1 starfighters from the Theed Hangar, allowing pilots to neutralize the Trade Federation droid control ship in orbit. On their way to reach the throne room, Panaka, the Queen, and the Jedi, encountered Darth Maul, a malevolent Sith Lord who had been following the Jedi since Tatooine. Panaka's group were forced to go the long way around while the Jedi stalled Maul.\nThe captain's party only made very slow progress, battling waves of battle droids throughout the halls of the palace. When the Queen expressed her frustration, Panaka decided to used ascension guns to bypass a level of the palace, in an attempt to reach the throne room more quickly. In the mean time, a small group led by Sabé, still posing as the Queen, kept advancing. The Neimoidians finally saw through the ruse, and realized who the real Amidala was. Consquently, Panaka and the Queen's group were swiftly captured by droidekas and escorted to Gunray.\nIn the nick of time, Sabé's party made it to the throne room, and drew out the droids stationed there while Amidala grabbed a couple of blasters from a secret compartment in her throne. Panaka and her sovereign then eliminated the remaining droids in the room, leaving the Viceroy defenseless.\nAfter the battle, Panaka handed over the Viceroy and his aide Rune Haako to the Republic for trial. As he did this, the captain dryly observed that the Neimoidians could \"kiss your Trade franchise goodbye.\" Shortly thereafter, Panaka attended the cremation of Jinn, who was slain during the fight with Darth Maul, before participating in the parade held in Theed to celebrate the liberation of Naboo and the newfound alliance between the Naboo and the Gungans. Meanwhile, Palpatine had been elected Supreme Chancellor of the Republic thanks to a groundswell of sympathy in the Senate.\nAt one point following the victory against the Trade Federation, Jar Jar Binks came to the Theed Palace to seek the Queen's help finding an ancient soshiniday blobball on Boss Nass' behalf. Although Panaka knew he could not stop the Queen from embarking on that adventure, he nevertheless advised her to be careful, since things tended to go south whenever Binks was around.\nPanaka remained in Amidala's service, although their relationship grew cold as Panaka became more paranoid after the invasion. Nonetheless, his respect for Amidala remained high, and, like his wife, he voted for Amidala to lead a third term despite it being impossible. Panaka was very publicly opposed to the installation of the Ion pulse outside the Theed Royal Palace, wanting more robust defences, which soured his relationship with Amidala and other politicians who agreed with the installation. It also caused strain on his marrige but Mariek maintained that she was still happily married.\nPanaka stayed with Amidala and her handmaidens during their stay at Varykino during her final days as queen watching over them as they swam in the nearby ocean and joked that his wife could no longer recognise him.\nWhen her two terms were over, Panaka stepped down from his functions as her personal bodyguard. Amidala was succeeded as queen by Réillata whom had been queen several years before Amidala. Following the coronation Panaka was present in the throne room to see Réillata asked Amidala to succeed Senator Oshadam as the Senator of Naboo.\nWhen Amidala became senator of Naboo, Panaka's nephew, Gregar, succeeded him as Amidala's bodyguard and head of security and was also joined by Mariek. Panaka also made it a habit to occasionally visit the Naberrie family for lunch. During his visits, he engaged Amidala's father, Ruwee Naberrie, in a series of friendly but heated debates concerning Naboo's military actions. Ruwee came to understand Panaka's beliefs but did not agree with them, and Amidala's sister Sola always tried to leave before the debates turned into shouting.\nDespite his plan to retire after losing the confidence of many officials due to his pushes for security greater than the ion pulse, he ended up continuing his services as head of Security under Queen Jamillia. In 22 BBY, his niece Versé, working as one of Amidala's handmaidens, was killed in a failed attempt to kill Amidala. During the Clone Wars, a three-year conflict that pitted the Republic against the Confederacy of Independent Systems, Panaka met Viceroy Bail Organa of Alderaan several times.\nImmediately after the Clone Wars, Supreme Chancellor Palpatine abolished the Republic and replaced it with the Galactic Empire, an authoritarian government with him as sole ruler. Panaka remained loyal to the newly anointed Emperor and was made the Moff, or governor, of his native Chommell sector. Panaka gave his first formal address to Naboo around the same time as the Padmé Amidala's funeral, but neither his wife nor nephew joined him for the occasion. Once in office, Panaka had a red wood chalet built on Onoam, one of the moons that orbited Naboo. At one point, he presented the Emperor with an ornate statue.\nIn 3 BBY, Panaka briefly met with Queen Dalné of the Naboo and Leia Organa, princess of Alderaan, at his chalet. As soon as he saw her, the Moff was struck by the image of Organa wearing a Naboo jubilation dress, which strongly reminded him of Queen Amidala who had worn the same dress decades ago. Although his visitors wanted to discuss the working conditions of the local spice miners, Panaka redirected the conversation toward Organa's background, asking her whether she had been adopted and who her birth parents were. By the end of the meeting, Panaka came to suspect that Organa was in fact the long-lost daughter of the late Amidala—which she was indeed. He also promised to mention the poor working conditions of the miners and promised the princess that the Imperial supervisors wouldn't get away with what taking away the miners safety equipment. Although the Moff intended to warn the Emperor of his findings as soon as his visitors were gone, he did not have the time, as a bomb exploded in his chalet, destroying the building and killing him in the process. As Organa later found out, the bomb was planted by Saw Gerrera's Partisans.\nUpon returning to Alderaan following Panaka's death, Leia overheard her parents discussing the matter in the family's private library with Bail wanting to immediately take a stand to get the Partisans under control while Breha agreed that Gerrera's logic was faulty but that they needed to ask themselves how far they were willing to go. The pair were then interrupted by Leia, who asked whether they were involved with Panaka's death, an accusation which greatly angered Bail.\nShortly after Breha took Leia to the palace gardens to discuss her meeting with Panaka. By the end of the story, Breha was trembling so much that Leia had to look at the candlewick blooms instead as she wasn't sure she could keep talking otherwise. When Leia had, indirectly, confirmed that not enough time had passed for Panaka to pass on his suspicions about Leia's heritage to Palpatine, Breha looked as though she had aged years in a minute.\nBreha then confirmed that she and Bail did not know that Panaka was going to be assassinated as he was the highest ranking Imperial that the rebels had hope of contacting and possibly even working with. Breha lamented that she wished that Panaka was still an option left open to them with Leia agreeing that she had seen that in him too. She also told Leia about Gerrera and the Partisans adding that she intended to tell him about how close he had come to killing Leia and that if that didn't shock him into reconsidering his ways, then nothing would. Later that night as she went to bed, Leia thought of Panaka and his assassination. Leia recognized Panaka as a decent man who served the Empire out of personal loyalty rather than ambition and that the killing of him and his household was wrong, but Leia also recognised that the Empire wasn't going to fall without the use of violence.\nPanaka's assassination was also discussed at a rebel strategy meeting, disguised as a dinner party, on Alderaan, shortly after with many of the rebels disgusted at Saw's actions.\nIn history, Panaka was remembered in the vital role he had played in liberating his homeworld during the Naboo Crisis. In 4 ABY, the statue Panaka once offered to his liege stood in the Emperor's receiving chamber aboard the second Death Star battle station, which was destroyed by Wedge Antilles in his T-65B X-wing starfighter and Lando Calrissian and Nien Nunb aboard the Millennium Falcon during the Battle of Endor.\nIn 5 ABY, during the Battle of Jakku, a starship bearing Panaka's name served as part of the Coruscant blockade. When Colonel Soran Keize came to Coruscant to destroy the Hall of Imperial Register in Coruscant's Verity District, the commander of the Panaka ordered Keize to dock with her ship, and Colonel Kieze pointed out the irony of a ship bearing Panaka's name preserving a blockade.\nA member of the Royal Naboo Security Forces, Quarsh Panaka was known for being an efficient yet pessimistic soldier. Annoyed that Naboo lacked an army, he always expressed his opinions about this matter and disagreed regularly with Qui-Gon Jinn and Obi-Wan Kenobi, the assigned Jedi protectors of Queen Amidala. Personally entrusted with the Queen's safety, Panaka took orders he was given but often voiced his opinion when he felt an order was questionable, such as when Amidala realized that the Galactic Senate was of no help and decided to return to Naboo to take the matter in her own hands. While he had already been a man whose concern for safety bordered on paranoia, his concerns only grew after the Federation's invasion, costing him personal relationships and the respect of many. Nonetheless, his nephew Typho told Amidala that he was sure, on some level, Panaka knew he could ask for anything he needed from Amidala and she would help, just as she promised.\nPanaka's paranoia resulted in a push for stronger defenses than the ion pulse, creating a strain on his marriage with Mariek. However, the two managed to stay together. His debates on security with Ruwee Naberrie were filled with yelling, but were overall friendly. Unlike many high-ranking Imperials, Panaka did not like to surround himself with ostentatious and expensive items. Instead, he favored the simple and practical, while still showing good taste. Also unlike many of his colleagues, he was impervious to corruption. However, he often turned a blind eye on actions he did not approve of, because he believed Imperial abuses of power were the work of rogue elements, as opposed to the norm. Although Panaka's great loyalty to Palpatine made him dangerous, Breha Organa of Alderaan believed him to be \"as good a man as anyone in the Emperor's inner circle could ever be, and much better than most\".\nPanaka was a dark-skinned, powerfully built man with a smooth face and a steely brown gaze. He was tall, measuring 1.83 meters. By the year of his death, his black hair was marked by flecks of gray at the temples. He had a deep, distinctly masculine voice.\nAs Queen Amidala's Head of Security, Panaka wore a brown leather jerkin, a blue shirt with a pair of burgundy horizontal stripes near the hem, and a crested officer cap. He wielded a hand-crafted S-5 blaster pistol.\nQuarsh Panaka was portrayed by Ghanaian British actor Hugh Quarshie in Star Wars: Episode I The Phantom Menace. Panaka's name was never spoken in dialogue within the film's script, but Quarshie, hoping to make sure the audience knew the character's name, found a chance to ad-lib Panaka's name into the movie when he answered a communicator on Tatooine. Quarshie was originally set to reprise his role as Panaka in Star Wars: Episode II Attack of the Clones, but when the producers denied him the film's full script only allowing him to read his lines, Quarshie declined to reprise his role and the character of Gregar Typho, portrayed by Jay Laga'aia, was created to replace Panaka.\nPanaka was originally slated to appear in Star Wars: The Clone Wars episode \"Destroy Malevolence.\" He was going to be captured alongside Padmé and be killed by Grievous. He was eventually cut, because at the early stages of production the studio didn't have the ability to include many new characters because of the time it took to create a digital model. The first name \"Quarsh\" was created by Jason Fry for a war portrait of Panaka that was to be featured in the Legends reference book The Essential Guide to Warfare. While said portrait was cut from the manuscript, it ended up being published on StarWars.com as part of the Star Wars: The Essential Guide to Warfare Author's Cut series of articles. The name was canonized upon its inclusion in Claudia Gray's 2017 novel Leia, Princess of Alderaan.\nPanaka's role as Moff in Leia, Princess of Alderaan, according to Claudia Gray, had the potential inherent in having someone present in the lives of both Leia and her mother Padmé Amidala, an idea which ended up becoming Gray's favorite turn in the novel's story. As an interesting fact, during the novel's writing, Gray considered making Panaka a member of the Rebellion, but she changed her mind after Pablo Hidalgo reminded her that Panaka became a Moff loyal to Emperor Palpatine in the Legends continuity, a great detail that she believed deserved to also be included in the new canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Quarsh_Panaka",
  "/wiki/Quarsh_Panaka/Legends",
  "/wiki/Panaka_(disambiguation)",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Hope",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Naboo",
  "/wiki/3_BBY",
  "/wiki/Onoam",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Royal_Naboo_Security_Forces",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Special_Task_Force",
  "/wiki/Galactic_Empire",
  "/wiki/File:DoNotThinkWeCanWin-TPM.ogg",
  "/wiki/Planet",
  "/wiki/Captain",
  "/wiki/Head_of_Security",
  "/wiki/Standard_year",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/32_BBY",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Tatooine",
  "/wiki/Coruscant",
  "/wiki/Battle_of_Naboo",
  "/wiki/Homeworld",
  "/wiki/Moff",
  "/wiki/Imperial_Era",
  "/wiki/Assassination_of_Quarsh_Panaka",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Reproduction",
  "/wiki/Standard_decade",
  "/wiki/Species",
  "/wiki/Sentience",
  "/wiki/Amphibian",
  "/wiki/Gungan",
  "/wiki/Realspace",
  "/wiki/Pirate",
  "/wiki/Chommell_sector",
  "/wiki/Naboo_Palace_Guard",
  "/wiki/Security_Guard",
  "/wiki/Naboo_Royal_Space_Fighter_Corps",
  "/wiki/Quarsh_Panaka%27s_private_residence",
  "/wiki/Theed",
  "/wiki/Marriage",
  "/wiki/Mariek_Panaka",
  "/wiki/Vers%C3%A9",
  "/wiki/Gregar_Typho",
  "/wiki/Queen",
  "/wiki/Naboo_Royal_Advisory_Council",
  "/wiki/Blockade",
  "/wiki/Free_Trade_Zone",
  "/wiki/Galactic_Senate",
  "/wiki/Battle_droid",
  "/wiki/Theed_Royal_Palace",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Neimoidian",
  "/wiki/Sab%C3%A9",
  "/wiki/Governor",
  "/wiki/Sio_Bibble",
  "/wiki/Camp_Four",
  "/wiki/Jedi",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Ambassador",
  "/wiki/Capital",
  "/wiki/Theed_Hangar",
  "/wiki/Droid",
  "/wiki/Naboo_Royal_Starship",
  "/wiki/Starship",
  "/wiki/Hyperdrive",
  "/wiki/Engine",
  "/wiki/Desert",
  "/wiki/Hutt",
  "/wiki/Gangster",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Hologram",
  "/wiki/Slavery",
  "/wiki/Anakin_Skywalker",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Senate_Chamber",
  "/wiki/Boss_Meetup",
  "/wiki/Boss",
  "/wiki/Rugor_Nass",
  "/wiki/Flash_speeder",
  "/wiki/Gian_heavy_patrol_speeder",
  "/wiki/Militiagung",
  "/wiki/Gungan_Grand_Army",
  "/wiki/Trade_Federation_Droid_Army",
  "/wiki/City",
  "/wiki/Nute_Gunray",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Water",
  "/wiki/N-1_starfighter",
  "/wiki/Hangar",
  "/wiki/Pilot",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Orbit",
  "/wiki/Throne_room_(Theed_Royal_Palace)",
  "/wiki/Maul",
  "/wiki/Sith_Lord",
  "/wiki/Ascension_gun",
  "/wiki/Throne",
  "/wiki/Time",
  "/wiki/Droideka",
  "/wiki/Blaster",
  "/wiki/Viceroy",
  "/wiki/Aide",
  "/wiki/Rune_Haako",
  "/wiki/Cremation",
  "/wiki/Funeral_of_Qui-Gon_Jinn",
  "/wiki/Death",
  "/wiki/Darth",
  "/wiki/Parade",
  "/wiki/Supreme_Chancellor",
  "/wiki/Ion_pulse",
  "/wiki/Varykino",
  "/wiki/Bodyguard",
  "/wiki/R%C3%A9illata",
  "/wiki/Second_coronation_of_R%C3%A9illata",
  "/wiki/Senator",
  "/wiki/Oshadam",
  "/wiki/Naberrie_family",
  "/wiki/Ruwee_Naberrie",
  "/wiki/Sola_Naberrie",
  "/wiki/Jamillia",
  "/wiki/22_BBY",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaan",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Sector",
  "/wiki/Padm%C3%A9_Amidala%27s_funeral",
  "/wiki/Quarsh_Panaka%27s_chalet",
  "/wiki/Moon",
  "/wiki/Daln%C3%A9",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Prince",
  "/wiki/Jubilation_dress",
  "/wiki/Spice",
  "/wiki/Mining",
  "/wiki/Parent",
  "/wiki/Royal_Palace_of_Alderaan",
  "/wiki/Garden",
  "/wiki/Candlewick_flower",
  "/wiki/4_ABY",
  "/wiki/Emperor%27s_receiving_area",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Wedge_Antilles",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Nien_Nunb",
  "/wiki/Millennium_Falcon",
  "/wiki/Battle_of_Endor",
  "/wiki/5_ABY",
  "/wiki/Battle_of_Jakku",
  "/wiki/Panaka",
  "/wiki/Coruscant_blockade",
  "/wiki/Colonel",
  "/wiki/Soran_Keize",
  "/wiki/Attack_on_Coruscant%27s_Verity_District",
  "/wiki/Hall_of_Imperial_Register",
  "/wiki/Verity_District",
  "/wiki/Commanding_officer",
  "/wiki/Unidentified_female_Imperial",
  "/wiki/Eye",
  "/wiki/Breha_Organa",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Leather",
  "/wiki/Officer",
  "/wiki/S-5_blaster_pistol",
  "/wiki/Hugh_Quarshie",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Jay_Laga%27aia",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Destroy_Malevolence",
  "/wiki/Grievous",
  "/wiki/Jason_Fry",
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/Claudia_Gray",
  "/wiki/2017",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Raiders_of_the_Lost_Gundark",
  "/wiki/Star_Wars_Adventures_(2017)_18",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/So_Much_More",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/Leia,_Princess_of_Alderaan_(audiobook)",
  "/wiki/Leia,_Princess_of_Alderaan_(Benefit_Media_audiobook)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Darth_Vader_(2020)_3",
  "/wiki/Star_Wars_(2020)_30",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_47",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Naboo_(Star_Wars_Encyclopedia)",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Databank_(website)",
  "/wiki/19_BBY",
  "/wiki/Birthday",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/March_15",
  "/wiki/2014",
  "/wiki/May_13",
  "/wiki/2020",
  "/wiki/Jedi_Council_Forums",
  "/wiki/February_10",
  "/wiki/2013"
 ]
}