{
 "name": "Quayce",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rabid Mynocks"
     ]
    }
   ]
  }
 ],
 "content": "Quayce was a female Human who was the leader of the Rabid Mynocks swoop gang on Shesharile 5.\nQuayce had no idea what planet she was born on. At the age of ten, she stowed away on a pirate ship and left her homeworld. The pirates accepted Quayce into their organization, and for six years she worked long and hard as their Steward. The jobs she did were, in her opinion, only fit for droids to carry out, but the pirates disagreed since they were more valuable. Quayce quickly developed a hatred of droids. Despite it not being a life of action and adventure, Quayce learned much including how to fight and studied the captain's leadership style.\nWhen the vessel made port on Shesharile 5, Quayce jumped ship at Gallisport. Finding herself in the middle of swoop gang war, she ended up joining the Rabid Mynocks. Finding a home in the Mynocks, she eventually rose to leader the gang after their current leader was killed. A vote actually chose Roy Harlison to lead, but he was not interested and recommended Quayce for the role. Under her leadership, the Rabid Mynocks flourished for six years until they were framed for crimes they did not commit. The core Mynocks were arrested, with other members of the gang joining their rivals or going into hiding.\nBefore being sent to the Spice Mines of Kessel, Quayce and her core members escaped with help from their friends. Running from the law, Quayce shaved one side of her head and began a recruiting compaign to return the Mynocks to their old strength. Shortly after, the Mynocks managed to regain their position as the guardians of Zone Three.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Rabid_Mynocks",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Shesharile_5",
  "/wiki/Planet/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Steward_(occupation)",
  "/wiki/Droid/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Gallisport",
  "/wiki/Roy_Harlison",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/Kessel/Legends",
  "/wiki/Zone_Three",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Swoop_Gangs",
  "/wiki/Star_Wars_Adventure_Journal_6"
 ]
}