{
 "name": "Quenelle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nallastia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Quenelle was a Human female who, in 23 BBY, was both the Margravine and secretly the Skull Queen of Nallastia, a direct descendant of the Margrave Octan. During that year, her daughter, Princess Calvaria, in her absence, kidnapped the parents of the child Klay—for not only trespassing, but also allegedly violating Nallastia's sacred wildlife laws—and, per her wrongful decree, placed them inside an energy field created by ancient Trinity Stones. When the 18-year-old Jedi Padawan Anakin Skywalker crashed his starfighter on the moon, Quenelle was recruited by the Jedi Knights Obi-Wan Kenobi and Bultar Swan to help locate him. But when she discovered, at her fortress, that Skywalker had befriended Klay and had taken Calvaria hostage in order to bargain for the release of the boy's parents, Quenelle revealed herself as the Skull Queen, chastised her daughter, then went hunting with Kenobi for the Lost Stars of Nallastia—three ancient jewels that could disable the energy field. The jewels were found within the jungle-moon's Cavern of Screaming Skulls and Klay's parents set free.\nDuring the subsequent celebration at the Queen's fortress, the Esseles shipbuilder Groodo the Hutt took over a spaceport on nearby Fondor, where he took Calvaria hostage. Quenelle traveled with Swan and the Jedi Masters Mace Windu and Kit Fisto to take the spaceport back and rescue Calvaria. Their mission was a success, and the greedy Hutt and his cohorts—Hurlo Holowan and Senator Rodd of Fondor—fled. Quenelle kissed Kenobi goodbye before he returned to Coruscant, upset that she couldn't marry him.\nQuenelle owned a Nallastian rescue runner, the salvage ship she arrived in to negotiate salvage rights to the alleged ancient vessel, the Sun Runner. Her salvage-rights opponent was Senator Rodd. The negotiations were monitored by Swan, Kenobi, and Skywalker.\nQuenelle issued sentences of death to poachers of Nallastian wildlife, which the Nallastians considered sacred: creatures such as the venrap, grillik, or killspike.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nallastia",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Margravine",
  "/wiki/Skull_Queen",
  "/wiki/Margrave_Octan",
  "/wiki/Prince/Legends",
  "/wiki/Calvaria",
  "/wiki/Hondu_Firewell",
  "/wiki/Klay_Firewell",
  "/wiki/Force_field/Legends",
  "/wiki/Trinity_Stones",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Skull_Queen%27s_fortress",
  "/wiki/Lost_Stars_of_Nallastia",
  "/wiki/Jungle/Legends",
  "/wiki/Cavern_of_Screaming_Skulls",
  "/wiki/Esseles/Legends",
  "/wiki/Groodo",
  "/wiki/Hutt/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Fondor/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Fondor_Spaceport",
  "/wiki/Hurlo_Holowan",
  "/wiki/Senator/Legends",
  "/wiki/Rodd",
  "/wiki/Coruscant/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Rescue_runner",
  "/wiki/False_Sun_Runner",
  "/wiki/Sun_Runner",
  "/wiki/Death/Legends",
  "/wiki/Venrap",
  "/wiki/Grillik",
  "/wiki/Killspike",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Quenelle",
  "/wiki/Star_Wars_Adventures_1:_Hunt_the_Sun_Runner",
  "/wiki/Star_Wars_Adventures_2:_The_Cavern_of_Screaming_Skulls",
  "/wiki/Star_Wars_Adventures_3:_The_Hostage_Princess",
  "/wiki/Star_Wars_Adventures_(Scholastic)"
 ]
}