{
 "name": "Quharek",
 "display_name": "Quharek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Quharek was a Mon Calamari living in the village of Aurilia on the planet Dathomir during the Galactic Civil War.\nQuharek gave up his given, Mon Calamari name for the one the village gave him as they could not pronounce it. He was a craftsman and an expert on building, and resource gathering, as well as being adept at overseeing large construction projects. He tasked an individual with repairing the village's sensor array when it was damaged and the Chief Engineer of the village was killed in an attack by the Sith Shadows. After this, he was given the responsibility of repairing the village's defense systems. To do this he asked many crafters to aid with this community project, asking anyone with any skill to donate materials to help. Later he required the help of others to rebuild the village's shields. To do this he asked many crafters to aid with this community project. He sent all helpers who had material to see QT-QC, a binary loadlifter responsible for handling the materials used to rebuild the shield.\nAfter Mellichae was captured and the small village grew into a township, Quharek helped Shaneeka, the town's new chief engineer, maintain most of the electronics and machinery in Aurilia.\nQuharek appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Aurilia",
  "/wiki/Planet/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sensor_array/Legends",
  "/wiki/Sith_Shadow",
  "/wiki/Deflector_shield/Legends",
  "/wiki/QT-QC",
  "/wiki/Binary_loadlifter/Legends",
  "/wiki/Mellichae",
  "/wiki/Shaneeka",
  "/wiki/December_15",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide"
 ]
}