{
 "name": "Quip_Fargil",
 "display_name": "Quip Fargil",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Denon"
     ]
    },
    {
     "name": "Born",
     "values": [
      "33 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Quip Fargil, later known as Vec Minim, was a Rebel agent and pilot, and the man who named the Millennium Falcon.\nFargil spent much time on the planet Tuerto, where he had a reputation as a joyrider. It was while on Tuerto that he met the Sullustan ship thief, Zenn Bien, who taught him much of what she knew. On two occasions, Fargil employed Bien to steal ships, which he then resold.\nAt some point, he was conscripted into the Rebel Alliance by a Verpine named Luufkin and an Imperial double agent. In 10 BBY, with the help of Luufkin, Bien, and the Imperial agent, he stole the freighter Second Chance from the Imperial impound yard at Nilash III. Fargil flew the freighter on Alliance missions, rebranding her as the Millennium Falcon.\nIn 9 BBY, Fargil volunteered to ferry a baradium fission device to the Imperial shipyards at Bilbringi. Using the Falcon's unparalleled speed, Fargil would fly the ship into the shipyards and detonate the bomb.\nUltimately, though, while Fargil had no qualms about sacrificing himself for the Rebel cause, he couldn't bring himself to destroy the Falcon, which he had grown to love over the 10 months he had flown her. One hyperspace jump away from Bilbringi, he aborted the mission and fled to Vaced, where he took the name Vec Minim and lived an unassuming life. Unable to live with the guilt at having abandoned his Rebel allies, he gave the Falcon away, to a young doctor named Parlay Thorp.\nIn 43 ABY, Tobb Jadak, another former pilot of the Falcon, who was tracking the ship's history, met and spoke with Fargil. Jadak then used Fargil's story to pose as Fargil during a meeting with Han Solo and Leia Organa Solo, who were also tracing the Falcon's history.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Denon/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tuerto",
  "/wiki/Sullustan/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Zenn_Bien",
  "/wiki/Verpine/Legends",
  "/wiki/Luufkin",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/10_BBY/Legends",
  "/wiki/Nilash_III",
  "/wiki/9_BBY/Legends",
  "/wiki/Baradium_fission_device",
  "/wiki/Bilbringi_system",
  "/wiki/Hyperspace/Legends",
  "/wiki/Vaced/Legends",
  "/wiki/Parlay_Thorp",
  "/wiki/43_ABY",
  "/wiki/Tobb_Jadak",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/The_Essential_Guide_to_Warfare"
 ]
}