{
 "name": "Quux",
 "display_name": "Quux",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Karrid"
     ]
    }
   ]
  }
 ],
 "content": "Quux was a Pureblood male Sith Lord who served the Falleen Dark Councilor Darth Karrid during the Galactic War. He wielded a pair of purple-bladed shotos.\nQuux and fellow Sith Lord Ordez were assigned to the Ascendant Spear in the year 3640 BBY to serve the newly appointed member of the Dark Council, Darth Karrid.\nWhen Jedi Master Gnost-Dural broke free from his restraints with the help of SIS Operative Theron Shan, he went to confront his former pupil, Darth Karrid in the chambers in which she could control the Spear.\nWhen Gnost-Dural arrived, he was met with Lord Quux, Lord Ordez and Karrid's Human Male Apprentice, all of which were meditating in order to support Karrid in controlling the Ascendant Spear. When they saw Dural enter, the trio stopped their meditation and engaged the Jedi Master in a duel. Ordez and Quux together were powerful enough to hold off Gnost-Dural, the only problem being that they were not coordinated, constantly interrupting each others attacks, this allowed the Jedi to kill Karrid's Apprentice and focus on the other two.\nWhen Karrid lost control of the Spear and the crew began to evacuate, Gnost-Dural tried to convince the Sith Lords to escape the Spear, Quux lifted his weapons to kill Dural but Ordez, guided by self-preservation, deactivated his Lightsaber and ran to the escape pods, Quux took his lead and followed him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Darth_Karrid",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Falleen/Legends",
  "/wiki/Dark_Council",
  "/wiki/Galactic_War",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Lightsaber_shoto",
  "/wiki/Ordez",
  "/wiki/Ascendant_Spear",
  "/wiki/3640_BBY",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Gnost-Dural",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Theron_Shan",
  "/wiki/Unidentified_Human_male_Sith_apprentice",
  "/wiki/Jedi/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Escape_pod",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Quux",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)"
 ]
}