{
 "name": "Qwi_Xux",
 "display_name": "Qwi Xux",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Omwat"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Omwati"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pearlescent"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Indigo"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Department of Military Research",
      "Imperial Department of Military Research",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Qwi Xux, a female Omwati, was a brilliant Imperial weapons designer who was responsible for the Death Star, the Sun Crusher, and other important superweapons for the Galactic Empire.\nWhen she was ten years old, Qwi was taken from her village on Omwat, along with nine other children from nine separate villages, upon orders from Grand Moff Wilhuff Tarkin. Tarkin believed the theory of the massive potential of the Omwati mind and was convinced that, with the proper manipulation, it could wield outstanding mental capacities.\nOn board a space station orbiting Omwat, the ten children underwent rigorous education, mental challenges and testing. If any of the children failed in their testing, they were forced to watch as their entire village was bombarded from orbit, followed by their execution. This obviously had a profound psychological effect on the Omwati subjects, warping their view on life and on the challenges they face. This was reflected in Qwi Xux's drive to complete problems—even years later, she greatly feared failure for the prospective repercussions it could bring. Only Qwi survived this torturous captivity.\nAfter two years of this mental conditioning, she had developed a distorted sense of reality. She maintained that problems had to be solved for their own sake, and convinced herself that the results of her experiments were not her responsibility. Qwi's individual training had focused on forgoing biological knowledge to develop a mind with an unparalleled grasp of physics, mathematics and engineering. She also learned AI principles from Nasdra Magrody.\nTarkin took Qwi Xux to his highly secret Maw Installation to develop new weapons systems for the Empire. She begin solving the intricate problems provided to her, working under Bevel Lemelisk, to develop most of the Death Star. However, due to the conditioning she believed that her creations were purely innocent rather than the destructive behemoths they became. The Death Star, she thought, was developed to break up dead, lifeless planets to extract the valuable ores and elements within. She also thought the same of the World Devastators. She also assisted in developing the Sun Crusher's supernova-inducing weaponry and quantum-crystalline armor.\nIt was not until 11 ABY that her fallacy was broken. When Han Solo, Chewbacca and the Force-sensitive Kyp Durron accidentally discovered the Maw Installation, they were all rigorously and brutally interrogated to discover what had happened to the Empire. Dr. Xux was given the results of these interrogations, which she accepted as simply acquired facts. However, eager for a first-hand account of the Death Star, she sought a meeting with Han. After hearing the Death Star had been used for the Destruction of Alderaan, and the World Devastators had laid waste to much of Mon Calamari, the seeds of doubt were implanted in her mind. After accessing the records of the interrogations, she was horrified at the methods used to procure the information. The thought of her work being the cause of billions of deaths opened her eyes to see the truth behind the terrors she had created.\nRealizing the scope of the projects being developed at the Installation, Qwi helped Han, Chewbacca, and Kyp Durron escape in the Sun Crusher. Despite being followed by Daala's fleet of Star Destroyers, they encountered the Kessel mercenary force just outside the Maw and escaped in the ensuing chaos.\nQwi was put under the protection of Wedge Antilles as some believed that the information she held would make her a prime candidate for kidnapping. Before they left Coruscant to travel incognito, she urged the New Republic to destroy it before it could have a chance to demonstrate its terrible power. They visited the planet Vortex to help the Vors repair the Cathedral of Winds. However, when Qwi used a shard of the tower to play ethereal, haunting music, one of the Vors took the shard from her and crushed it. Fearing they had offended the Vors, the pair left to move undercover.\nWedge and Qwi became very close during their time together. Wedge took her to Ithor, believing she would revel in the wonders of nature of the jungle planet. While there, Qwi Xux was confronted by Kyp Durron, who had abandoned training at Luke Skywalker's Jedi Praxeum after falling to the dark side of the Force. Kyp scoured Qwi's mind, removing any information that could aid in the construction of another superweapon. Wedge nursed her back to health, but she was never the same again.\nShe and Wedge maintained their relationship, but he was increasingly called upon in military matters, and Qwi became more and more absorbed in her work. Despite a brief stint in the New Republic Defense Fleet as Wedge's science officer, both agreed that the relationship was evolving to be a convenience, rather than a true romance, and they went their separate ways.\nQwi eventually decided to travel to Vortex and help the Vors repair the Cathedral of Winds. While there, she hoped to find her own inner peace and eliminate the memories of all the beings her superweapons had killed.\nQwi Xux underwent much mental conditioning while she was young. As a result, she had a shroud of feigned naïveté for the duration of her life until leaving the Maw Installation. Up until this point, she believed she was not responsible for the results of her experiments or what happened after a problem had been overcome. As such, she could be described as being highly naïve.\nShe had a passion for music, often humming or singing while she worked.\nQwi Xux was created by author Kevin J. Anderson, based on Mermeia from The Star Wars Holiday Special. In the Jedi Academy trilogy, Xux's eyes are given as deep blue, pale blue or violet, whereas in The Essential Guide to Characters her eyes are clarified as light blue.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Qwi_Xux",
  "/wiki/Omwat/Legends",
  "/wiki/Omwati/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Department_of_Military_Research/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Sun_Crusher",
  "/wiki/Superweapon/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Death/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Artificial_intelligence/Legends",
  "/wiki/Nasdra_Magrody",
  "/wiki/Maw_Installation",
  "/wiki/Bevel_Lemelisk",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Planet/Legends",
  "/wiki/World_Devastator",
  "/wiki/Nova/Legends",
  "/wiki/Quantum-crystalline_armor",
  "/wiki/Armor/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Doctor/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Dac",
  "/wiki/Eye/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Vortex/Legends",
  "/wiki/Vor",
  "/wiki/Cathedral_of_Winds/Legends",
  "/wiki/Ithor/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Music/Legends",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Mermeia",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Death_Star_(novel)",
  "/wiki/Jedi_Search",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/I,_Jedi",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/Darksaber_(novel)",
  "/wiki/X-Wing:_Starfighters_of_Adumar",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Dark_Journey",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/The_Women_Of_Star_Wars",
  "/wiki/Star_Wars_Galaxy_Magazine_12",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_74",
  "/wiki/The_Official_Star_Wars_Fact_File_79",
  "/wiki/The_New_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/I_Have_a_Bad_Feeling_About_This!",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/Star_Wars_Insider_Special_Edition_2012",
  "/wiki/Databank_(original)",
  "/wiki/Death_Star_Owner%27s_Technical_Manual",
  "/wiki/January_20",
  "/wiki/2020"
 ]
}