{
 "name": "Ra-Zyrth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ra-Zyrth was a male Massassi who served the Sith Empire during the time of the Great Hyperspace War. He became one of the top commanders of Naga Sadow, the leader of the Sith Empire, and Sadow used dark side alchemy to transform Ra-Zyrth into a mutated monstrosity. The Massassi subsequently entered a deep sleep inside a suspended animation capsule, which was fired onto the planet Coruscant during a Sith attack on the world in 5000 BBY.\nRa-Zyrth was a male Massassi who was born during the time leading up to the Great Hyperspace War. He received a violent upbringing, and, like all Massassi, he was trained from birth to become a soldier for the Sith Empire, a powerful state located within the Stygian Caldera. Ra-Zyrth eventually became one of the top commanders of Naga Sadow, the leader of the Sith Empire, and, shortly prior to Sadow's invasion of the Galactic Republic in 5000 BBY, the Sith Lord summoned together Ra-Zyrth and a number of Sadow's other commanders. Using dark side alchemy, Sadow transformed Ra-Zyrth and the other commanders into mutated monstrosities. Ra-Zyrth and the commanders subsequently entered suspended animation capsules, and the Massassi went into a deep sleep.\nShortly afterward, Sadow's forces attacked the planet Coruscant, the capital of the Republic, and during the battle the capsules containing Ra-Zyrth and the other slumbering commanders were fired into the Coruscant cityscape. A number of vague and conflicting accounts existed regarding Ra-Zyrth's subsequent fate, and some individuals claimed that following the deployment of his capsule, the Massassi immediately awoke and died while fighting in combat against Coruscant's Jedi defenders. Others claimed that his capsule came to lie in a forgotten region of the Coruscant Undercity, where Ra-Zyrth remained in his sleep for many years, waiting for his capsule to be activated by accident, so that he could be reawakened.\nFrom a young age, Ra-Zyrth was trained to be a ruthless, efficient soldier, who strove to achieve glory for the Sith Empire. After his exposure to Naga Sadow's alchemical manipulations, he became very muscular and gained an armored hide. He was equipped with a Massassi insignia of rank, a sword, and a Sith lanvarok, a wrist-mounted weapon that fired small discs.\nRa-Zyrth was first mentioned in Coruscant and the Core Worlds, a roleplaying sourcebook that was published by Wizards of the Coast in 2003. He later received an entry in the 2008 compendium The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Massassi/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Time/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Mutant",
  "/wiki/Sleep/Legends",
  "/wiki/Suspended_animation_capsule",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Coruscant_(Great_Hyperspace_War)",
  "/wiki/5000_BBY/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Stygian_Caldera",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Suspended_animation/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Sword/Legends",
  "/wiki/Lanvarok",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/2003",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}