{
 "name": "Ra_Sara",
 "display_name": "Ra Sara",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow with brown spots"
     ]
    }
   ]
  }
 ],
 "content": "Ra Sara was a male Twi'lek criminal who worked as a jeweler in the Anoat sector during its blockade by the Galactic Empire, which they established following their defeat at the Battle of Endor. He joined the crew of a young smuggler, who dispatched the Twi'lek on a variety of missions throughout the sector.\nA male Twi'lek, Ra Sa grew up on the streets of Coruscant, and his childhood experiences turned him into the ultimate procurement specialist. He operated as a jeweler in the Anoat sector of the galaxy's Outer Rim Territories while it was locked down under the Iron Blockade, which was established by the Galactic Empire in an attempt to prevent news of their crushing defeat by the Alliance to Restore the Republic at the Battle of Endor from reaching the sector's populace.\nSara joined the Smuggler's crew, who dispatched him on a variety of missions throughout the Anoat sector.\nComing from a criminal background and having a preference for stealth, growing up on the streets of Coruscant did nothing to diminish Sara's zest for life.\nA male Twi'lek, he had yellow skin with brown spots and brown eyes.\nRa Sara was created for the canon mobile game Star Wars: Uprising, which was developed by Kabam for iOS and Android platforms and released in 2015, where he is a unique 3 star crew member available through the Premium Crane, an in-game shop where players can spend chromium, an in-game currency, in exchange for randomized loot ranging from 3 stars or better in quality. As such, it is not required for the player to acquire Sara as a member of their crew. This article assumes 100% game completion of Star Wars: Uprising, which means the player acquired Ra Sara as a member of their crew and dispatched the droid on Crew Runs.\nWhile on Crew Runs, Ra Sara provides a bonus to all Criminal and Stealth Crew on the same Run, and is strong on Crystal Finder Runs.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Coruscant",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Anoat_sector",
  "/wiki/Iron_Blockade",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Endor",
  "/wiki/The_Smuggler",
  "/wiki/Sector",
  "/wiki/The_galaxy",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Eye",
  "/wiki/Kabam",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)",
  "/wiki/2015",
  "/wiki/Chromium"
 ]
}