{
 "name": "Rabael Dir Glorio",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Glorio",
      "Son-tuul Pride"
     ]
    }
   ]
  }
 ],
 "content": "Viscount Rabael Dir Glorio, also known by the moniker Violet Ghost, was a member of the Alderaanian House Glorio. He was the only member of the house who survived the destruction of their homeworld by the Galactic Empire and swore revenge on the Imperials, concealing his identity and starting to work as a mercenary. He accepted a job with the Son-tuul Pride on the planet Son-tuul, but was left behind to die when the group's patrol transport was surrounded by Imperials.\nRabael Dir Glorio was a human male viscount of House Glorio of the planet Alderaan who stood as twenty-sixth in line to the throne of his homeworld. When Alderaan was destroyed by the Galactic Empire in the year 0 BBY, Glorio was offworld on what he later claimed was a totally legitimate diplomatic mission to the pleasuredomes of Thyron VII. As the only surviving member of his house, he concealed his identity and began working as a mercenary under the name Violet Ghost, making a name for himself in swordcraft and incorruptible morals. Around 3 ABY, the viscount took a job with the Son-tuul Pride criminal group, gathering with a number of other mercenaries who had accepted the job on Son-tuul. The group waited aboard a patrol transport for their leader, the archaeologist Doctor Chelli Aphra to arrive and when she did the doctor scanned each of them and made notes.\nAphra's boss 0-0-0 then informed her that she would have to leave one member of mercenary group behind as they weighed too much for the starship to take off. Imperial stormtroopers then started to surround the vehicle, and making her decision, Aphra ordered Glorio to get out and fight them off. He successfully defeated the first group of stormtroopers and then announced his true name and intention to take vengeance on the Empire, before asking Aphra for backup as a large number of Imperial reinforcements were approaching. Aphra, however, had already taken off with the rest of the mercenaries on the ship, abandoning Glorio to face the wrath of the Empire alone.\nRabael Dir Glorio was a human male with fair skin, white hair and blue eyes. After the death of his family and homeworld, he sought to claim revenge against the Empire but concealed his true identity, taking work as a mercenary and earning a name in swordcraft. He also earned a reputation for having incorruptible morals, but volunteered to work with a criminal group.\nRabael Dir Glorio first appeared in the comic book Doctor Aphra  15, which was written by Simon Spurrier, illustrated by Emilio Laiso and released on December 20, 2017.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Alderaan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_Glorio",
  "/wiki/Son-tuul_Pride",
  "/wiki/Viscount_(title)",
  "/wiki/Alderaanian",
  "/wiki/The_Disaster",
  "/wiki/Homeworld",
  "/wiki/Galactic_Empire",
  "/wiki/Mercenary",
  "/wiki/Son-tuul",
  "/wiki/Death",
  "/wiki/LAAT/le_patrol_gunship",
  "/wiki/Planet",
  "/wiki/Alderaanian_monarchy",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Thyron_VII",
  "/wiki/3_ABY",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/0-0-0",
  "/wiki/Starship",
  "/wiki/Stormtrooper",
  "/wiki/Flufto",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Doctor_Aphra_(2016)_15",
  "/wiki/Simon_Spurrier",
  "/wiki/Emilio_Laiso",
  "/wiki/December_20",
  "/wiki/2017",
  "/wiki/Doctor_Aphra_(2016)_19",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Accresker_Jail",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}