{
 "name": "Rachi_Sitra",
 "display_name": "Rachi Sitra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Rachi Sitra was a female Twi'lek Jedi Knight and archaeologist. She joined the Alliance to Restore the Republic during the Galactic Civil War.\nSitra was rescued from Ryloth by a Jedi posing as a slave trader and afterward became a skilled warrior and an archaeologist. She began learning the ways of the Force and eventually attained the rank of a Jedi Knight after completing her trials. The construction of her own lightsaber was a turning point for Rachi that gave her life new meaning and direction. Sitra somehow survived Order 66 and the Great Jedi Purge, living long enough to witness the rise of the rebellion and the Galactic Civil War. Sometime after the destruction of the first Death Star, Sitra finally emerged from exile.\nDuring the Galactic Civil War Sitra aided the Rebel Alliance from a hidden Rebel base on Talus, helping in organizing strikes against the Galactic Empire. However, the base's safety was compromised when the Imperial Special Forces established a base on nearby Corellia, preparing to launch an attack on the Rebel base. Sitra realized that the facility could not be properly defended and evacuation of personnel was the only reliable option. However, the Battle of Talus forced Rebels into a defense of the base anyway when the Imperial attack came earlier than expected. Imperial troops disembarked and immediately engaged the Rebel defenders, but were caught by surprise when a group of Jedi, led by Rachi Sitra, joined the fight. Sitra took command of the situation and wielded her lightsaber with authority. The combined troops of the Rebel Alliance and their Jedi supporters had successfully defended their base on Talus, and the Imperials were forced to retreat back to the Imperial outpost.\nThe next day saw the second Imperial assault, with a larger better organized attack force although by that time the evacuation was already at its final stage. Sitra was evacuated along with other base personnel on Spirit of Corellia, a SoroSuub transport. However, the transport was shot down and was forced to land at a remote part of Corellia. Very soon, Imperial forces arrived to investigate the crash site, led by none other than Darth Vader himself. Sitra decided to distract Vader and buy others time for escape. She rushed the Dark Lord, her lightsaber ignited, but the Sith simply struck her down with the Force, rendering her unconscious. Vader's forces engaged the Rebels and the fight was fierce and brutal, with heavy casualties for both sides. Finally regaining consciousness, Sitra moved against Vader again. At that moment, the surviving Rebels concentrated their blaster fire on Vader and, while he was busy deflecting it, Sitra and her troopers retreated from the battle into the wilderness. Within a few hours they reached a local spaceport and reunited with the main Alliance forces.\nFollowing the Battle of Talus, Sitra was put onto the Emperor's Most Wanted, a list which contained high-pay bounties on critical Alliance leaders. Sitra was selected as a target by none other than Boba Fett himself, who has been tracking her movements for weeks before commencing an attack. Sitra was on her way to Dathomir with a diplomatic mission, and upon entering the Dathomir space, her shuttle was ambushed by Slave I from behind an asteroid. With a precise shot from a heavy blaster cannon, Fett neutralized the shuttle's hyperdrive and commenced boarding actions. When the airlock was forced open, Sitra ignited her lightsaber and prepared to defend herself, but Fett fired a rocket from his wrist launcher, which knocked the lightsaber out of her hands. Bruised and battered, the Jedi had no choice but to surrender herself to the bounty hunter; Fett locked energy binders on her hands and prepared to deliver her to the Imperial authorities.\nThe temporary holding place for the captured Rebels was the Imperial prison facility in a rough mountain area just outside of Bestine on Tatooine. Sitra was handed over to the Imperial authorities, but the Rebel agents managed to learn the location of the facility and launched a bold raid in an attempt to rescue the prisoners. Despite heavy resistance from the Imperial forces, the Rebels were able to gain the upper hand and evacuate the rescued prisoners, including Sitra, to safety.\nAt some point, Rachi had discovered an Imperial spy Jeffren Brek during her mission. She tried to subdue him, but Brek launched a grenade at her, buying himself time to escape and ending the confrontation. Brek continued his mission and when Sitra found him again, she made him pay dearly by cutting off his entire left arm with her lightsaber.\nWhile on a mission on Dathomir, Sitra was told by Augwynne Djo, the leader of the Singing Mountain Clan of Dathomiri Witches, of a dangerous Nightsister Kyrisa, who had mastered the power of Animal friendship. So dangerous was she, that her own clan had sent her away from the planet. Knowing that a Dark Jedi Namman Cha was intending to recruit Kyrisa to serve the Emperor, Sitra decided to find her first. Learning that the Nightsister had crashed on a remote Outer Rim planet known as Hoth, Sitra established contact with an Alliance Special Forces unit, that had just began establishing a small outpost on the planet. Asking a Rebel agent to help her in search, she traveled to Hoth, where the two decided to keep a strict search protocol and stay in touch with each other. Several hours into her search Sitra, after dispatching a local Hoth hog, was confronted by one of the Imperial agents looking for Kyrisa. Rachi eventually was reluctant to fight him, but after the Imperial announced his intent to bring the Nightsister to the Emperor, she decided to neutralize him.\nHowever, her opponent proved agile in the fight and once there was a lull in the combat, Rachi offered him to simply part and go separate ways. Having found an agreement, she escaped into the snow. She was soon contacted by her companion, who discovered that Namman Cha was also involved in the search. As her companion was no match for a trained Force-sensitive, Rachi sent him to help the Rebels at the outpost and continued her search alone. Her combat skills helped her, when she came under attack by one of Hoth's native wampas. Her quest ultimately failed, because Cha had found the Nightsister and was able to persuade her to join him. However, her presence still proved useful when the Imperials attacked the small Alliance outpost. Sitra helped the Rebels defend it and managed to cripple an AT-PT walker during the battle.\nIn 1 ABY, Rachi Sitra was present on Dathomir during the blackwing virus outbreak. While there, Sitra together with Han Solo and Chewbacca had to fight a horde of Imperial undeads.\nRachi Sitra was highly skilled in lightsaber combat and favored the Niman combat style but was also trained in the use of Form I and Shien. In addition to her skill with a single blade, Sitra was also skilled in the use of Jar'Kai. Her dueling abilities were so great that she was even capable of the very advanced Kai-kan technique. She also had considerable telekinetic prowess, being able to manipulate her lightsaber in order to form a saber barrier.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/The_Price_of_Victory",
  "/wiki/Ryloth/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Archaeologist/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Archaeology/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Talus_base",
  "/wiki/Talus/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Special_Forces/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Battle_of_Talus",
  "/wiki/Lightsaber/Legends",
  "/wiki/Spirit_of_Corellia",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Dark_Lord",
  "/wiki/Sith/Legends",
  "/wiki/Emperor%27s_Most_Wanted",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Diplomatic_mission_to_Dathomir",
  "/wiki/Slave_I/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Airlock/Legends",
  "/wiki/Wrist_rocket",
  "/wiki/Energy_binder/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Jeffren_Brek",
  "/wiki/Grenade/Legends",
  "/wiki/Cho_mok/Legends",
  "/wiki/Augwynne_Djo",
  "/wiki/Singing_Mountain_Clan",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Nightsisters/Legends",
  "/wiki/Kyrisa",
  "/wiki/Animal_bond",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Namman_Cha",
  "/wiki/Emperor/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Hoth_hog",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Wampa/Legends",
  "/wiki/Battle_of_Hoth_(2_ABY)",
  "/wiki/All_Terrain_Personal_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Blackwing_virus_outbreak_on_Dathomir",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Zombie/Legends",
  "/wiki/Sun_djem/Legends",
  "/wiki/Form_VI/Legends",
  "/wiki/Form_I/Legends",
  "/wiki/Form_V/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Kai-kan",
  "/wiki/Telekinesis/Legends",
  "/wiki/Category:Images_of_Rachi_Sitra",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Squadrons_Over_Corellia",
  "/wiki/Galactic_Hunters",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/Template:SWGTCG",
  "/wiki/Agents_of_Deception",
  "/wiki/The_Shadow_Syndicate",
  "/wiki/StarWars.com",
  "/wiki/So_Uncivilized:_Great_Gunslingers_in_Star_Wars",
  "/wiki/Star_Wars:_Age_of_Rebellion_Core_Rulebook",
  "/wiki/Chuck_Kallenbach",
  "/wiki/August_8",
  "/wiki/2008",
  "/wiki/October_10",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}