{
 "name": "Raddus",
 "display_name": "Raddus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    },
    {
     "name": "Born",
     "values": [
      "65 BBY",
      "Mon Cala"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Profundity",
      "Scarif system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nystullum city government",
      "Mon Calamari monarchy",
      "Mon Cala Mercantile Fleet",
      "Mon Cala Mercantile Fleet",
      "Galactic Empire",
      "Mon Calamari Exodus Fleet",
      "Alliance to Restore the Republic",
      "Rebel Alliance Navy",
      "Alliance High Command",
      "Operation Fracture Oversight",
      "Rebel Alliance Navy",
      "Alliance High Command",
      "Operation Fracture Oversight"
     ]
    }
   ]
  }
 ],
 "content": "Raddus was a male Mon Calamari revolutionary leader and admiral who served in the Alliance to Restore the Republic up to and during the Galactic Civil War. He commanded his personal MC75 Star Cruiser, Profundity, which led the space assault on Imperial Naval forces during the Battle of Scarif. His flagship was disabled by the Devastator and then boarded by Darth Vader and his forces in an attempt to retrieve the Death Star plans, which had been transmitted from Scarif's surface by Rogue One. Though Raddus perished and his flagship was destroyed, his sacrifice and that of the other rebels allowed the plans to escape and were ultimately used to destroy the Death Star. Many years after Raddus' death, the name of the esteemed admiral was used by the Resistance for their own flagship.\nRaddus was born in 65 BBY in the polar regions of the watery world of Mon Cala. He served as mayor of the city Nystullum, and also filled a role in Mon Cala's planetary defense.\nIn 18 BBY, Raddus was present for King Lee-Char's deteriorating negotiations between the newly-formed Galactic Empire and Mon Cala. Moff Wilhuff Tarkin parked the Sovereign above Mon Cala and sent ambassador Telvar to negotiate a trade deal with Lee-Char in Dac City. Influenced by a surviving Jedi, Lee-Char continued to defy Telvar's offers. Raddus discussed the possibility of Mon Cala seceding to Lee-Char but their conversation was cut short by Darth Vader as he and three Inquisitors arrived at Dac City. Vader was confronted by Commander Gial Ackbar and Telvar's shuttle exploded as they discussed Vader's intentions on Mon Cala.\nMoff Tarkin responded to Telvar's assassination by sending his forces down to invade Mon Cala. A battle subsequently broke out in Dac City where Raddus stayed with Lee-Char and Ackbar, Lee-Char's Chief of Security, in the palace. Once the surface cities were evacuated, Lee-Char sent Ackbar to defend the northern hemisphere and sent Raddus to defend the southern. Lee-Char then sacrificed the surface of Mon Cala by having large creatures generate devastating waves, taking the Imperial forces away in the process.\nRaddus began using two primary tactics: the first was for the Mon Calamari and Quarren defenders to hole up in their under water cities and force the Imperial forces to fight them in the corridors; the second was to scatter into the far reaches of the oceans, forcing the Imperial forces to split up, increasing their need to resupply. In addition to those, Raddus took five Star Cruisers and a number of smaller vessels from the Mon Cala Mercantile Fleet and linked their shields together, making a large shield bubble that was impenetrable to the Imperial attackers. Moff Tarkin claimed that he had built himself a fortress.\nRaddus kept his Cruisers on hold for the time being, keeping the Imperial forces in the south at bay. In the meantime, Tarkin had began bombarding the northern hemisphere from the Sovereign. The turbolaser fire destroyed many settlements and killed billions but Raddus told his ships to stay defending as the planet's curve was in their favor. However soon after, Lee-Char ordered the ceasefire of all his forces on Mon Cala, hoping to make Tarkin stop. Tarkin however pledged to keep bombarding the planet until Lee-Char was arrested and the Star Destroyers began targeting the southern hemisphere.\nRaddus ordered his ships to de-link their shields and they all set course for the blockade. As they flew past the Star Destroyers, two of the cruisers were shot down and Tarkin let the other three go, saying they would be found eventually. The conflict ended with the Empire subjugating Mon Cala and imprisoning King Lee-Char on Strokill Prime. However the Mon Calamari, prepared by their harsh experiences during the Clone Wars, conducted a mass exodus. \"City-ships,\" entire municipal buildings that were made to be spaceworthy structures, launched into the depths of space, including the Profundity, Nystullum's city governance tower. Raddus returned to command this vessel, crewed primarily by Nystullum's defense staff.\nRaddus became one of the first Mon Calamari officers to join the Rebellion. He became an admiral and commander of the burgeoning Alliance Fleet, regarded by Mon Mothma as the Rebel military's most vital component. Work soon began on converting the Mon Calamari city-ships into capital ships to form the spine of the Alliance Fleet, and the Profundity became one of the first ready for combat, joining the varied ships of the fleet in the Telaris system. Despite his new role, Raddus still wore a civic crest of the Mon Cala planetary defense to commemorate his former role among his people.\nAdmiral Raddus, as one of the military leaders of the Alliance, also served on the Rebel council. He provided a report to Mon Mothma on the smaller capital ships in the Alliance fleet. As he was stationed with the fleet, he rarely visited the rebel base on Yavin 4, but his presence was required for matters of major importance to the council. Though united by the common cause to be free of Imperial rule, the council disagreed on all manner of practical details, from battlefield tactics to recruitment. A pragmatist at heart, Raddus's patience was tried by the council's dithering, as he saw attempts to negotiate with the Empire, such as was advocated by Minister of Finance Nower Jebel, to be foolish. In order to not be underestimated by his peers on the council, Raddus was sparse with pleasantries in social interactions, and was happy to cultivate the hardy, thick-blooded reputation commonly ascribed to Mon Calamari native to the world's cold polar depths.\nIn 0 BBY, Jyn Erso informed the Alliance High Command that the Empire had created a planet-destroying battle station known as the Death Star and used it to destroy the Holy City of Jedha. Faced with the decision on whether to assault the Imperial security complex on Scarif in order to steal the station's plans or to disband the Alliance and surrender, Raddus agreed with Erso and expressed his opinion that they should fight, even if the odds were against them. However, without the support of the full council, Mon Mothma decided the odds of defeat were too great.\nInstead, Raddus was tasked with escorting Princess Leia Organa, who was onboard the Alderaanian corvette, Tantive IV which was docked with the Profundity for maintenance and repairs, on a mission to Tatooine to meet with Jedi Master Obi-Wan Kenobi.\nWith the newly formed Rogue One unit, led by Erso and Captain Cassian Andor, having already departed from Yavin, a rebel soldier notified Raddus on the Profundity of the rebel incursion on Scarif. Raddus ordered the fleet to set a course there. On Yavin, a rebel technician, Private Tenzigo Weems, also intercepted an Imperial signal indicating the rebels had engaged Imperial forces on Scarif. Despite not receiving authorization to attack Scarif, Raddus decided to divert his ship, with the Tantive IV in tow, to the tropical planet. After being informed of the situation, Mon Mothma requested she speak with Raddus but was told he had returned to his ship in preparation for battle. Deciding to go through with the attack, the Alliance Fleet was scrambled and departed for the Outer Rim world. Exiting hyperspace above the shielded planet, Raddus, from the bridge of the Profundity, ordered Red and Gold Squadron to defend the fleet while Blue Squadron headed through the Shield Gate in order to reach the planet's surface.\nAs Blue Squadron's fighters began crossing through the shield aperture, the Gate's technicians quickly closed the opening, destroying two and denying access to three of the Squadron's X-wings. With the shield closed, Raddus was informed by a bridge lieutenant that transmissions between Blue Squadron and the rest of the fleet were blocked. The admiral then ordered the fleet to bomb the shield as well as engage the two Star Destroyers holding position above the Shield Gate while they tried to re-establish communications. As the rebel fighters began strafing the Gate and shield aperture, dozens of TIE fighters were deployed from the station's hangar, proceeding to chase the Rebel ships away and fire a barrage of laser fire at the Profundity's bridge. With the flagship taking more damage with each TIE strafing run, draining its shields by fifty percent, Raddus acknowledged that it was too late to turn back and so ordered that they press their attack. Managing to find an opening in the Imperial starfighter assault, Gold Squadron bombarded the Star Destroyer Persecutor with ion torpedoes, causing the entire vessel to lose power. Seconds later, Raddus received a transmission from Bodhi Rook on the surface of Scarif informing him that they found the Death Star plans, but that the shield had to be taken down in order for them to be able to transmit the schematics. Assuring Rook that he would have the shield down, Raddus ordered the Sphyrna-class Hammerhead corvette Lightmaker to ram the disabled Star Destroyer and push it into the shield.\nWith all nonessential crew having abandoned ship, the Lightmaker rammed the capital ship, sending it crashing into the Star Destroyer—called the Intimidator—beside it before colliding with the Shield Gate and deflector shield below, creating the much-needed opening. Immediately, the Profundity began receiving the Death Star schematics from Erso. Raddus let out a brief celebration but was informed by the bridge lieutenant that a massive object was emerging from hyperspace: the Death Star. Moving into position above the Rebel fleet, Raddus watched as the Death Star fired its emerald superlaser at the Imperial complex below. After saying a farewell to Rogue One, Raddus ordered all ships to jump to hyperspace; however, before the Profundity had a chance to escape, Darth Vader's flagship, the Devastator, appeared. The Star Destroyer's turbolasers soon penetrated the Profundity's already weak shields and dealt enough damage to the vessel's hull to disable it. As the Alderaanian security soldiers aboard the ship scrambled to copy the Death Star plans to a datacard, Imperial forces, along with Vader himself, boarded the vessel. Though Vader cleared an entire hallway of rebels, the surviving soldiers managed to barely get away with the plans and escape on the docked corvette, Tantive IV. By the end of the battle, Raddus had perished as the Profundity was destroyed.\nAfter his death, Raddus' example inspired many to join the Rebel Alliance. Ackbar took on the responsibility of leading the Rebel fleet after the demise of his fellow Mon Calamari admiral. Later, Ackbar commanded the Rebel fleet during the mutiny on Mon Cala, helping to ensure the planet's fleet joined the Alliance Military.\nDecades after his role in the Battle of Scarif, Raddus's name was carried by the MC85 Star Cruiser known as the Raddus. Originally named the Dawn of Tranquility, the ship served in the New Republic before it was retired and handed over to the Resistance. Its name was changed to the Raddus as a recommendation by Ackbar. Despite considerable disagreements during their time in the Rebellion, Ackbar respected his predecessor greatly and wished to honor Raddus and his choice to defy the Alliance's political leaders and fight against insurmountable odds. Like its namesake, the ship was ultimately sacrificed for its cause, crippling the Supremacy and destroying about twenty First Order Star Destroyers by jumping to lightspeed through the Supremacy, allowing the remaining Resistance members to escape.\nAn outspoken and militant leader of one of the many rebel cells, Raddus could be considered blunt and brash, his practical nature leading him to dislike the petty politics that had kept the various rebel cells divided. This sometimes lead to friction with his fellow officers in the Rebellion, including Ackbar, who at the time saw Raddus as too improvisational and aggressive. When Jyn Erso disobeyed orders and took a team of volunteers to Scarif to steal the Death Star plans, Raddus was quick to follow suit in his flagship, the Profundity. As the admiral of the Rebel fleet at the Battle of Scarif, Raddus's command ensured the successful theft and transmission of the Death Star plans, ultimately leading to the Alliance victory at the Battle of Yavin. During the battle, Raddus was not afraid to commit resources to heavy assaults and sacrifice the crew of the Lightmaker to bring down Scarif's planetary shield. While capable of putting aside his feelings during military operations, Raddus wasn't devoid of emotion, as illustrated by his sadness over the deaths of the Rogue One personnel when the Death Star eradicated the entire surface theater of Scarif.\nRaddus carried a blaster pistol.\nRaddus, portrayed by Paul Kasey with animatronic performer Patrick Comerford and voiced by Stephen Stanton, is a character that was created and developed for the 2016 Star Wars Anthology film Rogue One: A Star Wars Story. The first footage of Raddus was revealed in the Celebration Europe reel on July 15, 2016. As stated by Neal Scanlan, the creature effects supervisor on Rogue One: A Star Wars Story, Admiral Raddus was inspired by Winston Churchill, the prime minister of the United Kingdom who famously led his country through World War II.\nRaddus' role in the story was originally intended to be filled by Admiral Ackbar, but following Ackbar's appearance in the 2015 film Star Wars: Episode VII The Force Awakens, his inclusion from the Battle of Scarif was dropped and the Raddus character was created instead. Actor Stephen Stanton stated in an interview with Collider that Raddus' voice was based on the combined voices of Winston Churchill and George C. Scott's portrayal of General George S. Patton in the 1970 film Patton.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Raddus_(disambiguation)",
  "/wiki/Star_Wars_Book_X:_Mutiny_at_Mon_Cala",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Mon_Cala",
  "/wiki/65_BBY",
  "/wiki/0_BBY",
  "/wiki/Profundity",
  "/wiki/Scarif_system",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Nystullum_city_government",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/Mon_Cala_Mercantile_Fleet",
  "/wiki/Galactic_Empire",
  "/wiki/Mon_Calamari_Exodus_Fleet",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Alliance_High_Command",
  "/wiki/Operation_Fracture_Oversight",
  "/wiki/File:Raddus-Fight.ogg",
  "/wiki/Admiral",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/Galactic_Civil_War",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/Imperial_Navy",
  "/wiki/Battle_of_Scarif",
  "/wiki/Flagship",
  "/wiki/Devastator",
  "/wiki/Anakin_Skywalker",
  "/wiki/Death_Star_plans",
  "/wiki/Rogue_One",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Death",
  "/wiki/Resistance",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Mayor",
  "/wiki/City",
  "/wiki/Nystullum",
  "/wiki/Planetary_defense_forces",
  "/wiki/18_BBY",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Sovereign",
  "/wiki/Ambassador",
  "/wiki/Telvar",
  "/wiki/Dac_City",
  "/wiki/Ferren_Barr",
  "/wiki/Inquisitorius",
  "/wiki/Battle_of_Dac_City",
  "/wiki/Commander",
  "/wiki/Gial_Ackbar",
  "/wiki/Shuttle",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/Chief_of_Security",
  "/wiki/Dac_City_palace",
  "/wiki/Defense_of_the_southern_polar_regions",
  "/wiki/Unidentified_Mon_Cala_creature",
  "/wiki/Star_Cruiser",
  "/wiki/Cruiser",
  "/wiki/Turbolaser",
  "/wiki/Blockade",
  "/wiki/Strokill_Prime",
  "/wiki/Battle_of_Mon_Calamari_(Clone_Wars)",
  "/wiki/Clone_Wars",
  "/wiki/City-ship",
  "/wiki/Realspace",
  "/wiki/Officer",
  "/wiki/Mon_Mothma",
  "/wiki/Alliance_Military",
  "/wiki/Capital_ship",
  "/wiki/Fleet",
  "/wiki/Starship",
  "/wiki/Telaris_system",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Heart",
  "/wiki/Minister_of_Finance",
  "/wiki/Nower_Jebel",
  "/wiki/Blood",
  "/wiki/Jyn_Erso",
  "/wiki/Superweapon",
  "/wiki/Battle_station",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Jedha_City",
  "/wiki/Jedha",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Scarif",
  "/wiki/Space_station",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Captain",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Technician",
  "/wiki/Private",
  "/wiki/Tenzigo_Weems",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hyperspace",
  "/wiki/Deflector_shield",
  "/wiki/Bridge_(starship)",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/Shield_Gate",
  "/wiki/Starfighter",
  "/wiki/X-wing_starfighter",
  "/wiki/Lieutenant",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Hangar",
  "/wiki/Star_Destroyer",
  "/wiki/Persecutor",
  "/wiki/Ion_torpedo",
  "/wiki/Second",
  "/wiki/Bodhi_Rook",
  "/wiki/Sphyrna-class_Hammerhead_corvette",
  "/wiki/Lightmaker",
  "/wiki/Escape_pod",
  "/wiki/Intimidator",
  "/wiki/Superlaser",
  "/wiki/Darth",
  "/wiki/Alderaanian_consular_security",
  "/wiki/Datacard",
  "/wiki/Corvette",
  "/wiki/Mutiny_on_Mon_Cala",
  "/wiki/Standard_decade",
  "/wiki/MC85_Star_Cruiser",
  "/wiki/New_Republic",
  "/wiki/Supremacy",
  "/wiki/First_Order",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Lightspeed",
  "/wiki/Blaster_pistol",
  "/wiki/Paul_Kasey",
  "/wiki/Stephen_Stanton",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Celebration_Europe_(2016)",
  "/wiki/July_15",
  "/wiki/Neal_Scanlan",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Darth_Vader_(2017)_15",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Darth_Vader_(2017)_17",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Star_Wars_(2015)_44",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_(2015)_48",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Rogue_One",
  "/wiki/Star_Wars",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_Incredible_Cross-Sections",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Profundity_Expansion_Pack",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/The_Last_Jedi:_Rose_Tico:_Resistance_Fighter",
  "/wiki/Star_Wars:_Resistance_Bomber_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_Outer_Rim",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_90",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unsung_Heroes",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_14",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_12",
  "/wiki/Pilots_and_Crew",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Thief",
  "/wiki/Entertainment_Weekly",
  "/wiki/January_12",
  "/wiki/2017",
  "/wiki/August_11",
  "/wiki/2020",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Poe_Dameron_31",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/November_18",
  "/wiki/June_16",
  "/wiki/November_10",
  "/wiki/December_30",
  "/wiki/March_24",
  "/wiki/December_3"
 ]
}