{
 "name": "Radeld Siwar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Radeld Siwar was a male Rodian smuggler that lived on Tatooine during the Galactic Civil War. He could often be found in the Mos Eisley Combat Hall.\nIn 1 ABY, the Corellian smuggler Han Solo asked him to show a young smuggler the ropes of their profession. Siwar decided to first send the smuggler to investigate a company called Bantha Moving and Storage, a front company for a spice smuggling organization. He asked the inexperienced spacer to locate and steal spice samples and recipes from the company that were hidden in the Junktown near Mos Eisley. The smuggler returned successfully, so Siwar kept him in mind for future tasks.\nWhen the Skaak Tippers started cutting into Siwar's business on Naboo, he contacted the aspiring smuggler again and sent him to that world to teach the bootlegger how experienced smugglers dealed with these kind of problems. The smuggler managed to successfully ambush and kill several Skaak Tipper members near Theed to send the gang a message, convincing Riwar that he could utilize the smuggler's skills to solve another problem with his spice moving operations on Naboo too. His local business was taking a hit due to the local Mauler gang that caused a lot of trouble, leading to heightened activity by the Royal Naboo Security Forces. He sent the smuggler to the Mauler Stronghold, where the young criminal ambushed the Maulers and killed several of them to quiet the gang down for a while. Siwar was very satisfied with the job and paid the smuggler a generous reward.\nRadeld Siwar appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Radeld Siwar was added to the game as part of the \"Legacy Quest\" with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005. He can be found in Mos Eisley and is part of two quests for players of the smuggler profession. The quests are started by inspecting documents that smugglers receive upon reaching certain player levels.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Smuggler/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Bantha_Moving_and_Storage",
  "/wiki/Spice/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Junktown",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Skaak_Tippers",
  "/wiki/Naboo/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Maulers",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Mauler_Stronghold",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}