{
 "name": "Rael Averross",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ringo Vinda"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Less than 1.93 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Pijali monarchy"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Dooku"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Nim Pianna"
     ]
    }
   ]
  }
 ],
 "content": "Rael Averross, a Force-sensitive human male, was a Jedi and the Lord Regent of Pijal during the era of the Galactic Republic. Trained by Jedi Master Dooku, Averross took a less strict approach to the ways of the Jedi Order. Around 40 BBY, he requested the help of Qui-Gon Jinn and Obi-Wan Kenobi during a dispute between Czerka Corporation and the Pijali monarchy.\nBorn on the planet Ringo Vinda during the era of the Galactic Republic, Rael Averross was inducted into the Jedi Order, having proven to be Force-sensitive, when he was five years old. He completed his training in the ways of the Force as the Padawan of Jedi Master Dooku, but had difficulty conforming to the Jedi Code. With time, Averross had earned a reputation among members of the Order as a famous duelist.\nAt some point after his apprenticeship with Dooku finished, Averross joined him in instructing a clan of Jedi initiates. Averross convinced Dooku to join him in a lightsaber duel. Afterward, Dooku accompanied him to the hangar, where Averross worked with Aitch-Sixteen on his starfighter's laser capacitors.\nAverross once joined Dooku and his second apprentice Qui-Gon Jinn in a battle on the planet of Shurrupak. Averross and Jinn formed a close connection, with Averross serving as a friend and mentor to Jinn. Their connection was close to the point that Jinn confided in Averross that Dooku had tortured Shenda Mol on Numidian Prime, though at the time Averross expressed that he was not all that concerned with his former master's conduct.\nAt some point before the Invasion of Naboo, Averross had an apprentice of his own, the Tholothian Nim Pianna. In 48 BBY, Averross and Pianna were assigned to protect the freighter Advent from pirates, but its crew mutinied and ended up hitting Pianna with a slicer dart. Averross was reluctantly forced to strike his apprentice down after the nanotechnology in the dart took control of her brain functions, which forced her to attack him. The Jedi High Council cleared Averross for the incident, although Averross believed himself to be responsible for what happened. However, his presence alone became distracting for the Council, which prompted them to send him on another assignment to keep him far from the Jedi Temple. This mission would send him to the planet Pijal.\nIn 48 BBY, the isolationist planet of Pijal sent a request to the Galactic Senate and the Jedi Council. With the death of their rulers, the throne had been inherited by the six-year old Crown Princess Fanry, who could not assume her authority until she officially came of age at fourteen. Due to infighting among the Pijali court, none of their candidates were considered suitable enough to ascend to the regency. Therefore, it was agreed that a Jedi would be sent to assume that position until the princess came of age. Following the events on the Advent, the Council believed that caring for a young girl and ensuring the correct rule of a planet would be the right mission for Averross.\nWhen Averross arrived on Pijal, he was struck by his first introduction to the young Fanry, who was clinging to her companion slave girl for company. Faced with the loneliness he saw in the young girl, the Jedi Knight swore that nothing else would matter to him in his duties other than protecting and caring for her. Averross was invested as the Lord Regent of Pijal and rapidly became embroiled in the intrigues and intricacies of the court.\nAverross was quickly confronted by the varying interests competing for influence on Pijal. Chief among these factions was the influential Czerka Corporation, a private conglomerate which had grown to such size and power in the Outer Rim and unaligned worlds that it was said to be as powerful as the Galactic Senate; some even claimed that Czerka was so old that it preceded the founding of the Republic. The corporation had been doing business on Pijal for so long that that its sector supervisors had gained permanent positions at court. Nevertheless, despite this influence, Czerka's presence was also controversial, notably due to its heavy involvement in the slave trade. Numerous servants at the Palace, including the princess's companion Cady, were Czerka slaves.\nAs tensions escalated between the Pijali monarchy and Czerka Arms, Averross requested the assistance of Qui-Gon Jinn, also a former student of Dooku , and his Padawan Obi-Wan Kenobi to settle the political dispute.\nAfter resolving the political dispute on Pijal, Rael succeeded in reaching his former master, who shared with him that he had discovered a great power that he wished to share with Averross. However, Averross rebuffed Dooku's offer and before cutting the transmission informed his former master that he had chosen the light and was not interested in what Dooku had to offer him.\nRael Averross was a human male with black hair, a strong, muscled physique and a relatively short height, barely reaching Qui-Gon Jinn's shoulder. He had tan skin and dark eyes.\nLater in life, Averross retained his Ringo Vindan accent. Much like Qui-Gon Jinn, he was more flexible in his views concerning the Jedi Code, making time to have sex but without forming attachments. He had a casual sexual relationship with Selbie, the local innkeeper. Nevertheless, Averross adhered to the light side of the Force. Unlike most Jedi, however, Averross did not care about his image, even to the point of consuming death sticks on Takodana. He also complained about aging after riding a Pijal varactyl.\nAccording to Supreme Chancellor Kirames Kaj, as relayed by Obi-Wan Kenobi, Averross was deemed \"controversial.\" He was considered extremely reckless and prideful, even by his friend Jinn. Fellow Jedi Tera Sinube referred to him as a \"hyperstorm.\"\nRael Averross wielded a blue-bladed lightsaber in combat.\nRael Averross first appeared in the canon novel Master \u0026 Apprentice, which was written by Claudia Gray and published in 2019. Averross was named after the real-world philosopher Averroes. Gray imagined Averross as being portrayed by actor Benjamin Bratt. Averross was later included in Cavan Scott's original audiobook Dooku: Jedi Lost, which explores his master's backstory; to do so, Scott worked closely with Gray, citing Averross' inclusion in the audiobook particularly beneficial.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Rael_Averross",
  "/wiki/Ringo_Vinda",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Pijali_monarchy",
  "/wiki/Dooku",
  "/wiki/Nim_Pianna",
  "/wiki/Force-sensitive",
  "/wiki/Jedi",
  "/wiki/Lord",
  "/wiki/Regent",
  "/wiki/Pijal",
  "/wiki/Republic_Era",
  "/wiki/Jedi_training",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_Code",
  "/wiki/40_BBY",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Politics",
  "/wiki/Czerka_Arms",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Jedi_Initiate",
  "/wiki/Standard_year",
  "/wiki/The_Force",
  "/wiki/Padawan",
  "/wiki/Hangar",
  "/wiki/Aitch-Sixteen",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor",
  "/wiki/Shurrupak",
  "/wiki/Shenda_Mol",
  "/wiki/Numidian_Prime",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Tholothian",
  "/wiki/48_BBY/Legends",
  "/wiki/Freighter",
  "/wiki/Advent",
  "/wiki/Pirate",
  "/wiki/Slicer_dart",
  "/wiki/Nanotechnology",
  "/wiki/Brain",
  "/wiki/Jedi_High_Council",
  "/wiki/Imperial_Palace",
  "/wiki/48_BBY",
  "/wiki/Prince",
  "/wiki/Fanry",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Cady",
  "/wiki/Time",
  "/wiki/Selbie",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Death_stick",
  "/wiki/Takodana",
  "/wiki/Pijal_varactyl",
  "/wiki/Supreme_Chancellor",
  "/wiki/Kirames_Kaj",
  "/wiki/Tera_Sinube",
  "/wiki/Lightsaber",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Claudia_Gray",
  "/wiki/2019",
  "/wiki/Cavan_Scott",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Dooku_Captured_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark_(audiobook)",
  "/wiki/Category:Audio_files_of_Rael_Averross",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com"
 ]
}