{
 "name": "Rafa Martez",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Martez family"
     ]
    }
   ]
  }
 ],
 "content": "Rafa Martez was a human female who, along with her younger sister Trace, lived on Level 1313 on the planet Coruscant during the waning days of the Galactic Republic. Her parents were killed during the pursuit of Ziro the Hutt when a ship crashed into their home on the side of an underworld portal.\nDuring the Clone Wars, Rafa met the former Jedi Padawan Ahsoka Tano. Tano accompanied the sisters on a job delivering spice from Kessel to Oba Diah. When Tano objected and explained the uses of spice, Trace dumped the shipment. Now owing the Pykes of Oba Diah, the group was captured. Eventually, they escaped, though the sisters learned of Tano's Jedi past. Tano's actions changed Rafa's view of the Jedi, and when Tano left to assist with the capture of Maul, they parted as friends.\nShortly after the rise of the Galactic Empire, Rafa and her sister, working for the former Clone Captain Rex, attempted to retrieve the data from a tactical droid on Corellia. They encountered Clone Force 99, who was attempting to retrieve the same data. Following a engagement with local police droids, Hunter willingly gave the data to the sisters after learning that they would use it to fight the Empire.\nRafa and her younger sister Trace lived on Level 1313 in the Coruscant Underworld on the core planet of Coruscant. During Ziro the Hutt's escape from the Republic's Detention Center and Senate Building, a red-eyed alien shot at a transport's engine, sending the ship spinning out of control. The Jedi diverted the transport away from a populated landing platform, but in doing so accidentally caused it to crash into the home of the Martez family instead. Rafa and her sister were saved by their parents; unfortunately, their parents were killed when the transport crashed. Afterwards, a female Jedi with green skin and dark robes visited Rafa and Trace, but instead of attempting to help the orphaned sisters, she told them that she needed to make a choice about the transport and that they shouldn't worry, for the Force would be with them. The Jedi then departed, leaving Rafa and Trace, who had once regarded the Jedi as heroes, disillusioned and embittered against the Order.\nLeft to survive on their own with no help from anyone, Rafa became something of a guardian to Trace, and taught her that they could only rely on each other. Rafa soon became the owner of a hangar and a laundromat, which she used as fronts while doing illegal activities. Trace became a mechanic, and they worked together to make enough money to leave Coruscant and escape from the Clone Wars. Rafa also began making some debts with people like Pintu Son-El, much to Trace's dismay.\nNear the end of the war, Rafa was making a deal with Lokann and his business partner in the laundromat when her sister arrived at the laundromat with her new friend, Ahsoka Tano. Rafa was immediately dissatisfied with Ahsoka's presence due to the fact that her and Trace were so close. When Rafa agreed to fix three binary loadlifters for Lokann, Trace and Ahsoka began to work on them in the hangar. When one of the droids got loose and caused some damage, Ahsoka told Rafa that she should dismantle the droids since they were dangerous. However, Rafa said that a deal was a deal and did not mind that they were dangerous. When Rafa returned the droids to Lokann and his partner, Ahsoka was upset, but Rafa said that if she hadn't done it, someone else would have. Trace began to side with Ahsoka, which made Rafa even angrier and more hostile towards the newcomer.\nLater, a job that Rafa had lined up smuggling spice fell apart when the ship and crew she had hired backed out. Desperate for the money, she asked Trace to be her pilot and fly her ship, the Silver Angel. Trace was reluctant to become involved, but decided to nonetheless. Trace welcomed Ahsoka onboard, but Rafa suspiciously asked what her \"angle\" was by sticking with them. When Tano retorted that she was just trying to keep them out of trouble, Rafa coldly remarked that maybe she was the trouble Trace needed to stay away from. Without revealing that their job was a spice run, Rafa let Trace fly and the trio flew towards the upper levels. As they jump to hyperspace, Rafa tries to complement Trace while noting to Ahsoka that her sister was an inexperienced pilot and that is why she was not her first choice for the mission.\nAs they arrived at the Akkadese Maelstrom and the Kessel Run, Tano began to deduce what their goals might be. Landing at a castle in Kessel's forested southern hemisphere, Rafa led the way as they met with Kinash Lock, King Yaruba's majordomo. As they discussed the terms of their arrangement in the banquet hall, Rafa maneuvered her way through discussions despite Trace's overexcitement about the situation and Ahsoka's questioning of what would be done with the spice they were transporting. They left to pick up the spice, and as they flew over the mines, Rafa noted her surprise at how many droid workers there are. When Ahsoka told her that they were slaves and not droids, Rafa said that the Republic would not allow slavery, to which Tano sadly remarked that slavery persisted in the galaxy despite the laws against it. As the spice is loaded onto the ship, Rafa pulled her sister aside to tell her not to trust Ahsoka. When Trace complained that Rafa never liked any of her friends, Rafa replied that Ahsoka was not family and should not interfere with their business. She reminded Trace that she got them the job and that it was Trace's job to execute as the pilot.\nBack in space, Tano asked who they were delivering to, to which Rafa replied that they would be visiting Marg Krim and the Pyke Syndicate on Oba Diah. Ahsoka was appalled by this, making Rafa even more annoyed. When the Togruta warned Rafa how dangerous the Pykes were, Rafa said that she already made a deal with them and that they needed the money. As Tano said that business with the Pykes could end in the loss of their ship or even their deaths, Trace became alarmed. Tano suggested they take the spice somewhere where it could be used as medicine, but Rafa yelled that her debts could not be paid off with morality. However, as the pair continued to argue, Trace decided to dump the spice in an effort to avoid delivering it to the Pykes, but this earned her the ire of both Rafa and Ahsoka. As the group mulled over their options now that they had no spice and a contract with the Pykes to fulfill, Rafa and Trace decided to trust Ahsoka as she made a plan.\nWhen the group arrived on Oba Diah, they were confronted by Marg Krim. He withheld the payment, wishing to verify the spice. The group unloaded empty crates and Tano, using the Force secretly, mind tricked Krim into giving them the money and allowing them to leave. However, Fife, Krim's majordomo, noticed that something was wrong. He ordered the guards to search the crates, and discovered the deception. With their plan falling apart, Tano and the sisters ran back to the Silver Angel and attempted to escape. This was cut short, as several Pyke ships surrounded the  Angel and the ship was captured in a tractor beam. The trio was taken into custody and put in one of the Pyke's holding cells.\nWhile in the cell, the three began arguing over who's fault the situation was. When Ahsoka told Rafa that she refused to let her profit of other's suffering, Rafa likened her to a Jedi. Tano entertained the possibility, but Trace told her not to kid around. Following this interaction, Rafa told Tano of their parents' death and the sisters' distaste of the Jedi. Ahsoka hardly had time to process the story, as several guards arrived to escort Rafa to interrogation.\nOnce in the chamber, an interrogation droid walked up to the franticly bargaining Rafa. However, she was unable to talk her way out of it and ended up being tortured until she was unconscious. She was then brought back to the cell, where the others saw her condition. Furious at their actions, Trace began pushing and yelling at the guards. They subsequently grabbed her and took her for interrogation as well.\nUpon reaching the chamber, Trace pretended to faint, and used this to grab one of the guards weapons and escape. Meanwhile, Tano used the Force to activate the cell's controls. After opening the door, she woke up Rafa and the two rushed to save Trace, not knowing she had freed herself. Following another altercation with the guards, Trace ran towards the holding cells, where she and Rafa collided with each other. After a brief argument, the three made it to the outside of the facility, where they barricaded the door with barrels of explosive material. During the ensuing firefight, Trace shot the explosives to defeat the remaining guards. However, due to the security alert, the bridge that led away from the facility began to retract. Rafa ran and jumped across the gap, but by the time the others got there, it had retracted too far to jump. Despite this, Trace attempted to jump, and knowing she wouldn't make it, Ahsoka subtly used the Force to push Trace the remaining distance. While the sisters argued whether to leave Ahsoka, she Force jumped across the gap, saying she was more athletic that she looked.\nGetting onto the ground level, Ahsoka went to disable the gate while the sisters distracted the guards. After incapacitating all the guards in the control tower, unlocked the gate and left the control tower. Ahsoka used the Force to secretly assist the sisters during the firefight, then ran to reunite with them. The trio fled into the surrounding city.\nTrace saw the Silver Angel and ran ahead of the other two. Without any danger nearby, Rafa took the opportunity to question Tano about her motives. During the conversation, a Gotal haggled the two for credits and Rafa dismissed him. As the two continued talking and reunited with Trace, the Gotal encountered several Pyke guards, who had a hologram of the three prison breakers. He recognized them, and offered to show the guards where they had gone in exchange for credits. He led them to the trio, and thus began a chase through the city's streets. While running, they bumped into a member of the Nite Owls, who recognized Ahsoka, although the three did not notice the Mandalorian. Rafa and Trace were quickly caught, but Tano managed to escape by jumping onto a civilian's landspeeder. While the sisters were being detained, Ahsoka escaped into an alley. Bo-Katan Kryze and Ursa Wren, from a vantage point, watched the sisters be captured and discussed Kryze's encounter with Tano on Carlac.\nRafa and Trace were brought before a hologram of Marg Krim. Fife made sure they were in the open in order to draw out Tano. He planned to execute them, then capture and torture Ahsoka to learn the location of the spice. Ahsoka had been watching the conversation and was lured into a fight. She commandeered a repulsorcraft and flew it into the guards, incapacitating several. The sisters ran for to board the craft, but Rafa was grabbed by a guard. She ran for safety as Trace and Tano took out the rest of the guards. During the fight however, Fife had left the courtyard and acquired landspeeder equipped with a cannon. The speeder fired of the craft, destroying it. Guards swarmed the trio, who surrendered. After returning to their cell, Rafa apologized to the others and admitted she shouldn't have taken the job. Ahsoka reassured her, telling her that \"We live and learn.\"\nAfter returning to their cell, Rafa blamed Ahsoka for landing them in trouble by convincing Trace to dump the spice and that things would have worked out if they had followed her plan. When Ahsoka criticized Rafa's plan as the root of the problem, Trace sided with Ahsoka, which hurt Rafa. Ahsoka told the Martez sisters that she had a plan but could not divulge it. She told them to trust her.\nIn Krim's throneroom, Ahsoka claimed that she and the Martez sisters had hidden the spice offworld. She convinced the Pykes to send them offworld to retrieve the spice within one rotation or Ahsoka would reveal the location of the Martez's family. Tano also demanded a small percentage of the value of the spice shipment. Unaware about Tano's deception, Krim ordered the Martez sisters to retrieve the spice within one rotation or he would kill Tano, them and their family. Rafa however was aware that Tano was trying to save them. Before leaving, Rafa told Tano that she \"would never forget this.\"\nWhile refueling the Silver Angel at the Orondia Refueling Station, Trace was puzzled that Ahsoka would threaten to give up their family when she knew their parents were dead. In response, Rafa pointed out that Ahsoka had sacrificed herself so that they could escape. Out of respect for Ahsoka, Rafa resolved that they would return the favor by rescuing Tano.\nTraveling to a Pyke spice loading facility, Rafa convinced the workers including a Toong worker that they had special request from the Pykes to obtain spice. The two were soon confronted by the Trandoshan manager, who demanded to see their manifest. When the Trandoshan assaulted Trace, Rafa attacked him. The two sisters fought the Trandoshan, who was killed when Rafa dropped him from a crane over the cliff.\nWhen the Martez sisters return to the Pyke Palace with their spice shipment, they found that the Pykes were preparing to execute Tano on the pretext that she was a spy for the Jedi and the Galactic Republic. In their absence, Tano had escaped captivity and discovered that the former Sith apprentice Maul was on Mandalore. The Martez sisters were also shocked that Tano had kept her Jedi identity a secret from them. The trio were able to escape the Pyke Palace aboard the Silver Angel since Tano had planted explosives throughout the building. The Pykes sent starships after them but Ahsoka and Trace managed to shoot them down.\nThe Martez sisters and Ahsoka then returned to their hangar on Coruscant. Realizing that Tano was a Jedi, Rafa asked if she was going to report them for illicit spice smuggling. However, Tano responded that she had left the Jedi Order. Rafa responded that even though Tano was no longer a Jedi, she acted as how she wanted the Jedi to be.\nThe Martez sisters were both present when a group of Mandalorians led by Bo-Katan Kryze visited the hangar, seeking Ahsoka's help in dealing with the threat of Maul. When Tano speculated that this encounter with Maul could lead her back to the Jedi, Rafa suggested that Tano was meant to be a Jedi. Before leaving with the Mandalorians, Tano left her speeder bike with the sisters for safekeeping. When Tano's former master Anakin Skywalker asked Tano about what she was doing on Oba Diah, Tano alluded to her adventures with the Martez sisters without directly mentioning them.\nFollowing Order 66 and the rise of the Galactic Empire in 19 BBY, Rafa and her sister came into contact with the former Clone Captain Rex. At one point, he sent them to retrieve the data from a decommissioned tactical droid on Corellia. The tactical droid was scheduled for destruction along with other decommissioned Separatist battle droids at a Corellian decommissioning facility.\nDuring the job, they encountered the rogue Clone trooper squad known as the Bad Batch, who had been hired by the Trandoshan information broker Cid to retrieve the same data. While Trace climbed onto a conveyer belt in the northern sector to retrieve the head, Rafa kept watch from overhead. During the course of her mission, she encountered the female Jango Fett clone Omega, who was armed with a Zygerrian energy bow. Realizing that Omega was a child, Rafa did not want to hurt her and attempted to reason with her. When Rafa grabbed the energy bow, a struggle ensued and Omega ended up firing a bolt from the energy bow into a gas vent.\nThis alerted the Corellian factory workers to the presence of intruders. The workers locked down the factory and summoned numerous police droids, who swarmed the factory. As a gun battle ensued between the Bad Batch and the police droids, Rafa took the opportunity to flee. Omega pursued Rafa through the decommissioning plant. Trace managed to throw the tactical droid's head to Rafa before the Bad Batch's leader Hunter could stop her. However, Rafa bumped into a police droid and dropped the droid's head onto a conveyer belt, prompting a race between Trace and Omega.\nAfter Hunter saved Rafa from several police droids, the two took shelter behind the controls, which they turned into an improvised stronghold. The two put side their differences to fend off the police droids. As more police droids converged, Hunter used his grappling hook to collapse a nearby walkway, crushing several battle droids. Rafa and Hunter later reunited with Trace, Omega, and the rest of the Bad Batch including Echo, Tech, and Wrecker. Trace had save Omega from being crushed to death by a smelter, earning mutual respect between the two opposing groups.\nThe two groups decided to work together to escape the factory and resolve their dispute over the tactical droid later. Working together, Trace and Tech reprogrammed the tactical droid's head to reactivate the decommissioned battle droids and use them to attack the police droids. This created a diversion for the Martez sisters and Bad Batch to flee the decommissioning plant and rendezvous with the Martez sisters' ship Silver Angel. However, Trace lost the tactical droid's head, which was destroyed during the escape attempt.\nWhile traveling aboard the Silver Angel, Rafa asked the clones if they knew whom they were working for. Hunter explained that they were being hired to acquire and deliver, and not to ask questions. This prompted Trace to explain that she and Rafa were part of an anti-Imperial resistance movement. When Rafa asked the Bad Batch why they were not fighting for the Galactic Empire, Hunter explained that not all Clone troopers fought for the Empire.\nLater, the Martez sisters dropped the Bad Batch and Omega near their ship Marauder. Having developed a friendship with the Martez sisters, Omega invited them both to visit her and the Bad Batch on Ord Mantell. After Omega left, Hunter willingly gave Rafa a data rod containing the intelligence that the clones had extracted from the tactical droid before it was destroyed. Hunter explained that the Martez sisters were doing it for the right reason. When Rafa observed that the Bad Batch were different from their comrades, Hunter replies that things were clearer during the Clone Wars. Rafa advises that in the end they all take sides.\nAfter parting company with the Bad Batch, Rafa contacted Rex and informed him of the rogue clone squad. Rex subsequently met up with the Bad Batch on Ord Mantell and told them that the Martez sisters had alerted them to their resistance against the Empire.\nRafa was a human female with tan skin and brown eyes. Her brown hair was long on the right but shaven on the left side of her head.\nRafa borrowed money from criminals like Pintu Son-El and had trouble paying them back. Rafa was also a skilled manipulator as she was able to convince others to make deals with her. Despite her shady dealings, Rafa often became involved in various dealings to provide for her sister and herself since they had lost their parents.\nAs a result of the loss of their parents, Rafa became a mother figure to Trace, becoming very protective of her and often telling her that they only had to rely on each other. Unlike Trace, Rafa was not open to people and did not trust anyone, even if they befriended her sister. Rafa was suspicious of Ahsoka Tano, suspecting she was hiding something from her and her sister or was after something that they had. She was also willing to leave Tano behind while escaping from the Pykes, despite showing some concern for her. However, during and after their escape attempt, Rafa started to get along with Tano.\nRafa also has a tendency to make skeptical excuses about the atrocities of the criminals of the galaxy, such as when he said that the workers in the spice mines of the planet Kessel were just laborers, when they were clearly slaves.\nAfter the Jedi accidentally killed Rafa's parents in the pursuit of Ziro the Hutt and did very little to comfort or help her and her sister afterwards, Rafa developed resentment towards the Jedi. After finding out Ahsoka was a former Jedi Padawan, Rafa showed a viewpoint on how the Jedi should act through compassion and productiveness after seeing Tano helping her and Trace with the Pykes.\nWhen taking up a deal with the Pyke Syndicate, Rafa believed when doing business, you don't need to worry about any inflicted torture or death, but instead think about how better life is going to get when making money. However, after being recaptured by the Pykes, Rafa started to feel guilty for making a deal with the Pykes and eventually apologized to Trace and Ahsoka for putting them in danger.\nFollowing the creation of the Galactic Empire, Rafa and Trace joined an anti-Imperial resistance movement, which they believed would help the people and make things better. Though the Martez sisters initially clashed with the Bad Batch, they joined forces to escape several armed police droids. After learning that the Martez sisters were fighting the Empire, Hunter gave them the data his squad had obtained from the head of the tactical droid. Rafa and Trace also came to realize that the Bad Batch were different from other Clone troopers who remained loyal to the Empire.\nRafa was also unwilling to hurt Omega whom was a child. Due to their adventure on Corellia, Omega developed a friendship with the Martez sisters and even invited them to visit the Bad Batch's stomping ground on Ord Mantell.\nRafa was familiar with various forms of combat including unarmed combat. She also knew how to wield a blaster.\nRafa Martez first appeared in the Star Wars: The Clone Wars episode \"Gone with a Trace.\" She is voiced by Elizabeth Rodriguez. Rafa's design was originally for her sister Trace, being one of the design options that artist JP Balmet presented to Dave Filoni.\nWhen the episode story arc featuring the Martez sisters was originally in development, before The Clone Wars was cancelled, Rafa and Trace did not exist. Instead, Ahsoka would have met a young mechanic named Nyx Okami, who filled the Martez sisters' role as the one who owed money to Pintu Son-El.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rafa_(disambiguation)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Special:Upload",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Martez_family",
  "/wiki/Trace_Martez",
  "/wiki/Level_1313",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Death",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Starship",
  "/wiki/Underworld_portal",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Spice",
  "/wiki/Kessel",
  "/wiki/Oba_Diah",
  "/wiki/Pyke_Syndicate",
  "/wiki/Maul",
  "/wiki/Galactic_Empire",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Tactical_droid",
  "/wiki/Corellia",
  "/wiki/Clone_Force_99",
  "/wiki/Police_droid",
  "/wiki/Hunter",
  "/wiki/Coruscant_Underworld",
  "/wiki/Core_Worlds",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Republic_Judiciary_Central_Detention_Center",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Cad_Bane",
  "/wiki/Rafa%27s_Laundry",
  "/wiki/Technician",
  "/wiki/Currency",
  "/wiki/Pintu_Son-El",
  "/wiki/Lokann",
  "/wiki/Lokann%27s_business_partner",
  "/wiki/Binary_loadlifter",
  "/wiki/Silver_Angel",
  "/wiki/Hyperspace",
  "/wiki/Akkadese_Maelstrom",
  "/wiki/Kessel_Run",
  "/wiki/Kessel_Castle",
  "/wiki/Forest",
  "/wiki/Kinash_Lock",
  "/wiki/King",
  "/wiki/Yaruba",
  "/wiki/Majordomo",
  "/wiki/Marg_Krim",
  "/wiki/Togruta",
  "/wiki/The_Force",
  "/wiki/Fife",
  "/wiki/Tractor_beam",
  "/wiki/Force_jump",
  "/wiki/Gotal",
  "/wiki/Credit",
  "/wiki/Nite_Owls",
  "/wiki/Mandalorian",
  "/wiki/Landspeeder",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Ursa_Wren",
  "/wiki/Carlac",
  "/wiki/Repulsorcraft",
  "/wiki/Orondia_Refueling_Station",
  "/wiki/Unidentified_Toong_worker",
  "/wiki/Unidentified_Trandoshan_manager",
  "/wiki/Sith_apprentice",
  "/wiki/Mandalore",
  "/wiki/Anakin_Skywalker",
  "/wiki/Order_66",
  "/wiki/19_BBY",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_droid",
  "/wiki/Decommissioning_facility",
  "/wiki/Clone_trooper",
  "/wiki/Trandoshan",
  "/wiki/Cid",
  "/wiki/Jango_Fett",
  "/wiki/Cloning",
  "/wiki/Omega",
  "/wiki/Zygerrian_energy_bow",
  "/wiki/Echo",
  "/wiki/Tech",
  "/wiki/Wrecker",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Ord_Mantell",
  "/wiki/The_galaxy",
  "/wiki/Blaster",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Gone_with_a_Trace",
  "/wiki/Elizabeth_Rodriguez",
  "/wiki/JP_Balmet",
  "/wiki/Dave_Filoni",
  "/wiki/Nyx_Okami",
  "/wiki/Deal_No_Deal",
  "/wiki/The_Clone_Wars:_Season_7:_Volume_1",
  "/wiki/Dangerous_Debt",
  "/wiki/Together_Again",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Decommissioned",
  "/wiki/Battle_Scars",
  "/wiki/Category:Audio_files_of_Rafa_Martez",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Final_Countdown",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/Hostage_Crisis",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith"
 ]
}