{
 "name": "Ragate",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3637 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sith",
      "Korriban Sith Academy",
      "Sith",
      "Korriban Sith Academy"
     ]
    }
   ]
  }
 ],
 "content": "Ragate was a female Human Sith of the reconstituted Sith Empire and an overseer at the Korriban Sith Academy. During the Galactic War between the Sith Empire and the Galactic Republic, she administrated the rite of blood and bone at the Academy. Around 3637 BBY, Ragate was killed when a Republic strike team barged into the Academy.\nA female Human, Ragate was a member of the reconstituted Sith Empire. As an Overseer at the Sith Academy of Korriban, Ragate was tasked with instructing multiple acolytes in the ways of the dark side of the Force. By the time of the Galactic War, Overseer Ragate had become an old, frail-looking woman. As the administrator of the rite of blood and bone, she supervised the test of many acolytes. During her tenure as administrator of the rite, Ragate supervised the tests of a promising Sith warrior and of the soon-to-be Lord Kallig. In 3637 BBY, the Republic devised a plan to retrieve a set of data from the chambers of the Empire's Dark Council, which were located in the Sith Academy. When a group of four Republic heroes broke into the Academy, Ragate and her fellow overseers tried to block access to the turbolift leading to the Dark Council chambers. However, the old overseer proved unable to stop the enemy strike team, and she died defending the Sith Academy.\nBy the time of the Galactic War, Overseer Ragate was a gray-haired, elderly woman with red eyes who described herself as a guardian of ancient traditions.\nRagate was skilled in precognition, as she could see glimpses of the future. She wielded a single-bladed lightsaber with a yellow crystal in combat.\nRagate is a non-player character in the Star Wars: The Old Republic video game. She is featured in the Korriban mission, \"The Blood Legacy\", exclusively for Sith Warriors and Sith Inquisitors, and later in the Republic flashpoint mission, \"Korriban Incursion\" as of Game Update 2.7: Invasion.\nAmong the conversation choices, the player can joke about Ragate's old age, implying she might have been beautiful millennia ago. In Star Wars: Knights of the Old Republic II: The Sith Lords, the character of Atton Rand made a similar mockery of Kreia, stating that \"She may have been good-looking once, but it takes some hard living to make creases like that.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3637_BBY",
  "/wiki/Korriban",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/File:Ragate-KeeperOfTheOldWays-TOR.ogg",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Overseer_(Sith)",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Rite_of_blood_and_bone",
  "/wiki/Death/Legends",
  "/wiki/Sith_Acolyte",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Nox",
  "/wiki/Dark_Council_Chambers",
  "/wiki/Dark_Council",
  "/wiki/Korriban_Incursion",
  "/wiki/Turbolift/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Precognition/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Atton_Rand",
  "/wiki/Kreia",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ragate",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3638_BBY",
  "/wiki/2013",
  "/wiki/Standard_year/Legends",
  "/wiki/2014",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/3636_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}