{
 "name": "Ragon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Besalisk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Ragon was a Besalisk male doctor who had a history with Boba Fett, a bounty hunter. Between 3 ABY and 4 ABY, Ragon was working on Nar Shaddaa and assisted Fett with containing Han Solo in carbonite. In exchange for help, Ragon asked Fett to kill Wyrmen Lictor, a warrior who was valuable to the Kanji Hutts and fought in the Garkata Fighting Arena. The bounty hunter joined the fights in the arena, and Ragon, after finishing to stabilize the carbonite matrix, was killed by some members of the Crimson Dawn, a criminal syndicate, who later stole the matrix.\nRagon was a criminal doctor who worked on the smuggling moon of Nar Shaddaa. By 4 ABY, Ragon sponsored a fighter that took part in the fights in the Garkata Fighting Arena, but Wyrmen Lictor, a warrior who was valuable to the Kanji Hutts, killed the warrior, and Ragon lost various credits. During his period of activity as a doctor, he met the fearsome bounty hunter Boba Fett.\nBetween 3 ABY and 4 ABY, Fett was transporting to Jabba the Hutt the rebel captain Han Solo, that had been previously frozen in carbonite. While communicating with Jabba's majordomo Bib Fortuna, Fett realized that the carbonite that contained Solo was getting unstable and decided to land on Nar Shaddaa to ask Ragon for help. The doctor assured Fett that he could have stabilized Solo but asked to be paid first. Fett, however, said that he would have paid Ragon twice as much once he delivered Solo, but Ragon replied that he does not work on credit. Since Fett did not have enough credits to pay him, Ragon said that if Fett killed Lictor, he would have saved Solo. The doctor claimed that Lictor was protected by \"about a thousand\" Kanji and that the only way to kill her was to join the fights in the Garkata Fighting Arena. However, Fett thought his armor was too recognizable, and Ragon lent him some nano-spray paint to paint his armor black so that he could join the fights under a false identity.\nFett took part in the fights, and Ragon repaired the carbonite matrix and stabilized Solo. He later went to a cantina, where he sat next to a Zabrak female and told some fellow individuals about how someone thought that his sister was a Trandoshan, causing their laughter. When the bounty hunter Deva Lompop arrived in the cantina, she sat next to the doctor, and he told her about how he fixed the carbonite matrix and saved Solo. After receiving this information, Lompop drugged Ragon but did not kill him. She later communicated to the Crimson Dawn, a criminal syndicate, the position of the carbonite matrix.\nAfter winning the fights and killing Lictor, Fett was walking back to Doc Ragon's clinic when several members of the Crimson Dawn broke into the clinic, shot Ragon, and stole Solo's frozen body. When Fett saw Ragon's corpse, he prepared to go in search of the thieves in order to recover Solo. Fett went to a bar to find hints about who stole his bounty, and he mentioned Ragon to the bartender. While in the bar, Tekrit, a humanoid bounty hunter, tried to shoot Fett in the back, but Fett killed him before the humanoid could hit him. After realizing that the bartender could not help him with his research, Fett left the cantina.\nRagon was a Besalisk male with brown skin and eyes. He also had brown mustaches and a brown beard. Ragon worked only upon advance payment, and when Fett said that he could not pay him, he asked the bounty hunter to kill Lictor out of desire for revenge. Ragon liked to bet on fights, drink, and make new friends. When drunk, Ragon bragged about his skill in stabilizing the carbonite matrix in public, despite it being a delicate and secret job.\nRagon was able to perform surgery and used nano-spray paint to mark up patiets before the surgical operation. He could also stabilize carbonite matrices.\nRagon wore a white tanktop, blue trousers and yellow gloves. He also occasionally wore blue boots and a beige jacket.\nDoc Ragon first appeared in War of the Bounty Hunters Alpha 1, a comic book written by Charles Soule, and published by Marvel Comics on May 5, 2021. When the Star Wars: War of the Bounty Hunters event was first revealed, Soule initially stated on Twitter that Ragon was called Doc Leroy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Nar_Shaddaa",
  "/wiki/Besalisk",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Doctor",
  "/wiki/Boba_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Wyrmen_Lictor",
  "/wiki/Kanji_Criminal_Enterprise",
  "/wiki/Hutt",
  "/wiki/Garkata_Fighting_Arena",
  "/wiki/Death",
  "/wiki/Crimson_Dawn",
  "/wiki/Smuggler",
  "/wiki/Moon",
  "/wiki/Unidentified_pit_fighter_(Ragon)",
  "/wiki/Credit",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Captain",
  "/wiki/Carbon-freezing",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Boba_Fett%27s_armor",
  "/wiki/Nano-spray_paint",
  "/wiki/Armor",
  "/wiki/Cantina",
  "/wiki/Zabrak",
  "/wiki/Ragon%27s_sister",
  "/wiki/Trandoshan",
  "/wiki/Deva_Lompop",
  "/wiki/Doc_Ragon%27s_clinic",
  "/wiki/Unidentified_bar_(Nar_Shaddaa)",
  "/wiki/Unidentified_Zabrak_bartender",
  "/wiki/Tekrit",
  "/wiki/Humanoid",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/War_of_the_Bounty_Hunters_Alpha_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Charles_Soule",
  "/wiki/Marvel_Comics",
  "/wiki/May_5",
  "/wiki/2021",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters",
  "/wiki/Category:Images_of_Ragon",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Jabba_the_Hutt_1",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition"
 ]
}