{
 "name": "Raik_Muun",
 "display_name": "Raik Muun",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human half-breed"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Valin Draco"
     ]
    }
   ]
  }
 ],
 "content": "Raik Muun was a Force-sensitive female Human half-breed who became a Dark Jedi during the waning years of the Galactic Republic. Muun joined the Jedi Order and studied at the Almas Academy, a Jedi school that was located on the planet Almas in the Cularin system. She attempted to pursue a romantic relationship with fellow student Nek Lawsirk, but he rejected her, and she was dismissed from the Academy by Jedi Master Kirlocca. Muun left the system and fell to the dark side of the Force. She returned a few years later, determined to destroy the reputation of the Almas Jedi and ultimately drive them out of the Cularin system. She based herself on the moon Tilnes and, after learning of the existence of a dangerous creature known as the t'salak, Muun traveled to the planet Cularin, where she planned to find the creature and use it in her plot against the Jedi.\nMuun discovered the cavern where the creature was hidden but was unsuccessful in freeing it. Afterward, she pursued a different method for freeing the t'salak by capturing Nek Lawsirk and then disguising herself as him, allowing her to obtain the creature from Morad'Ka, the Mother of the Tarasin tribe Jaraana irstat. She forced some captured scientists to make the creature reproduce but was driven from Tilnes by a group of freelance agents who had been hired by the Jedi to find Lawsirk. Muun then orchestrated a plan to unleash the t'salak during a peace conference that was being held by the Jedi and the Sentient Beings Opposing Violence aboard the liner Luxury, using the creatures to enrage the attending Jedi and so discredit the Jedi Order. However, the agents who had driven her from Tilnes confronted her and thwarted her plans, forcing her to flee the ship. Following the Clone Wars, Muun traveled to the planet Coruscant and became the apprentice of Inquisitor Valin Draco, a Dark Jedi who served the Galactic Empire as a Jedi hunter. She accompanied him on a mission to investigate the ruins of the Almas Academy but was defeated when they were attacked by a group of Alderaanian Resistance agents.\nA Force-sensitive female Human half-breed, Raik Muun was born during the waning years of the Galactic Republic. She joined the Jedi Order and enrolled in the Almas Academy, a Jedi learning center located on the planet Almas, in the Cularin system. However, she did not adapt well to the rigors of Jedi life and attempted to pursue a romantic relationship with one of her fellow students, the Zabrak Nek Lawsirk, despite such relationships being forbidden among the Jedi. Lawsirk rejected her advances, which greatly upset her. Wookiee Jedi Master Kirlocca, the Academy's lightsaber instructor, learned of what Muun had done and believed that it showed she was unsuitable to become a Jedi, so he expelled her from the Academy. She blamed Lawsirk and Kirlocca for her dismissal and left the system to plot revenge against the Almas Jedi.\nMuun's hatred for the Jedi turned her to the dark side of the Force, and she became a Dark Jedi. A few years later, during the time of the Clone Wars, she returned to the Cularin system, intent on gaining revenge against the Jedi. She set up a temporary base in an abandoned chemical factory on the moon Tilnes and obtained some battle droids to serve her. After researching the myths of the Tarasin, a sentient species that was native to the planet Cularin, Muun learned of the existence of a dangerous creature known as the t'salak. The t'salak was a seemingly indestructible beast that resembled a black, oozing mound and was capable of inducing a violent rage in people by simply touching them with its tendrils. Over one hundred years earlier, it had attacked the Tarasin, and they had imprisoned it in a cave beneath the surface of Cularin. Muun decided to find the creature, but was unable to discover the exact location of its cave.\nA group of construction workers who were building a bridge for a racecourse inadvertently unearthed the cave. Muun learned of their discovery and, in the middle of the night while the workers were sleeping, arrived at the construction site with a group of her battle droids. She left the droids to secure the site while she entered the cavern, confident that she would find the t'salak. Inside, she encountered a series of obstacles that the Tarasin had placed inside the cave to prevent anyone from freeing the t'salak, including a deep chasm, a large boulder that blocked the path, and a concealed door. After passing all of these obstacles, Muun entered another tunnel, but soon found her way blocked by another obstruction: a wall of roots and vines. She tried to cut them down with her lightsaber, but the roots and vines regenerated every time she sliced through them, because the obstacle had been engineered by the Tarasin to allow only people who had never touched the dark side of the Force to get through. Being a Dark Jedi, Muun was therefore unable to pass the wall.\nFurious, Muun left the t'salak cave and took her anger out on the construction workers, capturing them and taking them back to her base on Tilnes. Determined to obtain the t'salak, she decided to try and persuade the Tarasin into helping her release it. She disguised herself as a male Human Jedi and traveled to the Jaraana irstat, a Tarasin tribe that lived in a village about fifty kilometers from the cave. Upon her arrival, she approached Mother Morad'Ka, the eldest woman in the village, and asked the Tarasin to accompany her to the cave, which Muun claimed would be for the good of the system. Morad'Ka sensed through the Force that something was not right about the request and refused. This angered Muun, and she stormed out of the village, screaming curses at the Tarasin. The next day, she returned to the village and used explosives to set fire to it in an attempt to destroy the settlement. The fire greatly damaged the structures in the village and aided Muun by creating a sense of apprehension among the Tarasin toward the Jedi, whom the Jaraana believed had caused the fire.\nNot put off by her initial failure to obtain the t'salak, Muun pursued a different plan to acquire the creature. The Almas Jedi had sent Nek Lawsirk, who was now a Jedi Knight, to ask Morad'Ka to allow them study the creature. Morad'Ka agreed to Lawsirk's request and said that she would give him the creature when she felt that the time was right. Muun learned of the agreement and planned to capture Lawsirk, then collect the t'salak herself. She disguised herself as a Jedi and, over the course of a few weeks, committed various illegal acts on Cularin, such as charging citizens for protection. As a result, rumors circulated around Cularin, attributing Muun's actions to the Jedi and causing the local inhabitants to perceive the Order as being violent and cruel.\nLawsirk heard the rumors and investigated the cause of them, but, after a week of searching, discovered nothing. Muun sent him a holo-message and, in it, claimed that she could reveal to him information about the rumors if he met her. She asked him to travel to Tilnes and told him the location of the chemical plant where she was based. Although he distrusted her, Lawsirk wanted to take the opportunity to learn more about the rumors, so he traveled to the Tilnes plant to meet with Muun. Muun waited on a catwalk in a darkened room to ambush Lawsirk, who eventually arrived there. Muun's battle droids opened fire on the Zabrak, and he responded by igniting his lightsaber and jumping up onto the catwalk. Muun disarmed him using her own saber and pushed him into an empty chemical vat, where she then imprisoned him.\nWith Lawsirk captured, Muun took his lightsaber and used theatrical makeup to disguise herself as him. She traveled to the city of Hedrett on Cularin and, based out of Lawsirk's apartment there, inflicted several unlawful acts against the local population to further undermine the peaceful reputation of the Jedi. While in the disguise, she demanded money for protection from people, and also staged an attack on The Chasm, a cantina that was located in the nearby city of Gadrin. She placed a holorecorder inside the building's refresher, which she hoped would be found by one of the cantina's patrons, ensuring that the attack was recorded. Muun then entered the cantina and waited for someone to come out of the refresher with the holorecorder. A few minutes later, the Kubaz Forg F'lopo emerged with it and began using it to film his friends. Muun immediately flipped over the table next to her and attacked the cantina's patrons with Lawsirk's lightsaber. She cut off a number of arms and legs and also killed a Bothan. When she had finished, she apologized to the survivors for the mess and dropped a handful of credit chips onto the floor, which she claimed were to cover the cost of the cleaning. F'lopo filmed the whole attack, and the footage was confiscated by the Office of Peace and Security.\nMorad'Ka eventually decided to let the Jedi study the t'salak, so she sent a message to Lawsirk, telling him that he could go and collect it. Muun intercepted the message and, while still disguised as the Zabrak, traveled to the Jaraana irstat to collect the creature. She arrived in the evening and took the creature from Morad'Ka straight away, refusing to share refreshments with the elderly Tarasin. After bringing the creature to the factory on Tilnes, Muun returned to Hedrett and used a mind trick to kidnap three biologists from a lab that was used by Culpharm, a local pharmaceutical company. She took them back to Tilnes with her and forced them to try and find a way to make t'salak reproduce. While the biologists were present, she also repeatedly allowed the t'salak to touch Nek Lawsirk with its tentacles, enraging him.\nEventually, the biologists developed a technique using lasers that allowed them to split the t'salak into two individual creatures. As she believed that the biologists had now served their purpose, Muun tied them up with spacer's tape and told them that she was going to kill them. However, Master Kirlocca had hired a group of freelance agents known as the \"Heroes of Cularin\" to find Lawsirk, and they had tracked the Zabrak to the factory. They entered the plant, and Muun was alerted to their presence. Muun abandoned the biologists and fled the factory with both t'salaks and a set of notes that the biologists had written about how make the creatures divide.\nMuun used the biologists' notes to further split the t'salak so that she had five individual creatures, each as strong as the original. When she learned of a peace conference that was going to be held between the Almas Jedi and the Sentient Beings Opposing Violence, she realized that this was the opportunity she had been waiting for to discredit the Jedi. The conference was to be held aboard the liner Luxury close to Rennokk, a moon of Cularin. Muun plotted to use the t'salaks to enrage the attending Jedi and cause them to attack the delegates and planned to film and broadcast the event to the holonews. To implement her scheme, Muun disguised herself and adopted the alias \"Lernia.\" Using several forged letters of recommendation from notable pilots, Lernia secured a job as the co-pilot of the Luxury for the duration of the conference, and through her new position, she smuggled her t'salaks and battle droids onto the ship. Muun also hired the bounty hunter Coar Maw while disguised as a scarred Ithorian, and employed him to delay the Heroes of Cularin from further interfering with her plans. In an additional attempt to slow down the agents, Muun told Razor Leader, the commander of a Thaereian military starfighter squadron that had been assigned to defend the Luxury, that a ship would attempt to dock with the liner and that the craft's crew would attempt to sabotage the conference. She also claimed that the crew of this ship would have credentials showing that they had been sent by a high-ranking individual on Cularin, which she hoped would persuade the Thaereians to prevent the agents from boarding the liner should the agents learn of her plans and attempt to stop her.\nThe agents eventually defeated Maw and were sent by Jedi Master Lanius Qel-Bertuk, the headmaster of the Almas Academy, to prevent Muun from disrupting the conference on the Luxury. Their ship approached the liner and, in the guise of Lernia, Muun contacted Razor Leader, insisting that the Thaereian squadron destroy the agents' starship. Razor Leader disagreed and planned to let the agents dock with the Luxury, so Muun used a mind trick on the liner's gunner and ordered him to open fire on the Thaereian starfighters and the agents' ship. Realizing that she had run out of time, Muun set her plan to disrupt the conference in motion and started by killing all of the bridge crew on the liner, except for the captain, Veer. She tied Veer up with spacer's tape and attached an explosive device to him, forcing him to fly the Luxury in the direction of Rennokk. Muun also ensured that the ship was inside the moon's gravity well so that even if the Thaereians opened fire on it, the ship would continue its descent towards the moon. She jettisoned all of the liner's escape pods except one and released the t'salak from two canisters that she had placed inside the ship's conference room. The creatures attacked the attendees, sending them into violent, uncontrollable rages. Jedi Master Kirlocca and two Jedi Padawans attempted to fight the creatures, but one of the Padawans became enraged and slew the other one. A Rodian reporter then picked up the lightsaber of the fallen Jedi and went on a rampage, attacking the other delegates with it. With the Rodian and the rogue Padawan attacking the other attendees, it appeared as if the Jedi were deliberately attacking the delegates. Seeing her chance, Muun activated a news feed that broadcast live images of the attack to the holomedia. She also sent a group of battle droids to the ship's engineering section to damage the Luxury's systems and prevent its course from being altered.\nThe Heroes of Cularin eventually landed on the Luxury, and Muun monitored them to keep track of their actions. She tried to slow their movements aboard the liner by initiating an atmospheric evacuation of the landing bay while the agents were disembarking from their ship. The agents stopped the evacuation and made their way into the engineering section, where they defeated the droids that Muun had sent there and repaired some of the damaged systems. They then made their way to the conference room, where they subdued the t'salak, although not before Kirlocca was finally overcome by the creatures and was killed. The agents confronted Muun on the bridge, and she engaged them in combat. Despite her desire to kill them for foiling her plans, she did not fight recklessly and remained fully in control of her actions. However, despite her efforts, the fight began to go against her. She fled and escaped in the last remaining pod, which she flew to a location where a getaway ship was waiting for her.\nMuun eventually returned to her base on Tilnes. While there, she heard reports of Order 66, an order that had been issued by Supreme Chancellor Palpatine to the Grand Army of the Republic's clone troopers telling them to kill all of the Jedi. Believing that the issuing of the order had denied her the chance to gain revenge on the Jedi, Muun decided to confront the people responsible for the deaths of the Jedi. To do this, she traveled to Coruscant, the capital world of the Galactic Empire, the newly formed galactic government that had replaced the Republic. On Coruscant, however, she instead found Valin Draco, a Dark Side Adept who was a member of the Inquisitorius, an order of Jedi hunters serving the Empire. Draco saw great potential in Muun and asked her to join him. She accepted, as she believed that she had finally found someone to love her.\nAfter becoming Draco's apprentice, Muun accompanied Draco on various assignments, relishing the opportunities to hunt Jedi that they provided. When Draco was sent to investigate a Force nexus on Almas in circa 17 BBY, he brought Muun with him, as he believed that her familiarity with the planet would be helpful to the mission. After arriving in the Cularin system, Draco, Muun, and some Imperial support troops flew to Almas in a Theta-class shuttle and landed in the city of Forard. From there, they made their way to the Academy, which lay in ruins as a result of an attack near the end of the Clone Wars. Inside, Draco and Muun encountered the Twi'lek Jedi Master Vhiin Thorla and his Padawan, Dorv'Tilsta, who had both come to the Academy in search of other Jedi survivors of the Empire's Jedi purge. A fierce lightsaber duel ensued, and Muun used a t'salak to induce a murderous rage in Tilsta, causing the boy to attack his master. Thorla was forced to kill Tilsta, but in doing so became so overcome by guilt that he was weakened, allowing Draco and Muun to capture him.\nShortly afterward, Draco discovered the holocron of the Dark Lord of the Sith Darth Rivan in the Academy sublevels and chose to remain there to study it. Muun stayed with him, but while the two were there, a group of Alderaanian Resistance agents came to the Academy ruins in search of the Qornah Holocron, a Jedi holocron that had been kept in the Academy. However, Draco had already located the Qornah Holocron and had taken it with him to the sublevels. The agents made their way there to confront him and approached Draco. Muun flanked her Master and ignited her lightsaber in preparation to defend him. The agents attacked Draco, and Muun took up a defensive position in front of him, while four clone shadow troopers, elite Imperial troops that served Draco, prepared to ambush the Resistance team. Once the agents had moved close enough to them, Muun and the shadow troopers engaged them in melee combat. However, Muun and the troopers were eventually incapacitated by the agents. Draco was defeated, and the agents left the Academy with the Qornah Holocron.\nRaik Muun had red hair and green eyes. She lacked control over her emotions and desires, making her unsuited for Jedi training and quick to anger. Because of this, she was unable to stop herself from becoming obsessed with Nek Lawsirk and did not take it well when he rejected her. Following her fall to the dark side, she became murderous, demented, and very angry when she did not get what she wanted, such as when Morad'Ka prevented her from obtaining the t'salak. When she fought against the Heroes of Cularin aboard the Luxury, she fully committed herself to their defeat and was confident that she would be victorious. She also liked to use deception to achieve her aims.\nAs a Dark Jedi, Muun wore black clothing. After she became the apprentice of Valin Draco, she wore a darker-colored version of the standard Inquisitor attire. She wielded a crimson-bladed lightsaber, which she had constructed herself.\nWhile at the Almas Academy, Muun demonstrated a great talent for using the Force. However, after she left the Academy, she fell to the dark side, from which she was irredeemable. She knew how to use the Force to influence the minds of others, sense impending danger, move objects, and enhance her dark-side powers.\nRaik Muun was created by Matthew Domville for the Forces of Cularin trilogy of adventures in the Living Force campaign, a supplement to the Star Wars Roleplaying Game. She later appeared in Echoes of the Jedi, a roleplaying supplement written by Abel G. Peña and Jean-François Boivin and released in 2008. In that year, she also received an indirect mention in The Complete Star Wars Encyclopedia, in the entry for the Jaraana. Muun's species was not identified until her appearance in Force Convention, the last adventure in the Forces of Cularin trilogy, which identified her as a Near-Human. Echoes of the Jedi later added to this by claiming that she was a Human half-breed.\nIn Force Convention, the players, who roleplay as the Heroes of Cularin, can affect Muun's actions. She behaves more aggressively for players of a higher level and can use Force lightning if she is fighting against higher-tier players. It is also possible for the player characters to kill her, although her later appearance in Echoes of the Jedi means that such a death is non-canonical. In Echoes of the Jedi, it is again possible for Muun to be killed when she fights the Alderaanian Resistance agents.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Species/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/Muun_(individual)",
  "/wiki/Human/Legends",
  "/wiki/Hybrid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Valin_Draco",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Jedi_academy",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Cularin_system",
  "/wiki/Nek_Lawsirk",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kirlocca",
  "/wiki/Star_system/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Tilnes",
  "/wiki/T%27salak",
  "/wiki/Cularin/Legends",
  "/wiki/Cloud_Mountain_cavern",
  "/wiki/Morad%27Ka",
  "/wiki/Mother_(title)/Legends",
  "/wiki/Tarasin",
  "/wiki/Jaraana_irstat",
  "/wiki/Scientist/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Sentient_Beings_Opposing_Violence",
  "/wiki/Luxury_liner/Legends",
  "/wiki/Luxury",
  "/wiki/Starship/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Mission_to_Almas",
  "/wiki/Alderaanian_Resistance",
  "/wiki/Reproduction/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Droid/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Kilometer/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/City/Legends",
  "/wiki/Hedrett",
  "/wiki/Apartment_8",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/The_Chasm",
  "/wiki/Cantina/Legends",
  "/wiki/Gadrin",
  "/wiki/Holorecorder/Legends",
  "/wiki/Refresher/Legends",
  "/wiki/Kubaz/Legends",
  "/wiki/Forg_F%27lopo",
  "/wiki/Cho_mok/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Death/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Credit_chip/Legends",
  "/wiki/Office_of_Peace_and_Security",
  "/wiki/Mind_trick/Legends",
  "/wiki/Culpharm",
  "/wiki/Laser/Legends",
  "/wiki/Spacer%27s_tape/Legends",
  "/wiki/Rennokk",
  "/wiki/HoloNet/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Coar_Maw",
  "/wiki/Ithorian/Legends",
  "/wiki/Razor_Leader",
  "/wiki/Commander/Legends",
  "/wiki/Thaereian_military",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Veer",
  "/wiki/Gravity_well/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Dark_Side_Adept",
  "/wiki/Force_nexus",
  "/wiki/17_BBY/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Theta-class_T-2c_shuttle/Legends",
  "/wiki/Forard",
  "/wiki/Destruction_of_the_Almas_Academy",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Vhiin_Thorla",
  "/wiki/Dorv%27Tilsta",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Duel_in_the_Almas_Academy",
  "/wiki/Darth_Rivan%27s_holocron",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Rivan",
  "/wiki/Qornah_Holocron",
  "/wiki/Holocron/Legends",
  "/wiki/Clone_shadow_trooper/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_rage",
  "/wiki/Matthew_Domville",
  "/wiki/Forces_of_Cularin_trilogy",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Roleplaying_game",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Jean-Fran%C3%A7ois_Boivin",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Force_Convention",
  "/wiki/Near-Human",
  "/wiki/Force_lightning/Legends",
  "/wiki/Canon",
  "/wiki/Force_Concession",
  "/wiki/Force_Contention",
  "/wiki/Wizards.com",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/19_BBY/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}