{
 "name": "Rajam Nuss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Milvayne"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Rajam Nuss was a male human cyberneticist who worked on Milvayne. He was the personal cybernetics doctor of Tam Posla. Chelli Aphra and 0-0-0 hired Nuss to remove proximity bombs from themselves, but Nuss instead accidentally set off a failsafe in an attempt to deceive them. Not realizing this, Triple-Zero killed him, believing that he was no longer useful.\nAt some point, Rajam Nuss was taught to be a cyberneticist by Professor Prexo. This led him own his own laboratory on the planet Milvayne. Sometime later, Nuss became the personal cyberneticist of Tam Posla, the Milvayne Authority's most celebrated lawman, until he eventually went rogue to chase the fugitive doctor Cornelius Evazan.\nIn 3 ABY, Nuss was approached by Chelli Aphra and the assassin droid 0-0-0. The pair had proximity bombs implanted into them by Evazan and had discovered Nuss after snooping through the data banks in Posla's ship. Nuss agreed to their offer of a sash of Milvayne credits and got to work. He scanned them and sat them down at his auto-surgeon. While they were sedated, he attempted to remove the proximity bombs.\nHowever, Nuss hit the fail-safes of the bombs and they set to explode in ten hours. Fearful of breaking the bad news, Nuss prompted the pair to leave when they woke up. 0-0-0, though, stayed behind and asked him to track Evazan, who was watching through the droids eyes. Nuss said he could not do that, and 0-0-0 killed him, as he was no use to the droid. Simultaneously, Aphra discovered that Nuss had failed to remove the proximity bombs and walked in on the murder scene when breaking the news to 0-0-0.\nRajam Nuss was a human male with light skin, red hair, and brown eyes. When under the tutelage of Professor Prexo, he would fall asleep during his classes. Although he was a qualified cyberneticist, Nuss was clumsy enough to set off the fail-safes in the proximity bombs that were inside two of his patients. From guilt, he tried to get them away as fast as he could before they realized.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/3_ABY",
  "/wiki/Milvayne",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Doctor",
  "/wiki/Cyberneticist",
  "/wiki/Cybernetics",
  "/wiki/Tam_Posla",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/0-0-0",
  "/wiki/Proximity_bomb",
  "/wiki/Death",
  "/wiki/Professor",
  "/wiki/Prexo",
  "/wiki/Planet",
  "/wiki/Milvayne_Authority",
  "/wiki/Police_officer",
  "/wiki/Cornelius_Evazan",
  "/wiki/Assassin_droid",
  "/wiki/Posla%27s_ship",
  "/wiki/Credit",
  "/wiki/Standard_hour",
  "/wiki/Doctor_Aphra_(2016)_26",
  "/wiki/Doctor_Aphra_(2016)_27",
  "/wiki/Doctor_Aphra_(2016)_30",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Accresker_Jail",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/Standard_year",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth",
  "/wiki/Doctor_Aphra_(2016)_17",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide"
 ]
}