{
 "name": "Rajine",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 22 and 19 BBY",
      "unidentified planet"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Energy vampire"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Rajine was a countess and Jedi who lived during the final centuries of the Galactic Republic. Additionally, she was an energy vampire and was capable of draining an individual's life-force. Eventually, the Jedi Knight Samuro recognized the threat that Rajine posed and imprisoned her in a city on a remote planet. After Samuro died while erecting a Force barrier over the world, rendering Rajine unable to leave the city, she took Samuro's protocol droid, Z-18, for herself.\nOver a span of hundreds of years, Rajine used her ability of draining her victims' life-forces to turn them into mindless zombies under her service. During the Clone Wars, Jedi Master Mace Windu visited Rajine's city in search of the Alpha-2 Squad of clone troopers, which had gone missing there. When Windu entered the city, she began to slowly drain the Jedi's life-force, and imprisoned him. However, Z-18 freed Windu and gave him Samuro's holocron. Windu confronted Rajine and used the holocron to recite an incantation that freed the life-forces of the zombies under the Countess's control. The zombies turned against Rajine, killing her and ending her threat to the Jedi.\nCountess Rajine was a female Jedi who served the Jedi Order during the final centuries of the Galactic Republic. As an energy vampire, she was capable of draining the life-forces of individuals. The Jedi Knight Samuro eventually recognized the threat that Rajine posed and imprisoned the Countess and her victims in a city on a remote world. Samuro died using the Force to raise a barrier that ensured that Rajine and her victims would never be able to leave the city.\nThe deceased Jedi Knight's Force powers kept Rajine and her victims confined in the city over a span of several centuries. During her confinement, Rajine kept Samuro's lightsaber and Jedi holocron, and additionally claimed Samuro's protocol droid, Z-18, for herself. Over the years, Rajine continued to drain the life-forces out of sentients, turning them into mindless zombies to do her bidding.\nHundreds of years later, during the Clone Wars between 22 BBY and 19 BBY,, the Jedi Master Mace Windu arrived at Rajine's planet in search of the Alpha-2 Squad of clone troopers, whose last transmission had come from the city in which Rajine was imprisoned. When Windu was escorted into the city by Z-18, Rajine began to drain his life-force. While investigating the city, Windu found that the clones were dead and was subsequently captured by Rajine's zombies.\nAfter imprisoning him, the Countess confronted Windu and informed him that she had waited centuries for another Jedi to arrive on her world. The Jedi Master found that he was unable to summon his lightsaber to him with the Force, and Rajine informed him that it was because she had been draining his life-force from the instant that he crossed the city's front gate. She revealed that she intended to gather all of Windu's life-force and use it to escape the planet.\nRajine tried to convince Windu to succumb to her life-draining abilities, but the Jedi recognized that she was an energy vampire and insulted her. Rajine remarked that she would live longer than he would and took Windu's lightsaber, leaving and ordering Z-18 to follow her.\nWhen she later discovered that Windu had escaped, Rajine sent her zombies to look for him throughout the city. After finding him, Rajine punched Windu, knocking the Jedi to the ground. She also destroyed Z-18—who had freed the Jedi—using Windu's lightsaber, remarking that she should not have kept the droid after Samuro died. Windu then activated Samuro's holocron, which had been given to him by Z-18. The holocron's image of Samuro spoke to the Countess and revealed that she would be defeated when the image and Windu spoke the \"words of banishment.\" After Samuro's image and Windu recited the incantation, the zombies' wills were restored to them. When she ordered them to kill Windu, Rajine's victims turned against her and killed her.\nThe energy vampire Rajine once served the Jedi Order as a Jedi. However, the Jedi Knight Samuro recognized the threat she posed. After she and her victims were imprisoned on the remote world by Samuro, Rajine was determined to escape. She eagerly awaited the day when another Jedi would come to her world. When she spoke with Mace Windu, she taunted the Jedi Master and his abilities with the Force, referring to the Force powers as \"Jedi magic.\" Rajine treated the droid Z-18 as an irritant and frequently talked down to him. After she discovered that Z-18 had freed Windu, Rajine destroyed the droid. Rajine had purple skin, violet eyes, and white hair.\nBefore being imprisoned on a remote world by Jedi Knight Samuro, Rajine served as a Jedi. As an energy vampire, she was capable of draining the life-forces of individuals. She turned her victims into zombies and managed to retain control of them for several hundred centuries. She also used Mace Windu's lightsaber to destroy the droid Z-18.\nRajine wore a red and purple dress, a red belt, and golden earrings.\nRajine was introduced in the short comic No Way Out, which was one of four stories compiled in the ninth volume of the Clone Wars Adventures trade paperback. The comic was illustrated by brothers Matthew and Shawn Fillbach, who also scripted No Way Out, and published on October 23, 2007.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/22_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Rajine%27s_planet",
  "/wiki/Energy_vampire",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Count/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Samuro",
  "/wiki/Prison/Legends",
  "/wiki/Unidentified_city_(Rajine%27s_planet)",
  "/wiki/Death/Legends",
  "/wiki/Force_barrier/Legends",
  "/wiki/Planet/Legends",
  "/wiki/City/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Z-18",
  "/wiki/Zombie/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Alpha-2_Squad",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Samuro%27s_Jedi_holocron",
  "/wiki/Holocron/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Gold/Legends",
  "/wiki/Piercing/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/No_Way_Out",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_9",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Matthew_Fillbach",
  "/wiki/Shawn_Fillbach",
  "/wiki/Fillbach_Brothers",
  "/wiki/October_23",
  "/wiki/2007",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology"
 ]
}