{
 "name": "Rajivari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "25",
      "783 BBY",
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order",
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Ketu",
      "Cahel Tse",
      "Vadria Tallion",
      "Orth Quane"
     ]
    }
   ]
  }
 ],
 "content": "Rajivari was a male Human Jedi Master who was among the founding members of the Jedi Order and the first of the Jedi High Council.\nA Force-sensitive Male Human, Rajivari was considered one of the wisest Je'daii Masters of the Je'daii Order and one of its top Generals. Recognized for his leadership and wisdom, Rajivari led armies during the Despot War, winning many battles, but after the war he decided to lay down his weapon and live in isolation on one of the islands surrounding the Temple of Akar Kesh in order to meditate on the Force. One of his former apprentices, Ketu, who had become the Temple Master of Akar Kesh sometimes visited him for advice on the important matters of the Je'daii Order.\nThus, in 25,800 BBY, Ketu came to tell his former master about the Dark visions that Daegen Lok had allegedly seen in the depths of the Chasm, warning about the coming of an army led by an individual with one red eye and wielding a sword of fire. Seven years later, Rajivari was visited again by Ketu, who came this time with news about the vision received by three Je'daii Journeyers and the foreseen arrival of the Force Hound Xesh. Rajivari who firsthandly didn't agree with the decision of the master to not consider the vision of Lok, questioned once again the wisdom of Ketu when he learned that the stranger had been exiled on Bogan, stating that \"where there is one warrior, an army may follow.\"\nSome time later, Ketu asked Rajivari to Akar Kesh, to help access the Kwa Holocron, a relic of an extinct ancient and interstellar civilization which had been accessed by Tasha Ryo. However, when Ryo showed the Holocron's guardian A'nang a skull found aboard the alien ship, he cried \"Rakata!\" and vanished.\nNow, Rajivari attempted to access the Holocron before, Ketu, Ryo, and Ters Sendon. A'nang explained that the Rakata were a vicious Dark Species who had seized control of the galaxy and driven the Kwa to extinction.\nPossessing considerable power, Master Rajivari was one of the first of the Jedi High Council, convening on the world of Tython and dictating the Jedi Order's creed. Training the first Jedi Lore Keepers, Rajivari secretly established the first incarnation of the Jedi Archives which he named the Fount of Rajivari. At some point, Master Rajivari fell to the dark side of the Force and attempted to destroy the Order he had a hand in founding. He and his several followers embraced a set of principles which ran counter to the Jedi and were able to hole up within the walls of the ancient Temple of Knowledge, Kaleth. Rajivari was defeated in the siege of his fortress, and memory of the Fount was lost to myth.\nFollowing the Great Galactic War and the resurgence of the Sith Empire, a hologram of Master Rajivari was discovered on Tython when the Order relocated from Coruscant. Known as the Northwest hologram, the Jedi sought to reclaim it for the Tythonian Gnarls but discovered that it had already been stolen from its hiding place. His spirit remained in the ruins of the fount until a young Jedi Padawan entered the place and encountered the spirit of Rajivari. Rajivari explained the history of the Fount and how it was made and that Nalen Raloch was planning to use the fount to destroy the Jedi on Tython. Master Rajivari told the Padawan to stop Raloch and save the Jedi Order. Returning the Jedi Master to the light side, the Padawan convinced him to leave the Fount and move on to become one with the Force.\nRajivari was very charismatic and as a result, he mobilized an entire army of the Order's members to follow his own views. He thought of his fallen apprentices as if his own children, gifted and loyal, initially hoping Nalen Raloch would prove as worthy despite him neglecting the value in solving Rajivari's traps at the Fount of Rajivari. Due to these traps, Nalen became crazy and Rajivari regretted teaching him because, although Rajivari wanted the Order destroyed, he would also want it rebuilt soon after but Nalen was only bent on destroying the Order, permanently.\nAccording to Jedi Master Yuon Par, Rajivari was immeasurably powerful and as a result he was able to move an army of members from the Jedi Order to follow his own principles. Further evidence of his powers was when he proved himself worthy to the droid guardians, when retrieving the hilt of the First Blade. After he was killed, Rajivari was able to become a Force ghost.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/25,783_BBY",
  "/wiki/Tython/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Ketu",
  "/wiki/Cahel_Tse",
  "/wiki/Vadria_Tallion",
  "/wiki/Orth_Quane",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Je%27daii_Master",
  "/wiki/Despot_War",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Akar_Kesh",
  "/wiki/25,800_BBY",
  "/wiki/Daegen_Lok",
  "/wiki/Chasm",
  "/wiki/25,793_BBY",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Force_Hound",
  "/wiki/Tau_(individual)",
  "/wiki/Holocron_of_A%27nang",
  "/wiki/Kwa_holdings",
  "/wiki/Tasha_Ryo",
  "/wiki/A%27nang",
  "/wiki/Devourer_(Rakatan_ship)",
  "/wiki/Ters_Sendon",
  "/wiki/Rakata/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Species/Legends",
  "/wiki/Celestial-Rakata_War",
  "/wiki/Jedi/Legends",
  "/wiki/Lore_Keeper",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Fount_of_Rajivari",
  "/wiki/Rajivari%27s_purges",
  "/wiki/Principles_of_Rajivari",
  "/wiki/Kaleth",
  "/wiki/Siege_of_Kaleth",
  "/wiki/The_Barsen%27thor",
  "/wiki/Padawan/Legends",
  "/wiki/Yuon_Par",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/Northwest_hologram",
  "/wiki/Tythonian_Gnarls",
  "/wiki/Nalen_Raloch",
  "/wiki/Force_ghost",
  "/wiki/First_Blade",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_1",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_4",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_5",
  "/wiki/Dawn_of_the_Jedi:_Force_War_1",
  "/wiki/Dawn_of_the_Jedi:_Force_War_2",
  "/wiki/Dawn_of_the_Jedi:_Force_War_5",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}