{
 "name": "Rakir_Banai",
 "display_name": "Rakir Banai",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Rakir Banai was a male Human smuggler and the father of Kitster Chanchani Banai.\nYears prior to the Invasion of Naboo, Rakir Banai was a smuggler. He had his own ship, and ran controlled medicines to Outer Rim worlds to bypass Corporate Sector surcharges. However, his job was came to an end when he and his family were captured by bounty hunters in a Hutt pirate raid. His wife and his son Kitster were sold into slavery. Rakir did not see his family anymore and, since that time, he became preoccupied with getting revenge against Hutts.\nRakir Banai eventually ended up in the small town of Wayfar on Tatooine, where he worked for a man named Drik Bandrik after the Battle of Yavin.\nIn 1 ABY, Rakir encountered a spacer, and asked him for his help. Rakir learned of a troublemaker in Mos Espa who was trying to undermine Drik's local mining business. Drik told Rakir that the troublemaker was accused of several murders, and was sending a saboteur to blow up his mine. When the spacer asked why the person was causing trouble, Rakir said that troublemaker was complaining of working conditions in the mine. However, Drik also told Rakir that the troublemaker was a mine owner, out to destroy the competition. Rakir asked if the spacer could stop the saboteur, who was actually a Twi'lek named Triggo Binz. The spacer set out to find Triggo, knowing fully well that he would probably not let himself be arrested. Sure enough, as the spacer approached Triggo and his associates, they began attacking. As Triggo began attacking, he shouted that the spacer would die, just like Drik's slaves. However, the spacer succeeded in killing Triggo and his associates. Following the fight, the spacer returned to Rakir to deliver the news. Rakir was surprised that Triggo yelled Drik was a slaver. Rakir did not believe that to be true, but said he needed to take the time to look into it.\nHe ordered the spacer to meet with a Bothan spy named Silm'an Voueen. Rakir believed that the Bothan would know the truth about Drik. Rakir did not approve of slavery, so the truth was very important to him. The spacer agreed to help, and sought out Silm'an, who had a datadisk concerning Drik's slave operation. The bothan also added additional information to the datadisk, which suggested that Kitster Banai, the son of Rakir, was in fact the troublemaker working against Drik. When the spacer delivered the data to Rakir, he could not believe that Kitster was the troublemaker. Rakir needed more information, so he sent the spacer on another mission. Rakir learned that a spy named Deela Quellor had obtained records from a Mos Eisley repository owned by Jabba the Hutt. Jabba in fact stole the records long ago, from a rival Hutt crime lord, named Gardulla. With the records in the hands of Deela, the Hutts were now attempting to find the spy. Rakir asked the spacer to find his spy, and escort the individual back to him safely. The spacer agreed, and set out to find Deela. Fortunately for Rakir, the spacer succeeded in finding Deela, who in fact had the important records. When the spy, and in the information were brought back to Rakir, he reached a stark conclusion. He now understood that Drik was using him all along to attack his very own son.\nFollowing this realization, Rakir made the decision to find Kitster. He sent messengers to various cities across Tatooine, using the information that the spacer brought him before. Rakir was sure that the search would not take long, for there were not many cities on the planet to begin with. Unfortunately, Rakir himself could not look for his son, for he was still under Drik's contract. Rakir gave the spacer one final task, which involved finding Drik's majordomo, named Wizzel, and obtaining the contract by force. With the contract obtained, Rakir would then have the freedom to look for Kitster. The spacer agreed to help with the final task, and so he sought out to find Wizzel. Though Wizzel was being guarded by two associates, the spacer managed to kill them all, and obtain the contract. When the spacer returned, Rakir thanked the spacer greatly for his assistance. For the spacer's service, Rakir awarded him with some additional credits, and a shellfish harvester. He was sure the harvester would serve no purpose on Tatooine, and felt that the spacer would have a better use for it. Rakir was certain he would find his son in due time, with the help of his messengers.\nRakir Banai was a non-player character in the video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. In the game, players could do a series of quests for him, which awarded several credits, along with a shellfish harvester tool.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Episode_I_Adventures_(Scholastic)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Kitster_Chanchani_Banai",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Wayfar",
  "/wiki/Tatooine/Legends",
  "/wiki/Drik_Bandrik",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Triggo_Binz",
  "/wiki/Bothan/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Silm%27an_Voueen",
  "/wiki/Datacard/Legends",
  "/wiki/Deela_Quellor",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Gardulla_Besadii_the_Elder/Legends",
  "/wiki/Majordomo/Legends",
  "/wiki/Wizzel",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Shellfish/Legends",
  "/wiki/Harvester",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Episode_I_Adventures_5:_The_Ghostling_Children",
  "/wiki/Episode_I_Adventures_8:_Trouble_on_Tatooine",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_123",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Chronicles:_The_Prequels",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}