{
 "name": "Rako Hardeen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Concord Dawn"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.89 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Rako Hardeen, also known as the \"Marksman of Concord Dawn,\" was a human male bounty hunter and marksman from the Mandalorian planet Concord Dawn. In 20 BBY, he was hired to assassinate Jedi Master Obi-Wan Kenobi, and seemingly succeeded in the Coruscant Underworld. Unbeknownst to Hardeen, he had in fact been hired by the Jedi Order, who faked Kenobi's death as part of a plan to send him undercover disguised as his own killer to investigate a plot against Supreme Chancellor Palpatine. After the supposed assassination, Hardeen was celebrating at Trueping's cantina when he was contacted by his mysterious employers, and was subsequently taken captive by Kenobi and Mace Windu. Kenobi, disguised as Hardeen via a facial transformation program and a vocal emulator, subsequently infiltrated a Separatist plot to abduct the Chancellor at the Festival of Light on Naboo.\nRako Hardeen was a human male from the Mandalorian planet Concord Dawn who, by the year 20 BBY, was working as a bounty hunter. He had acquired enough of a reputation as a marksman that he was occasionally known by the epithet \"Marksman of Concord Dawn.\" Hardeen found himself a pawn in a complex plot to foil a kidnapping attempt on Supreme Chancellor Sheev Palpatine organized by Moralo Eval and Count Dooku. He was hired by an anonymous client, who were truly members of the Jedi Council, to murder Jedi Master Obi-Wan Kenobi by shooting at him from the top of a building on Coruscant, while Kenobi was attempting to return to the Jedi Temple with Anakin Skywalker and Ahsoka Tano. After shooting Kenobi in the chest as he had agreed, Hardeen was pursued by Skywalker. The bounty hunter managed to escape using smoke bombs and a speeder bike.\nWhile celebrating his high-profile kill at Trueping's cantina, he was summoned into the back room to meet his employer and receive payment. There, he was met by Jedi Masters Mace Windu and Obi-Wan Kenobi–his supposed victim, now physically altered to look like him. Hardeen was apprehended by the two Jedi, and his identity assumed by Kenobi in order to plant himself in a Republic prison. Hardeen's reputation for having killed a Jedi was essential to the plan, as Kenobi used it to gain the trust of other prisoners and attract the attention of Moralo Eval, from whom Kenobi was to acquire intel that would help the Jedi prevent the kidnapping attempt.\nInspector Tan Divo was building a case on Hardeen. When the Jedi arrested the marksman, Divo was denied access. He was never able to discover what had happened to him after the plot to kill the Chancellor was foiled. Kenobi later wore the Mandalorian armor he had purchased on Nal Hutta while impersonating Hardeen to infiltrate the Mandalorian capital of Sundari on a mission to rescue Duchess Satine Kryze.\nRako Hardeen was a human male with light skin, and a height and build similar to that of the Jedi Master Obi-Wan Kenobi, who impersonated him. He had prominent stubble and a large, dark red tattoo on his face. As a bounty hunter, he was willing to take jobs that involved killing Jedi, and celebrated after he believed he had successfully killed one. However, he was not happy when the Jedi arrested him after discovering he had not actually killed Kenobi, although his would-be victim pointed out he had certainly intended to kill a Jedi. Hardeen was also weak-minded enough that Windu was able to easily use the Force to put him to sleep.\nHardeen preferred to use a sniper rifle for his kills, and had some skill with the weapon. He was a skilled enough shot to be known by the epithet \"Marksman of Concord Dawn.\"\nHardeen owned a sniper rifle and a speeder bike, which he used to escape the scene of Kenobi's \"death\" in conjunction with smoke bombs. He also owned a helmet with a visor and an open face. Hardeen's clothing and equipment was taken by Obi-Wan Kenobi when the Jedi Master impersonated Hardeen, and was subsequently confiscated when \"Hardeen\" was arrested by Anakin Skywalker and Ahsoka Tano and sent to the Republic Judiciary Central Detention Center.\nRako Hardeen first appeared in the episode \"Deception\" of the Star Wars: The Clone Wars television series, which aired on January 20, 2012. The character was voiced by James Arnold Taylor, who also voiced Obi-Wan Kenobi in the series.\nDuring production, series executive producer and Star Wars creator George Lucas wanted Hardeen to be played by a different actor in order to have the character's voice be distinct from Kenobi's. However, executive producer Cary Silver and series director Dave Filoni cast Taylor as the voice of Hardeen as they knew the actor was capable of pulling off the unique voice that was required. Lucas was unaware of the casting decision until Silver and Filoni revealed it after playing a voice clip of Hardeen for him to check if he liked the actor chosen for the role.\nOriginally, the episode \"The Box\" would have included a storyline in which Anakin Skywalker would have searched for the real Hardeen once he discovered that Kenobi was alive. Though the Council would have denied Hardeen's existence, Skywalker would have intercepted Captain Rex transferring Hardeen off-world, forcing the Council to divulge the truth. The thread was cut for time constraints, clarity and character focus, and it seeming unlikely that Rex would keep a secret like that from Anakin.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rako_Hardeen",
  "/wiki/Rako_Hardeen/Legends",
  "/wiki/Bane%27s_Story",
  "/wiki/Kenobi%27s_Shadow",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Concord_Dawn",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Mandalorian",
  "/wiki/Planet",
  "/wiki/20_BBY",
  "/wiki/Assassin",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Coruscant_Underworld",
  "/wiki/Jedi_Order",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Trueping%27s",
  "/wiki/Cantina",
  "/wiki/Mace_Windu",
  "/wiki/Facial_transformation_program",
  "/wiki/Vocal_emulator",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Skirmish_in_Theed",
  "/wiki/Festival_of_Light_(847th)",
  "/wiki/Naboo",
  "/wiki/Standard_year",
  "/wiki/Moralo_Eval",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Jedi_High_Council",
  "/wiki/Coruscant",
  "/wiki/Imperial_Palace",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ahsoka_Tano",
  "/wiki/Smoke_bomb",
  "/wiki/Speeder_bike",
  "/wiki/Jedi",
  "/wiki/Republic_Judiciary_Central_Detention_Center",
  "/wiki/Prisoner",
  "/wiki/Inspector",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Mandalorian_armor",
  "/wiki/Nal_Hutta",
  "/wiki/Mandalore",
  "/wiki/Capital",
  "/wiki/Sundari",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Tattoo",
  "/wiki/The_Force",
  "/wiki/Sleep",
  "/wiki/Sniper_rifle",
  "/wiki/Helmet",
  "/wiki/Deception",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/January_20",
  "/wiki/2012",
  "/wiki/James_Arnold_Taylor",
  "/wiki/Star_Wars",
  "/wiki/George_Lucas",
  "/wiki/Cary_Silver",
  "/wiki/Dave_Filoni",
  "/wiki/The_Box",
  "/wiki/Rex",
  "/wiki/Friends_and_Enemies",
  "/wiki/Crisis_on_Naboo",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/The_Lawless",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Prisoners",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide"
 ]
}