{
 "name": "Ral Shawgrim",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zalso"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.56 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Sandy-colored"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rebel Alliance",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ral Shawgrim was a turn-coat Rebel technician, who was wanted by the New Republic for treason, espionage, and theft of Alliance and New Republic material. The New Republic had issued a bounty of 35,000 credits on his head, and he was also hunted by the Imperial Remnant.\nShawgrim was born aboard the starship, the Panorama, near the Tion Hegemony. His family was eventually slaughtered by Imperial troops. In response to this tragedy, he contacted a Rebel recruiter on Zelso and joined the cause of the Rebellion where his parents used to work.\nShawgrim proved to be an adept starship technician and quickly rose to the rank of lieutenant. He served for two years on Zelso, and was hospitalized twice during the Jendar Campaign at Jendar. He was awarded the Usor Cluster for his valor, and was officially a hero of the Rebellion.\nShortly after the conclusion of the Jendar Campaign, he was transferred to the Mon Calamari Shipyards at Mon Calamari, where he served as a starfighter repair coordinator.\nWhile working at the Calamari Shipyards, Shawgrim managed to duplicate the plans on the Incom T-65B X-wing starfighter. With near-complete plans of the starfighter in his possession, he attempted to leave Mon Calamari and make contact with the Imperially aligned Sienar Fleet Systems on Lianna and hand them the plans, which would have been a disaster for the Rebellion.\nFortunately for the Rebels, an astromech droid with the designation R2-X9 alarmed security, when it noticed Shawgrim blasting out of Docking Facility 7K in an unauthorized space shuttle. A group of Rebel operatives, led by Essex Yerac, managed to retrieve the plans, although Shawgrim escaped.\nThe Alliance, and later the New Republic, issued a bounty on his head. Due to his failure to deliver the plans, Moff Brinkan of the Empire, and later the Imperial Remnant, also issued a bounty on him. He was hunted by no less the three bounty hunters for nearly four years.\nTo conceal his true identity, Shawgrim typically wore civilian clothing, though his old Rebel tech suit remained in his possession, and he would also sport hats to conceal his hair color.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zalso",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Imperial_Remnant",
  "/wiki/Starship/Legends",
  "/wiki/Panorama",
  "/wiki/Tion_Hegemony/Legends",
  "/wiki/Zelso",
  "/wiki/Lieutenant/Legends",
  "/wiki/Jendar_Campaign",
  "/wiki/Jendar",
  "/wiki/Usor_Cluster",
  "/wiki/Mon_Calamari_Shipyards/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Incom_Corporation/Legends",
  "/wiki/T-65B_X-wing_starfighter/Legends",
  "/wiki/Sienar_Fleet_Systems/Legends",
  "/wiki/Lianna/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/R2-X9",
  "/wiki/Docking_Facility_7K",
  "/wiki/Essex_Yerac",
  "/wiki/Moff/Legends",
  "/wiki/Brinkan",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_4"
 ]
}