{
 "name": "Rala_De",
 "display_name": "Rala De",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaminoan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black with white irises"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Rala De, also known under the false identity of \"Yodel Proof\", was a male Kaminoan researcher, assisting in the creation of clones for the Galactic Republic, who once posed as the Quermian Jedi Master Yarael Poof, which he had done after escaping to the planet Coruscant from the planet Kamino. Following a trip to Coruscant's Jedi Temple, he secretly swapped places with Poof, attempting to shirk his responsibilities. However, Poof contacted a bounty hunter, who apprehended De and returned him to Kamino.\nResiding in Tipoca City on the extragalactic planet Kamino, Rala De was a male Kaminoan researcher who assisted in the creation of new clones for the Galactic Republic. Over time, he gained a reputation among his fellow Kaminoans as a slacker. At some point after the beginning of the Clone Wars, De wished to escape from what he perceived as a mundane life on Kamino, and took a \"trip\" to the Republic capital planet Coruscant, where he visited the Jedi Temple. Electing to remain on Coruscant, De took up a false identity impersonating the Quermian Jedi Master Yarael Poof, with the pseudonym \"Yodel Proof.\" As a result, Poof himself ended up in Tipoca City on Kamino, and the Kaminoans believed him to be De. When the displaced Jedi Master protested that he was not De, the Kaminoans disregarded him, thinking that he was merely acting peculiar, and believed himself to be \"too good for lab work.\" One Kaminoan referred to him as \"Rala Delusions of Grandeur.\"\nMeanwhile, De begain to impersonate the Jedi Master under the pseudonym Yodel Proof, teaching younglings that, while the Force was useful, it was not as useful as a \"correct and efficient data management system.\" The impostor also told them that the key to using the Force was in how much they squinted and wobbled their hands around, but also in being still and alert. He also instructed them to draw out the names of those they spoke to when they became Force spirits, as the individuals would otherwise not hear.\nTrapped on Kamino, Poof then resorted to hiring a bounty hunter to track down De and bring him back to Kamino. After interrogating some of the Kaminoans in Tipoca City, the bounty hunter set out for the Jedi Temple on Coruscant.\nThey then spoke to a Coruscanti human, who stated that, while she had not seen any Kaminoans, she had seen Master Poof teaching a class of younglings at the Jedi Temple. At the temple, a youngling informed the bounty hunter about the alleged Poof's nonsensical teachings.\nWhile \"Proof\" was teaching the younglings, the bounty hunter approached, startling him. Asking if they had come to seek his council, he mentioned his pseudonym. It was at that point that a youngling pointed out that \"Yodel Proof\" was not, in fact, a real name, while another youngling exclaimed that he was not a real Jedi Master, and likely did not even have a \"lightsaber ship.\" Panicking, De attempted to escape, refusing to return to Kamino. Though he tried to bargain with the bounty hunter, offering them free Jedi lessons, he was ultimately apprehended and delivered to Kamino.\nBack in Tipoca City, Poof gleefully departed, choosing to refrain from inquiring about the details of De's capture. De, however, was distraught, lamenting that he used to be a Jedi Master. Coping with his return to life in the laboratory, De attempted to reason to himself that organizing test tubes was just as meaningful as sculpting the minds of youngling learners.\nRala De was a male Kaminoan, who had white skin and black eyes with white irises. Regarded as a slacker among his fellow Kaminoans, De found life on Kamino to be trapping, and wished to be free of his duties as a researcher. While posing as a Jedi, he grew to be passionate about teaching younglings, despite his largely nonsensical lectures. After returning to Kamino, De became upset, reminiscing about his brief time as a \"Jedi\" and attempting to equate the importance of teaching younglings to his work on Kamino.\nWhile impersonating Poof, Rala De wore brown and tan Jedi robes. He also wore a brown belt around his waist.\nRala De appeared in the non-canon 2022 video game LEGO Star Wars: The Skywalker Saga. Though he is voice acted in the game, his voice actor is uncredited.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Rala_De",
  "/wiki/Kamino",
  "/wiki/Kaminoan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Scientist",
  "/wiki/Cloning",
  "/wiki/Quermian",
  "/wiki/Jedi_Master",
  "/wiki/Yarael_Poof",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Imperial_Palace",
  "/wiki/Bounty_hunter",
  "/wiki/Bounty",
  "/wiki/Tipoca_City",
  "/wiki/Extragalactic",
  "/wiki/Clone_Wars",
  "/wiki/Capital",
  "/wiki/Youngling",
  "/wiki/The_Force",
  "/wiki/Hand",
  "/wiki/Force_spirit",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Coruscanti",
  "/wiki/Human",
  "/wiki/Jedi",
  "/wiki/Laboratory",
  "/wiki/Jedi_robes",
  "/wiki/Belt",
  "/wiki/2022",
  "/wiki/Video_game",
  "/wiki/Category:Images_of_Rala_De"
 ]
}