{
 "name": "Raleigh Dawn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Questal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Raleigh Dawn was a young female Human who also operated under the pseudonym Kestrel during the Galactic Civil War. In her past, she had some sort of deeply disturbing encounter with fire. It was evident that she had been on the run for many years, though from what exactly, was unknown.\nKestrel was meant to make a rendezvous with Rebel operative codenamed Tiree. Tiree trusted her with his life, though the nature and history of their relationship was unknown. She was to become a new recruit for the Rebel Alliance.\nHowever, an Imperial bounty on her head complicated things. Bounty hunters Skorr, Furlag, 4-LOM, and Zuckuss failed in an attempt to capture her on Ord Mantell, though they did succeed in flushing her out of her last safe hiding place. Skorr's pursuit of Kestrel seemed to be of a more personal nature rather than just for the money.\nKestrel visited her friend, the slicer Skivvers, to find out who had posted the bounty on Raleigh Dawn, though Skivvers was unable to retrieve the information due to it being a private posting. However Skivvers had something else for Kestrel—a datapad containing a rendezvous point with Tiree. They met in an alley, where Tiree gave her another datapad with a new off-planet rendezvous.\nKestrel found a ship and pilot that would take to the coordinates.\nDawn was based on a character roleplayed by Kathryn, in the \"Rebel Breakout\" scenario of the Star Wars: The Roleplaying Game gamemastered by Pablo Hidalgo. The RPG character was not nicknamed \"Kestrel\", but the alias was changed due to copyright concerns. Dawn's response to Vanis's apology for being unable to greet her, Raal Yorta, Sammie Staable and Smileredon-Verdont was based on dialogue assigned to the \"6th Rebel\" in the Adventure Script included with \"Rebel Breakout.\"\nThe name \"Kestrel Dawn\" was later established as an alias used by Jyn Erso in Rogue One: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Canon",
  "/wiki/Galactic_Republic",
  "/wiki/Technician",
  "/wiki/Raleigh",
  "/wiki/Rookies:_No_Turning_Back",
  "/wiki/Questal/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Tay_Vanis",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Skorr/Legends",
  "/wiki/Furlag",
  "/wiki/4-LOM/Legends",
  "/wiki/Zuckuss/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Skivvers",
  "/wiki/Star_Wars:_The_Roleplaying_Game_(first_edition)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Jyn_Erso",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Rookies:_Rendezvous",
  "/wiki/Rookies:_Day_Long_Remembered",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Blog"
 ]
}