{
 "name": "Rale",
 "display_name": "Rale",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Military",
      "Republic Military"
     ]
    }
   ]
  }
 ],
 "content": "Rale was a male Human lieutenant who served the Galactic Republic.\nAt one point, he was stationed to the sprawling city moon of Nar Shaddaa. In 3643 BBY in a period of time known as the Cold War, Rale and a few fellow officers entered Club Ufora, a cantina located in the Red Light Sector of Nar Shaddaa's underground. However, to their surprise, his group was locked up and sent elsewhere, while Rale was sent to the the club's back room. Locked up in a slave crate, Rale was unaware of what was going on except that only one officer came back, and he was \"different.\"\nAn Evocii by the name of Ilox witnessed the group enter the cantina, and saw them never return. Worried that there was trouble, Ilox investigated and found out what was going on. He contacted a Republic-allied individual and asked him to free Rale and any others who may have been trapped. The individual fought his way through armed men and guards, and Rale was freed. He told the individual that he suspected that the remaining officers could have been taken to the Quarantine Zone. Unwilling to let any ill fortune befall the remaining men, the hero quickly headed to the location.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/3643_BBY",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Club_Ufora",
  "/wiki/Cantina/Legends",
  "/wiki/Red_Light_Sector_(Nar_Shaddaa)",
  "/wiki/Slavery/Legends",
  "/wiki/Evocii",
  "/wiki/Ilox",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}