{
 "name": "Ralia_Reeven",
 "display_name": "Ralia Reeven",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Reeven Clan",
      "Lok Revenants"
     ]
    }
   ]
  }
 ],
 "content": "Ralia Reeven was a female Rodian member of the Lok Revenants who lived on Lok at the time of the Galactic Civil War.\nRalia Reeven was a member of the Reeven Clan, a Rodian clan allied with Nym and his Lok Revenants since before the Clone Wars. After the Battle of Yavin, she was also a member of the Lok Revenants, working as quartermaster for Nym and the Revenants in Nym's Stronghold. During this time, she had to deal with recurrent supply shortage.\nIn 1 ABY, the water treatment facility that supplied the city of Nym's Stronghold in drinkable water got broken and was unable to correctly filtrate sulfur from water. Unfortunately, the water treatment technician Phor Cl-lan missed the parts required to repair the filtration system. A spacer working for Nym and Phor Cl-lan therefore visited Ralia Reeven to request supplies to fix the water filtration facility. The spacer first asked for cationic chemical coagulant to resupply the mixing chamber of the water treatment system. Reeven did not possessed cationic chemical coagulant but she was aware that the smuggler Dak Vox produced such chemical on Mount Chaolt. As Vox owed Nym a favor, the smuggler could not refuse to provide chemicals. Later, the spacer came back, requesting a motor power regulator to repair the flocculation chamber. However, Ralia Reeven got world that a Lok Revenant agent named Rei Reeven had been severely injured. She prompted the spacer to rush medical supplies to her clanmate before it was too late. Rei Reeven was stranded in the middle of the Great Maze of Lok but the spacer successfully found his way and rescued the agent in time. Ralia then provided the motor power regulator to the spacer. Eventually, Phor Cl-lan was able to fix the water treatment facility and provide clean water to the city.\nRalia Reeven was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Ralia Reeven was added to the game as part of the revamped \"Nym's Theme Park,\" released with the \"Game Update 16,\" on March 23, 2010.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Reeven_Clan",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Dak_Vox",
  "/wiki/Lok/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Quartermaster/Legends",
  "/wiki/Nym%27s_Stronghold",
  "/wiki/1_ABY/Legends",
  "/wiki/Water/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Phor_Cl-lan",
  "/wiki/Spacer/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Mount_Chaolt",
  "/wiki/Rei_Reeven",
  "/wiki/Great_Maze_of_Lok",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_23",
  "/wiki/2010",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Starfighter:_Crossbones",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}