{
 "name": "Ralo Surrel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Ralo Surrel was a human male pilot who served in the Alliance to Restore the Republic during the early stages of the Galactic Civil War. A member of Red Squadron, he held the rank of major and often flew as wingmate to Red Leader Garven Dreis. Surrel participated in the battles of Scarif and Yavin, where he met his death.\nPrior to his service with the rebellion against the Galactic Empire, Ralo Surrel performed as a stunt pilot, flying antique craft for the amusement of Outer Rim audiences. By 0 BBY, he had joined the Rebel Alliance as a pilot in Red Squadron, commissioned as a major and stationed at Base One on the fourth moon of Yavin. Along with Theron Nett, Surrel often flew as wingmate to Commander Garven Dreis, who served as Red Leader. At one point, Surrel and Dreis were scheduled to fly Shift Cycle 1 of an X-wing patrol mission from Yavin to the Gordian Trace Relays, where they would perform a flyby of surrounding space, verify all-clear visuals and sensors, and perform close uplink of passive relay recordings.\nSurrel, along with the rest of Red Squadron, participated in the Battle of Scarif. As the Rogue One team attempted to steal the plans for the Death Star superweapon from the Imperial Center of Military Research on the planet, Red Squadron began dogfighting the Imperial TIE fighter garrison. Flying as Red Eleven, he again flew as wing to Red Leader. Surrel survived the engagement, which saw the successful transmission of the plans to a corvette under Princess Leia Organa.\nThe plans were eventually brought to the rebel base on Yavin, where General Jan Dodonna assembled the rebel pilots. The Death Star was rapidly approaching the rebel base, but Dodonna explained that the pilots would seek to exploit a design flaw placed in the battlestation: a thermal exhaust port which would allow proton torpedoes to destroy the station's main reactor. After the briefing, Surrel entered the Red Squadron ready room with Dreis and Zal Dinnes. For the squadron's final flight plan, he was substituted as Dreis' port wingman for Puck Naeco ; instead Surrel was given command of second flight, comprised of wingmates John D. Branon  and Cdt. Harb Binli .\nAs they approached the Death Star, Dreis directed Red Squadron to cut across the battle station's axis and draw Imperial turbolaser fire, as Gold Squadron's Y-wings made their attack run on the meridian trench. Shortly thereafter, Imperial TIEs were scrambled, whittling away Red Squadron; Surrel's wingmate Branon was the first to succumb to the enemy fighters, and Binli soon followed. As Lt. Nozzo Naytaan  was shot down, Surrel was left alone amidst a swarm of TIEs. Though back in the Massassi control room, grounded pilot Col Takbright urged command to pull Surrel out, to no avail. Red Eleven died sacrificing himself, buying time for Luke Skywalker  to complete his final run on the exhaust port.\nWith the help of the Force, Skywalker's proton torpedoes found their mark, and the station was destroyed, allowing the rebellion to survive. In 1 ABY, Skywalker and fellow rebels Han Solo, Wedge Antilles, Zev Senesca, Derek Klivian, and Chewbacca raised a toast at Mess Hall IV in the Mako-Ta Space Docks to honor the deceased members of Red Squadron, including Surrel.\nAudiences in the Outer Rim considered Ralo Surrel a dashing stunt pilot, flying rickety antiques for their amusement.\nAs a Rebel Alliance X-wing starfighter pilot, Ralo Surrel wore an orange flight suit, with a white flak vest, a gray flight harness, a Diagnostech life support unit, dark gray gloves and black boots. His K-22995 light flight helmet was white, with a red and gray checkered pattern above the visor, a red and gray stripe along the central ridge, and a black symbol on each side.\nRalo Surrel is played by actor Russell Balogh in the Anthology Series film Rogue One: A Star Wars Story. Prior to the release of the film on December 16, 2016, the character was first shown in the initial teaser trailer for the film, released on April 7 of that year.\nThe 2017 short story \"Duty Roster,\" written by Jason Fry as part of From a Certain Point of View—a collection of short stories by various authors—established that Surrel was the pilot who flew as Red Eleven in the Battle of Yavin, thus retconning him into the 1977 original trilogy film, Star Wars: Episode IV A New Hope, and its junior novelization. Surrel takes the spot that, in the Star Wars Legends continuity, was held by Wenton Chan. In canon, Chan was established by \"Duty Roster\" as being grounded during the battle; however, in the story he does mention Surrel's performance during the battle.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/0_BBY",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Rebel_pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Red_Squadron",
  "/wiki/Military_rank",
  "/wiki/Major",
  "/wiki/Wingmate",
  "/wiki/Red_Leader",
  "/wiki/Garven_Dreis",
  "/wiki/Battle_of_Scarif",
  "/wiki/Battle_of_Yavin",
  "/wiki/Galactic_Empire",
  "/wiki/Pilot",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Yavin_Prime",
  "/wiki/Theron_Nett",
  "/wiki/Commander",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Gordian_Reach",
  "/wiki/Rogue_One",
  "/wiki/Death_Star_plans",
  "/wiki/Death_Star",
  "/wiki/Superweapon",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Planet",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Garrison",
  "/wiki/Red_Eleven",
  "/wiki/Tantive_IV",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Battlestation",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Proton_torpedo",
  "/wiki/Reactor",
  "/wiki/Zal_Dinnes",
  "/wiki/Puck_Naeco",
  "/wiki/Red_Twelve",
  "/wiki/Second_flight",
  "/wiki/John_D._Branon",
  "/wiki/Red_Four",
  "/wiki/Cadet",
  "/wiki/Harb_Binli",
  "/wiki/Red_Seven",
  "/wiki/Turbolaser",
  "/wiki/Gold_Squadron",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Meridian_trench",
  "/wiki/Lieutenant",
  "/wiki/Nozzo_Naytaan",
  "/wiki/Red_Nine",
  "/wiki/Col_Takbright",
  "/wiki/Luke_Skywalker",
  "/wiki/Red_Five",
  "/wiki/The_Force",
  "/wiki/1_ABY",
  "/wiki/Han_Solo",
  "/wiki/Wedge_Antilles",
  "/wiki/Zev_Senesca",
  "/wiki/Derek_Klivian",
  "/wiki/Chewbacca",
  "/wiki/Mess_Hall_IV",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Flight_suit",
  "/wiki/Flak_vest",
  "/wiki/Flight_harness",
  "/wiki/Diagnostech_life_support_unit",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Russell_Balogh",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/December_16",
  "/wiki/2016",
  "/wiki/April_7",
  "/wiki/2017",
  "/wiki/Duty_Roster",
  "/wiki/Jason_Fry",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Retcon",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars_Legends",
  "/wiki/Wenton_Chan/Legends",
  "/wiki/Wenton_Chan",
  "/wiki/Category:Images_of_Ralo_Surrel",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Standard_year",
  "/wiki/Star_Wars_(2015)_43",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/File:Instagram-Russell-Balogh.png",
  "/wiki/StarWars.com",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}