{
 "name": "Ralon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Ralon was a male Human salvager on Dantooine.\nHe attempted to sell a fake Holocron to Meetra Surik for 1000 credits. The Exile inspected the holocron and found that it was a fake, to which Ralon said it had been made by someone and had several other owners before himself and apologized profusely. He also told Surik that he was one of the later salvagers and if he didn't make enough credits, his family would be sold to the Hutts. Surik then asked how much money he needed which was 500 credits. She gave him the credits and Ralon, in return gave her the fake holocron.\nWhether or not Ralon was telling the truth about his family is unknown as with enough awareness skill the Exile can doubt he even has a wife.\nThere is an alternative path of discussion that makes Ralon admit that the holocron was fake and the player can still give him 500 credits to leave Dantooine.\nAlternatively the player could buy the holocron only to realize it's fake, but Ralon will say that the sale is final.\nAlternatively the player can decline to help refuse to help.\nAlternatively the player will force Ralon to give the fake holocron for nothing, this is a dark side option\nThe player can offer Ralon a chance to join the Khoonda Militia but he declines.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Hutt/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Khoonda_Militia",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}