{
 "name": "Ralrracheen",
 "display_name": "Ralrracheen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Empire",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ralrracheen, also called Ralrra, was a male Wookiee who served as an ambassador for Kashyyyk after dealing with the Galactic Republic.\nRalrracheen had a speech impediment which made him easier to understand when speaking to non-Wookiees, a useful trait when dealing with others in his diplomatic work. Later, he became a slave to the Empire, and was used by his Imperial masters to communicate with other Wookiees. At first, he tried to resist Imperial occupation forces, but forced himself to comply after they executed a dozen women and children from his family unit. His proximity to Imperial officers provided him with information vital to the Alliance's effort to free Kashyyyk. Like most Wookiees, after the Alliance freed Kashyyyk, he felt he owed a life debt to the Alliance. At some point in his life he moved to the capital of Kashyyyk, Rwookrrorro.\nWhen Chewbacca brought Princess Leia Organa Solo to Kashyyyk to keep her safe from Grand Admiral Thrawn's Noghri Death Commandos, Ralrra was one of two Wookiees assigned to protect her. He stayed with her at the home of Salporin, which the Noghri later attacked. The Noghri set fire to the surrounding homes providing a distraction, and slipped into Salporin's home. in the following battle, Salporin was killed and Ralrra was injured by one of the stun weapons they were using. He then traveled under the city with Chewbacca, and Leia, so that they could escape to their ship, the borrowed Lady Luck. After the mission to protect her he attended the funeral of Salporin.\nYears later, Ralrra was present at Chewbacca's funeral, caused by the attack on Sernpidal by the Yuuzhan Vong early on in the war. Ralrracheen led the mourning ceremony. During the funeral, Ralrra spoke of the many great accomplishments of Chewbacca, and the many adventures he participated in.\nRalrracheen proved to have a strong will, and only allowed the Imperials to use him as slave after they killed several female Wookiees. He was also known for his ability to work with the members of other species, as shown in his job as a senator for the Galactic Republic.\nRalrracheen was known to fight with the traditional Ryyk blade.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Rwook",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Life_debt/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Salporin/Legends",
  "/wiki/Lady_Luck/Legends",
  "/wiki/Funeral_of_Chewbacca",
  "/wiki/Sernpidal/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Ryyk_blade/Legends",
  "/wiki/Rebel_Dawn",
  "/wiki/Star_Wars_Adventures:_Chewbacca_and_the_Slavers_of_the_Shadowlands",
  "/wiki/Heir_to_the_Empire",
  "/wiki/Tyrant%27s_Test",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Heir_to_the_Empire_Sourcebook",
  "/wiki/The_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_9",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Senator/Legends",
  "/wiki/Mytaranor_sector/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Yarua/Legends"
 ]
}