{
 "name": "Ramakak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Talz"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zendiat Collective"
     ]
    }
   ]
  }
 ],
 "content": "Ramakak was a Talz male. After being freed from Zygerrian slavers by the treasure hunter Zool Zendiat, Ramakak pledged his loyalty to him and joined the Zendiat Collective. While searching for a J9 worker drone that supposedly held a treasure map in its head, Ramakak and the Collective kidnapped the junk boss Unkar Plutt from Niima Outpost on the planet Jakku. Zendiat then interrogated Plutt onboard his starship, the Fortune, as Ramakak watched.\nAfter the Collective moved Plutt outside, the scavenger Rey attacked them in order to free the junk boss. She successfully knocked down Ramakak but was shocked by Zendiat. After revealing that she possessed the J9 unit's head, Rey threw it in the air and freed Plutt, only for her to be grabbed by Ramakak. Plutt then used corn-clusters to attract ripper-raptors that attacked Ramakak and his colleagues, and after Rey threw them the droid's head, which was damaged and did not, in fact, contain the map, she and Plutt escaped. The Collective then left Jakku.\nRamakak was a Talz male who was rescued from Zygerrian slavers by the treasure hunter Zool Zendiat. Pledging his loyalty to his savior, Ramakak joined the Zendiat Collective and became the group's muscle. At some point between 28 ABY and 34 ABY, the group traveled to the planet Jakku in search of a J9 worker drone that they believed had a treasure map stored in its head. After learning that the junk boss Unkar Plutt had come into possession of the droid, Ramakak and the others attacked Plutt's base of operations at Niima Outpost.\nAs the Collective fired on the outpost with blasters, Ramakak grabbed Plutt and dragged him away. The Collective took their captive back to Zendiatt's starship, the Fortune, and Zendiat interrogated him as to the droid's whereabouts while Ramakak and the others watched. After revealing only that the droid had been lacking its head when he received it, Plutt was taken outside and tied down in the badlands to be fed to ripper-raptors if he did not reveal who had the head.\nUnbeknownst to Ramakak and his companions, the scavenger Rey, who had sold Plutt the J9 unit, had learned of the Collective's kidnapping of Plutt from the scavenger Roodown and Constable Zuvio and had set out to rescue him. After laying comlinks out around the Fortune, she broadcast an imitation of a bloggin squawk through them and attacked the Collective while they were distracted. After the scavenger used her quarterstaff to knock down Ramakak's companions Kanna and Tryki, the Talz opened fire on her with his blaster pistol but missed and was similarly struck to the ground. Rey then began freeing Plutt before being shocked by Zendiat.\nRamakak and the others recovered and stood by Zendiat as Rey revealed that she was in possession of the J9 unit's head and attempted to bargain with it for her and Plutt's freedom. Instead, the Collective prepared to gun her down, prompting her to hurl the head into the air. As the Collective tried to catch the head, Rey freed Plutt, who pushed her back directly into the claws of Ramakak. As the Talz gripped Rey, Plutt caught the droid's head and then dispersed three packets of corn-clusters that the scavenger had dropped in order to attract the ripper-raptors circling above.\nAs the birds attacked Ramakak and his companions, Rey and Plutt fled. Having previously checked the J9 unit's memory and discovered that it was damaged beyond repair and wiped clean, Rey took the droid's head from Plutt and launched it back toward the Collective so that they would not pursue the pair. Satisfied with what he did not know to be a worthless head, Zendiat gave the order for the Collective to board the Fortune and leave Jakku, and they swiftly departed.\nRamakak was a strong and silent individual. He was loyal to Zool Zendiat and followed his orders to attack others on Jakku. A hulking Talz, Ramakak had black eyes, light gray fur, and dark gray skin.\nRamakak wore a brown cloak, a brown belt, a gray and brown bandolier, and a gray and brown armband on his right arm. He used a blaster pistol in combat.\nRamakak first appeared in the comic story \"Better the Devil You Know, Part I,\" which was published in the first issue of the Star Wars Adventures series on September 6, 2017. The story was written by Cavan Scott and illustrated by Derek Charm but did not name the character. Ramakak was first identified in Star Wars Adventures, Volume 1: Heroes of the Galaxy, a trade paperback that collected the first two issues of Star Wars Adventures along with additional information about select characters and was published on October 31, 2017.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Talz",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Zendiat_Collective",
  "/wiki/Zygerrian",
  "/wiki/Slaver",
  "/wiki/Treasure_hunting",
  "/wiki/Zool_Zendiat",
  "/wiki/Unidentified_J9_worker_drone",
  "/wiki/Map",
  "/wiki/Databank",
  "/wiki/Kidnapping_of_Unkar_Plutt",
  "/wiki/Junk_boss",
  "/wiki/Unkar_Plutt",
  "/wiki/Niima_Outpost",
  "/wiki/Planet",
  "/wiki/Jakku",
  "/wiki/Torture",
  "/wiki/Starship",
  "/wiki/Fortune",
  "/wiki/Scavenger",
  "/wiki/Rey_Skywalker",
  "/wiki/J9_worker_drone",
  "/wiki/Corn-cluster",
  "/wiki/Ripper-raptor",
  "/wiki/Droid",
  "/wiki/Slavery",
  "/wiki/28_ABY",
  "/wiki/34_ABY",
  "/wiki/Blaster",
  "/wiki/Desert",
  "/wiki/Roodown",
  "/wiki/Constable",
  "/wiki/Zuvio",
  "/wiki/Comlink",
  "/wiki/Bloggin",
  "/wiki/Rey%27s_quarterstaff",
  "/wiki/Kanna",
  "/wiki/Tryki",
  "/wiki/Blaster_pistol",
  "/wiki/Atmosphere",
  "/wiki/Claw",
  "/wiki/Bird",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Cloak",
  "/wiki/Belt",
  "/wiki/Bandolier",
  "/wiki/Limb",
  "/wiki/Pistol",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Better_the_Devil_You_Know,_Part_I",
  "/wiki/Star_Wars_Adventures_1",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/September_6",
  "/wiki/2017",
  "/wiki/Cavan_Scott",
  "/wiki/Derek_Charm",
  "/wiki/Star_Wars_Adventures,_Volume_1:_Heroes_of_the_Galaxy",
  "/wiki/October_31",
  "/wiki/Star_Wars_Adventures_(2017)_1",
  "/wiki/Better_the_Devil_You_Know,_Part_II",
  "/wiki/Star_Wars_Adventures_(2017)_2",
  "/wiki/Category:Images_of_Ramakak",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Kylo_Ren",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/June_14",
  "/wiki/January_10",
  "/wiki/2019"
 ]
}