{
 "name": "Ramy",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow",
      "green and brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Garnac's hunting guild"
     ]
    }
   ]
  }
 ],
 "content": "Ramy was a Trandoshan big game hunter who was a member of a Trandoshan hunting lodge led by the hunter Garnac. During the year 20 BBY, new prey sentient prey was brought to the lodge's hunting reserve on the moon of Wasskah. One of the prisoners, Jedi Padawan Ahsoka Tano, proved to be more resilient than expected, and eventually rallied other survivors of the lodge's hunting outings in a rebellion against the Trandoshan hunters. This led to the lodge's freighter being forced to the ground by Tano's group; the crash was subsequently investigated by Ramy and the other hunters.\nLater yet, Ramy fought back back against an attack against the lodge's floating fortress, during which he was briefly knocked unconscious. Despite this, the hunters managed to momentarily hold back the attackers, until Wookiee reinforcements arrived to aid Tano's group of survivors. Ramy subsequently found himself being thrown overboard by the Wookiee's general. Ramy survived the fall, however, and later ended up on the planet Nal Hutta.\nRamy was a male Trandoshan big game hunter who was a member of a hunting guild made up exclusively of other Trandoshan hunters. Led by the hunter Garnac, the hunting lodge utilized an island on Wasskah, a Mid Rim moon that orbited the planet Trandosha, as a game reserve while operating out of a Ubrikkian Floating Fortress that hovered above the canopy of Wasskah's jungles. Although the lodge hunted various kinds of creatures, the guild also kidnapped sentient beings from across the galaxy that served as additional prey.\nDuring the year 20 BBY, an intergalactic hunt for potential prisoners brought the Jedi Padawan Ahsoka Tano to Wasskah. Although she was not the first Jedi to be brought to the guild's game reserve—the lodge has previously captured several Jedi younglings, as they were considered valuable targets—Tano quickly proved to be more resilient than previous prisoners.\nThe day after Tano's arrival, Ramy was present in Garnac's fortress when the guild leader gave his blessing for the next hunt. Ramy and the other Trandoshan acquired weapons before proceeding to Wasskah's surface on Pteropter hover pods, with Ramy boarding a pod piloted by Gilas. After a day of hunting, Ramy returned to the fortress for the initiation ceremony of Garnac's son, Dar.\nTano survived the attempts on her life in the hunts that occurred—including a confrontation with Dar that led to his death—which led to her rallying other survivors into fighting back against the Trandoshans. Along with the previously captured younglings O-Mer and Jinx, Tano managed to crash the guild's prey-capturing freighter on the hunting island's beach, killing two Trandoshan pilots.\nThe next day, Ramy and the other hunters investigated the crash. While the bodies of the crew were pulled from the wreckage, Ramy circled the crash-site in a hover pod before later returning to the fortress. The following day, the pilot Krix flew off in a hover pod in order to rendezvous with Smug, who had gone off on his own the previous night to hunt near the freighter wreck. However, according to the hunter Lagon, Krix's trip was apparently taking longer than expected.\nConcerned, Lagon voiced his thoughts on the matter to Ramy, but before he could respond Krix's speeder returned, albeit without Krix or Smug. Instead it had been hijacked by Tano's group of survivors, which now included the Wookiee Chewbacca. Lagon was grabbed and thrown overboard while Ramy hollered for backup.\nRamy was quickly joined by hunters Gilas and Ratter, and together they attempted to stave off the attack. During the skirmish, Ramy ran for a nearby hover pod. Upon reaching it, though, Tano and Jinx used the Force to throw Ramy and the hover pod across the floating fortress' deck. Ramy was momentarily knocked unconscious.\nWhen the Trandoshan came to, the stolen hover pod had been shot down by Garnac, which abruptly halted the Jedi offensive. Ramy grabbed a dropped blaster pistol and held it on the defeated survivors. Before Garnac could give the order to finish them off, Wookiee reinforcements arrived, having been contacted by Chewbacca earlier.\nLed by General Tarfful, the Wookiee's quickly turned the tide of battle. Tarfful himself took hold of Ramy and threw him from the fortress, sending him to the ground below. The remaining Trandoshans were killed off in short order, thus ending the existence of the hunting lodge as an organized establishment.\nAs it happened, Ramy survived the fall. Alongside Krix and Smug who had survived the hijacking of their hover pod, Ramy eventually relocated to the planet Nal Hutta, where he blended in with the populace of the Bilbousa Bazaar. While patronizing a local saloon, Ramy confronted a member of the Bith species. The meeting turned physical when the Trandoshan lifted the Bith by their neck and violently throttled them.\nLike all of the Trandoshan guild members, Ramy was excited by the prospect of hunting prey on Wasskah. As Ramy rode down to Wasskah's surface in a hover pod, he merrily cheered and hooted while firing his blaster into the air. During Dar's initiation into the hunting lodge, Ramy was among the hunters chanting the young lizard's name and hooted in celebration as Dar was inducted. When Tano's survivors attacked the lodge, Ramy was quick to call for backup with a guttural howl.\nRamy had yellow scales with brown mottling around his face and on his arms. His eyes were also yellow in color.\nRamy utilized a variety of blaster types during his time on Wasskah, including a blaster pistol, a sniper rifle, and a blaster rifle. He used the weapons during various combat scenarios, including hunting and defending the fortress. During the initial phase of the fortress attack, Ramy was taken by surprise and left weaponless, wherein he tried to command a hover pod. During the later stages of the skirmish Ramy acquired Gilas' dropped blaster pistol and used it against the Wookiees. However, he was thrown off of the fortress before he could hit any targets.\nThe clothes and equipment Ramy kept on his person during the Wasskah skirmish, and later while on Nal Hutta, included a gray shirt covered by a brown vest, dark pants, a belt with a holster, a bandolier wrapped around his torso, and an electronically powered gauntlet worn over his left wrist.\nRamy was one of the twelve Trandoshan characters created for \"Padawan Lost\" and \"Wookiee Hunt,\" the twenty-first and -second episodes of Season Three in the animated series Star Wars: The Clone Wars, both of which aired on April 1, 2011. Ramy would later appear in a cameo role in the Season Four episode \"Friends and Enemies,\" which aired on January 27, 2012.\nRamy was designed by concept artist Pat Presley and was named after Bantha Tracks contributor Mary Franklin, a major fan of Trandoshans and the Trandoshan character Bossk. Ramy's name is simply a rearranging of the letters in Franklin's first name. Ramy is one of the two Trandoshans in the episodes, the second being Gilas, to have no unique lines of dialogue outside of a group chant. As such, rather than being identified in one of the episodes, Ramy was instead identified by name in the \"Padawan Lost\" episode guide.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ramy",
  "/wiki/Ramy/Legends",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Garnac%27s_hunting_guild",
  "/wiki/Big_game_hunter",
  "/wiki/Garnac",
  "/wiki/Standard_year",
  "/wiki/20_BBY",
  "/wiki/Sentience",
  "/wiki/Hunting",
  "/wiki/Moon",
  "/wiki/Wasskah",
  "/wiki/Prisoner",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Freighter",
  "/wiki/Skirmish_on_Wasskah",
  "/wiki/Ubrikkian_floating_fortress",
  "/wiki/Wookiee",
  "/wiki/General",
  "/wiki/Planet",
  "/wiki/Nal_Hutta",
  "/wiki/Island_Four",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Trandosha",
  "/wiki/Ubrikkian_Floating_Fortress",
  "/wiki/Jungle",
  "/wiki/The_galaxy",
  "/wiki/Jedi_Initiate",
  "/wiki/File:Lagon-Krix_and_Smug.ogg",
  "/wiki/Standard_day",
  "/wiki/Fortress",
  "/wiki/MSP80_Pteropter_hover_pod",
  "/wiki/Gilas",
  "/wiki/Dar",
  "/wiki/Death",
  "/wiki/Youngling",
  "/wiki/O-Mer",
  "/wiki/Jinx",
  "/wiki/Beach",
  "/wiki/Clutch",
  "/wiki/Goron",
  "/wiki/Pilot",
  "/wiki/Krix",
  "/wiki/Smug",
  "/wiki/Lagon",
  "/wiki/Speeder",
  "/wiki/Chewbacca",
  "/wiki/Ratter",
  "/wiki/The_Force",
  "/wiki/Blaster_pistol",
  "/wiki/Tarfful",
  "/wiki/Bilbousa_Bazaar",
  "/wiki/Cantina",
  "/wiki/Bith",
  "/wiki/Species",
  "/wiki/File:Dar_Dar_Dar.ogg",
  "/wiki/Blaster",
  "/wiki/Lizard",
  "/wiki/Eye",
  "/wiki/Pistol",
  "/wiki/Sniper_rifle",
  "/wiki/Blaster_rifle",
  "/wiki/Clothes",
  "/wiki/Belt",
  "/wiki/Holster",
  "/wiki/Bandolier",
  "/wiki/Gauntlet",
  "/wiki/Limb",
  "/wiki/Dave_Filoni",
  "/wiki/Padawan_Lost",
  "/wiki/Wookiee_Hunt",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/April_1",
  "/wiki/2011",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Friends_and_Enemies",
  "/wiki/January_27",
  "/wiki/2012",
  "/wiki/Pat_Presley",
  "/wiki/Bantha_Tracks_(newsletter)",
  "/wiki/Mary_Franklin",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Category:Images_of_Ramy",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Brothers",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide"
 ]
}