{
 "name": "Ran Machado",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Borg Construct Aj^6"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lok Revenants"
     ]
    }
   ]
  }
 ],
 "content": "Ran Machado was a Human male who worked for the Lok Revenants, a group of pirates led by a Feeorin named Nym. Sometime after the Battle of Yavin, during the Galactic Civil War, Nym put Machado in charge of eliminating various kinds of unwanted plants that had grown in and around Nym's Stronghold and the city that surrounded it on the planet Lok. While he supervised the eradication of the weeds, Machado attempted to enlist the help of individuals by enticing them with promises of credits and notoriety. During his time in charge of the weed pulling in Nym's Stronghold, Machado wore armor on his body and a Borg Construct Aj^6 cybernetic implant attached to the back of his head.\nRan Machado was a Human male who, during at least part of the Galactic Civil War, served as a member of the Lok Revenants, a pirate group led by a Feeorin pirate known as Nym. For at least part of his tenure with the group, after the Battle of Yavin, Machado was at Nym's Stronghold on the planet Lok, where Nym assigned him the duty of leading an effort to pull up a large number of unwanted plants that had grown up in the stronghold and the surrounding city. Machado stayed at the entrance of the fortress and tried to entice people who walked by with credits and notoriety if they helped him.\nEventually, a spacer agreed to take care of some of the weeds. Machado gave the spacer a quota of different types of weeds to pull, including paddle cacti, yellow pod weeds, some low growing weeds, tall weeds, and flowering cacti. He instructed the spacer to complete the quota and then take the waste to a dumpster located in Nym's Stronghold. When the spacer completed the task and returned to Machado, the pirate paid out 2000 credits for the work along with a small bonus for pulling up extra weeds. However, the task was still not complete after the spacer's quota was complete, so Machado continued to ask for more help.\nAs of his weed-pulling assignment, Machado was completely bald with brown eyebrows. His eyes were also brown in color, and he had fair skin. During his work for Nym, Machado celebrated by clapping, raising his arms into the air, and shaking them.\nAs one of Nym's pirates, Machado had a dark-gray Borg Construct Aj^6 cybernetic implant attached to the back of his head, a device that covered his ears. The implant had dark-red and light-blue markings on it, as well as small red lights. He also wore a suit of armor that covered all of his body except for his head. The parts of the armor that covered his upper torso, the upper arms, and the tops of his boots were light-gray in color. However, the parts that covered his lower torso, waist, hands, thighs, some of his lower legs, and the toes of his footwear were a slightly darker shade of gray. He also wore a dark-gray pauldron on his left shoulder and a belt. His lower arms and most of his lower legs were covered with darker and lighter armor.\nMachado had access to equipment that allowed him to communicate with the spacer who pulled weeds for him.\nRan Machado first appeared in Star Wars Galaxies, a 2003 MMORPG online video game produced by LucasArts and Sony Online Entertainment that was shut down on December 15, 2011. Ran Machado was added to the game as part of the revamped \"Nym's Theme Park\", released with the \"Game Update 16\", on March 23, 2010.\nRan Machado could be approached by the player to activate a quest that required the player to pull a certain number of various kinds of weeds for completion. Completion of the quest gave the player experience, credits, and a random weed, which was a part of a collection that gave the player a badge when completed. Talking to Ran Machado was the player's choice, so it is not guaranteed that anyone helped him with his weed pulling or even spoke to him at all.\nDuring the quest \"Out of My Mine,\" the Lok Revenant Grenz Zittoun incorectly stated that Ran Machado was the Grand Foreman of the Imperial Mine. It was in fact Rel Rogock.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Borg_Construct_Aj%5E6",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Pirate/Legends",
  "/wiki/Feeorin/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Plant/Legends",
  "/wiki/Nym%27s_Stronghold",
  "/wiki/City/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Time/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Canon",
  "/wiki/Spacer/Legends",
  "/wiki/Paddle_cactus",
  "/wiki/Yellow_pod_weed",
  "/wiki/Low_growing_weed",
  "/wiki/Tall_weed",
  "/wiki/Flowering_cactus",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/LucasArts",
  "/wiki/Sony",
  "/wiki/December",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_23",
  "/wiki/2010",
  "/wiki/Grenz_Zittoun",
  "/wiki/Imperial_Mine_(Lok)",
  "/wiki/Rel_Rogock",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Lobot/Legends",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back"
 ]
}