{
 "name": "Ran-Siij",
 "display_name": "Ran-Siij",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Ran-Siij was a Cerean male who worked as a bounty hunter during the waning years of the Galactic Republic.\nRan-Siij was a member of a group of bounty hunters that were led by the Chagrian Koll Jovas. During the time of the Clone Wars, the bounty hunters were hired by a member of the Metatheran Cartel to find whoever was responsible for some attacks on Cartel shipping in the Cularin system; upon finding those responsible, the bounty hunters were to stop them. When the bounty hunters arrived in the Cularin system in their transport, it was shot down by a CloakShape fighter under the command of the pirate group Rock Rogues—the same group responsible for the attacks. The bounty hunters' transport crash-landed on the planet of Cularin; Ran-Siij and the other bounty hunters climbed out of the wreckage, determined to find the pirates.\nShortly after, the bounty hunters encountered the Heroes of Cularin—a group of freelance agents who were also investigating the Rock Rogues. Jovas, Ran-Siij and the Human Sina Voosha approached the heroes and Jovas introduced himself, while the other bounty hunters hid nearby.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Chagrian/Legends",
  "/wiki/Koll_Jovas",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Metatheran_Cartel",
  "/wiki/Cularin_system",
  "/wiki/Transport/Legends",
  "/wiki/CloakShape_fighter/Legends",
  "/wiki/Rock_Rogues",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Human/Legends",
  "/wiki/Sina_Voosha",
  "/wiki/Holes"
 ]
}