{
 "name": "Rana_Halion",
 "display_name": "Rana Halion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ieria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ierian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light blue"
     ]
    }
   ]
  }
 ],
 "content": "Rana Halion was a female Ierian who served as the ruler of the Ieria during the waning years of the Galactic Republic.\nA proponent of more equitably distributed trade routes, Halion attempted to gain representation for her world, located in the greater Andaran system. Fighting for a seat in the Galactic Senate, she argued that the planet Andara lessened Ieria's importance, and by giving her world a separate seat, her people could flourish.\nSecretly, Halion hired a squad of rebellious mercenary students who'd found refuge within Andara's elite Leadership School to help rally people to her cause. The son of her opponent, Senator Berm Tarturi of Andara—Gillam Tarturi—was leading the rebel group, however. When Gillam faked his own kidnapping as part of Halion's plot to assassinate the senator, the scheme went terribly awry. Only with the assistance of the Jedi High Council, who sent two undercover \"transfer students\" to the school  to investigate Gillam's disappearance was the criminal attempt thwarted. The presence of the Jedi Knights and their Padawans, as they successfully infiltrated Halion's network of plotters, at last brought resolution to the Andaran conflict.\nHalion was a tall, lanky humanoid with short white hair twisted into spikes. She possessed a commanding presence and had intense, penetrating clear blue eyes . She wore gold cuffs that encircled her strong wrists.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ieria",
  "/wiki/Ierian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hyperlane",
  "/wiki/Andaran_system",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Andara/Legends",
  "/wiki/Leadership_School",
  "/wiki/Senator/Legends",
  "/wiki/Berm_Tarturi",
  "/wiki/Gillam_Tarturi",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mission_to_Andara",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Rana_Halion",
  "/wiki/Jedi_Quest:_The_School_of_Fear",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}