{
 "name": "Rance Lussk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3645 BBY",
      "Odacer-Faustin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Rance Lussk was a Sith Acolyte who studied at the Sith academy on Odacer-Faustin.\nLussk became the top student at the academy and spent most of his time in private training sessions with the Sith Blademaster Shak'Weth, or the other academy Masters. Lussk dueled various students during his time at the academy and three of his opponents left the academy after losing to him, while another subsequently killed himself. In 3645 BBY, Lussk challenged fellow student Wim Nickter to a duel, and Nickter accepted. They fought and Lussk used the Force to control Nickter's actions, then disarmed his opponent, but spared Nickter's life.\nLussk was later challenged to a lightsaber duel on the academy grounds by fellow student Mnah Ra'at. During their short duel, Lussk and Ra'at witnessed Nickter and another Sith student Jura Ostrogoth crash out of the top window of Darth Scabrous' tower and fall to their apparent deaths. When Nickter stood up and started crazily running at them, Lussk pushed Ra'at down to the ground for Nickter to have and fled.\nLater that night, Lussk was in the dining hall, locked in by the Sith Masters who had locked down the academy down in an attempt to handle the crisis of students rising from the dead. He was present when a handful of undead students entered the cafeteria and began attacking and turning the living students. Lussk was able to use his more developed abilities to hold the infected students off, but could sense the power the Sickness gave the undead students and wanted it for himself. As a result, Lussk slit his wrists and intentionally allowed the undead students to infect him.\nAt first, Lussk was impressed with the power and strength the Sickness gave him, but he soon discovered that the infection had a will of its own and wanted to utterly control him. Though Lussk wanted to resist, he was no match for the Sickness' power and soon joined his fellow students as an undead husk.\nThe now undead Lussk later managed to get aboard bounty hunter Tulkh's ship the Mirocaw. After it had taken off with Tulkh, Jedi Hestizo Trace, and mechanic Pergus Frode aboard, Lussk revealed himself in Tulkh's trophy room, attacking the still uninfected Trace. Trace was able to avoid Lussk's attack, however, throwing him into the also infected Tulkh and opening the Mirocaw's airlock, ejecting Lussk, Tulkh, and the contents of the trophy room into space.\nLussk had an agile, muscular build, and green eyes. He had red-colored hair, which he grew long and kept in a braid.\nDue to Lussk's great Sith potential, very few other students at the academy were prepared to face him in a duel. He was proficient in the use of the second and fourth forms of lightsaber combat.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3645_BBY",
  "/wiki/Odacer-Faustin",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Acolyte",
  "/wiki/Sith_academy",
  "/wiki/Sith_Blademaster",
  "/wiki/Shak%27Weth",
  "/wiki/Sith_Master/Legends",
  "/wiki/Death/Legends",
  "/wiki/Wim_Nickter",
  "/wiki/The_Force/Legends",
  "/wiki/Mnah_Ra%27at",
  "/wiki/Jura_Ostrogoth",
  "/wiki/Darth_Scabrous",
  "/wiki/Imperial_bioweapons_Project_I71A",
  "/wiki/Tulkh",
  "/wiki/Mirocaw",
  "/wiki/Jedi/Legends",
  "/wiki/Hestizo_Trace",
  "/wiki/Pergus_Frode",
  "/wiki/Sith/Legends",
  "/wiki/Form_II/Legends",
  "/wiki/Form_IV/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Red_Harvest_(novel)",
  "/wiki/Red_Harvest_(audiobook)"
 ]
}