{
 "name": "Rand_Ko",
 "display_name": "Rand Ko",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Knights"
     ]
    }
   ]
  }
 ],
 "content": "Rand Ko was a Human male who served Emperor Roan Fel's Empire-in-exile as an Imperial Knight Master. In 138 ABY, he led a group of Fel's stormtroopers in defense of the planet Borosk, which was under siege by forces of Darth Krayt's Galactic Empire. When Krayt's soldiers overwhelmed his battle lines, Ko contacted his Emperor and asked for instructions. He was ordered to retreat but was attacked by a Sith before he could relay the order to his troops.\nThe Human male Rand Ko served as an Imperial Knight in Emperor Roan Fel's Empire-in-exile and had been granted the title of Master by 138 ABY. The Empire-in-exile was at war with the Sith Lord Darth Krayt's Empire, and in that year, Krayt began a renewed military push against his enemies. When Sith–Imperial forces attacked the Fel-held world of Borosk, Ko commanded stormtroopers loyal to Fel in defense of the planet.\nKo and his forces were overwhelmed by the enemy soldiers, who broke through their battle lines and prompted the Knight to contact his Emperor and ask for instructions. He placed a holocomm call to Fel's fortress world of Bastion and reported to the Emperor that the battle was lost. When he asked if his forces should fight to the death, Fel shouted at Ko to retreat and to take his troops to safety. Ko was approached by one of Krayt's Sith while the order was being issued, and he raised his lightsaber in defense as the Sith attacked. At that point, his HoloNet connection with Fel cut out.\nRand Ko was a member of the Imperial Knights, an order of Force-sensitives dedicated to protecting Emperor Fel and preserving his Empire. The Imperial Knights were considered to be among the most talented and dangerous Force-users in the galaxy. Ko held the rank of Master, which was a title reserved for the organization's highest-ranking members. In 138 ABY, Ko was in charge of the Empire's ground forces on Borosk but was unable to lead them to victory against an overwhelming attack by Darth Krayt's Imperials.\nRand Ko was created by John Ostrander and Jan Duursema for the comic miniseries Star Wars: Legacy—War and appears in two panels of its second issue, released in January 2011. Duursema's inspiration for the character came from Randy Ko, a costumer and member of the 501st Legion fan organization whom she met at the Star Wars Celebration V event in 2010. Randy was wearing custom-made Imperial Knight armor and posed for Duursema; he later stated that he was honored she remembered him and included him in the issue. When he thanked her for giving the character what appeared to be a glorious death in combat, Duursema indicated that the question of Ko's death had intentionally been left up in the air.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Empire-in-exile",
  "/wiki/Imperial_Knight",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/138_ABY",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Battle_of_Borosk_(138_ABY)",
  "/wiki/Planet/Legends",
  "/wiki/Borosk/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Darth_Krayt",
  "/wiki/Soldier/Legends",
  "/wiki/Unidentified_Sith_(Borosk)",
  "/wiki/Trooper/Legends",
  "/wiki/Holoprojector/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/One_Sith",
  "/wiki/Holocomm/Legends",
  "/wiki/Fortress_world",
  "/wiki/Bastion/Legends",
  "/wiki/Death/Legends",
  "/wiki/Imperial_Knight_lightsaber",
  "/wiki/Sith/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Darth/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy%E2%80%94War",
  "/wiki/Legacy%E2%80%94War_2",
  "/wiki/January",
  "/wiki/2011",
  "/wiki/501st_Legion_(fan_organization)",
  "/wiki/Star_Wars",
  "/wiki/Celebration_V",
  "/wiki/2010",
  "/wiki/Imperial_Knight_armor",
  "/wiki/Category:Images_of_Rand_Ko",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/February_9"
 ]
}