{
 "name": "Randle_Clanse",
 "display_name": "Randle Clanse",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Brosi"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Before c. 25 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Brosin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Brosin Underground"
     ]
    }
   ]
  }
 ],
 "content": "Randle Clanse was a female Brosin and a local hero on Brosi due to her role as founder and leader of the Brosin Underground.\nRandle Clanse was a natural born Brosin, born between 25 BBY and 29 BBY.She was born in the rural areas north of the Shoengen Shores, in a small village near the Talbot Ridges. However, there are no official records of her birth.\nWhen the Corporate Sector Authority decided to build three Zinsian processing plants on Brosi, displacing thousands of Brosins and \"hiring\" many young Brosins for dangerous mining work, Clanse decided to create the Brosin Underground: A paramilitary force using guerrilla tactics to harass the CSA facilities and troops on Brosi, attempting to force them off the planet.\nThe Underground began operating soon after the opening of the first plant, achieving instant popular support by the oppressed Brosins, due to Clanse's personal charisma and her decision to share with the people the profits stolen from the CSA.\nAn athletic young woman with a shoulder-length mane, Clanse decided to personally lead the smallest of the four teams in the Underground: Thirty warriors who would travel through the Shoengen Coast riding staplarints—her team, nevertheless, soon became the most infamous. The other three teams would be mobile, with the largest one led by Clanse's trusted lieutenant Vuraj Marn.\nClanse had shown the ability to inspire courage in others, using enthusiasm to change defeats into victories. However, even with her respect and propaganda, she was personally humble and credited her men with their successes. She used typical rough clothing, including a blast vest from an Espo troop. Abil Vilorin, a Rebel agent from a cell on Brosi, praised Clanse's action and considered her a possible ally, her methods, however, forbade that possibility.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Brosi",
  "/wiki/25_BBY/Legends",
  "/wiki/Brosin",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Brosin_Underground",
  "/wiki/Abil_Vilorin",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/Shoengen_Shores",
  "/wiki/Talbot_Ridges",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Zinsian",
  "/wiki/Security_Police",
  "/wiki/Shoengen_Coast",
  "/wiki/Staplarint",
  "/wiki/Vuraj_Marn",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}