{
 "name": "Raney",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zygerrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Raney was a Zygerrian male who was the leader of a group of Zygerrian slavers who operated on the planet Ord Mantell shortly after the formation of the Galactic Empire. Under the Empire, he hoped to return to Kadavo and rebuild the Zygerrians' slave operation that the former Galactic Republic had ended. Raney's group of slavers, residing in the ruins of Old Ord Mantell City, had captured several slaves, as well as Muchi, an adolescent rancor that belonged to Jabba the Hutt. The Hutt placed a bounty on the rescue of Muchi, and the former clone troopers of Clone Force 99 were hired to rescue Muchi by the informant Cid. Though the slavers initially captured the troopers, the young clone Omega freed Muchi, allowing her comrades to escape. During the ensuing skirmish, the clone Hunter briefly fought Raney, incapacitating the Zygerrian.\nRaney appeared in \"Rampage,\" the fifth episode of the series Star Wars: The Bad Batch, released on Disney+ on May 28, 2021. He was portrayed by Liam O'Brien and identified in the credits. Prior to the show's release, he was first pictured in a trailer for The Bad Batch on December 11, 2020.\nConcept art was created for Raney by Jim Moore, dated to August 6, 2019 and entitled \"zygerrianRaneyAvA.\" Raney's appearance in the final version of the episode differs from the concept art, which depicts the Zygerrian as having a more rounded face, with taller ears and longer fur on his cheeks and chin. The art also pictures Raney with lighter brown and gray fur and lacks his blinded eye and scar.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zygerrian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Echo",
  "/wiki/Slaver",
  "/wiki/Planet",
  "/wiki/Ord_Mantell",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Kadavo",
  "/wiki/Zygerrian_Slave_Empire",
  "/wiki/Galactic_Republic",
  "/wiki/Battle_of_Kadavo",
  "/wiki/Old_Ord_Mantell_City",
  "/wiki/Slavery",
  "/wiki/Muchi",
  "/wiki/Rancor",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Bounty",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Force_99",
  "/wiki/Information_broker",
  "/wiki/Cid",
  "/wiki/Trooper",
  "/wiki/Cloning",
  "/wiki/Omega",
  "/wiki/Hunter",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Raney",
  "/wiki/Rampage_(episode)",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Disney%2B",
  "/wiki/May_28",
  "/wiki/2021",
  "/wiki/Liam_O%27Brien",
  "/wiki/December_11",
  "/wiki/2020",
  "/wiki/Jim_Moore",
  "/wiki/August_6",
  "/wiki/2019",
  "/wiki/Category:Images_of_Raney",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)"
 ]
}