{
 "name": "Rane_Kovach",
 "display_name": "Rane Kovach",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Circular head implant"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Strategic Information Service",
      "Republic Strategic Information Service",
      "Sith EmpireSith Intelligence",
      "Sith Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Rane Kovach was a male Human who worked undercover for the Republic Strategic Information Service during the Galactic War. Secretly an asset of Supreme Chancellor Leontyne Saresh, Kovach worked for Theron Shan of the SIS, and infiltrated Sith Intelligence on Shan's orders. Kovach soon became the right-hand man of Sith Intelligence Minister Lana Beniko, and worked with both Beniko and Shan to combat the former Sith Emperor Vitiate's machinations on the planet Ziost. During the resulting Invasion of Ziost, Kovach played a pivotal role in the attempts to free the citizens of New Adasta from Vitiate's control, and his allegiance to Saresh came to light.\nRane Kovach first appeared in the video game Star Wars: The Old Republic in Game Update 3.2: Rise of the Emperor, released on April 28, 2015. Kovach's fate and revealing of allegiance differs depending on the player's faction and actions. Republic players are informed during their first story mission of his allegiance, while Imperial players find out during his holocom call with Chancellor Saresh. At the security station in New Adasta, Kovach will be called by Theron Shan if the player is Republic or Lana Beniko if the player is Imperial. Kovach can be made to reveal his allegiance himself for light side points, killed for dark side points, or the player can choose to say nothing and force Kovach to leave the planet for no alignment points. If a Republic-aligned forces Kovach to reveal that he was a double agent to Theron , he will be relieved of duty from the SIS. If he's forced to reveal his loyalties to Lana, she will either have you execute him or, if you choose, she'll personally Force Choke him to death.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Intelligence",
  "/wiki/Galactic_War",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Leontyne_Saresh",
  "/wiki/Theron_Shan",
  "/wiki/Sith_Intelligence_Minister",
  "/wiki/Lana_Beniko",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Emperor/Legends",
  "/wiki/Tenebrae",
  "/wiki/Planet/Legends",
  "/wiki/Ziost/Legends",
  "/wiki/Invasion_of_Ziost",
  "/wiki/New_Adasta",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/April_28",
  "/wiki/2015"
 ]
}