{
 "name": "Rani Quanic",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.4 meters"
     ]
    }
   ]
  }
 ],
 "content": "Rani Quanic was a Sullustan smuggler. After the Battle of Endor, Quanic, along with Ostan Atur and Talak, stole 100 kilograms of meleenium from the Qua'Tahc mines on the planet Af'El.\nQuanic started her career in shipping along the Ison Corridor. Initially an honest captain, she quickly learned she could earn more credits by smuggling spice and other valuable commodities. After several run-ins with Imperial customs frigates, she moved to the Minos Cluster and worked with Chordak. She returned to the Ison Corridor but was captured and imprisoned. The smuggler was given a pardon by the Moff of the Sullust system and Sin Suub. The stipulation of the pardon required her to work for SoroSuub and the Empire, doing anything she could to disrupt the Rebel smuggling operations.\nAfter the Battle of Endor, her focus changed to stealing starship construction material for SoroSuub. She teamed up with a colleague from the Minos Cluster, Talak, who introduced her to Ostan Atur. Together, the group decided to steal a shipment of meleenium from the Ka'Dedus system. During the heist, the group was confronted by a team of New Republic operatives including Kichilir. Quanic's group was able to flee on her ship, Lathien Leth, but this theft led Airen Cracken to issue an arrest warrant for her.\nQuanic cared little about Galactic politics and was only interested in earning credits. She had little regard for law and would do whatever she could to make enough money to retire in luxury. She was quiet and reserved, with a cynical outlook on life.\nQuanic wore a Y-Wing flight suit and piloted a Nella 342 light freighter called Lathien Leth.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Smuggler/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Ostan_Atur",
  "/wiki/Talak",
  "/wiki/Kilogram/Legends",
  "/wiki/Meleenium/Legends",
  "/wiki/Qua%27Tahc",
  "/wiki/Mining/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Af%27El",
  "/wiki/Ison_Corridor",
  "/wiki/Imperial_Customs_Frigate",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Chordak",
  "/wiki/Moff/Legends",
  "/wiki/Sullust_system/Legends",
  "/wiki/Siin_Suub",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ka%27Dedus_system",
  "/wiki/New_Republic/Legends",
  "/wiki/Kichiir",
  "/wiki/Lathien_Leth",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_10"
 ]
}