{
 "name": "Ranna Gorjaye",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Salliche"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Salliche Student Militia",
      "Raithal Academy",
      "Alliance to Restore the Republic",
      "New RepublicFarStar",
      "FarStar"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Ranna \"Wing-Ripper\" Gorjaye was a New Republic pilot and served as the starfighter squadron commander on the FarStar.\nBorn on Salliche, Gorjaye enrolled in the Salliche Student Militia where she learned how to fly a Z-95 Headhunter. She won a scholarship to the Raithal Academy flight corps program and graduated at the top of her class. Her past after graduation was unclear. Rumors stated that she was an elite TIE fighter pilot, others that she defected to the Rebel Alliance after graduation.\nSometime during either her time with the Salliche Student Militia or at the Raithal Academy, Gorjaye and a fellow pilot named Calson collided during training and crashed into a jungle. Calson refused to follow Gorjaye since she was a woman, and set off on his own. Gorjaye survived, but Calson was killed by a corvaj.\nGorjaye fought several battles on behalf of the Rebel Alliance and the New Republic, ultimately earning a position as squadron commander. She was part of the task force that liberated Kal'Shebbol in 8 ABY. Following the Battle of Kal'Shebbol, she was transferred to the FarStar as squadron commander. She rankled at the assignment, not wanting to take orders from \"hot-shot commandos\" on a \"losers' mission.\"\nAbrasive and pushy, Gorjaye was a respected member of the FarStar's command team. She knew how to get things done without wasting pilots or fighters, and was noted for having a fiery temper.\nA no-nonsense commander, Gorjaye insisted on discipline within her squadron. She insisted that her pilots paid close attention in briefings, hung on her every word, and obeyed her orders without question. If anyone dared to question her, or disagree with her, they sat out the next mission. Despite this, she had supreme trust in her pilots and their abilities.\nGorjaye was considered the scourge of the docking bay on the FarStar, forever barking orders at technicians and chewing people out. The docking bay was her domain, and her word was law within its confines. Anyone daring to correct her or usurp her authority was ruthlessly put down. To her, having all craft in \"ready\" status was the optimum state of operation.\nShe had little trust in the FarStar's command team, and believed that she would do a better job in charge. Gorjaye was known to visit the bridge to dole out tactical advice, and was often told to leave by the command crew.\nUnlike many of the FarStar's crew, Gorjaye spoke openly about her past, and boasted of the number of combat engagements she fought in. The most often repeated story is arguably her greatest - her training and graduation from the Raithal Academy flight corps program. However, she usually omitted any mention of her time growing up on Salliche, or her time as part of Salliche Student Militia.\nThe placement of the incident involving Gorjaye and Calson's crash-landing into the jungle is unclear. Calson refused to take orders from Gorjaye because she was a woman, which may have placed it during her time at the Raithal Academy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Salliche/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Salliche_Student_Militia",
  "/wiki/Raithal_Academy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/FarStar",
  "/wiki/Lieutenant/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Calson",
  "/wiki/Corvaj",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/Survival_Class",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/The_Saga_Begins",
  "/wiki/Omens",
  "/wiki/Death_Is_Remotely_Possible",
  "/wiki/Traitor_in_our_Midst",
  "/wiki/Plant_Food",
  "/wiki/The_Kathol_Outback",
  "/wiki/The_Masters_of_Exocron",
  "/wiki/Galaxy%27s_Edge",
  "/wiki/Harm%27s_Way",
  "/wiki/The_Kathol_Rift",
  "/wiki/Home_(RPG_adventure)",
  "/wiki/The_Saga_Nears_Its_End",
  "/wiki/Endgame",
  "/wiki/Star_Wars_Miniatures_Battles#Blister_Packs",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Iron_Man",
  "/wiki/Star_Wars_Galaxy_Magazine_6",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}