{
 "name": "Ranon Djelkh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Unknown"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Ranon Djelkh  was a veteran smuggler who aspired to be Tatooine's finest Devaronian crime lord. Unfortunately, the desert world's reigning underworld figure, Jabba the Hutt, did not share in Ranon's vision, and the Devaronian was forced into attempting to depose of the Hutt through violent means.\nRanon began his criminal career on Devaron itself, selling glitterstim and running weapons to the anti-Imperial factions present there. When the Empire turned too much attention to Devaron, Ranon took his cargo ship and headed for better markets. He smuggled and traded whatever contraband he could buy or steal on Bimmisaari, Nar Shaddaa, Kessel, Ryloth, and half a dozen other worlds before finally settling on Tatooine. There, he found a golden world of opportunity, where a being of sufficiently ruthless character could create an empire out of sand, spice, and the sweat and blood of people unwary enough to fall under his influence.\nHe made alliances with the local crime lords and broke them just as quickly, always appearing just strong enough to make the cost of retaliation prohibitive. He worked his way up the underworld food chain, trafficking in whatever the black market wanted, until his advancement was finally checked by Jabba the Hutt. Jabba had previously ignored Ranon, and when the Devaronian finally came to his attention, Jabba offered him a job. Ranon, though, was infuriated by the offer—he wasn't going to settle for a position as a Hutt's minion. He decided then and there to end Jabba's reign and take his place as the foremost overlord of Tatooine's criminal network. His efforts failed against the corpulent gangster, however, and Ranon Djelkh was eventually killed by the Tusken Raider A-Zulmun.\nRanon's appearance was typical of most Devaronians, but his skin coloration was somewhat more ruddy. He wore gold sheaths on the upper parts of his horns, openly displaying his wealth. His clothes were made from the finest silks in the galaxy. He was a rather dashing figure, aside from the ambitious gleam in his eye. Whenever he entered a dangerous situation, he strapped on his trusty old heavy blaster pistol, but he was never without his hold-out blaster, concealed within the left sleeve of his bantha-skin jacket.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Devaron/Legends",
  "/wiki/Glitterstim/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bimmisaari/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Overlord",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/A-Zulmun",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Bantha/Legends",
  "/wiki/Vibrodagger/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Secrets_of_Tatooine"
 ]
}