{
 "name": "Ranquiv",
 "display_name": "Ranquiv",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Storm-hairs"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Multicolored"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nuso Esva's realm",
      "Chosen",
      "Chosen"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Nuso Esva"
     ]
    }
   ]
  }
 ],
 "content": "Ranquiv was a male member of the species nicknamed Storm-hairs by the Quesoth species. A leader of the Chosen, the elite warriors of Storm-hair Warlord Nuso Esva, Ranquiv led an squadron of approximately thirty Chosen from the Outer Rim Territories planet Poln Minor under Esva's directive in 0 ABY. As part of Esva's plot to defeat his nemesis, Senior Captain Thrawn of the Galactic Empire and Empire of the Hand, Ranquiv hired nearly thirty individuals including Rebels Leia Organa and Han Solo to mount Caldorf VII interceptor missiles aboard his fifty Whisperlike fighters he would use to destroy Thrawn's forces.\nRanquiv brought the group to a cave system aboard a speederbus, and they began arming the starfighters. While the Storm-hair spoke with other Chosen and a thug known as Spikes, Solo attempted to eavesdrop, and the Storm-hair ordered him away. Shortly after, the Rebel and his companion stole Ranquiv's bus, and although he tried to stop them, they were able to escape. Eventually all Whisperlike fighters were armed and, unfortunately for Ranquiv's warlord master, destroyed during a battle in the Poln system between Imperial forces and Esva's Eastern Fleet.\nA male member of the species known as the Storm-hairs to the Quesoth species, Ranquiv served under his master, Storm-hair Warlord Nuso Esva. In 0 ABY, Ranquiv led a squadron of approximately thirty Storm-hairs during an operation in the Candoras sector Poln system that would defeat Esva's arch nemesis, Senior Captain Thrawn of the Galactic Empire and the Empire of the Hand, which opposed Esva's realm. The operation consisted of kidnapping the family of Candoras's governor, Bidor Ferrouz, and bringing the Rebel Alliance to Poln so that Thrawn would try to defeat the Rebels and assist Ferrouz, coming to the system, where fifty Whisperlike fighters of Ranquiv's and Esva's large Eastern Fleet would cripple the senior captain's forces. Under Esva's command, the other Storm-hair hid his Whisperlikes in a cave under Poln's Poln Minor, a planet filled with mines and caverns. His forces then began to mount and calibrate Caldorf VII interceptor missiles aboard the Whisperlikes, but they soon realized they would not finish arming the starfighters in time for Thrawn's arrival. To amend that problem, Ranquiv hired nearly thirty individuals to finish what his people could not.\nIn Poln Minor's Dankcamp Village, a Duros recommended two associates of his—the Rebels Han Solo and Leia Organa—to Ranquiv, who tested their knowledge of missile programming by asking them if they could calibrate Caldorf and Regginis Mol interceptor missiles. Organa countered that they could calibrate the former, but not the latter, as they were no longer being built. Satisfied, Ranquiv offered the pair 200 hundred credits per missile loaded, and after they accepted, brought them along with the other hired hands to his speeder bus, aboard which he got them to the Whisperlikes' hiding place. Shortly after, Ranquiv and several of his men, including the thug Spikes, discussed the unsuccessful assassination attempts on Ferrouz carried out by Esva's agents and stopped by Emperor's Hand Mara Jade. While Solo eavesdropped on the conversation, Spikes spotted the Rebel, who asked for equipment, prompting Ranquiv to lead him to a closet full of hydrospanner bolts. Meanwhile, Master Vestin Axlon, an ally of Esva's, asked the thug Dors Stelikag if Ranquiv had given him a description of Solo and advised Stelikag to tell the Storm-hair about Solo, who Axlon suspected would not be a problem.\nShortly afterward, as Solo finished arming his third missile, Ranquiv and a group made of two Chosen and two armed men started chasing the Rebel, who in turn threw his hydrospanner at the Chosen leader—who blocked it with his arms—and commandeered a Whisperlike with Organa. After crashing the Whisperlike, the Rebels stole Ranquiv's bus and fled. Soon after, however, the Chosen followed in pursuit, but were unable to locate the Rebels. Ultimately, the Chosen forces that kidnapped Ferrouz were killed by Imperial and Rebel forces and Thrawn indeed traveled to the Poln system. There, Esva's Eastern Fleet engaged his forces with the assistance of Ranquiv's Whisperlikes, which an Imperial Golan 1 space station destroyed while Esva fled.\nA Storm-hair male, Ranquiv had shimmering skin that looked like a rainbow, yellow multifaceted eyes, and black hair. The Chosen's voice glittered like his skin, with his words having an edge.\nRanquiv wore a hood. He owned a datapad he shared with his speeder bus's pilot so that they could reach the Whisperlike fighters' cavern without getting lost.\nRanquiv appeared in the 2011 novel Choices of One, which was written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Storm-hairs",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nuso_Esva%27s_realm",
  "/wiki/Chosen_(Nuso_Esva)",
  "/wiki/Nuso_Esva",
  "/wiki/Species/Legends",
  "/wiki/Quesoth",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet/Legends",
  "/wiki/Poln_Minor",
  "/wiki/0_ABY/Legends",
  "/wiki/Senior_Captain/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Caldorf_VII_interceptor_missile",
  "/wiki/Whisperlike_fighter",
  "/wiki/Task_Force_Admonitor",
  "/wiki/Cave/Legends",
  "/wiki/Speeder_bus/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Gangster/Legends",
  "/wiki/Spikes",
  "/wiki/Thief/Legends",
  "/wiki/Battle_of_the_Poln_system",
  "/wiki/Poln_system",
  "/wiki/Eastern_Fleet",
  "/wiki/Candoras_sector",
  "/wiki/Bidor_Ferrouz%27s_family",
  "/wiki/Governor/Legends",
  "/wiki/Bidor_Ferrouz",
  "/wiki/Star_system/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Programmer/Legends",
  "/wiki/Regginis_Mol_interceptor_missile",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Assassin/Legends",
  "/wiki/Battle_for_Poln_Major",
  "/wiki/Emperor%27s_Hand",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Hydrospanner/Legends",
  "/wiki/Vestin_Axlon",
  "/wiki/Dors_Stelikag",
  "/wiki/Limb/Legends",
  "/wiki/Death/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Golan_Space_Defense_SpaceGun",
  "/wiki/Space_station/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/2011",
  "/wiki/Choices_of_One",
  "/wiki/Timothy_Zahn",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Crisis_of_Faith",
  "/wiki/Heir_to_the_Empire:_The_20th_Anniversary_Edition"
 ]
}