{
 "name": "Rantu",
 "display_name": "Rantu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Rantu's battalion",
      "Imperial Officer Corps",
      "Rantu's battalion",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Rantu was a human male who served as a major in the Galactic Empire during the early stages of its reign. Rantu, along with Colonel Bergon and Commander Jordo, were assigned to Governor Wilhuff Tarkin to discourage growing tensions with Mon Cala.\nRantu served as a major in the armed forces of the Galactic Empire. By 18 BBY, Rantu was present aboard the bridge of the Star Destroyer Sovereign in orbit of the planet Mon Cala with Commander Jordo of the Imperial Security Bureau and Colonel Bergon, who were all assigned to assist Governor Wilhuff Tarkin with possible military operations. Tarkin questioned Rantu as to whether his teams were ready in the event that an invasion of the planet became necessary, to which Rantu responded that his teams had been running simulations since they arrived in orbit and that his troopers were now more fish than people. When the shuttle of Imperial ambassador Telvar was shot down, killing all aboard, Tarkin told a lieutenant to inform Rantu that he was to deploy landing craft immediately on his authorization.\nEventually, the order was given, and Major Rantu deployed the landing craft and a battalion landed in Dac City, culminating in the Battle of Dac City, as well as other incidents worldwide. Major Rantu spearheaded Imperial military operations from a command center in Dac City. During the battle, King of Mon Cala Lee-Char and his military forces evacuated all civilians from surface cities. By the time evacuations were half-finished, King Lee-Char contacted the Sovereign to protest the military invasion, exclaiming that they were not responsible for the death of Ambassador Telvar. After the conversation ended with no success of ending the conflict, and that Lee-Char had warned aggressive action should the Empire continue, Tarkin ordered the lieutenant to contact Rantu and inform him to expect a large-scale counterattack from native forces and that it would occur when the civilian population have been fully evacuated. When the lieutenant asked if he should also inform Rantu on the nature of the attack, Tarkin replied by stating that he did not know what tactic the natives would employ, but that the Empire was fully aware of their military capabilities.\nAfter the evacuations were complete and King Lee-Char had already attempted a peaceful solution and received advise from Jedi Padawan Ferren Barr on his course of action, enormous creatures emerged from the depths throughout the planet, jumped above water, and crashed down near all of the surface cities, including Dac City, almost immediately destroying them. After the destruction of all surface cities, Tarkin assumed that Rantu was killed in the event along with all of their forces, and assigned the next stage of the military operation to Bergon.\nIn preparation for a possible military operation on Mon Cala, Rantu believed that his forces were more comparable to fish rather than people given enough time and training.\nAs an major in the armed forces of the Empire, Rantu was capable in deploying planet-wide invasions, and was capable of coordinating military efforts from a command base. Rantu was also able to effectively prepare his forces prior to military operations.\nRantu debuted in the canon 2018 comic Darth Vader  13 written by Charles Soule and pencilled by Giuseppe Camuncoli.\nThere is an inconsistency with Rantu's rank insignia plaque. In one panel he can bee seen wearing a badge with six tiles: three red and three blue. In another panel he has four red tiles on his badge.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Rantu%27s_battalion",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Major",
  "/wiki/Imperial_Era",
  "/wiki/Colonel",
  "/wiki/Bergon",
  "/wiki/Commander",
  "/wiki/Jordo",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Mon_Cala",
  "/wiki/Imperial_Military",
  "/wiki/18_BBY",
  "/wiki/Bridge_(starship)",
  "/wiki/Star_Destroyer",
  "/wiki/Sovereign",
  "/wiki/Orbit",
  "/wiki/Planet",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Trooper",
  "/wiki/Fish",
  "/wiki/Shuttle",
  "/wiki/Ambassador",
  "/wiki/Telvar",
  "/wiki/Death",
  "/wiki/Lieutenant",
  "/wiki/Landing_craft",
  "/wiki/Battle_of_Dac_City",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/Mon_Cala_planetary_defense_services",
  "/wiki/King",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ferren_Barr",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Darth_Vader_(2017)_14"
 ]
}