{
 "name": "Rappertunie",
 "display_name": "Rappertunie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Manpha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Shawda Ubb"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "30 centimeters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Max Rebo Band"
     ]
    }
   ]
  }
 ],
 "content": "Rapotwanalantonee, better known as Rappertunie, was a Shawda Ubb male from the planet Manpha who played the Growdi Harmonique in the Max Rebo Band. He had a thirst for travel, but ended up in a lifetime gig with the rest of the band when they became the house band of the Hutt crime lord Jabba Desilijic Tiure at his palace on the desert world Tatooine. Rapotwanalantonee would spend entire days sitting motionless to try and keep his skin cool in the palace's dry climate and plotted his escape while playing for the Hutt.\nIn 4 ABY, Rapotwanalantonee and the rest of the band were playing the song \"Jedi Rocks\" at the palace when Jabba interrupted by feeding the enslaved dancer Oola to his pet rancor, Pateesa. The band then witnessed the arrival of the disguised Princess Leia Organa, who would kill Jabba the next day.\nRapotwanalantonee, whom everyone called Rappertunie, was a Shawda Ubb male instrumentalist born on the swampy planet Manpha. He used his musical talent to pay his way around the galaxy and played the Growdi Harmonique in the Max Rebo Band, a 12-member band led by the Ortolan Max Rebo that was made up of veteran banders local to the desert planet Tatooine. Rapotwanalantonee was not a core member of the band, but was brought in to supplement them along with fellow band members Joh Yowza, Barquin D'an, and Doda Bodonawieedo, as well as drummers, backup singers, and dancers when Rebo booked a high profile gig.\nThe band played regularly for the Hutt crime lord Jabba Desilijic Tiure, who was a big fan, and they often performed at his Tatooine palace or townhouse in the city of Mos Eisley. They became Jabba's house band, a lifetime gig that Rebo happily agreed to that only paid in freed meals, much to the outrage of his bandmates. Rapotwanalantonee was at one point interviewed by Tac-Com and provided an eyewitness description of the interior of the palace, which ended up among the Alliance to Restore the Republic's reports on Jabba.\nRapotwanalantonee and the rest of the band were playing for Jabba on board the Hutt's sail barge, the Khetanna, when Jabba's majordomo, Bib Fortuna, contacted the bounty hunter Boba Fett to request an update on Fett's delivery to Jabba of the smuggler Han Solo, who had been captured and frozen in carbonite in 3 ABY. Fett later successfully delivered Solo, after which the smuggler's allies began planning his rescue. As part of this, Princess Leia Organa, requested Rapotwanalantonee's interview on the palace from Alliance Intelligence.\nThe frozen smuggler was hung on the wall in Jabba's throne room at the palace when Rapotwanalantonee and the band performed there in 4 ABY. The band played a relatively slow tune while the enslaved dancers Oola and Yarna d'al' Gargan performed in front of Jabba, and when they finished the song, Rapotwanalantonee bowed his head to the audience.\nJabba demanded that Oola perform her dance again, but thinking that the Hutt was talking to the band, Yowza counted the musicians down into starting another song. Rapotwanalantonee began playing, but not the song that Yowza had in mind, and so after Yowza shouted at the Shawda Ubb, the band began to play the song \"Jedi Rocks.\" Oola and Gargan continued dancing for the Hutt, but when Jabba tried to pull Oola closer she resisted. As punishment for this humiliation, the crime lord dropped the dancer through a trap door, causing her to scream and interrupt the band, who stopped playing. Oola then fell into a pit below the throne room, where she was devoured by Jabba's pet rancor, Pateesa, as much of the Hutt's court watched and cheered.\nOnce Oola was dead, the room's attention was drawn to the entryway by the sound of blaster fire. As the band remained silent, Organa entered, disguised as the bounty hunter Boushh, with the Wookiee Chewbacca in tow. Organa then negotiated with Jabba over the bounty on Chewbacca's head, producing an active thermal detonator to threaten him into raising the price. At the sight of the explosive, most members of the court cowered, but Jabba merely laughed and agreed to a partial increase. With the situation resolved, Rapotwanalantonee and the rest of the band began playing again as Chewbacca was dragged away. The next day, Organa and her allies killed Jabba and much of his court while rescuing Solo.\nRapotwanalantonee was a green-skinned and green-eyed Shawda Ubb with a small chubby head who stood 30 centimeters  tall. His small size made him feel quite vulnerable, but like other Shawda Ubb, Rapotwanalantonee could spit a paralyzing poison, and he would do so at anyone who threatened him. He always had a thirst for travel, but ended up trapped at Jabba's Palace, where the hot dry climate did not suit him at all. As such, he would spend entire days perched motionless on his Growdi seat trying to keep his naturally moist skin cool, and when playing would sit at the rear of the stage while plotting his escape.\nRapotwanalantonee was the undisputed virtuoso of the Growdi Harmonique, an instrument played with fingers, toes, and the mouth that required highly synchronized skills to use. The Shawda Ubb had mastered these skills and demonstrated them regularly.\nDuring the production of Star Wars: Episode VI Return of the Jedi, Rappertunie was nicknamed \"Jedi Rapper\" by the filmmakers. He was realized as a puppet which was then digitally composited into new and existing footage for the Special Edition release of the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rappertunie",
  "/wiki/Rappertunie/Legends",
  "/wiki/Manpha",
  "/wiki/Shawda_Ubb",
  "/wiki/Gender",
  "/wiki/Centimeter",
  "/wiki/Color",
  "/wiki/Max_Rebo_Band",
  "/wiki/Planet",
  "/wiki/Growdi_Harmonique",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Desert",
  "/wiki/Tatooine",
  "/wiki/Standard_day",
  "/wiki/4_ABY",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Death",
  "/wiki/Swamp",
  "/wiki/The_galaxy",
  "/wiki/Band",
  "/wiki/Ortolan",
  "/wiki/Max_Rebo",
  "/wiki/Joh_Yowza",
  "/wiki/Barquin_D%27an",
  "/wiki/Doda_Bodonawieedo",
  "/wiki/Desilijic_Complex",
  "/wiki/City",
  "/wiki/Mos_Eisley",
  "/wiki/Tac-Comm",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/3_ABY",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Throne",
  "/wiki/Yarna_d%27al%27_Gargan",
  "/wiki/Blaster",
  "/wiki/Boushh",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Bounty",
  "/wiki/Thermal_detonator",
  "/wiki/Eye",
  "/wiki/Poison",
  "/wiki/Limb",
  "/wiki/Mouth",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Jedi",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/War_of_the_Bounty_Hunters_Alpha_1",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Music_in_the_Star_Wars_Galaxy:_The_Modal_Nodes_vs._The_Max_Rebo_Band",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Databank_(original)"
 ]
}