{
 "name": "Rarsk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Rarsk was a fearsome Trandoshan male bounty hunter who burned an entire village alive on the planet Dantooine. During the Cold War he received the sponsorship of the Hutt crime lord Suudaa Nem'ro to enter the Great Hunt competition.\nWhile trying to collect a bounty on the Republic scientist Albea in Fa'athra's Palace on the planet Nal Hutta, Rarsk was confronted by another bounty hunter who Nem'ro had also promised to sponsor. The rival hunter then killed Rarsk and took the sponsorship token from him.\nThe Trandoshan male Rarsk was a bounty hunter active during the Cold War between the Galactic Republic and the reconstituted Sith Empire. He burned an entire village alive on the planet Dantooine. In 3643 BBY, he earned the sponsorship token of the crime lord Suudaa Nem'ro to join the Great Hunt, a bounty hunting competition. Graata, a representative of the Great Hunt who was due to arrive shortly in Nem'ro's Palace on the planet Nal Hutta, then contacted Rarsk via transmission. The Trandoshan then headed to the palace of Nem'ro's rival, Voontara Fa'athra, who was holding the Republic scientist Albea for the bounty hunter. Rarsk intended to collect on the bounty and deliver Albea to the Empire, who wanted her dead.\nInside the palace, Rarsk discovered that many of Fa'athra's servants had been killed, and entered the lab where Albea was being kept with his blaster pistol drawn and two Abyssin mercenaries backing him up. Laying in wait for him in the lab, Rarsk found the slicer Mako and another bounty hunter who Nem'ro had promised sponsorship to. Nem'ro had told the hunter to kill Rarsk in order to obtain the sponsorship token, and Mako had intercepted Rarsk's transmission with Graata to learn about Albea and allow them to reach her before the Trandoshan. Rarsk threatened to kill the pair if they did not hand the bounty over, but the other hunter countered by demanding that Rarsk hand over the token. With neither backing down, Rarsk attacked, but he and the Abyssins were killed and the token taken from his corpse.\nThe surviving bounty hunter then killed Albea in order to also claim the bounty on her.\nThe bounty hunter and Mako then met with Graata at Nem'ro's Palace, who was surprised to not be meeting Rarsk, but gave the instructions he intended to deliver to the Trandoshan to his replacement instead. Nem'ro was satisfied that he was now sponsoring the most dangerous bounty hunter on Nal Hutta and so the bounty hunter left to participate in, and ultimately win, the Great Hunt.\nRarsk was considered a deadly and fearsome hunter by Nem'ro, who believed him to be the most dangerous hunter on Nal Hutta until he was killed. The Trandoshan refered to members of other species as \"soft things\" and believed them to be stupid. He believed in the Scorekeeper and asked her to watch him when he fought. Rarsk was unwilling to trade his sponsorship token for Albea, believing he could simply kill his foes instead of making a deal. He spoke in Dosh and had red eyes and green skin.\nRarsk wore a brown and red jumpsuit with a brown vest and a gray belt. He wore a brown backpack and used a blaster pistol, a flamethrower, a grappling hook, a retractable blade, and grenades in combat.\nRarsk appeared in the 2011 massively-multiplayer online roleplaying game Star Wars: The Old Republic as an enemy in the bounty hunter class campaign.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rarsk_(Hutt)",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Bounty/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Albea",
  "/wiki/Fa%27athra%27s_Palace",
  "/wiki/Hunter_(individual)",
  "/wiki/Death/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Graata",
  "/wiki/Nem%27ro%27s_Palace",
  "/wiki/Voontara_Fa%27athra",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Abyssin/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Mako_(slicer)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Scorekeeper/Legends",
  "/wiki/Dosh/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Backpack/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Flamethrower/Legends",
  "/wiki/Grappling_hook/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}