{
 "name": "Rathari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cranial implant above right eye and left cheek"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireSith Order",
      "Sith Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Girik"
     ]
    }
   ]
  }
 ],
 "content": "Rathari was a male Human Sith Lord of the resurgent Sith Empire during the Cold War.\nDuring the Cold War, Rathari was given dispensation by the Dark Council to oversee Imperial operations on Nar Shaddaa, where the Empire was vying for the favor of the Hutt Cartel. At the same time, one of Rathari's rival's, Darth Baras' had one of his agents, Dellocon, defect to join Rathari. Baras dispatched his new apprentice to eliminate Dellocon due to the danger of his network of spies being exposed.\nWith the assistance of another of Baras' operatives, Halidrell Setsyn, the Sith Warrior began systemically interfering with Rathari's operations, including the destruction of his apprentice, Girik, interrupting negotiations with the Hutts, and disrupting an Imperial assault on Republic holdings. Rathari struck back, tracking down Setsyn and killing her, before demanding that the Warrior face him in the Network Access.\nThe Warrior walked into an obvious trap, as Rathari unleashed his specialized hit squad to kill the Warrior. But he underestimated his opponent and was beaten in the subsequent lightsaber duel. Conceding defeat, Rathari then executed Dellocon, before confessing his belief that Baras would fall to his own apprentice. He offered his services to the Warrior, to wait for the day when he would witness Baras' downfall. The Warrior refused and struck down Rathari.\nAs opposed to Baras, Rathari preferred direct, open actions rather than plotting from the shadows.\nDepending on the player's choice, Rathari can either be killed , his services accepted, or spared and told to disappear . If made to swear loyalty to Warrior, he later reappears during the Wrath's final confrontation with Baras on Korriban.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Order_(Sith_Empire)",
  "/wiki/Girik",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Dark_Council",
  "/wiki/Hutt_Cartel",
  "/wiki/Darth_Baras",
  "/wiki/Dellocon",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Halidrell_Setsyn",
  "/wiki/Sith_Warrior",
  "/wiki/Network_Access",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Korriban",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}