{
 "name": "Rav",
 "display_name": "Rav",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Feeorin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Left white",
      "right yellow"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic right leg",
      "Prosthetic left eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild",
      "Bloody Bones Pirates",
      "One SithSith Intelligence and Assassination",
      "Sith Intelligence and Assassination"
     ]
    }
   ]
  }
 ],
 "content": "Rav was a male Feeorin pirate who was the owner of a bounty clearing house and cantina, the Golden Gorg, during the era of the Sith–Imperial War and the Second Imperial Civil War. He was also a collaborator to the One Sith and Darth Krayt's Galactic Empire. His pirate symbol, the Bloody Bones, was feared across the galaxy.\nDuring a raid on Roon for fun, Rav and Zareb Syn were attacked by Rasi Tuum, a Jedi who was trying to defend a mining camp. Rav lost his leg to Tuum's lightsaber during the encounter. Zareb tried to kill the Jedi only to be killed himself in front of his son, Jariah. Rav twisted the events to the young boy, telling him that he and his father were simply trading when the Jedi attacked without provocation. He also claimed that the young Arkanian girl next to them was going to be stolen away to the Order, when in reality, she was just a prisoner. Rav later got a mechanical leg to replace the one he lost.\nRav owed some form of debt to Zareb, and as a result took Jariah into his crew. In the aftermath of the Massacre of Ossus in 130 ABY, he took Cade Skywalker aboard the Crimson Axe as his apprentice on the request of Jariah,, with Cade hiding his famous lineage or role as a Jedi Padawan. He and his crew raided the Jedi Praxeum on Ossus, finding the corpses leftover from the attack. He laughed at the bodies, joking that Jedi just die. He had a cross-shaped scar running over one eye, and his right leg was mechanical from the knee down, with weapons supposedly hidden within it. For seven years, Rav trained Cade in the \"free\" way and had him swear the Bloody Bones oath. He later retired from pirating and opened a bounty clearing house on Socorro. Here, Rav provided the bounty hunters numerous services, including ship repairs. He was also a spice runner, and used this to keep addicted bounty hunters  in his debt. Rav frequently spoke Huttese.\nWhen Cade and his crew came to Socorro to cash in the bounties on bond-skipper Naxy Screeger and the Jedi Hosk Trey'lis in 137 ABY, he gave Skywalker three death sticks on credit, enraging Jariah Syn, who wished to be out of Rav's debt. One of his henchmen escorted Naxy away and the other, a Wookiee, carried Trey'lis off. He lectured Syn that one's loyalty is to self and that he would always be owned.\nRav later double-crossed Syn and Blue by turning them into the Imperial Director of Intelligence, Nyna Calixte, for harboring Cade, whom he had just found out was a Jedi.\nHe was later tracked down by Cade, Syn, Chak and Kee because he had Chak's ship, the Grinning Liar. After a brief fight, which Cade and his friends won, Rav reluctantly returned the ship to Chak and Kee and swore his own oath to Skywalker. He later reported to Sith Lady Darth Maladi, the head of Sith Intelligence and Assassination, swearing his oath to her and promising to deliver any information concerning his former protegé.\nUnder Lady Maladi's orders, Rav hired the crew of the Mynock for a job on the planet Wayland, a job he referred as a simple \"blue milk run\". However, it was a trap set up by Lady Maladi and Rav to capture Skywalker.\nJohn Ostrander considered calling him the \"Dread Pirate Rav\" as a nod to Dread Pirate Roberts from The Princess Bride, but decided against it, as Rav was \"NOTHING like ANY\" of the characters from that movie.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Rav",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Rav",
  "/wiki/Rav_Bralor",
  "/wiki/Feeorin/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/One_Sith",
  "/wiki/Sith_Intelligence_and_Assassination",
  "/wiki/Star_Wars:_Legacy:_Broken",
  "/wiki/Pirate/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Golden_Gorg_Cantina",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Darth_Krayt",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Bloody_Bones_(insignia)",
  "/wiki/The_galaxy/Legends",
  "/wiki/Roon/Legends",
  "/wiki/Zareb_Syn",
  "/wiki/Rasi_Tuum",
  "/wiki/Jedi/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jariah_Syn",
  "/wiki/Arkanian/Legends",
  "/wiki/Massacre_of_Ossus",
  "/wiki/130_ABY",
  "/wiki/Cade_Skywalker",
  "/wiki/Crimson_Axe",
  "/wiki/Skywalker_family/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Bloody_Bones_oath",
  "/wiki/Socorro/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Naxy_Screeger",
  "/wiki/Hosk_Trey%27lis",
  "/wiki/137_ABY",
  "/wiki/Death_stick/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Morrigan_Corde",
  "/wiki/Chak_(Wookiee)",
  "/wiki/Kee",
  "/wiki/Grinning_Liar",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Maladi",
  "/wiki/Wayland",
  "/wiki/Blue_milk_run/Legends",
  "/wiki/Wayland_trap",
  "/wiki/John_Ostrander",
  "/wiki/Legacy_(2006)_2",
  "/wiki/Legacy_(2006)_3",
  "/wiki/Legacy_(2006)_6",
  "/wiki/Legacy_(2006)_9",
  "/wiki/Legacy_(2006)_11",
  "/wiki/Legacy_(2006)_12",
  "/wiki/Legacy_(2006)_14",
  "/wiki/Legacy_(2006)_16",
  "/wiki/Legacy_(2006)_23",
  "/wiki/Legacy_(2006)_26",
  "/wiki/Legacy_(2006)_28",
  "/wiki/Legacy_(2006)_29",
  "/wiki/Legacy_(2006)_35",
  "/wiki/Legacy_(2006)_40",
  "/wiki/Legacy_(2006)_43",
  "/wiki/Legacy_(2006)_44",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Legacy%E2%80%94War_5",
  "/wiki/Legacy%E2%80%94War_6",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Star_Wars_Insider_88",
  "/wiki/Star_Wars:_Panel_to_Panel_Volume_2:_Expanding_the_Universe",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_Era_Campaign_Guide"
 ]
}