{
 "name": "Rav_Horan",
 "display_name": "Rav Horan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Commandant's Cadets",
      "Commandant's Cadets"
     ]
    }
   ]
  }
 ],
 "content": "Rav Horan was a human male cadet at the Galactic Empire's officers' academy on the planet Arkanis. He had a \"wiry\"' appearance. As a cadet at this academy, was a candidate to become an Imperial officer. As one of the academy's top-performing cadets, Horan was a member of the Commandant's Cadets, a select group of cadets recruited personally by the academy's top officer, Commandant Brendol Hux.\nHoran was one of the first people that Zare Leonis, who was at the Arkanis Academy to find his sister, met on his first day there. When Leonis tried to sit at the same table as Horan and several other cadets, Horan told him that he couldn't sit there because he wasn't \"one of them,\" but perhaps he might someday if he was \"good enough.\" Leonis would soon learn that this group was the Commandant's Cadets. Horan mentioned leadership as an important quality in an officer during a Strategy and Tactics class conducted by Colonel Julyan, a quality that Julyan felt most people had trouble defining. Leonis later encountered Horan at a formal assembly and made a joke, asking if such assemblies always happened when the sun came out on the planet, a reference to Arkanis's rainy conditions. Horan laughed and clapped him on the back. Horan was later present during the tribunal in which Leonis was revealed as a traitor and sentenced to death. With the other members of the Commandant's Cadets, he stripped Leonis of his ceremonial uniform.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Commandant%27s_Cadets",
  "/wiki/Imperial_cadet",
  "/wiki/Arkanis_Academy",
  "/wiki/Planet",
  "/wiki/Arkanis",
  "/wiki/Officer",
  "/wiki/Commandant",
  "/wiki/Brendol_Hux",
  "/wiki/Zare_Leonis",
  "/wiki/Dhara_Leonis",
  "/wiki/Standard_day",
  "/wiki/Strategy_and_Tactics",
  "/wiki/Colonel",
  "/wiki/Julyan",
  "/wiki/Star",
  "/wiki/Water",
  "/wiki/Tribunal_of_Zare_Leonis",
  "/wiki/Treason",
  "/wiki/Death",
  "/wiki/Servants_of_the_Empire:_The_Secret_Academy"
 ]
}