{
 "name": "Ravilan%27s_aide",
 "display_name": "Ravilan's aide",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4985 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Lost Tribe of Sith",
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Ravilan's aide, who was referred to as being \"Yilanna\" or \"Illyana\" by Seelah Korsin, was a Human female of the Lost Tribe of Sith who served as an aide for the Red Sith Ravilan Wroth around the year 4985 BBY.\nRavilan's aide was a Human female, who had lived in the Sith Empire and was assigned to the ship Omen on a mission to mine Lignan ore for the upcoming Battle of Kirrek around the time of the Great Hyperspace War. Omen had a collision going into hyperspace with its sister ship Harbinger after a Jedi starfighter attacked the ships and forced Omen into a retreat to protect the Lignan they had mined. Like the rest of the Lost Tribe of Sith, she had crash–landed on the planet Kesh aboard the Sith dreadnaught Omen, and become regarded as one of the god–like Skyborn of the native's legends.\nBeing in her forties after fifteen years on Kesh, she had been assigned to go with the Red Sith Ravilan Wroth to the village of Tetsubal on the Ragnos Lakes to investigate a fluorescent algae for use in lighting Sith structures. Ravilan and his followers, known as the Fifty–seven, secretly and purposefully caused a plague there by adding the toxic cyanogen silicate to the water in an attempt to scare the Sith on Kesh into focusing their efforts on leaving the planet. Ravilan's aide was killed by the substance, along with approximately eighteen–thousand Keshiri natives. When her body was found by Sith who came to investigate the crisis, Seelah Korsin—the wife of the leader and Grand Lord Yaru Korsin—identified the swollen, blue features of her tongue as a result of the cyanogen silicate. This led to Seelah deducing Ravilan's involvement in the event, and eventually the order to kill all the Red Sith on Kesh by the Grand Lord—including Ravilan.\nRavilan's aide was only introduced as the Human Sith aide for the Red Sith Ravilan in the eBook Lost Tribe of the Sith: Paragon by John Jackson Miller, where she only appeared in her dead form after being killed by cyanogen silicate.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4985_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Seelah_Korsin",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Ravilan_Wroth",
  "/wiki/Omen",
  "/wiki/Mining/Legends",
  "/wiki/Lignan",
  "/wiki/Battle_of_Kirrek_(Great_Hyperspace_War)",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Harbinger_(Sith_dreadnaught)",
  "/wiki/Jedi/Legends",
  "/wiki/Infiltrator/Legends",
  "/wiki/Skirmish_over_Phaegon_III",
  "/wiki/Planet/Legends",
  "/wiki/Kesh",
  "/wiki/Sith/Legends",
  "/wiki/Sith_dreadnaught",
  "/wiki/Deity/Legends",
  "/wiki/Skyborn",
  "/wiki/Keshiri",
  "/wiki/Tetsubal",
  "/wiki/Ragnos_Lakes",
  "/wiki/Cyanogen_silicate",
  "/wiki/Water/Legends",
  "/wiki/Grand_Lord",
  "/wiki/Yaru_Korsin",
  "/wiki/Red_Sith_Purge",
  "/wiki/Death/Legends",
  "/wiki/EBook",
  "/wiki/Lost_Tribe_of_the_Sith:_Paragon",
  "/wiki/John_Jackson_Miller",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/Lost_Tribe_of_the_Sith:_Skyborn"
 ]
}