{
 "name": "Ravi_Thienta",
 "display_name": "Ravi Thienta",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selonian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Neetha Den"
     ]
    }
   ]
  }
 ],
 "content": "Ravi Thienta was a Selonian female who lived on Talus during the Galactic Civil War.\nRavi Thienta was a Selonian who belonged to the Neetha Den. The den inhabited a cave near the city of Nashal, on the planet Talus of the Corellian system.\nAfter the Battle of Yavin, several Selonians of the den were captured by the Talusian Smugglers and kept as hostages in order to force the rest of the den into mining for them. In 1 ABY, the Corellian Security Force was aware of the situation but was unable to intervene in Selonians matters. Agent Taarna thus recruited an independent spacer in order to help the Seloninans without involving the CorSec. The spacer met Kiki Dorente, advisor to the den mother, and the Seloninans accepted the assistance. After the spacer performed a reconnaissance of the Smuggler Base where the den mates where supposedly held, the Selonians developed a strategy against the smugglers. Kiki Dorente sent back the spacer to the smuggler base in order to gather information about the destination of the cargo shuttles leaving the base. Tika Sileste requested the spacer to eliminate the smuggler guards and destroy the droids in the base. Lika Fimente tasked the spacer to find the captive Selonians in the base. Furthermore, Ravi Thienta asked the spacer to recover stolen Selonian's supplies and destroy the smugglers weapons cache. Although the spacer achieved most of the objectives, the assault was only a partial success. The spacer defeated most of the smugglers, including their leader, and crippled their ability to exploit the Selonians. However, the spacer discovered that the captive Selonians had already been shipped to Ord Mantell and sold as slaves. As the situation with the smugglers was solved, the spacer eventually returned to the Selonian cave and was rewarded by Ravi Thienta.\nRavi Thienta appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony and published by LucasArts, prior to its closure on December 15, 2011. Ravi Thienta was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Selonian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Neetha_Den",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Talus/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Neetha_Den%27s_cave",
  "/wiki/Corellian_system",
  "/wiki/Smuggler_Base",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Talusian_Smugglers",
  "/wiki/1_ABY/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Agent/Legends",
  "/wiki/Taarna",
  "/wiki/Kiki_Dorente",
  "/wiki/Neetha_den_mother",
  "/wiki/Tika_Sileste",
  "/wiki/Lika_Fimente",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}