{
 "name": "Ravna  (Lord)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ravna's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Lord Ravna was a vampyric creature that could feed on energy and convert others by infecting them with his claws. He worked with Count Dooku on the planet Bray, but his presence brought the Jedi Masters Obi-Wan Kenobi and Adi Gallia to investigate. When Ravna was confronted, he betrayed Dooku and attacked the Jedi. Fighting back, Dooku and the Jedi managed to collapse the walls of the Citadel of Light onto Ravna, trapping him.\nDuring the Clone Wars, Lord Ravna came to reside on the dark planet of Bray, hiding in the ancient Citadel of Light. From there, he regularly infected several Brayans, transforming them into creatures similar to himself. During his time on the planet, he was discovered by the Sith Lord Count Dooku, who wished to use Ravna's powers to infect the clone troopers in the Grand Army of the Republic, allowing the Confederacy of Independent Systems to win the war. Despite letting Dooku work with him, Ravna aspired to rule the galaxy alone rather than serving the Confederacy.\nWhen the Brayans sent a call for help to the Jedi Council, the Jedi Masters Obi-Wan Kenobi and Adi Gallia were sent to Bray with a group of clones. The Jedi met with a village of Brayans who had been burdened by Ravna and his infected \"children\". While they were there, a converted mynock began to sabotage the village's power, and the clones, led by the Jedi and Commander Cody, attempted to fight it off. The creature infected Peel, one of the clones, but fled back to the Citadel. When the Jedi discovered that Peel had been converted, they went to investigate the ancient fortress, and were met by Dooku.\nThe Jedi confronted Dooku, accusing him of transforming the Brayan villagers, but Dooku denied their accusations, introducing them to Lord Ravna, who began to attack them. Kenobi attempted to defend himself with his lightsaber, but Ravna was able to consume the energy from the lightsaber, knocking Kenobi to the ground. Gallia moved to attack Ravna, but was struck by Dooku's Force lightning. Noticing Dooku's ability, Ravna considered infecting him, but Dooku reminded him of their agreement. Angered, Ravna swiped at the Sith Lord's face, declaring that he would not serve him or the Separatists. Ravna, along with the converted Dooku, stood over the Jedi as his \"children\" swarmed them. Kenobi taunted Dooku, angering him enough to break free of Ravna's influence, striking him with Force lightning. As Dooku held Ravna back, the Jedi escaped the Citadel and used the Force to collapse the decrepit building on top of them.\nWith Ravna trapped beneath the rubble of the fortress, his converted slaves, including Dooku and Peel, were freed and returned to their normal states. Thought to be dead, the tale of Lord Ravna became a myth among the Brayans. However, some time later, Ravna awoke once again, and his arm broke through the ruins of the Citadel. The story was later recounted to the crew of Lina Graf by Lieutenant Thom Hudd while they were stranded on Mustafar.\nRavna first appeared in the flashback section of the 2018 canon comic Star Wars Adventures: Tales from Vader's Castle 2, which was written by Cavan Scott and illustrated by Kelley Jones.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ravna",
  "/wiki/Unidentified_species_(Ravna)",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Lord",
  "/wiki/Claw",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Planet",
  "/wiki/Bray",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Adi_Gallia",
  "/wiki/Citadel_of_Light",
  "/wiki/Clone_Wars",
  "/wiki/Brayan",
  "/wiki/Sith_Lord",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/The_galaxy",
  "/wiki/Jedi_Council",
  "/wiki/Mission_to_Bray",
  "/wiki/Cloning",
  "/wiki/Jedi",
  "/wiki/Unidentified_village_(Bray)",
  "/wiki/Mynock",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Peel",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Force_lightning",
  "/wiki/The_Force",
  "/wiki/Death",
  "/wiki/Time",
  "/wiki/Limb",
  "/wiki/Lina_Graf%27s_crew",
  "/wiki/Lina_Graf",
  "/wiki/Lieutenant",
  "/wiki/Thom_Hudd",
  "/wiki/Mustafar",
  "/wiki/2018",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_2",
  "/wiki/Cavan_Scott",
  "/wiki/Kelley_Jones",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Category:Images_of_Ravna_(Lord)"
 ]
}