{
 "name": "Rawk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ossus"
     ]
    },
    {
     "name": "Died",
     "values": [
      "138 ABY",
      "Taivas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Skywalker family",
      "New Jedi Order",
      "Galactic Alliance Remnant",
      "Emergency evac fleet",
      "Emergency evac fleet"
     ]
    }
   ]
  }
 ],
 "content": "Nat Skywalker was a Human male who served as a Jedi Master during the Sith–Imperial War. Born into a strong Force-sensitive family, Skywalker was a descendant of Anakin and Luke Skywalker, the older brother of Jedi Council member Kol Skywalker, and uncle of Kol's son, Cade. During his time as a Jedi, Skywalker married the Kiffar Droo and adopted her daughter Ahnah; he also adopted a young boy named Skeeto. When the Sith–Imperial War began, Skywalker helped the Jedi Order find a suitable planet, Taivas, to build a Hidden Temple. After leaving the Order, Skywalker adopted the alias \"Bantha\" Rawk, with his family taking the surname as well. In 130 ABY, after the Dark Lord of the Sith Darth Krayt's Sith-Imperials massacred the Jedi on Ossus, Rawk assumed that Cade had perished during the attack. However, Rawk was eventually reunited with his nephew, now a bounty hunter, and helped him build the starship Mynock. During this time, he adopted the Cathar Micah after rescuing him from slavers.\nIn 137 ABY, during the Second Imperial Civil War, agents of the Black Sun crime syndicate attacked Rawk's home on Iego. Rawk and his family were assisted by Cade and the Mynock's crew in defending their home against the mercenaries. They were eventually joined by the Imperial Knight Azlyn Rae, an old friend of Cade's. The former Jedi Master revealed the Hidden Temple's location to Cade when his nephew expressed a desire to assassinate Darth Krayt. Rawk guided Cade's crew and Rae to Taivas and met with the reconvened Jedi Council as his nephew presented them with his plan to kill the Sith Lord. The Council ultimately refused, and Rawk bid his nephew farewell as Cade left with his crew to assassinate Krayt, going against the Council's wishes. After Cade and his team had apparently killed Krayt, he met Rawk and his family on Droo's homeworld, Kiffex, and asked for their assistance in healing Rae, who had been grievously wounded during the mission. Rawk and Droo were forced to encase Rae in a life-preserving suit that Rawk had built for the Kiffu Guardians. When he discovered that Rae had not wanted them to heal her, Rawk gave Cade and his crew two days to repair the Mynock and leave Kiffex. Rawk later assisted the Galactic Alliance Core Fleet in evacuating the planet Dac, which had been stricken by Viral spores at the hands of the Sith.\nA few months later, in 138 ABY, Nat Skywalker answered the call of the Jedi Council on Taivas and reactivated as a Jedi Master for the duration of the war against the reborn Darth Krayt and his One Sith. When the Sith attacked the Hidden Temple, Skywalker fought alongside his nephew Cade, protecting the ancient Neti Jedi Master T'ra Saa, who was engaged in battle meditation against the forces of the Sith. Skywalker ultimately saved Cade's life as he and Master Saa sacrificed themselves in an attempt to deal a critical blow to Darth Krayt's forces, allowing the evacuating Jedi of the Hidden Temple to successfully escape.\nNat Skywalker, a Human male, was born into the Skywalker family, inheriting the Force potential of that bloodline. Eventually, Skywalker grew into a powerful Jedi Master in his own right. However, he felt he could never live up to his family name, especially in comparison to his younger brother, Kol Skywalker, who was a natural leader and a member of the Jedi Council. Skywalker was aware of his brother's secret marriage to the Imperial spy Morrigan Corde, although he never understood why until Kol brought his and Corde's son, Cade, to the Jedi Praxeum on the planet Ossus. Skywalker raised Cade on Ossus, since Kol had to remain on the galactic capital, Coruscant, to tend to Jedi affairs. Kol eventually brought Cade to Coruscant. During this time, Skywalker married a Kiffar named Droo, and adopted her daughter Ahnah and a Force-sensitive boy named Skeeto. By marrying Droo, whose first husband was a member of the Vos clan of Kiffu Guardians, Skywalker became a member of Clan Vos.\nWhen the Sith–Imperial War began in 127 ABY, the Jedi Council ordered the creation of a Hidden Jedi Temple. Skywalker scouted the Rim for a world suitable enough for the creation of such a temple, and came across the planet Taivas, located in the Zhar system. Skywalker and his family helped the Jedi build the Hidden Temple. At some point during the war, Skywalker left the Order, revealing his reasons for doing so only to his wife. In order to hide the fact that they were Skywalkers, he and his family changed their surname to \"Rawk,\" with Skywalker taking the alias \"Bantha.\" In 130 ABY, the Dark Lord of the Sith Darth Krayt's Sith–Imperial forces attacked the Ossus Jedi Praxeum, killing Kol Skywalker and all of the Jedi on the planet and scattering the rest of the Order. Rawk believed that Cade had died with his father on Ossus, but Cade had in fact been rescued by the pirate Rav and had joined the Feeorin's crew aboard the Crimson Axe.\nAt some point after the Massacre at Ossus, the Rawks rescued a young Cathar named Micah from a group of slavers. During the rescue, Micah lost his legs, and Droo tried her best to heal him. Rawk ultimately built and attached a pair of cybernetic legs to Micah and adopted the Cathar. Rawk eventually became a chief mechanic at the Selonian Shipyards. He also maintained a side business creating and modifying weapons for bounty hunters and other individuals who needed reliable weaponry. Eventually, Rawk and Cade, who was now a bounty hunter, were reunited. Rawk helped his nephew and the Zeltron Deliah Blue, a member of Cade's crew, build the starship Mynock. Rawk also supplied his nephew with weaponry, building a modified double-barreled blaster carbine called the Rawk chopped special. At some point, Rawk attacked the Mynock as they were leaving Rawk's home, because Cade's friend, Jariah Syn, had tried to seduce Ahnah.\nBy 137 ABY, Rawk and his family had relocated to the planet Iego in a home nicknamed \"Rawk's Nest.\" Rawk maintained a friendship with the Shipmaster Ure'monbarak on the planet Dac; the work that Ure'monbarak tasked Rawk with supported his family. Members of the Black Sun crime syndicate attacked Rawk's Nest in an attempt to force Rawk to pay them in order for their protection services. The Rawk family was defending their home from the mercenaries when the crew of the Mynock arrived to help the Rawks. With their assistance, Rawk and his family managed to drive off the attackers. Four days later, during a pool party, Rawk and Cade had a conversation in the Nest's workshop. Cade told his uncle of his recent exploits, which included assisting Imperial Princess Marasiah Fel in returning to her father, the deposed Emperor Roan Fel; and invading the Sith Temple on Coruscant to rescue the Jedi Hosk Trey'lis.\nDuring Rawk and Cade's conversation, the bounty hunter mentioned that he had trained under the Sith before escaping their temple. As Rawk began to berate his nephew, Cade mentioned that he had met his mother, Morrigan Corde, during his escape, and used Rawk's former name in addressing him. Rawk reminded his nephew that he had abandoned his former identity when he left the Jedi, and told Cade to leave Iego if he were to tell Rawk's children their father's reasons for leaving the Jedi. Rawk then gave his nephew information about Corde and Kol's relationship with her. Before they rejoined their family, Rawk apologized to Cade for never having told him about Corde, and asserted that family meant everything to him.\nAs Rawk and Cade rejoined their family at the party, Skeeto told everyone to watch a holovid that was airing. Rawk and his family watched in disgust as images were shown of Sith-Imperials on Dac executing the Mon Calamari, and also watched as the Dark Lord Darth Krayt decreed that the surviving Mon Calamari in the galaxy would be placed in work camps. The holovid showed an image of Cade and called him by his full name. Cade confirmed his identity as a Skywalker to his cousins, and Rawk began to scold his nephew. The two attacked each other, but quickly managed to calm down. Rawk ordered Skeeto to turn on the long-range scanners for Imperial activity, and told everyone not to panic. Later in the night, Cade was attacked near the Mynock by a masked figure. After he was temporarily incapacitated, Rawk sneaked up on the attacker and used the Force to pull her blaster out of her hand. She gained the upper hand and held her ignited lightsaber near Rawk's chest. However, Rawk managed to overpower her, and she revealed herself to be Azlyn Rae, a Padawan who had survived the attack on the Jedi Temple on Coruscant. They brought Rae inside, and she explained to the family how she had survived the massacre; she further stated that she had tracked Cade to determine whether or not to turn him in for the bounty placed on him. However, the long-range sensors picked up Imperial Star Destroyers entering the system and heading toward Iego. Rawk instructed his nephew and his crew to hide.\nSearching for Cade, a scouting party led by Imperial Captain Gurlok arrived at Rawk's Nest and interrogated Rae and the Rawks. Rae told Gurlok that she had assisted Rawk in defending his home against the Black Sun mercenaries, but the Imperial Captain doubted her and ordered his stormtroopers to kill Rawk's children unless either he or Rae told him the truth. Rae used a mind trick to convince Gurlok to leave, and the Imperials went back to the Star Destroyer and left the system. Two hours later, Rawk gave Cade another Rawk chopped special, and commended Rae for her actions. He recommended that Cade change his appearance, name, friends, and ship, and also advised against using the Force. Cade disagreed, and told Rawk of his intentions to assassinate Krayt. When Cade mentioned that he could not find the scattered Jedi, Rawk revealed to his nephew that there was a hidden Jedi Temple.\nBefore Rawk, Rae, Cade, and his crew left Iego to locate the Hidden Temple, Rawk instructed Droo to relocate the family to her homeworld of Kiffex. During the trip to Taivas, Rawk recorded a message for Droo and voiced his concerns over his nephew and the crew, as well as a recollection of how the Hidden Temple had come to be. After landing at the Hidden Temple, Rawk, Rae, Cade, and the Mynock's crew discovered that the Imperial Knights Marasiah Fel, Antares Draco, and Ganner Krieg had followed them to the Temple. Cade and the Jedi Knight Shado Vao attacked the Imperials, but stopped when Cade's former Master, Wolf Sazen, ordered them all to put away their weapons. Cade realized that Rae had led the Imperials there via a tracking device she had secretly planted aboard the Mynock. When Fel explained that Rae was an Imperial Knight, Cade—believing that the Imperial delegation were spies—tried to attack them, but was restrained by Rawk. Tensions died down, and Rawk, Cade, and the Imperials were permitted to meet with the reconvened Jedi Council, led by Masters T'ra Saa, K'Kruhk, and Tili Qua. Cade presented the Council with his plan to assassinate Darth Krayt, and they indicated that they would meditate on the matter.\nAt night, Rawk and the Council discussed his nephew's plan. Rawk felt that his nephew probably had the right idea to assassinate Krayt, even if he was slipping toward the dark side of the Force. However, the Council decided not to support Cade's plan. Rawk bid his nephew farewell as Cade, his crew, Shado Vao, Rae, Draco, and Krieg—who were ordered by Fel to accompany Cade on his mission—departed to carry out the plan regardless. Rawk, meanwhile, returned to his family on Kiffex.\nEventually, Rawk began to work on a suit of prototype armor on behalf of the Kiffu Guardians. When the armor was near completion, he informed Sheyf Zharia Vos, leader of the Kiffu Guardians, that the suit was almost finished. After Cade's crew seemingly killed Darth Krayt, they rushed to Kiffex so that Droo could try to heal Rae, who had been grievously injured during the battle. As Rawk finished conversing with Vos, Syn contacted him over his comm system and asked Rawk to transmit the compound's coordinates to the Mynock's navigation computer. After sending the coordinates, Rawk and Droo met Cade and his crew outside their home. Cade, who was using his healing ability to keep Rae alive, gave Rae to Droo. Cade deceived his aunt into believing that Rae wished to live, when in fact the Imperial Knight did not wish to live. Rawk promised Cade to do whatever it took to save Rae.\nLater, when Cade attempted to assist in healing Rae, Rawk refused, citing his nephew's usage of the dark side in conjunction with his healing ability. Droo tried everything she could, but Rae—who had been placed in a bacta tank—was pushing her attempts away. Droo believed that they had to let her die, but Rawk disagreed, stating that Cade had seen too many promises broken in his life. Despite hesitance from Droo, the two placed Rae in the life-preserving suit that Rawk had developed for Sheyf Vos. After finding out that Cade had lied about Rae wanting to live, Droo confronted Cade and told him to leave and to perhaps never return to the Rawks. Rawk gave Cade and his crew a deadline of two days to make repairs to the Mynock and leave. Two days later, Cade and his crew departed Kiffex without saying goodbye to Rawk and his family.\nEventually, the Sith Lord Darth Wyyrlok, who was the new ruler of the Empire, ordered the execution of the Final Protocol. The Sith scientist Vul Isen executed the Final Protocol by infecting Dac's oceans with Viral spores that would eliminate all life on the planet within seven days. Three days after the Final Protocol was carried out, the Galactic Alliance starfighter squadron known as Rogue Squadron discovered that millions of beings had died, which prompted Admiral Gar Stazi to initiate a massive evacuation of the planet. Rawk joined the Galactic Alliance Remnant's Emergency evac fleet, and piloted his CR90 corvette to the docks of the recently captured city of Heurkea. He pledged to come back as many times as needed. Rawk and the evacuation fleet managed to save approximately twenty percent of the planet's population.\nIn 138 ABY, sometime after the evacuation of Dac and Darth Krayt's return to power, Rawk returned to the Jedi Temple on Taivas. Answering the call of the Jedi Council, he also reactivated as a Jedi for the duration of the war against the Sith, as he felt that the war had to be fought by all who could. He shared a holo conversation with his wife, who had also reactivated as a Kiffu Guardian after being summoned by Sheyf Vos, saying his goodbyes and professing his love for her. Later Cade and the Mynock crew arrived at the Temple to warn that the Sith had become aware of the Temple's existence. At first it was suggested that the Jedi flee while they could, however Cade then proposed a plan to lure the Sith into a trap which the Jedi, Roan Fel, and Gar Stazi agreed to. However, after the meeting, Rawk and Shado Vao confronted Cade about his plan as they did not like the idea of using younglings as bait; but Cade only reminded them that if they let Taivas become another Ossus then Darth Krayt would kill them to the last, younglings included.\nAs predicted, the Sith Imperial forces, Sith Lords as well as the Imperial Navy and Army, assaulted the Hidden Temple. Inside the Temple's premises Rawk fought the marauding Sith alongside his nephew, finally patching their relationship up. Rawk sent a signal to the Galactic Alliance Remnant, and Roan Fel's fleet to make the jump to Taivas to trap the Sith Imperial fleet against the planet. However none realized that they were falling right into Darth Krayt's own trap. When it seemed that victory was assured, Darth Nihl unleashed a legion of Darth Krayt's Sith troopers as well as the Sith Emperor's new capital ships and starfighters, all of which cut through their own ranks to complete their mission to destroy the Jedi and the allies.\nAlthough the Jedi suffered heavy casualties, uncle and nephew still knew they could deal a grievous blow to the Sith, and held out to defend Master T'ra Saa, who was immersed in battle meditation and had taken root deep into the planet. When it seemed that they both would die from a crashing Sith ship, Rawk pushed his nephew out of the area and into the water to save him, just as the ship crashed and exploded. Together in the Force, Masters Skywalker and Saa focused the life energy of Taivas and released it skyward in a devastating beam of light which destroyed a large number of Sith Imperial ships. Like his brother Kol eight years before him, Nat Skywalker had sacrificed his life to save his fellow Jedi as well as his nephew Cade.\nThe Human male Nat Skywalker felt that he could not live up to his family's name. He believed that his brother, Kol, was a natural leader and what people looked for in a Skywalker. When Skywalker met Cade's mother, Morrigan Corde, he deemed her to be secretive and not easy to get a sense of. After Kol brought Cade back to the Ossus Jedi Praxeum, Skywalker was willing to take care of Cade while his brother attended to Jedi business.\nRawk often berated his nephew when he felt that he had done or was going to do something stupid. When he spoke with the Jedi Council about his nephew's plan to assassinate Darth Krayt, Rawk opined that it was not a bad idea, even if Cade was slipping further toward the dark side. Rawk also felt that to ignore Krayt's genocide of the Mon Calamari was wrong. When Cade brought the injured Rae to Rawk after his successful assassination of Krayt, Rawk promised to his nephew that he would do whatever it took to save Rae's life. He was determined not to fail his nephew, encasing Rae in a life-preserving suit. After finding out that Cade had lied to Droo about Rae wanting to be healed, Rawk told his nephew to leave Kiffex in two days' time. Rawk's family meant everything to him. He adopted Droo's daughter Ahnah and a boy named Skeeto. After he and his family saved the Cathar Micah from slavers, Rawk adopted the boy as one of their own. When Jariah Syn tried to seduce Ahnah, Rawk attacked Syn, going so far as to shoot at the Mynock as Syn, Cade, and Blue fled Rawk's home. He believed in using caution and implored Cade to exercise this; however, he was still willing to help his nephew out by taking him to the Jedi's Hidden Temple. Rawk was unafraid to speak his mind and was reputed for being boisterous, traits that his family shared.\nRawk understood a variety of languages, including Galactic Basic Standard, Bocce, and Huttese. He possessed a blaster carbine and a blaster pistol that had both been modified, and also owned a comlink. When he rejoined the Jedi in the final stages of the war against Darth Krayt's empire, Rawk adorned a set of brown Jedi robes and utilized a lightsaber with a yellow crystal.\nLike most members of the Skywalker lineage, Rawk possessed a deep connection with the Force. He trained as a Jedi, and eventually rose to the rank of Jedi Master, although he later left the Order. Even after years of not using the Force, he managed to overpower Imperial Knight Azlyn Rae, despite the fact that he was unarmed while Rae had her lightsaber to his chest. Rawk was skilled with telekinetic Force powers, although his ability to use mind tricks had diminished, since his wife Droo forbade him from using mind tricks on their children.\nRawk was a gifted mechanic, as seen by his construction of his adopted son Micah's legs after he and his family rescued Micah from slavers. Rawk also helped build his nephew Cade Skywalker's ship, the Mynock. He designed a life-preserving suit intended for use by the Kiffu Guardians; he and Droo eventually used the suit to save Azlyn Rae's life. He also constructed the Rawk chopped special, a modified double-barreled blaster carbine that was Cade Skywalker's weapon of choice. Rawk subsequently supplied his nephew with upgraded versions of the carbine.\n\"Bantha\" Rawk was created by John Ostrander, the writer of the Star Wars: Legacy comic series. Rawk was first mentioned in 2006's Legacy  0, a resource comic that gave basic information on some of the characters, locations, and organizations of Legacy. A sketch of Rawk was featured in the same issue, although he was not identified as being the same character. Rawk was first explicitly identified in the 2008 resource comic Legacy  0½, and he later received an entry in 2009's Legacy Era Campaign Guide. Rawk was verified as the former Jedi Master Nat Skywalker in the twenty-third issue of Legacy. Rawk appeared in Legacy's Loyalties, The Hidden Temple, and Storms story arcs, as well as the standalone issue The Fate of Dac. Rawk was mentioned in The Complete Star Wars Encyclopedia's entry on the Rawk chopped special.\nAccording to an interview with John Ostrander and Jan Duursema, Rawk would make a difficult decision regarding his life and destiny in the upcoming miniseries Star Wars: Legacy—War, a follow-up series to the Star Wars: Legacy comic series. The third issue of the miniseries saw Rawk reclaim his identity of Nat Skywalker, and the character was killed in the fourth issue of Legacy—War. In all of his appearances in Legacy, Rawk was drawn by Jan Duursema.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Ossus/Legends",
  "/wiki/138_ABY",
  "/wiki/Taivas",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gray",
  "/wiki/Color/Legends",
  "/wiki/Skywalker_family/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Emergency_evac_fleet",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Kol_Skywalker",
  "/wiki/Cade_Skywalker",
  "/wiki/Time/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Kiffar/Legends",
  "/wiki/Droo_Rawk",
  "/wiki/Ahnah_Rawk",
  "/wiki/Skeeto_Rawk",
  "/wiki/Sith/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Planet/Legends",
  "/wiki/Hidden_Temple",
  "/wiki/130_ABY",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Massacre_at_Ossus",
  "/wiki/Death/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mynock_(Helot-class)",
  "/wiki/Cathar/Legends",
  "/wiki/Micah",
  "/wiki/Slavery/Legends",
  "/wiki/137_ABY",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Black_Sun/Legends",
  "/wiki/Skirmish_on_Iego",
  "/wiki/Rawk%27s_Nest",
  "/wiki/Iego/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Imperial_Knight",
  "/wiki/Azlyn_Rae",
  "/wiki/Assassin/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Battle_on_Had_Abbadon",
  "/wiki/Homeworld/Legends",
  "/wiki/Kiffex/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Kiffu_Guardians",
  "/wiki/Galactic_Alliance_Core_Fleet",
  "/wiki/Evacuation_of_Dac",
  "/wiki/Dac",
  "/wiki/Final_Protocol",
  "/wiki/Viral_spore",
  "/wiki/Standard_month/Legends",
  "/wiki/Attack_on_the_Hidden_Temple",
  "/wiki/T%27ra_Saa",
  "/wiki/Battle_meditation",
  "/wiki/Beam_of_light",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Morrigan_Corde",
  "/wiki/Jedi_Academy_(Ossus)",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Clan_Vos",
  "/wiki/127_ABY",
  "/wiki/Scout/Legends",
  "/wiki/Galactic_Rim",
  "/wiki/Zhar_system",
  "/wiki/Parent/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Rav",
  "/wiki/Feeorin/Legends",
  "/wiki/Crimson_Axe",
  "/wiki/Limb/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Selonian_Shipyards",
  "/wiki/Bounty/Legends",
  "/wiki/Zeltron/Legends",
  "/wiki/Deliah_Blue",
  "/wiki/Blaster/Legends",
  "/wiki/Rawk_chopped_special",
  "/wiki/Jariah_Syn",
  "/wiki/Ure%27monbarak",
  "/wiki/Swimming_pool",
  "/wiki/Skirmish_on_Vendaxa",
  "/wiki/Prince/Legends",
  "/wiki/Marasiah_Fel",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Duel_in_the_Temple_of_the_Sith",
  "/wiki/Temple_of_the_Sith",
  "/wiki/Hosk_Trey%27lis",
  "/wiki/Sith_training",
  "/wiki/Skirmish_at_the_Temple_of_the_Sith",
  "/wiki/Holovid/Legends",
  "/wiki/Massacre_of_New_Coral_City",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Genocide_on_Dac",
  "/wiki/Telekinesis/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Iego_system/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Gurlok",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Antares_Draco",
  "/wiki/Ganner_Krieg",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Shado_Vao",
  "/wiki/Skirmish_at_the_Hidden_Jedi_Temple",
  "/wiki/Wolf_Sazen",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Spy/Legends",
  "/wiki/K%27Kruhk",
  "/wiki/Tili_Qua",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Kiffu/Legends",
  "/wiki/Sheyf",
  "/wiki/Zharia_Vos",
  "/wiki/Rawk_compound",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Dark_transfer",
  "/wiki/Bacta/Legends",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Scientist/Legends",
  "/wiki/Vul_Isen",
  "/wiki/Ocean/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Pilot/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/City/Legends",
  "/wiki/Heurkea_Floating_City",
  "/wiki/Fleet/Legends",
  "/wiki/Darth_Krayt%27s_Sith_trooper",
  "/wiki/Dragon_ship",
  "/wiki/Annihilator-class_starfighter",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Bocce/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Brown",
  "/wiki/Jedi_apparel",
  "/wiki/Lightsaber_crystal",
  "/wiki/Force_power/Legends",
  "/wiki/Star_Wars_Insider_101",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/2006",
  "/wiki/Legacy_(2006)_0",
  "/wiki/2008",
  "/wiki/Legacy_(2006)_0%C2%BD",
  "/wiki/2009",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Legacy_(2006)_23",
  "/wiki/Star_Wars:_Legacy:_Loyalties",
  "/wiki/Star_Wars:_Legacy:_The_Hidden_Temple",
  "/wiki/Star_Wars:_Legacy:_Storms",
  "/wiki/Legacy_(2006)_47",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Legacy%E2%80%94War",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Legacy%E2%80%94War_4",
  "/wiki/Jan_Duursema",
  "/wiki/Legacy_(2006)_24",
  "/wiki/Legacy_(2006)_25",
  "/wiki/Legacy_(2006)_26",
  "/wiki/Legacy_(2006)_29",
  "/wiki/Legacy_(2006)_34",
  "/wiki/Legacy_(2006)_35",
  "/wiki/Legacy_(2006)_39",
  "/wiki/Legacy_(2006)_43",
  "/wiki/Legacy_(2006)_49",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Legacy%E2%80%94War_5",
  "/wiki/Category:Images_of_Rawk",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_121",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Legacy_(2006)_12",
  "/wiki/Legacy_(2006)_31",
  "/wiki/June_27",
  "/wiki/2020"
 ]
}