{
 "name": "Rayc_Ryjerd",
 "display_name": "Rayc Ryjerd",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bimm"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure"
     ]
    }
   ]
  }
 ],
 "content": "Rayc Ryjerd was a male Bimm smuggler and the son of the trader Rycar Ryjerd. He was considered to be even more of an idiot than his father. By 4 ABY, he had accumulated debts and began working for the crime lord Jabba the Hutt in an effort to pay them off. Ryjerd was present in Jabba's Palace that year when the Jedi Luke Skywalker arrived in order to bargain for the life of his friend Han Solo, and he was aboard Jabba's luxury sail barge, the Khetanna, when Jabba brought Skywalker and Solo to the Great Pit of Carkoon to be executed.\nThe male Bimm Rayc Ryjerd was born before 4 ABY to the trader Rycar Ryjerd. While working as a smuggler, he fell into debt after purchasing a starship and began working for the crime lord Jabba the Hutt in an effort to pay off his debts.\nBy 4 ABY, Ryjerd had become romantically involved with the Corellian gunrunner Laudica, who dated the Bimm against her better judgment. Both of them were present in the courtroom of Jabba's Palace on Tatooine in 4 ABY when the Jedi Luke Skywalker arrived in order to bargain for the life of his friend Han Solo, who was being held prisoner in the palace's dungeons. When Jabba dropped Skywalker into the palace's Rancor pit, Ryjerd and various other courtroom denizens watched from above as the Jedi did battle with Jabba's rancor. After Skywalker killed the creature, Jabba sentenced Skywalker, Solo, and Solo's companion Chewbacca to be thrown into Tatooine's Great Pit of Carkoon, where they would be eaten by a Sarlacc.\nThe Hutt brought many members of his court onto the Khetanna, a luxury sail barge, for the journey to the pit across the Dune Sea. Ryjerd was one such court member. During the voyage, the drink-serving astromech droid R2-D2 spilled liquid on Ryjerd after being bumped into by the protocol droid C-3PO. When the Khetanna arrived at the Sarlacc pit, Skywalker and his friends made a last stand, and the Khetanna was destroyed.\nRyjerd was a dishonest smuggler and was considered to be an idiot, even more so than his father. Although he was romantically involved with Laudica, she considered the arrangement to be contrary to her better judgment. He was, however, a skilled starship pilot, able to counter the Tallon Roll maneuver. Ryjerd sported a cap and had brown hair and a mustache. He watched and jeered in delight when Skywalker battled Jabba's pet rancor.\nRayc Ryjerd first appeared as an extra in Richard Marquand's 1983 film Star Wars: Episode VI Return of the Jedi, in which he was played by an uncredited actor. The Jabba's Palace Limited expansion set of the Decipher, Inc. Star Wars Customizable Card Game, released in 1998, included a card of the character that gave him a name and biographical details, with the name simultaneously being used on a separate card for Laudica. According to a Star Wars CCG fan site, Rayc and Rycar Ryjerd were named as anagrams of Decipher game designer Jerry Darcy, with the latter's name having an extra \"R\" added.\nRyjerd is not mentioned in the magazine article Who's Who in Jabba's Palace, which was published in the sixtieth issue of Star Wars Insider. The article does, however, include an illustration of Jabba's chef Porcellus which greatly resembles the cap-wearing, mustachioed Ryjerd rather than the clean-shaven Porcellus depicted in the video game Star Wars Galaxies.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bimm_(Near-Human)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Rycar_Ryjerd/Legends",
  "/wiki/Parent/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Siege_of_Jabba%27s_Palace",
  "/wiki/Han_Solo/Legends",
  "/wiki/Luxury-class_sail_barge",
  "/wiki/Khetanna/Legends",
  "/wiki/Great_Pit_of_Carkoon/Legends",
  "/wiki/Death/Legends",
  "/wiki/Rayc_Ryjerd%27s_starship",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Corellian/Legends",
  "/wiki/Laudica",
  "/wiki/Tatooine/Legends",
  "/wiki/Rescue_of_Han_Solo/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Jabba%27s_rancor",
  "/wiki/Chewbacca/Legends",
  "/wiki/Sarlacc/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Battle_of_the_Great_Pit_of_Carkoon",
  "/wiki/Starship/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Tallon_Roll/Legends",
  "/wiki/Hat/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Richard_Marquand",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1998",
  "/wiki/Tuckerization",
  "/wiki/Jerry_Darcy",
  "/wiki/Who%27s_Who_in_Jabba%27s_Palace",
  "/wiki/Star_Wars_Insider_60",
  "/wiki/Star_Wars_Insider",
  "/wiki/Porcellus/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Manga:_Return_of_the_Jedi_1",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_134",
  "/wiki/A_Star_Wars_Family_Legacy",
  "/wiki/Star_Wars_Insider_141",
  "/wiki/Star_Wars_Magazine",
  "/wiki/Take_a_Tour_of_Jabba%27s_Palace!",
  "/wiki/Star_Wars_Magazine_2",
  "/wiki/Premiere_Limited",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/August_15",
  "/wiki/2005",
  "/wiki/April_6",
  "/wiki/2016",
  "/wiki/StarWars.com"
 ]
}