{
 "name": "Razoo Qin-Fee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Kanji"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Eravana"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.65 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tanned"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kanjiklub"
     ]
    }
   ]
  }
 ],
 "content": "Razoo Qin-Fee was a human male from the planet Nar Kanji, who served as a lieutenant in the criminal gang Kanjiklub around 30 years after the Battle of Endor. He was a pyromaniac and technical expert and was in charge of assembling and maintaining Kanjiklub's wide range of weapons and armors. The underground Zygerrian fighting circuit expelled Qin-Fee for cheating. He carried a \"Wasp\" blaster rifle for use in battle.\nHe and the other gang members and the Guavian Death Gang confronted the smuggler Han Solo over fifty thousand credits he owed them on board the Baleen-class heavy freighter Eravana. The two gangs realized that Solo was also transporting the astromech droid BB-8 and two fugitives from the First Order on board the freighter and began searching for them, but were interrupted and prevented from killing Solo when three rathtars, Solo's inadvertently released cargo, attacked both groups.\nThough not one to shy away from a fight, Qin-Fee wisely decided that this foe was beyond his capabilities and promptly ran for his life, but was ultimately caught and devoured. In the confusion created by the rathtars, Solo and the fugitives managed to escape from the Eravana.\nRazoo Qin-Fee was a native of the planet Nar Kanji who was banned from the underground Zygerrian fighting circuit for cheating, despite the fact that the sport lacked any rules. He became a member of the criminal Kanjiklub gang who operated out of Nar Kanji, and by thirty years after the Battle of Endor, served as a lieutenant and second-in-command to the gang's topboss Tasu Leech. Qin-Fee was responsible for the maintenance of the gang's mismatched weapons and armor, and regularly modified them to the other gang members specifications.\nAfter the Kanjiklub gang defeated forces of the Guavian Death Gang during the skirmish in the Cronese Mandate, Qin-Fee obtained the Smuggler's Guide that was previously owned by Bala-Tik and wrote an entry in it, where he claimed that the train of freighters containing items they stole stretched back to Foran Tutha. Later in the book he described how they once fought at the Chasidron Shoals where they \"knocked their challengers stupid\" and threatened Black Sun, Crymorah Syndicate and Crimson Dawn as being next, citing that Hutts are already \"spiraling into a crash\" and that Kanjiklub will make sure there are no survivors. Tasu Leech ordered that Kanjiklub should make a deal with the weapon makers and that they'll set off to Cantonica in the morning, which Qin-Fee recorded. However, the Smuggler's Guide was stolen from the Kanjiklub chief by the Master Codebreaker in the middle of negotiations for the domination of Rim territories.\nAfter the Kanjiklub leant the smugglers Han Solo and Chewbacca fifty thousand credits to capture rathtars for King Prana, Qin-Fee was amongst a group of gang members who accompanied Leech to reclaim the loan from Solo. The gang boarded Solo's Baleen-class heavy freighter Eravana above the planet Jakku, and found Solo in the ship's airlock arguing with the Guavian Death Gang, another criminal faction he had borrowed from. Leech and Bala-Tik, leader of the Death Gang, both demanded their money back from the smugglers, but then took interest in the astromech droid BB-8, who was stood with Solo and matched the description of a droid the First Order were looking for alongside two fugitives. Suspecting the fugitives were also onboard, Qin-Fee stepped forward and another member of Kanjiklub began searching the airlock with an illuminator.\nAs the criminals searched, Solo attempted to stall for time by claiming the droid was his and not the one being searched for, but Bala-Tik saw through the lie and demanded that Solo hand over BB-8 and the fugitives. Qin-Fee offered the alternative that Solo simply die, which earned a laugh from several other criminals, before the lights of the airlock corridor began flickering, accompanied by unearthly noises. Uncertain of this new development, the Death Gang and Kanjiklub prepared to kill Solo and Chewbacca and take the droid, but were interrupted when both criminal factions were attacked from behind by the rathtars, which had accidentally been let loose by the scavenger Rey and the former stormtrooper Finn; the fugitives that the criminals were searching for.\nQin-Fee fled down the corridor away from the rathtar, but paused when he passed a pair of Guavians fleeing in the opposite direction. He then hailed another Kanjiklub member to approach him, but quickly decided to follow the Guavians after the gang member was grabbed by a rathtar. He then encountered another two Kanjiklub members and briefly conversed with them, deciding to avoid both ends of the airlock and head down a third corridor. His comrades were then devoured by another rathtar and Qin-Fee was forced to flee alone in the opposite direction from the Kanjiklub's starship, leaving his only hope of survival to circle back around and avoid the rathtars. This strategy failed to save Qin-Fee, who was devoured by the rathtars along with all of his comrades on board. Solo, Chewbacca and the fugitives managed to escape the Eravana onboard the YT-1300 light freighter the Millennium Falcon, killing one of the three rathtars on the heavy freighter as they left.\nQin-Fee was an unpleasant human male pyromaniac and technological expert. While fleeing the rathtars on the Eravana, he was terrified for his life, only taking solace in the fact that Solo would most likely be killed by the beasts. He wore his black hair in a Zygerrian-style faux crest and had brown eyes and tanned skin.\nWhile onboard the Eravana, Qin-Fee a set of patchwork armor including a bandolier of homemade explosive cylinders and a pair of insulated palm sparring gloves. He used a \"Wasp\" blaster rifle in combat and carried an illuminator.\nRazoo Qin-Fee was portrayed by Iko Uwais in Star Wars: Episode VII The Force Awakens, which names him as \"Razoo Quin-Fee\" in the credits. He had no dialogue in the film, but received lines in its novelization written by Alan Dean Foster, also briefly serving as a point of view character. There are several discrepancies between the amount of dialogue in the novel and the film, but as Qin-Fee's line takes place at a time in the novel which does not contradict the timeline of the conversation in the film, this article assumes it is canonical.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Poe_Dameron_9",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Nar_Kanji",
  "/wiki/34_ABY",
  "/wiki/Eravana",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Kanjiklub",
  "/wiki/Planet",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/Battle_of_Endor",
  "/wiki/Armor",
  "/wiki/Underground_Zygerrian_fighting_circuit",
  "/wiki/%22Wasp%22_blaster_rifle",
  "/wiki/Guavian_Death_Gang",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Credit",
  "/wiki/Baleen-class_heavy_freighter",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/First_Order",
  "/wiki/Freighter",
  "/wiki/Death",
  "/wiki/Rathtar",
  "/wiki/Standard_year",
  "/wiki/Topboss",
  "/wiki/Tasu_Leech",
  "/wiki/Skirmish_in_the_Cronese_Mandate",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Bala-Tik",
  "/wiki/Thief",
  "/wiki/Foran_Tutha",
  "/wiki/Book",
  "/wiki/Chasidron_Shoals",
  "/wiki/Black_Sun",
  "/wiki/Crymorah_Syndicate",
  "/wiki/Crimson_Dawn",
  "/wiki/Hutt",
  "/wiki/Cantonica",
  "/wiki/Unidentified_Kanjiklub_chief",
  "/wiki/Master_Codebreaker",
  "/wiki/Chewbacca",
  "/wiki/King",
  "/wiki/Grevoth_Prana_IX",
  "/wiki/Jakku",
  "/wiki/Starship",
  "/wiki/Droid",
  "/wiki/Scavenger",
  "/wiki/Rey_Skywalker",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Finn",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Hair",
  "/wiki/Zygerrian",
  "/wiki/Eye",
  "/wiki/Bandolier",
  "/wiki/Glove/Legends",
  "/wiki/Iko_Uwais",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Alan_Dean_Foster",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens_Adaptation_2",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2012_Topps_Star_Wars_Galactic_Files_Series_1",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/2015_Topps_Star_Wars:_The_Force_Awakens_Series_1",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Databank_(website)"
 ]
}