{
 "name": "RC-1138",
 "display_name": "RC-1138",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Delta Squad",
      "Delta Squad"
     ]
    }
   ]
  }
 ],
 "content": "RC-1138, also known by his nickname \"Boss,\" was an elite clone commando sergeant who led the elite special forces Delta Squad during the Clone Wars, serving with commandos RC-1140, RC-1207, and RC-1262. Delta Squad, under RC-1138's leadership, participated in some of the war's most dangerous missions.\nRC-1138, eventually nicknamed \"Boss,\" was grown on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the clone trooper army, RC-1138 served as a clone commando within the Grand Army of the Republic, and he participated in the pan-galactic Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, serving as the leader of the special forces unit Delta Squad with the military rank of Clone Sergeant.\nSergeant RC-1138 and Delta Squad, which included second-in-command RC-1140, RC-1207, and RC-1262, participated in some of the war's most dangerous missions. At one point, he and his squad were fielded into a battle from a LAAT/i with the mission of taking control of a location. Boss and his squad were also dispatched to the planet Devaron in the aftermath of the massacre and recovered the bodies of Jedi Master Halsey and his Padawan, Knox, and returned them to Coruscant. The squad was met on the landing platform by Jedi Council members Obi-Wan Kenobi, Plo Koon, Saesee Tiin, and Adi Gallia, who noted that the massacre was of similar caliber of the damage done by Asajj Ventress who was presumed dead. Security footage of the battle was recovered and included a hologram of Halsey's death at the hands of an as-yet unknown assassin.\nAs a human male clone of Jango Fett, RC-1138 was 1.83 meters in height, or six feet, and was born on the planet Kamino.\nAs a clone commando and as a sergeant, RC-1138 was an elite soldier and had many abilities and training. These abilities included leadership skills, armed and unarmed combat, military tactics, infiltration, reconnaissance, sniper skills, and jetpack training.\nWhile on duty, RC-1138 was equipped with unique Katarn-class Commando Armor that was painted in orange and white, and was outfitted with a backpack. During combat, RC-1138 utilized two DC-17 hand blasters.\nRC-1138 \"Boss\" first appeared in the new Star Wars canon in season three episode \"Witches of the Mist\" of Star Wars: The Clone Wars that released on January 21, 2011. Supervising Director Dave Filoni requested that the team incorporate Delta Squad into the plot during the episode's development. RC-1138 first appeared in the 2005 Star Wars Legends video game Star Wars: Republic Commando. RC-1138's nickname, \"Boss,\" was established in the accompanying episode guide for \"Witches of the Mist,\" while the designation number, RC-1138, was established in the 2021 canon reference book Star Wars: The Clone Wars: Character Encyclopedia - Join the Battle! by Jason Fry. RC-1138's designation is another instance of 1138 being used in Star Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/RC-1138",
  "/wiki/RC-1138/Legends",
  "/wiki/Clone_commando",
  "/wiki/1138",
  "/wiki/Boss_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Galactic_Republic",
  "/wiki/Delta_Squad",
  "/wiki/Clone_Sergeant",
  "/wiki/Special_forces",
  "/wiki/Clone_Wars",
  "/wiki/Commando",
  "/wiki/RC-1140",
  "/wiki/RC-1207",
  "/wiki/RC-1262",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Jango_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/Clone_trooper",
  "/wiki/Army",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Military_rank",
  "/wiki/Squad",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Devaron",
  "/wiki/Devaron_massacre",
  "/wiki/Jedi_Master",
  "/wiki/Halsey",
  "/wiki/Padawan",
  "/wiki/Knox",
  "/wiki/Coruscant",
  "/wiki/Jedi_High_Council",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Adi_Gallia",
  "/wiki/Asajj_Ventress",
  "/wiki/Death",
  "/wiki/Hologram",
  "/wiki/Savage_Opress",
  "/wiki/Assassin",
  "/wiki/Jetpack",
  "/wiki/Katarn-class_Commando_Armor",
  "/wiki/Color",
  "/wiki/Backpack",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Star_Wars",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/January_21",
  "/wiki/2011",
  "/wiki/Dave_Filoni",
  "/wiki/2005",
  "/wiki/Star_Wars_Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Republic_Commando",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Jason_Fry",
  "/wiki/1138_(easter_egg)",
  "/wiki/Category:Images_of_RC-1138",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Spark_of_Hope",
  "/wiki/Databank_(website)",
  "/wiki/Trooper"
 ]
}