{
 "name": "RC-1140",
 "display_name": "RC-1140",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Delta Squad",
      "Delta Squad"
     ]
    }
   ]
  }
 ],
 "content": "RC-1140, nicknamed \"Fixer,\" was an elite clone commando of the Galactic Republic who served as the second-in-command of Delta Squad, a special forces unit within the Grand Army of the Republic that was active during the Clone Wars. RC-1140 served as the squad's second-in-command following Clone Sergeant RC-1138. Delta Squad participated in some of the most dangerous missions of the war, including retrieving the bodies of Jedi General Halsey and Padawan Knox.\nRC-1140, nicknamed \"Fixer,\" was clone grown on the planet Kamino from the DNA of the bounty hunter Jango Fett, who became the template of the clone trooper army, RC-1140 served as a clone commando within the Grand Army of the Republic, and was known as \"Fixer\" because of his skills as a slicer. He participated in the pan-galactic Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, serving as the second-in-command of the special forces unit Delta Squad.\nDelta Squad participated in some of the war's most dangerous missions. At one point, RC-1140 and his squad-mates were tasked with securing territory and deployed directly from a Low Altitude Assault Transport/infantry gunship to enter the battle. In another instance, RC-1140 and the rest of Delta Squad were dispatched to the planet Devaron in the aftermath of the massacre that took place there and recovered the bodies of Jedi General Halsey and Padawan Knox, and returned them to Coruscant. The squad was met on the landing platform by Jedi High Council members Obi-Wan Kenobi, Plo Koon, Saesee Tiin, and Adi Gallia, who noted that the massacre was of similar caliber of the damage done by Asajj Ventress who was presumed dead. Security footage of the battle was recovered and included a hologram of Halsey's death at the hands of Savage Opress, who was unknown to the Jedi and the Republic at that time.\nAs a human male clone of Jango Fett, RC-1140 was 1.83 meters in height, or six ft, and was born on the planet Kamino. RC-1140 was considered to be quiet, grim, and focused on following regulations to the point that he used his comrades' operating numbers during missions.\nAs a clone commando, RC-1140 was an elite soldier and had many abilities and training. These abilities included slicer skills, armed and unarmed combat, military tactics, infiltration, reconnaissance, mechanical repairs, and jetpack training.\nWhile on duty, RC-1140 was equipped with unique Katarn-class Commando Armor that was painted in green and white, and was outfitted with a backpack. During combat, RC-1140 utilized a DC-17m Interchangeable Weapon System.\nRC-1140 \"Fixer\" first appeared in the new canon in season three episode \"Witches of the Mist\" of Star Wars: The Clone Wars that was released on January 21, 2011. RC-1140 first appeared in the 2005 Star Wars Legends video game Star Wars: Republic Commando. RC-1140's nickname, \"Fixer,\" was identified in the episode guide for \"Witches of the Mist,\" while his designation number, RC-1140, was established in the 2021 canon reference book Star Wars: The Clone Wars: Character Encyclopedia - Join the Battle!, authored by Jason Fry.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/RC-1140",
  "/wiki/RC-1140/Legends",
  "/wiki/Fixer",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Galactic_Republic",
  "/wiki/Delta_Squad",
  "/wiki/Clone_commando",
  "/wiki/Special_forces",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Squad",
  "/wiki/Clone_Sergeant",
  "/wiki/RC-1138",
  "/wiki/Jedi_General",
  "/wiki/Halsey",
  "/wiki/Padawan",
  "/wiki/Knox",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Clone_template",
  "/wiki/Clone_trooper",
  "/wiki/Army",
  "/wiki/Slicer",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Gunship",
  "/wiki/Surface_warfare",
  "/wiki/Devaron",
  "/wiki/Devaron_massacre",
  "/wiki/Coruscant",
  "/wiki/Jedi_High_Council",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Adi_Gallia",
  "/wiki/Asajj_Ventress",
  "/wiki/Savage_Opress",
  "/wiki/Time",
  "/wiki/Operating_number",
  "/wiki/Jetpack",
  "/wiki/Katarn-class_Commando_Armor",
  "/wiki/Color",
  "/wiki/Backpack",
  "/wiki/DC-17m_Interchangeable_Weapon_System",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/January_21",
  "/wiki/2011",
  "/wiki/2005",
  "/wiki/Star_Wars_Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Republic_Commando",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Jason_Fry",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Spark_of_Hope",
  "/wiki/Category:Images_of_RC-1140",
  "/wiki/Databank_(website)",
  "/wiki/Trooper"
 ]
}