{
 "name": "RC-1570",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Skye"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Thyrsian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Control bands"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicSpecial Operations BrigadeTark Squad",
      "Special Operations BrigadeTark Squad",
      "Tark Squad",
      "Zeta Magnus' Empire"
     ]
    }
   ]
  }
 ],
 "content": "Nilo, designated RC-1570 was a clone commando and captain of the elite clone commando squad known as Tark Squad, which was part of the Special Operations Brigade of the Galactic Republic in 21 BBY. Nilo was nicknamed by his genetic template and trainer Sarsius Torne after the Thyrsian letter for zero.\nRC-1570, nicknamed \"Nilo,\" was a clone commando and the squad leader of the Galactic Republic Tark Squad. In actuality, Captain Nilo and his squad were Thyrsian mercenaries trained by Sarsius Torne of the Sun Guards to infiltrate the Grand Army of the Republic as part of a deal made with Zeta Magnus and Palpatine to recover Anakin Skywalker. To ensure obedience Nilo was implanted with a cybernetic control band. In 21 BBY, Captain Nilo and his squad were sent to assist Jedi General Obi-Wan Kenobi in liberating the planet Skye from Zeta Magnus while being disguised as a relief team.\nCaptain Nilo and the rest of the liberation team snuck into Zeta Magnus' fortress through Entyrmion's subterranean tunnel system located beneath the fortress. While in the cave, the liberation team was attacked by multiple Oskan blood eaters created by Zeta Magnus which killed many of their S'kytri guides as well as the Lord of the S'Kytri Highland Clans, Lord Klarymére. Nilo killed the blood eaters with a Class-D detonator which angered Obi-Wan, as he believed it was \"affront to the force\". When the liberation team arrived in Zeta Magnus' fortress, Nilo and the rest of Tark Squad led the Jedi Commanders into a field of R-TechApp Man Traps that magnetised his Jedi Commanders to the ground. Nilo and his squad revealed to the Jedi Commanders that they were allied with Zeta Magnus and left them to be tortured by Zeta Magnus and his torture droid. Nilo was killed in the fortress when he was vaporised by a Class-D detonator used by Jedi Commanders Anakin Skywalker and Halagad Ventor after he and his squad attempted to betray them.\nNilo wore specialised silver Katarn-class commando armor with a pauldron to distinguish himself from the rest of his squad. Nilo used a DC-17m interchangeable rifle, he was also equiped with Class-D detonators which were supposed to be outlawed under galactic law.\nNilo shares his name with Nilo Rodis-Jamero, creator of the Emperor's Royal Guard concept art from which Zeta Magnus' appearance was drawn.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Skye/Legends",
  "/wiki/Thyrsian",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Special_Operations_Brigade/Legends",
  "/wiki/Tark_Squad",
  "/wiki/Dark_Worlds",
  "/wiki/Clone_commando/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/Sarsius_Torne",
  "/wiki/Thyrsian_(language)",
  "/wiki/Squad/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Sun_Guard",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Zeta_Magnus",
  "/wiki/Palpatine/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Skye",
  "/wiki/Kharys%27_fortress",
  "/wiki/Entyrmion",
  "/wiki/Oskan_blood_eater",
  "/wiki/S%27kytri",
  "/wiki/Lord/Legends",
  "/wiki/Klarym%C3%A9re",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/R-TechApp_Man_Trap",
  "/wiki/Torture/Legends",
  "/wiki/Blue-Tark",
  "/wiki/Death/Legends",
  "/wiki/Class-D_annihilation",
  "/wiki/Halagad_Ventor",
  "/wiki/Katarn-class_commando_armor",
  "/wiki/Pauldron/Legends",
  "/wiki/DC-17m_Interchangeable_Weapon_System/Legends",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/StarWars.com"
 ]
}