{
 "name": "RC-1573",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Skye"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Thyrsian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Control bands"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicSpecial Operations BrigadeTark Squad",
      "Special Operations BrigadeTark Squad",
      "Tark Squad",
      "Zeta Magnus' Empire"
     ]
    }
   ]
  }
 ],
 "content": "Kupe, designated RC-1573 was a Republic commando and member of the elite clone commando squad led by Captain Nilo known as Tark Squad, which was part of the Special Operations Brigade of the Galactic Republic in 21 BBY. Kupe was nicknamed by his genetic template and trainer Sarsius Torne after the Thyrsian letter for three.\nRC-1573, nicknamed \"Kupe,\" was a Republic commando and a of the Galactic Republic Tark Squad. In actuality, Kupe and his squad were Thyrsian mercenaries trained by Sarsius Torne of the Sun Guard to infiltrate the Grand Army of the Republic as part of a deal made with Zeta Magnus and Palpatine to recover Anakin Skywalker. To ensure obedience Kupe was implanted with a cybernetic control band. In 21 BBY, Kupe and his squad were sent to assist Jedi General Obi-Wan Kenobi in liberating the planet Skye from Zeta Magnus while disguised as a relief team. Kupe's curious nature and fascination with his Jedi Commanders led Jedi Knights Halagad Ventor and Anakin Skywalker to become quite fond of him during their mission on Skye.\nKupe and the rest of the liberation team snuck into Zeta Magnus' fortress through Entyrmion's subterranean tunnel system located beneath the fortress.While in the cave, the liberation team was attacked by multiple Oskan blood eaters created by Zeta Magnus which killed many of their S'kytri guides as well as the Lord of the S'kytri Highland Clans, Lord Klarymére. The commando squad was able to kill the blood eaters with a Class-D detonator which angered Obi-Wan, as he believed it was \"affront to the force\". When the liberation team arrived in Zeta Magnus' fortress, Nilo and the rest of Tark Squad led the Jedi commanders into a field of R-TechApp Man Traps. Kupe and his squad revealed to the Jedi Commanders that they were allied with Zeta Magnus and left them to be tortured by Zeta Magnus and his torture droid. Kupe was killed in the fortress by Anakin Skywalker when Anakin used the force to collapse a wall onto Kupe to crush him.\nKupe wore specialised Katarn-class commando armor with a silver finish like the rest of his squad. Kupe used a DC-17m interchangeable rifle with a Grappling spike launcher attachment and a Vibroknife.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Skye/Legends",
  "/wiki/Thyrsian",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Special_Operations_Brigade/Legends",
  "/wiki/Tark_Squad",
  "/wiki/Dark_Worlds",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Halagad_Ventor",
  "/wiki/Republic_commando",
  "/wiki/Clone_commando",
  "/wiki/Clone_Captain",
  "/wiki/RC-1570",
  "/wiki/Galactic_Republic",
  "/wiki/21_BBY",
  "/wiki/Sarsius_Torne",
  "/wiki/Thyrsian_(language)",
  "/wiki/Mercenary/Legends",
  "/wiki/Sun_Guard",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Zeta_Magnus",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Skye",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kharys%27_fortress",
  "/wiki/Entyrmion",
  "/wiki/Oskan_blood_eater",
  "/wiki/S%27kytri",
  "/wiki/Lord/Legends",
  "/wiki/Klarym%C3%A9re",
  "/wiki/R-TechApp_Man_Trap",
  "/wiki/Torture/Legends",
  "/wiki/Blue-Tark",
  "/wiki/Death/Legends",
  "/wiki/Katarn-class_commando_armor",
  "/wiki/DC-17m_Interchangeable_Weapon_System/Legends",
  "/wiki/Grappling_spike_launcher",
  "/wiki/Vibroknife",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story"
 ]
}