{
 "name": "Reath Silas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 249 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Supreme Coronet City Diplomat Protection"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jora Malli",
      "Cohmac Vitus"
     ]
    }
   ]
  }
 ],
 "content": "Reath Silas was a human male Jedi Knight who lived during the High Republic Era. The apprentice of Jedi High Council member Jora Malli, most of his apprenticeship had been spent on Coruscant or in high-level diplomatic meetings, before Malli was appointed the commander of the Jedi quarter aboard the new space station Starlight Beacon. Silas was subsequently assigned to the station with his master, a move that did not please him since he preferred spending his time in the Jedi Archives instead of partaking in adventures away from Coruscant. Nonetheless, he was sent out to the galactic frontier along with Jedi Master Cohmac Vitus and Jedi Knights Orla Jareni and Dez Rydan, the starship they were traveling on, the Byne Guild transport Vessel, was knocked out of hyperspace as part of the Great Hyperspace Disaster, and he and his fellow travelers were stranded at an abandoned space station.\nAs the various ships in the area began to land at the station, the Vessel moved to help a small, thrown together ship that was having problems. Upon helping them to the station, Silas and the others met the two passengers, the young girl Nan and her companion, an older Zabrak named Hague. After learning of the death of his master during the Battle of Kur, he requested for Vitus to become his new master, which the older Jedi accepted. Following the battle on Corellia, Vitus knighted Silas. To Silas' surprise, Vitus then gifted his former apprentice his lightsaber, as Vitus revealed he was leaving the Jedi Order.\nReath Silas was an adolescent human male with short, brown hair, brown eyes, and light skin. His physical appearance was considered attractive according to Cohmac Vitus, a fact that endeared Silas to the Nihil member Nan. His hair was tied into a Padawan braid. Although it was later ripped out by a Wookiee infant, it was later retied. Given that the Jedi Order did not allow its members to begin romantic relationships, Silas struggled with how he often developed crushes on women his age. Having realized trying to deny his romantic feelings always failed him, he elected to let himself develop his crushes and to deal with them as they arose.\nReath Silas was a studious young Jedi who loved to learn about ancient history. He preferred reading in the Jedi Archives as opposed to the fantastical adventures that many of his fellow Padawans yearned for. As such, he was not excited to be stationed at the Starlight Beacon with his master. He was friends with Dez Rydan, who had been Master Malli's Padawan before him, which made his peers jealous. After Malli's death during the Great Disaster, Silas decided to travel to Starlight nonetheless, accepting that Malli thought it was best for him and wanting to comply with his master's final wishes.\nAs a Jedi Padawan, Reath Silas had a connection to the Force. Like many other Force-sensitives, with this connection, Silas was granted many notable abilities. Silas had shown the ability to use telekinesis, such as when he assisted Affie Hollow by steadying her balance without touching her, or clearing a hallway of fire and smoke with a Force push. The Force also granted him the ability to jump very high; many meters in to the air with little effort. Despite these abilities, Reath himself noted that, relative to other Jedi, his connection to the Force was not particularly strong. He regularly struggled with influencing minds, and did not experience Force-related sensations and emotions as strongly as others. Despite this, he still showed great proficiency over abilities like Force push and even partook in a binding ritual.\nSilas was capable with a lightsaber, achieving very high marks during his training at the Jedi Temple. He was able to fend off attacks from a Drengir-influenced Dez Rydan for a short time. Aside from his combative and Force-related abilities, Reath had basic engineering skills and was capable of piloting speeders with considerable skill. Due to his many hours spent studying in the Jedi Archives, Silas knew of many historical events and cultures, including the Amaxine warriors.\nReath Silas was created by Claudia Gray for the Star Wars: The High Republic multimedia project. He was first mentioned in the novel The High Republic: Light of the Jedi, written by Charles Soule and released on January 5, 2021, and debuted in the young-adult novel The High Republic: Into the Dark, written by Claudia Gray and published on February 2 of the same year. The character was first pictured on the cover of Into the Dark when it was showcased to the public during the reveal of the Star Wars: The High Republic project on February 24, 2020 and was identified as Reath Silas by Claudia Gray during an episode of The Star Wars Show released on YouTube two days later.\nGray derived the character's surname from a fan who suggested using his son's first name as the name of a Star Wars character. In an interview, she described Silas as a Jedi who adhered more closely to the rules than his peers and who took a more cerebral approach to the Force than an instinctual one. While developing him, the author drew inspiration from Hermione Granger, a character from the Harry Potter book series. Gray wanted Silas to be a Jedi whose skill stemmed from hard work rather than natural talent.\nDaniel José Older, the author of the young-adult novel The High Republic: Midnight Horizon, revealed in an interview that he found Reath Silas the most challenging character to write in his book. He felt that his style of writing wasn't suited to Silas's personality, and as such struggled at times when writing dialogue for the character. For the more important moments in the novel, Older consulted Gray when writing Silas's characterization and storyline.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Padawan",
  "/wiki/Jora_Malli",
  "/wiki/Stam_Reath",
  "/wiki/Echuu_Shen-Jon",
  "/wiki/Padawan/Legends",
  "/wiki/Silas",
  "/wiki/Coruscant",
  "/wiki/249_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Supreme_Coronet_City_Diplomat_Protection",
  "/wiki/Cohmac_Vitus",
  "/wiki/Jedi_Knight",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_High_Council",
  "/wiki/Commander",
  "/wiki/Jedi",
  "/wiki/Space_station",
  "/wiki/Starlight_Beacon",
  "/wiki/Jedi_Archives",
  "/wiki/Galactic_Frontier",
  "/wiki/Jedi_Master",
  "/wiki/Orla_Jareni",
  "/wiki/Dez_Rydan",
  "/wiki/Starship",
  "/wiki/Byne_Guild",
  "/wiki/Vessel",
  "/wiki/Hyperspace",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Amaxine_space_station",
  "/wiki/Nan",
  "/wiki/Zabrak",
  "/wiki/Hague",
  "/wiki/Battle_of_Kur",
  "/wiki/Battle_on_Corellia",
  "/wiki/Cohmac_Vitus%27_lightsaber",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Padawan_braid",
  "/wiki/Wookiee",
  "/wiki/Unidentified_Wookiee_infant",
  "/wiki/The_Force",
  "/wiki/Force-sensitive",
  "/wiki/Telekinesis",
  "/wiki/Affie_Hollow",
  "/wiki/Force_push",
  "/wiki/Mind_trick",
  "/wiki/Force_binding",
  "/wiki/Lightsaber",
  "/wiki/Drengir",
  "/wiki/Engineer",
  "/wiki/Pilot",
  "/wiki/Speeder",
  "/wiki/Amaxine_warriors",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Reath_Silas",
  "/wiki/Claudia_Gray",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Charles_Soule",
  "/wiki/January_5",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/February_2",
  "/wiki/February_24",
  "/wiki/2020",
  "/wiki/The_Star_Wars_Show",
  "/wiki/February_26",
  "/wiki/Star_Wars",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic_(2021)_4",
  "/wiki/The_High_Republic_(2021)_8",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Midnight_Horizon_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/Category:Images_of_Reath_Silas",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY",
  "/wiki/February_17"
 ]
}