{
 "name": "Rebb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ferren Barr's disciples"
     ]
    }
   ]
  }
 ],
 "content": "Rebb was a female human who was on the planet Mon Cala along with Jedi Padawan Ferren Barr and five other acolytes of Barr's one year into the reign of the Galactic Empire. Darth Vader and three Inquisitors went to Mon Cala in search of Barr and found them as they vacated their refuge. They were chased to Bel City where she and Stell stayed to hold off Vader and the Inquisitors.\nShortly after the Clone Wars, Rebb and Stell watched from their home as the Galactic Empire moved in to occupy their city. They condemned the Empire and decided that they would not live under such conditions. Eventually, they met Jedi Padawan Ferren Barr, who stylized himself as a Jedi Master, in a cantina and recruited them into his group of acolytes.\nBy 18 BBY, Barr and his acolytes were based in a cave refuge on Mon Cala where Barr served as a secret advisor to King of Mon Cala Lee-Char. During Barr's tenure as advisor, he guided King Lee-Char in trade negotiations with Imperial Ambassador Telvar. The techniques used in the negotiations caught the attention of Emperor Darth Sidious, who sent his Sith apprentice Darth Vader, three inquisitors, a squad of Purge Troopers to Mon Cala, and Moff Wilhuff Tarkin in his flagship, the Sovereign.\nUpon the arrival of Vader and the Inquisitors, Telvar was assassinated, and in response, Moff Wilhuff Tarkin dispatched Major Rantu and his forces down to Mon Cala, resulting in a planet-wide war. When Lee-Char informed Barr about Vader's presence, he recognized that it was the former Jedi Knight Anakin Skywalker. After informing the group, including Rebb, that Skywalker—the Chosen One who was believed by some to bring balance to the Force—was fighting on Mon Cala, Barr explained to them how the Jedi Order onced believed in him, and how he betrayed and destroyed them. Rebb wanted to avenge the Jedi and kill Vader, but Barr had other ideas for the time being.\nIn the aftermath of the Battle of Dac City, Barr was informed by Lee-Char that Vader discovered their hideout and was likely coming for them. Barr immediately ordered his acolytes to evacuate and ordered his droid, Endee, to self-destruct. Upon leaving the refuge, they encountered Vader and his Inquisitors in an Imperial submarine and immediately scattered, heading towards the nearby Bel City. One of the acolytes, however, Nipaltoo, vectored towards Vader's submarine and attacked, only to have his helmet crushed by the Sith Lord and killed. They continued to flee when another acolyte, Orvek, attacked the submarine and perished in the attempt. The remaining group reached Bel City, where Rebb decided that she should try to slow them down. She was joined by Stell.\nRebb was a human female with black hair and fair skin, and strongly opposed the Empire when they occupied her city. She was able to convince Stell to join her in her efforts against the Empire and undoubtedly followed Barr when he offered the opportunity to find purpose. When Darth Vader arrived on Mon Cala, Rebb was keen to avenge Barr's fallen brethren. When they were pursued by Vader to Bel City, Rebb then took the opportunity to fight them and stayed behind.\nRebb first appeared in the canon 2018 comic Darth Vader  14 written by Charles Soule and pencilled by Giuseppe Camuncoli. Although Rebb's fate is left ambiguous, a flashback occurred subsequent to her final appearance. This was similar to flashbacks that occurred after the deaths of other acolytes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Ferren_Barr%27s_disciples",
  "/wiki/Planet",
  "/wiki/Mon_Cala",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ferren_Barr",
  "/wiki/18_BBY",
  "/wiki/Standard_year",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Anakin_Skywalker",
  "/wiki/Inquisitorius",
  "/wiki/Ferren_Barr%27s_cave_refuge",
  "/wiki/Bel_City",
  "/wiki/Stell",
  "/wiki/Clone_Wars",
  "/wiki/City",
  "/wiki/Jedi_Master",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Advisor",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/King",
  "/wiki/Ambassador",
  "/wiki/Telvar",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_apprentice",
  "/wiki/Squad",
  "/wiki/Purge_Trooper",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Flagship",
  "/wiki/Sovereign",
  "/wiki/Assassin",
  "/wiki/Major",
  "/wiki/Rantu",
  "/wiki/Jedi_Knight",
  "/wiki/Chosen_One",
  "/wiki/The_Force",
  "/wiki/Battle_of_Dac_City",
  "/wiki/Jedi_Order",
  "/wiki/Droid",
  "/wiki/Endee",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Imperial_submarine",
  "/wiki/Nipaltoo",
  "/wiki/Sith_Lord",
  "/wiki/Death",
  "/wiki/Orvek",
  "/wiki/Hair",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Darth_Vader_(2017)_13"
 ]
}