{
 "name": "Rebel Crew Chief",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Graying"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Incom Corporation",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "The Rebel Crew Chief was a Human male engineer who worked at the Alliance to Restore the Republic's Great Temple base on Yavin 4 during the Galactic Civil War. Initially an employee of the Fresia-based Incom Corporation, the nationalization of that company by the Galactic Empire prompted the crew chief and his co-workers to join the Rebellion. In his role with the Alliance, the chief spent many hours performing maintenance on T-65 X-wing starfighters and T-47 airspeeders.\nThe chief was initially an engineer working for Incom Corporation, a starship company. During the Imperial Period, the Galactic Empire nationalized the Fresia-based corporation, prompting many workers, such as the engineer, to flee and join the Alliance to Restore the Republic. Like his former co-workers, he spent many hours performing maintenance on T-65 X-wing starfighters and T-47 airspeeders in the Alliance's service. Both types of craft had initially been made by the Incom Corporation. The engineer was eventually given the role of crew chief, began work as a technician, and was assigned to the Alliance's Great Temple base on Yavin 4.\nIn 0 BBY, technical readouts to the Empire's new Death Star battlestation were brought to the Yavin base by Princess Leia Organa, and General Jan Dodonna devised a plan of attack. The attack would involve the T-65s, and so the chief performed maintenance on at least one of them before the battle. The T-65's pilot, Luke Skywalker, intended to use the droid R2-D2 as his astromech for the upcoming battle, but the chief noted that the droid did not look to be in the best of shape. He asked Skywalker whether he wanted a replacement, but the pilot declined, claiming that he and R2-D2 had been \"through a lot together.\" Finishing his maintenance, the chief cleared Skywalker for liftoff. Skywalker would go on to destroy the Death Star.\nWhen the company he worked for was nationalized by the government, the chief began serving the Rebellion movement. On at least one occasion, he judged a droid merely by its appearance, rather than its performance. The Incom engineer was a Human male with graying hair and light skin.\nThe Rebel Crew Chief had a tan-colored suit.\nThe Rebel Crew Chief was portrayed by Shane Rimmer in George Lucas' Star Wars: Episode IV A New Hope, although technically his first appearance was in Alan Dean Foster's novelization of the film. The character was featured in the \"A New Hope\" set of the Star Wars Trading Card Game, where he was identified as \"Rebel Crew Chief.\"\nSome inconsistencies exist between the Crew Chief's A New Hope film appearance and various adaptations. The crew chief has slightly different dialogue in the film's novelization, along with the November 5, 1977 fifth issue of Marvel Comics' Star Wars comic series, Brian Daley's 1981 radio adaptation, the 1994 Star Wars: The National Public Radio Dramatization, which contains the radio drama's script, and the third issue of Bruce Jones' 1997 comic adaptation. In Star Wars 5, the Crew Chief says an earlier line to Skywalker before a different version of his film line is delivered, while both the radio drama and its script contain additional dialogue with the Crew Chief responding to Skywalker's film lines.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Incom_Corporation/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Great_Temple/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Fresia/Legends",
  "/wiki/Imperialization/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Crew_chief",
  "/wiki/Standard_hour/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Imperial_Period",
  "/wiki/0_BBY/Legends",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/General/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Shane_Rimmer",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Alan_Dean_Foster",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/A_New_Hope_(TCG)",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/November_5",
  "/wiki/Star_Wars_(1977)_5",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Brian_Daley",
  "/wiki/1981",
  "/wiki/Star_Wars_(radio)",
  "/wiki/1994",
  "/wiki/Star_Wars:_The_National_Public_Radio_Dramatization",
  "/wiki/Star_Wars:_A_New_Hope_-_The_Special_Edition_3",
  "/wiki/Bruce_Jones",
  "/wiki/1997",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(junior_novelization)",
  "/wiki/Star_Wars:_Rogue_Squadron_II:_Rogue_Leader",
  "/wiki/Category:Images_of_Rebel_Crew_Chief",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Special_Edition_Limited",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Empire_at_War",
  "/wiki/The_New_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/The_New_Essential_Chronology"
 ]
}