{
 "name": "Rebus  (Sith Empire)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Intelligence",
      "Imperial Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Rebus was a colonel and head of one of the reconstituted Sith Empire's research programs during the Cold War between the Galactic Republic and the resurgent Sith Empire. Colonel Rebus was heavily involved in designing the Gauntlet superweapon, which Havoc Squad helped destroy. He had a hand in other projects as well such as the Blight Matrix, the Galactophage, Subjugation Droid, and the Plasm Resource. Supposedly, he even designed a device that could block hyperlanes, but the project was scrapped due to power limitations.\nWhen M1-4X received intelligence reports that Colonel Rebus was set to test one of his projects, Forex went there to follow up on it. Rebus anticipated this however, and set a trap to capture M1-4X's power core. Rebus used an energy device to overload Forex's primary energy controls, thus freezing the droid in place. Forex still had control over a handful of secondary subsystems which he had manipulated to trigger a full emergency shutdown and a rear servo lock, which had violently propelled the droid on top of Rebus and thus shut down his device. While his guards attended to the colonel, Forex was able to restore his systems after ninety seconds and annihilated the remaining guards. He then apprehended Rebus and took him back to base. While being treated for his injuries, Rebus was last said to have a \"nonzero chance of speaking or walking again.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Colonel/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Gauntlet_(Sith_Empire)",
  "/wiki/Havoc_Squad",
  "/wiki/Blight_Matrix",
  "/wiki/Galactophage",
  "/wiki/Subjugation_Droids",
  "/wiki/Plasm_Resource",
  "/wiki/Hyperlane",
  "/wiki/M1-4X",
  "/wiki/M1-4X%27s_power_core",
  "/wiki/Droid/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}