{
 "name": "Rebus_(Galactic_Empire)",
 "display_name": "Rebus  (Galactic Empire)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Rebus was a Human male Imperial Moff at the start of the Galactic Civil War. He was a noted weapons designer and created the prototype weapons for the Empire's dark trooper battle droids. He chose the sewage systems of Anoat as his hideout and installed a sophisticated series of defenses to prevent intruders from reaching his lab. However, while investigating the Dark Trooper Project for the Alliance to Restore the Republic, the mercenary Kyle Katarn was able to infiltrate Rebus's base and capture the Moff. During his interrogation, Rebus revealed information that helped Katarn track down the source of the dark troopers and eliminate them.\nRebus gained a reputation as a weapons designer during the years leading up to the Battle of Yavin and, by 0 ABY, held the rank of Moff in the Galactic Empire. Around that time he operated out of a hidden stronghold, deep within the subterranean sewage system under Anoat City, the long-abandoned sole settlement on Anoat in the Anoat sector.\nThe sewage system itself was mammoth and extremely confusing to navigate, all the while being virtually pitch black, making the use of a head lamp or infrared goggles imperative. Rebus made sure that even the smartest of trespassers were prevented from finding the route to his lab through the largely unexplored array of durasteel sewage tunnels by engineering a complicated series of drain gate switches. While the dianogas that infested the sewers provided a natural defense against intruders, Rebus also surrounded himself with Viper probe droids, IT-O Interrogator droids, and remote droids, ready to attack any trespassers in various areas within the sewer complex. Several Gran thugs, armed with thermal detonators, were also employed to provide further protection.\nAround the time of the Battle of Yavin, Rebus designed the prototype weapons for the Empire's dark troopers, a series of advanced battle droids developed under General Rom Mohc. The dark trooper weapons, which bore the initials M.R. on the barrel as his signature, were tested on Fest in the Atrivis sector, and Rebus was pleased with the results. The weapons were used to devastating effect by dark troopers during the Imperial attack on the Alliance to Restore the Republic's base on Talay. Tak Base was destroyed within minutes and many innocent inhabitants of Talay were killed along with the Rebels. In the aftermath of the attack, Rebel agent Kyle Katarn traveled to Talay to investigate and discovered a prototype dark trooper weapon. When Katarn's partner, Rebel agent Jan Ors, discovered Rebus's signature on the device, it led the pair to Anoat in search of the Moff.\nKatarn proceeded into the sewer system and was able to successfully activate the drain gate switches and navigate to the Moff's lab. He found Rebus in his hideout, simply sitting in a brown chair holding a large weapon. Rebus put up no resistance whatsoever, and was captured and subsequently questioned on the Dark Trooper Project. Though he was uncooperative during questioning, providing the Rebels with little useful information, Rebus mentioned the results of the tests on Fest during one of his rants. The existence of an Imperial Weapons Research Facility on Fest was soon confirmed by the Rebel spy Crix Madine, and Katarn proceeded to Fest to search for clues. He recovered a sample of phrik from Fest, which was used in the construction of dark troopers and helped him to track down their source. Katarn eventually eliminated Mohc and put an end to the dark troopers.\nMoff Rebus was an eccentric and paranoid man who secluded himself in a hidden stronghold away from potential enemies. His quirky nature was well known to those within the Empire, and he gained a degree of notoriety due to his work as a weapons designer. Though he was considered by some to be a genius, he was also arrogant, proudly displaying his M.R. signature on weapons he designed, and later threatening the Rebels during the interrogation that followed his capture by Katarn and Ors. He was extremely loyal to the Empire and made no attempt to hide his dislike for the Rebel Alliance. His appearance was unusual for an Imperial Moff—when he was captured by Katarn, Rebus wore a white undershirt instead of an Imperial uniform. He had light skin and black hair.\nRebus was created for the 1995 LucasArts video game Star Wars: Dark Forces. His only appearance in the game is during the third mission, \"Anoat City: The Subterranean Hideout,\" in which players, taking the role of Kyle Katarn, are charged with locating and capturing Rebus. The character does not speak in the game and is captured without any resistance, despite being depicted holding a weapon.\nJustin Chin, the writer and lead artist for Dark Forces, has stated that Rebus once did some work for Imperial Machines, but sought a more creative environment and disliked the political infighting at the company. However, this has not been confirmed in any canon source.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Moff/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Rebus_(Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Dark_trooper",
  "/wiki/Battle_droid/Legends",
  "/wiki/Anoat/Legends",
  "/wiki/Dark_Trooper_Project",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Mission_to_Anoat",
  "/wiki/Trooper/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Time/Legends",
  "/wiki/Anoat_City",
  "/wiki/Anoat_sector/Legends",
  "/wiki/Head_lamp",
  "/wiki/Infrared_goggles/Legends",
  "/wiki/Durasteel/Legends",
  "/wiki/Dianoga/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/IT-O_Interrogator",
  "/wiki/Droid/Legends",
  "/wiki/Remote/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/General/Legends",
  "/wiki/Rom_Mohc",
  "/wiki/Mern/Legends",
  "/wiki/Resh/Legends",
  "/wiki/Fest/Legends",
  "/wiki/Atrivis_sector/Legends",
  "/wiki/Attack_on_Tak_Base",
  "/wiki/Tak_Base",
  "/wiki/Talay/Legends",
  "/wiki/Mission_to_Talay",
  "/wiki/Jan_Ors",
  "/wiki/Weapons_Research_Facility",
  "/wiki/Spy/Legends",
  "/wiki/Crix_Madine/Legends",
  "/wiki/Mission_to_Fest_(Galactic_Civil_War)",
  "/wiki/Phrik/Legends",
  "/wiki/Mission_to_the_Arc_Hammer",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Hair/Legends",
  "/wiki/1995",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Dark_Forces",
  "/wiki/Justin_Chin",
  "/wiki/Imperial_Machines",
  "/wiki/Politics/Legends",
  "/wiki/Canon",
  "/wiki/Dark_Forces_Official_Player%27s_Guide",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Game_Room",
  "/wiki/Star_Wars_Galaxy_Magazine_3",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Unseen_Planets_of_Star_Wars",
  "/wiki/Star_Wars_Insider_36",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Wizards.com",
  "/wiki/Galactic_Gazetteer:_Hoth_and_the_Greater_Javin",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/August_8",
  "/wiki/2013"
 ]
}