{
 "name": "Reck Desh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "25 ABY",
      "Bilbringi system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Peace Brigade"
     ]
    }
   ]
  }
 ],
 "content": "Reck Desh was a Human male smuggler. He had black hair, brown eyes, and in 25 ABY received extensive tattooing. He once partnered with Han Solo to bring R'alla mineral water to Rampa II, and later raced Solo for fifty cases of Gizer ale, which he lost.\nDuring the Yuuzhan Vong War, Desh led the Peace Brigade, a squad of armed Yuuzhan Vong sympathizers. He gained information that Elan, a priestess, was a Yuuzhan Vong defector and immediately made a plan to capture her and give her to the Yuuzhan Vong to curry favor with the invaders.\nElan was found with Han Solo, Droma, and Vergere. At first, Desh hadn't recognized Solo, and was more intrigued by the Ryn, and attempted to determine what Vergere was. Upon recognizing Solo, he assumed Solo was in charge of the defectors. When Solo told him about Chewbacca's death at the destruction of Sernpidal, Desh expressed his sympathy, but hadn't known about that beforehand. It was too risky to let Solo live however, so he forced Solo into a deactivated transfer tube drop shaft, knowing that Solo would die on impact with the ground.\nUnluckily for Desh, Elan was using her status as defector to infiltrate the Jedi so she could assassinate them. As Desh was transporting Elan back into the hands of the Yuuzhan Vong, she exhaled Bo'tous spores into the shuttle, killing Desh and his cohorts, while she and Vergere took refuge from the spores in the rear holds of the shuttle. Having survived the drop shaft by grabbing Droma's tail, Solo later discovered Desh's corpse in the pilot's seat.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Bilbringi_system",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Peace_Brigade",
  "/wiki/Smuggler/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/R%27alla_mineral_water/Legends",
  "/wiki/Rampa_II/Legends",
  "/wiki/Gizer_ale",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Elan",
  "/wiki/Priest_caste",
  "/wiki/Droma",
  "/wiki/Vergere",
  "/wiki/Ryn/Legends",
  "/wiki/Fosh",
  "/wiki/Chewbacca/Legends",
  "/wiki/Destruction_of_Sernpidal",
  "/wiki/Transfer_tube",
  "/wiki/Jedi/Legends",
  "/wiki/Bo%27tous_spore",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}