{
 "name": "Recon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 22 BBY and 21 BBY",
      "Belgaroth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "182nd Legion",
      "Grand Army of the Republic",
      "182nd Legion",
      "182nd Legion"
     ]
    }
   ]
  }
 ],
 "content": "\"Recon\" was the nickname of a clone trooper who served in the Grand Army of the Republic's 182nd Legion. A renowned scout, Recon participated in a mission to the planet Belgaroth which was aimed at investigating rumors of the Galactic Republic Czerka factory's dealings with the Confederacy of Independent Systems. Recon and two other clones, Chatter and Knuckles, were killed during the mission by the native droidbreaker creature, though the last member of the team, Sergeant Marrt, successfully carried out the mission to the end.\n\"Recon\" was the nickname of one of the numerous clones created on the planet Kamino from bounty hunter Jango Fett's DNA to fight in the Grand Army of the Republic. During the Clone Wars, Recon served in the Galactic Republic's 182nd Legion, and he earned his nickname for his exceptional skills in reconnaissance duties. Between 22 BBY and 21 BBY, rumors spread that the Republic Czerka factory on the planet Belgaroth was secretly dealing with the Confederacy of Independent Systems, and the Republic responded by sending a scout team of four clone troopers—Recon, Chatter, Knuckles, and Sergeant Marrt—to investigate.\nAfter reaching the factory, Marrt sneaked inside to scout ahead, while Recon and the rest waited nearby. Marrt found out that the facility's head, Tarin, was secretly supplying the InterGalactic Banking Clan representative Reep Tonith with illegal FEX-M3 nerve gas grenades, which could be used to turn the tide of the war in favor of the Confederacy. The sergeant took one grenade as evidence and attempted to slip away undetected but was spotted by one of Tonith's B1-Series battle droids. Tarin and the droids opened fire, forcing the four clone troopers to retreat to a swamp, which was covered by a thick fog that prevented the clones from sending a transmission to the Republic. Moreover, a high screech sounded throughout the swamp, and Knuckles suspected that more battle droids had found them. Recon, however, realized that the sound was emitted by something much bigger than a droid, and that this \"something\" was coming their way.\nBefore he could do anything, Recon was attacked by the native droidbreaker creature. Marrt cried for Recon to move away, but the latter was not fast enough. The beast hit Recon with its hard head carapace, throwing him into a tree. Recon died upon impact, and the droidbreaker began chewing on his blaster. One by one, Chatter and Knuckles fell victim to the droidbreaker as well, until Marrt killed the creature with the nerve grenade he had stolen. The sergeant buried his squad under the defeated creature's head. Vowing to avenge their deaths, he attacked the Czerka factory alone. Receiving heavy injuries during the fight against the battle droids, Marrt managed to single-handedly capture Tarin and obtain valuable evidence from the factory before burning it down. However, Tonith managed to escape.\nRecon's talents laid in reconnaissance, which earned him his nickname, and he was respected even by veteran scouts for his skills. His sense of danger was well-known among other clone troopers, but it failed him on Belgaroth. Though he sensed the incoming danger, Recon was unable to evade the droidbreaker's attack. Like all clone troopers, Recon stood 1.83 meters tall. He also had brown hair.\nRecon was featured in A Trooper's Tale, a short comic strip published in Star Wars: The Clone Wars Comic UK 6.8 in May of 2010. A Trooper's Tale was written by Robin Etherington and illustrated by Andres Ponce.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Belgaroth",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/182nd_Legion",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Mission_to_Belgaroth",
  "/wiki/Planet/Legends",
  "/wiki/Czerka_factory",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Chatter",
  "/wiki/Knuckles_(182nd_Legion)",
  "/wiki/Death/Legends",
  "/wiki/Droidbreaker",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Marrt",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/DNA/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Tarin_(Human)",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/Reep_Tonith",
  "/wiki/FEX-M3_nerve_gas_grenade",
  "/wiki/Sergeant/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Droid/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Squad/Legends",
  "/wiki/A_Trooper%27s_Tale",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.8",
  "/wiki/May",
  "/wiki/2010",
  "/wiki/Robin_Etherington",
  "/wiki/Andres_Ponce",
  "/wiki/Category:Images_of_Recon",
  "/wiki/Databank_(original)",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Time/Legends",
  "/wiki/ARC_Troopers",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_62",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_7",
  "/wiki/The_New_Essential_Chronology"
 ]
}