{
 "name": "Redd_Wessel",
 "display_name": "Redd Wessel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Emperor's Revenge",
      "over Yinchorr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Army",
      "Imperial Army",
      "Crimson Empire"
     ]
    }
   ]
  }
 ],
 "content": "Redd Wessel was a Human male who served as an Imperial Army general under Carnor Jax of the Crimson Empire.\nRedd Wessel was the son of Marcellin Wessel, one of the first of Palpatine's moffs. From a young age, he dreamed that he would become an Imperial fleet commander, leading his ships to glorious battle and victory. But life in the Navy was not to be; when he was old enough to attend the Academy, the tests determined that he might be of better use to the Galactic Empire as an Imperial Army officer. He resolved to join the army, and began building his career.\nMenawhile, his father was struggling to salvage his career. Marcellin sought to regain Palpatine's favor by capturing Leia Organa, a prominent Rebel leader, on Yinchorr; it all blew up in his face when the Yinchorri toppled his government and joined the Rebel Alliance. The Empire's response was to launch a massive assault on Yinchorr, not only to destroy the Rebel presence there, but also to completely devastate all Yinchorri cities and obliterate their civilization. Redd Wessel participated in this campaign, impressing his superiors.\nWessel steadily advanced through the ranks, utilizing mostly conventional approaches to command and strategy. He eventually won the rank of general, but eventually his career hit the wall. He wanted more than just rank; he wanted to be a power-broker, but he lacked the imagination to do what was necessary in the post-Endor galaxy. At best he could find one with promise and attach himself to that warlord's coattails.\nThe opportunity arose when, after a year of a resurgent New Order led by a resurrected Palpatine, one of the Emperor's Royal Guardsmen, Carnor Jax, brought Wessel into a conspiracy with members of the Imperial Ruling Council to destroy Palpatine and assume rulership of the Empire. Jax, a former soldier himself, felt more comfortable with army officers than navy officers in his staff, so he took Wessel on as his personal aide. Once Palpatine was permanently removed in 11 ABY, Wessel helped Jax to take control of the Council and set himself as a viable claimant to the Imperial throne.\nWessel was made Jax's overall commander for military operations as leader of Central Command, leaving Jax and a lieutenant named Geff Blim to see to the pretender's personal affairs. He eventually became Supreme Commander. But eventually, Jax began to see what had kept Wessel from advancing any further; Jax sought vision in his ranking officers, something Wessel lacked. Their working relationship deteriorated into little more than constant criticism of Wessel's inability to understand Jax's intentions.\nGeneral Redd Wessel was killed aboard the Imperial Star Destroyer Emperor's Revenge when a Scimitar assault bomber, bomb-rigged by Jax's nemesis Kir Kanos, was brought aboard, where it exploded, killing everyone aboard and gutting the greater part of the ship.\nGeneral Wessel was played by David Anthony Brinkley for the audio drama version of Crimson Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Emperor%27s_Revenge",
  "/wiki/Yinchorr/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Crimson_Empire",
  "/wiki/Carnor_Jax",
  "/wiki/General/Legends",
  "/wiki/Marcellin_Wessel",
  "/wiki/Palpatine/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Army/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Yinchorri",
  "/wiki/City/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Imperial_Ruling_Council/Legends",
  "/wiki/Imperial_High_Command/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Geff_Blim",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Scimitar_assault_bomber",
  "/wiki/Kir_Kanos",
  "/wiki/David_Anthony_Brinkley",
  "/wiki/Crimson_Empire_(audio)",
  "/wiki/Crimson_Empire_0",
  "/wiki/Crimson_Empire_1",
  "/wiki/Crimson_Empire_2",
  "/wiki/Crimson_Empire_3",
  "/wiki/Crimson_Empire_4",
  "/wiki/Crimson_Empire_5",
  "/wiki/Crimson_Empire_II:_Council_of_Blood",
  "/wiki/Star_Wars_Handbook_2:_Crimson_Empire",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Sedriss_QL",
  "/wiki/Xecr_Nist",
  "/wiki/Immodet",
  "/wiki/Unidentified_Imperial_officer_(Crimson_Empire)"
 ]
}