{
 "name": "Redeye_(Turazza)",
 "display_name": "Redeye  (Turazza)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Turazza"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "1 green",
      "1 missing"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Exovar's Emporium"
     ]
    }
   ]
  }
 ],
 "content": "Redeye, nicknamed \"Deadeye\", was a member of the Turazza species, who worked as head of security for Luskin Exovar at Exovar's Emporium.\nRedeye proved to be highly effective as the head of security and was able to single-handedly eject a pair of unruly Gamorreans with only a stun baton and sheer force of will.\nHis personality was mostly unknown as Emporium patrons were unable to communication with him, as he could not speak Basic. Redeye was a nickname based upon his facial coloration and Deadeye was a nickname based upon his skill with blasters. His true Turraza name was known only to Luskin. He wore a patch over his missing right eye.\nDespite his small size Redeye was a formidable opponent in combat and was equally skilled with a blaster as he was with his stun baton. He was also trained to use the Ion Defense Grid that protected the Emporium. He was also highly perceptive and was able to spot or sniff out trouble before it occurred.\nRedeye was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Turazza",
  "/wiki/Species/Legends",
  "/wiki/Redeye_(disambiguation)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Exovar%27s_Emporium",
  "/wiki/Luskin_Exovar",
  "/wiki/Gamorrean/Legends",
  "/wiki/Stun_baton/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Ion_Defense_Grid",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997"
 ]
}