{
 "name": "Redkihl_Rokk",
 "display_name": "Redkihl Rokk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Djurmo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Hungry Ghost"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Huralok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Redkihl Rokk's Pirates"
     ]
    }
   ]
  }
 ],
 "content": "Redkihl Rokk, also known as the Scavenger of the Galaxy, was a Huralok pirate salvager who was destroyed by Han Solo among the wreckage of the first Death Star. In order to keep his body from failing him, Rokk had to inject himself with drugs and nutrients. He was constantly attached, through small pipes, to the bridge of his ship, the Hungry Ghost.\nHe was the leader of his own pirate group. Before the Galactic Civil War, he lead his pirates around in the ship Hungry Ghost in the Outer Rim. Instead of killing any enemies, he would place his ship close enough to a vessel so that spider droids could be placed on the ship. The droids were able to stun the passengers, and Redkihl Rokk's pirates were able to loot the ship of any valuable items. After doing this, he would let the ship drift in space.\nAs the Republic turned into an Galactic Empire, Rokk was still one of the most infamous pirates in the galaxy. He traveled to Yavin 4 with a fleet of red TIE fighters almost immediately after the Battle of Yavin to kill an old enemy, Han Solo, and any other passengers aboard the Millennium Falcon. He boarded the ship and attempted to kill Solo, Leia Organa, Chewbacca, and C-3PO with the spider droids but failed. He sent a squad of pirate crewman with vibroblades to kill the passengers, but failed in this also, as Luke Skywalker appeared out of hyperspace.\nRokk ordered all of the ship's laser cannons to fire on Skywalker's T-65 X-wing, and he damaged the ship, causing the small fighter to crash into one of the Hungry Ghost 's many hangar bays. Another squad of pirates were sent to kill Luke, but they all escaped soon after and destroyed Rokk and his ship with a bomb.\nRokk was considered to be extremely violent. Even for a pirate, he was violent, but would not kill his opponent unless strongly needed and could not be kept alive. Instead, he stunned them with his spider droids. His pirates were very loyal to him. He was known as the \"scavenger of the galaxy\" because he would loot any ship the Hungry Ghost came across.\nRedkihl Rokk was in very poor health in the days of the Old Republic and after, and constantly needed to inject himself with various drugs and other medications to keep him alive.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Djurmo",
  "/wiki/0_ABY/Legends",
  "/wiki/Hungry_Ghost",
  "/wiki/Huralok",
  "/wiki/Gender/Legends",
  "/wiki/Redkihl_Rokk%27s_Pirates",
  "/wiki/Pirate/Legends",
  "/wiki/Scavenger/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Redkihl_Rokk%27s_spider_droid",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Chewbacca/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Laser_cannon/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Death_Star_Pirates",
  "/wiki/Star_Wars_Tales_8",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}