{
 "name": "Ree-Yees",
 "display_name": "Ree-Yees",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kinyen"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Ree-Yees was a Gran male who worked for the Hutt crime lord Jabba Desilijic Tiure and was responsible for watching Buboicullaar, the Hutt's pet frog-dog. On one occasion, Ree-Yees lost Buboicullaar on board Jabba's sail barge, the Khetanna, and was forced to clean the vessel and search for the pet before Jabba revealed that he could summon the frog-dog with a simple call. The Gran was later part of a crowd that confronted the bounty hunter Boba Fett at the palace when Fett spoke with Jabba's majordomo, Bib Fortuna; however Fett convinced Ree-Yees and the others to back down based on his reputation.\nIn 4 ABY, Ree-Yees was present in Jabba's Palace on the planet Tatooine when the droids R2-D2 and C-3PO delivered a message to Jabba from the Jedi Luke Skywalker, who wished for the Hutt to free the smuggler Han Solo from carbonite. After watching a performance by the Max Rebo Band, Ree-Yees gleefully watched the dancer Oola be eaten by Jabba's pet rancor, Pateesa.\nHe then witnessed Princess Leia Organa, disguised as the bounty hunter Boushh, bargin with Jabba for the bounty on the Wookiee Chewbacca. Having seen through Organa's disguise, Jabba had Ree-Yees and others wait with him in order to ambush the princess when she freed Solo from carbonite later that night, with Ree-Yees covering the vocoder of C-3PO in order to prevent him from warning the pair.\nOnce Skywalker himself arrived at the palace to free his various allies, Ree-Yees excitedly watched him battle the rancor, but was shocked and frustrated when the Jedi killed the beast. The Gran then accompanied Jabba on the Khetanna as they traveled to the Great Pit of Carkoon to watch Skywalker, Solo, and Chewbacca be executed; however, Skywalker and his allies freed themselves and managed to kill Jabba. They then destroyed the Khetanna and Ree-Yees perished in the explosion.\nThe Gran male Ree-Yees was an exiled thief from the planet Kinyen who worked as an insignificant henchman in the criminal empire of the Hutt crime lord Jabba Desilijic Tiure. A part of the Hutt's entourage, he had the unglamorous job of looking after the crime lord's guard dog, the frog-dog Buboicullaar. On one occasion, Ree-Yees lost track of Buboicullaar on board Jabba's sail barge, the Khetanna. Angered, the Hutt had Ree-Yees brought before him by a pair of guards on the sail barge's top deck while the vehicle hovered above a junkyard on the planet Tatooine. The crime lord claimed the Gran was not even worth feeding to his pet krayt dragon and threatened to have Ree-Yees thrown overboard into the junkyard below, but the dog watcher pleaded for his life and promised to both find Buboicullaar and clean the entire sail barge.\nJabba agreed to give Ree-Yees the time that it would take for the Khetanna to sail back to Jabba's Palace in the Dune Sea to make good on both his promises. The Gran then began cleaning the barge while calling out for the frog-dog, searching under wires and leaving out a plate of Buboicullaar's favorite food—steaming fecal worms—as bait. Buboicullaar then ate the worms while Ree-Yees back was turned and moved elsewhere in the ship before the Gran noticed him.\nAfter cleaning the barge's engine room and sick bay, Ree-Yees encountered Jabba in the larder and was told to clean the donation room, the prison for those who refused to donate, and finally the pit where the krayt dragon was kept. Ree-Yees entered the pit with a bone, which he used to distract the chained dragon while dashing over to the sewage grate in the room to search for Buboicullaar. Under the grate, he found the frog-dog's dog-tag amongst the sewage and assumed the pet had been eaten, diving into the sewage himself in order to avoid being devoured by the krayt dragon.\nRee-Yees then emerged from the waste disposal chute on the underside of the barge and saw that the barge had reached the palace, meaning he was out of time. He climbed up the side of the Khetanna to the top deck and offered to throw himself overboard to save Jabba the trouble; however, the Hutt then simply summoned Buboicullaar by calling out the frog-dogs name. Laughing at tricking the Gran into cleaning the barge, the Hutt told Ree-Yees to wash himself and take better care of Buboicullaar in future.\nIn 3 ABY, the smuggler Han Solo was frozen in carbonite and handed over to the bounty hunter Boba Fett, who set out to deliver the smuggler to Jabba and collect the bounty that the Hutt had set on the smuggler's head. However, the Crimson Dawn crime syndicate stole Solo from Fett, causing Jabba to put a bounty on Fett instead. When Fett learned of this, he traveled to Jabba's Palace to confront the Hutt. Ree-Yees and Jabba's accountant Tessek walked past Fett together as the bounty hunter approached the palace, where he was greeted by the Hutt's majordomo, Bib Fortuna.\nWhile Fortuna explained that Jabba was not available, as the Hutt had left the palace to attend the Crimson Dawn's auction for Solo, Ree-Yees and Tessek circled back into the palace. The pair then joined a crowd who emerged behind Fortuna with their weapons drawn as the majordomo suggested Fett leave. The bounty hunter refused, reminding the crowd of his reputation and warning that if they died fighting him they would be dying only for the sake of Fortuna. Silently, the Gran lowered his weapon along with the rest of the crowd and allowed Fett to enter the palace with Fortuna in order to see the invitation.\nIn 4 ABY, Ree-Yees was among the courtiers present in the throne room of Jabba's Palace when the droids C-3PO and R2-D2 were brought in by Fortuna and two Gamorrean guards. Stood between two of the alcoves by the throne room's entrance, the Gran turned to watch the droids as they moved before Jabba and delivered a holographic message from the Jedi Knight Luke Skywalker, who requested and audience to bargain for the life of Solo. Ree-Yees then laughed along with the rest of the court when Jabba declared that there would be no bargain, as the Hutt enjoyed displaying the frozen Solo on one of the walls of the throne room.\nRee-Yees later sat in the alcove nearest to the throne room door with Buboicullaar chained nearby in order to watch a performance of \"Jedi Rocks\" by the Max Rebo Band. The Gran moved along to the song until the dancer Oola refused advances from Jabba and as a result was dropped into the pit below the throne room where Jabba kept his pet rancor, Pateesa. Ree-Yees rushed to the grating above the pit to watch the dancer's demise and cheered as the beast emerged. After the creature devoured Oola, blaster-fire from outside the throne room caused the Gran and others to turn in surprise and then crowd round the entrance to see what was causing the commotion.\nPrincess Leia Organa, disguised as the bounty hunter Boushh then entered with the Wookiee Chewbacca, a companion of Solo, as her prisoner. Ree-Yees moved back to allow the pair to make their way before the throne, where Organa bartered with the Hutt for the bounty on Chewbacca's head. The Gran ducked back when Organa revealed a live thermal detonator, but returned to his position as Jabba offered enough to satisfy Organa and conclude the exchange. Jabba, however, had seen through Organa's disguise, and set up a trap for her later that night.\nThe Hutt hid behind a curtain next to Solo's frozen form and lay in wait along with his favourite courtiers for Organa to try and come free him. Ree-Yees hid behind the same curtain, holding C-3PO, who had become Jabba's translator, in place covering the protocol droid's vocoder to keep him from shouting out a warning as Organa released Solo from the carbonite. Jabba then revealed himself and the Gran released C-3PO, laughing when the Hutt insulted Solo. Both Organa and Solo were then taken captive.\nJabba and his court, fueled by spotchka, later slept in the throne room, with Ree-Yees laying in the second alcove from the door. When Jabba was woken by the arrival of Skywalker, who had come to rescue his friends, Ree-Yees stood and slowly pushed forward with other courtiers to surround Skywalker as he tried to convince Jabba to hand over his prisoners. After Skywalker threatened Jabba with a blaster, the Jedi was dropped into the rancor pit, and Ree-Yees rushed to the grate again hoping to see another execution. He laughed and cheered as Jubnuk, a Gamorrean guard who had fallen in with Skywalker, squealed in terror and tried to escape the rancor before being devoured. However, the cheering stopped when Skywalker managed to kill Pateesa by crushing the rancor beneath the gate to the pit. Outraged, Jabba declared that Skywalker, Solo, and Chewbacca would be executed at the Great Pit of Carkoon.\nRee-Yees then accompanied Jabba as they traveled to the pit onboard the Khetanna, crowdin with a drink in hand to the windows of the sail barge's viewing deck to watch the execution once they reached the pit. Standing with Tessek, the Gran laughed when Skywalker gave Jabba one last chance to surrender or die, but after the Hutt ordered the Jedi pushed off the skiff carrying the prisoners and into the pit, Skywalker attacked his captors and began to free his comrades. On board the barge, Organa destroyed Jabba's control panel and caused all of the window panels in the barge to close, throwing the room Ree-Yees was in into darkness. The Gran rushed around in panic and confusion with the other courtiers while Organa used the chains binding her to Jabba to choke the Hutt to death.\nOrgana then escaped to the barge's top deck, where she and Skywalker fired a turret down into the Khetanna and then escaped. The shot caused the Khetanna to explode from the inside, and Ree-Yees perished in the fiery blast. In 34 ABY, the memory banks of the smelter droid 8D-J8 contained an internal data record that showed Ree-Yees drinking on the Khetanna with the Yarkora Saelt-Marae and one of them questioning why the was droid onboard rather than with the Jawas in Jabba's entourage. An illustration of Ree-Yees with a caption describing him as miserable looking was included in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY.\nDespite flourishing among the criminal classes on Tatooine the alcoholic outcast Ree-Yees was the butt of many jokes and loathed Jabba, although not as much as Buboicullaar, who was fully sentient, despised Ree-Yees. Having enjoyed watching Oola perish Ree-Yees similarly hoped to enjoy the spectacle of Skywalker's death at the hands of the rancor, but went through three phases of emotion during the event.\nAt first, the Gran felt a pitiless, sadistic joy upon seeing the fate of Jubnuk, and then excitement as it seemed as though the Jedi would meet the same fate. Finally, the death of the rancor was unthinkable to Ree-Yees, and while trying to process it he felt incredulity and disappointment. Frustrated by this turn of events, he traveled to the Great Pit of Carkoon hoping to see it rectified, but was ultimately disappointed once again. Ree-Yees had pink skin and black eyes.\nRee-Yees wore a brown tunic and pants with a brown belt and light brown boots. He carried a black blaster rifle and a blaster pistol, and, while cleaning the Khetanna, used a pair of yellow gloves but tore through the fingers.\nThe character Ree-Yees was created for the original trilogy film Star Wars: Episode VI Return of the Jedi, which was released on May 25, 1983. Concept art of the character was created by Nilo Rodis-Jamero and a maquette of Ree-Yees was made by Chris Walas which measured 9 centimeters by 14 centimeters by 20 centimeters. The final costume consisted of a slip-on mask and a set of gloves that were worn by a mime performer on set for backgrounds shots, and a separate cable-controlled dummy mask capable of lip and eye articulation for close-ups. The articulated mask measured 58 centimeters by 76 centimeters by 41 centimeters and was made by applying additional elements to a foam Mon Calamari mask.\nIn the film, Paul Springer portrayed all of the full body shots of Ree-Yees at the palace and most on the sail barge, although Richard Bonehill wore the full costume for a few of the background sail barge shots and puppeteer Mike Quinn controlled the articulated mask for close ups. Due to the heaviness of the puppet, Quinn used a pole that connected the head to a hip harness, allowing him to use his left hand to turn the head and his right to control the articulation cables. It was first role that Quinn, who had not auditioned, portrayed in the film with the palace throne room scenes filmed between January 25 and February 8, 1982 on Stage 8 at Elstree Studios and the sail barge interior shots filmed on Stage 9 between February 9 and February 11.\nThe design for Ree-Yees was originally set to be used for the character of Admiral Ackbar in Return of the Jedi; however, after reviewing sculpts, director George Lucas decided to go with the fish-like appearance used in the final cut. The second draft of the film's script included a scene in which C-3PO attempted to translate an argument between Ree-Yees and Ephant Mon on board the Khetanna that eventually descends into a fist fight, causing C-3PO to flee. During filming, Mon was swapped out for the character Saelt-Marae and, although the scene was shot, it was ultimately cut from the film before release. Despite this, a still from the scene was used in the photo section of the film's Star Wars Legends novelization, which was written by James Kahn and released before the film on May 12, 1983, marking the first appearance of the character and published use of the name.\nThe character's name was created during production and is a garbled version of the word \"three-eyes\", made as an in-joke by the creature shop at Industrial Light \u0026 Magic. In the new Star Wars canon it was first used in the 2015 reference book Star Wars: Absolutely Everything You Need to Know. In Jeffrey Brown's 2021 non-canon children's book, A Vader Family Sithmas, Ree-Yees can be seen attending a holiday party at Jabba's Palace.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ree-Yees",
  "/wiki/Ree-Yees/Legends",
  "/wiki/Ree_(disambiguation)",
  "/wiki/Kinyen",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Gran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Buboicullaar",
  "/wiki/Frog-dog",
  "/wiki/LO-KD57",
  "/wiki/Khetanna",
  "/wiki/Repulsorcraft",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Max_Rebo_Band",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boushh",
  "/wiki/Bounty",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Vocabulator",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Thief",
  "/wiki/Sail_barge",
  "/wiki/Krayt_dragon",
  "/wiki/Time",
  "/wiki/Dune_Sea",
  "/wiki/Foodstuff",
  "/wiki/Fecal_worm",
  "/wiki/Worm",
  "/wiki/Engine",
  "/wiki/Bone",
  "/wiki/3_ABY",
  "/wiki/Crimson_Dawn",
  "/wiki/Accountant",
  "/wiki/Tessek",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Gamorrean",
  "/wiki/Security_guard/Legends",
  "/wiki/Hologram",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_Rocks",
  "/wiki/Blaster",
  "/wiki/File:ReeYees-WooHoo.ogg",
  "/wiki/Thermal_detonator",
  "/wiki/Protocol_droid",
  "/wiki/Spotchka",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Jubnuk",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Turret",
  "/wiki/34_ABY",
  "/wiki/Smelter_droid",
  "/wiki/8D-J8",
  "/wiki/Yarkora",
  "/wiki/Saelt-Marae",
  "/wiki/Jawa",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Alcohol",
  "/wiki/Sentience",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Blaster_rifle",
  "/wiki/Blaster_pistol",
  "/wiki/Glove",
  "/wiki/Limb",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/May_25",
  "/wiki/1983",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/Chris_Walas",
  "/wiki/Mon_Calamari",
  "/wiki/Paul_Springer",
  "/wiki/Richard_Bonehill",
  "/wiki/Mike_Quinn",
  "/wiki/January_25",
  "/wiki/February_8",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/February_9",
  "/wiki/February_11",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/George_Lucas",
  "/wiki/Ephant_Mon",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(novel)",
  "/wiki/James_Kahn",
  "/wiki/May_12",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Star_Wars",
  "/wiki/2015",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Jeffrey_Brown",
  "/wiki/2021",
  "/wiki/A_Vader_Family_Sithmas",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_Done_Dirty",
  "/wiki/Star_Wars_Adventures_(2020)_11",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/File:8DJ8p1-GEDatapad.png",
  "/wiki/File:8DJ8p2-GEDatapad.png",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/LEGO_Star_Wars:_Chronicles_of_the_Force",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Ree-Yees",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Battle_of_Batuu",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Rise_of_the_Resistance",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/March_27",
  "/wiki/2018",
  "/wiki/October_22",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/The_Art_of_Star_Wars_Episode_VI:_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Archives",
  "/wiki/Gerald_Home",
  "/wiki/Rebelscum.com",
  "/wiki/October_23",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Ultimate_Return_of_the_Jedi_Insider%27s_Guide",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/Who%27s_Who_in_Jabba%27s_Palace",
  "/wiki/Star_Wars_Insider_60"
 ]
}