{
 "name": "Reeft",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "57 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dressellian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Binn Ibes"
     ]
    }
   ]
  }
 ],
 "content": "Reeft was a male Dressellian Jedi Knight and a contemporary of the famed Jedi Master Obi-Wan Kenobi. Jedi Reeft served the Jedi Order and the Galactic Republic in the waning years of the Republic Classic era.\nDiscovered to be Force-sensitive, Reeft was training in the ways of the Force at the Jedi Temple on Coruscant. Like all Initiates to the Order, Reeft was sorted into a clan of fellow younglings. Making fast friends with fellow clan members Obi-Wan Kenobi, Garen Muln, and Bant Eerin, the group received their earliest lessons from clan instructor Docent Vant. Known for his enduring appetite, Reeft would often finish any remnants of food left on his friends' plates in the Temple's dining halls. After years of studying together, the wrinkle-faced boy was chosen by Jedi Master Binn Ibes for one-on-one training as a Padawan around his thirteenth birthday.\nAfter years of study with Master Ibes, Reeft was tasked with completing his Trials of Knighthood; a series of tests which he passed successfully under the eyes of the Jedi High Council and Temple battlemaster. Ascending to the rank of Jedi Knight, Reeft pursued independent studies throughout his service during the Separatist Crisis. In 22 BBY, Jedi Reeft was assigned to apprehend the notorious thief Rotar Lopani on Brentaal IV. As Reeft tracked the criminal through a crowded market, the Xexto bounty hunter Tosinqas trailed him and was eventually able to get to Lopani first. As Reeft approached Lopani, Tosinqas jumped from the shadows and killed Lopani. Startled when Reeft drew his lightsaber in a defensive position, Tosinqas charged the Jedi and, misjudging the lightsaber's length, bisected himself on the blade.\nReporting the incident to the High Council and returning the bodies to the Temple, Reeft came under political fire from the angered Bounty Hunters' Guild who filed a complaint with the Judicial Department. The Guild's stance was that the Order operated in relative secret, and stated that better communication between the Jedi Temple would have prevented an incident like the one involving Tosinqas.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/57_BBY/Legends",
  "/wiki/Dressellian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Binn_Ibes",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_Initiate_Clan/Legends",
  "/wiki/Garen_Muln",
  "/wiki/Bant_Eerin/Legends",
  "/wiki/Jedi_instructor",
  "/wiki/Vant",
  "/wiki/Jedi_Temple_Refectory",
  "/wiki/Padawan/Legends",
  "/wiki/44_BBY/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Battlemaster",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Rotar_Lopani",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/Xexto/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Tosinqas",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sai_tok/Legends",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Judicial_Department/Legends",
  "/wiki/Jedi_Apprentice:_The_Rising_Force",
  "/wiki/Jedi_Apprentice:_The_Captive_Temple",
  "/wiki/Jedi_Apprentice:_The_Hidden_Past",
  "/wiki/Jedi_Apprentice_Special_Edition:_Deceptions",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_53",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}