{
 "name": "Reefa_Been",
 "display_name": "Reefa Been",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Reefa Been was a Human female individual who lived during the time of the Galactic Civil War. Sometime following the Battle of Yavin in 0 BBY, the male Gungan known as Rep Been tasked a spacer with locating Reefa Been in the Naboo countryside, and escorting her back to Rep Been in the Gungan Sacred Place.\nReefa Been was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.\nReefa Been spawned under the generic \"mission_plainsfolk\" template, resulting in her consistently appearing as a Human female. Given Reefa Been's inclusion in Rep Been's questline, it is unclear if she was originally intended to be a Gungan relative of his. However, as Rep Been's quest dialogue was bugged, no mention was made of Reefa's physical characteristics. Therefore, this article assumes that the Human female depiction of Reefa is canon in the Star Wars Legends continuity, and that the surname of \"Been\" is merely coincidental. The questline that involved Reefa was removed from the game sometime after launch",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Rep/Legends",
  "/wiki/Been",
  "/wiki/Spacer/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Gungan_Sacred_Place/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Canon"
 ]
}