{
 "name": "Reeg_Brosna",
 "display_name": "Reeg Brosna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arcona"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sidon Ithano's crew"
     ]
    }
   ]
  }
 ],
 "content": "Reeg Brosna was an Arcona male pirate in the crew of the Crimson Corsair Sidon Ithano, captain of the Meson Martinet. He and the rest of the crew set out to claim the lost treasure of the Sith Lord Count Dooku from the crashed Separatist cruiser Obrexta III on the planet Ponemah Terminal. While trying to reach the cruiser in the sail barge Shrike, Brosna and his crewmates encountered a sandstorm which the Arcona fired a kinetic disruptor missile into in order to try and freeze it. Before the missile could take effect, Brosna was knocked off the Shrike and into the storm when the Weequay pirate Scorza opened fire on the sail barge.\nReeg Brosna was a male Arcona who served on board the pirate vessel known as the Meson Martinet in the crew of its captain, the Crimson Corsair Sidon Ithano. Five decades after the Clone Wars ended, the pirate crew picked up an emergency broadcast on the planet Ponemah Terminal being transmitted by the long lost Confederacy of Independent Systems cruiser Obrexta III. Believing the cruiser to contain the legendary lost treasure of the Sith Lord Count Dooku, Ithano's crew set out on the retrofitted sail barge Shrike for the Sea of Sands, a dangerous region of Ponemah where the Obrexta III had crashed.\nEn route, Brosna questioned what the treasure on board the ancient cruiser might be, causing the first mate Quiggold to guess that it might be lightsaber crystals collected by Dooku during the Clone Wars. Before the barge could reach the source of the distress signal, it encountered a large sandstorm which threatened to destroy the vessel. After receiving silent orders from Ithano, Quiggold ordered Brosna to load a kinetic disruptor missile into the barge's torpedo system, which would freeze the sandstorm when it detonated. As Quiggold counted down, Brosna prepared the missile's targeting system and then loaded it, firing without hesitation on the count of one while whispering with his eyes closed. Brosna successfully hit his target, but before the missile could detonate, the Weequay pirate Scorza, who was also seeking to claim Dooku's treasure, opened fire on the Shrike with the cannons on board his skiff. Caught off guard, Brosna was knocked from the sail barge by the attack and immediately swept away by the sand maelstrom.\nReeg Brosna was a yellow-eyed Arcona who was particularly well known for his grace and agility when under fire, although he was knocked from the Shrike when under cannon fire in a sandstorm. Despite coming from a desert species, Brosna sweated profusely while in the Sea of Sand, and wore a heavy hood to shade himself.\nReeg Brosna first appeared in \"The Crimson Corsair and the Lost Treasure of Count Dooku,\" a short story written by Landry Q. Walker that was published as an eBook in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Arcona",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sidon_Ithano%27s_crew",
  "/wiki/Pirate",
  "/wiki/Sidon_Ithano",
  "/wiki/Captain",
  "/wiki/Meson_Martinet",
  "/wiki/Sith_Lord",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Cruiser",
  "/wiki/Obrexta_III",
  "/wiki/Planet",
  "/wiki/Ponemah_Terminal",
  "/wiki/Sail_barge",
  "/wiki/Shrike_(sail_barge)",
  "/wiki/Sandstorm",
  "/wiki/Kinetic_disruptor",
  "/wiki/Missile",
  "/wiki/Weequay",
  "/wiki/Scorza",
  "/wiki/Squeaky",
  "/wiki/Standard_decade",
  "/wiki/Clone_Wars",
  "/wiki/Sea_of_Sand",
  "/wiki/Quiggold",
  "/wiki/Lightsaber",
  "/wiki/Kyber_crystal",
  "/wiki/Eye",
  "/wiki/Skiff",
  "/wiki/Desert",
  "/wiki/Species",
  "/wiki/The_Crimson_Corsair_and_the_Lost_Treasure_of_Count_Dooku",
  "/wiki/Landry_Q._Walker",
  "/wiki/EBook",
  "/wiki/2015",
  "/wiki/Life_Day_1",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Helmets"
 ]
}