{
 "name": "Reen_(Bevelyn)",
 "display_name": "Reen  (Bevelyn)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  }
 ],
 "content": "Reen was a human individual and the child of Imperial workers Bevelyn and Jon Melton. Reen lived aboard the second Death Star with their parents and sibling Zelly as Bev and Melton worked aboard the station. During their time with the Empire, Reen's parents became disillusioned and joined Lady Qi'ra's criminal syndicate, Crimson Dawn, as spies. Between 3 ABY and 4 ABY, Reen's parents decided to defect from the Empire and inform the Rebel Alliance of the Death Star's existence in exchange for safe passage and protection.\nAfter the family stole a shuttle and left the Death Star, TIE/IN interceptors were sent after them, and after failing to get help from the Rebel Alliance, Melton used the programmed coordinates to escape to Al'doleem. Once they arrived at the moon, they were forced to flee to the Imperial capital of Coruscant, where Melton believed they would either find Crimson Dawn members to help them, or they could get lost within the planets population and start fresh. After the shuttle arrived in orbit of Coruscant, Bev gave Reen a special job of looking after Zelly as the family gathered in the cockpit so they could use the shuttle's emergency pod to land on the planet. After they landed on Level 2685, Melton deactivated the pod's emergency beacon and informed the rest they needed to blend in and not draw attention. As a number of residents surronded the shuttle, Zelly informed Melton that they already had done that. Bev and Melton appealed for help from the residents, who refused and fled as Imperial ships headed their way. Bev then suggested that the family run.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Reen",
  "/wiki/Human",
  "/wiki/Youngling",
  "/wiki/Galactic_Empire",
  "/wiki/Bevelyn",
  "/wiki/Jon_Melton",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Parent",
  "/wiki/Zelly",
  "/wiki/Space_station",
  "/wiki/Time",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Crimson_Dawn",
  "/wiki/Sleeper_Agent",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Desertion",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Death_Star",
  "/wiki/Scopium",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Galactic_coordinates",
  "/wiki/Al%27doleem",
  "/wiki/Moon",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Planet",
  "/wiki/Shuttle",
  "/wiki/Orbit",
  "/wiki/Cockpit",
  "/wiki/Escape_pod",
  "/wiki/Level_2685",
  "/wiki/Distress_beacon",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Reen_(Bevelyn)",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Star_Wars_(2020)_27",
  "/wiki/Star_Wars_(2020)_28",
  "/wiki/StarWars.com",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}