{
 "name": "Reess Kairn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "27 BBY",
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male",
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Order of the Ffib"
     ]
    }
   ]
  }
 ],
 "content": "Reess Kairn was a male Twi'lek Jedi Knight of the Galactic Republic, who served the Jedi Order during the final decades of the Galactic Republic. Unknown to the Jedi High Council, Kairn had married a woman on his homeworld of Ryloth, whom he later murdered after discovering her infidelity. Turning to the dark side of the Force, Kairn fled the Order and paid for reconstructive surgery to change his appearance to that of a Human female. After hiding within the Order of the Ffib for several years, Kairn was hunted down by bounty hunter Aurra Sing and killed.\nReess Kairn was a Twi'lek male in the Jedi Order who reached the rank of Jedi Knight during the waning years of the Galactic Republic. On Ryloth, Kairn met a female with whom he fell in love, marrying her against the tenets of the Jedi Code and without the knowledge of the High Council. Keeping their love secret, Kairn remained an active Jedi, returning every so often to be with his wife.\nOn one occasion, Kairn returned to his home on Ryloth to find his mate with another man. Enraged, Kairn killed them both in his anger, before burning his home to the ground. Fearful of the punishment the High Council would seek against him, Kairn fled the Jedi Order and began a new life of piracy. Establishing a pirate crew, Kairn sunk deeper into the grasp of the dark side of the Force and began raiding mines and trade ships throughout the Mid Rim.\nHis last known raid was on the planet Lorahns, where he ransacked the Great Temple of the Order of the Ffib, and killed four priests during his departure. Escaping with priceless artifacts, Kairn disbanded his crew and took steps to hide his trail from the Ffib Inquisitors. He hired three Shi'ido to simulate his appearance and they dispersed across the galaxy. His own appearance was changed on Balmorra through reconstructive surgery by outlaw surgeons. He told himself he was honoring and atoning for murdering his wife and the members of the Order of the Ffib by altering his apparent species and gender into that of a Human or Near-Human female. Kairn infilitrated the Order of the Ffib disguised as a priestess who was blind; a blindfold covered lopsided scars from the surgery.\nAfter Kairn retreated to the Sanctuary Moon of Endor in 27 BBY, the \"blind priestess\" contracted the bounty hunter Aurra Sing to hunt down and kill \"Reess Kairn\". Claiming that the real Kairn had hired two Shi'ido to impersonate him, Kairn hoped that Sing would eliminate all three impersonators and believe that one was indeed the real Kairn. After Sing had traveled to Bespin, Hoth, and Tatooine and killed each impersonator, she realized that she had been deceived and returned to Endor. While Kairn hired the Thranta Mercenaries to eliminate Sing should she discover the treachery, Sing appeared in Kairn's hut and fired a fatal shot into the back of Kairn's head.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Order_of_the_Ffib",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Reconstructive_surgery/Legends",
  "/wiki/Human/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Lorahns/Legends",
  "/wiki/Great_Temple_(Lorahns)",
  "/wiki/Daughters_of_the_Ffib",
  "/wiki/Shi%27ido",
  "/wiki/Balmorra/Legends",
  "/wiki/Species/Legends",
  "/wiki/Near-Human",
  "/wiki/Endor_(planet)/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/The_Bounty_Hunters:_Aurra_Sing",
  "/wiki/Star_Wars:_Power_of_the_Jedi",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_67",
  "/wiki/The_Official_Star_Wars_Fact_File_113",
  "/wiki/The_Official_Star_Wars_Fact_File_129",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}