{
 "name": "Reeva_Demesne",
 "display_name": "Reeva Demesne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "18 BBY",
      "Hypori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Powdery green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Futures Program",
      "Republic Special Weapons Group",
      "Republic Futures Program",
      "Republic Special Weapons Group",
      "Galactic Empire",
      "Tarkin Initiative",
      "Tarkin Initiative"
     ]
    }
   ]
  }
 ],
 "content": "Reeva Demesne was a female Mirialan scientist who worked for the Galactic Republic and later the Galactic Empire, specializing in energy research. She was recruited by Orsan Krennic and unknowingly aided in the research and construction of the Death Star's superlaser. She worked alongside Galen and Lyra Erso for a time and attempted to alert them of the true purpose of their experimentation.\nDemesne was enrolled in and studied energy generation, enrichment, and enhancement at the Futures Program institute on the planet of Coruscant. She met Galen Erso, who was then working under the title of \"Professor,\" within the program and later mentored his wife Lyra Erso, who also met Galen and was proposed to during this time. Along with her friend Nari Sable, Demesne attended their wedding. Her topic of research later changed when she was drafted by Orson Krennic, newly appointed head of the Special Weapons Group by the Corps of Engineers, into the shield generator program at some point during the Clone Wars where she began work on defensive shield generators designed for capital ships and the soon-to-be named Death Star battle station.\nIn 21 BBY, Demesne reunited with Galen on Coruscant for the first time in years after he was rescued from his unwarranted imprisonment on Vallt. She invited him to an upcoming alumni reunion at the end of their conversation. At the reunion two weeks later, Demesne got a chance to speak to and catch up with Galen's wife, Lyra. She also attempted to prevent a fray between Erso and fellow scientist Dagio Belcoze near the end of the event after Belcoze accused him of being a Separatist sympathizer who revealed Republic secrets during his detainment on Vallt. Belcoze would later call Galen to apologize, blaming the alcohol he consumed for his outburst.\nUnable to contact Galen later on, Reeva later commed Lyra, who was surprised by the unexpected communication, and asked her if her husband had recently spoken to Belcoze , quickly changing subjects and telling Lyra that she was located on the planet of Hypori, vaguely hinting that the two planets held some importance. She mentioned that she was also part of Project Celestial Power before the call abruptly ended. Lyra understood from Reeva's uneasiness and indistinct tone that their communication was tapped and that she wasn't able to speak freely nor share or explain the entire truth of her remarks. Lyra shared this information with her husband. Three weeks later in a conversation with Krennic, Galen brought up his concerns of why Reeva was working on Hypori and not on Coruscant with himself as they were supposedly engaged in the same topic of research. Krennic foresaw this concern as he was secretly listening in on the Erso family's conversations of suspicion within their apartment, responding that he would look into it—a sham promise that would not be mentioned again or come to fruition.\nDiving deeper into the conspiracy Reeva alerted them of, the Ersos realized that Galen's work was being weaponized once they saw sensory data of the remnants of the Hypori research station after one of the Empire's so-called \"energy research facilities\" exploded when an experiment trying to duplicate Galen's work commenced and unexpectedly failed.\nReeva was one of the primary scientists to witness an early test fire of the superlasers being designed for the Death Star. Ensuing the demonstration she asked Krennic how the energy required for such a weapon would be stored after the successful destruction of the Hero Twins black hole systems, him answering that that wasn't for her to worry about. When she pressed for further information about the project and revealed she wanted out since she foresaw her work would bring peace through fear, Krennic promised to reassign her her colleagues to another place \"permanently.\" Not long thereafter, he ordered the energy research facility on Hypori, in the process of repair and where she was deployed, completely destroyed, killing Reeva and the other scientists stationed and secreting the Empire's work.\nDemesne had powdery green skin, her face tattooed in vertical bands of dark diamonds. Her full lips were pigmented in iridescent blue scales. She had gray hair. When meeting with Galen Erso, she wore a scarlet robe that reached the floor and a cowl that covered most of her hair. Lyra Erso described her as having a dark complexion with exotic face tattoos.\nReeva Demesne was first featured in Catalyst: A Rogue One Novel written by James Luceno and released in 2016. She was created as a character to further the plot of this prequel to the Rogue One: A Star Wars Story film, released in theaters a calendar month after the publishing of the aforementioned novel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mirialan",
  "/wiki/Galactic_Empire",
  "/wiki/Scientist",
  "/wiki/Reva_Sevander",
  "/wiki/Inquisitor",
  "/wiki/18_BBY",
  "/wiki/Hypori",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Futures_Program",
  "/wiki/Republic_Special_Weapons_Group",
  "/wiki/Tarkin_Initiative",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superlaser",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Lyra_Erso",
  "/wiki/Coruscant",
  "/wiki/Nari_Sable",
  "/wiki/Republic_Corps_of_Engineers",
  "/wiki/Clone_Wars",
  "/wiki/Deflector_shield_generator",
  "/wiki/Capital_ship",
  "/wiki/Battle_station",
  "/wiki/21_BBY",
  "/wiki/Vallt",
  "/wiki/Dagio_Belcoze",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Malpaz",
  "/wiki/Project_Celestial_Power",
  "/wiki/Erso_family",
  "/wiki/Hypori_Imperial_research_station",
  "/wiki/Hero_Twins",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/James_Luceno",
  "/wiki/2016",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Onager-class_Star_Destroyer_Expansion_Pack",
  "/wiki/Upgrade_Card_Collection"
 ]
}