{
 "name": "Regalun Petryph",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Onderon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Onderon Royal Family",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Regalun Petryph was a Human male who served as King of Onderon during the renewed Galactic War between the Sith Empire and Galactic Republic.\nPetryph was born the son of Queen Lina of Onderon. When he came of age, his mother gifted him the Royal Hunting Lodge on the eve of his first hunt.\nFollowing his ascension to the throne, Onderon had become a crucial breadbasket to the Galactic Republic amidst a galaxy-wide food shortage, but Petryph felt his government was inadequately compensated for his planet's contributions. He subsequently attempted to make alternate trade deals outside of Republic statutes and strip-mine Onderon's resources to fill his coffers only to be met with fierce resistance from Senator Deja Nebet and his council of nobles, forcing him to withdraw to his hunting lodge outside the capital of Iziz to avoid their scrutiny.\nIn 3627 BBY, Petryph was approached by Darth Savik of the Dark Council. The Dark Lord stroked Petryph's ego, convincing him that he was a strong king and that Nebet and the nobles were plotting to usurp his throne. Unbeknownst to Petryph, Savik was merely manipulating him into launching an attack on Iziz as a diversion so Imperial forces could reach the orbital control center to fire the city's cannons on the refueling Republic fleet in orbit. Additionally, she sought to use Petryph as a puppet to gain access to Onderon's resources for the Empire.\nWith the support of the Untamed, Petryph launches an assault on Iziz but was humiliatingly forced to retreat. Returning to his hunt lodge, Petryph stood in audience with Savik projecting through one of her remote droids as she reported to Darth Malgus. After Malgus ordered her to evacuate her remaining forces, Petryph complained that his rivals would see him imprisoned for his failed coup. Savik then sent him away with her droids as the Republic player, Jakarro and C2-D4 stormed the throne room.\nJust as the player tracked Savik to the Ancient Proving Grounds with the aid of the Untamed, she sent him off in an Imperial shuttle equipped with a sensor jammer, keeping him from being tracked; Petryph bade Onderon farewell, promising to return and reclaim his throne. However, after the player defeated Savik, she freely provided the jammer's algorithm, resulting in Petryph's detainment before he could reach Imperial space.\nWhen the Imperial player first arrives at the Royal Hunting Lodge, Petryph is communicating with Senator Nebet, who inquired when he would be returning to the capital, but he rebuffed her demands. Subsequently, the player thwarts an assassination attempt by Gand assassins hired by Savik before traveling to to the Ancient Proving Grounds to kill to abduct Petryph's cousins, Anosek and Anoser, and frame both incidents on Nebet and the nobles. Petryph attempts to rally his bannermen to retake Iziz but received little support, so he suggested player recruit the Beast-Lord Akoru and his Untamed.\nDuring the assault on Iziz, Petryph walks into the throne room just as Nebet kills Akoru. He proceeded to accuse her of plotting against him, to which she expresses confusion. The player can then kill Petryph and/or Nebet from hiding, gaining dark side points, yet costing the Empire's chance to control Onderon.\nAlternatively, the player can step into the spotlight, revealing Petryph's Imperial ties. Though Petryph ranted that neither she nor the Republic would rule Onderon, Nebet insisted he was nothing more than an Imperial pawn. The player can then order Petryph's bodyguards to arrest or execute Nebet. Afterwards, the player has the option of punching Petryph, much to his indignation.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Onderon/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Onderon_Royal_Family",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/King/Legends",
  "/wiki/Third_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Lina_(Onderon)",
  "/wiki/Royal_Hunting_Lodge",
  "/wiki/Planet/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Deja_Nebet",
  "/wiki/Council_of_Lords",
  "/wiki/Capital/Legends",
  "/wiki/Iziz/Legends",
  "/wiki/3627_BBY",
  "/wiki/Darth_Savik",
  "/wiki/Dark_Council",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/Jakarro",
  "/wiki/C2-D4",
  "/wiki/Gand/Legends",
  "/wiki/Anosek",
  "/wiki/Anoser",
  "/wiki/Beast-Lord",
  "/wiki/Akoru",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Regalun_Petryph",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Ramsis_Dendup/Legends",
  "/wiki/22_BBY/Legends"
 ]
}