{
 "name": "Regera Girawn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kruskan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Regera Girawn was a Force-sensitive Kruskan noblewoman who turned to the dark side, becoming a Force Witch.\nGrowing up on the remote and forgotten planet of Kruskan, Girawn lived in relative tranquility until she came into contact with a Sith holocron found by her servants. Being burnt by the device as it destroyed itself, she became mad, haunted by visions and terrifying her subjects. She was deposed, fled to the opposite side of the planet, and lived in secrecy, honing her Force-skills.\nForeseeing the first contact between her people and the Galactic Republic, Girawn made her way to the contact site, and enslaved the Republic exploration team. She used the ship to flee the planet, and went on a galaxy-wide exploration, searching for other Force-sensitives to join her.\nAfter killing two Jedi Knights, their Padawans, and many civilians on several dozens of worlds, she gained the attention of both local planetary governments and the Republic and was targeted by the Jedi Council.\nDespite being pursued by bounty hunters, Girawn enjoyed battling them, and often laid traps for her pursuers.\nFollowing her transformation, Girawn still enjoyed a pampered life, and retained acolytes and bounty hunters that saw to her every need.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kruskan",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Noble/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sith_holocron_(Kruskan)",
  "/wiki/Force_vision/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Wizards.com",
  "/wiki/Regera_Girawn,_Force_Witch"
 ]
}