{
 "name": "Reginna Bel Typolla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Malthor"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 26 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance Intelligence",
      "Sleeper Cell V-16",
      "Sleeper Cell V-16"
     ]
    }
   ]
  }
 ],
 "content": "Reginna Bel Typolla or Gina was a Human female operative who worked at the Fabrillan City Spaceport as a docking attendant. She was a member of Sleeper Cell V-16, a Rebel Alliance sleeper cell active on the planet Malthor.\nGina was born on the planet Malthor around 26 BBY. Sometime before 1 BBY she was a weapon smuggler and ran guns during the Medepiest Uprising. She survived the battle and later joined the Alliance to Restore the Republic. She worked as a docking attendant at the Fabrillan city spaceport on Malthor but was also part of Sleeper Cell V-16.\nAs part of her duties to the Rebels she would make copies of shipping manifests, ship registries and other incoming ship data on an apparently damaged datadisc. She would dispose of the disc and Berren Sid Té or a member of his information network would retrieve the information for processing. She knew Sid but was unaware that he was also part of Sleeper Cell V-16. He was not told of her identity either but after a year he accidentally discovered her identity.\nGina was a Human female and a native to Malthor. She had a dark history and attempted to keep it hidden from her Rebel allies but was unaware that they knew about her role in the Medepiest Uprising.\nGina was had the skills of an average smuggler. She could fly space transports, repulsorlift vehicles and even archaic starfighters. She could also work sensors and shields of a starship. She had knowledge of navigating planetary bureaucracies and had traveled the galaxy a fair amount so was familiar with other planetary systems. In combat she was decent with a hold-out blaster. She was very knowledgeable with security systems which aided her as a Rebel agent.\nShe carried miscellaneous tools and datapads as part of her job. She also had datacard keys to the spaceport and carried a hold-out blaster and wore a blast vest for protection. Along with Margo Flarestream, Reginna Bel Typolla's transport was a stock Ghtroc freighter, called Pepper's Hope.\nReginna Bel Typolla was designed by Ted Stark for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Brian Schomburg.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Malthor",
  "/wiki/26_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Sleeper_Cell_V-16",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Operative",
  "/wiki/Fabrillan",
  "/wiki/City/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Sleeper_cell",
  "/wiki/Planet/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Medepiest_Uprising",
  "/wiki/Datacard/Legends",
  "/wiki/Berren_Sid_T%C3%A9",
  "/wiki/Transport/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Blast_vest",
  "/wiki/Margo_Flarestream",
  "/wiki/Ghtroc_Industries/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Pepper%27s_Hope",
  "/wiki/Ted_Stark",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Brian_Schomburg"
 ]
}