{
 "name": "Reidi_Artom",
 "display_name": "Reidi Artom",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Reidi Artom was a female Near-Human space explorer that discovered and named the Reidi Artom I, Reidi Artom II, Reidi Artom III, Reidi Artom IV, and Reidi Artom V systems. Additionally, she rediscovered the Cularin system  in 232 BBY.\nReidi Artom belonged to a long-lived humanoid species. Her people generally stayed on their own planet, something a young Artom did not understand. She loved excitement, adventure, and the thrill of exploration, so she escaped her homeworld early in her life. For years, she wandered aimlessly, working whatever jobs would allow her to get from one place to another.\nArtom gained her exploring vessel, the Trailblazer, in a unique manner. After she stowed away on the scout vessel, the ship came under attack. After the pilot was killed, nearly instantly, the ship was left floating in space. She made repairs and, after using the hyperdrive to get to a starport, registered the ship in her own name. In an effort to explore new systems and undiscovered space while getting paid for it, Reidi became a scout for the Galactic Republic. Although many scouts explored the Unknown Regions or the Outer Rim, Reidi surveyed the Exploration Region to find planets that had been overlooked. She was credited with the renewed interest that followed her explorations in at least eight systems.\nDuring her first scouting in the Cularin system in 232 BBY, Artom visited the system from the outer to the inner planets. As such, she found the Almas Sith fortress in Almas; the Crystal Snare in the Cularin system asteroid belt, and the mysterious lava-like creature of Rennokk in her second visit to the moon. She also befriended the Tarasin native species of Cularin to the extent that she was taken to the Sacred Ch'hala Tree Grove — a honor that was bestowed to few outworlders since.\nArtom spent nearly twenty-five years charting the Cularin system. She and her crew were credited with founding the settlement of Gadrin on Cularin. She was last seen heading off to explore the Unknown Regions in 207 BBY. Due to the length of her people's lives, as of 31 BBY it was believed that she could still possibly be alive and exploring.\nReidi Artom's impact was clear within the Cularin system, as time was measured on both Cularin and Almas by the A.A.  time system. This time system measured its starting point at the discovery of the system.\nA 60 meter-tall statue of Artom stood in front of a museum dedicated to her in Gadrin; the statue was visible from House Hirskaala, and was used for a medal ceremony organized by Governor Barnab Chistor of Gadrin in 31 BBY.\nLavina Wren, the Republic Senator for Cularin was rumored to be a distant descendant of Artom.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Reidi_Artom_I_system",
  "/wiki/Reidi_Artom_II_system",
  "/wiki/Reidi_Artom_III_system",
  "/wiki/Reidi_Artom_IV_system",
  "/wiki/Reidi_Artom_V_system",
  "/wiki/Cularin_system",
  "/wiki/232_BBY/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Species/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Trailblazer",
  "/wiki/Scout_vessel",
  "/wiki/Starship/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Transponder_code",
  "/wiki/Star_system/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Exploration_Region",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Almas",
  "/wiki/Crystal_Snare",
  "/wiki/Cularin_system_asteroid_belt",
  "/wiki/Rennokk",
  "/wiki/Moon/Legends",
  "/wiki/Tarasin",
  "/wiki/Cularin/Legends",
  "/wiki/Sacred_Ch%27hala_Tree_Grove",
  "/wiki/Gadrin",
  "/wiki/207_BBY",
  "/wiki/31_BBY/Legends",
  "/wiki/After_Artom",
  "/wiki/House_Hirskaala",
  "/wiki/Governor/Legends",
  "/wiki/Barnab_Chistor",
  "/wiki/Lavina_Durada-Vashne_Wren",
  "/wiki/Senator/Legends",
  "/wiki/A_Cularin_Presence",
  "/wiki/The_Resistance_Within",
  "/wiki/A_Revelation",
  "/wiki/An_Uneasy_Peace",
  "/wiki/Find_the_Lady",
  "/wiki/Quarters",
  "/wiki/Holes",
  "/wiki/Philology",
  "/wiki/Shadows_in_Green",
  "/wiki/At_Your_Service",
  "/wiki/In_the_Name_of_the_Maker",
  "/wiki/Cloak_and_Vibroblade",
  "/wiki/The_Replacements",
  "/wiki/Plea_Bargain",
  "/wiki/The_Eye_(roleplaying_adventure)",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Wizards.com",
  "/wiki/Cularin%27s_Lady_Senator,_Lavina_Wren",
  "/wiki/Senator_Wren%27s_Social_Calendar",
  "/wiki/A_Changing_Galaxy",
  "/wiki/Almas_(article)",
  "/wiki/Long_Live_the_Republic",
  "/wiki/Cularin_at_Night",
  "/wiki/Reidi_Artom%27s_Expansion_Manifesto",
  "/wiki/Manifesto_My_Foot",
  "/wiki/A_Mother%27s_Memoirs,_Continued",
  "/wiki/Home_of_Wisdom_(article)",
  "/wiki/All_Comers",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}