{
 "name": "Reiva Carrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Phaeda"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Reiva Carrick, a Human female, was a gardener from the planet Phaeda and the mother of Jedi Padawan Zayne Carrick. Reiva was married to a banker named Arvan Carrick, with whom she had five children, Zayne being the only son. In 3977 BBY, the five-year-old Zayne, who turned out to be Force-sensitive, was referred to the Jedi Enclave on the planet Dantooine. Although the boy's Force affinity proved to be marginal, Jedi Master Vandar Tokare convinced Reiva that her son would be safe in the Jedi Order. In 3964 BBY, Zayne was accused of murdering four other Padawans in his class, but neither Reiva nor the rest of her family believed the charges.\nA Human female, Reiva Carrick was a native of the planet Phaeda, located in the Outer Rim Territories. A gardener, she married a banker named Arvan Carrick, with whom she bore five children—Zayne, their only son, was born in 3982 BBY. Just after Zayne's fifth birthday, the child, discovered to be Force-sensitive, was referred to the Jedi Enclave on the planet Dantooine. The Jedi Knight who suggested Zayne be taken to Dantooine told Reiva that the boy only had a marginal proclivity to the Force. Although this was confirmed on Dantooine by Jedi Master Vandar Tokare, the Jedi were impressed by Zayne's ability to form kinships with the other younglings at the Enclave. The Jedi's examination of young Zayne took a full morning—after it was over, Reiva sought Tokare out, hoping to learn more about her son's prospects. Although Reiva was unsure whether the Jedi Order was a safe place for her child, remembering the events of the Great Sith War some time before, Tokare assured her that Zayne would be free from danger with the Jedi.\nIn 3964 BBY, Zayne, now a Jedi Padawan in training on the planet Taris, was accused of murdering four of his classmates. Zayne went on the run, and word of his alleged crimes eventually reached the Carrick family. Reiva and her husband did not believe that their son would do such a thing, although it became difficult at home. A few weeks later, Arvan was transferred to the major corporate world of Telerath—Reiva and Arvan believed that the opportunity had to do with the news about their son, and they moved to Telerath along with their four daughters. In 3963 BBY, Arvan was kidnapped by the Moomo Brothers, a pair of Ithorian bounty hunters, but was saved by Zayne, who happened to be on Telerath at the time. After the ordeal, Reiva, Arvan and their daughters left Telerath and moved to Dantooine, where Tokare welcomed them with open arms at the Jedi Enclave.\nIn her son Zayne's youth, Reiva Carrick was very protective of her little boy and was concerned for his safety if he were to join the Jedi Order. However, she had her fears assuaged by Master Vandar Tokare. Just like her husband, Carrick refused to believe that Zayne was responsible for the deaths of the other Padawans on Taris, knowing it to be out of his character. Carrick had light skin and brown hair.\nReiva Carrick first appeared in a flashback in the comic Knights of the Old Republic 2, written by John Jackson Miller and released in 2006. Carrick was also mentioned in several more issues of the Knights of the Old Republic comic series, along with the Knights of the Old Republic Handbook.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Phaeda/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Zayne_Carrick",
  "/wiki/Marriage/Legends",
  "/wiki/Banker/Legends",
  "/wiki/Arvan_Carrick",
  "/wiki/3977_BBY",
  "/wiki/Standard_year/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Dantooine/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vandar_Tokare",
  "/wiki/Jedi_Order/Legends",
  "/wiki/3964_BBY",
  "/wiki/Padawan_Massacre",
  "/wiki/Carrick_family",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/3982_BBY",
  "/wiki/Birthday/Legends",
  "/wiki/Unidentified_Jedi_Knight_(Zayne_Carrick)",
  "/wiki/Youngling/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Telerath/Legends",
  "/wiki/3963_BBY",
  "/wiki/Moomo_Brothers",
  "/wiki/Ithorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Knights_of_the_Old_Republic_2",
  "/wiki/John_Jackson_Miller",
  "/wiki/2006",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_(comic_series)",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook",
  "/wiki/Knights_of_the_Old_Republic_1",
  "/wiki/Knights_of_the_Old_Republic_8",
  "/wiki/Knights_of_the_Old_Republic_12",
  "/wiki/Knights_of_the_Old_Republic_24",
  "/wiki/Knights_of_the_Old_Republic:_War_5",
  "/wiki/The_Essential_Atlas"
 ]
}