{
 "name": "Rel_Rogock",
 "display_name": "Rel Rogock",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Lok"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lok miners"
     ]
    }
   ]
  }
 ],
 "content": "Rel Rogock was a Human male miner who lived on Lok during the Galactic Civil War.\nAfter the Battle of Yavin, Rel Rogock worked in a mining facility operated by the Galactic Empire. During that time, he served as the grand foreman.\nIn 1 ABY, the miners hit a gas pocket, releasing toxic vapors in the mine. The gas did not physically injured the miners but made them crazy and very aggressive. Rel Rogock and the mine controller Teemu Komo then commanded the miners in random attacks against inhabitants of Lok. The situation in the mine was later discovered by Nym's Lok Revenants, the powerful criminal organization on Lok. Jinkins, Nym's chief engineer, thus decided to obtain a sample of the gas in order to study it and use it as a weapon if possible. Jinkins thus tasked a group of adventurous spacers of the Lok Revenants with retrieving a sample of toxic gas. While Jinkins was preparing the assault, Grenz Zittoun, another lieutenant of Nym, realized that the raid on the mine could be an opportunity to get rid of the mine controller and the grand foreman. The Lok Revenants then raided the Imperial mine and retrieved a sealed container of the poisonous gas for Jinkins. During the assault, the spacers attacked and killed both Rel Rogock and Teemu Komo, thereby stopping the attacks on the people of Lok.\nRel Rogock was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Rel Rogock was added to the game as part of the revamped \"Nym's Theme Park,\" released with the \"Game Update 16,\" on March 23, 2010.\nDuring the conversation that started the quest \"Out of My Mine,\" Grenz Zittoun incorectly stated that the Grand Foreman of the Imperial Mine was Ran Machado. Machado was in fact a member of the Lok Revenants.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_Mine_(Lok)",
  "/wiki/Grenz_Zittoun",
  "/wiki/Mining/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Teemu_Komo",
  "/wiki/Nym/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Jinkins",
  "/wiki/Spacer/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_23",
  "/wiki/2010",
  "/wiki/Ran_Machado",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}