{
 "name": "Relgon Starkill",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 0 BBY and 3 ABY",
      "Smoking Forest",
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Razor Runners"
     ]
    }
   ]
  }
 ],
 "content": "Relgon Starkill was a Human male who lived during the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. By the time following the Battle of Yavin in 0 BBY, Starkill served as a captain for the Razor Runners, a group of mercenaries which occupied the Smoking Forest, a region of the planet Mustafar filled with tree-like rock chimneys. Relgon Starkill was killed by a spacer sent by the Naboo historian Pletus Croix, who wished to recover two pieces of an ancient glyph that was taken by the Razor Runners.\nRelgon Starkill was a Human male who lived during the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. By the time following the Battle of Yavin in 0 BBY, Starkill served as a captain of the Razor Runners, a mercenary group which originated from the planet Coyn. The Razor Runners had since relocated to the lava world of Mustafar, securing an area of the planet called the Smoking Forest for its large number of tree-like rock chimneys. Despite occupying the area, Emperor Palpatine refused to supply any troops to clear them out. Left unchecked, the Razor Runners prevented Pletus Croix, a Naboo historian, from studying three altars containing glyphs detailing historical information about Mustafar. The Razor Runners, most likely hired by someone to secure the ruins for financial gain, were unwilling to allow strangers such as Croix to conduct his research. The Razor Runners even went so far as to deface one of the ancient glyphs, causing two huge portions of it to go missing. One of the two chunks fell into the possession of Starkill, rendering Croix unable to study it further.\nPletus Croix, ever determined to learn about Mustafar's past, happened across a spacer willing to aid in his pursuit in return for payment. Croix, suspecting that commanding officers Relgon Starkill and Hal Razor possessed the two missing pieces, instructed the individual to defeat them and recover the fragments. Despite Starkill's skill at ranged combat, the captain was bested by the spacer dispatched by Croix, and was killed during combat. Starkill's senior officer, Hal Razor, faced a similar fate, and the spacer successfully returned the two missing glyph fragments to Croix for further study. For their part in recovering the fragments, Croix awarded the spacer with credits and a DP-23 Rifle.\nYounger than his superior officer, Commander Hal Razor, Relgon Starkill had fair skin, blond hair, and brown-colored eyes. He was also skilled at ranged combat.\nDuring his time with the Razor Runners, Relgon Starkill wore red bounty hunter armor, a type of assault armor typically worn by bounty hunters. He also wore a type of tactical goggle over his left eye, a mechanical monocle which closely resembled the Novaless Soni-Optics Goggles Mark V. Starkill was armed with multiple rifles, including a T-21 light repeating blaster, an Sg-82 sonic rifle, and an E-11 blaster rifle. Secondary weapons included a stun baton, survival knife, and vibroblade. At the time of his death he also possessed an assault armor chest plate known as Coyn's Protector, which resembled that of composite armor, and a magnetite cleaner.\nRelgon Starkill was a non-player character in Star Wars Galaxies: Trials of Obi-Wan, a 2005 expansion pack to Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Starkill was featured in a quest titled \"Unlocking the Secrets,\" in which players were tasked by the historian Pletus Croix to kill Relgon Starkill and Hal Razor in order to recover glyph fragments. Completing these objectives awarded the player 10,000 credits and a DP-23 Rifle. Players who looted Starkill's corpse could also find Coyn's Protector assault armor and a dimly glowing magnatite cleaner, an item which could be used in a Chu-Gon Dar cube to create special items. Although the player could choose not to do Croix's quest, this article assumes 100% game completion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Starkiller_(disambiguation)",
  "/wiki/0_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Smoking_Forest/Legends",
  "/wiki/Mustafar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Razor_Runners",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Death/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Historian/Legends",
  "/wiki/Pletus_Croix",
  "/wiki/Coyn",
  "/wiki/Magma/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Canon",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Hal_Razor",
  "/wiki/Senior_officer/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/DP-23_Rifle",
  "/wiki/Officer/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Bounty_hunter_armor",
  "/wiki/Armor/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Goggles/Legends",
  "/wiki/Novaless_Soni-Optics/Legends",
  "/wiki/Goggles_Mark_V",
  "/wiki/Rifle/Legends",
  "/wiki/T-21_light_repeating_blaster/Legends",
  "/wiki/Sg-82_sonic_rifle",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Stun_baton/Legends",
  "/wiki/Survival_knife",
  "/wiki/Vibroblade/Legends",
  "/wiki/Composite_armor",
  "/wiki/Magnetite/Legends",
  "/wiki/Talking_magnetite_cleaner/Legends",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Chu-Gon_Dar_cube",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}