{
 "name": "Rell_(mercenary)",
 "display_name": "Rell  (mercenary)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1000 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Brotherhood of Darkness"
     ]
    }
   ]
  }
 ],
 "content": "Rell was a male Human mercenary and a non-Force-sensitive member of the Brotherhood of Darkness during the New Sith Wars. Rell fought during in Ruusan campaign in 1000 BBY, but deserted the Brotherhood along with seven other mercenaries following the Brotherhood's defeat at the Seventh Battle of Ruusan. Following the battle, Rell and his companions began to scavenge for supplies and treasures at the now-abandoned Sith camp when they were attacked by Darth Bane, the last Dark Lord of the Sith. Rell attempted to flee the camp but was decapitated by Bane's lightsaber before Rell could reach the safety of the nearby woods.\nA non-Force-sensitive Human male mercenary, Rell was hired by the Sith Brotherhood of Darkness to fight in the New Sith Wars against the Galactic Republic. In 1000 BBY, Rell served in the long, hard fought Ruusan campaign on the planet Ruusan. However, following the defeat of the Brotherhood at the Seventh Battle of Ruusan, Rell deserted the Brotherhood along with seven fellow Human mercenaries: the males Derrin, Pad, Hansh, Lergan, another male, and a pair of female mercenaries.\nSoon after the end of the battle, Rell and his companions went to the now-abandoned Sith camp to scavenge for supplies and loot the possessions of the dead Sith Lords. Piling all their plunder in the center of the camp, Pad and Derrin were assigned sentry duty, while Rell and the rest of the group began to debate which of their swag was actually worth anything. However, as Rell argued with his cohorts, the camp was attacked by Darth Bane—the last surviving Dark Lord of the Sith—looking to take the mercenaries' supplies for himself. Before Rell and the others could react, Bane killed Pad and Derrin, slicing them open with his lightsaber. Now realizing they were under attack, the remaining mercenaries began to fire at Bane with their blaster rifles, but the Sith Lord easily deflected their shots with his lightsaber.\nKnowing their only chance of survival against a Sith Lord was to escape, Rell and the other mercenaries split off in different directions, running for their lives. As Bane use his power over The Force to break the neck of one of the females and killed Hansh and Lergan with Force lightning, Rell and the other two living mercenaries fled towards the nearby woods. However, just as Rell had almost reached the woods, he risked a glance to see if Bane was pursuing him. On a whim, Bane threw his lightsaber at Rell, decapitating the mercenary.\nBane allowed the last two mercenaries to escape, knowing that it was unlikely anyone would believe the survivors' story of a Sith Lord that killed Rell and the others but let them escape.\nDespite the fact Rell had been hired by the Brotherhood of Darkness, he truly had no loyalty to the Sith organization. After the defeat of the Brotherhood at Ruusan, Rell deserted the Sith and began to loot their camp, hoping to scavenge whatever he could from his dead commanding officers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rell",
  "/wiki/1000_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Ruusan_campaign",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ruusan/Legends",
  "/wiki/Derrin",
  "/wiki/Pad",
  "/wiki/Hansh",
  "/wiki/Lergan",
  "/wiki/Unidentified_male_mercenary_(Ruusan)",
  "/wiki/Unidentified_female_mercenary_(Ruusan)",
  "/wiki/Unidentified_female_mercenary_(Telekinesis)",
  "/wiki/Death/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)"
 ]
}