{
 "name": "Remart_Sasyru",
 "display_name": "Remart Sasyru",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Khuiumin Survivors"
     ]
    }
   ]
  }
 ],
 "content": "Remart Sasyru was a large, attractive, Human male member of the Khuiumin Survivors serving the Invids in Bolt. He was a tall, muscular, and handsome Human male, with dark black mid-length hair and blue eyes. He wore a goatee and long, winged mustaches.\nSasyru began his Survivor career in Rock Squadron. Seeming to have a fetish for furred humanoids, Sasyru befriended albino Shistavanen wolfwoman and fellow Rock, Caet Shrovl. His intentions were not honorable. He manipulated Shrovl and developed a trust with her. He then made demands of her which she rejected. In response, he beat the Shistavanen badly. Although it was a great honor to be voted into Bolt , it was for reasons like his treatment of Caet that prompted his squadmates to vote him into the Bolts at their first opportunity.\nWhen Corran Horn under the alias Jenos Idanian infiltrated the Survivors, there was an immediate dislike and rivalry between the two pilots. This fact was well-known within the Survivors. Much to Sasyru's chagrin, Corran was elevated to Captain of the Bolts by Leonia Tavira herself. But, in response to Corran's spurning her, Tavira selected Sasyru to be her consort. This was done solely to anger Corran, and it worked.\nOn a mission to the Caamasi colony world of Kerilt, Sasyru tried to steal Caamasi heirlooms from the colonists. When a young female Caamasi, Releqy A'Kla, asked to keep a particular heirloom, Sasyru only would agree in exchange for sexual favors. When she refused, Sasyru tried to force himself on the young Caamasi. Her father, Elegos A'Kla intervened and Sasyru struck him. At this moment, Corran arrived at the scene. He succeeded in goading Sasyru into a fist fight. Sasyru was no match for Corran, and his good looks were destroyed due to the furious beating Corran gave him. Upon returning to the Invidious, Tavira had Sasyru executed for insubordination and striking a superior officer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Khuiumin_Survivors",
  "/wiki/Invids",
  "/wiki/Bolt_Squadron_(Khuiumin_Survivors)",
  "/wiki/Rock_Squadron",
  "/wiki/Humanoid/Legends",
  "/wiki/Albino",
  "/wiki/Shistavanen/Legends",
  "/wiki/Caet_Shrovl",
  "/wiki/Corran_Horn",
  "/wiki/Jenos_Idanian",
  "/wiki/Pilot/Legends",
  "/wiki/Leonia_Tavira",
  "/wiki/Caamasi",
  "/wiki/Kerilt",
  "/wiki/Releqy_A%27Kla",
  "/wiki/Elegos_A%27Kla",
  "/wiki/Invidious",
  "/wiki/I,_Jedi"
 ]
}