{
 "name": "Remex Io",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Clawdite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kendoh Gang"
     ]
    }
   ]
  }
 ],
 "content": "Remex Io was a Clawdite male who worked in the Kendoh Gang led by Kendoh Voss. During the New Republic Era, he worked alongside Voss and Wooro to pull a job on the planet Batuu.\nAs a child, Io pulled off a heist. By 34 ABY, he had joined Kendoh Voss's crew. At the Wayward Comet refueling station, Io, posing as a female, was bumped into by known Resistance member Finn. He informed Kendoh of his run-in with Finn. Remex was ordered by Kendoh to follow Finn to his and Commander Poe Dameron's ship and tag it. Io and the rest of Voss' crew followed Finn, Dameron and their team to Base 354-23X on the Moon of Avedot. There, Io killed Tonkins, took his form and open fired on Finn and the other Resistance agents.\nIo and the crew then cut their way through one of the base's doors. As they entered, Finn got a drop on Io. He fought Finn by taking on the form of a Lasat and a Wookiee. However, he was stunned by Wooro. After recovering, he discovered that Dameron was there and had a bigger bounty. However, Basso Mak was killed and Dameron and Finn escaped.\nIo went to Batuu's Black Spire Outpost. He saw that a First Order TIE echelon was landing at the outpost. Io met with Voss and Wooro after taking a circuitous route in order to avoid the stormtroopers of the First Order's 709th Legion. Io, posing as a human, went with Voss and Wooro to meet with Dok-Ondar at his Den of Antiquities. He and crew mates listened to Dok-Ondar's story about how Captain Han Solo and his First Mate Chewbacca had given him a sarlacc. During this time, Io placed a video droid in shop without Dok-Ondar discovering it. After their audience with Dok-Ondar, Io left with his crew mates after Voss had given Dok-Ondar their bait.\nAboard their ship, Io and his crew mates listened as Dok-Ondar told a First Order stormtrooper sergeant the story of how he acquired Jedi Master Ki-Adi-Mundi's lightsaber. Following departure of the stormtroopers, Io and his crew mates discovered that Dok-Ondar had a Sith relic. Voss and her crew decided to steal it the following night.\nLater, Io was spotted by the First Order and pursued by stormtroopers. After firing on them and fleeing, Io shapeshifted to disguise himself, pretending to help the First Order by directing them to the spaceport. As he walked away, Dok-Ondar's Clawdite enforcer Varg attacked him, grabbing him by the throat and taunting him that he knew about their plans against Dok-Ondar. He then incapacitated Io and shapeshifted into him to met Voss at Oga's Cantina later. There, he told her that they had been made and needed to leave Batuu, but Voss confidently said that she had their plan figured out.\nAs a changeling, Io was able to assume the form of anyone he chose. He was capable of taking on humanoid forms.\nRemex Io first appeared in Galaxy's Edge 1, a comic written by Ethan Sacks, illustrated by Will Sliney, and published on April 24, 2019. Io's surname was not given in the first comic, but was displayed in Aurebesh on a wanted poster in the background of one of the panels. His surname would later first be spoken by a First Order stormtrooper in Galaxy's Edge 3.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/Clawdite",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kendoh_Gang",
  "/wiki/Kendoh_Voss",
  "/wiki/New_Republic_Era",
  "/wiki/Wooro",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/34_ABY",
  "/wiki/Wayward_Comet",
  "/wiki/Poe_Dameron",
  "/wiki/Base_354-23X",
  "/wiki/Moon_of_Avedot",
  "/wiki/Basso_Mak",
  "/wiki/Black_Spire_Outpost",
  "/wiki/First_Order",
  "/wiki/TIE_echelon",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/709th_Legion",
  "/wiki/Dok-Ondar",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Han_Solo",
  "/wiki/First_Mate",
  "/wiki/Chewbacca",
  "/wiki/Sarlacc",
  "/wiki/Unidentified_First_Order_stormtrooper_sergeant",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Ki-Adi-Mundi%27s_lightsaber",
  "/wiki/Sith",
  "/wiki/Sith_artifact",
  "/wiki/Varg",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Galaxy%27s_Edge_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Will_Sliney",
  "/wiki/April_24",
  "/wiki/2019",
  "/wiki/Aurebesh",
  "/wiki/Stormtrooper",
  "/wiki/Galaxy%27s_Edge_3",
  "/wiki/Allegiance_1",
  "/wiki/Allegiance_2",
  "/wiki/Allegiance_3",
  "/wiki/Allegiance_4",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Galaxy%27s_Edge_4",
  "/wiki/Galaxy%27s_Edge_5",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Marvel_Comics"
 ]
}