{
 "name": "Remi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Devaron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Acolytes of the Beyond"
     ]
    }
   ]
  }
 ],
 "content": "Remi was a human male who was a member of the Acolytes of the Beyond. In 5 ABY, during a revolution staged by the acolytes in Coronet City on the planet Corellia, Remi was taken to the local Peace and Security station in the city by a detective named Erno, after he caught the boy vandalizing a wall with the message 'Vader lives' and a picture of Vader's armor on it. After being rescued by Kiza, a Pantoran female and fellow acolyte, Remi went to the archives located underneath the station and returned with a red bladed lightsaber which he used to cut off one of Erno's hands.\nPrior to the Battle of Jakku, Remi and his fellow Acolytes traveled to the planet Devaron. Remi grew besotted with his new lightsaber acquisition and delved deeper into the dark side of the Force. Remi incurred the wrath of the late Emperor Palpatine's former adviser Yupe Tashu when he expressed jealousy that Kiza had received the mask of Viceroy Exim Panshard. As punishment, Tashu stripped him of the lightsaber and handed it to Kiza. Overcome by rage and jealousy, Remi tried to recover his blade from Kiza during the attack on a New Republic outpost. However, Kiza killed him with the lightsaber.\nRemi was an adolescent who lived during the Age of the Empire. Following the Battle of Endor, Remi began experiencing Force visions of fallen Sith who had gone to the Beyond. He joined a cult known as the Acolytes of the Beyond, who revered the Sith and the dark side of the Force. During that time, Remi befriended and became romantically attached to a Pantoran girl named Kiza, who was also an Acolyte. Remi played a role in planning and organizing the Coronet City revolution. He falsified the papers which enabled Kiza to infiltrate the local Peace and Security station disguised as a secretary. Their plan was to steal an ancient lightsaber from the archives beneath the police station.\nAs part of the plan, Remi spray-painted the Darth Vader mask sigil and the message \"VADER LIVES\" onto the side of the P\u0026S station. He was promptly arrested by the Corellian detective Erno, who brought him in for questioning. Remi remained uncooperative and told Erno that Vader was still alive. When Erno pointed out that Darth Vader had perished during the Battle of Endor, Remi responded that death was not the end. When Erno demanded to know the boy's name as part of the booking process, Remi responded that his name was Oblivion.\nErno offered to be lenient on the boy if he named his other Acolyte comrades. However, Remi remained defiant. When Erno dismissed the Acolytes as a \"buncha suck-ups\" for the Empire, Remi responded that he was not serving the Empire but something greater. Erno then asked Remi why he was not wearing a mask and remarked that Vader was a bad guy. Remi responded by asking Erno if he was a good man. When Erno questioned him about the mask again, Remi responded that an Acolyte had to earn it. Remi then added that the building was old and that he knew that the museum next door shared the basement with the P\u0026S station.\nBefore Erno could question the boy further, the security officer Spob Rydel entered the interrogation room to inform Erno that the Acolytes were attacking Coronet City. While Erno was distracted, Remi escaped from the room and made his way downstairs into the archives. Meanwhile, Kiza killed Erno's fellow detectives. Before Erno could stop Kiza, Remi returned and sliced off Erno's blaster hand with his lightsaber. After recovering the weapon, Kiza clubbed Erno on the head and told the detective to warn his people that the Acolytes were coming.\nAfter obtaining the lightsaber, Remi grew more egotistical and obsessed with the weapon. As an esteemed Acolyte, Remi was allowed to keep the lightsaber. Remi and his fellow Acolytes then gathered on the planet Devaron to attack a New Republic outpost near an old Jedi temple. Their attack was part of a coordinated series of strike against the New Republic across the galaxy. Prior to the attack, Remi, Kiza, and the other Acolytes gathered around their master Yupe Tashu, who had been one of the late Emperor Palpatine's advisers.\nHaving conferred with the spectres of fallen Sith, Tashu gifted the mask of Viceroy Exim Panshard to Kiza. Remi became jealous and demanded that he possess the mask. Tashu chastised Remi for angering the fallen spirits. As punishment, he confiscated Remi's lightsaber and gave it to Kiza. Remi and his fellow Acolytes then attacked the New Republic outposts with various weapons including clubs, machine shop blades, and chop-axes, which had all been painted in red.\nOvercome by rage and jealousy, Remi took advantage of the confusion of battle to attack Kiza. He managed to throw her to the ground and knock the lightsaber out of her hand. Remi denounced his former lover as unworthy and claimed that the lightsaber rightfully belonged to him. Following a struggle, Kiza managed to find the lightsaber and shoved the blade through Remi's skull, killing him. Kiza then rejoined the attack on the New Republic outpost.\nRemi was a male Human who was around fourteen or fifteen years old in the months following the Battle of Endor. He was known to have unusually white teeth. According to his lover Kiza, Remi had the perfect mix of confidence and injury. She likened him to a tamed monster and a fire whose flame was both brutal and beautiful. Remi was young, angry, and gorgeous.\nDespite not being Force-sensitive, Remi experienced Force visions of fallen Sith. He joined the Acolytes of the Beyond and shared their reverence for the Sith and dark side of the Force. Remi regarded his movement as being greater than the Empire. Remi refused to recognize lawful authority and remained defiant while being interrogated by the detective Erno. Remi also knew how to use a lightsaber and severed one of Erno's hands with it.\nAfter obtaining the lightsaber, Remi grew more egoistical and arrogant. He believed that his lover Kiza was unworthy of inheriting a Sith relic known as the mask of Exim Panshard. Overcome by rage and jealousy, Remi attacked Kiza and tried to recover his lightsaber. However, Kiza shoved the blade through his skull, killing him and causing his eyes to burn to cinder.\nRemi first appeared as a minor antagonist in Chuck Wendig's 2016 novel Aftermath: Life Debt. He also appeared in the 2017 novel's sequel Aftermath: Empire's End, where he was first identified as Remi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Corellia",
  "/wiki/5_ABY",
  "/wiki/Devaron",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Acolytes_of_the_Beyond",
  "/wiki/Coronet_City_revolution",
  "/wiki/Coronet_City",
  "/wiki/Planet",
  "/wiki/Peace_and_Security_Headquarters",
  "/wiki/City",
  "/wiki/Detective",
  "/wiki/Erno",
  "/wiki/Anakin_Skywalker",
  "/wiki/Vader%27s_armor",
  "/wiki/Kiza",
  "/wiki/Pantoran",
  "/wiki/Color",
  "/wiki/Kiza%27s_lightsaber",
  "/wiki/Battle_of_Jakku",
  "/wiki/Lightsaber",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Yupe_Tashu",
  "/wiki/Mask_of_Viceroy_Exim_Panshard",
  "/wiki/Viceroy",
  "/wiki/Exim_Panshard",
  "/wiki/Attack_on_a_New_Republic_outpost",
  "/wiki/Imperial_Era",
  "/wiki/Battle_of_Endor",
  "/wiki/Force_vision",
  "/wiki/Corellian",
  "/wiki/Spob_Rydel",
  "/wiki/Blaster",
  "/wiki/New_Republic",
  "/wiki/Temple_of_Eedit",
  "/wiki/Force-sensitive",
  "/wiki/Chuck_Wendig",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/2017",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)"
 ]
}