{
 "name": "Ren_(human)",
 "display_name": "Ren  (human)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "28 ABY",
      "Minemoon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Knights of Ren",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "\"Ren\" was the alias of a human male Force-sensitive who led the Knights of Ren during the last year of the Galactic Civil War and well into the era of the New Republic. A user of the dark side of the Force, Ren was heavily scarred and disfigured, though he made no attempt to hide the damage. During his time with the Knights of Ren, Ren sought to induct other dark side users into their ranks.\nAfter encountering Ben Solo, Padawan to Jedi Master Luke Skywalker, during a confrontation on the planet Elphrona, Ren sensed that the Force was strong with the young Jedi, and suggested that he follow the path of the dark side. Several years later, Solo contacted Ren seeking to join the Knights of Ren after the Jedi Order fell to ruin.\nSometime prior to the last years of the Galactic Civil War, the human male that later became known as Ren took that name from a Force-sensitive individual that originally held that alias. After taking his lightsaber, Ren eventually became the new leader of the Knights of Ren.\nRen and his knights followed the dark side of the Force and an ideology based on the red-bladed lightsaber wielded by him. During his time as a user of the dark side, Ren became heavily scarred and burned. Traveling throughout the galaxy, the Knights of Ren searched for other Force users to join their ranks. During the Imperial Era, Ren and his knights remained in hiding on multiple backwater planets to avoid the Galactic Empire.\nDuring the last year of the Galactic Civil War, Ren and his knights met Lady Qi'ra, who found them at a bar on Varnak. Qi'ra asked Ren and his knight to join Crimson Dawn and help her defeat Darth Sidious—Dark Lord of the Sith and Galactic Emperor—and his Empire. Qi'ra convinced Ren by saying that him and his knights would be free from the Sith and they'll be able to claim glory. Following the auction for Han Solo and the battle over Jekara, Ren and his Knights met with Qi'ra and her other allies aboard the Vermillion.\nHaving learned the origins of Crimson Dawn from Lady Qi'ra, dating back to its creation by Maul, the former Sith apprentice of Sidious, the Knights of Ren agreed to steal a key from Fortress Vader on Mustafar for Qi'ra with the agreement that they could steal anything from the fortress for themselves as compensation.\nWhile Ren and Marinda sparred on the Night Buzzard while en route to their destination, he confessed to his knights that Qi'ra's provided them with access codes along with a map of the fortress. When some of his comrades questioned the idea of infiltrating the fortress, Ren claimed that they needed to strike now that the Emperor was busy with \"bigger fish\" before he had a chance to get them.\nOnce they arrived at the plains of Gahenn on Mustafar, the knights made their way to an old entrance with their bikes. The entrance was covered by lava, which prompted Ren and his knights to use the dark side of the Force to remove the lava and clear the path. The knights entered the Sith cave so they could go into the fortress undetected. After entering the castle, they were spotted by Vaneé, who called various Lava Troopers to attack to knights. Ren sliced through his enemies with his lightsaber while his knights blasted the troopers.\nThe knights eventually made it to Darth Vader's vault, and Ren managed to recover the screaming key after using the Force to locate it. As they realized that the troopers left, the knights saw Vader arrive to deal with his uninvited guests. After Vader choked one of the knights to death, Ren told the rest to leave while he took on Vader himself. The knight and the Dark Lord of the Sith briefly dueled, and Vader managed to slash Ren in the torso before Ren jumped out of the castle and arrived safely on the ground thanks to the Force. The Knights of Ren then successfully escaped the fortress with the key on their possession.\nWhen a group of bounty hunters lead by T'onga fell into a trap sprung by Dengar while they infiltrated the Vermillion in order to rescue Cadeliah, Ren and his remaining knights arrived to kill the crew.\nFeeling the need to work out some aggression, Ren ignited his lightsaber and prepared the knights for the upcoming battle. Recognizing the reputation of the Knights of Ren, the Trandoshan bounty hunter Bossk shot Ren, who blocked the blast with his lightsaber while he told Cardo and Massif to disarm the intruders. After the bounty hunters managed to destroy the blasters that his knights carried, Ren ordered them to continue the fight with their melee weapons so they could kill the crew up close.\nAs the battle continued, the deadly pit fighter Tasu Leech brought up his beskar-laced blades in order to duel with Ren. As his knights started to overwhelm the bounty hunter crew on each of their fights, Ren told Leech that he fought well before destroying his blades as their beskar didn't extend all the way into their handles. While his knights were briefly incapacitated by the bounty hunters during their fights, 4-LOM managed to open a door on the Vermillion so that the crew could escape the battle. As Ren prepared to deal the killing blow on Leech, Zuckuss threw a blade to the pit fighter, who quickly used it to cut Ren before entering the door as it closed.\nRen and the knights later found T'onga trying to convince the young Cadeliah to come with her, when the girl refused, Qi'ra gave T'onga a communicator and offererd her to join Crimson Dawn before letting her leave the Vermillion.\nAfter obtaining the screaming key, Qi'ra sent Ren and his knights on a mission to a dark side hellscape where they served as protectors of The Archivist, who was going there to recover an item for Crimson Dawn. The knights saw various petrified creatures on the spot as soon as they arrived. While Massif pointed out that it was a bad idea to stay in the hellscape, the knights soon came to the realization that they had no other choice. The Archivist told Ren that he had to activate the screaming key by touching it with the dark side. After the key produced an agonizing sound, the petrified dark side creatures suddenly started to move and attack to group.\nRen and the knights ran through the hellscape while being chased by the creatures, they fought the creatures while protecting the Archivist at the same time as they tried to go to the center. Seeing as blasters didn't affect the creatures, Ren put the Archivist under the care of Bazzra while he slashed the creatures with his lightsaber which was much more effective. Unfortunately, a creature soon caught up to the Archivist and Bazzra was forced to push her out of the way, which resulted in the death of the knight. After the knights made it to the center, Ren hurried the Archivist to enter the head of one of the creatures at the hellscape through its eye, which lead to a chamber where the item that they needed was. Ren told his knights that if they were gonna die today they would at least die fighting, but the Archivist used the screaming key to unlock the item which in turn made the creatures become petrified again. The Archivist later informed Qi'ra of their success on the mission.\nAfter hearing from their master about the Force-sensitive criminal Karrst, who, along with his brother Filin, caused over one hundred deaths, Ren and the Knights of Ren sought to locate him. Eventually finding the brothers under attack from forces of Sector Security, Ren spoke to Karrst while the Knights of Ren dealt with the security forces. After Karrst hesitated when Ren informed him that entry into the Knights of Ren required the death of his brother, Filin instead killed Karrst and requested to join in his place. However, as Filin was not sensitive to the Force, Ren was forced to kill him. Having failed to recruit Karrst, Ren chose to leave, wishing to find something to burn.\nSome time later, the Knights of Ren discovered an ancient outpost of the Jedi Order on the planet Elphrona, and entered the outpost, seeking to steal the Jedi artifacts inside. However, the Jedi Master Luke Skywalker had learnt of the outpost with the help of the explorer Lor San Tekka, and also sought to retrieve the artifacts. Ren and the Knights confronted Skywalker, who had visited the outpost alongside San Tekka and his own Padawan Ben Solo. Ren declared that the artifacts belonged to the Knights, threatening Skywalker. The Jedi Master, however, wished to prevent the Knights of Ren from taking the artifacts.\nRen ignited his lightsaber, and the Knights surrounded Skywalker. However, despite being outnumbered, Skywalker managed to incapacitate the Knights, destroying their weapons. With the Knights defeated, Ren stepped forward to face Skywalker himself. Ren revealed that he had activated a kill switch on his lightsaber, which would cause it to explode if it left his hand. However, as Skywalker was too strong to handle, Ren chose to leave with the rest of the Knights. Before departing, Ren pointed out the presence of the dark side in Solo, and removed his mask, telling Solo that he could take other paths in life. Ren threw his helmet onto the ground, and told Solo to contact him if he ever wished to learn about the dark side.\nRen was still in command of the Knights by 28 ABY, intending to travel to Varnak, a world in the Mid Rim Territories. At the same time, Solo escaped a confrontation with his master and the destruction of Skywalker's Jedi temple. After meeting with Snoke, who had been speaking inside his head for many years, Solo chose to seek out the Knights of Ren. He returned to Elphrona, where Ren's mask remained within the Jedi outpost. After Solo put on the mask, Ren contacted him, and Solo asked whether the Knights would take him in, mentioning Snoke. Ren agreed, and told Solo to meet him on Varnak.\nOn Varnak, Ren and his Knights met with Solo in a cantina. Vicrul informed Ren of Solo's arrival and Ren greeted him. Realizing his mask made Solo feel nervous, Ren took it off. He informed Solo that he would only be accepted in the Knights if he caused \"a good death.\" Solo responded that he had killed a Jedi, leading Ren to express his doubts if he had killed Luke Skywalker, as Snoke had told him that maybe Solo had done it. Solo told him that it wasn't Skywalker, but another Jedi, leading Ren to take a seat and ask Solo to tell how he gave that Jedi a \"good death.\"\nSolo explained that when he contacted Ren while on Elphrona, he discovered that he had been followed by Tai, Voe and Hennix, three of Luke Skywalker's Jedi pupils who had been off-world when the Jedi temple was destroyed. Ren asked Solo for details about the three Padawans. Ren did so and then told Ren and his Knights that Tai, Voe, and Hennix engaged him in a duel to interrogate him about what had really happened with the Jedi temple. While trying to escape, Solo ended up accidentally killing Hennix by redirecting his lightsaber towards him before sealing Tai and Voe inside the outpost where Ren first met him before he left Elphrona.\nHaving heard the whole story, Ren asked his Knights about their opinions and agreed that while Solo had caused a death, it wasn't one deemed good enough to accept him into their fold, as he hadn't really intended to kill Hennix. However, as Snoke had vouched for Solo, Ren allowed him to accompany them anyway. Before leaving, Ren remarked that Solo looked like trash with his Jedi robes and instructed Kuruk to give him a fresh set of clothes.\nThe company headed to the Minemoon of Mimban in search of a relic called a Mindsplinter, but were intercepted by a group of armed miners who had discovered the artifact earlier and sought to keep it. The Knights of Ren made quick work of the resistance but were unable to pry out any information as to where the artifact was located, so Ren decided to kill them one by one until one of them spoke, but was stopped by Solo who used for the first time his mind probing ability to find out the location of the artifact. Ren was impressed by this feat and felt Solo was starting to be useful. Now knowing where to look, Ren and his knights massacred the miners much to Solo's shock.\nMaking their way to the artifact, the Knights and Ben encountered more of the miners. Ren ordered the Knights to attack them, including Solo, but was disappointed when he hesitated, even with his superior Jedi training. Before making any move, the two were intercepted by Solo's former Jedi friends, who took on the Knights and Solo. While Tai confronted Solo, Voe defended the minders against the Knights and their leader. Ren, having once fought a Jedi Master, taunted the Padawan. Voe, however, knew that the Knights had been defeated by her master, Luke Skywalker.\nVoe fought furiously against the Knights of Ren, but could not defeat them all and was knocked down. Ren went to search for Solo, who hesitated to kill Tai. Aware of Solo's resistance against the dark side, Ren killed Tai by breaking his neck with the Force.\nRen was utterly disappointed in Solo, despite Snoke's high hopes for the boy, and intended to kill Solo, but was attacked by him instead. Ren noticed how Solo was inexperienced in real combat and hoped to finish him off quickly by tackling him down into a pit. As the two fell and fought, Solo was rapidly giving in to the dark side, which was sensed by Leia Organa, Rey, Snoke, and even the late Darth Sidious, with Solo giving a finishing blow to Ren, killing him and finally giving Ren his \"good death.\" With Ren gone, Solo killed Voe and ascended to his place as the leader of the Knights of Ren.\nWhile Ren's Knights were inherited by Solo, who took on the name Kylo Ren, after the skirmish on the Minemoon, he was given command of the group as a gift from his new master, Supreme Leader Snoke, after he passed a test that Snoke had given to him.\nDespite being a user of the dark side, Ren acted charismatic and friendly, particularly when attempting to recruit others into the ranks of the Knights of Ren. Upon sensing the dark side of the Force in Ben Solo, Ren unmasked himself, attempting to convince Solo that he could take the path of the dark side rather than become a Jedi.\nRen's ideology did not permit him to think about whether his actions were right or wrong, and he only followed the will of the dark side of the Force. Though he acted as the leader of the Knights of Ren, Ren did not wish for others to follow him, but rather wanted them to follow his ideology. Ren was also arrogant, believing he and the Knights were legendary, and that he could defeat Luke Skywalker on Elphrona. However, when Skywalker overpowered the Knights, Ren chose to admit defeat and escape with his life.\nA human male, Ren had brown hair, blue eyes, and light skin, though at some point became severely scarred. Later in his life, Ren's hair became gray.\nAs a Force-sensitive, Ren used the dark side of the Force, which he and the Knights of Ren referred to as the \"shadow,\" additionally using simple Force powers such as telekinesis. Ren was able to use the Force to control the impact of his fall when he jumped out of Vader's castle, he also managed to move the lava flow at the Sith cave with the help of his fellow knights. He also used telekinesis to kill Padawan Tai whose neck he broke with the Force.\nRen had the ability to use a lightsaber in combat, though chose to send his Knights into battle before himself. During the Heist at Fortress Vader, Ren effectively slashed through multiple Lava Troopers with his lightsaber. Confronted by Darth Vader, Ren managed to engage in a duel with the Sith Lord for a few seconds before being struck by him. During the Raid on the Vermillion, Ren was able to duel with the pit fighter Tasu Leech and eventually disarm him with ease.\nRen concealed his face behind a mask, which was featureless aside from a number of red markings. He did not attempt to cover his scars and burns, leaving his torso bare aside from a black cape and a a single glove on his left hand. Ren removed his mask on Elphrona, leaving it within the Jedi outpost so that Ben Solo could use it to contact him some time later. As the leader of the Knights of Ren, he carried a red-bladed lightsaber that he referred to as \"the Ren,\" which contained a kill switch that would cause the lightsaber to explode if it ever left his hands.\nRen was first introduced in the first issue of the comic miniseries Star Wars: The Rise of Kylo Ren, written by Charles Soule, illustrated by Will Sliney, and published by Marvel Comics on December 18, 2019.\nSoule created the character of Ren as a foil to Darth Vader, making him similarly scarred and burned, but more charismatic and open, embracing his damage rather than hiding it. Concept art of Ren was drawn prior to the series' creation by Sliney, who described Ren as \"born out of the flames.\"\nRen later made his onscreen debut in flashbacks in LEGO Star Wars Terrifying Tales, an animated special that was directed by Ken Cunningham, written by David Shayne, and aired on Disney+ on October 1, 2021. He was voiced in the special by Christian Slater.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ren_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/28_ABY",
  "/wiki/Minemoon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Knights_of_Ren",
  "/wiki/Crimson_Dawn",
  "/wiki/Force-sensitive",
  "/wiki/Standard_year",
  "/wiki/Galactic_Civil_War",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Time",
  "/wiki/Ben_Solo",
  "/wiki/Padawan",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Mission_to_Elphrona",
  "/wiki/Planet",
  "/wiki/Elphrona",
  "/wiki/The_Force",
  "/wiki/Jedi",
  "/wiki/Jedi_Order",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Ren",
  "/wiki/Ren_(Ren%27s_predecessor)",
  "/wiki/Ren_(lightsaber)",
  "/wiki/Lightsaber",
  "/wiki/Fire",
  "/wiki/The_galaxy",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/File:Allies_of_Crimson_Dawn.png",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Cantina",
  "/wiki/Varnak",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Sith",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Han_Solo",
  "/wiki/Attack_on_the_Executor",
  "/wiki/Jekara",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Maul",
  "/wiki/Sith_apprentice",
  "/wiki/Screaming_Key",
  "/wiki/Fortress_Vader",
  "/wiki/Mustafar",
  "/wiki/Fortress",
  "/wiki/Marinda",
  "/wiki/Night_Buzzard",
  "/wiki/Emperor",
  "/wiki/File:Ren_and_Vader_brief_duel.jpg",
  "/wiki/Gahenn_Plains",
  "/wiki/Sith_cave",
  "/wiki/Vane%C3%A9",
  "/wiki/Lava_Trooper",
  "/wiki/Trooper",
  "/wiki/Anakin_Skywalker",
  "/wiki/T%27onga%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/T%27onga",
  "/wiki/Dengar",
  "/wiki/Cadeliah",
  "/wiki/File:Ren_during_Raid_on_Vermillion.jpg",
  "/wiki/Trandoshan",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Cardo",
  "/wiki/Tasu_Leech",
  "/wiki/4-LOM",
  "/wiki/Zuckuss",
  "/wiki/File:Ren_kills_dark_side_creatures.jpg",
  "/wiki/Mission_to_a_dark_side_hellscape",
  "/wiki/Dark_side_hellscape",
  "/wiki/The_Archivist",
  "/wiki/Massif",
  "/wiki/Bazzra",
  "/wiki/File:Ren_long_ago.jpg",
  "/wiki/Karrst",
  "/wiki/Filin",
  "/wiki/Sector_Security",
  "/wiki/File:Confrontation_on_Elphrona.jpg",
  "/wiki/Elphrona_Outpost",
  "/wiki/Jedi_artifact",
  "/wiki/Scout",
  "/wiki/Lor_San_Tekka",
  "/wiki/File:KyloRenBetaTestVersion.jpg",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Jedi_Temple_of_Luke_Skywalker",
  "/wiki/Snoke",
  "/wiki/Vicrul",
  "/wiki/Tai",
  "/wiki/Voe",
  "/wiki/Hennix",
  "/wiki/Duel_on_Elphrona",
  "/wiki/Hennix%27s_lightsaber",
  "/wiki/Jedi_robes",
  "/wiki/Kuruk",
  "/wiki/Clothing",
  "/wiki/File:Ren_killed_by_Kylo.jpg",
  "/wiki/Mimban",
  "/wiki/Mindsplinter",
  "/wiki/Miner",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Rey_Skywalker",
  "/wiki/Darth",
  "/wiki/Supreme_Leader",
  "/wiki/File:Ren-SWTLC.png",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/File:Deathoftai.jpg",
  "/wiki/Force_power",
  "/wiki/Telekinesis",
  "/wiki/File:The_Way_of_the_Ren_TROKR_1.jpg",
  "/wiki/Cape",
  "/wiki/Glove",
  "/wiki/Limb",
  "/wiki/File:Ren_concept.jpg",
  "/wiki/The_Rise_of_Kylo_Ren_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Rise_of_Kylo_Ren",
  "/wiki/Charles_Soule",
  "/wiki/Will_Sliney",
  "/wiki/Marvel_Comics",
  "/wiki/December_18",
  "/wiki/2019",
  "/wiki/Cybernetics",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/Ken_Cunningham",
  "/wiki/David_Shayne",
  "/wiki/Disney%2B",
  "/wiki/October_1",
  "/wiki/2021",
  "/wiki/Christian_Slater",
  "/wiki/Category:Images_of_Ren",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Crimson_Reign_1",
  "/wiki/Crimson_Reign_4",
  "/wiki/Bounty_Hunters_24",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Crimson_Reign_5",
  "/wiki/Hidden_Empire_1",
  "/wiki/The_Rise_of_Kylo_Ren_2",
  "/wiki/The_Rise_of_Kylo_Ren_3",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide"
 ]
}