{
 "name": "Rennek",
 "display_name": "Rennek",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Rennek was a Human male who worked as a nerf herder for the Tatooine-based Hutt crime lord Jabba Desilijic Tiure. In the year 4 ABY, Rennek was present in the audience chamber of Jabba's desert palace when the droids C-3PO and R2-D2, and later Princess Leia Organa, arrived there to free their imprisoned Rebel Alliance cohort Han Solo from Jabba's clutches.\nThe Human male Rennek lived during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. He found work as a nerf herder for Jabba Desilijic Tiure, a Hutt crime lord based on the planet Tatooine. Rennek personally oversaw the herding of Jabba's nerfs.\nIn the year 4 ABY, Rennek was in the audience chamber of Jabba's desert palace, standing right behind the crime lord's throne, when the droids C-3PO and R2-D2 arrived on behalf of their master, Luke Skywalker, to free their captive ally Han Solo, who was frozen in carbonite and hung on display within the palace. During the incident, Rennek was among those within the courtroom who witnessed the Hutt drop the slave dancer Oola into the pit of his pet rancor, and rushed forward to witness her demise.\nRennek again stood behind Jabba's throne in the audience chamber when Rebel Alliance leader Leia Organa, in the disguise of the bounty hunter Boushh, also arrived with the Wookiee Chewbacca as her alleged prisoner, ostensibly to bargain for the bounty on Chewbacca's capture. Organa threatened to destroy the palace with a thermal detonator if the Hutt did not comply with her demands. After winning Jabba's favor, Organa later freed Solo—the true reason she had arrived at the palace—and attempted to escape with him, but both were caught and subsequently imprisoned.\nDespite his scruffy appearance, Rennek was a lethal combatant with an expertise in unusual combat techniques. He could defeat the toughest of Jabba's Gamorrean guards—attributes not reflected by his trifling assignment as the Hutt's nerf herder. When Oola was eaten by Jabba's rancor, Rennek joined others in the courtroom in laughing at the dancer's fate. He had dark skin, black hair, and brown eyes.\nAs a nerf herder, Rennek wore a white fur-trimmed coat during his time at Jabba's Palace. He also wore a white shirt with interconnected tubing, which ran along the middle of his torso and down between his legs.\nRennek first appeared as an extra in the Jabba's Palace sequence of the 1983 film Star Wars: Episode VI Return of the Jedi. The character's first scene, featuring the Max Rebo Band's performance of \"Lapti Nek,\" was cut from the film's 1997 Special Edition release, but Rennek is still visible in new footage of the Max Rebo Band's performance of \"Jedi Rocks\" created for the Special Edition. The cut footage for \"Lapti Nek\" is included in \"Lapti Nek\": The Music Video from Jabba's Palace, which was commercially released for the Star Wars Trilogy: The Definitive Collection LaserDisc in 1993.\nThe character was first identified by name on the \"Rennek\" card as part of the May 1998 Jabba's Palace Limited expansion set of the Decipher, Inc. Star Wars Customizable Card Game. According to a Star Wars CCG fan site, Rennek was named as an anagram of toy manufacturer Kenner.\nThe Rebellion Era Sourcebook, published in 2001, includes an image of Rennek next to the entry of another character, Corporate Sector Authority Viceprex Jace Lorrin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nerf_herder/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Rennek_palace",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Tatooine/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Siege_of_Jabba%27s_Palace",
  "/wiki/Prison/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Nerf/Legends",
  "/wiki/Throne/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Oola/Legends",
  "/wiki/Jabba%27s_rancor",
  "/wiki/Death/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boushh/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Class-A_thermal_detonator/Legends",
  "/wiki/Rescue_of_Han_Solo/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Jacket/Legends",
  "/wiki/Time/Legends",
  "/wiki/Shirt",
  "/wiki/Limb/Legends",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Max_Rebo_Band/Legends",
  "/wiki/Lapti_Nek/Legends",
  "/wiki/1997",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/Max_Rebo/Legends",
  "/wiki/Jedi_Rocks/Legends",
  "/wiki/%22Lapti_Nek%22:_The_Music_Video_from_Jabba%27s_Palace",
  "/wiki/Star_Wars_Trilogy:_The_Definitive_Collection",
  "/wiki/1993",
  "/wiki/May",
  "/wiki/1998",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Tuckerization",
  "/wiki/Kenner_Products",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/2001",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Viceprex/Legends",
  "/wiki/Jace_Lorrin",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Jabba%27s_Palace",
  "/wiki/Star_Wars_Insider_60",
  "/wiki/Inside_the_Worlds_of_Star_Wars_Trilogy",
  "/wiki/Star_Wars:_Complete_Locations_(2005)",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/August_15",
  "/wiki/2005",
  "/wiki/April_6",
  "/wiki/2016"
 ]
}