{
 "name": "Renza",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Renza was a Hutt female criminal who was active during the time of the Galactic Republic through to the era of the Galactic Empire. The Hutt was considered to be both humorless and a monster. Rebel Alliance Commander Lina Graf faced and defeated Renza, while the smuggler Jaxxon T. Tumperakki sold out his associate Lando Calrissian to Renza on another occasion, claiming that it had been a joke that the Hutt had not understood.\nRenza the Hutt was active during the time of the Galactic Republic. In 90 BBY, the criminals Jorkat, Bry, and Velek were affiliated with Renza. The three criminals visited a celebration of the culture of the Outer Rim Territories on the planet Serenno, where they harassed the Serennians Jenza and Ramil, the children of Count Gora. Bry suggested taking the children captive and selling them to Renza, but Jorkat was unsure whether the Hutt would be satisfied with the deal. Ultimately, the Jedi initiate Dooku chased the criminals away, rescuing Jenza and Ramil.\nSometime before leading a mission during the Imperial Era, Commander Lina Graf of the Rebel Alliance faced Renza, defeating the Hutt. During the rebel mission, Graf recounted her encounter with Renza to Vaneé, the servant of the Sith Lord Darth Vader.\nAt some point, the smuggler Jaxxon T. Tumperakki sold out the gambler Lando Calrissian to Renza, though claimed it was a joke. In 3 ABY, when Tumperakki met Calrissian, by that point the Baron Administrator of Cloud City, the latter brought up the incident with Renza, prompting Tumperakki to insist that it had been a joke, blaming the events on the Hutt's humorlessness.\nA female Hutt, Renza was known by her associates as willing to purchase individuals; however, when considering selling children to Renza, Jorkat claimed that she preferred those with more weight on them. Lina Graf considered Renza to be a monster, while Jaxxon Tumperakki claimed that she was an \"overgrown slugball\" with no sense of humor.\nRenza was first mentioned in the comic Star Wars Adventures: Tales from Vader's Castle 5, written by Cavan Scott and published by IDW Publishing on October 31, 2018.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Hutt",
  "/wiki/Gender",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Commander",
  "/wiki/Lina_Graf",
  "/wiki/Smuggler",
  "/wiki/Jaxxon_T._Tumperakki",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/90_BBY",
  "/wiki/Jorkat",
  "/wiki/Bry",
  "/wiki/Velek",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Serenno",
  "/wiki/Serennian",
  "/wiki/Jenza",
  "/wiki/Ramil",
  "/wiki/Count_of_Serenno",
  "/wiki/Gora",
  "/wiki/Jedi",
  "/wiki/Jedi_Initiate",
  "/wiki/Dooku",
  "/wiki/Fact-finding_mission_to_the_Outer_Rim",
  "/wiki/Vane%C3%A9",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Gambler",
  "/wiki/3_ABY",
  "/wiki/Baron_Administrator",
  "/wiki/Cloud_City",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_5",
  "/wiki/Cavan_Scott",
  "/wiki/IDW_Publishing",
  "/wiki/October_31",
  "/wiki/2018",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Fake_It_Till_You_Make_It",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Time",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Geonosis",
  "/wiki/22_BBY",
  "/wiki/Reproduction",
  "/wiki/102_BBY",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back"
 ]
}