{
 "name": "Requud",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "41 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hapan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hapes Consortium",
      "Jedi Coalition"
     ]
    }
   ]
  }
 ],
 "content": "Requud was a Ducha in the Hapes Consortium. Like other known holders of this title, she was female.\nAs a Ducha, Requud was one of the highest-ranking women in the Hapes Cluster. Like the Duchas AlGray and Galney, she may have been the ruler of one of Hapan space's main star systems. Like them, she certainly commanded a powerful fleet of Hapan Battle Dragons, including her flagship, the Deserving Gem.\nShe was also of royal blood, and by 41 ABY she was one of the closest claimants to the throne after Queen Mother Tenel Ka Djo and the Chume'da Allana.\nAt the Battle of Uroro Station, Requud and her fleet were assigned to orbital defense of the planet Shedu Maad itself, while Hapan Home Fleet forces were positioned at Uroro Station. As a result, Requud found herself facing a full-scale assault from the Imperial Navy, while the Home Fleet ships were pinned down by the Super Star Destroyer Megador.\nDuring the battle, a nanokiller attack on the royal flagship Dragon Queen threw the Hapan forces into confusion, and it was widely believed that Tenel Ka and her daughter had been slain. At this point, Requud entered into negotiations with the Moff Council.\nIt appears that Requud intended to remove her forces from the battle, and claim the throne with the support of the Moffs. General Livette, commanding the Hapan forces on the surface of Shedu Maad, also joined the conspiracy, and allowed an Imperial strike-team to land and attack the planet's Jedi base.\nHowever, another faction was also moving to prevent the coup. SigTel detected the transmissions between Requud and the Moffs, and Hapan Security secret agents aboard the Deserving Gem removed her from command.\nOn Shedu Maad itself, Taryn and Trista Zel, Hapan Security agents masquerading as officers of Her Majesty's Select Commandos, confronted General Livette, and explained that the coup had been prevented. To prove their point, an audio transmission was patched through from Requud's personal comlink aboard the Deserving Gem, which revealed the terrified voice of a defeated conspirator, pleading for her life.\nA few moments later, Trista Zel observed that the Ducha had suffered an \"unfortunate accident\".\nIt is implied, rather than explicitly stated, that the woman overheard aboard the Deserving Gem was Requud herself. It is not said directly what happened to her, but it seems that she was summarily executed in accordance with Hapan law.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Requud",
  "/wiki/41_ABY",
  "/wiki/Hapan",
  "/wiki/Gender/Legends",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Jedi_Coalition",
  "/wiki/Ducha",
  "/wiki/Hapes_Cluster/Legends",
  "/wiki/AlGray",
  "/wiki/Galney",
  "/wiki/Hapan_Battle_Dragon",
  "/wiki/Deserving_Gem",
  "/wiki/Queen_Mother",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Chume%27da",
  "/wiki/Allana_Solo",
  "/wiki/Battle_of_Uroro_Station",
  "/wiki/Shedu_Maad",
  "/wiki/Hapan_Home_Fleet",
  "/wiki/Uroro_Station",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Megador",
  "/wiki/Nanovirus",
  "/wiki/Dragon_Queen",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/General/Legends",
  "/wiki/Livette",
  "/wiki/SigTel",
  "/wiki/Hapan_Security",
  "/wiki/Taryn_Zel",
  "/wiki/Trista_Zel",
  "/wiki/Her_Majesty%27s_Select_Commandos",
  "/wiki/Legacy_of_the_Force:_Invincible"
 ]
}