{
 "name": "Rersey",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Ashen"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Rersey was a male human who served as an advisor to the Galactic Emperor Sheev Palpatine early in the Imperial Era. At one point, he was sent to the planet Mustafar to convey the Emperor's discontent to his apprentice, Darth Vader. While there, the advisor witnessed an incident during which a horde of infected Mustafarians attacked Vader's fortress. The Emperor's apprentice used his mystical powers to have the leader of the horde, Mother Sssl, dragged into the lava by her own troops. As a result of that spectacle, Advisor Rersey lost his mind.\nA human male, Rersey served as an advisor to the Galactic Emperor Sheev Palpatine, ruler of the dictatorial Galactic Empire. As such, he was among the highest-ranking bureaucrats of the Empire. At one point early in the Imperial Era, Emperor Palpatine grew displeased with his Sith apprentice, the cyborg known as Darth Vader. He put Rersey aboard a Theta-class shuttle, sending him as his emissary to Vader's fortress, on the volcanic planet of Mustafar. As the advisor attempted to obtain answers from Vader, he quarreled with the Dark Lord of the Sith's personal servant, Vaneé, who thought the envoy was being disrespectful to his host.\nTheir dispute was cut short when Vader felt a disturbance in the Force, which was soon followed by a startling scream. As it turned out, the fortress was being invaded by a horde of Mustafarians led by Mother Sssl of Clan Rrrt, who sought to infect everyone inside the castle with a mind-controlling plague. All seemed lost when Vader himself was bitten in the arm by an infected Imperial Lava Trooper, and both Rersey and Vaneé contemplated their imminent demise.\nHowever, since Vader's limbs were all mechanical, he had only pretended to have been infected for a moment; he soon turned against Mother Sssl, manipulating her thoughts through the Force so she would order her slaves to drag her into the nearby lava river. Advisor Rersey, horrified by the spectacle, stared at the lava that Sssl and her horde had just thrown themselves into. Vader then bluntly told the advisor his shuttle was ready for departure, and that he expected his report to the Emperor to be good.\nLong after the event, Vaneé recounted it to a woman he thought was a member of the Imperial Inquisitorius, but was actually Lina Graf, commander of the enemy Rebel Alliance, in disguise. According to Vaneé, the incident with Mother Sssl caused Rersey to lose his sanity.\nRersey was a thin, cadaverous man with ashen skin, a hooked nose, and bright blue, sunken eyes. He sported long, crooked teeth whose gums had receded almost to their roots.\nCertain of his importance and place in the hierarchy, Rersey regarded Vader as a lower-ranking servant of the Emperor, and addressed him accordingly. While Vaneé thought the envoy should show respect to his host, Rersey professed that he was not afraid of what he called Vader's \"parlor tricks.\" However, he was also cowardly, as demonstrated when the advisor demanded to be moved out of harm's way at the first sign of trouble, and then when he used Vaneé as a human shield between Vader and himself. Rersey's confidence, however, took a massive blow during the invasion of the fortress, and he left Mustafar with a damaged mind.\nDuring his visit on Mustafar, Rersey wore flowing purple robes and a tall cylindrical hat, a common style of dress among Imperial advisors that was reminiscent of the Naboo noblemen's extravagance.\nRersey first appeared via flashback in the fifth issue of the comic-book miniseries Star Wars Adventures: Return to Vader's Castle, written by Cavan Scott, illustrated by Charles Paul Wilson III, and published by IDW Publishing on October 30, 2019. He was first revealed in a StarWars.com article titled \"Darth Vader Awaits in Return to Vader's Castle #5 – Exclusive,\" which was published on October 23, 2019, and contained a preview of the comic. He was named after Richard Kersey, who is a friend of Scott's.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Emperor%27s_adviser",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Imperial_Era",
  "/wiki/Planet",
  "/wiki/Mustafar",
  "/wiki/Sith_apprentice",
  "/wiki/Anakin_Skywalker",
  "/wiki/Advisor",
  "/wiki/Attack_on_Fortress_Vader",
  "/wiki/Unidentified_plague_(Mustafar)",
  "/wiki/Mustafarian",
  "/wiki/Fortress_Vader",
  "/wiki/The_Force",
  "/wiki/Mother_(title)",
  "/wiki/Sssl",
  "/wiki/Magma",
  "/wiki/Troop",
  "/wiki/Dictatorship",
  "/wiki/Bureaucrat",
  "/wiki/Cyborg",
  "/wiki/Theta-class_T-2c_shuttle",
  "/wiki/Emissary",
  "/wiki/Volcano",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Aide",
  "/wiki/Vane%C3%A9",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/Fortress",
  "/wiki/Clan_Rrrt",
  "/wiki/Limb",
  "/wiki/Lava_Trooper",
  "/wiki/Death",
  "/wiki/Cybernetics",
  "/wiki/Time",
  "/wiki/Mind_trick",
  "/wiki/Slavery",
  "/wiki/Shuttle",
  "/wiki/Inquisitorius",
  "/wiki/Lina_Graf",
  "/wiki/Commander",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Sentience",
  "/wiki/Nose",
  "/wiki/Eye",
  "/wiki/Tooth",
  "/wiki/Force_power",
  "/wiki/Clothing",
  "/wiki/Robe",
  "/wiki/Hat",
  "/wiki/Naboo_(people)",
  "/wiki/Noble",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_5",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle",
  "/wiki/Cavan_Scott",
  "/wiki/Charles_Paul_Wilson_III",
  "/wiki/IDW_Publishing",
  "/wiki/October_30",
  "/wiki/2019",
  "/wiki/StarWars.com",
  "/wiki/October_23",
  "/wiki/Category:Images_of_Rersey",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Tarkin_(novel)",
  "/wiki/File:Kersey_tweet.png"
 ]
}