{
 "name": "Resa_Greenbark",
 "display_name": "Resa Greenbark",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "New Plympto"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Esseles"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nosaurian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "Resa Greenbark was the daughter of Bomo Greenbark, a Nosaurian Commander in the resistance movement on their homeworld of New Plympto in 19 BBY. During the final battle of the newly–instated Galactic Empire's cleansing of the planet, Resa and her mother Mesa were evacuated, only to be captured by the Empire and sent to Orvax IV along with the other evacuees as slaves. Resa was then sold to Dezono Qua by Orso Meeto, a transaction which Bomo discovered. From this, he was able to find Qua on Esseles. When Qua was confronted by Bomo's companion, Dass Jennir, he revealed that he had eaten the child, an act which earned Qua death at Jennir's hands.\nResa Greenbark was a female Nosaurian from the Core planet of New Plympto. She was an only child and the daughter of Mesa and Bomo Greenbark. Her father Bomo was a Commander in the Nosaurian resistance during the Clone Wars and fought against the newly–formed Galactic Empire in 19 BBY. The resistance made a last stand at Half-Axe Pass and held off the Imperial forces while those Nosaurians not involved in the fighting were evacuated. Bomo oversaw the evacuation of Resa and Mesa on the last of the transports but, having a duty to return to the fighting, was unable to join them despite Resa's pleas. The evacuees were taken to Cadgel Meadows where Mesa and Resa hoped to take a ship to Sullust, but Imperial forces at the spaceport captured all of the evacuees. Deeming them inadequate to add to the workforce, the Empire took them to Orvax IV to be sold for a profit as slaves.\nOn Orvax IV, Resa was taken to be sold by a Chagrian slaver, Orso Meeto. This resulted in Mesa being killed when she attempted to stop a number of slavers from subsequently taking her daughter. Meeto sold the Nosaurian youngling to Dezono Qua, a Human noble on Esseles. Bomo and the crew of the Uhumele, who had rescued him and his companion Dass Jennir from New Plympto, arrived on Orvax IV mere hours later, too late to find Resa.\nIn Qua's fortified villa on Esseles, Resa was killed for E-10—Qua's protocol droid—to prepare her as a meal for the noble, as was always done with the young slaves he purchased. However, unbeknownst to him, the crew of the Uhumele had located Resa's buyer and attacked the villa soon after Resa had been eaten. Jennir confronted Qua as he attempted to escape, with Bomo and the other crewmembers arriving shortly before Qua revealed that he had eaten Resa. Jennir then shot and killed the noble with his blaster to spare Bomo from suffering the after-effects of killing Qua himself.\nResa was much loved by her parents, with her mother even dying to try and stop Resa being taken away from her. Bomo, Resa's father, wore a holoprojector around his neck that displayed a hologram of Resa. During the evacuation, Resa begged her father multiple times to go with her, but Bomo refused, having a duty to stay. This upset Resa, but she was comforted by her father when he showed her his hologram of her.\nResa's only appearance was in the Dark Times 1, the first issue of the first story arc in the Star Wars: Dark Times comic book series, which was released on November 8, 2006. The issue was written by Mic Harrison, a pen name of Randy Stradley, and illustrated by Douglas Wheatley.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/New_Plympto/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Esseles/Legends",
  "/wiki/Nosaurian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bomo_Greenbark",
  "/wiki/Commander/Legends",
  "/wiki/New_Plympto_resistance_(Imperial_Period)",
  "/wiki/Homeworld/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Cleansing_of_New_Plympto",
  "/wiki/Planet/Legends",
  "/wiki/Mesa_Greenbark",
  "/wiki/Orvax_IV",
  "/wiki/Slavery/Legends",
  "/wiki/Dezono_Qua",
  "/wiki/Orso_Meeto",
  "/wiki/Dass_Jennir",
  "/wiki/Youngling/Legends",
  "/wiki/Death/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Half-Axe_Pass",
  "/wiki/Transport/Legends",
  "/wiki/Cadgel_Meadows",
  "/wiki/Starship/Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Chagrian/Legends",
  "/wiki/Human/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Uhumele",
  "/wiki/Mission_to_Orvax_IV",
  "/wiki/Standard_hour/Legends",
  "/wiki/Qua_family%27s_villa",
  "/wiki/E-10",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Assault_on_Dezono_Qua%27s_villa",
  "/wiki/Blaster/Legends",
  "/wiki/Holoprojector/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Dark_Times_1",
  "/wiki/Star_Wars:_Dark_Times:_The_Path_to_Nowhere",
  "/wiki/Star_Wars:_Dark_Times",
  "/wiki/Star_Wars_comic_books",
  "/wiki/November_8",
  "/wiki/2006",
  "/wiki/Randy_Stradley",
  "/wiki/Douglas_Wheatley",
  "/wiki/Dark_Times_2",
  "/wiki/Dark_Times_3",
  "/wiki/Dark_Times_4",
  "/wiki/Dark_Times_5",
  "/wiki/Dark_Times_7",
  "/wiki/Dark_Times:_Blue_Harvest_0",
  "/wiki/Dark_Times_16",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_1",
  "/wiki/Republic_79",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_127"
 ]
}