{
 "name": "Resk",
 "display_name": "Resk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 17 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Resk was a Human male who lived during the reign of the Galactic Empire. When a bounty was placed on Resk around 17 BBY, the fallen Jedi Master and bounty hunter A'Sharad Hett tracked him to Korriban and captured him. Resk threatened to expose Hett as a former Jedi to the proper authorities if he was turned in. Resk's threat prompted Hett to behead him with his lightsabers, further sinking the former Jedi into the dark side of the Force.\nResk, a Human male, lived during the early years of the Galactic Empire. Around 17 BBY, a bounty was placed on Resk, making him a target for bounty hunters. The bounty hunter and former Jedi Master A'Sharad Hett eventually tracked Resk to the planet Korriban, where both men were forced to the world's surface due to a storm. Resk fled from Hett and attempted to defend himself with his blasters but was disarmed by the former Jedi's lightsabers. As Hett cornered Resk, the latter threatened to inform the authorities of the former's status as an ex-Jedi, which prompted Hett to behead Resk to ensure his silence, as the bounty on Resk's head did not depend on whether he was living or deceased. After Resk's death, Hett, who had fallen to the dark side, discovered the ancient Sith Lord XoXaan's holocron, which taught the former Jedi Master the ways of the Sith over the next few years.\nResk was a light-skinned man who wore jewelry in his brown hair and had brown eyes. He threatened Hett with exposing the former's status as a Jedi, prompting Hett to murder him. Resk wielded two blaster pistols during his confrontation with Hett.\nResk was created by John Ostrander, the writer of the Star Wars: Legacy comics, for the fourth issue of the Claws of the Dragon story arc. He was drawn by Jan Duursema.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/17_BBY/Legends",
  "/wiki/Korriban",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Jedi/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Sai_tok/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/XoXaan",
  "/wiki/XoXaan%27s_holocron",
  "/wiki/Sith/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_17",
  "/wiki/Star_Wars:_Legacy:_Claws_of_the_Dragon",
  "/wiki/Jan_Duursema",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Life_and_Legend_of_Obi-Wan_Kenobi",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Duel_on_Tatooine_(Imperial_Period)",
  "/wiki/Darth_Talon"
 ]
}