{
 "name": "Reskik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Grandeel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Reskik was a male Human from Grandeel who served as a Major in the Imperial Security Bureau of Palpatine's New Order.\nMajor Reskik was a male Human from Grandeel, who grew up on a fish farm before entering the Imperial Academy. Reskik was an unassuming but bright student, but learned he could move ahead by appearing non-threatening and unambitious to his superiors. However, he learned to defend himself and his own territory, and developed a vicious and vindictive streak towards those who wronged him. After several years working within the Imperial Army's bureaucracy, he was assigned his first command; the Imperial Salvage Station in the Yavin system, tasked with recovering wreckage from the DS-1 Orbital Battle Station.\nReskik did not flaunt his command, preferring to keep the true nature of his assignment hidden. While the salvage operation remained highly visible, the major kept his military contingent hidden. The knowledge that he could enforce Imperial rule in the system was enough for Reskik, and he believed that a hands-off approach would keep his workers more productive, as well increasing the possibility that unwary members of the Alliance to Restore the Republic might fall into his clutches.\nReskik was a bull-necked, slightly overweight man with brown hair. Although unimposing, his ruthless personality was evident after a few minutes spent in his company. However, Reskik was fair, and could be accommodating to others if he felt that he was going to win. However, if crossed, he would stop at nothing to exact revenge.\nReskik was trained to use a blaster, and was skilled in unarmed combat. He was knowledgeable about bureaucratic procedure and business practices, and was well versed in law enforcement techniques, especially those relating to Imperial law. Reskik was an able commander and pilot.\nReskik worn an Imperial uniform, carried a comlink, and was armed with a blaster.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Grandeel",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Major/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Imperial_Salvage_Station",
  "/wiki/Yavin_system/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)"
 ]
}