{
 "name": "Reva_Sevander",
 "display_name": "Reva Sevander",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "Reva Sevander was a human female Force-sensitive who served as a member of the Inquisitorius under the title of Third Sister during the early reign of the Galactic Empire and briefly held the position of Grand Inquisitor. Prior to the rise of Emperor Palpatine, Sevander held the rank of Jedi Initiate during her time in the Jedi Order. Ambitious and reckless, the Third Sister quickly rose through the ranks of the Inquisitorius despite being ostracized and distrusted by the other Inquisitors. Though she willingly served the Empire, and harried fugitive Jedi and other Force-sensitives, Sevander was driven by an ulterior motive. Haunted by the trauma from her past, the Third Sister sought to exact revenge on the Dark Lord of the Sith Darth Vader for his slaughter of the Jedi during Order 66, which had taken away the only family she had ever known.\nSevander was only a Jedi youngling at the time of the Great Jedi Purge at the end of the Clone Wars. She and her fellow initiates were in the Jedi Temple on Coruscant at the time it was attacked by the Sith Lord Darth Vader and his 501st Legion. She watched as her friends were slain, and played dead amidst the bodies. Years later, she resurfaced and joined the Inquisitorius of the Galactic Empire, both of which had the Dark Lord counted among its leaders. Because she knew that Vader had been the Jedi Knight Anakin Skywalker before joining the Sith, Sevander, christened as Third Sister, became obsessed with locating his former Jedi Master, the fugitive Obi-Wan Kenobi, as a means of exacting revenge by entering the Dark Lord's good graces and assassinating him whilst he was fixated on Kenobi. To lure her quarry out of hiding, the Third Sister arranged the kidnapping of Princess Leia Organa, the daughter of Senator Bail Organa, who she believed would turn to his old ally for help.\nThough she came close to capturing Kenobi when he rescued Organa on Daiyu, the Third Sister was prevented from doing so by the intervention of the Grand Inquisitor, who had enough of her rashness. The Third Sister unexpectedly turned on the Grand Inquisitor and left him for dead, but lost the Jedi Master and the Princess when they fled the planet. Having been notified of his old mentor's resurgence, Vader offered the Third Sister the opportunity to prove herself worthy of assuming the position of Grand Inquisitor at his side if she found the Jedi Master. Kenobi was tracked to Mapuzo, where the Third Sister discovered that he had help from a Jedi-ferrying network known as the Hidden Path. There she took Organa hostage once again to root both Kenobi and his new allies out of hiding. With the Princess in captivity in the Fortress Inquisitorius on Nur, the Third Sister laid another trap for the Jedi Master when he and Path member Tala Durith infiltrated the base to rescue the young girl. The Third Sister planted a tracking device on Organa's droid, L0-LA59, and allowed Kenobi and Durith to escape with Organa so that she could uncover the Path.\nImpressed with her, Vader awarded the Third Sister the rank of Grand Inquisitor, and had her oversee the attack on the Path's headquarters on Jabiim. There Third Sister confronted Kenobi, who realized what her true intentions were. The Jedi Master convinced her that they could defeat the Emperor's Fist together, giving her the chance to slay him with a seeming distraction provided by his and the Path's escape. The Third Sister made an attempt on the Dark Lord's life but was outmatched and left for dead by him and the much-alive Grand Inquisitor. While lying in the dirt, Sevander found a transmitter that belonged to Kenobi, which played a message from Bail Organa detailing a boy under the protection of Owen Lars who, along with Leia, was in danger of being discovered. Using information from that message, no longer an Inquisitor, a vengeance-hungry Sevander traveled to Tatooine to kill Luke Skywalker, one of the offspring of the unaware Vader who had been under Kenobi's watch. As she prepared to kill him, however, she realized that she would become like the Dark Lord, and decided to return the boy to his guardians. Sevander was again met by Kenobi, and at his advice she looked to let go of her past and move on with her life, leaving her ultimate fate a mystery.\nA Force-sensitive human female, Reva Sevander was once a Jedi who lived at the the Jedi Temple on Coruscant as a youngling. In 19 BBY, she and several other Jedi Initiates were training under the instruction of Jedi Master Minas Velti. As the Sith Lord Darth Sidious issued Order 66, his apprentice, the former Jedi Knight Anakin Skywalker led the 501st Legion in an assault on the Jedi Temple. Clone troopers entered the room Velti, Sevander, and the other younglings were in and began to fire at Velti, who quickly cut them down and led the younglings away. The group made their way through the temple halls as the Jedi Master protected them from the clones until she was killed by them, leaving her charges to fend for themselves. They ran from the fighting until they came across Skywalker himself. Sevander and the other younglings assumed he was there to help, but became horrified when he started slaughtering them, having not realized he had turned to the dark side of the Force as the newly-christened Darth Vader. Sevander was stabbed but survived and hid under the corpses of the other younglings in the group she was with.\nSevander eventually escaped the Jedi Temple and turned to the dark side. Wanting revenge on Vader, currently acting as the commander-in-chief of the Galactic Empire's forces, she joined the regime's Inquisitorius as an Inquisitor, in order to get close to him. Becoming known as the Third Sister, she was tasked with hunting the last of the Jedi Order. The Grand Inquisitor wrote her off as \"least of them,\" recalling that she had come to them from \"the gutter\" and that her dark side ability was the only reason she was able to remain within the Inquisitorius' ranks. Much like the Third Brother, the specific actions the Third Sister carried out in the name of the Galactic Empire remained a mystery. Reva formulated a plan to kill Vader by bringing in his former mentor, Obi-Wan Kenobi to the Dark Lord of the Sith, seemingly with the goal of winning his approval, only to kill him while he was distracted with Kenobi. This plan led to her becoming fixated on capturing the Jedi Master.\nIn 9 BBY, the Third Sister was dispatched to the desert planet of Tatooine alongside the Grand Inquisitor and the Fifth Brother, tasked with locating the Jedi Nari. While her superior attempted to intimidate the locals in a saloon, the impatient Reva interrupted him by throwing a knife at the saloon owner. Before it could kill the saloon owner, Nari, who was in the saloon, caught it with the Force. The Third Sister tried to cut him down with her lightsaber, only to be stopped from doing so by the invisible grip of the Grand Inquisitor, who instead wanted him alive for interrogation, allowing Nari to escape. The Third Sister then attempted to give chase, but was halted by the Grand Inquisitor, who reprimanded her for her recklessness and fixation on Kenobi, while the Fifth Brother instead chased the fugitive Jedi.\nThe Third Sister and Fifth Brother later went to Anchorhead, and began to ask for information. Much to her companion's irritation, she began to threaten the townspeople, at one point severing the hand of a local who claimed the Empire had no power over them on Tatooine. Reva focused her attention on moisture farmer Owen Lars, announcing to the crowd that she would kill the man and his family if no one spoke up about their knowledge about the Jedi, at which point the Fifth Brother intervened and forced her to stand down. Afterwards, he pulled her aside and chastised her for overstepping and continuing her pursuit of Kenobi in spite of the Grand Inquisitor explicitly forbidding it.\nDefying the misgivings and demands of her peers, the Third Sister hired a group of bounty hunters to kidnap the adopted daughter of Alderaanian Viceroy Bail Prestor Organa, Leia Organa, hoping to attract Kenobi's attention and lure him into the open. She ordered the bounty hunters to bring the Princess to Daiyu, where she intended to confront the Jedi Master.\nOn Daiyu, the Third Sister was once again confronted by the Grand Inquisitor, accompanied by the Fifth Brother and the Fourth Sister, who ordered her to stand down while he took over her operation of hunting down Kenobi. Additionally, he berated her for kidnapping the daughter of an Imperial senator in order to achieve her goal, though she argued that they had done worse. The Grand Inquisitor then told the Third Sister that she would be punished for stepping out of line at a later point in time.\nOnce again disobeying her superior's orders, the Third Sister placed a bounty on the Jedi Master's head, intending for the credit-purposed lowlifes and mercenaries to draw him out to her, while she waited on the rooftops of the city. After seeing an exchange of blaster fire between Kenobi and several bounty hunters, she began to run towards him. When she eventually reached the ground level she was stopped by the con artist Haja Estree, who pretended to be a Jedi in order to stall her and aid in Kenobi and Organa's escape. The Third Sister instead probed the charlatan's mind and discovered that her target would be making their escape from Daiyu via a cargo shipyard.\nThe Third Sister soon confronted her quarry at the shipyard, revealing to him that she intended to keep him alive so she could deliver him to Vader, revealing to Kenobi that he was still alive, and admitting that she was privy to her master's true identity as Anakin Skywalker. The Grand Inquisitor soon arrived and interrupted the Third Sister, bidding her to move out of his way and to watch and learn as he personally retrieved the Jedi Master. Briefly feigning obedience, the Third Sister stepped aside, only to stab the Grand Inquisitor in the abdomen, mockingly remarking that she had no intention whatsoever of letting him take all the glory of her achievement. Kenobi took the distraction to escape on a cargo ship with Organa as the Third Sister watched on and yelled threats at him.\nThe Third Sister contacted her master to provide an update on the Jedi runaway. The Dark Lord told her that if she captured him, the position of Grand Inquisitor would be hers, but if she failed, she would not live to regret it. Afterwards, she met with the Fifth Brother and the Fourth Sister, where she instructed them to send out all the remaining Probe droids they had. The Fifth Brother questioned her authority and claimed that he was the next in line for the Grand Inquisitor's position, to which the Third Sister explained that she had just spoken with their master personally, and that he had asked her to lead the hunt. Despite his reluctance to following her orders, the Fifth Brother obliged.\nProbes were sent to Mapuzo in order to locate the Jedi Master and, once discovered, the Third Sister, the Dark Lord and the other Inquisitors journeyed to the planet to confront the runaway Jedi. The Third Sister watched as Vader tried to lure out Kenobi by killing some of the townspeople in a mining village and at one point tried to interfere, in which the Fifth Brother stopped her and reminded her of their orders to stand back. As the townspeople were being rounded up, the Third Sister found a safe house belonging to a network known as the Hidden Path, where Force-sensitives escaped Imperials and given new identities. In the safehouse, she saw the emblem of the Jedi scratched onto a wall, bringing back painful memories she had; along with discovering a tunnel leading to the spaceport. Realizing that her quarry likely headed down it, the Third Sister made her way to the spaceport and killed the pilot waiting for them there. As her quarry, consisting only of Organa, arrived, The Third Sister kidnapped her once again.\nOrgana was brought to Fortress Inquisitorius on the moon of Nur, where the Third Sister attempted to interrogate the young Princess for the location of the Path. However, despite claiming that Kenobi was killed on Mapuzo and that no one was coming to save her, the girl refused to cooperate and remained defiant to the Inquisitor. Before Organa could be tortured for answers, however, Kenobi and Tala Durith were able to distract the Third Sister and rescue the princess.\nAs the trio attempted to escape, the Third Sister chased after them despite the Fifth Brother demanding the fortress locked down, accusing her of bungling the situation. Flanked by stormtroopers and Purge Troopers, she was able to confront the three, cornered a hangar, but before they could be executed, a pair of T-47 airspeeders arrived and rescued the three, though the Third Sister was able to knock one out of the sky. The Third Sister's bungling of the situation caused an infuriated Vader to confront and Force choke her in anger upon his arrival, preparing to kill her for her failure. However, her master was placated when she revealed that she installed a homing beacon inside Organa's droid L0-LA59 and that it would lead them to Kenobi and whoever is with them.\nHaving impressed Vader by tracking the Princess and the Jedi Master to Jabiim, which housed the Path's main fortress, through Organa's droid, Lola, the Third Sister, aboard the Commander-in-Chief's personal Star Destroyer flagship, the Devastator, was elevated to the rank of Grand Inquisitor.\nLola, having been reprogrammed while Leia was held hostage, snuck into the base's defenses and locked everyone inside while The Third Sister and Vader's troops, arriving on the Imperial shuttle Scythe, started bombarding the blast doors, beginning the attack on Jabiim.\nSoon, Kenobi tried to parley with Reva, deducing that she was present during the night of Order 66 and witnessing Vader leading the attack against her fellow younglings herself, having initially thought he was there to help fend off the clones. She revealed she survived Order 66 by playing dead and Kenobi soon realized that Reva did not truly serve Vader, but instead sought to bring justice to her fallen younglings by gaining his trust and then betraying him. However, the Third Sister, distrusting of the Jedi Master as he was not at the Temple to help her and her \"family\" escape, rejected his help, pointing out that the Dark Lord had been his own Padawan and asking why he did not stop him.\nAfter a brief but fierce exchange of fire between the Imperial troops and the members of the Path, which saw their leader Durith sacrifice herself against the oncoming troops, Kenobi decided to surrender with the intention of bringing Reva to Vader himself, asking her if she will let him slaughter more civilians, including children, and offered her to stop him again. When asked if the Dark Lord would see it coming, the Jedi Master reassured her that he would be too fixated in settling the score with his old mentor.\nSoon, Kenobi was able to escape with the Path and Organa, leaving Vader, who had just reached the fortress, behind, open to Sevander's attack. The Inquisitor snuck up behind him with the intention to assassinate her master, but the Dark Lord, sensing her, stopped her before she could do the deed. Sevander, imbued with rage, tried to charge at him, but she quickly underestimated Vader's true powers and was knocked down multiple times. They quickly engaged in a lightsaber duel, though the Third Sister, momentarily haunted by memories of the Dark Lord slaughtering her fellow younglings, kept her guard down and was momentarily stabbed through the torso, weakening her. Sevander, realizing that the Grand Inquisitor survived his injuries, was relieved of her title of Grand Inquisitor due to her treachery and left to die. However, she endured and was able to activate a holoprojector of a message from Bail Organa intended for Kenobi of his plans with Owen Lars and Luke Skywalker, a farm boy living on the desert planet of Tatooine who happened to be the son of the unaware Vader.\nWith Kenobi and the Path occupied with Devastator opening fire on them, Reva set off for Tatooine on a mission to hunt for Owen Lars and Luke Skywalker, tracking them to the Lars Homestead. After he was informed by Dardin Shull, Lars, returning to the homestead, told his wife, Beru Whitesun Lars, about the incoming attack, and prepared to fend off against Reva.\nSevander soon entered the homestead, where she was ambushed by Owen and Beru opening fire on her. The former Inquisitor was able to enter the interior of the homestead and disarm the farmer after a brief scuffle, but his wife got the jump on her, buying enough time for the boy to make a run for it. With Reva dead set on killing Luke as revenge, she initiated a pursuit against the young farm boy.\nSevander followed Skywalker into Beggar's Canyon, where she was finally able to halt the boy in his tracks by using the Force to dislodge the rock he was standing on. With Skywalker now unconscious, Sevander moved in for the kill, but was haunted by memories of Vader during the siege on the Jedi Temple and herself as a youngling in Skywalker's place. Sevander stopped herself before she was able to deal the killing blow, and instead returned, albeit wearily, to the Lars homestead, with an unconscious Skywalker in her arms.\nKenobi, who had returned to Tatooine after an intense duel against Vader, faced Sevander and reassured her that she did not fail, nor fall to the dark side like her cruel former master, but brought peace and honor to her fallen younglings by showing mercy to Skywalker and was now free to choose her own destiny. Tearfully laying down her lightsaber, Sevander chose her destiny to be free.\nWhile the Inquisitorius was extinct by the time of the Battle of Scarif in 0 BBY, the Third Sister's fate remained a mystery, much like that of the Third Brother.\nReva Sevander had brown eyes, dark skin, and black hair, which she wore in a braided ponytail with cornrows on the sides. As the Third Sister, she was highly ambitious. Thus, her mind was set on tracking down Jedi Master Obi-Wan Kenobi, with her fellow Inquisitors assuming she hoped his capture would gain her Darth Vader's favor and therefore improve her station. In reality, she sought only to get close to the Sith Lord to kill him for revenge on his actions against her fellow younglings.\nHer aspiration put her at odds with the Grand Inquisitor and Fifth Brother, who both found her to be rash and unbalanced, in addition to looking down upon her as the \"least of them.\" Sevander was aware of Vader's former persona of Anakin Skywalker due to his raid on the Temple. Her desire for revenge blinded her to the hypocrisy of her own actions; she wanted revenge on the Dark Lord for killing the Jedi she saw as her childhood family, only for that quest to lead her down a path where she was willing to kill children and families herself if it meant avenging her own. However, Reva considered her revenge against Vader fair. In order to carry out her revenge, Reva cynically pretended while infiltrating the Inquisitorius to be a loyal servant of Vader and to have patriotic tendencies towards the Galactic Empire.\nFailing in her attempt to hunt down Vader and learning of the existence of the boy Luke Skywalker, Sevander was blinded by her rage and devised a plan to assassinate the innocent child in an attempt to have some kind of jusitice for her fallen family. In the end, despite having gone to kill Luke Skywalker, Sevander could not bring herself to do it, as she realized doing so would have made her just like the one who killed her family, and she dreaded becoming him. She chose mercy and tearfully returned Luke to his uncle and aunt, and was assured by Obi-Wan that she had found her way out of the darkness and could at last be free.\nThe Third Sister was skilled with her lightsaber—notably, she was able to effectively block blasts from a T-47 airspeeder with it. The Third Sister was also extremely agile and athletic, which she demonstrated by jumping across the rooftops of Daiyu and evading some of the strikes of her former master after betraying him. Ultimately, her lightsaber skills proved futile when she faced Vader, who was able to effortlessly evade each of her strikes despite Reva being very quick on her feet. The only strike that she landed during her duel against Vader was one that managed to knock the saber the Dark Lord was using out of his hands, though her adversary quickly recovered.\nSevander also displayed the ability to use the Force, being able to lift and throw an explosive at an airspeeder that was trying to escape Fortress Inquisitorius. She was also able to extract information from the minds of individuals and use the Force to collapse an antenna tower while chasing Kenobi. Despite this, the Third Sister was somewhat defenseless against attacks from other Force-users, as she was easily kicked back by the Grand Inquisitor after he blocked her lightsaber strike with the Force, she was also prevented from sitting on a chair by the Fifth Brother, was non-fatally Force choked by the Dark Lord, and was Force-pushed back by Kenobi, being easily overwhelmed on all four occasions.\nBefore she became a Jedi hunter, she had possession of a droid. However, it was taken away from her, like many of her past belongings and acquaintances. During her time as an Inquisitor, the Third Sister wore black armor with a cape, and wielded a red-bladed Inquisitor lightsaber. After her loss on Jabiim, Sevander adopted a brown cloak that she wore over her uniform.\nThe character of Reva Sevander was originally created by screenwriter Stuart Beattie for an Obi-Wan Kenobi-centric movie that ultimately got canceled. Beattie described the character as a \"very confused, conflicted, blinded character filled with hate and rage and all the stuff that makes people want to be Sith and Sith Acolytes.\" The movie eventually evolved into the Disney+ limited series Obi-Wan Kenobi, where she was portrayed by Moses Ingram. Her younger self was portrayed by Ayaamii Sledge, who was credited as a Jedi Youngling in the series. While she was first mentioned only as the Third Sister in \"Darth Maul and Other Dark Side Followers,\" a 2021 issue of De Agostini's Star Wars Encyclopedia reference booklets, the character was first pictured and fully revealed as Inquisitor Reva by an article published by Entertainment Weekly magazine on March 9, 2022, providing a first look at the Obi-Wan Kenobi series. StarWars.com later confirmed that the newcoming Inquisitor character was, in fact, the Third Sister.\nStuart Beattie created Reva because Kenobi needed someone to defeat or save, since he was not going to do that with Vader. He also wanted to create a brand new character that wasn't bound by any pre-existing canon. Beattie thought of having Vader leave Reva for dead during the Great Purge of the Jedi Temple, sending her on the path to become an Inquisitor. This allowed the writer to create a confused and blinded character filled with hate and rage. The original, movie version of Reva didn't know that Anakin Skywalker became Darth Vader, although the part where Skywalker killed her fellow younglings and tried to kill her and left her for dead was the same. This version of Reva viewed the Jedi as villains, believing the Empire's lies about them plotting a coup to overtake the Republic, but they were stopped by the clone troopers, resulting in Reva hunting her fellow Jedi. Reva led a squad of ten Stormtrooper Marshals that were the equivalent of the U.S. Marshals. Reva didn't find out about Vader's real identity until Kenobi told her. Realizing that she had been wrong the whole time, Reva saved Kenobi by sacrificing her own life, telling Vader that she killed Kenobi. This would result in Vader killing her, like she knew he would, and end his obsession with finding Kenobi. The original plans for the series also didn't include any other Inquisitors.\nAlthough the character shares some similarities with Trilla Suduri from the 2019 video game Star Wars Jedi: Fallen Order, Beattie maintains that this was a pure co-incidence, as Reva's character was created before the video game was even released.\nThe story for Obi-Wan Kenobi was crafted by director Deborah Chow and writer Joby Harold, who described Reva as a ruthless and ambitious Jedi hunter, and stated that the character will have a very significant role in the upcoming series while contributing to the legacy of Star Wars villains \"in a really interesting way.\" Harold found it was important to define how singular of purpose she is through action as well as monologuing. To do this, Harold had Reva be unpredictable such as when she cut off a woman's hand. Harold also established Reva as being impulsive and committed to her own goals, so he felt like there was enough room for her character to push further than the other Inquisitors.\nDeborah Chow wanted Reva to be played by a young woman that the audience would believe could take on Darth Vader. Chow liked Ingram's strength, intelligence, and charisma, so she was excited when she and the crew casted her in the part of Reva. After Ingram spent a week auditioning, Deborah Chow told her that she got the part as Reva in a Zoom call. The role required more athleticism than anything Ingram had done before and she spent about four months training before she started acting. The costume worn by Ingram was one of the first costumes that costume designer Suttirat Anne Larlarb attended to. Every single piece started out as as sketches from Larlarb, which went to costume illustrator Darell Fuentes, and then it received more technical drawings. The workshop made the costume pieces feel like a second skin to Ingram. Ingram's costume was mostly black on black, so it was broken up with some textural differences. Stacia Lang, an assistant costume desginer and Larlarb's helper, oversaw the build of the costume. The costume made Ingram stand in a certain way, and she felt bold and strong. Ingram felt like no one was looking for her to be something specific, so she didn't look at other Star Wars lore and she had free reign to be who she thought Reva is. Ingram said that her character could accomplish her mission \"at all costs when given the opportunity.\" Ingram also expressed that she hoped the look for Reva's hair, which was finalized after a lot of conversations with Chow, would allow Black children with kinky hair to wear their natural hair in Halloween costumes. Ingram said that \"it's all heart\" that makes her character stand out from The Grand Inquisitor and Vader.\nReva's lightsaber was a completely original design and Ingram received it as a gift from Lucasfilm president Kathleen Kennedy. Lucasfilm vice president and executive creative director Doug Chiang created many of the original concepts for the lightsaber. The weapon was customized to fit Ingram's hands. She spent a lot of time icing her hands before she learned how to wield her lightsaber. Ingram said that lifting the lightsaber required a lot of forearm strength, but she eventually got the hang of it. The actor received fight training from Ewan McGregor, the actor who played Kenobi in the series. He showed her encouragement as she fumbled through rookie mistakes. During training, Ingram learned what needed to change with the lightsaber, so it went through several processes. Depending on the scene that was being shot, Ingram used three different lightsabers: a full length prop, a medium prop, and a very small prop. Ingram also had a practice lightsaber that she was sent home with. The first scene that was shot with Ingram was her and the other Inquisitors stepping off of their ship on Tatooine. In the beginning of filming, Ingram felt like she could do her job without going through \"a period of demystifying\" a deep love for the franchise, which made playing the character easier for her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Inquisitor",
  "/wiki/Third_Brother",
  "/wiki/Mirialan",
  "/wiki/Galactic_Empire",
  "/wiki/Scientist",
  "/wiki/Reeva_Demesne",
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Reva",
  "/wiki/Sister_(disambiguation)",
  "/wiki/Part_III",
  "/wiki/Part_IV",
  "/wiki/Part_V",
  "/wiki/Part_VI",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Inquisitorius",
  "/wiki/Anakin_Skywalker",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Force-sensitive",
  "/wiki/Brother/Sister",
  "/wiki/Imperial_Era",
  "/wiki/Grand_Inquisitor",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Jedi_Initiate",
  "/wiki/Time",
  "/wiki/Jedi_hunter",
  "/wiki/Jedi",
  "/wiki/The_Force",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Order_66",
  "/wiki/Youngling",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Clone_Wars",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/501st_Legion",
  "/wiki/Standard_year",
  "/wiki/The_galaxy",
  "/wiki/Lord",
  "/wiki/Jedi_Knight",
  "/wiki/Sith",
  "/wiki/Hunt_for_Obi-Wan_Kenobi",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Assassin",
  "/wiki/Kidnapping_of_Leia_Organa",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/House_of_Organa",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Mission_to_Daiyu",
  "/wiki/Daiyu",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Planet",
  "/wiki/Battle_on_Mapuzo",
  "/wiki/Mapuzo",
  "/wiki/Hidden_Path",
  "/wiki/Prisoner",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Nur",
  "/wiki/Tala_Durith",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Droid",
  "/wiki/L0-LA59",
  "/wiki/Hunt_for_the_Hidden_Path",
  "/wiki/Attack_on_Jabiim",
  "/wiki/Jabiim",
  "/wiki/Emperor%27s_Fist",
  "/wiki/Holoprojector",
  "/wiki/Owen_Lars",
  "/wiki/Tatooine",
  "/wiki/Luke_Skywalker",
  "/wiki/Skywalker_family",
  "/wiki/Lars_family",
  "/wiki/19_BBY",
  "/wiki/Jedi_training",
  "/wiki/Minas_Velti",
  "/wiki/Sith_apprentice",
  "/wiki/Clone_trooper",
  "/wiki/Jedi_temple",
  "/wiki/Cloning",
  "/wiki/Death",
  "/wiki/Dark_side_adept",
  "/wiki/Commander-in-Chief",
  "/wiki/Imperial_Military",
  "/wiki/9_BBY",
  "/wiki/Desert",
  "/wiki/Fifth_Brother",
  "/wiki/Mission_to_Tatooine_(Galactic_Empire)",
  "/wiki/Nari",
  "/wiki/Knife",
  "/wiki/Anchorhead",
  "/wiki/Moisture_farmer",
  "/wiki/Bounty_hunter",
  "/wiki/Alderaanian",
  "/wiki/Viceroy",
  "/wiki/Fourth_Sister",
  "/wiki/Credit",
  "/wiki/Mercenary",
  "/wiki/Blaster",
  "/wiki/Con_artist",
  "/wiki/Haja_Estree",
  "/wiki/Mind_probe",
  "/wiki/Shipyard",
  "/wiki/Probe_droid",
  "/wiki/Mapuzo_mining_village",
  "/wiki/Torture",
  "/wiki/Stormtrooper",
  "/wiki/Purge_Trooper",
  "/wiki/T-47_airspeeder",
  "/wiki/Force_choke",
  "/wiki/Homing_beacon",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Flagship",
  "/wiki/Devastator",
  "/wiki/Scythe_(transport)",
  "/wiki/Lars_Homestead",
  "/wiki/Dardin_Shull",
  "/wiki/Beru_Whitesun_Lars",
  "/wiki/Beggar%27s_Canyon",
  "/wiki/Fight_on_a_barren_moon",
  "/wiki/Battle_of_Scarif",
  "/wiki/0_BBY",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Telekinesis",
  "/wiki/Airspeeder",
  "/wiki/Mind_probe_(Force_power)",
  "/wiki/Reva_Sevander%27s_droid",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Cape",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/Reva%27s_double-bladed_Inquisitor_Lightsaber",
  "/wiki/Stuart_Beattie",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Moses_Ingram",
  "/wiki/Ayaamii_Sledge",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/2021",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Entertainment_Weekly",
  "/wiki/March_9",
  "/wiki/2022",
  "/wiki/StarWars.com",
  "/wiki/Trooper",
  "/wiki/Squad",
  "/wiki/Marshal",
  "/wiki/Second_Sister",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Deborah_Chow",
  "/wiki/Joby_Harold",
  "/wiki/Star_Wars",
  "/wiki/Dismemberment",
  "/wiki/Unidentified_Anchorhead_woman",
  "/wiki/Standard_month",
  "/wiki/Suttirat_Anne_Larlarb",
  "/wiki/Darell_Fuentes",
  "/wiki/Stacia_Lang",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Kathleen_Kennedy",
  "/wiki/Doug_Chiang",
  "/wiki/Water",
  "/wiki/Ewan_McGregor",
  "/wiki/Category:Images_of_Reva_Sevander",
  "/wiki/Part_I",
  "/wiki/Part_II",
  "/wiki/Bounty_Hunters_26",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Inside_Intel:_The_Inquisitorius",
  "/wiki/Obi-Wan_Kenobi:_A_Jedi%27s_Return",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Obi-Wan_Kenobi_Companion",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/June_28",
  "/wiki/June_29",
  "/wiki/March_11",
  "/wiki/July_1",
  "/wiki/March_10",
  "/wiki/June_3",
  "/wiki/June_13",
  "/wiki/August_3",
  "/wiki/April_6",
  "/wiki/May_25",
  "/wiki/July_3"
 ]
}