{
 "name": "Reveth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sidon Ithano's crew"
     ]
    }
   ]
  }
 ],
 "content": "Reveth was a female Twi'lek who served in the crew of the pirate Sidon Ithano.\nAs a member of Sidon Ithano's pirate crew, Reveth was present on the planet Ponemah Terminal when Pendewqell decoded a transmission from the Obrexta III and the crew set out onboard the Shrike to search for the supposed lost treasure of Count Dooku. Reveth took over the gunning station after her fellow pirate Reeg Brosna was swept overboard by a class three sandstorm in the Sea of Sand. When the Shrike came under attack by Scorza's gang and the Gray Gundarks, she launched magnetic tow cables onto the side of Scorza's skiff via torpedo in order to pull the Shrike out of the eye of the sandstorm. A few minutes later, the kinetic disruptor that Brosna had fired froze the particles of the sandstorm, allowing the remaining crew of the Shrike to escape the battle.\nThe crew then discovered the wreckage of the Obrexta III. They hurried through the ship, aware that the battle droids onboard were rectivating. Reveth studied the ship's holo-schematics and located its vault. Inside the vault, they found a cryo-cycle stasis pod containing Republic clone trooper CT-6116, \"Kix\". Pendewquell opened the pod and Reveth attempted to help the trooper stand, but he pushed her away, shouting. Kix fought the pirates while recalling his capture and interrogation by Separatist forces before falling to the floor. Reveth pointed out that he was likely suffering from stasis poisoning, and placed a breath mask over the clone's face once he finally fell unconscious. The crew then fled the vault to escape the wreckage with Kix in tow. As they reached the hatch, they witnessed a sand worm destroying the Shrike. Ithano sent his crew as well as the clone out of the wreck in the single remaining escape pod, leaving the captain behind.\nThree weeks later, Reveth, along with the other remaining crew members and Kix, was in a bar on Ponemah when Ithano approached them with the memory core of the Obrexta III, which would allow them to locate and salvage the secret Separatist installations left over from the Clone Wars.\nWith Kix having joined Ithano's crew, the crew proceeded to raid more Separatist holdouts. One was located in a misty swamp, where Sidon Ithano, Reveth and Kix were ambushed by B1 battle droids, which were unearthing themselves from the ground, trying to reach the crew. C-3PO later told this story to some visitors and described it as \"spooky.\"\nReveth was present during another raid of a formerly Separatist Munificent-class star frigate, wherein Quiggold was captured by a group of pirates, led by Gruk, in the Lost Clusters. Secretly, however, Quiggold getting captured was all part of the plan, as he'd brought a beacon onto the ship with him. Reveth was able to use said beacon to help her hack into the security systems of the Separatist ship, putting the ship under their control, and allowing the rest of the Crimson Corsair crew to board and ultimately take over the ship, killing Gruk's crew. After the battle, Reveth can be seen using an asteroid near the frigate to try and boost the hyperwave scanner's range, in order to try and find the rest of the Separatist ships out there.\nReveth first appeared in the short story \"The Crimson Corsair and the Lost Treasure of Count Dooku,\" written by Landry Q. Walker. Reveth was first pictured in the comic Star Wars Adventures Ashcan, also written by Walker. Artist Eric Jones made concept of her for her comic appearance.\nAlthough Star Wars Adventures depicted Reveth's left arm as being cybernetic, two subsequent sources, Star Wars: Scum and Villainy: Case Files on the Galaxy's Most Notorious and Star Wars: Smuggler's Guide, have shown her with a cybernetic right arm. As such, this article assumes her right arm was a prosthetic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Limb",
  "/wiki/Sidon_Ithano%27s_crew",
  "/wiki/Pirate",
  "/wiki/Sidon_Ithano",
  "/wiki/Planet",
  "/wiki/Ponemah_Terminal",
  "/wiki/Pendewqell",
  "/wiki/Obrexta_III",
  "/wiki/Shrike_(sail_barge)",
  "/wiki/Race_for_the_Lost_Treasure_of_Count_Dooku",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Reeg_Brosna",
  "/wiki/Sandstorm",
  "/wiki/Sea_of_Sand",
  "/wiki/Scorza",
  "/wiki/Scorza%27s_gang",
  "/wiki/Gray_Gundarks",
  "/wiki/Skiff",
  "/wiki/Standard_minute",
  "/wiki/Kinetic_disruptor",
  "/wiki/Starship",
  "/wiki/Battle_droid",
  "/wiki/Cryo-cycle_stasis_pod",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_trooper",
  "/wiki/Kix",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Breath_mask",
  "/wiki/Sand_worm",
  "/wiki/Escape_pod",
  "/wiki/Captain",
  "/wiki/Standard_week",
  "/wiki/Cantina",
  "/wiki/Memory_bank",
  "/wiki/Clone_Wars",
  "/wiki/Separatist_holdouts",
  "/wiki/C-3PO",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Quiggold",
  "/wiki/Gruk",
  "/wiki/Lost_Clusters",
  "/wiki/Hyperwave_scanner",
  "/wiki/The_Crimson_Corsair_and_the_Lost_Treasure_of_Count_Dooku",
  "/wiki/Landry_Q._Walker",
  "/wiki/Eric_Jones",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_The_Crimson_Corsair_and_the_Crime_Lords_of_the_Barren_Rim",
  "/wiki/Star_Wars_Adventures_(2020)_7",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Helmets"
 ]
}