{
 "name": "Rewna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Rewna was a female Human droid mechanic who served as an apprentice mechanic in the Confederacy of Independent Systems during the Clone Wars, in which they fought the Galactic Republic. At the end of the war the Sa Nalaor, the Munificent-class star frigate on which Rewna served, fled Republic space and ended up crashing on the planet Cholganna. Rewna along with a number of other crew members survived the crash and set up a settlement known as the Retreat, where they survived into the reign of the Galactic Empire. By the time of the Galactic Civil War, Rewna was middle aged and ran the droid repair shop in the Retreat, a job that was important enough to give her second priority in the eyes of Rel Harsol, the captain of the Sa Nalaor and leader of the survivors. Rewna made the most of the situation but truly wished to leave Cholganna and return to civilized space, something Harsol was aware of. She was aided at times by an astromech droid named R5-J1, although it often broke down.\nRewna was present at the Retreat when a group of spacers and group of Yiyar salvage corporation employees who were searching for the Sa Nalaor were brought in by Harsol. The spacers and salvagers remained in the Retreat until it was visited by the Imperial Security Bureau, after which the spacers escaped.\nRewna first appeared in 2013 in Beyond the Rim an adventure module written by Sterling Hershey for the Fantasy Flight Games roleplaying game, Star Wars: Edge of the Empire. She was included as someone that players could potentially interact with whilst in the Retreat. Players have several options in the Retreat, and can end up fighting the survivors and/or the Imperials or end up transporting at least some of the survivors off of Cholganna.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sa_Nalaor/Legends",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cholganna/Legends",
  "/wiki/The_Retreat",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Rel_Harsol",
  "/wiki/Captain/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/R5-J1",
  "/wiki/Canon",
  "/wiki/Spacer/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/2013",
  "/wiki/Beyond_the_Rim",
  "/wiki/Sterling_Hershey",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}