{
 "name": "Rezi_Soresh_(impostor)",
 "display_name": "Rezi Soresh  (impostor)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Unidentified dead red moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rezi Soresh"
     ]
    }
   ]
  }
 ],
 "content": "This Human male impostor of Galactic Empire Commander Rezi Soresh was used in Soresh's deceptions against the Heroes of Yavin in 1 ABY. When the Rebels landed near Soresh's compound in the Sixela system, this man was there to meet them. He was used to stand in for Soresh, who wanted to trap Luke Skywalker after contacting Skywalker on Nyemari. Soresh had captured a colony vessel and took its passengers hostage, threatening to execute them if Skywalker did not arrive.\nWhen the Rebels landed on Soresh's barren moon, Han Solo disembarked from the Millennium Falcon. He met the hooded impostor, presuming it to be the real Soresh. The impostor asked for Skywalker. Solo ambiguously replied that Skywalker may or may not be on the Falcon. As he spoke, two T-65 X-wing starfighters strafed the compound. When the impostor tried to blame Solo for the coming execution of the hostages, he brandished a triple blaster. Solo shot the impostor in response. The impostor's blaster went off while his body landed in the dust a few meters away.\nAfter the X-wings landed, a series of mines started exploding among the hostages. The Rebels rushed to help them. Skywalker was accosted by a hostage, who revealed himself as the real Soresh when he hit Skywalker with a Force pike, capturing him and his companions.\nIt is unknown how Soresh was able to use an impostor, but he was probably drugged through the use of chemicals Soresh frequently used to control his servants. The impostor's first and only appearance was in Alex Wheeler's 2010 book, Rebel Force: Uprising.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Unidentified_dead_red_moon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Rezi_Soresh",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Sixela_system",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Mission_to_Nyemari",
  "/wiki/Nyemari",
  "/wiki/Endeavor_(Arkanian_starship)",
  "/wiki/Han_Solo/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Triple_blaster",
  "/wiki/Death/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Mine/Legends",
  "/wiki/Force_pike/Legends",
  "/wiki/Project_Omega",
  "/wiki/Alex_Wheeler",
  "/wiki/2010",
  "/wiki/Rebel_Force:_Uprising"
 ]
}