{
 "name": "Rh%27klin",
 "display_name": "Rh'klin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  }
 ],
 "content": "Rh'klin was a Human smuggler who lived during the Galactic Civil War.\nIn 1 ABY, Rh'klin was present on Tatooine, visiting several cities on the planet. At the same time, a bounty hunter named Tearfin traveled to the planet. The bounty hunter was seeking a smuggler who stole a crate of valuable equipment. As the crate had a transponder, she easily traced her mark to Tatooine. However, the thief found the transponder and turned it off not long after Tearfin arrived on the planet. The bounty hunter then located Rh'klin and a group of smugglers, suspecting one of them of being her mark, but she was not able to identify the thief. Besides Rh'klin, the group included five other smugglers, namely Parugga, D'lonis, Barosk, Klaphini and Captain Himfan. Tearfin interrogated Rh'klin and the other smugglers, but could not determine who was innocent or guilty, basically because all of the smugglers simply blamed each other. A spacer seeking to become a Hero of Tatooine eventually came along to help Tearfin. After interrogating all the smugglers, the spacer finally identified the thief. The spacer later informed Tearfin and was awarded the Mark of Intellect for the successful investigation.\nRh'klin was a non-player character  in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Because Rh'klin spawned under the generic \"smuggler\" template, the appearance of this NPC was randomized under one of eight possible depictions.\nRh'klin was added to the game as part of the \"Hero of Tatooine\" questline, released with \"Publish 9\" on June 29, 2004. This NPC periodically spawned in random cities across Tatooine, along with Tearfin and the five other smugglers. Players taking part in the \"Intellect\" segment of the \"Hero of Tatooine\" had to interrogate Rh'klin and the other smugglers to determine which one was Tearfin's mark. The identity of the culprit varied among the six smugglers each time the quest was reset. With the release of the \"Publish 24,\" on October 18, 2005, Rh'klin and the five other smugglers were given proper names to replace randomly generated names.\nThe \"Hero of Tatooine\" questline was extensively revamped upon the introduction of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005 but the \"Intellect\" segment was not altered.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Tearfin",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/City/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Transponder",
  "/wiki/Parugga",
  "/wiki/D%27lonis",
  "/wiki/Barosk",
  "/wiki/Klaphini",
  "/wiki/Captain/Legends",
  "/wiki/Himfan",
  "/wiki/Spacer/Legends",
  "/wiki/Quest_of_the_Hero_of_Tatooine",
  "/wiki/Hero_of_Tatooine",
  "/wiki/Mark_of_Intellect",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_29",
  "/wiki/2004",
  "/wiki/October_18",
  "/wiki/2005",
  "/wiki/November_15",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}