{
 "name": "Rhalia Jinsari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1.5 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Rhalia Jinsari was a female Zabrak bounty hunter, who lived during the Galactic Civil War. During 1.5 ABY, she was sent by the Dim-U monks to kill Vardias Tyne, after he ended up killing a bantha that was destroying his vaporators.\nDuring 1.5 ABY, Vardias Tyne, a resident of Anchorhead on Tatooine, killed a bantha that was destroying his vaporators. Unfortunately for Vardias, Brother Chonar of the bantha-worshiping Dim-U monks learned of this, and hired Rhalia Jinsari, a Zabrak bounty hunter, to kill Vardias Tyne.\nHowever, before Rhalia could reach town, she was killed by a spacer who agreed to help Vardias.\nRhalia Jinsari was a Non-Player Character  in the MMORPG Star Wars Galaxies. Players who performed a series of quests for Vardias Tyne in Anchorhead had to hunt down and kill Rhalia Jinsari outside the town. Although Rhalia's physical characteristics were obscured by her armor, examining her revealed that she was a female Zabrak. Although the player could choose not to do Vardias Tyne's quest to kill Rhalia, this article assumes 100% game completion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Dim-U",
  "/wiki/Vardias_Tyne",
  "/wiki/Bantha/Legends",
  "/wiki/Moisture_vaporator/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Chonar",
  "/wiki/Canon",
  "/wiki/City/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Armor/Legends"
 ]
}