{
 "name": "Rhil Dairo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "GoNet"
     ]
    }
   ]
  }
 ],
 "content": "Rhil Dairo was a human female reporter for GoNet during the High Republic Era. She was requested by Chancellor Lina Soh of the Galactic Republic to cover the Republic Fair on the planet Valo, assisted by her cam droid, T-9. After the Nihil marauders attacked Valo during the Republic Fair, Dairo was responsible for broadcasting word of the attack offworld.\nPrior to working for GoNet, Dairo worked for another news organization, covering devastating wildfires that ravaged an unidentified planet. While covering the wildfires, Dairo discovered that the local fire chief, who was in charge of protecting the local population and their homes, was charging people to save their homes. With T-9 still broadcasting, Dairo engaged in a fierce verbal exchange with the fire chief, telling him that he was the one who deserved to burn. Unamused by Dairo's comments, the fire chief explained to her that the situation was none of her business. Dairo, enraged by both the situation and the chief's remarks, grabbed a water hose from the nearest firefighting droid and doused the fire chief with liters of foam - forcing the fire chief to the ground. The footage of this exchange was broadcasted across the Galaxy, causing Dairo's employer to fire her. However, the Galaxy at large praised Dairo's actions, and soon after her firing, dozens of new organizations requested that Dairo work for them. Dairo eventually ended up at the GoNet news organization. Still, Dairo's career was nothing extravagant. She typically found herself reporting on whatever non-story her producer had picked for her, such as micro g-basket weaving as a cub reporter on Cordota. This all changed when the Galactic Senate approved GoNet to provide the official coverage for the Valo Republic Fair. GoNet initially planned on sending Sine Spenning to cover the fair. However, Chancellor Lina Soh refused this offer. Instead, Soh requested that Dairo be the primary reporter for the fair, as Soh viewed Dairo as a hero and someone who stood up for what was right. GoNet approved Soh's request, and Dairo became the official reporter of the Republic Fair.\nDairo accompanied Soh and her party aboard the Coruscant Dawn on their journey to Valo. Dairo had been given full access to the Chancellor, her ship, and her guests. Some of these guests included Jedi Masters Stellan Gios and Nib Assek, whom Dairo had the opportunity to film performing a ceremonial lightsaber fight using an ancient lightsaber form. Following the demonstration, Dairo joined Gios, Assek, and Burryaga Agaburry as the party checked in on the Chancellor. As the party entered Soh's chambers, they found her in the middle of a conference call discussing the fair's proceedings. Dairo instructed T-9 to stop recording audio until she knew the sensitivity of Soh's conversation. Although Dairo had clearance access, that didn't stop Soh's aide, Norel Quo, from trying to escort her and T-9 out of the room upon their arrival. Soh, however, instructed Quo that Dairo had full permission to stay in the room, as long as the footage was not being live-streamed. Dairo confirmed that the footage was being pre-recorded and reviewed for security reasons before publication, and Soh's conference continued.\nDairo observed Senator Noor, Senator Vaadu, and Jedi Master Avar Kriss on holodisplays and Quo and Larep Reza at Soh's side. Dairo instructed T-9 to resume audio recording and watched as a heated exchange broke out during the conference. Senator Vaadu expressed concerns about the safety of the fair, especially with the rise in Nihil attacks. Senator Noor also raised concerns regarding the Drengir, Kriss's newly formed alliance with the Hutts, and Senator Tia Toon's Defense Force Program proposal. However, Soh was adamant that the fair would go off without incident, the Drengir would be dealt with, and Toon was nothing more than a nuisance. As the conference call ended, Dairo and the Jedi left Soh's chambers.\nWhile still on the Coruscant Dawn, Dairo joined the rest of Soh's party as they watched Nihil Tempest Runner Pan Eyta's attack on the Innovator, which was currently docked on the planet Cyclor. Dairo was particularly disturbed by the images of the scav droids during the battle, who were intent on destroying the Innovator and any ship that aimed to defend it. During the battle, Toon called into the Coruscant Dawn and spoke with Soh. Seeing Dairo's cam droid recording the battle's proceedings, Toon voiced his concerns to Soh over Dairo's footage, despite the fact that it was initially approved by a Senate majority, including Toon, to provide a transparent view of the Republic affairs. Toon was concerned that the footage would only show Soh's narrative, and that the attack on Cyclor would conveniently be left out.\nAfter Soh and her party arrived on Valo, they were given tours of the fairgrounds, exhibits, and each of the floating islands by Coordinator Sameera Ra-oon. Dairo stayed ever presently in tow with the party, with T-9 recording as much as possible to show the galaxy all the fair's offerings. The only time Dairo left the Chancellor's side was during the arrival of Regasa Elarec Yovet, the Queen of the Togruta. Even though Dairo had clearance to stay with Soh and the rest of the welcoming committee, she joined the media corps on the sidelines, a decision that Stellan Gios pondered as he waited for Elarec Yovet to disembark her vessel. Dairo and T-9 captured the arrival of Yovet, along with the Queen's introductions to Soh and the rest of the welcoming committee members.\nAfter the Chancellor officially opened the fair, Dairo remained by her side, recording and reporting on the fair's festivities. Dairo also became friendly with fellow members of Soh's party, including Soh's son, Kitrep Soh. Kitrep grew fond of Dairo, as she made him feel more comfortable with being in the galaxy's spotlight.\nWhen the Nihil attack began on the fair, Dairo was still in the company of Soh. The Chancellor, along with Yovet, Madam Conserra, Gios, and Jedi Master OrbaLin, were visiting the opera stage at Fair Park. At the onset of the attack, the Nihil severed all communications on the planet, including Dairo's connection to T-9 via her implant. While she could still communicate with T-9 verbally, she no longer had access to T-9's footage. Realizing the dire need for communications to be restored, Gios ordered OrbaLin to reach the communications tower and repair it. Dairo, having previously seen the tower on the tour of the fairgrounds, offered to lead the way for OrbaLin.\nAs Dairo, OrbaLin, and T-9 made their way to the communications tower, the Nihil deployed their signature war cloud over Lonisa City. Dairo found herself blinded and disoriented as a result of the gas, unsure of which direction the communications tower was. Realizing they would never make it to the communications tower, OrbaLin led Dairo and T-9 inside the Starlight Pavilion. Although the Starlight Pavilion building was free of poisonous gas, Dairo still had vision and breathing difficulties. Luckily, OrbaLin was able to free her from the effects of the gas with the Force. Once Dairo came to her senses, she questioned OrbaLin why he had brought them to the Starlight Pavilion rather than the communications tower. OrbaLin explained that they would never reach the communications tower with Dairo being so affected by the war cloud. Instead, the Jedi had come up with a backup plan. OrbaLin explained that the Pavilion housed an ancient deep space transmitter relay, originally from the temple of Vrogas Vas. The transmitter was planned to be displayed in the Pavilion the following day and was located within the Pavilion's storage room. OrbaLin explained to Dairo that he needed her to help bypass the Nihil's jammer and transmit a distress signal. Dairo was hesitant but realized that getting a signal out of the system was one of their only chances of surviving the Nihil attack.\nAs the trio made their way to the storage room, Dairo realized that they were not alone. Soon, a quartet of Nihil came face to face with the trio, blocking the path to the transmitter. This quartet consisted of Nihil Tempest Runner Lourna Dee, a Lamproid named Quin Amarant, an unidentified Kitonak, and an unidentified human. As the two groups came face to face, OrbaLin prepared to engage in battle. OrbaLin explained that Dairo needed to get to the transmitter and that he would get her there no matter what. OrbaLin then engaged the Nihil group, taking out the human by deflecting a blaster bolt and incapacitating the Kitonak and Amarant using Tythonian Mastery Tokens found within the Pavilion's exhibit. Dee engaged OrbaLin. Dairo and T-9 then used this opportunity to break for the storage room.\nDairo and T-9 reached the storage room - Dairo quickly heading to the transmitter and instructed T-9 to stand guard at the door. Although Dairo had used communication equipment for years, she had never seen anything as sophisticated as the ancient transmitter. Using cables from a nearby computer terminal, Dairo powered up the device and prepared to search for any signal making its way off-world. Dairo kept expanding the transmitter's range until she eventually found a signal. However, it was too faint to lock on to, and without overriding the transmitter, there was nothing more she could do on her own. Dairo quickly called T-9 over, who assisted her in prying open the transmitter panel. Dairo pulled out cables from the panel and spliced together a connector that would allow her to connect the transmitter to her implant.\nDairo plugged herself into the transmitter and was immediately overwhelmed with raw data and intense pain. But through the data and the pain, she could still sense the faint signal making its way off-world. Using her implant's modifications, Dairo shut herself off from the physical world, fully immersing herself in the data from the transmitter. She boosted the frequency of the signal, attempting to lock on to it. After fine-tuning the transmitter, Dairo finally locked on to the signal, which she soon realized was the Nihil's secret frequency. The Nihil had designed this frequency to bypass their jammers, allowing them to communicate with each other on the planet, as well as with Nihil forces off-world. Dairo realized she could use the Nihil frequency to bounce a distress signal to the rest of the galaxy. As she started preparing to transmit a call, Dairo was smashed in the head by an unknown object, returning her to her organic senses. As Dairo came-to, she realized Amarant had recovered from his injuries and struck her. Amarant had already destroyed T-9 and was now intent on destroying Dairo.\nWhile Amarant came after Dairo, OrbaLin was still occupied fighting Dee. Sensing Dairo's danger, OrbaLin decided that extreme action needed to be taken. Using all his power, OrbaLin Force Pushed Dee through the Pavilion roof and out to the avenue below – incapacitating her. OrbaLin makes his way to the storage room and finds Amarant lifting Dairo in the air. Amarant was lifting Dairo with such force that it threatened to rip her implant from her face, still attached to the transmitter. OrbaLin then engages Amarant, who drops Dairo to the floor and turns to fight the Jedi. While OrbaLin and Amarant fight, Dairo hauls herself to the transmitter, double checks the connections, and locks onto the Nihil signal – transmitting the message:\nDairo then sets the message to transmit on loop and returns to the fight to assist OrbaLin. After an intense battle resulting in OrbaLin's environment suit being destroyed, the Lamproid was encased by OrbaLin's gelatinous form - incapacitating the marauder. As the Jedi and reporter take a minute to breathe, OrbaLin asked Dairo if the signal made it out. Dairo returns to the transmitter and realizes it has stopped transmitting her message for unknown reasons. Dairo is certain her message was sent but had no way of knowing if anyone had listened to it.\nDairo and OrbaLin secure the Starlight Pavilion, using the Lariat of Armistice – an unbreakable cord that dated back from the days of the Mystic Nine – to bind Amarant. OrbaLin is able to patch together his environment suit and repair T-9 using scavenged parts from a wrecked service droid.\nAfter the Togruta and Republic reinforcements arrived at Valo, off-world communications were quickly restored. Using the newly re-established comms, Dairo begins transmitting the footage of the attack from T-9 to GoNet. Dairo was determined to get the footage to her news station. She needed the galaxy to see what the Nihil had done. While transmitting the footage, Dairo hears Sine Spenning commenting over her footage, now broadcasting to the galaxy. Spenning patches Dairo into the live broadcast via audio, asking her if she is safe. Dairo, viewing the footage through her implant showing the attack's aftermath, struggles to speak to Spenning. She could hear herself talking, but she had no idea what she was saying or if the words made any sense. Eventually, the footage becomes too overwhelming, and Dairo breaks into a sob. ObraLin comforts her, putting a hand on her shoulder, but Dairo brushes his hand away. While the Jedi's touch had given her a sense of calm, Dairo didn't want to feel calm. She wanted to experience the moment in all its rawness. As Dairo takes a moment to compose herself, Sine keeps commentating over the footage. Suddenly, Dairo interrupts Sine when she receives word from T-9 that Soh, who had been unaccounted for, had been found gravely injured.\nAfter Soh was transferred to the medical bay in the Jedi Temple on Valo, Dairo was requested to join the Chancellor at her bedside. Soh, out of her coma but still recovering, wanted to record an interview with Dairo – much to the displeasure of Quo. Following the interview, Jedi Master Gios visited Soh, who requested Dairo stay during their meeting to take stills while the two discussed. Dairo instructed T-9 to cut the sound from the footage, not wanting to intrude on the conversation. The conversation was interrupted by a transmission from Yovet, which Soh allowed Dairo to sit in on but not record. After the discussion with Yovet had ended, Soh requested everyone leave the room to spend time with her son, Kitrep.\nGios requested Dairo's help in executing a plan to fool the Nihil into attacking Cyclor following the attack on the fair. Toon, also assisting in the scheme, spoke with Cyclor's defense team, falsely claiming that the Republic forces were amassing at Hetzal Prime, leaving Cyclor defenseless. Dairo ensured that the message was being transmitted on a signal the Republic had identified as being compromised by the Nihil, hoping to lure the Nihil into a trap at Cyclor. The plan worked, with Tempest Runner Eyta's forces attacking Cyclor, only to be met by a mass of Republic and Jedi forces. Following the battle, Dairo joined Soh on her trip back to Coruscant via the Coruscant Dawn. As a reward for her bravery and integrity in reporting, Soh awarded Dairo full exclusive reporting access to anything she wanted – subject to Senate approval.\nOne of Dairo's most notable traits was her humbleness. Following the Valo Republic Fair attack, in which Dairo sent out the distress signal to request aid, Dairo received praise from both Chancellor Soh and Jedi Master Gios. However, Dairo refused to accept this praise, stating that she was simply doing what needed to be done. As a reporter, Dairo was also very courteous to others and deeply respected their privacy. Unlike other reports, who care most about getting a salacious story, Dairo was most interested in respectfully telling people's stories. Dairo often turned off T-9's camera and microphone features until she learned the sensitivity and subject matter of conversations or situations she was walking into. Dairo was also very perceptive of the emotions of those around her. She could tell when someone was hiding something or putting on a face to mask their true feelings or emotions. Dairo's closest companion was her cam droid, T-9. Not only did Dairo see the droid as a companion, but almost as an extension of herself. The cam droid had been by her side ever since she started reporting. When the droid was temporarily destroyed during the events of the Nihil attack, Dairo was devastated. She felt as if she had lost a limb and was extremely grateful when OrbaLin repaired the droid.\nDairo was highly skilled in dealing with communications devices. Before the Valo Republic Fair events, Dairo had already had years of experience in dealing with such devices. These skills undoubtedly came to her aid during the Nihil attack, when Jedi OrbaLin tasked Dairo with sending out a distress call using an ancient Jedi deep space transmitter. Although the device was extremely old and sophisticated, Dairo was able to operate the machine and successfully send out a distress signal.\nDairo had a heavily modified cybernetic implant that was attached to her face over her right eye. This implant provided Dairo with several unique abilities but was primarily used to communicate with her cam droid, T-9. With this implant, Dairo could silently send commands to T-9, such as when to start and stop recording footage, when to cut the droid's microphones and more. Dairo had modified her implant to visualize raw data and information when she connected the implant to a computer terminal. Additionally, Dairo had also added the ability to visualize sound waves as clearly as if they were physical objects. These visualization modifications allowed Dairo to, when needed, shut all of her senses down and immerse herself in her implant's visualizations, essentially cutting her off from the physical world. All of these modifications proved invaluable for Dairo, who help restore communications during the Nihil attack on the Valo Republic Fair.\nRhil Dairo appeared in the novel The High Republic: The Rising Storm, which was written by Cavan Scott and published in 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Eye",
  "/wiki/GoNet",
  "/wiki/Kitrep_Soh",
  "/wiki/Journalist",
  "/wiki/High_Republic_Era",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Fair",
  "/wiki/Planet",
  "/wiki/Valo",
  "/wiki/Cam_droid",
  "/wiki/T-9",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Attack_on_Valo",
  "/wiki/Rhil_Dairo%27s_producer",
  "/wiki/Cordota",
  "/wiki/Galactic_Senate",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Sine_Spenning",
  "/wiki/Chancellor",
  "/wiki/Coruscant_Dawn",
  "/wiki/Jedi_Master",
  "/wiki/Stellan_Gios",
  "/wiki/Nib_Assek",
  "/wiki/Lightsaber",
  "/wiki/Ancient",
  "/wiki/Lightsaber_combat",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Norel_Quo",
  "/wiki/Senator",
  "/wiki/Vaadu",
  "/wiki/Avar_Kriss",
  "/wiki/Holodisplay",
  "/wiki/Larep_Reza",
  "/wiki/Drengir",
  "/wiki/Hutt",
  "/wiki/Tia_Toon",
  "/wiki/Defense_Force_Program",
  "/wiki/Tempest",
  "/wiki/Tempest_Runner",
  "/wiki/Pan_Eyta",
  "/wiki/Innovator",
  "/wiki/Cyclor",
  "/wiki/Scav_droid",
  "/wiki/World_Pavilions",
  "/wiki/Coordinator",
  "/wiki/Samera_Ra-oon",
  "/wiki/The_galaxy",
  "/wiki/Regasa",
  "/wiki/Elarec_Yovet",
  "/wiki/Queen",
  "/wiki/Togruta",
  "/wiki/Trangess_Conserra",
  "/wiki/OrbaLin",
  "/wiki/Communications",
  "/wiki/Communications_tower",
  "/wiki/Lonisa_City",
  "/wiki/Gas",
  "/wiki/Starlight_Pavilion",
  "/wiki/The_Force",
  "/wiki/Transmitter",
  "/wiki/Jedi_Temple",
  "/wiki/Vrogas_Vas",
  "/wiki/Jammer",
  "/wiki/Distress_signal",
  "/wiki/Lourna_Dee",
  "/wiki/Lamproid",
  "/wiki/Quin_Amarant",
  "/wiki/Kitonak",
  "/wiki/Blasterbolt",
  "/wiki/Tythonian_Mastery_Token",
  "/wiki/Computer_terminal",
  "/wiki/Force_push",
  "/wiki/Lariat_of_Armistice",
  "/wiki/Mystic_Nine",
  "/wiki/Service_droid",
  "/wiki/Jedi_Temple_medical_bay",
  "/wiki/Hetzal_Prime",
  "/wiki/Coruscant",
  "/wiki/Droid",
  "/wiki/Limb",
  "/wiki/Cybernetics",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Cavan_Scott",
  "/wiki/2021",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/StarWars.com"
 ]
}