{
 "name": "Rhylis",
 "display_name": "Rhylis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Shoartu"
     ]
    }
   ]
  }
 ],
 "content": "Rhylis was a male Wookiee member of the Shoartu tribe of the Kerritamba Village on the planet Kashyyyk during the time of the Galactic Civil War. By the time following the Battle of Yavin in 0 BBY, he and Hwruarca worked as arena guards at the Kerritamba Village Arena.\nA male Wookiee by the name of Rhylis lived during the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. He resided on the planet Kashyyyk among his fellow Wookiees in the Shoartu tribe of the Kerritamba Village. By the time following the Battle of Yavin in 0 BBY, he and a fellow female Wookiee by the name of Hwruarca had been assigned the role of arena guards, tasked with the responsibility of guarding the Kerritamba Village Arena. Hwruarca guarded the entrance to the arena, while Rhylis guarded the exit.\nRhylis allowed at least one contestant to exit the arena, after they successfully defeated Shoartu Arena Champion Wirartu in combat.\nDuring his time as an arena guard, Rhylis wore a light brown colored two-strap bandolier and a light brown decorated belt.\nRhylis was a non-player character in Star Wars Galaxies: Rage of the Wookiees, a 2005 expansion pack to Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Rhylis was featured in a quest titled \"Arena Challenge: Face Wirartu,\" in which players were tasked with defeating Wirartu in combat. Upon doing so, players had to speak with Rhylis in order to exit the arena. In the game's directory tree files and source data, Rhylis' name is listed as Bocashunk . However, this alternative name was not used in the game, and is therefore considered non-canon in Star Wars Legends.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Kerritamba_Village",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Hwruarca",
  "/wiki/Kerritamba_Village_Arena",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Canon",
  "/wiki/Wirartu",
  "/wiki/Bandolier/Legends",
  "/wiki/Belt/Legends",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/The_New_Essential_Chronology"
 ]
}