{
 "name": "Rhys_Dallows",
 "display_name": "Rhys Dallows",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "54 BBY",
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Naboo Security ForcesNaboo Royal Space Fighter CorpsBravo Squadron",
      "Naboo Royal Space Fighter CorpsBravo Squadron",
      "Bravo Squadron",
      "Lok Revenants"
     ]
    }
   ]
  }
 ],
 "content": "Rhys Dallows was a young Human male pilot from Naboo. He trained under Essara Till and passed his final test easily. When Rhys began to develop feelings for Essara, she was killed - in only their first mission together. Rhys swore revenge, and eventually tracked down Essara's killer. Rhys joined up with Bravo Squadron as Bravo 10 and went on a mission to destroy the receiver stations on a Trade Federation space station - the mission turned into a disastrous ambush when the mercenary ship that had killed Essara appeared. Rhys eventually managed to destroy him and flew out just in time-because then the whole space station exploded from the inside.\nAs a young man, Rhys joined the Royal Naboo Security Forces and was assigned to Bravo Squadron. He was placed under the tutelage of Essara Till, daughter of a prominent Naboo government official. He proved a quick learner even though he probably didn't read the Combat Manual cover-to-cover. After passing Essara's tests in her favorite training canyon, he was picked by her to be her wingman during an upcoming Royal Escort mission. Bravo Flight was to protect the Royal Starship while Queen Amidala negotiated with the Trade Federation about the blockade. It was supposed to be an easy run, but an attack by several mercenaries flying Dagger, MorningStar, and Dianoga-class starfighters forced the rookie space jockey to fight for his life. In the end the Queen escaped, but Rhys' N-1 starfighter was badly damaged and Essara was killed by a late mercenary arrival.\nFortunately, Rhys was saved by a Toydarian salvager named Reti, who took him to the base of mercenary Vana Sage for a serious overhaul of his fighter. After rescuing Vana from her own prison cell Rhys learned that the Trade Federation was definitely behind the attempt on the Queen's life, and that it was building a Droid Army from a massive factory on Eos. With the aid Vana, Reti, and Nym, a Feeorin pirate captain with an experimental bomber and a major grudge against the Federation, he set out to destroy the Eos factory. When they reached Eos the team split into two groups: Vana and Nym headed down to hit the foundries while Rhys and Reti lured away the planet's defense squadrons of Scarabs and Droid Starfighters with attacks on orbital satellites and Federation freighters. The attack was a success, but Rhys soon learned that the Trade Federation had launched its attack on Naboo.\nBy the time they had arrived, Naboo had fallen, but a Resistance movement had already begun and Rhys was quick to join-up. His first mission was to escort Reti and his load of munitions to a Resistance base, but a Trade Federation army ruined the party and Rhys had to use his N-1 as a ground attack craft inside the tight confines of the canyons—not something the N-1 was built to do—to save the base. After this he was assigned to lead a flight of N-1s providing air cover for a group of rescue boats attempting to break-out Naboo citizens from Trade Federation concentration camps. Between the gunboats, turrets, droid starfighters, bombers, and a dropship full of Armored Assault Tanks, it wasn't easy, but Rhys nevertheless prevailed.\nAfter a quick appearance over the main Resistance base to give Nym the breathing room he needed to demolish the huge Federation army attacking the place, Rhys joined-up with the remainder of Bravo Flight for a last-ditch assault on the droid control ship. It was a desperate battle, a few inexperienced Naboo pilots in ships designed for dogfighting against waves upon waves of computerized starfighters and the deadly array of weaponry aboard the enemy command ship. By concentrating on destroying the receiver dish stations needed to launch fighters, Bravo Flight had managed to gain a little room to maneuver when the same mercenary that had killed Essara Till appeared on the scene. After a brief battle, the mercenary ducked inside the enemy hangar when the shields were lowered to launch a lander. Bravo Flight followed, but only Rhys was able to get inside before the shields were raised again. Alone, in a tight space, and with all the fighters and tanks yet to embark training their guns on him along with a mercenary planning to finish him off, Rhys' chances were looking pretty slim. Amazingly, he not only survived, but managed to demolish a huge amount of war materiel, kill the mercenary to avenge Essara, and escape the exploding warship courtesy of a few well-placed shots to the vessel's portside power grid.\nAlthough Vana had agreed to stay on Naboo after the battle, Nym soon left to deliver a shipment of supplies to his men. However, the Feeorin did stay long enough to tell Rhys that if he ever got tired of working in paradise, he knew who to call. Besides his friendship with Vana, Reti, and Nym, Rhys was close to his astromech, an R2 unit named Wrench.\nDallows was voiced by Darren Scott.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/54_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Naboo_Royal_Space_Fighter_Corps/Legends",
  "/wiki/Bravo_Flight/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Essara_Till/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mission",
  "/wiki/J-type_327_Nubian_royal_starship",
  "/wiki/Queen/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Dagger-class_starfighter",
  "/wiki/MorningStar",
  "/wiki/Dianoga-class_assault_starfighter",
  "/wiki/N-1_starfighter/Legends",
  "/wiki/Toydarian/Legends",
  "/wiki/Reti",
  "/wiki/Vana_Sage",
  "/wiki/Trade_Federation_Droid_Army/Legends",
  "/wiki/Eos",
  "/wiki/Nym/Legends",
  "/wiki/Feeorin/Legends",
  "/wiki/Dropship/Legends",
  "/wiki/Armored_Assault_Tank",
  "/wiki/Wrench_(R2_unit)",
  "/wiki/Darren_Scott",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Starfighter_Trap",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Retcon",
  "/wiki/Star_Wars:_Starfighter",
  "/wiki/Starfighter:_Crossbones_1",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_50",
  "/wiki/Wizards.com",
  "/wiki/Star_Wars_Starfighter:_Starfighter_Aces",
  "/wiki/Star_Wars_Gamer_2",
  "/wiki/Starfighter:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Gamescape",
  "/wiki/Star_Wars_Insider_53",
  "/wiki/Sony",
  "/wiki/CorSec_Database_H-Z",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/Databank_(original)"
 ]
}