{
 "name": "Rianna_Saren",
 "display_name": "Rianna Saren",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic lekku"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zarien Kheev",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Rianna Saren was a female Twi'lek slave escapee who became a criminal and, afterward, a Rebel Alliance heroine. Early in her life, Saren was sold into Imperial slavery to the Zabrak Zarien Kheev, only to escape on the planet Coruscant to follow a criminal path. In 0 BBY, she was contacted by the mercenary Kyle Katarn, who introduced her to the Rebellion. Saren undertook several missions for the Rebellion that included the theft of an Imperial shipment from a Black Sun warehouse on Coruscant, the destruction of an agricultural research vessel captured by Black Sun in order to test new kinds of drugs, and the destruction of the Imperial Mirkanite Mining Facility on the planet Mustafar. During these missions, Saren met an Arakyd Industries security droid named Zeeo, who became her only companion. She had also discovered the whereabouts of her former slave master, Kheev, and decided to exact her revenge, but he soon captured her.\nSaren was sent to the prison world of Despayre, the construction site of the first Death Star, an Imperial superweapon capable of destroying entire planets. She managed to escape from Despayre just before the Empire destroyed the planet in a test of the Death Star's capabilities, before infiltrating the battlestation itself. Saren was present at a conversation between Kheev and Darth Vader, who was overseeing the Death Star project, during which she learned about the Death Star plans on the planet Danuta and realized that the Empire was her true enemy. Her report on Despayre's destruction provided valuable information about the battlestation's firepower to the Rebellion. Saren later escaped the Death Star and arrived on Danuta, where she killed Kheev and secured updated plans to the Death Star. Thanks to her actions, the Rebellion received the complete schematics of the Death Star and eventually destroyed the Imperial superweapon.\nRianna Saren was a female Twi'lek born around 22 BBY. Early in her life, she was sold into slavery to Zarien Kheev, a ruthless Zabrak slave master, who was working for the Galactic Empire and kept Saren as a personal servant. As a teenager, Saren attempted to escape, but Kheev caught her and—displaying his legendary ruthlessness—cut off her right head-tail, which she eventually replaced with a prosthetic. However, Saren escaped on her second attempt on the galactic capital of Coruscant, where she started working as a criminal and mercenary, hoping to exact her revenge on Kheev and the Empire that had once enslaved her.\nIn 0 BBY, Saren was contacted by the recently defected stormtrooper Kyle Katarn, who offered her a job. Her mission was to infiltrate a Black Sun warehouse on Coruscant and steal a shipment marked for Imperial delivery. After successfully breaching the warehouse, Saren continued with her assignment until she was captured by a Black Sun smuggler and imprisoned. However, a shot from her blaster accidentally powered up an Arakyd Industries security droid, Z-58-0, who rescued her and expressed his desire to join her. Saren was at first reluctant to let Z-58-0 accompany her, but, seeing the droid's determination to help and his ability to single-handedly dispatch a guard, she allowed him to tag along, nicknaming him \"Zeeo\" and removing his restraining bolt. Working together, they stole the shipment and tried to escape from the warehouse.\nThey had nearly done so when they were cornered at the exit by a group of smugglers. Zeeo, however, was outfitted with a repulsorlift that allowed him to constantly hover in mid-air and even fly. Saren clung to the droid, and they escaped from their pursuers, flying through the heavy Coruscant traffic to a rendezvous point with Katarn. The latter introduced them to Princess Leia Organa, an influential figure of the Rebel Alliance. Though she had heard about the Rebellion before, Saren was not sure whether it truly existed, and during the meeting with Organa she finally discovered that it did. Organa offered the Twi'lek a chance to double her reward, and after Saren realized that staying on Coruscant after her infiltration of the warehouse was too dangerous, she accepted the offer.\nSaren's next mission was to investigate strange activity on the planet Alderaan, where a Black Sun Vigo had hijacked an agricultural research vessel. With Zeeo's help, Saren infiltrated the vessel. Inside it, in addition to various Black Sun thugs, she encountered IG-series assassin droids several times but managed to survive each hostile engagement. The two eventually reached the vessel's main computer. After slicing it, Saren and Zeeo discovered that the vessel was being used to test a new kind of organic drug on scientists. Saren then planted explosive charges in the vessel's laboratory and warehouse before she saw Slak Sagar, the Vigo who had hijacked the ship, contacting Saren's former master, Zarien Kheev. Saren listened as Kheev ordered Sagar to shut down the operation because of her intrusion and deliver the last shipment to the planet Mustafar. Saren planted her last charge on that final shipment and killed Sagar. She also contacted Organa, who informed her about the purpose of the drug, which was used on Mustafar to increase the slave production of mirkanite, a material used in construction of heavy turbolasers. Organa wanted to dispatch Katarn to Mustafar to destroy the Mirkanite Mining Facility there, but Saren convinced the princess to send her instead of Katarn, although her real intent was to find Kheev and finally get her revenge.\nOnce on Mustafar, Saren infiltrated the facility by flying there on Zeeo above the planet's rivers of lava. Inside, she found a group of Wookiee slaves, who gave her the access codes to the facility's main drilling shaft. After telling the Wookiees to get all of the facility's other slaves to safety, she reached the main shaft. Saren's hopes of finding Kheev on Mustafar were lost, however, when she saw his hologram talking to the bounty hunter Boba Fett and witnessed Kheev himself departing Mustafar, heading for the planet Tatooine. Nevertheless, she continued her mission, vowing to pursue Kheev afterward. Using the codes, Zeeo set the drilling shaft on overdrive, and the facility exploded soon after Saren and Zeeo escaped from it on Saren's ship. However, when they reached space above Mustafar, they were attacked by swarms of Imperial TIE Fighters; in addition, an Imperial-class Star Destroyer was blocking the way off-planet. Manning her ship's laser cannon, Saren managed to fend off the TIE Fighter attack and successfully made her escape. Her mission completed, Saren decided that her time with the Rebellion was over, and she followed Kheev to Tatooine.\nAfter reaching Tatooine, Saren was attacked by Boba Fett in his ship, Slave I. Fett shot down Saren's own ship, causing it to crash-land in Tatooine's Dune Sea. However, Saren and Zeeo managed to evacuate the ship before it exploded. After reaching the Mos Eisley spaceport, one of Tatooine's settlements, Saren spotted Fett talking to Sedriss, an assistant of Kheev's. Realizing that Sedriss would likely know Kheev's location, Saren ignored Zeeo's warnings to pursue him. She confronted him and learned the location of Kheev's slave camp in Mos Eisley but angrily killed him after Sedriss derided her as the \"broken one.\" Once reaching the slave camp, Saren spotted Kheev under a stormtrooper escort. She and Zeeo deactivated the camp's detection and alarm systems and infiltrated the underground levels of the compound.\nThere, Saren met a group of Wookiee slaves who were being held in cells and promised to liberate them if they told her how to get to Kheev. One of the Wookiees advised her to deactivate the main security generator, which would allow Saren to reach the tower where Kheev resided. Saren liberated the prisoners, deactivated the generator, and made her way to a large cavernous arena where she met Kheev for the first time since her escape from him. The slave master, however, was ready for her arrival. He released a rancor and remained to watch from a safe spot at a balcony above the arena as Saren fought the beast. After Saren defeated the creature, Kheev retreated further into the compound, and Saren continued after him. When Saren caught up with him again in another part of the facility, Kheev was backed by several stormtroopers. She was captured by the stormtroopers and taken to the Imperial prison planet Despayre on Kheev's orders.\nAfter Saren arrived at Despayre and was convoyed to the planet's slave quarters, she killed her guards with her secret weapon, a spring-knife called the Thorn of Ryloth, and discovered Zeeo, who had also been transported to the planet. Saren soon found another Twi'lek slave, who informed her about an air duct leading outside. Knowing that it was her only way to escape the slave quarters, Saren proceeded to it, but not before destroying a probe droid along the way. Using the duct, she reached the surface of Despayre, where she saw the Empire's new superweapon, the Death Star battlestation, orbiting the planet—Despayre served as the Death Star's construction site, and the Empire used many of the planet's slaves as the battlestation's labor force. After stealing a speeder bike, Saren noticed a landing pad, but when she reached it, she once again found Kheev, who shot Zeeo and departed the planet on a shuttle. However, Saren and Zeeo managed to hide in a shipping crate that was picked up by another shuttle and brought to the Death Star. Once aboard the battlestation, Saren continued the search for her former master and eventually found Kheev talking to the Dark Lord of the Sith Darth Vader, just as the Death Star fired its massive superlaser to destroy Despayre as a test of its functionality.\nHiding in the shadows, Saren overheard Kheev's conversation with Vader concerning architects on the planet Danuta who had requested updated schematics to the Death Star. After witnessing the battlestation's destructive capabilities, Saren realized that the Empire was her true enemy and decided to warn the Rebellion about the new weapon. After reaching the Death Star's communication center, she contacted Organa and informed her of Despayre's fate and of the plans on Danuta. Saren also asked Organa to send her to Danuta in addition to Katarn and his team, who were already being dispatched there to secure the Death Star plans. Saren later downloaded a set of flight codes, deactivated the battlestation's tractor beam, stole a VT-49 Decimator Imperial transport, and escaped the Death Star. She was followed by TIE Fighters and TIE interceptors, but after a skirmish in the midst of Despayre's debris, she was able to escape to Danuta.\nBy the time of Saren's arrival on Danuta, Katarn had already stolen one set of plans being held there. Nevertheless, Saren infiltrated the Danuta research facility and soon found another set of plans protected by a barrier of force fields, which were powered by three memory matrices in different parts of the facility. She deactivated the matrices and went back to retrieve the plans, only to witness Kheev taking them and retreating further into the facility. Saren followed him and confronted Kheev at a landing pad. Kheev was in his personal battle armor and was very surprised that Saren had come for the plans and not for him. He attacked her, but, with the help of her droid companion, Saren defeated him. Before dying, Kheev took a final shot at Saren, but Zeeo blocked the blast. After taking the plans from Kheev and contacting Organa via the damaged but still operational Zeeo, Saren departed Danuta. The plans that she obtained were later combined with other sets stolen through the efforts of Rebel agents Kyle Katarn, Bria Tharen, Havet Storm, and others to reconstruct the complete outline of the Death Star, allowing the aspiring Jedi Luke Skywalker to destroy the station shortly thereafter during the Battle of Yavin.\nRianna Saren was arrogant and self-reliant, preferring to operate alone. She found it difficult to trust others—traits she had acquired in response to the emotional scars left over from the painful past she endured at Zarien Kheev's hands. However, her attitude changed when she met the droid Zeeo. Though she was reluctant to let him join her at first, their relationship soon evolved into a deep friendship, even leading Zeeo to save Saren's life by taking a blaster bolt intended for her. They worked well together as a formidable team, and Zeeo's experiences with the Empire's slave ring proved valuable to Saren, since the droid possessed a large database of information on the Imperial network systems. Throughout her life as a criminal, Saren was obsessed with killing Kheev, mostly to avenge the fact that she was shunned by her own people because of her prosthetic lekku, but when she witnessed the destruction of Despayre, she let go of her anger toward him and decided to fight against the Empire instead.\nDuring her mercenary career in the service of the Rebel Alliance, Saren gained some level of notoriety within the Empire as a Rebel spy. Physically, Saren was highly athletic and agile, able to pull off acrobatic maneuvers with considerable grace. During her missions, she mastered several martial art moves. She could perform the Hammer of Ryloth—a move that involved gripping an enemy by the throat with her foot and slamming him to the ground by making an overhead somersault while Zeeo pushed the foe from behind—and the Winds of Mustafar, in which she jumped on Zeeo and, while standing on her hands, spun, hitting all nearby enemies with her feet. Still, Saren frequently used her spring-knife as a lethal weapon. She was capable of understanding the Binary and Shyriiwook languages and could speak both Huttese and Basic. Saren had orange skin and green eyes.\nSaren wielded a small arsenal of weapons on missions. Her spring-knife, called the Thorn of Ryloth, which she wore on the upper side of her left wrist, complemented her martial arts well in hand-to-hand combat. She also wielded several blasters, including her own modified DL-44 heavy blaster pistol, capable of firing thermal detonators; a heavy blaster pistol she took from the dead body of Slak Sagar, which could fire three shots at a time when fully charged; a modified E-11 blaster rifle she obtained after killing Sedriss on Tatooine; a sniper rifle provided by the Rebel Alliance; and a powerful weapon called the Dual Cannon, installed in Zeeo. Zeeo could also project an energy shield, and Saren took advantage of this ability, protecting herself from blaster bolts and even deflecting them back at her opponents. Utilizing the droid's flying abilities, Saren could cling to him and fly to the point of her destination. Zeeo could also use his holoprojecting abilities to disguise Saren, making her appear as a stormtrooper or even as a protocol droid; Zeeo himself could pose as an IT-0 interrogation droid. By jumping on Zeeo and slamming him to the ground, Saren could create localized earthquakes that knocked nearby enemies off their feet.\nRianna Saren was the feature character in the 2006 video game Star Wars: Lethal Alliance, in which she was voiced by Julianne Buescher, the same voice actress who provided the voice of Aeron Azzameen in the 1999 PC game Star Wars: X-Wing Alliance. The Saren character was first mentioned in an advertisement article for Lethal Alliance published in Star Wars Insider 90. She was again mentioned in the online game Death Star Designer, a precursor supplement to Lethal Alliance, and in 2008, she received an entry in The Complete Star Wars Encyclopedia, compiled by Stephen J. Sansweet and Pablo Hidalgo. In 2009, a card depicting Saren was included in the Agents of Deception expansion set of Star Wars Galaxies Trading Card Game.\nIn Death Star Designer, Saren was briefly mentioned in an introductory message from Grand Moff Wilhuff Tarkin, which explains that the Empire has increased security at the Maw Installation due to Saren's presence in the system. This implies that Saren had infiltrated the Kessel system, where the Maw was located. In Lethal Alliance, however, Saren infiltrates the Death Star while the battlestation is orbiting Despayre, in the Horuz system.\nThe PlayStation Portable and the Nintendo DS versions of Lethal Alliance differ in a number of ways. This article tries to incorporate information from both versions, noting elements exclusive to one edition or the other. However, there are several plot points that are contradictory in their two depictions.\nIn the Nintendo DS version of the game, it is an accidental shot from Saren's blaster that powers up Zeeo. In the PlayStation Portable edition, however, the droid is activated after Saren destroys an energy generator while trying to open a door. There are also minor differences in the depiction of Saren's meeting with Kheev on Tatooine. In the Nintendo DS order of events, she meets Kheev, who releases a rancor, and after the beast has been killed, he retreats further into the slave compound. Saren pursues him and gets captured. In the PSP version, Saren defeats the rancor but does not find Kheev at first. She is determined to head back to help the slaves, but Kheev suddenly appears behind Saren, backed by stormtroopers, calling her by name. Despite Zeeo's warnings that this is a trap, Saren turns back and confronts him. A blast door separates her from her droid companion, and stormtroopers seize her.\nAdditionally, in the DS edition, Saren acquires the heavy blaster pistol after killing Slak Sagar, while on the PSP, the blaster is provided by the Rebel Alliance prior to her mission to Alderaan. Also, in the DS version, Saren contacts Organa on Alderaan after she has killed Sagar, while in the PSP edition the order of events is reversed. Saren actually sees a hologram of Kheev talking to Boba Fett and leaving Mustafar in the DS version, but in the other edition of the game, she is only informed of his departure by Zeeo.\nSaren's escape from Despayre in the PlayStation Portable version is completely different from the Nintendo DS version's that is presented in the article. In the PSP version, Saren does not use her knife to kill her guards and is thrown into a cell. The cell's force field soon shuts down, deactivated by Zeeo. After Saren has met her droid, they escape from the prison facility and make their way through Despayre's dense forest to the Death Star's construction site and later to a hangar, defeating a force of AT-RT and AT-ST walkers along the way. In this version, she does not encounter Kheev on the surface of the planet. In the DS version, it is implied that the architects on Danuta have requested the updated Death Star plans and that Kheev is delivering them there. However, in the PSP version, the architects have updated the plans by themselves, and Kheev's reason to go to Danuta is unspecified. Also in this version, during the final confrontation with Kheev, Saren uses Zeeo's shield ability to deflect Kheev's laser beam from his suit back at him. Kheev's suit explodes, and Zeeo is engulfed in the blast that damages him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Saren",
  "/wiki/22_BBY/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Lekku/Legends",
  "/wiki/Zarien_Kheev",
  "/wiki/Slavery/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Mission_to_Coruscant_(Rianna_Saren)",
  "/wiki/Black_Sun_warehouse",
  "/wiki/Mission_to_Alderaan_(Rianna_Saren)",
  "/wiki/Agricultural_research_vessel",
  "/wiki/Black_Sun/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Mission_to_Mustafar_(Rianna_Saren)",
  "/wiki/Mirkanite_Mining_Facility/Legends",
  "/wiki/Mustafar/Legends",
  "/wiki/Arakyd_Industries/Legends",
  "/wiki/Security_droid/Legends",
  "/wiki/Z-58-0",
  "/wiki/Mission_to_Tatooine_(Rianna_Saren)",
  "/wiki/Prison/Legends",
  "/wiki/Despayre",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Destruction_of_Despayre",
  "/wiki/Death_Star/Legends",
  "/wiki/Battlestation",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/Danuta",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Restraining_bolt/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alderaan/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Starship/Legends",
  "/wiki/IG-series/Legends",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Laboratory/Legends",
  "/wiki/Slak_Sagar",
  "/wiki/Mirkanite/Legends",
  "/wiki/Turbolaser/Legends",
  "/wiki/Magma/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Rianna_Saren%27s_starship",
  "/wiki/Realspace/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Laser_cannon/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Firespray-31-class_patrol_and_attack_craft/Legends",
  "/wiki/Slave_I/Legends",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Sedriss",
  "/wiki/Unidentified_Wookiee_slave_(Tatooine)",
  "/wiki/Prisoner/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Thorn_of_Ryloth",
  "/wiki/Unidentified_Twi%27lek_slave_(Despayre)",
  "/wiki/Probe_droid/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Superlaser/Legends",
  "/wiki/Architect/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Communication_center",
  "/wiki/Operation_Skyhook",
  "/wiki/Tractor_beam/Legends",
  "/wiki/VT-49_Decimator/Legends",
  "/wiki/Transport/Legends",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Mission_to_Danuta",
  "/wiki/Danuta_research_facility",
  "/wiki/Force_field/Legends",
  "/wiki/Battle_armor",
  "/wiki/Bria_Tharen",
  "/wiki/Havet_Storm",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Hammer_of_Ryloth",
  "/wiki/Throat",
  "/wiki/Limb/Legends",
  "/wiki/Winds_of_Mustafar",
  "/wiki/Binary/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/DL-44_heavy_blaster_pistol/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Sniper_rifle/Legends",
  "/wiki/Dual_Cannon",
  "/wiki/Ray_shield/Legends",
  "/wiki/Holoprojector/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/IT-O_Interrogator",
  "/wiki/Groundquake/Legends",
  "/wiki/2006",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Lethal_Alliance",
  "/wiki/Julianne_Buescher",
  "/wiki/Aeron_Azzameen",
  "/wiki/1999",
  "/wiki/Personal_computer",
  "/wiki/Star_Wars:_X-Wing_Alliance",
  "/wiki/Star_Wars_Insider_90",
  "/wiki/Death_Star_Designer",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Stephen_J._Sansweet",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2009",
  "/wiki/Agents_of_Deception",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Maw_Installation",
  "/wiki/Star_system/Legends",
  "/wiki/Kessel_system/Legends",
  "/wiki/The_Maw/Legends",
  "/wiki/Horuz_system",
  "/wiki/PlayStation_Portable",
  "/wiki/Nintendo_DS",
  "/wiki/Power_generator/Legends",
  "/wiki/All_Terrain_Recon_Transport/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Category:Images_of_Rianna_Saren",
  "/wiki/Star_Wars_Insider",
  "/wiki/December_5",
  "/wiki/StarWars.com",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_102",
  "/wiki/Star_Wars_Insider_108",
  "/wiki/Template:SWGTCG",
  "/wiki/Standard_year/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/Rebel_Dawn",
  "/wiki/Jedi_Dawn",
  "/wiki/May_30",
  "/wiki/March_11",
  "/wiki/2005",
  "/wiki/I,_Jedi",
  "/wiki/Death_Star_(novel)"
 ]
}