{
 "name": "Ribert",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Ribert was a human male smuggler from the planet Coruscant. While with his shipmate on Rajtiri sometime after the end of the Clone Wars, he and his shipmate were present at the Wanton Wellspring cantina in the city of Jibuto. Ribert was a part of Has Obitt's crew, and assisted his smuggling mission.\nRibert was a human male smuggler from the planet Coruscant. While with his shipmate on Rajtiri sometime after the end of the Clone Wars, he was present at the Wanton Wellspring cantina in the city of Jibuto. The two sat at a table with the Nautolan Ranos Yalli and the Dressellian Has Obitt. Ribert stated that the Clone Wars had started to feel like a golden age for business, because there was always work, even if it involved a lot of travel. Yalli remarked in reply that it was one mess to another, and Ribert added that no one seems to care about bargains. His shipmate disagreed, saying that the work was still there, but more competitive to get.\nYalli suggested that they divert supplies of meiloorun fruit, and reap from the profits when the growers pay them a tax to keep their shipments intact. Ribert scowled at the notion, noting that it sounds like a lot of effort. Obitt complained that he's sick of the song the cantina's Twi'lek band is playing. Yalli suggested he start a band, but the smuggler declined, because it wouldn't pay well in credits. Ribert countered, saying he obviously doesn't know bands. The group watched as a fight broke out in the cantina, with the participants dragged away by Imperial stormtroopers. Obitt questioned when fights became a reason to arrest people, and Ribert replied that the Emperor had given the clones new orders.\nObitt left the group to meet with Matese, a contact of his. Matese suggested that he start arms smuggling, as it's a lucrative business. Obitt was skeptical, but Matese looked over at Ribert and the others back at the table, reminding him that his friends could use the work.\nSome time later, Obitt agreed to smuggle proton torpedoes and munitions for Matese. Ribert was with Obitt' crew, and they stayed aboard their ship as Imperial stormtroopers boarded for an inspection. He and his shipmate helped disconnect the canister modules from the ship, and in return receive a large sum of credits.\nRibert had broad shoulders, a bald head, and a darker skin complexion than his shipmate.\nRibert first appeared in the 2016 canon novel Catalyst: A Rogue One Novel, which was written by James Luceno. The novel served as a prequel to the Star Wars Anthology film, Rogue One: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Black_market",
  "/wiki/Smuggler",
  "/wiki/Planet",
  "/wiki/Ribert%27s_shipmate",
  "/wiki/Rajtiri",
  "/wiki/Clone_Wars",
  "/wiki/Wanton_Wellspring",
  "/wiki/Cantina",
  "/wiki/Jibuto",
  "/wiki/Has_Obitt",
  "/wiki/Nautolan",
  "/wiki/Ranos_Yalli",
  "/wiki/Dressellian",
  "/wiki/Business",
  "/wiki/Meiloorun_fruit",
  "/wiki/Twi%27lek",
  "/wiki/Band",
  "/wiki/Credit",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper",
  "/wiki/Palpatine/Legends",
  "/wiki/Clone_trooper",
  "/wiki/Matese",
  "/wiki/Proton_torpedo",
  "/wiki/2016",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/James_Luceno",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)"
 ]
}