{
 "name": "Riboga",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Organization"
     ]
    }
   ]
  }
 ],
 "content": "Riboga the Hutt was a former crime lord of the Cularin system. Referred to as the \"Exalted Disgusting One\" at least twice , or simply the \"Exalted Riboga the Hutt,\" Riboga controlled crime in the Cularin system from 110 BBY to 53 BBY, and then since the Clone Wars onwards.\nRiboga came to Cularin as an exile, but he soon managed to pull the Smugglers' Confederation under his control in 110 BBY, and established a successful criminal Organization, focused mostly on smuggling, gambling, loansharking and, from 78 BBY to his retirement, slaving.\nRiboga loaned many of the smugglers money to upgrade their ships, particularly the more recalcitrant ones. As an alternative to paying back the exorbitant interest rates, the smugglers could enter periods of exclusive service to the Hutt, essentially becoming his indentured servants. In this way, Riboga further brought the smugglers under his control. Gungan ace starfighter pilot Piknab Carsels, while not exactly a smuggler, became one of Riboga's pilots in Varna Biqua this way.\nWhen Riboga decided to settle a part-time home in the city of Tolea Biqua in Genarius , he also decided to organize the local political power groups in a similar way: As Genariusan cities lacked any federal government, they could eventually challenge him. Appealing to the greed of the governors of the most powerful cities, but officially to facilitate control of Genarius, Riboga organized a Central Council to deal with planetary affairs, including new trading deals with extra-planetary interests and a protection tax  for the less important cities. The Council was composed of two representatives from each of Genarius's five largest cities, including Tolea Biqua. In its early years, Riboga sat as head of the Council himself to hold a tight control on it, but, once he was satisfied with the body, he started letting them choose their own leader.\nWhile Riboga could never annihilate the independent pirates in the asteroid belt, he learned a lot from them. 17 years after arriving, he ordered the building of a secret asteroid headquarters for use in criminal operations; the base took 2 years to build, and was practical and full of Hutt opulence. Then, he ordered the creation of a second asteroid base to meet with his smugglers, Trade Federation representatives and other associates. He also built a mansion in Mikish on Cularin, and an office in Tolea Biqua on Genarius. He did own a typically Hutt floating barge, where he sent the appointed waiter, Bez, to successfully and repeatedly duel against creatures from the galaxy. He was also once the owner of a number of L80-series protocol droids, such as L80-RC.\nOne of Riboga's business associates was zoo proprietor Hlisk Squin, based in the city of Bollin, in Cularin planet; Squin smuggled slaves for the Hutt using animal containers. Other partners included Bothan information broker Tchaw Fenn, who lived in Friz Harammel, Genarius. Twi'lek assassin and masseuse Lalo worked for one of Riboga's lieutenants but, when Riboga killed her boss, Lalo became a freelancer.\nBeing an important figure in Genarius, Riboga would have been the person to contact when Verga Mer Mining Company tried to expand their interest to Genarius. Unfortunately, Verga Mer ignored that and tried to deal with the less powerful cities themselves. Riboga did not felt personally insulted, but he later ignored all the five audience petitions from Verga Mer.\nRiboga fronted money and supplies  to independent droid QS-2D to begin its mining operations on Uffel around 90 BBY. QS-2D tried its best to convince Riboga that it was acting as a proxy for his Twi'lek masters, but the masters had died when reaching Uffel and QS-2D intended to became the master of a droid factory in non-breathable Uffel.\nIn 78 BBY, Riboga decided to expand his business and include slavery, which became his main and more profitable business. Due to the relative isolation of Cularin system, Riboga could use the system as a stop point to transport slaves from the Core Worlds to the Outer Rim - although he always replaced the transporting smuggler in Cularin. Riboga, in a lesser measure, also kidnapped some local Tarasins to use them as slaves.\nIn 72 BBY, Riboga began sponsoring starship races through the space worm-dug tunnels of Eskaron, a moon of Genarius. This practice would continue for at least forty years. Riboga backed Z-95 pilot Likk Nibk in the races, with threats on Nibk's life as a motivation.\nAt some point, Riboga placed a conditional bounty on the head of smuggler Nadin Paal: It was only to be active should Paal ever leave the Cularin system. The Bounty Hunters' Guild decided to keep an eye on Paal and wait for him to make a wrong move.\n\nEventually rising costs, principally arising from the struggles between his smugglers and the various independent pirate groups of Cularin, plus the high cost of space travel in that particular system, caused him to question the worthwhileness of continuing his operations. His major-domo, a strange being named Nirama, heard Riboga talking about this. In actuality, Nirama had been skimming money, diverting profits, and altering the books to make Riboga's business dealings seem less profitable due to \"additional expenses\" for the isolation of Cularin. Although Riboga questioned and even executed some of his minions, he could not track the problem to Nirama.\nIn 53 BBY, Nirama made a wager at their regular sabacc game of a quarter-million credits against Riboga's Cularin operations, and won. Riboga took the loss well, laughing and returning to Nal Hutta with only his money and some of his more loyal minions.\nWhen Riboga left the system, he sold many of his possessions there. Nirama got Riboga's mansion in Mikish, his office on Genarius and both of his asteroid bases. Riboga's interests in Uffel were bought out by QS-2D. The local black market suddenly had a great supply of thermal detonators and heavy blaster cannons. Riboga's servant droids, such as torture droid T-09, were also sold to new owners who were commonly unaware of any customization Riboga had ordered on the machines. He sold his barge to a pair of Hutt-hating Trandoshans that converted it into a casino creatively named Riboga's Barge, where they mocked on Hutt's customs and criticized Riboga's virility .\nRiboga's had a lasting affect on the Cularin system beyond organizing its crime. After Riboga's departure, the Central Council of Genarius started to become the legitimate governing body it had always appeared to be, though they remained focused on their own interests.\nAt some point, Riboga gave Velin Wir  a unique gift—a lightsaber which was proximity linked to a tiny thermal detonator implanted in Wir's chest. The exact nature of their business arrangement remained unknown. Around 32 BBY, Riboga gave a juvenile rancor named Bender to Nirama as a naming day gift, seeming to bear no malice for having lost their bet. Certain smugglers such as Vel Pastar, who had worked under Riboga since his takeover in 110 BBY, remained in Cularin and worked under Nirama, even if they disliked his different approach to business. Other employees, like the cook Karlo, learned to avoid political issues under Riboga's regime and chose not to defy authority, whatever form it took.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Organization",
  "/wiki/Crime_lord/Legends",
  "/wiki/Cularin_system",
  "/wiki/110_BBY",
  "/wiki/53_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Smugglers%27_Confederation",
  "/wiki/78_BBY",
  "/wiki/Gungan/Legends",
  "/wiki/Piknab_Carsels",
  "/wiki/Varna_Biqua",
  "/wiki/Tolea_Biqua",
  "/wiki/Genarius",
  "/wiki/Central_Council",
  "/wiki/Cularin_system_asteroid_belt",
  "/wiki/91_BBY",
  "/wiki/Nirama%27s_public_asteroid",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Mikish",
  "/wiki/Cularin/Legends",
  "/wiki/Bez",
  "/wiki/L80-series_protocol_droid",
  "/wiki/L80-RC",
  "/wiki/Hlisk_Squin",
  "/wiki/Bollin",
  "/wiki/Bothan/Legends",
  "/wiki/Tchaw_Fenn",
  "/wiki/Friz_Harammel",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Lalo",
  "/wiki/Verga_Mer_Mining_Company",
  "/wiki/4-KT",
  "/wiki/QS-2D",
  "/wiki/Uffel",
  "/wiki/90_BBY/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Tarasin",
  "/wiki/72_BBY/Legends",
  "/wiki/Space_worm/Legends",
  "/wiki/Eskaron",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Likk_Nibk",
  "/wiki/Nadin_Paal",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Nirama",
  "/wiki/Sabacc/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/IT-O9",
  "/wiki/Trandoshan/Legends",
  "/wiki/Riboga%27s_Barge",
  "/wiki/Velin_Wir",
  "/wiki/Metatheran_Cartel",
  "/wiki/31_BBY/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Bender_(rancor)",
  "/wiki/Naming_day",
  "/wiki/Vel_Pastar",
  "/wiki/Karlo",
  "/wiki/A_Revelation",
  "/wiki/The_Price_of_Business",
  "/wiki/TopWorld",
  "/wiki/MidWorld",
  "/wiki/UnderWorld",
  "/wiki/Oblivion%27s_Kiss",
  "/wiki/Peaces",
  "/wiki/Shadows_in_Green",
  "/wiki/Philology",
  "/wiki/Open_Aarms",
  "/wiki/Who_Goes_Thaere%3F",
  "/wiki/Incursion",
  "/wiki/Recursion",
  "/wiki/The_Way_of_the_Force",
  "/wiki/The_Dark_Side_Beckons",
  "/wiki/Portrait_of_the_Artist_as_a_Young_Rodian",
  "/wiki/Challenge",
  "/wiki/Revelations",
  "/wiki/Showdown_(Living_Force)",
  "/wiki/Preemptive_Strike",
  "/wiki/Counterstrike_(Living_Force)",
  "/wiki/Strike_III",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Wizards.com",
  "/wiki/Head_Trip",
  "/wiki/Over_Thaere",
  "/wiki/Dark_on_Dark",
  "/wiki/The_Cell_Revisited",
  "/wiki/That_Is_Nirama%27s_Word",
  "/wiki/Trammel%27s_Move",
  "/wiki/Riboga%27s_Legacy",
  "/wiki/Uffel_(article)",
  "/wiki/Eskaron_(article)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}