{
 "name": "Rieve",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hunters of the Outer Rim"
     ]
    }
   ]
  }
 ],
 "content": "Rieve was a Force-sensitive human female orphan from the Core Worlds planet Corellia. After the fall of the Galactic Empire, she fought in the Hunters of the Outer Rim tournament in the Arena on Vespaara, where she affected a Sith Lord persona during competition. Struggling to control her Force powers and adapt to her new position as a Hunter, Rieve began to fear her past had caught up with her when a mysterious stranger began appearing at the Arena.\nRieve was a Force-sensitive female human orphan from the Core Worlds planet Corellia. Having suffered a traumatic past, by sometime after the fall of the Galactic Empire, she came to join the Hunters of the Outer Rim tournament on the Outer Rim Territories planet Vespaara. There, she adopted a Sith Lord-inspired persona as a Hunter, wielding a red lightsaber and going up against opponents such as J-3DI, a droid programmed to believe he was a Jedi.\nWhile struggling to adapt as a Hunter in the tournament, events began to occur on Vespaara which left Rieve concerned that her past had caught up with her, involving a mysterious stranger who began stalking the arena grounds.\nRieve, growing up an orphan on Corellia, had experienced trauma as a result of her past which made her a difficult person to get to know. She disliked revealing her past or showing vulnerability, which was why joining Hunters of the Outer Rim appealed to her, and was driven by a strong self-preservation instinct. Rieve struggled with her lack of confidence, getting her career as a Hunter off to a rocky start. Rieve generally had no interest in others and was used to having to protect herself, with her refusal to trust others proving to be a serious flaw. She disappeared into the persona of a Sith Lord for arena combat.\nA human female, Rieve had white hair, blue eyes, and pale skin. She wore her hair half-shaven in a floppy mohawk. For her in-tournament persona, Rieve sported red Sith tattoos on her face and head.\nRieve had Force powers which she struggled to control, although the Arena served as a chaotic outlet for them. She knew some lightsaber combat which she utilized during her arena battles. She spoke Galactic Basic but could not understand Shyriiwook, which made it difficult for her to communicate with the Wookiee Grozz.\nRieve wore a red-and-black outfit with layered leggings and prominent shoulder pads, as well as black and red arm wrappings, as a Hunters of the Outer Rim combatant. She also wielded a red lightsaber.\nRieve was created for the mobile game Star Wars: Hunters, produced by Zynga and Lucasfilm Games, and was first revealed in a trailer released on September 14, 2021. She debuted in the game's soft launch on November 16, 2021, prior to its planned wide release. Rieve is also the protagonist of Hunters: Battle for the Arena, an upcoming tie-in novel written by Mark Oshiro. In an interview with StarWars.com, Oshiro described Rieve as an \"anti-hero\" type of character who could seem almost villainous from some perspectives, and said that they had looked to characters like Lando Calrissian, Jango Fett, and Asajj Ventress for inspiration when writing Rieve.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Hunters:_Battle_for_the_Arena",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hunters_of_the_Outer_Rim",
  "/wiki/Force-sensitive",
  "/wiki/Core_Worlds",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/The_Arena",
  "/wiki/Vespaara",
  "/wiki/Sith_Lord",
  "/wiki/Force_power",
  "/wiki/Outer_Rim_Territories",
  "/wiki/J-3DI",
  "/wiki/Droid",
  "/wiki/Jedi",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Lightsaber_combat",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Shyriiwook",
  "/wiki/Wookiee",
  "/wiki/Grozz",
  "/wiki/Limb",
  "/wiki/Lightsaber",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Hunters",
  "/wiki/Zynga",
  "/wiki/Lucasfilm_Games",
  "/wiki/September_14",
  "/wiki/2021",
  "/wiki/November_16",
  "/wiki/Mark_Oshiro",
  "/wiki/StarWars.com",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Jango_Fett",
  "/wiki/Asajj_Ventress",
  "/wiki/Star_Wars",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Rieve",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}