{
 "name": "Rig_Nema",
 "display_name": "Rig Nema",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Halais"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Halaisi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Rig Nema was a Halaisi female Consular Jedi doctor who served the Jedi Order during the Clone Wars, the full-scale conflict between the Galactic Republic and the Confederacy of Independent Systems.\nAt some time during the war, one of Doctor Nema's patients was none other than Grand Master Yoda, who had started to hear the disembodied voice of the late Master Qui-Gon Jinn, much to the Jedi Council's concern.\nA female Halaisi, native to Halais, Rig Nema was a Consular Jedi who served as a doctor at the Jedi Temple on Coruscant towards the end of the Galactic Republic. Her duties included diagnosing all matters of ailments: physical, mental, and spiritual. During the Clone Wars, Doctor Nema was in charge of an important patient: Yoda, the Grand Master of the Jedi Order.\nSome time earlier, the diminutive Master claimed to have spoken with Qui-Gon Jinn, who had been murdered by the Sith Lord Darth Maul during the Battle of Naboo. The rest of the Jedi Council was concerned about Yoda's health and sanity. Jinn was dead and, as far as they knew, it was impossible for anyone, even a Jedi, to retain their individuality after death. Master Ki-Adi-Mundi suspected that what was happening to the Grand Master was \"a deception by the Sith.\"\nIn the Jedi Temple medical ward, Doctor Nema examined Yoda several times, and found that the Grand Master was in good health. However, she detected that a part of his brain was more active than normal, but deduced that it was probably due to Yoda's advanced age. Far from being reassured, Master Mundi warned Mace Windu and Obi-Wan Kenobi that the powerful bond between Yoda and Count Dooku—who had been trained by the Grand Master—could have allowed the Sith Lord to get into Yoda's mind and manipulate him.\nNema subsequently suggested to perform a deprivation ritual, a risky and rarely-used medical procedure, so Yoda could find the answers he was looking for. It consisted of putting Yoda into a tank which progressively deprived him of oxygen, bringing him into a deep meditative state close to death. During the ritual, Yoda heard Jinn's voice once more; it told him to go to the planet of Dagobah in order to complete what Jinn could not. Jinn's voice also advised him to travel alone and to not tell anyone about his destination. When Yoda's vital signs became critical, Kenobi ordered Nema to interrupt the procedure, which she eventually did.\nNema, Kenobi, Mundi, and Jedi Knight Anakin Skywalker then contacted Master Windu via hologram, informing him that Yoda was convinced that he had talked to the dead, which led Windu to ask Nema her opinion. The Jedi doctor declared that Yoda was physically fine, but that she was not so sure about his spiritual state. Afterwards, Doctor Nema advised Yoda to rest, and then left the room when Skywalker arrived by Yoda's request. While she was away, Yoda fled the Jedi Temple with the Jedi Knight's help. Nema and Windu could do nothing but watch Yoda leave aboard his starfighter with Skywalker's astromech droid, R2-D2.\nDoctor Nema was a female Halaisi with golden eyes and yellow skin. She was meticulous and professional in her work. When Yoda was her patient, she examined him several times to confirm her diagnosis, constantly checked his vital signs, and regularly made her report to the Jedi Council about his health.\nShe did not hesitate to suggest dangerous procedures, like the deprivation ritual, in order to help her patient. As soon as the situation became too alarming for Yoda's life, Master Kenobi ordered Nema to immediately stop the ritual, which she was reluctant to do. She had warned about the risks the deprivation ritual could represent, and seemed to be surprised when she was told to interrupt it. Kenobi insisted, and she complied.\nNema was a Jedi, carrying a green-bladed lightsaber, as well as a doctor and physician, specializing in physical health, mental well-being, and spiritual balance. She had a vast knowledge of biology, medicine, Jedi healing lore, meditation, and the Force. Due to this, she was well-trusted by her fellow Jedi, a fact which led Yoda to consult her for her medical or psychic opinion after he heard the voice of Qui-Gon Jinn. Despite this, she admitted that she was not familiar with his species' biology.\nJedi Doctor Rig Nema's first and only appearance was in \"Voices,\" the eleventh episode of The Lost Missions, the sixth season of Star Wars: The Clone Wars. She was voiced by Catherine Taber, who also portrayed Senator Padmé Amidala in the series.\nHer first name is never mentioned in the episode, as she is only called \"Doctor Nema\" or simply \"Doctor.\" It is revealed in the end credits, the StarWars.com episode guide, and her Databank entry.\nThe character's physical appearance was actually based on an early concept design for Mace Windu. It was drawn by Iain McCaig during pre-production for Star Wars: Episode I The Phantom Menace, before Samuel L. Jackson was cast.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rig_Nema",
  "/wiki/Rig_Nema/Legends",
  "/wiki/Brotherhood",
  "/wiki/Halais",
  "/wiki/Halaisi",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Consular_Jedi",
  "/wiki/Doctor",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Death",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Jedi_High_Council",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Battle_of_Naboo",
  "/wiki/Jedi",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Sith",
  "/wiki/Brain",
  "/wiki/Mace_Windu",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Jedi_training",
  "/wiki/Deprivation_ritual",
  "/wiki/Oxygen",
  "/wiki/Meditation",
  "/wiki/Planet",
  "/wiki/Dagobah",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Hologram",
  "/wiki/Yoda%27s_fighter",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Eye",
  "/wiki/Lightsaber",
  "/wiki/Force_healing",
  "/wiki/The_Force",
  "/wiki/Yoda%27s_species",
  "/wiki/Voices",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Catherine_Taber",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Iain_McCaig",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Samuel_L._Jackson",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/The_Art_of_Star_Wars_Episode_I:_The_Phantom_Menace"
 ]
}