{
 "name": "Riggins_Delahrg",
 "display_name": "Riggins Delahrg",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Riggins Delahrg was the Imperial Governor of Tallaso who, following the Battle of Endor, traveled from Imperial world to Imperial world, securing or creating high-paying, low-effort employment on any planet with an Imperial bureaucracy.\nRiggins Delahrg was a male human who, prior to the Battle of Endor, served as the Imperial Governor of the planet Tallaso. He made a comfortable living on that world by extorting wealth from Tallaso's planetary government, accepting bribes to exploit the planet's resources from interstellar business interests and criminal organizations, and committing other unethical acts.\nAfter the Battle of Endor, the Empire's resources were needed elsewhere, leaving the population of Tellaso free to overthrow Delahrg. The erstwhile governor stole all that he could before fleeing to the planet Vandron, the nearest world with a functioning Imperial bureaucracy. Delahrg went to Vandron's Imperial Administration building and connived his way into cushy employment there.\nLess than six months after arriving, the Vandronian government collapsed and Delahrg was again jobless and itinerant. However, Delarhg did not panic; instead, he again found an area with a robust Imperial bureaucracy, where he used his verbal skills and bureaucratic knowledge to acquire another high-paying, low-effort job. The former governor repeated this pattern of flight, relocating to another Imperial bureaucratic center, and talking his way into a cushy position  numerous times.\nRiggins Delahrg was a short, heavyset man who possessed a white shock of hair atop his head. He was knowledgeable and a talented speaker, traits which allowed him to find his calling: worming his way into local Imperial bureaucracies and occupying or creating comfortable positions for himself there. He was also unethical, living up to the immoral stereotype of Imperial Governors held by many, engaging in extortion, taking bribes, and committing outright theft.\nDelahrg carried with him a datapad that stored a number of official-looking forms; several recording rods; a variety of rank insignia, code cylinders, decorations, and uniforms ; and 5,000.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Tallaso",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Vandron",
  "/wiki/Imperial_Administration_building",
  "/wiki/Standard_month/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Recording_rod",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Imperial_code_cylinder",
  "/wiki/Medal/Legends",
  "/wiki/Uniform",
  "/wiki/Forger_(profession)/Legends",
  "/wiki/Credit",
  "/wiki/Heroes_%26_Rogues"
 ]
}