{
 "name": "Rii%27ke_En",
 "display_name": "Rii'ke En",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Honoghr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Rii'ke En was a Human male Jedi Knight who served the Galactic Republic as a general during the Clone Wars. In 20 BBY, En and the cruiser under his command engaged the Separatist cruiser Gahenna over the planet Honoghr. The Gahenna was transporting a defoliant toxin, Trihexalophine1138, which the Separatists intended to use on the planet Naboo. When the Separatist ship crashed on Honoghr, En and a clone trooper under his command traveled to the surface to find the Scientific Instrument Package, which had data on the virus. En tracked the SIP to an ancient Rakatan temple, where the local Noghri had taken it. After infiltrating the temple, En sent a report to Jedi Knight Aayla Secura. However, he and the clone trooper accompanying him were attacked by the Noghri protecting the temple, resulting in both of their deaths.\nRii'ke En, a Human male, was born during the final decades of the Galactic Republic. He was trained in the ways of the Force by the Jedi Order and eventually attained the rank of Jedi Knight. When the Clone Wars began in 22 BBY, En served the Grand Army of the Republic as a Jedi General.\nIn 20 BBY, En and the cruiser that he commanded fought a Separatist core ship, the Gahenna, over the planet Honoghr. The Gahenna was transporting the defoliant toxin Trihexalophine1138 for the Separatists' use against the planet Naboo. When the battle-damaged Confederate ship crashed on the surface of Honoghr, En took one clone trooper with him to locate the Scientific Instrument Package, which contained both evidence pertaining to the virus and proof of the Separatists' intentions with it.\nAfter three days, En and the trooper reached the Gahenna's crash site and discovered that the native Noghri had taken the SIP when they salvaged the ship. En managed to track the SIP to an ancient Rakatan temple, where the Noghri had taken the package. The Jedi and the clone trooper infiltrated the temple, and En sent a report via comlink to Jedi General Aayla Secura informing her of the SIP's location. Secura ordered En to refrain from obtaining the device until a back-up squad reached their location. However, the Noghri guarding the temple were alerted to the presence of En and the clone. Letting Secura know he had been detected, En engaged the attacking Noghri, who had already killed the trooper. Shortly after, En was overwhelmed and killed by the Noghri. Secura managed to eventually complete En's mission by recovering the SIP for the Republic, although Honoghr's ecosystem was eventually devastated by the Trihexalophine1138 toxin.\nThe Human male Rii'ke En wore a set of brown Jedi robes and owned a lightsaber containing a green crystal. He was determined to find the SIP, which would prove the existence of the 1138 virus and the Separatists' intentions for it. Even after the clone trooper accompanying him was killed, En still fought the Noghri defending the temple until he himself was killed.\nEn was sensitive to the Force, and used a lightsaber during battle. However, his skills were not enough to prevent him from being overrun by the Noghri in Honoghr's Rakatan temple.\nRii'ke En was created by author John Ostrander and drawn by Jan Duursema for the standalone comic book Armor, the sixty-eighth issue of the Star Wars: Republic comic series, which details the origins of the environmental disaster that transforms Honoghr's ecosystem into a biological wasteland, as originally depicted in author Timothy Zahn's The Thrawn Trilogy, set in 9 ABY. En also received an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/20_BBY/Legends",
  "/wiki/Honoghr/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Rii%27ke_En%27s_cruiser",
  "/wiki/Battle_of_Honoghr/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Core_ship/Legends",
  "/wiki/Gahenna",
  "/wiki/Planet/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Trihexalophine1138",
  "/wiki/Naboo/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Unidentified_clone_trooper_(Honoghr)",
  "/wiki/Scientific_Instrument_Package",
  "/wiki/Rakata/Legends",
  "/wiki/Honoghr_Rakatan_temple",
  "/wiki/Noghri/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/General/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Force-sensitive/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Republic_68",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars:_The_Thrawn_Trilogy",
  "/wiki/9_ABY/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_37",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}