{
 "name": "Rik Duel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Independent smuggler",
      "Galactic Empire",
      "Alliance of Free Planets"
     ]
    }
   ]
  }
 ],
 "content": "Rik Duel was a brash, egotistical Corellian smuggler who lead Chihdo and Dani from one get-rich-quick scam to another, most often not according to plan.\nDuel was a thief and a double-crossing, swindling ladies' man who knew Han Solo in his youth, and later would cross paths with Solo, Luke Skywalker, and Princess Leia Organa on Stenos.\nAs a smuggler, Duel encountered Solo on Nar Shaddaa years before the Battle of Yavin. He fought in the Battle of Nar Shaddaa, joining with other denizens of the Smugglers' Moon as the Galactic Empire attempted to crack down on the criminal activity centered there. At some point, Duel became partners with the Rodian Chihdo and a Zeltron woman named Dani.\nA few years after the Battle of Nar Shaddaa, Duel made a deal with Quorl Matrin, Imperial Governor of the planet Stenos, to uncover the statue of the Stenax god Vol to expand the former senator's collection. The statue had been buried during an earthquake years earlier, causing the winged Stenaxes to stop flying in disgrace. Rik, Dani and Chihdo began digging for the statue in an old temple that had served as a Rebel Alliance base commanded by Colonel Pejanes Kindar. Their search was interrupted when Princess Leia arrived, along with Solo, Chewbacca, Skywalker and his droids. Always ready for a con, Duel claimed that he and his partners had actually joined the Rebellion and were left behind by Kindar to find the Vol statue. Solo was immediately suspicious of his old \"friend\", but agreed to help find the statue.\nOnce they uncovered Vol, Rik took the statue for himself and betrayed the Rebels to Matrin. As stormtroopers arrived to capture Solo and the others, Duel and his friends made their escape, hoping to keep the statue for themselves. The Rebels were saved by the timely arrival of the now-flying Stenaxes, who demanded Vol. Solo referred them to Duel. Duel and friends arrived at Rik's ship, the Moonshadow, only to find Matrin and a contingent of stormtroopers waiting to take the statue and kill them. Suddenly, the Stenaxes arrived, attacking the group. Rik cursed Solo as the attack began, but then the quick-thinking smuggler shouted that Matrin was dishonoring Vol. The governor and his troopers were torn to pieces by the Stenaxes. Rik, Dani and Chihdo escaped in the confusion.\nThree years later, Duel encountered Luke Skywalker on Stenos where recent Imperial crackdowns were making life harder for a simple criminal. Skywalker and Lando Calrissian were searching for bounty hunters Bossk and IG-88, hoping they could lead them to Han Solo, still frozen in carbonite. They ran into Duel and Dani, who were searching for Chihdo, who had recently gone missing. Duel asked for Skywalker's help, but the Rebel was called away by Calrissian reporting he had found Solo. He led Skywalker to a figure frozen in carbonite only to find that it was actually Chihdo.\nBossk, IG-88 and other bounty hunters had set up their own carbon-freezing chamber there. The hunters were closing in on the Rebels before Rik and Dani appeared for an almost-successful rescue. Rik and Skywalker escaped, but Dani and Calrissian were captured. Eventually, with the help of a number of Stenaxes recruited by Chewbacca, the bounty hunters were defeated. Rik remained on Stenos, eventually finding out how to free Chihdo from the carbonite after Skywalker and Calrissian moved on to their next stop, along with stowaway Dani.\nWithin weeks after the Battle of Endor, Rik, Chihdo and Dani began looting worlds left in ruins after the Empire's retreat in the chaos following Palpatine's death. One of their stops was water-world Iskalon's abandoned surface facility, Pavillion. The trio was soon interrupted by the arrival of Luke Skywalker, who had come to offer the Iskalonians a place in the newly forming government. Luke scolded them, but Rik explained that everyone in the galaxy does what they have to do to survive, and the weak were out of luck. Rik's speech was cut short by a hungry chiaki sea creature and a sudden attack by the Iskalonians. The natives no longer wanted anything to do with offworlders, and after a brief protest, Rik acceded to Skywalker's suggestion they all leave. Only an Iskalonian named Kiro—an old friend of Luke's—decided to go with them. Skywalker recruited Duel and his partners to give Kiro passage in the Moonshadow. This would also give Skywalker a chance to keep Rik and the others out of trouble.\nThe group continued on to Skywalker's next diplomatic mission on Shawken, where Rik, Chihdo and Dani explored the planet's ruins while Luke and Kiro met with local officials. While searching for priceless artifacts to steal, they accidentally trapped themselves in an underground chamber and triggered the countdown of an ancient weapon that could theoretically destroy the entire universe. Skywalker and Plif the hoojib eventually freed Duel and the others, while Kiro's near-fatal sacrifice destroyed the machine.\nThe Moonshadow then followed Skywalker back to the Alliance's temporary base on Endor. After an altercation with Rebel soldiers over a card game, Rik stayed on Endor a short time longer before realizing there was little profit to be gained there. He and Chihdo soon departed though Dani chose to stay with the Alliance in the wake of the supposed death of Kiro, whom she had fallen in love with.\nRik Duel was created by Mary Jo Duffy, Kerry Gammill and Tom Palmer. Gammill based Duel's appearance on the likeness of his friend, visual effects legend Rick Baker.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Corellian/Legends",
  "/wiki/Chihdo",
  "/wiki/Dani",
  "/wiki/Han_Solo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Stenos/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Battle_of_Nar_Shaddaa_(3_BBY)",
  "/wiki/Rodian/Legends",
  "/wiki/Zeltron/Legends",
  "/wiki/Quorl_Matrin",
  "/wiki/Governor/Legends",
  "/wiki/Stenax",
  "/wiki/Vol",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Pejanes_Kindar",
  "/wiki/Chewbacca/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Moonshadow_(Rik_Duel%27s)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bossk/Legends",
  "/wiki/IG-88B/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Carbon-freezing_chamber/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Iskalon/Legends",
  "/wiki/Pavillion",
  "/wiki/Iskalonian",
  "/wiki/Chiaki",
  "/wiki/Kiro",
  "/wiki/Shawken",
  "/wiki/Shawken_Device",
  "/wiki/Plif/Legends",
  "/wiki/Hoojib/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Mary_Jo_Duffy",
  "/wiki/Kerry_Gammill",
  "/wiki/Tom_Palmer",
  "/wiki/The_Hutt_Gambit",
  "/wiki/Star_Wars_(1977)_70",
  "/wiki/Star_Wars_(1977)_71",
  "/wiki/Star_Wars_(1977)_72",
  "/wiki/Star_Wars_(1977)_73",
  "/wiki/Star_Wars_(1977)_82",
  "/wiki/Star_Wars_(1977)_87",
  "/wiki/Star_Wars_(1977)_90",
  "/wiki/Star_Wars_(1977)_92",
  "/wiki/Star_Wars_(1977)_99",
  "/wiki/Dark_Empire_Sourcebook",
  "/wiki/Wizards.com",
  "/wiki/Zeltros:_Pleasure_Planet",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}