{
 "name": "Rik_Virgilio",
 "display_name": "Rik Virgilio",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Rik Virgilio was a male human who served as captain of the Gozanti-class cruiser Blood Crow before being replaced by Filia Rossi. After researching on why Virgilio had been replaced, Ensign Eli Vanto could not find anything except that Rossi was very well connected.\nDuring Virgilio's duration as captain of the Blood Crow, he was very well received by the crew, with Eli Vanto believing that Virgilio balanced orders and flexibility. In the eighteen months Vanto and Lieutenant Thrawn had served under him, Virgilio and the crew were credited for capturing smugglers, defusing political situations in planets in the Mid Rim and Outer Rim, as well as rendering aid to distressed vessels. Virgilio had earned the respect of his officers and crew, as well as satisfaction from governors and other politicians which he and the crew interacted. After Virgilio was replaced by Filia Rossi, Vanto speculated that perhaps Virgilio was promoted to a better position, however, Vanto was suspicious that the officers on the Blood Crow were not informed and the silence of Imperial High Command, and that in actuality, Virgilio may have retired or even quietly dismissed. After assuming command, Rossi began undertaking actions which Vanto assessed were made to remove all trace of Virgilio's tenure of command on the ship.\nVirgilio had taken stride in having Thrawn, an alien officer, on his ship despite a degree of tension during the first few weeks as Virgilio tested the limits of Thrawn's capabilities and intelligence, and once Virigilio understood Thrawn's parameters, Vanto could no longer detect any sort of tension or contrast in Virgilio's treatment or acceptance of Thrawn. In fact, once the position of First weapons officer was open, Virgilio did not contest Thrawn being promoted to that position. Gossip among the crew was that Virgilio had in fact recommended Thrawn for the position in the first place. Virgilio was well received by his crew and the people he interacted with, and understood how to balance orders and flexibility.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Captain",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Blood_Crow",
  "/wiki/Filia_Rossi",
  "/wiki/Ensign",
  "/wiki/Eli_N._Vanto",
  "/wiki/Standard_month",
  "/wiki/Lieutenant",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Smuggler",
  "/wiki/Politics",
  "/wiki/Planet",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Starship",
  "/wiki/Imperial_officer",
  "/wiki/Governor",
  "/wiki/Officer",
  "/wiki/Imperial_High_Command",
  "/wiki/Alien",
  "/wiki/Standard_week",
  "/wiki/First_weapons_officer",
  "/wiki/Thrawn_(novel)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn_2"
 ]
}