{
 "name": "Rikdine",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Military",
      "Republic Military"
     ]
    }
   ]
  }
 ],
 "content": "Rikdine was a Human male captain in the Republic Military who fought in the Battle of Corellia during the Galactic War with the Sith Empire. He served as a liaison between the Jedi Order and the Republic's forces on the planet, coordinating the arrival of Jedi reinforcements for the Jedi Knight known as the Hero of Tython—the new Supreme Commander of Jedi forces on Corellia.\nA Human male, Rikdine had achieved the rank of captain in the Republic Military by the year 3640 BBY. As the Galactic War erupted between the Galactic Republic and the Sith Empire, Rikdine was among those sent to the Imperial-occupied world of Corellia to drive the Empire off the prestigious Core World. Rikdine was deployed in the Blastfield Shipyards region on the edges of Corellia's capital, Coronet City, and during the battle he served as the personal military contact of Grand Master Satele Shan of the Jedi Order. Many Jedi fell in the early stages of the battle, but Rikdine ensured that the bodies of the fallen were returned to the Order's homeworld of Tython, where they could be buried. As the battle progressed, Shan contacted Rikdine and informed him of the impending arrival of the Jedi reinforcements that Shan had drawn from the Outer Rim Territories as well as several other worlds.\nFrom his post at the Socorro Freight building in the Blastfield Shipyards, which was being used as a makeshift Jedi command center, Rikdine organized and coordinated the arrival of the Jedi shuttles and ensured that they reached secure landing zones safely. When the Hero of Tython—a Jedi Knight who had been appointed the Jedi Supreme Commander by the Grand Master—arrived at the building, Rikdine was relieved to see that the Knight had made it safely and gave the Jedi all of the information he had on the few Jedi who were known to still be alive on Corellia. While the Hero sought out those Jedi and ordered them to meet up at the Socorro Freight building, Rikdine coordinated the last transports from the planets Orto, Rodia, Kinyen, and Duro, and when the Knight returned to Rikdine, the captain relayed General Var Suthra's request for a holocall and patched the Knight through to the general in the Labor Valley district. At Suthra's request, the Outer Rim Jedi relocated to the Labor Valley, and Rikdine oversaw their transfer to the area.\nA fair-skinned man, Rikdine had brown hair and green eyes, though he was largely bald by the time of the Battle of Corellia. He was a competent commander and coordinator, and he was saddened that many Jedi died in the battle on Corellia but tried his best to ensure that the bodies of the fallen were treated with dignity and returned home.\nRikdine wore a gray Republic Military uniform.\nRikdine first appeared in the Jedi Knight-class mission \"Jedi Commander\" in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011. Rikdine, like characters in the other three Republic-class storylines on Corellia, also tasks the player with speaking with Corporal Hartke, the starting character for the Republic world arc in the Blastfield Shipyards. Players must complete the world arc mission \"Blockade Runner\" before their own class storyline can proceed to the Labor Valley, and if the player has completed Hartke's mission beforehand, Rikdine will not mention the mission. As it is unknown who canonically completed \"Blockade Runner,\" this article refrains from including information on that mission.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Captain/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Supreme_Commander_(Jedi)",
  "/wiki/Corellia/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/3640_BBY",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Blastfield_Shipyards",
  "/wiki/Capital/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Death/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Socorro_Freight_building",
  "/wiki/Shipyard/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Orto/Legends",
  "/wiki/Rodia/Legends",
  "/wiki/Kinyen/Legends",
  "/wiki/Duro/Legends",
  "/wiki/General/Legends",
  "/wiki/Var_Suthra",
  "/wiki/Labor_Valley",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Time/Legends",
  "/wiki/Republic_officer%27s_uniform",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/2011",
  "/wiki/Corporal/Legends",
  "/wiki/Hartke",
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Battle_of_Ilum"
 ]
}