{
 "name": "Rinetta Gan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hynestia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Between 32–23 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hynestian royal family"
     ]
    }
   ]
  }
 ],
 "content": "Rinetta Gan was the human female Princess of the planet Hynestia and the daughter of Queen Forsythia Jin.\nBefore the Empire claimed Hynestia, Rinetta Gan and her mother would take trips out into Wild Space and visit places only known to the Hynestians. Gan would often fantasize about taking her grandmother's ship, Wandering Hope, and exploring the Unknown Regions.\nShe liked to explore the Hynestian royal palace, going to restricted areas like the royal treasury. There she discovered the Solstice Globe among the royal family's treasures. Her strategy instructor, the Lynna Zel Gris, found her and recognized the globe as a powerful artifact that had been stolen from Gris' homeworld of Livno III. After Gris told her of the globe's unique properties that provided heat and light to Livno III, Gan was convinced it had to be returned and formulated a plan to help Gris steal it.\nRinetta Gan planned on meeting her at the Frozen Kova cantina. She was unable to find her mag-boots because of her messy room. During her search, she was interrupted by her mother who informed her that Gris had been charged with treason for trying to steal the Solstice Globe. Gan pretended not to know about the globe, and asked if she could join her mother in searching for Gris. The princess hoped to sneak away and warn her friend. The Royal Guard entered the room and informed the royal family that Gris had been located and apprehended. Gan went with her mother to the cantina where Gris and Calrissian were being held. After the smuggler was sentenced to death for smuggling purple glandis flower juice onto Hynestia, Gan suggested that the queen have him deliver the Solstice Globe to the Empire as Hynestia's yearly tribute.\nGan accompanied the Royal Guard to the Hynestian royal dungeon. She dismissed the guards and asked Gris why she hadn't fled the planet. Gris explained that she was trying to earn credits to book a flight off-planet but lost in Sabacc to Calrissian. The princess talked to her mentor and tried to figure out a way to return the Globe to Livno III. She offered to release Gris, but the Lynna instead told her to think strategically about the problem. Gan realized that if the Globe was given to the Empire, there would be no way to return it to its proper owners. She came to the conclusion that since Calrissian had it on his starship the best course of action would be to get Calrissian to fly her to Livno III so she could return the Globe. Gris approved of the plan and told the princess that the necklace she had given her was ancient technology from her homeworld that would allow the girl to hide in plain sight.\nGan followed the Royal Guards to the spaceport and hid as they loaded the Solstice Globe onto the Millennium Falcon. Using her necklace, she snuck onboard and hid in the cargo bay. After the ship left Hynestia, she snuck up on Calrissian and stole his blaster from the holster on his hip without the smuggler realizing it. Some time later, she confronted Calrissian and L3-37 in the cockpit and demanded that the droid fly the ship to Livno III. The princess was perplexed when L3-37 refused. She continued to argue with Calrissian and L3-37 but was distracted when the Falcon came out of hyperspace near Neral's moon in the Corellian sector. Calrissian was able to disarm her. He questioned why she wanted to return the Globe but the princess refused to talk. The smuggler tied her to a couch in the lounge of the ship to make sure she wouldn't cause any more trouble.\nLeft alone, the princess was able to free herself by cutting the scarves with a plasma blade that she had hidden in her sleeve. She left the Falcon and went to find Calrissian. She found herself distracted by the sights and sounds of Neral's Moon. The young girl noticed the canals appeared to be glowing so she went to investigate. A food peddler explained that small aquatic animals called klinnets used colors to communicate and that's why the canals were luminescent. Gan thanked the lady and continued her search for Calrissian. The princess noticed a sign for Ne'eda's Tower and figured out that it was the likely destination for Calrissian. On her way, she was stopped by a man who recognized the gherlian fur tunic she was wearing. He haggled with her, eventually purchasing it for 2,000 credits and a small hold-out blaster.\nGan made her way to Ne'eda's Tower where she observed Calrissian being confronted by a bounty hunter while escorted by one of Ne'eda's henchmen. As the two argued, Gan pulled Calrissian into a nearby plant and hid them by using her necklace. After escaping, Gan insisted that the smuggler owed her and he should take her to Livno III, but he refused. The pair was attacked by the bounty hunter, and fled towards the docking bay. Calrissian asked if Gan's mag-boots were strong enough to attach to a passing air trolley, but she told him they weren't able to. Running out of options, Calrissian disabled the bounty hunter by using his hidden hold-out blaster. This prompted Gan to question him on why he hadn't done that in the beginning. He told her that shooting should be the last option.\nThe pair continued to the docking bay while the princess tried to convince Calrissian to fly her to Livno III. She drew her blaster and stuck it into Calrissian's back. Gan offered the smuggler 2,000 credits and her necklace if he would take her to her destination. He refused again, so she decided to appeal to his vanity. She told him the stories surrounding the Solstice Globe and explained that he would be a legend if he helped return the artifact to the Lynna. Before she could persuade the smuggler to take the mission, Gan's mother arrived to retrieve her daughter and learn why Calrissian hadn't delivered the Globe to the Empire.\nGan was forced to return to Hynestia along with the Falcon and its crew. Calrissian was arrested and L3-37 was fitted with a restraining bolt. The princess was confined to her quarters by the queen. The princess contemplated the situation and came up with a plan to earn her freedom by using her mother's adherence to Hynestia customs and law against her. The queen came to question her about her trip with Calrissian. Gan explained she was following the tradition of Gherjnuthal and had chosen Calrissian as he seemed a man of the Galaxy. Gan then asserted that the punishment of being confined to her room was unjust as she had simply made a mistake while following Hynestian customs. Her mother agreed, and released her from her punishment but ordered her to stay away from the dungeon and the docking bays. She also commanded Gan be accompanied by the guard Wyllys wherever she went.\nAfter her mother left, Gan ordered Wyllys to accompany her to the kitchens. She put a message in small metal capsules and hid them in bowls of soup destined for the dungeons. She also convinced Wyllys to eat some soup laced with josta flower extract which caused the guard to fall into a deep sleep once he returned to Princess Gan's quarters. Freed from supervision, she changed into practical clothes and took a lift to the surface of the planet. She grabbed a cart and wrapped herself in a grey gherlian fur cloak usually worn by refuge handlers as a disguise. Making her way to the docking bay where the Falcon was stored, Gan went onboard and located L3-37. She removed the restraining bolt that was subduing the droid and then informed her of the current situation. Gan asked the droid to assist her in freeing Calrissian and convincing him to return the Solstice Globe to Livno III. During their conversation, L3-37 mentioned having a sticky bolt on her hip joint and Gan suggested she salvage parts from a destroyed droid. L3-37 admonished the princess, stating it would be barbaric to dismantle another droid for parts. Gan got the droid to agree to help her free Gris and Calrissian from the dungeon.\nGan and L3-37 made their way to the dungeon, where the droid freed the prisoners using a tool given to her by the princess. She made Calrissian promise to take her to Livno III, knowing he would be obligated to fulfill his oath. They were discovered by a guard. To prevent the guard from raising an alarm, Gan quickly came up with a plan to pretend to be kidnapped by Calrissian. The guard rushed to her aid, only to be disabled by L3-37. The princess and the others climbed into a refuge cart and had L3-37 push them back to the hangar bay where the Falcon was stored.\nOn the way, Gan had to convince Gris not to shoot Calrissian as the Lynna was still holding a grudge against the smuggler. When the group arrived in the hangar, L3-37 informed them that a group of guards were blocking access to their ship. Gan jumped out of the cart and ran up to Twyla who was standing next to the boarding ramp of the Falcon. The princess told Twyla that Wyllys had been eaten by the Gran Kovali and she needed the guard's help in tracking down the reptile. Twyla dismissed her story, revealing that Wyllys was with her. Calrissian realized the plan wasn't working so he exited the cart and grabbed the princess and pretended to take her hostage. Gan played along, but realized that she wasn't a very good actress and assumed the plan would fail. To her surprise, the group was able to board the Falcon and she reminded Calrissian that he had promised to take her Livno III. Once onboard, she ordered Gris to take over the guns of the ship to discourage the guards from attempting a rescue and joined Calrissian and L3-37 in the cockpit. She gave the access code to the hangar door to the droid so that they could lift off and escape the planet.\nFleeing the planet, the Falcon was attacked by a group of ships. Gan assured the crew of the freighter that she had changed the access codes for the hangar to prevent any Hynestian ships from following them. Calrissian realized the ships were Corellian and belonged to Ne'eda's Stalwarts. He left Gan in the cockpit with orders to help L3-37 perform a maneuver called a Mustafarian Special. Gan heard him arguing with Gris and advised if that if her fur turned orange, he should stop talking to her. As the droid prepared, she gave Gan instructions on what the princess needed to do. Gan made sure she was securely fastened into her seat and flipped the switches when ordered to by L3-37. After the maneuver, the nauseated princess threw up all over L3-37.\nThe Falcon escaped into hyperspace, and Gan had to clean up the cockpit with the assistance of Gris. During the multi-day trip to Livno III, Calrissian taught the princess how to play sabacc. Exiting hyperspace, Gan saw a debris field and assumed the planet had been destroyed, but L3-37 explained that it was just the remnants of a comet and brought the freighter in for a landing.\nThe group made their way to the Chamber of the Sun. Gan caught Calrissian attempting to lift some precious stones from the jewel-lined walls and shook her head at him, getting him to stop. Gris removed the Solstice Globe from its case and Gan was impressed by its beauty. After the artifact was installed into a machine in the center of the chamber, Gan wondered if it was working as there didn't appear to be an effect on the planet. However, once the machine started working and the weather cleared, the princess was delighted that she had been able to save the planet.\nThe Lynna threw a celebration feast to thank Gan and the others for returning the Solstice Globe and saving the planet. She returned to Hynestia on the Falcon and was very nervous about seeing her mother again. Calrissian offered to drop her off somewhere else, but she was determined to return to her home. After landing, Gan made her way to the boarding ramp and greeted the guards who entered the ship. She ordered them to lower their weapons and informed them that Calrissian and L3-37 were heroes. Her mother approached the ship and the princess greeted her. She noticed the queen was wearing purple, which was the traditional Hynestian color for mourning or battle. Gan realized that her mother was probably very worried about her and felt guilty about subjecting her mother to the situation. She lied to her mother and told her that the crew of the Falcon had discovered that thieves had stolen the yearly tribute of gherlian fur and the princess engaged them in helping her recover it. She also explained that they had used the Solstice Globe as bait to lure the thieves to Black Spire Outpost on Batuu where it was destroyed in a firefight. Gan proceeded to open a hidden compartment in the ship and revealed the stolen furs. The Royal Guards collected the furs and asked about sparkly rock that was found with them. Gan ordered them to return it to Calrissian, as it was a reward from Gris for saving her life. The queen reprimanded Gan for overturning her decision to imprison Gris, but admitted it was admirable to express such loyalty to a friend. The queen ordered Calrissian to leave Hynestia and never return and Gan wondered where he would go but assumed it would be another adventure.\nWhen the Empire invaded Hynestia, Gan along with the rest of the population evacuated to Livno III.\nAround 34 ABY, Princess Gan met with Bazine Netal at the Stinky Jawa Cantina on Vixnix. The spy was looking for information about the Millennium Falcon. Gan asked for a fee of 1,000 credits to relay her story. Afterwards, Netal pressed for more details about the ship and the location of Livno III, but the princess refused to divulge the information. Using a distraction, Gan slipped away, leaving Netal alone in the cantina.\nGan frequently wore a pair of mag-boots that she received from her mother. She had a necklace that was given to her by Zel Gris that was based on ancient technology that could render her invisible as long as she stayed immobile.\nRinetta Gan first appeared in Lando's Luck written by Justina Ireland, illustrated by Annie Wu, and released on October 2, 2018 by Disney–Lucasfilm Press.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Hynestia_Prime",
  "/wiki/32_BBY",
  "/wiki/23_BBY",
  "/wiki/Human",
  "/wiki/Hynestian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hynestian_royal_family",
  "/wiki/Prince",
  "/wiki/Planet",
  "/wiki/Queen",
  "/wiki/Forsythia_Jin",
  "/wiki/Wild_Space",
  "/wiki/Forsythia_Jin%27s_mother",
  "/wiki/Wandering_Hope",
  "/wiki/Unknown_Regions",
  "/wiki/Hynestian_royal_palace",
  "/wiki/Hynestian_Royal_Treasury",
  "/wiki/Solstice_Globe",
  "/wiki/Strategy_instructor",
  "/wiki/Lynna",
  "/wiki/Zel_Gris",
  "/wiki/Homeworld",
  "/wiki/Livno_III",
  "/wiki/Frozen_Kova",
  "/wiki/Cantina",
  "/wiki/Magnetic_boot",
  "/wiki/Hynestian_Royal_Guard",
  "/wiki/Purple_glandis_flower_juice",
  "/wiki/Hynestian_royal_dungeon",
  "/wiki/Sabacc",
  "/wiki/Rinetta_Gan%27s_necklace",
  "/wiki/Hynestia%27s_landing_yard",
  "/wiki/Millennium_Falcon",
  "/wiki/Neral%27s_moon",
  "/wiki/Corellian_sector",
  "/wiki/Plasma_blade",
  "/wiki/Unidentified_food_peddler",
  "/wiki/Klinnet",
  "/wiki/Ne%27eda%27s_Tower",
  "/wiki/Unidentified_small_man",
  "/wiki/Gherlian_fur",
  "/wiki/Clothing",
  "/wiki/Unidentified_bounty_hunter_(Jeskian_Veldar)",
  "/wiki/Unidentified_Wookiee_Stalwart",
  "/wiki/Gherjnuthal",
  "/wiki/Wyllys",
  "/wiki/Soup",
  "/wiki/Josta_flower_extract",
  "/wiki/Turbolift",
  "/wiki/Restraining_bolt",
  "/wiki/Unidentified_sentry_droid",
  "/wiki/Unidentified_guard_(Hynestia)",
  "/wiki/Twyla",
  "/wiki/Gran_Kovali",
  "/wiki/Corellian",
  "/wiki/Mustafarian_Special",
  "/wiki/Chamber_of_the_Sun",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Batuu",
  "/wiki/34_ABY",
  "/wiki/Bazine_Netal",
  "/wiki/Stinky_Jawa_Cantina",
  "/wiki/Vixnix",
  "/wiki/Lando%27s_Luck",
  "/wiki/Justina_Ireland",
  "/wiki/Annie_Wu",
  "/wiki/October_2",
  "/wiki/2018",
  "/wiki/Disney%E2%80%93Lucasfilm_Press",
  "/wiki/Lando%27s_Luck_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Star_Wars_Adventures:_Flight_of_the_Falcon"
 ]
}