{
 "name": "Ring-Sol Ambase",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kynachi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kynachi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Nuru Kungurama"
     ]
    }
   ]
  }
 ],
 "content": "Ring-Sol Ambase was a male Kynachi Jedi Master serving the Jedi Order during the last years of the Galactic Republic.\nA Force-sensitive, Ring-Sol Ambase was discovered as an infant on his homeworld of Kynachi and taken to the Coruscant Jedi Temple for training in the ways of the Force. Because he did not grow up on Kynachi, he did not share the golden hair color which distinguished his species from Humans; a trait which was based off of Kynachi diet. After entering the Order, Ambase did not have any contact with his biological family, though he studied his culture thoroughly during his time at the academy, familiarizing himself with the products of KynachTech Industries and their practices. His brother maintained a farm on Kynachi. Ascending to the rank of Jedi Knight after completing his Trials of Knighthood and crafting his own lightsaber, Ambase befriend his colleague, Jedi Lanchu Skaa, and remained close with him despite their constant assignment to journey missions. Partnered with Master Dooku on one such mission, Master Ambase discovered a young Chiss in an escape pod floating in the void. Discovering him to be Force-sensitive, the Jedi pair took young Nuru Kungurama back to Coruscant to be trained as a Jedi.\nWhen the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Master Ambase dutifully reported to Coruscant and took up the role of General in the Grand Army of the Republic. At the behest of the Jedi High Council, Ambase took over the training of the young Chiss Padawan Nuru Kungurama, an orphaned apprentice whose original Master, Lanchu Skaa, died in the First Battle of Geonosis. When a KynachTech Industries circuit board was discovered amid the wreckage of the Confederacy's weapon the Malevolence, Master Ambase reported to the Republic Executive Building where he was scheduled for a meeting in the Chancellor's Suite with Supreme Chancellor Palpatine himself. Because of the Kynachi's neutrality, Palpatine thought it best if Master Ambase would lead an investigatory team to the planet to determine if they were knowingly supply the Confederacy with weapons technologies.\nDeparting Coruscant with Breakout Squad, Master Ambase was unaware that his Padawan had stowed away on board the ship; even when it came under fire by Separatist ships which had blockaded Kynachi. Fleeing the ship aboard an escape pod, Master Ambase's early sensations of Kungurama's closeness were confirmed as he boarded another pod directly behind his Master. The pods landed separately on the planet, and Ambase was rendered unconscious during the impact with the surface. Carried by his surviving clone troopers, Master Ambase was taken prisoner by the bounty hunter Cad Bane, a Duros hired by the elusive and mysterious Darth Sidious. Placed into a coma, Ambase's body was encased in a coffin and taken to a secure place on the fifth moon of Bogden.\nHe eventually woke up and discovered he was held prisoner in Dooku's castle with the clone trooper Sharp. They managed to escape in a Corona-class transport in an attack staged by Dooku. The two traveled to Bilbringi Depot, where they destroyed a ship which had fired on them. Ambase was able to sense Kungurama on the depot, and mistook his Padawan's shock at the destruction of the other ship as a sign of his falling to the dark side. Sharp and Ambase hid nearby and watched Kungurama's freighter escape. The two refugees then returned to Coruscant, where they were joined by a pair of bounty hunters to recover the escape pod Kungurama had been found in. He infiltrated Master Harro Kelpura's lab disguised as a Republic Admiral. Kungurama arrived in the middle of the attempt, carrying Ambase's lightsaber. The Master used the Force to take his lightsaber back and engage in a short duel with his Padawan. Kungurama managed to talk him down and Ambase collapsed. He was taken to the Jedi Temple medical facility to recover. Five days later, Kungurama visited him, and Ambase revealed he was renouncing his path as a Jedi and expressed his intention to go to his brother's farm on Kynachi.\nRing-Sol Ambase appears in Ryder Windham's Star Wars: The Clone Wars: Secret Missions young readers series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kynachi",
  "/wiki/Kynachi_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Human/Legends",
  "/wiki/Jedi_academy",
  "/wiki/KynachTech_Industries",
  "/wiki/Ring-Sol_Ambase%27s_brother",
  "/wiki/Farm/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lanchu_Skaa",
  "/wiki/Dooku/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/Republic_Executive_Building",
  "/wiki/Chancellor%27s_Suite",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Breakout_Squad",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cad_Bane/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Bogg_5",
  "/wiki/Bogden/Legends",
  "/wiki/Dooku%27s_castle_(Kohlma)",
  "/wiki/CT-4012",
  "/wiki/Corona-class_transport",
  "/wiki/Bilbringi_Depot",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Harro_Kelpura",
  "/wiki/Admiral/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Ryder_Windham",
  "/wiki/Star_Wars:_The_Clone_Wars:_Secret_Missions",
  "/wiki/The_Clone_Wars:_Secret_Missions_1:_Breakout_Squad",
  "/wiki/The_Clone_Wars:_Secret_Missions_2:_Curse_of_the_Black_Hole_Pirates",
  "/wiki/The_Clone_Wars:_Secret_Missions_3:_Duel_at_Shattered_Rock",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/The_Clone_Wars:_Wild_Space",
  "/wiki/The_Clone_Wars:_Wild_Space_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_12"
 ]
}