{
 "name": "Rinn  (Gand)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Sometime before the plot to assassinate Senator Amidala in 22 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gand"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Rinn was a Gand bounty hunter who worked with the Chadra-Fan Tiver. Along with the Rodian Neelda and the human Jango Fett, the pair was hired to capture a runaway Twi'lek who was trying to flee her father with her lover, Griph. After apprehending her, Rinn and Tiver attempted to double-cross Fett and his son, Boba. Boba, however, killed the pair and let Neelda live to tell others of the event.\nAt some point, Rinn became a bounty hunter, eventually partnering with the Chadra-Fan Tiver. The pair took jobs alongside the Rodian Neelda a number of times. Sometime before the plot to assassinate Senator Amidala, the three of them were hired by a man to return his runaway daughter. They met on Telerath, where they were joined by the esteemed bounty hunter, Jango Fett, who would also join them on the mission. They were surprised to find that he had brought his child, Boba Fett, with him. Nevertheless, they were forced to accept Boba's company.\nRinn and the other bounty hunters traveled to Ord Mantell, where they waited at a cantina for the Twi'lek girl. Soon enough, she arrived to meet her lover Griph. While they conversed at a balcony, Rinn, Tiver, Neelda and Boba cornered them. Neelda prompted Griph to leave and he ran away as fast as he could. Desperate not to be taken back to her father, the girl then jumped off the balcony. Luckily for the bounty hunters, Fett was watching the skies and caught her, stunning her in the process. After putting the girl in Fett's ship, Rinn, Tiver and Neelda followed the him and Boba while they discussed why the elder was covering the skies. That was when Rinn and Tiver double-crossed them. Rinn held Fett at gunpoint, demanding he give over the girl, while Tiver tackled Boba to the ground. Neelda refused to back their movement, even when Rinn offered him a share of the bounty. Suddenly, Boba broke free of Tiver and killed her. He then gunned down Rinn before while the Gand was confused about what had just happened.\nRinn was a Gand with green eyes and dark skin. The Gand and it's partner, Tiver, tried to steal the Fetts' bounty for their own so that they could share more of the reward.\nRinn wore a gas mask respirator connected to breather packs to breathe ammonia in oxygen-rich atmospheres. He was armed with a DL-18 blaster pistol.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gand",
  "/wiki/Rinn",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/22_BBY",
  "/wiki/Ord_Mantell",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Chadra-Fan",
  "/wiki/Tiver",
  "/wiki/Rodian",
  "/wiki/Neelda",
  "/wiki/Human",
  "/wiki/Jango_Fett",
  "/wiki/Mission_to_Ord_Mantell_(Jango_Fett)",
  "/wiki/Unidentified_Twi%27lek_(Ord_Mantell)",
  "/wiki/Unidentified_Twi%27lek%27s_father",
  "/wiki/Griph",
  "/wiki/Boba_Fett",
  "/wiki/Death",
  "/wiki/Telerath",
  "/wiki/Cantina",
  "/wiki/Twi%27lek",
  "/wiki/Stun",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Age_of_Republic_-_Jango_Fett_1",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Ultimate_Star_Wars"
 ]
}