{
 "name": "Rintel Aren",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Rintel Aren was a Weequay male pilot who served as a guard to the Hutt crime lord Jabba Desilijic Tiure. In 4 ABY, he was one of five guards assigned to accompany a trio of Jabba's prisoners on board a Bantha-II cargo skiff to the Great Pit of Carkoon, where the prisoners would be fed to a sarlacc. Upon reaching the pit, the prisoner Luke Skywalker used a Jedi mind trick to make Aren remove his iron manacles after the pilot and fellow guard Pagetti Rook selected Skywalker to be the first prisoner to be executed.\nAfter Jabba ordered Rook to push Skywalker into the pit, the Jedi leapt back onto the skiff and attacked the guards with a lightsaber. After the Jedi killed Rook, Aren became enraged and attacked him with an ax, but Skywalker dodged the blow and struck the Weequay with the lightsaber, sending him plunging into the sarlacc's maw.\nThe Weequay pilot Rintel Aren was a seasoned warrior who served for many years as a guard in the palace of the Hutt crime lord Jabba Desilijic Tiure on the desert planet Tatooine. In 4 ABY, he was selected as one of Jabba's fiercest guards to accompany a trio of prisoners to their execution at the Great Pit of Carkoon. The prisoners— the Jedi Luke Skywalker and the smugglers Han Solo and Chewbacca—were transported from the palace to the pit on a Bantha-II cargo skiff piloted by the Nikto Vedain, which also carried Aren and fellow guards Pagetti Rook, Velken Tezeri, Kithaba and \"Tamtel Skreej,\" the latter of whom was in fact Lando Calrissian, a disguised ally of the prisoners.\nUpon reaching its destination, the skiff carrying the prisoners came to a halt above the pit, which contained a sarlacc that the prisoners would be fed too. Rook and Aren selected Skywalker as the first of the prisoners to be executed and pushed him toward the plank extended from the skiff's edge over the sarlacc. Skywalker then used a mind trick to guide Aren into removing the iron manacles binding the Jedi's wrists before Rook pushed the prisoner again toward the plank.\nJabba, who had traveled alongside the skiff on his sail barge Khetanna in order to view the executions, then offered the prisoners a chance to beg for mercy before they were pushed in. Solo refused and Skywalker in turn offered Jabba a chance to free him and his allies or die. Amused, Jabba ordered that Skywalker be pushed to the edge of the plank, and then off into the pit. Rook used his BD-1 Cutter vibro-ax to force Skywalker off, but the Jedi caught the edge of the plank as he dropped and then sprung over Rook's head back onto the skiff. Aboard the sail barge, Skywalker's astromech droid, R2-D2, had launched the Jedi's lightsaber into the air, which Skywalker caught upon landing and used to immediately attack Aren and his companions.\nWith no weapon in hand, the Weequay pilot ducked back away from Skywalker as the former prisoner knocked Kithaba and then Tezeri overboard. Skywalker then killed Rook before facing Aren, who expertly jabbed at the Jedi with an ax; however, Skywalker dodged the blow by stepping aside and then spun around to deliver a fatal blow to Aren, knocking the screaming Weequay overboard directly into the maw of the sarlacc. Skywalker and his allies ultimately defeated Jabba's remaining guards and killed the Hutt, before destroying the Khetanna and escaping aboard the skiff.\nAren and the other Weequay who served Jabba were not among his smartest employees, but were fierce, dedicated and hardworking. Aren and Rook were amongst his fiercest guards, with Aren being the tougher looking of the two. Skywalker thought the pair could be siblings, although he was initially unsure of Aren's gender. After the death of Rook, Aren was enraged by his comrades death while attacking Skywalker. He had brown skin, brown hair, and black eyes.\nAren used a cruel-looking ax while fighting Skywalker. He wore a light brown jerkin with dark brown pants and black boots. His outfit also included a brown belt with a holster.\nRintel Aren first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, where he was portrayed by stuntman Julius LeFlore. The character went unnamed for thirty-seven years until his name was revealed in \"The Battle of Hoth and the Second Death Star\" an issue of the Star Wars Encyclopedia series published by De Agostini on December 11, 2020. The issue erroneously describes him as being on the second skiff rather then the one carrying the prisoners. With the first letters swapped, Rintel Aren and Pagetti Rook share their first names with Pintel and Ragetti, a pirate duo from the Pirates of the Carribean franchise.\nThe 2015 adaptation of Return of the Jedi, Return of the Jedi: Beware the Power of the Dark Side! by Tom Angleberger, differs from the film in its description of the battle above the sarlacc. It describes Pagetti Rook as the first guard to be knocked from the skiff by Luke Skywalker, followed by a \"rodent-like\" guard and then Rintel Aren, who has been enraged by Rook's death. Aren is also described as crumpling to the deck upon his death. In the film, Rook's death is not shown, but he is still clearly visible and alive on the skiff when Kithaba and Velken Tezeri are knocked overboard. Aren is then shown being knocked over the edge of the skiff by Skywalker. As such, this article assumes that the events depicted in the film are the canonical ones, while still treating Rook as dying prior to Aren in order for the latter to become enraged.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rintel_Aren",
  "/wiki/Unidentified_Weequay_Skiff_Master",
  "/wiki/Special:Upload",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Weequay",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Pilot",
  "/wiki/Security_guard",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Sarlacc",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi",
  "/wiki/Mind_trick",
  "/wiki/Iron",
  "/wiki/Pagetti_Rook",
  "/wiki/Skiff",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Ax",
  "/wiki/Lightsaber",
  "/wiki/Mouth",
  "/wiki/Standard_year",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Nikto",
  "/wiki/Vedain",
  "/wiki/Velken_Tezeri",
  "/wiki/Kithaba",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/BD-1_Cutter_vibro-ax",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Boot",
  "/wiki/Holster",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Julius_LeFlore",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/De_Agostini",
  "/wiki/December_11",
  "/wiki/2020",
  "/wiki/2015",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Tom_Angleberger",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Complete_Vehicles",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Consequence_of_Choice",
  "/wiki/Star_Wars_Insider_191",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/December_13"
 ]
}