{
 "name": "Rio Durant",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ardennia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "10 BBY",
      "Vandor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ardennian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.49 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue and tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Freedom's Sons",
      "Crimson Dawn",
      "Beckett's gang",
      "Beckett's gang"
     ]
    }
   ]
  }
 ],
 "content": "Rio Durant was a four-armed Ardennian pilot who lived during the reign of the Galactic Empire. Durant carried out dangerous missions alongside the scoundrel Tobias Beckett for years and was good-natured and up for any challenge.\nRio Durant was a veteran of Freedom's Sons, an independent army which assisted the Galactic Republic's Grand Army during the Clone Wars, but since it paid no pension, he turned to a life of crime for income and applied his military skills there. At some time during his life of crime, Rio tried to steal Tobias Beckett's and Val's speeder but they were impressed and Rio ended up joining Beckett and Val. They formed a crew which carried out risky though profitable heists. Over the time, Durant carried out several dangerous missions alongside Beckett, serving as his pilot.\nRio and his compatriots received a message from Crimson Dawn's leader Dryden Vos: Vos wanted Dvorad's stash of blank I.D. chips. Rio went with Beckett and Val to Hovun IV. There, he played sabacc until Beckett, disguised as a death priest, arrived. Rio pretended to be choked by Beckett, which caused the other players to flee. Rio scooped up the credits while Val placed a tracker on Dvorad's speeder. Beckett left Rio and Val behind as he jumped on Dvorad's speeder. He and Val caught up with Beckett by stealing a speeder with a bar. Rio got himself drunk as Dvorad summoned his ship.\nRio, Val, and Beckett held their hands up when Dvorad held them at gunpoint. A creature then attacked Dvorad and his ship. Rio and Val covered Beckett as he boarded the ship and defended himself against the creature. After escaping from the creature and Dvorad's ship, Rio suggested they should keep some of the I.D. chips for themselves despite Val's concerns about Vos. Rio and the others then boarded the Rampart and left Hovun IV.\nAfter taking the Rampart to Munt Ontdal, Rio, Val, and Beckett were captured by Enfys Nest and her Cloud-Riders. Rio and the others tried to convince the riders to let them go before Vos arrived. However, Val realized that the riders had given them their information for the heist. When Beckett refused to surrender the chips, he blew up the Rampart. As they made their escape from the riders, Rio and the others were confronted by stormtroopers. After evading the troopers, Rio posed as a scrambler.\nTen years before the Battle of Yavin, during a battle on the swamp planet Mimban, Rio infiltrated the swamp troopers along with Beckett and Val. There, they met the young Han Solo, who wanted to join their crew. Durant had doubts about letting Solo join them, but Beckett decided to give the boy an opportunity by leading him to be locked up for insubordination. Solo was ultimately able to escape with the Wookiee Chewbacca, who was initially intended to devour Solo, so Beckett ordered Rio to lower the ship to let Solo and Chewbacca board, causing Rio to become surprised with the Wookiee's presence. Once aboard, Solo spoke to him about disabling the AT hauler's tracking, so they could finish their escape.\nOnce they arrived at Vandor, Beckett's crew spied the 20-T Railcrawler conveyex transport that they had been planning to steal in order to acquire its coaxium cargo to pay Beckett's debt to Dryden Vos. As the crew spied, they wished for the absence of Enfys Nest and the Cloud-Riders the next day. That night, before sleeping next to the campfire they had made, Durant spoke with Solo, asking him about the girl he spoke of, mockinly asking if she was nice, and had sharp teeth. Rio also jokingly mocked Solo's piloting abilities.\nThe next day, The crew went to to take possession of the cargo wagon. Rio dropped Beckett, Solo and Chewbacca down onto the wagon, asking Beckett if it was a good day for them. Beckett told him it would be the best the day of his life. The plan was to rid the train of the range troopers guarding it and have Chewbacca separate the wagon with his strength, Rio positioned the ship in such way to let Solo and Beckett hook the wagon in order to escape with the cargo from the scene.\nNest and the Cloud-Riders appeared, intending to steal the coaxium from Beckett's hands. The Marauder Baroosh Pawk managed to board Beckett's ship and shot at Durant. Rio yelled at Pawk to get off his ship, and leaned round to fire twin blasters at the intruder, killing him, but was fatally shot in his left shoulder by Pawk. Wounded, Rio began to lose control of the ship, forcing Han to go into the ship to help Durant. Though Rio stated that it wasn't a serious wound, it became evident that Durant was succumbing to it. Anticipating that he was not going to survive, Rio asked Han for forgiveness, saying to the young man that he truly was a better pilot than him. On the verge of his death, Rio proclaimed that Val was correct in her belief that no one should die alone, reaffirming Han's goal of returning to Corellia to find Qi'ra. Durant then passed away from his wounds, leaving Solo to take control of the ship.\nAfter he and Val died, Beckett had graves placed for them, with Durant's having his goggles hung off the stick that marked it.\nAlthough his death seemed to be in vain as Han was forced to drop the coaxium to save Beckett, his death seemed to reaffirm to Han that he should find Qi'ra on Corellia. Also, despite being a smuggler, Han continued to keep Chewbacca around as he realized that a loyal friend was difficult to come by in such a merciless galaxy.\nRio Durant is voiced by Jon Favreau and performed by circus performer Katy Kartwheel in the 2018 Star Wars Anthology film Solo: A Star Wars Story. Durant is Favreau's second Star Wars role; he had previously voiced Pre Vizsla in six episodes of Star Wars: The Clone Wars.\nAs revealed in the DVD commentary of Solo, the practical portion of Durant's body was played by Kartwheel, while other parts of his body were done by CGI. Favreau was brought to voice the character after director Ron Howard managed to pull him away from his directing duties for the live-action remake of The Lion King.\nEarly story outlines for Solo included an additional member of Beckett's gang, a \"squid-monkey\" named Zapf, who was eventually amalgamated into Durant's character. An early influence for Durant was actor Wilford Brimley, who coincidentally, played Noa Briqualon in the 1985 Star Wars Legends TV movie Ewoks: The Battle for Endor, back when Durant was intended to be a gruff, mustachioed alien pilot with multiple eyes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Ardennia",
  "/wiki/10_BBY",
  "/wiki/Vandor",
  "/wiki/Ardennian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Freedom%27s_Sons",
  "/wiki/Crimson_Dawn",
  "/wiki/Beckett%27s_gang",
  "/wiki/Limb",
  "/wiki/Pilot",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Tobias_Beckett",
  "/wiki/Standard_year",
  "/wiki/Army",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Val",
  "/wiki/Dryden_Vos",
  "/wiki/Dvorad",
  "/wiki/Identichip",
  "/wiki/Hovun_IV",
  "/wiki/Sabacc",
  "/wiki/Death_priest",
  "/wiki/Dvorad%27s_speeder",
  "/wiki/Starship",
  "/wiki/Unidentified_creature_(Hovun_IV)",
  "/wiki/Rampart_(Tobias_Beckett)",
  "/wiki/Munt_Ontdal",
  "/wiki/Enfys_Nest",
  "/wiki/Cloud-Riders",
  "/wiki/Battle_of_Yavin",
  "/wiki/Mimban_Campaign",
  "/wiki/Swamp",
  "/wiki/Mimban",
  "/wiki/Swamp_trooper",
  "/wiki/Han_Solo",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/20-T_Railcrawler_conveyex_transport",
  "/wiki/Coaxium",
  "/wiki/Standard_day",
  "/wiki/Range_trooper",
  "/wiki/Baroosh_Pawk",
  "/wiki/Corellia",
  "/wiki/Qi%27ra",
  "/wiki/Death",
  "/wiki/The_galaxy",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Jon_Favreau",
  "/wiki/Katy_Kartwheel",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars",
  "/wiki/Pre_Vizsla",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Ron_Howard",
  "/wiki/Wilford_Brimley",
  "/wiki/Noa_Briqualon",
  "/wiki/1985",
  "/wiki/Star_Wars_Legends",
  "/wiki/Ewoks:_The_Battle_for_Endor",
  "/wiki/Alien",
  "/wiki/Category:Images_of_Rio_Durant",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_Credits",
  "/wiki/Star_Wars_Adventures_(2020)_4",
  "/wiki/Beckett_1",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Read-Along_Storybook_and_CD",
  "/wiki/Solo:_A_Star_Wars_Story:_Han_on_the_Run",
  "/wiki/Solo:_A_Star_Wars_Story:_Meet_the_Crew",
  "/wiki/Solo:_A_Star_Wars_Story:_Train_Heist",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/StarWars.com",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Solo:_A_Star_Wars_Story_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_36",
  "/wiki/Starfighter_Aces",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Han_Solo_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Industrial_Light_%26_Magic_Presents:_Making_Solo:_A_Star_Wars_Story"
 ]
}