{
 "name": "Riot_Mar",
 "display_name": "Riot Mar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.93 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "Riot Mar was a human male bounty hunter working for the Bounty Hunters' Guild. In 9 ABY, he attempted to capture the bounty known as Grogu by pursuing the Mandalorian Din Djarin, a bounty hunter who had betrayed the Guild, in his own customized Bounty Hunter Fighter. Mar managed to track down the Mandalorian in space and attacked his gunship, the Razor Crest; however, Djarin killed him, destroying his fighter during the battle.\nRiot Mar worked as a bounty hunter as a member of the Bounty Hunters' Guild during the time of the New Republic. In 9 ABY, following a fight on the planet Nevarro in which the Mandalorian Din Djarin had betrayed the Guild and fled with a bounty, the infant Grogu, Mar attempted to recapture the child from the Mandalorian. Piloting his own starfighter, a customized Bounty Hunter Fighter, the bounty hunter engaged the Djarin's gunship, the Razor Crest, in space, managing to tail behind the traitor and fire upon him. Getting closer to the Razor Crest, Mar demanded that Grogu be handed over, offering to spare the infant's life and later suggesting he would spare Djarin's.\nDamaging one of the gunship's engines, Mar believed he had his target trapped and continued firing while spinning his vessel as he pursued the Crest. Djarin then spun the Razor Crest but was unable to shake the bounty hunter; however, the Mandalorian then quickly slowed the gunship. Taken by surprise, Mar narrowly avoided crashing into the Razor Crest, catching a wing on one of its engines, but was killed as Djarin opened fire on the bounty hunter's vessel and destroyed it. Mar's final scream sounded through the Crest's comm at that moment. As a result of the skirmish, the Razor Crest suffered a number of damages, including a fuel leak that Djarin later fixed on the planet Tatooine.\nRiot Mar was a 1.93–meter–tall  human male with light skin, gray hair, and gray eyes. Although he would show mercy on his targets if it helped him capture them, he had a chance of shooting them regardless if it made the hunt easier for him. When demanding that Din Djarin hand over Grogu, he suggested he might even spare the Mandalorian if he complied. Mar made a cocky and overconfident impression on Djarin, gaining a false sense of security after dealing blows to the Razor Crest.\nMar was an expert tracker and an experienced pilot skilled in shooting.\nMar wore a yellow pressurized g-suit that included a life support unit, which had an air supply hose protruding to his black breath mask decorated with a pattern of white predatory teeth. He also wore brown pants, gloves, a belt, a white helmet with a yellow blast shield, also with a white teeth pattern, and red earphones. Mar flew a customized Bounty Hunter Fighter.\nRiot Mar first appeared in \"Chapter 5: The Gunslinger,\" the fifth episode of the first season of the Disney+ television series The Mandalorian that aired on December 6, 2019. He was portrayed by Rio Hackford, who also provided the motion-capture work for the IG-series assassin droid IG-11 in the show. Concept art for Mar was done primarily by artist Brian Matyas, while fellow artist Ryan Church contributed to much of the conception of Mar's fighter. Being given a description of Mar, a crazy exotic style helmet and a bunch of aviation patches, Matyas pictured a decorated pilot from the 1986 film Top Gun and looked into garments from the Cold War era.\nMatyas's first version of Mar resembled a World War II pilot to him. The artist was also asked to provide intimidating shape language to the bounty hunter, which led to another version of Mar to remind him of an Uruk'hai from the Lord of the Rings franchise. In another version, Matyas took inspiration from a TIE fighter pilot and the character Boba Fett, although the armor in the end product looked too expensive for a character who would not last long. He also made a dozen designs of toothy mouths, trying to merge it onto a respirator design. Art director Doug Chiang suggested putting the mouth where the muzzle met the visor, which Matyas liked; he considered the idea similar to the teeth designs on the noses of bombers.\nFilming for \"Chapter 5: The Gunslinger\" took place between January 9 and February 12, 2019. The shots of Mar inside his fighter were filmed with only a half-built cockpit and an LED screen behind it to visualize the changing position of realspace around Mar's fighter while it maneuvered. In Joe Schreiber's 2021 junior novelization of The Mandalorian Season One, Mar's two lines \"Hand over the child, Mando.\" and \"I might let you live.\" from the episode were merged into a single sentence. This article presents his dialogue as depicted in \"Chapter 5: The Gunslinger.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Riot_(disambiguation)",
  "/wiki/Mar_(disambiguation)",
  "/wiki/9_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/File:RiotMarMandalorian-TMS01CH05.ogg",
  "/wiki/Bounty_hunter",
  "/wiki/Bounty",
  "/wiki/Grogu",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Hunting",
  "/wiki/Incident_on_Nevarro",
  "/wiki/Bounty_Hunter_Fighter",
  "/wiki/Realspace",
  "/wiki/ST-70_class_Razor_Crest_M-111",
  "/wiki/Razor_Crest",
  "/wiki/Death",
  "/wiki/Riot_Mar%27s_starfighter",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Planet",
  "/wiki/Nevarro",
  "/wiki/Youngling",
  "/wiki/Pilot",
  "/wiki/Gunship",
  "/wiki/Engine",
  "/wiki/Starfighter",
  "/wiki/Starship",
  "/wiki/Comm_unit",
  "/wiki/Fuel",
  "/wiki/Tatooine",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/EVA_suit",
  "/wiki/Life_support",
  "/wiki/Breath_mask",
  "/wiki/Tooth",
  "/wiki/Clothing",
  "/wiki/Glove",
  "/wiki/Belt",
  "/wiki/Helmet",
  "/wiki/Chapter_5:_The_Gunslinger",
  "/wiki/The_Mandalorian_Season_One",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/December_6",
  "/wiki/2019",
  "/wiki/Rio_Hackford",
  "/wiki/IG-series_assassin_droid",
  "/wiki/IG-11",
  "/wiki/Brian_Matyas",
  "/wiki/Ryan_Church",
  "/wiki/1986",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Boba_Fett",
  "/wiki/Armor",
  "/wiki/Mouth",
  "/wiki/Doug_Chiang",
  "/wiki/January_9",
  "/wiki/February_12",
  "/wiki/Joe_Schreiber",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian_5",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Practical",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/LEGO",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Riot_Mar",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_8:_Redemption",
  "/wiki/Chapter_13:_The_Jedi",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/April_8"
 ]
}