{
 "name": "Ris_Waller",
 "display_name": "Ris Waller",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ris Waller was a Human male who served as a member of the same Alliance to Restore the Republic during the Galactic Civil War. Waller worked with Rebel agent Jan Ors, Rosco Ross and A-Cee on the luxury liner Star of Empire. There they recruited an Imperial officer named Kyle Katarn to join their cause.\nRosco, A-Cee and Waller belonged to the same Rebel cell under Jan Ors. They secretly operated in an off-limits storage room onboard the Star of Empire.\nOnboard, Ors spotted an Imperial officer whom she already encountered on AX-456 , and they improvised a plan to capture him. Katarn noticed Ors and started to chase her in the crowd. The chase followed on a moving walkway where Waller also was, with a comlink in his right ear; seeing Ors running towards their hideout, he notified Rosco that they are on the way, and he also followed them.\nIndeed, soon after Rosco had immobilised Katarn, Waller also showed up. He watched as Katarn had a brief brawl with Rosco, and Waller had his blaster in hand, until he was ordered by Ors to hide it, owing her life to Katarn.\nTheir operations were noticed by a bounty hunter and Katarn warned Ors that the Imperials knew about them and would soon come. Ors ordered them to go to the hangar deck and prepare the Truly Sorry. Waller manned the overhead turret while Rosco guarded outside, waiting for Ors and A-Cee, and was surprised to see Katarn boarding the ship and initialise the systems; Waller dropped out, Kyle responded with thumbs-up, and returned to his post.\nDuring their episodic escape from the cruiser, Katarn had Waller to shoot at a SoroSuub shuttle, shearing part of its starboard wing, in order to force the Hangar Control to open the pressure doors. Soon Jan entered the hangar, pursued by Imperial military personnel. They exchanged fire with Rosco and Waller supported them, felling four of her pursuers, and scattering the rest. Rosco and Jan managed to board the ship and soon Waller warned them that one ship was following them, and gaining while they calculated their coordinates.\nOut of a coincidence, the pursuing ship was destroyed because of an internal explosion – A-Cee was on board and his self-destruct mechanism was activated – they safely made it to the New Hope.\nWaller was a very tall and thin man, contrasting the burly and strong build of his partner, Rosco.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Jan_Ors",
  "/wiki/Rosco_Ross",
  "/wiki/A-Cee",
  "/wiki/Cruiser/Legends",
  "/wiki/Star_of_Empire",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/AX-456",
  "/wiki/Comlink/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Truly_Sorry",
  "/wiki/Turret/Legends",
  "/wiki/Skirmish_on_the_Star_of_Empire",
  "/wiki/SoroSuub/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Dol_Donar%27s_yacht",
  "/wiki/New_Hope",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama"
 ]
}