{
 "name": "Risha_Drayen",
 "display_name": "Risha Drayen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3664 BBY",
      "Mandellian Gambit"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Drayen Crime Syndicate",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Risha Drayen was a Human female who was a petty criminal, starship mechanic, woman of mystery, royal queen, and daughter of the notorious crime lord Nok Drayen during the time of the Cold War. Although she was the daughter of a violent gangster, she was not emotionally scarred by her turbulent upbringing. Known to be wise and experienced beyond her years, she lived an adventurous life.\nRisha had a very odd childhood. Her mother died while she was not yet old enough to remember her. Her father, Nok Drayen, gave her lessons on how to survive in the galaxy, including teaching her to fire a blaster while she was four years old. While Nok was running his pirate gang, a Twi'lek slave he freed, Vette, bonded with Risha, and they were like sisters until they later separated. At one point Nok took his daughter to the pirate haven of Rishi, where little Risha was afraid of the black sand at first, but came to enjoy the trip by the end. By the age of eleven, when Nok was forced to freeze himself in carbonite to stave off a disease a traitorous lieutenant infected him with, Risha successfully made her first hyperspace jump to Dantooine, where her father had a hideout. For a few years afterwards, Dantooine's population doubled due to Risha's and her father's presence.\nBy the age of fourteen, after studying many of Nok's holorecordings on the ways of criminals, she hid her father and left Dantooine under a new identity. In her travels in the intervening years, she befriended the Togruta couple Juran and Audila Reb and had dealings with Beryl Thorne. At some point she spent some time on Makeb laying low after a successful job. By the end of the Great Galactic War, the Sith Empire's Treasury Department had posted a 1,000,000-credit bounty on her head.\nDuring the Cold War, Risha partnered with the criminal Skavak to search for her family crown, which her great-grandfather, King Arak Drayen III, had hidden from the usurper of the throne of Dubrillion. However, the ship she was on belonged to a smuggler who was determined to get it back. When the smuggler reclaimed the ship, with Risha on it, she offered the smuggler the same deal she had given Skavak, promising that she would make her new partner \"filthy rich\" if they allied with her.\nIn searching for the Drayen crown, Risha helped to upgrade the smuggler's ship. To accomplish this, they made deliveries to Taris, Nar Shaddaa, Tatooine and Alderaan to acquire the necessary ship upgrades.\nAfter getting all the upgrades, Risha received a holocall from Juran, who revealed that Audila had been kidnapped. Her kidnapper was demanding that Risha meet him on Tatooine; if not, he would kill Audila. Risha knew this was a plot of the usurper king to draw her out and enlisted the smuggler's aid in rescuing her friend, though she did not disclose her past. The meeting place with the kidnapper was in an old Czerka mine. Confirming information with her contacts, Risha discovered an ore-processing shaft the smuggler could infiltrate and surprise the assassin while she seemingly complied with his demand.\nUpon meeting, Risha demanded that the assassin let Audila go, but the assassin stated that his liege, King Actavarus III of Dubrillion, specifically ordered no witnesses. Luckily, Risha's partner arrived in time and killed the assassin and his men. As a relieved Juran reunited with his wife, Audila demanded to know why she was kidnapped, to which Risha refused to answer. As a result, Audila threatened to sever ties with her, but Risha and the smuggler persuaded her to give her friend another chance. Risha provided the happy couple some credits to start up elsewhere. Audila accepted but reminded her that she would want an answer someday.\nAfter getting off Tatooine, Risha brought the smuggler to Nar Shaddaa to introduce her partner to her father, who was frozen in carbonite. Nok gave the smuggler the location of the crown's resting place in a region of space called the Long Shadow. Once the smuggler returned with the crown, Nok instructed Risha to take the crown and retake the throne of Dubrillion. Claiming that, if she was to succeed, she would need to perform many questionable actions, Risha's father ordered her to kill the smuggler, stating that one spacer would not be missed. Risha refused to kill her friend. With his dying breath, Nok expressed how disappointed he was in her. After he died, Risha instructed Doctor Chelah to dispose of her father's body according to his wishes and formally released the Selkath from her family's service.\nTurning to the smuggler, she remarked that she only had a crown but no army or armada to retake Dubrillion. Thus, she chose to stay with her friend as their first mate. Also, she informed the Galactic Finders Guild to credit the smuggler for finding the Drayen treasure.\nIn her travels with the smuggler, Risha began planning to retake Dubrillion, starting by trying to find allies among the aristocracy who detested the current king's rule. She discovered a possible ally in a lesser baron, but she quickly identified him as a spy for King Actavarus III. With the aid of several Hutts that owed her a favor, she set a trap for the spy on Nar Shaddaa and promised to send a holorecording of the trap to the king.\nEventually, Risha found an honest ally in Count Merritt Rineld, who was rallying the aristocracy against Actavarus. Communicating with him via holo, Rineld explained that he planned to depose Actavarus without bloodshed. But to cement Risha's claim to the throne, he abruptly proposed marriage. Risha later met with Rineld on Coruscant in the Senate Tower and determined he was a good ally for retaking the throne, though clearly extremely infatuated and desperate. Unfortunately, Actavarus condemned Rineld to death, starting a chain of events that plunged Dubrillion into civil war. Rineld managed to escape and contacted Risha, asking if she would accept his proposal. Risha considered it for Dubrillion's sake, but was then surprised at an alternative marriage proposal from the smuggler just prior to speaking to the count, especially given how she had treated their relationship as casual and made it clear she would marry nobility. Whilst at first believing it to be a joke, the smuggler reaffirmed his proposal whilst on a holocall to the count as they discussed the count's proposal. She accepted the smuggler happily, and apologized to the count. She then agreed to ensure that the smuggler would be given kingship should they retake the throne, and they said their vows to each other on the ship before consummating their marriage.\nDuring the Eternal Empire's Conquest, the smuggler went missing. Risha searched Wild Space for three years until finally giving up.\nRisha was known to be sarcastic and generally selfish. However, her smuggler friend believed that she only needed to be shown how to be a better person. Years spent among the galaxy's dregs had fostered layers of personal self-defense mechanisms and an air of cynicism around Risha. Only her closest friends had any hope of meeting the \"real\" Risha hiding beneath the surface.\nRisha is voiced by Tara Strong.\nRisha can be romanced by the male Smuggler character and can eventually marry.\nIf the Outlander is based on a smuggler, Corso and Risha return to the smuggler after the establishment of the Eternal Alliance.\nRisha reveals that after the smuggler went missing, Risha was forced to hide from enemies on Dubrillion, accompanied by Corso. The two found a way to make credits on the side by using Skavak's name. After Vaylin sacked Dubrillion, they heard rumors that the smuggler was alive and tracked them down. Corso and Risha reunited with their captain, and the pair were welcomed into the smuggler's new crew.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Risha_(disambiguation)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Risha_Drayen",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/3664_BBY",
  "/wiki/Mandellian_Gambit",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Drayen_Crime_Syndicate",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Nok_Drayen",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Risha_Drayen%27s_mother",
  "/wiki/The_galaxy/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Vette",
  "/wiki/Rishi/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Togruta/Legends",
  "/wiki/Juran_Reb",
  "/wiki/Audila",
  "/wiki/Beryl_Thorne",
  "/wiki/Makeb",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Treasury_Department",
  "/wiki/Skavak/Legends",
  "/wiki/King/Legends",
  "/wiki/Arak_Drayen_III",
  "/wiki/Dubrillion/Legends",
  "/wiki/Voidhound",
  "/wiki/Taris/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Actavarus_III",
  "/wiki/The_Long_Shadow",
  "/wiki/Chelah",
  "/wiki/Selkath/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Merritt_Rineld",
  "/wiki/Tara_Strong",
  "/wiki/Corso_Riggs",
  "/wiki/Eternal_Alliance",
  "/wiki/Sacking_of_Dubrillion",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Standard_year/Legends",
  "/wiki/Smuggler/Legends"
 ]
}