{
 "name": "Risha Sinan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Risha Sinan was a female Human scientist. She lived in the city of Restuss before it was destroyed in the Battle of Restuss.\nSinan was fascinated with the local giant bark mites. But as these creatures constantly destroyed the greenery, she searched for a chemical solution to repel them. Shortly before the Battle of Restuss, Sinan found a mutant variant of giant bark mites and hired a spacer to travel to their hive and collect specimens of the different variants.\nRisha Sinan was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts. She was removed from the game on June 27, 2006 due to the changes done to Restuss in preparation to the Battle of Restuss event, during which the city was destroyed. She was removed from the game during the release of Publish 29/Chapter 1 on June 27, 2006. During this update, changes were made to Restuss in preparation for the upcoming Battle of Restuss event, during which the city was destroyed. The game was shut down on December 15, 2011.\nShe gave players a mission to travel to the giant bark mite cave and kill several creatures. After completing the mission, players were rewarded with 5,700 credits and a Bubble Tank Draft Schematic or an Enhanced View Cone.\nBecause Risha Sinan spawned under the commoner_human_female template, her appearance was randomly generated. However, she consistently appeared as a Human female.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Risha_(disambiguation)",
  "/wiki/Rori/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Restuss",
  "/wiki/Battle_of_Restuss",
  "/wiki/Bark_mite",
  "/wiki/Spacer/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/June_27",
  "/wiki/2006",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Galactic_Credit_Standard"
 ]
}