{
 "name": "Rith_Tar%27ak",
 "display_name": "Rith Tar'ak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ebranite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the RepublicScandium TeamSandstorm Unit",
      "Scandium TeamSandstorm Unit",
      "Sandstorm Unit"
     ]
    }
   ]
  }
 ],
 "content": "Rith Tar'ak was an Ebranite operative for the Alliance to Restore the Republic.\nAs a child, Rith Tar'ak saw the Galactic Empire subjugate her native world of Ebra. Rith and her sisters, Nyik and Tor'ara, from the Rull were enslaved.\nThey managed to escape from Ebra by hijacking an Imperial shuttle. The Tar'aks forced the pilot to take them to the Alliance to Restore the Republic. The Tar'aks became the first Ebranites to serve as soldiers for the Rebel Alliance.\nThey joined the 28-member Scandium Team, based on Tharin sector. The operations of the Scandiums were noticed throughout all the galaxy. The Tar'aks also created Sandstorm Unit, specializing in desert infiltration. Rith was considered the best desert infiltrator of the Tar'aks, although she rejected the use of blasters preferring other, more primitive weapons.\nDuring the Wellte-ir Massacre, Scandium Team was defeated, with 22 of the 28 members dying on the Bresnan plains. Rith was the only surviving Ebranite.\nShe was then transferred to Yntrann, a desert planet.\nRith rejected a promotion to Colonel so she could return to Ebra as a recruiter. She was then assigned a modified 5DS protocol droid, A-5DS, which was reprogrammed by Rith herself. She used A-5DS to contact with Ebranite slaves forced to work on mines of Grythsorin canyon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ebranite",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Scandium_Team",
  "/wiki/Sandstorm_Unit",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Ebra",
  "/wiki/Nyik",
  "/wiki/Tor%27ara",
  "/wiki/Rull",
  "/wiki/Tharin_sector",
  "/wiki/Blaster/Legends",
  "/wiki/Wellte-ir_Massacre",
  "/wiki/Bresnan",
  "/wiki/Yntrann",
  "/wiki/Colonel/Legends",
  "/wiki/5DS_Ebranite_Relations_Droid",
  "/wiki/Protocol_droid/Legends",
  "/wiki/A-5DS",
  "/wiki/Grythsorin",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Cracken%27s_Rebel_Operatives_(article)",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}