{
 "name": "Rivi-Anu",
 "display_name": "Rivi-Anu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mygeeto"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Rivi-Anu was a Human female who served the Jedi Order and the Galactic Republic during the Clone Wars, a galaxy-spanning conflict between the Republic and the Confederacy of Independent Systems. In the war's final year, she was promoted to the rank of Jedi Knight and came under the command of Jedi Master and General Ki-Adi-Mundi. She, Mundi, and the Republic forces under their leadership were dispatched to the planet Mygeeto to attack a Separatist base on the world. During the ensuing battle, Rivi-Anu was injured as the Republic forced the Separatists into retreat. However, a Venator-class Star Destroyer was disabled and plummeted to the planet's surface, threatening the lives of the Republic troops on the battlefield. Rivi-Anu implored Mundi to get the forces to safety and used the Force to delay the ship's crash. After her allies were secure, Rivi-Anu lost control over the Star Destroyer, which crushed her as the ship finished its descent to the surface.\nRivi-Anu, a Human female, was born during the final decades of the Galactic Republic. She was trained in the ways of the Force by the Jedi Order. Around 19 BBY, during the Clone Wars—a galaxy-wide conflict between the Republic and the Confederacy of Independent Systems—Rivi-Anu was promoted to the rank of Jedi Knight, due to the increasing need for Knights in the war. During that same year, Rivi-Anu, along with the Jedi Eon, a Twi'lek Jedi, and a Human Jedi, was placed under the command of Jedi Master and General Ki-Adi-Mundi. They were dispatched to the planet Mygeeto during the Republic's sieges in the Outer Rim Territories to combat forces of the Separatist Droid Army. As the clone troopers under Ki-Adi-Mundi's command were preparing to attack a Separatist base on the planet, Rivi-Anu related her fellow Jedi's concerns about the impending battle to Mundi after he finished meditating.\nEventually, Rivi-Anu fought in a battle alongside Ki-Adi-Mundi and her fellow Jedi against the Separatists, causing their enemies to retreat. She was instructed by Mundi to secure the west flank, but as she was preparing to execute the order, she was shot in the right arm, losing her lightsaber in the process. At that same moment, a Republic Venator-class Star Destroyer which had been destroyed by Separatist forces plunged down through the atmosphere, endangering the forces on the surface. Rivi-Anu did not flee as Mundi ordered his forces to retreat, and elected to stay and attempt to use the Force to grasp the ship and hold it off long enough for her allies to reach safety. However, after the Republic troops were successfully secured, Rivi-Anu lost control of the ship, causing it to crush her as it crashed on the planet's surface. After the battle, Rivi-Anu's self-sacrifice was noted by Mundi. During his next mission on Mygeeto, the Cerean meditated in the rain on Rivi-Anu's sacrifice.\nRivi-Anu was a light-skinned female who had red hair and green eyes with triangular purple tattoo under both of her eyes. She was concerned about her young age and status as a Jedi Knight, due to the fact that her training was rushed because of the Republic's increasing need for Jedi Knights, and expressed these concerns to Master Ki-Adi-Mundi while on Mygeeto. Despite these concerns, she was reassured by Mundi that he had faith in her and her fellow Jedi's abilities. During the battle against the Separatists on the planet, she displayed her selflessness by forfeiting her life so that her allies could escape as she used the Force to delay the crash of the crippled Republic Star Destroyer. After her death, Mundi noted that her selfless act was a display of great love.\nRivi-Anu was a capable user of telekinetic Force powers, displaying that as she delayed the disabled Star Destroyer's crash from Mygeeto's surface.\nRivi-Anu wore a set of brown Jedi robes and used a lightsaber with a green crystal during the Battle of Mygeeto.\nRivi-Anu was introduced in the short story \"To the Vanishing Point,\" which was one of four stories compiled in the sixth volume of the Clone Wars Adventures trade paperbacks. The character was created and drawn by Matthew and Shawn Fillbach. In \"To the Vanishing Point,\" the battle in which Rivi-Anu perished was implied to have taken place on a different world from Mygeeto. However, The Complete Star Wars Encyclopedia later established that the events of the story took place on Mygeeto. This article assumes the latter to be correct.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/To_the_Vanishing_Point",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/19_BBY/Legends",
  "/wiki/Mygeeto/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Mygeeto",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Eon",
  "/wiki/Unidentified_Twi%27lek_Jedi_(Clone_Wars)",
  "/wiki/Unidentified_young_Human_Jedi",
  "/wiki/Outer_Rim_Sieges/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Meditation/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Water/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Lightsaber_crystal",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_6",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Matthew_Fillbach",
  "/wiki/Shawn_Fillbach",
  "/wiki/Star_Wars_Insider",
  "/wiki/Drawn_By_The_Force",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_New_Essential_Chronology"
 ]
}