{
 "name": "Rivo Xarran",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ladarra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  }
 ],
 "content": "Rivo Xarren, later known as The Storyteller, was a slicer and brother to Gaege Xarran.\nAt some point around 1 ABY, Xarran accidentally hacked into the records of Jabba the Hutt. Nevertheless he stole the information he saw and sold it to the highest bidder. The Hutt retaliated, assigning Boba Fett to hunt him down. Xarran ran.\nWhile on Inat Prime, Fett planted a subdermal tracker on Xarran and followed when the slicer fled to Vryssa where his brother, Gaege, a general in the Imperial Army, gave the man asylum in his garrison.\nFett infiltrated the base and in the fight that followed Rivo bartered for his life. Suggesting that Fett could tell Jabba that Rivo perished in the base's self-destruct, the hunter would still be able to collect the bounty. Fett agreed but promised to one day finish the job.\nMany years later on Ladarra, long after Jabba's death, Xarran recalled his past for gathered urchins he had come to entertain as The Storyteller. When the tale ended and the children left, he turned around to find Fett, who had been watching him tell the story.\nEnigmatically, Fett presented the man with a credit chit worth Xarran's bounty then exited, The Storyteller somehow managing to understand.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ladarra",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Gaege_Xarran",
  "/wiki/1_ABY/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Inat_Prime",
  "/wiki/Subdermal_tracker",
  "/wiki/Vryssa",
  "/wiki/General/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Credit_chit",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/No_Disintegrations,_Please",
  "/wiki/Star_Wars_Adventure_Journal_14",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}