{
 "name": "Rixen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Rixen was a female Human member of the Alliance to Restore the Republic who was operating in the Core Worlds.\nAround 3 ABY, Rixen arrived at the Kuat Passenger Port after attempting to evade the Imperial spy Do'naal, who had been trailing her when she was at Byblos earlier. At the port, she consulted a nondescript information droid, L1V-IN, who had been programmed by the Rebellion to serve as a drop point for information and secret messages between Alliance agents. Rixen gave the droid the code phrase needed to access the information, and the droid played back three messages for her. The first detailed the capture of Rebel agent Vewin by Imperial authorities Kelada, and the second informed Rixen that another agent, Stabris, had fled to the Outer Rim Territories because of increased Imperial security in the Core Worlds and Colonies. Upon hearing this, Rixen decided it would be best for her to flee the Core Worlds as well.\nRixen was surprised when the third message, from Do'naal, told her to surrender. Immediately after playing the message, she was surrounded by undercover Imperial Intelligence agents. Rixen attempted to detonate a device that would kill both her and the agents surrounding her, but Do'naal was able to apprehend her first. She was taken away by stormtroopers to be held for interrogation by Do'naal in Imperial lock-up.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Kuat_Passenger_Port",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Do%27naal",
  "/wiki/Byblos/Legends",
  "/wiki/Droid/Legends",
  "/wiki/L1V-IN",
  "/wiki/Vewin",
  "/wiki/Kelada/Legends",
  "/wiki/Stabris",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Death/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/West_End_Games",
  "/wiki/Dead_End_Drop",
  "/wiki/Shadows_of_the_Empire_Sourcebook"
 ]
}