{
 "name": "Riyana_Torr",
 "display_name": "Riyana Torr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alderaan Flotilla",
      "Unidentified roving school"
     ]
    }
   ]
  }
 ],
 "content": "Riyana Torr was a young human female who survived the destruction of her homeworld Alderaan in the year 0 BBY due to the fact she was offworld with her missionary parents at the time. By the year 5 ABY, she had joined the Alderaan Flotilla, a collection of starships housing Alderaanians survivors. While the flotilla was based in the Alderaan system amongst the remains of Alderaan, Torr attended a meeting on board the Alderaanian escort frigate Sunspire to discuss the future of the flotilla. Torr and the other meeting attendees argued about whether they should remain in the Alderaan system or resettle a new planet until a group of New Republic vessels arrived hauling the remains of the Death Star superweapon, which the Alderaanians decided to use to build a new space station.\nRiyana Torr was a human female born to a pair of missionaries native to the planet Alderaan. In the year 0 BBY, Torr was offworld traveling with her parents as part of a roving school that offered help to the needy when her homeworld was destroyed by the Galactic Empire's Death Star superweapon. By the year 5 ABY, Torr had joined the Alderaan Flotilla, a collection of starships initially gathered by the Princess Leia Organa and the Rebel pilot Evaan Verlaine that housed the surviving population of Alderaan. While the flotilla was positioned amidst the remains of their homeworld in the Alderaan system, she attended a meeting on board the Alderaanian escort frigate Sunspire to discuss the future of the flotilla.\nAt the meeting the flotilla's Regent Administrator Eglyn Valmor argued that the fleet should remain in the Alderaan system, while others like the teacher Icar Orliss and the diplomat Janis Pol wanted to resettle a new world. After Pol claimed they would not need to worry about going through New Republic protocols to resettle a world since they were not part of the Republic, Torr argued that they were part of the Republic due to Organa's prominent role in their government.\nThe arguing within the meeting continued until it was interrupted by reports of several large vessels approaching the flotilla. Torr and the others were then shocked to see a number of New Republic vessels hauling the remains of the Death Star toward the flotilla, which fellow flotilla member Teven Gale then revealed he had worked with Organa and Verlaine to acquire for the flotilla as a resource. Valmor and Gale then suggested building a new space station from the superweapon's remains, although Orliss still remained stubborn on resettling elsewhere.\nIn 5 ABY Torr was young enough that Teven Gale thought she was probably too young to be at the meeting on the Sunspire. She was visibly nervous while speaking at the meeting.\nRiyana Torr first appeared in the novel Aftermath: Life Debt, which was written by Chuck Wendig and released released on July 12, 2016.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Alderaan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alderaan_Flotilla",
  "/wiki/The_Disaster",
  "/wiki/Homeworld",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Parent",
  "/wiki/5_ABY",
  "/wiki/Starship",
  "/wiki/Alderaan_system",
  "/wiki/Alderaanian_escort_frigate",
  "/wiki/Sunspire",
  "/wiki/Star_system",
  "/wiki/New_Republic",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Space_station",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Rebel_pilot",
  "/wiki/Evaan_Verlaine",
  "/wiki/Regent_Administrator",
  "/wiki/Eglyn_Valmor",
  "/wiki/Teacher",
  "/wiki/Icar_Orliss",
  "/wiki/Diplomat",
  "/wiki/Janis_Pol",
  "/wiki/Teven_Gale",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Chuck_Wendig",
  "/wiki/July_12",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}