{
 "name": "Riyola Keevan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chandrila Star Line"
     ]
    }
   ]
  }
 ],
 "content": "Riyola Keevan was a Pantoran female starship captain for Chandrila Star Line. She served aboard the MPO-1400 Purgill-class star cruiser Halcyon during the war between the First Order and the Resistance.\nRiyola Keevan previously served as quartermaster on the Halcyon, and was assigned as Leia Organa's personal attaché during her honeymoon voyage with her husband Han Solo. Sometime in the thirty years that followed, she became Captain of the ship. Shortly after handling a pirate raid by Crimson Jack, she served as captain during the Halcyon's 275th anniversary voyage to Batuu. As the voyage began, the ship was boarded by Lt. Harmon Croy and his troops of the First Order under suspicion of Resistance activity.\nA note was posted in Oga's Cantina in Black Spire Outpost on the planet Batuu advertising a mechanic position on board the Halcyon and instructing applicants to contact Keevan. Strong, charismatic, and worldly, she was dedicated to her duty as captain and earned deep respect from her crew.\nRiyola Keevan was first mentioned in Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. She was featured as a character in the immersive hotel experience Star Wars: Galactic Starcruiser, which opened in 2022 at the Walt Disney World Resort. In audition sides posted for the character by The Walt Disney Company, Keevan thanks guests for assisting in the apprehension of outlaws on the Halcyon and makes reference to having served aboard the vessel for twenty years.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Chandrila_Star_Line",
  "/wiki/Starship",
  "/wiki/Captain",
  "/wiki/MPO-1400_Purgill-class_star_cruiser",
  "/wiki/Halcyon",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Technician",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Riyola_Keevan",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/May_31",
  "/wiki/2019",
  "/wiki/Star_Wars:_Galactic_Starcruiser",
  "/wiki/2022",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Standard_year",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Halcyon_Legacy_1",
  "/wiki/Halcyon_Legacy_2",
  "/wiki/Halcyon_Legacy_3",
  "/wiki/Halcyon_Legacy_4",
  "/wiki/Halcyon_Legacy_5",
  "/wiki/The_Art_of_Star_Wars:_Galaxy%27s_Edge",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Ships_of_the_Galaxy:_The_Halcyon_Starcruiser",
  "/wiki/May_17",
  "/wiki/2021"
 ]
}