{
 "name": "Riyo_Chuchi",
 "display_name": "Riyo Chuchi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pantora"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.65 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pastel purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Riyo Chuchi was a female Pantoran politician from the moon of Pantora which orbited the planet Orto Plutonia. Chuchi served as a senator and represented her people in the Galactic Senate of the Republic during the Clone Wars. Chuchi also helped negotiate peace between the Talz tribe on the neighboring planet, Orto Plutonia. Later in the war, she would help combat the Trade Federation blockade of Pantora with the help of Jedi Padawan Ahsoka Tano, simultaneously helping the new Pantoran Chairman, Notluwiski Papanoida, locate his daughters, whom the Trade Federation had captured and held ransom.\nAt some point prior to or during the Clone Wars, Chuchi attained the rank of senator and represented her homeworld of Pantora in the Galactic Senate; though she shared her rather young age with fellow senators Padmé Amidala and Mon Mothma, she was rather timid and soft-spoken in comparison.\nIt was during the time that the Pantoran Assembly requested that the Grand Army of the Republic establish a base on the planet Orto Plutonia to protect the moon of Pantora from possible attacks by the Confederacy of Independent Systems. Although the Grand Army established a base, their station on Orto Plutonia soon ceased communications, forcing military leaders and Chairman Chi Cho of the Pantoran Assembly to organize an investigative task force. Cho asked that Chuchi accompany him with Jedi Anakin Skywalker and Obi-Wan Kenobi to Orto Plutonia to act as a liaison between the Pantoran government and the Jedi Order. While Chuchi was on Orto Plutonia, her responsibilities as a senator were marginalized by Cho, who simply used her as a mouthpiece to convey his orders to the two Jedi or to wield her senatorial authority over them, with Chuchi herself unable to countermand him. It was eventually discovered that Orto Plutonia was indeed inhabited and that its Talz population was the cause of the communications disruption. Chairman Cho held a great disdain for the Talz and attempted to wipe out the Plutonian tribe, but was instead killed in the process. Whilst this was happening, Chuchi conferred with the Jedi and agreed to contact the Speaker of the Assembly in regards to Cho's actions, since she had attempted in vain to prevent him from declaring war. The Pantoran Assembly decided that Cho was out of order and revoked his status as Chairman whilst also granting Chuchi authority to negotiate peace with the Talz.\nChuchi, after refusing a dying Cho's orders to exterminate the Talz, then met with Chieftain Thi-Sen and, with the help of C-3PO's translation, agreed to leave Orto Plutonia under the stewardship of the Talz and withdraw from the planet. After sharing a bow of mutual respect with the chief, Chuchi then left the planet with the Republic forces and returned to Coruscant to resume her senatorial duties. At some point after this, she met Anakin Skywalker's Padawan Ahsoka Tano and became good friends with her.\nWhen the Zillo Beast attacked the Senate the impact forced Chuchi to fall to her knees, she then looked back in distress while several other senators fell to the ground. Chuchi survived the attacks.\nLater in the war, Pantora was blockaded by the Trade Federation under the pretense that the planet owed a number of debts to the corporation. Chuchi, now a stronger voice in the Senate and as an individual, vocally opposed these accusations and worked tirelessly to convince her fellow senators to side with Pantora's plight, despite widespread anti-Republic sentiment on the moon itself. During the crisis, the daughters of the newly-elected Pantoran Chairman, Notluwiski Papanoida were kidnapped by bounty hunters working on behalf of the Trade Federation representatives who were interested in pushing Papanoida to ally his world with the Confederacy of Independent Systems. Chuchi took it upon herself to find the chairman's missing daughters with the aid of her close friend Tano.\nThe two visited the Trade Federation vessel in orbit of Pantora to search for the kidnapped Papanoidas, with Tano masquerading as Chuchi's servant, as the Jedi were not officially allowed to be involved in Pantora's business. After meeting with some of the Federation personnel, Chuchi and Tano began investigating, sneaking into an ambassador's office. When they overheard a conversation that confirmed that Trade Federation supervisor Sib Canay had planned the blockade and kidnappings on behalf of the Confederacy and that one of the Papanoida daughters was being kept onboard, they planned a rescue. They infiltrated the detention block and located Chi Eekway Papanoida, but were soon caught. Chuchi watched on as Tano, revealing herself as a Jedi, destroyed their battle droid attackers. Chuchi then stepped in, successfully using the information on the Trade Federation's involvement to negotiate an end to Pantora's commercial isolation.\nChuchi voiced her concerns over the Enhanced Privacy Invasion Bill during the Clone Wars and met with numerous other Senators led by Philo. However, terror hit and Cad Bane led several deadly bounty hunters into the meeting hall where he planned to blackmail Chancellor Palpatine into releasing Ziro the Hutt for the Senators freedom. Chuchi was shocked at Bane's ruthless shouting and acts against Anakin Skywalker and Philo. When an unconscious Skywalker was put with the hostages, Chuchi helped Amidala care for him while cradling his head in her lap. She survived the events.\nWhen Tano was put on trial by the Republic for sedition and murder, Chuchi was one of the senators present as part of the jury.\nRiyo Chuchi was very young for her occupation as a Senator. Although she was more reserved, she was still strong-willed and was willing to stand up for what was right.\nRiyo Chuchi first appeared in \"Trespass,\" the fifteenth episode in Season One of the Star Wars: The Clone Wars. She is voiced by Jennifer Hale in The Clone Wars television series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Riyo_Chuchi",
  "/wiki/Riyo_Chuchi/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Riyo_Chuchi",
  "/wiki/Pantora",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Politics",
  "/wiki/Moon",
  "/wiki/Planet",
  "/wiki/Orto_Plutonia",
  "/wiki/Senator",
  "/wiki/Clone_Wars",
  "/wiki/Trade_Federation",
  "/wiki/Blockade_of_Pantora",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Mon_Mothma",
  "/wiki/Pantoran_Assembly",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Chairman",
  "/wiki/Chi_Cho",
  "/wiki/Anakin_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Order",
  "/wiki/Talz",
  "/wiki/Battle_of_Orto_Plutonia",
  "/wiki/Death",
  "/wiki/Speaker_of_the_Assembly",
  "/wiki/Thi-Sen",
  "/wiki/C-3PO",
  "/wiki/Coruscant",
  "/wiki/Zillo_Beast",
  "/wiki/Bounty_hunter",
  "/wiki/Ambassador",
  "/wiki/Sib_Canay",
  "/wiki/Chi_Eekway_Papanoida",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Enhanced_Privacy_Invasion_Bill",
  "/wiki/Philo",
  "/wiki/Cad_Bane",
  "/wiki/Darth_Sidious",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Trespass",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Jennifer_Hale",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/The_Zillo_Beast",
  "/wiki/The_Zillo_Beast_Strikes_Back",
  "/wiki/Senate_Spy",
  "/wiki/Lightsaber_Lost",
  "/wiki/The_Mandalore_Plot",
  "/wiki/Duchess_of_Mandalore",
  "/wiki/Sphere_of_Influence",
  "/wiki/Hostage_Crisis",
  "/wiki/Hostage_Crisis_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark_(audiobook)",
  "/wiki/Hunt_for_Ziro",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Senate_Murders",
  "/wiki/The_Wrong_Jedi",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic",
  "/wiki/Databank_(website)"
 ]
}