{
 "name": "Ro family",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Evereni"
     ]
    },
    {
     "name": "Planet(s) of origin",
     "values": [
      "Ro homeworld"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "Dalna",
      "Genetia",
      "Rystan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation",
     "values": [
      "Path of the Open Hand",
      "Nihil"
     ]
    }
   ]
  }
 ],
 "content": "The Ro family, its members known as the Ros, were a family of Everenis hailing from a homeworld that were crucial members of the Path of the Open Hand and the Nihil during the High Republic Era. Members of the family included the Eyes of the Nihil Asgar Ro and his son Marchion Ro.\nSometime before 382 BBY, the Evereni Ro family were attacked on the planet Genetia, leaving at least three family members dead. The attack was carried out by Genetian townspeople who believed that it was the family's fault the crops failed, which the family recognized the people believed due to anti-Evereni stigma. One male member of the family fought viciously to make sure the family could escape. Two female members of the Ro family, cousins Marda and Yana Ro, escaped with their mothers, who had killed a family of Theelins to ensure they would have a starship to escape in. They were saved from being forced into slavery under the Hutt Clan when the cult known as the Path of the Open Hand paid for their release. They then fled to the planet Dalna, where they became members of the Path of the Open Hand and worshipped the The Force. However, Yana's and Marda's mothers eventually left their children alone with the path. \nIn 382 BBY, the family became entwined with the Jedi and a mysterious rod, when the Path came into possession of a member of the Nameless species they called the Great Leveler. It was a powerful creature that preyed upon Force-sensitives that they revered not as a god, but as an agent of balance. Yana Ro came into possession of the Rod of Seasons, one of a set of three rods that could control the Leveler, elevating her status within the Path and redevoting her to the cause. The Path of the Open Hand then moved to use their new weapon against the Jedi, the Ro cousins leaving Dalna with them in the Path's flagship, the Gaze Electric. The Ro family eventually came into large scale conflict with the Jedi, specifically on Jedha and Dalna. The \"faithful\" among the Ros came to remember the events on Dalna as proof that the Jedi were not leading the galaxy towards balance, but instead to destruction. The Rod of Seasons and Great Leveler were much later remembered and believed by Ro descendants to be connected to bad things which had befallen their ancestors.\nEventually, a female member of the Ro family created a group of marauders and pirates known as the Nihil. She passed down control of the organization to her daughter, Shalla Ro. Shalla then passed control down to her son, Asgar Ro, who took the title of  Eye of the Nihil. Several generations of the family, including Shalla and Asgar, had also held the hyperspace prospector Mari San Tekka prisoner to utilize her ability to discover the Paths, difficult-to-traverse hyperspace routes. Asgar also operated out of the starship Gaze Electric, where he kept San Tekka. San Tekka, the Gaze Electric, and control of the Nihil, were passed down to Asgar's son Marchion Ro after his father's death.\nIn 232 BBY, Marchion orchestrated the Great Hyperspace Disaster and started to lead the Nihil in an effort against the Jedi and Republic, largely as revenge for what had happened to his family so many years prior. He came into possession of a piece of the Rod of Seasons, as well as the starship Gaze Electric which he used as his flagship. After obtaining the other piece of the rod from the Kharvashark Ruins on Vrant Tarnum, Ro traveled with it to the planet Rystan, accompanied by Force-sensitive Talortai Nihil member Udi Dis.There, he met with his cousin Kufa, who guided him to a cavern beneath the planet's icy surface. Marchion suspected most of his family would try to attack him if they ever reunited, although Kufa did not share that sentiment. Following their losses to the Jedi, most of the family had dropped their faith, yet Marchion, while speaking to Kufa, said he never abandoned their rituals. She led him to the Great Leveler, which had been frozen in ice underneath the planet by the Ros. After using Dis to prove that the creature's ability against Force sensitives, he unleashed the Leveler to use against the Jedi to fulfill his family's revenge, and murdered Kufa. \nMarchion had been raised to be the instrument of his family's revenge but, in truth, had come to believe his will was the only word in the galaxy that mattered. Possibly without even realizing it, Ro, despite sometimes allowing himself to think of revenge, was fighting for himself alone.\nThe Ro family were created for the Star Wars: The High Republic multimedia initiative and first appeared in the 2021 novel The High Republic: Light of the Jedi by Charles Soule.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Star_Wars:_The_High_Republic:_Eye_of_the_Storm",
  "/wiki/Evereni",
  "/wiki/Ro_homeworld",
  "/wiki/Dalna",
  "/wiki/Genetia",
  "/wiki/Rystan",
  "/wiki/Path_of_the_Open_Hand",
  "/wiki/Nihil",
  "/wiki/High_Republic_Era",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Asgar_Ro",
  "/wiki/Marchion_Ro",
  "/wiki/382_BBY",
  "/wiki/Attack_on_the_Ro_family",
  "/wiki/Planet",
  "/wiki/Genetian",
  "/wiki/Marda_Ro%27s_sire",
  "/wiki/Cousin",
  "/wiki/Marda_Ro",
  "/wiki/Yana_Ro",
  "/wiki/Theelin",
  "/wiki/Slavery",
  "/wiki/Hutt_Clan",
  "/wiki/Religion",
  "/wiki/The_Force",
  "/wiki/Yana_Ro%27s_mother",
  "/wiki/Marda_Ro%27s_mother",
  "/wiki/Jedi",
  "/wiki/Nameless_control_rods",
  "/wiki/Nameless",
  "/wiki/Great_Leveler",
  "/wiki/Force-sensitive",
  "/wiki/God",
  "/wiki/Rod_of_Seasons",
  "/wiki/Gaze_Electric",
  "/wiki/Jedha",
  "/wiki/Shalla_Ro%27s_mother",
  "/wiki/Pirate",
  "/wiki/Shalla_Ro",
  "/wiki/Hyperspace",
  "/wiki/Prospector",
  "/wiki/Mari_San_Tekka",
  "/wiki/Path",
  "/wiki/Hyperspace_route",
  "/wiki/232_BBY",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Kharvashark_Ruins",
  "/wiki/Vrant_Tarnum",
  "/wiki/Talortai",
  "/wiki/Udi_Dis",
  "/wiki/Kufa",
  "/wiki/Yana_Ro%27s_sire",
  "/wiki/Asgar_Ro%27s_grandfather",
  "/wiki/Asgar_Ro%27s_father",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Star_Wars_multimedia_projects",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Charles_Soule",
  "/wiki/The_High_Republic:_Path_of_Deceit",
  "/wiki/The_High_Republic:_Path_of_Vengeance",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_The_Gaze_Electric",
  "/wiki/Star_Wars_Adventures_(2020)_6",
  "/wiki/The_High_Republic_Adventures_(2021)_1",
  "/wiki/The_High_Republic_Adventures_(2021)_2",
  "/wiki/The_High_Republic_Adventures_(2021)_3",
  "/wiki/The_High_Republic_Adventures_(2021)_4",
  "/wiki/The_High_Republic_Adventures_(2021)_5",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic_Adventures_Free_Comic_Book_Day_2021",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_10",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_Haul",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic:_Mission_to_Disaster_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Starlight:_Shadows_Remain",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_Midnight_Horizon_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_1",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/Halcyon_Legacy_1",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/StarWars.com",
  "/wiki/Template:LightOfTheJediDate",
  "/wiki/Standard_year",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}