{
 "name": "Roach",
 "display_name": "Roach",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Haidoral Prime"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "61st Mobile Infantry",
      "61st Mobile Infantry"
     ]
    }
   ]
  }
 ],
 "content": "Roach was a human female and a member of the Alliance to Restore the Republic's 61st Mobile Infantry, better known as Twilight Company. She was recruited by First Sergeant Hazram Namir and Quartermaster Hober on her home planet of Haidoral Prime in 3 ABY. Roach had spent six months in an Imperial detention center previously. Namir took a liking to her when she became part of the company and also was able to determine that Roach was a recovering spice addict.\nRoach served in a squad with Namir, Gadren, and Brand during the Coyerti campaign. Namir, Gadren, and Charmer helped her through her first experiences in combat. She had struggles with her spice addiction but was able to survive the battle despite it and Imperial bioweapons. After the Battle of Hoth and an attack on the Thunderstrike in the Elochar sector, Roach was the only recruit from Haidoral Prime that did not consider deserting. She later aided the company's operations to carve a path to attack the shipyards of Kuat. When the company became stranded on Sullust, Roach was killed during the Siege of Inyusu Tor.\nRoach joined Twilight Company with a degree of commitment, diligently reading the White Book, although she soon learned that Twilight soldiers did not care about such regulations. She spoke in a quiet tone. She was twitchy and constantly on edge, partly due to the fact that she was recovering from spice addiction. Although she lied about being able to use a blaster, she learned quickly and became a useful soldier. The veteran soldiers of Twilight Company took a quick liking to her, even inviting her to the Thunderstrike's clubhouse only a short time after she was recruited despite most new soldiers needing several months before they were invited.\nRoach appeared in the 2015 canon novel Battlefront: Twilight Company, written by Alexander Freed. Freed explained, in an interview with Daily Dot, that he had created Roach as a means to show the process of training and integration in Twilight Company and be a reminder that all the regular Twilight personnel had lives before they joined the company. He also claimed he found Roach fun to write, the character having a level of \"childish joy\" which proved a change of pace to prompt reactions from others.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Haidoral_Prime",
  "/wiki/3_ABY",
  "/wiki/Sullust",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Company",
  "/wiki/First_Sergeant",
  "/wiki/Hazram_Namir",
  "/wiki/Quartermaster",
  "/wiki/Hober",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/Spice",
  "/wiki/Gadren",
  "/wiki/Brand",
  "/wiki/Coyerti_campaign",
  "/wiki/Charmer",
  "/wiki/Bioweapon",
  "/wiki/Battle_of_Hoth",
  "/wiki/Infiltration_of_the_Thunderstrike",
  "/wiki/Thunderstrike",
  "/wiki/Elochar_sector",
  "/wiki/Operation_Ringbreaker",
  "/wiki/Shipyard",
  "/wiki/Kuat",
  "/wiki/Death",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/White_Book",
  "/wiki/Blaster",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Roach",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/November_3",
  "/wiki/September_3",
  "/wiki/2017"
 ]
}