{
 "name": "Roah Palladane",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chelloa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Miners"
     ]
    }
   ]
  }
 ],
 "content": "Roah Palladane was a female Human who was the wife of the former Jedi Knight Gorlan Palladane, the leader of the miners in Jenith on the Outer Rim planet of Chelloa during the Republic Dark Age. She and Gorlan had two children, Aneese and Jalen. In 1032 BBY, following the failed Jedi Operation Influx, she and her husband harbored the female Jedi Kerra Holt. In retaliation, the Sith Lord Daiman's Correctors arrested Gorlan, taking him to Daiman's alpine compound, where he was beaten and tortured.\nWhen he confessed to his communications and collaboration with the Jedi, Daiman ceased torturing her husband but ordered his troops to destroy Jenith and to round up the leaders of the Chelloan communities. During the ensuing crackdown, two of Daiman's Sith troopers invaded Roah's house, seeking to arrest her and her family. However, she was rescued by Kerra Holt, who killed the Sith troopers. Roah revealed that her husband had handed himself over to Daiman as a means of stopping Odion—Daiman's rival Sith Lord brother—from destroying Chelloa by telling him there was no baradium left. His previous transmission to the Jedi had also been intercepted by Odion.\nWhen Holt revealed her intentions to kill Daiman, Roah argued that victory over her Sith adversaries would do little good for Chelloa. This prompted Holt to shift from her goal of eliminating the Sith Lords to Vannar Treece's original goals of evacuating Chelloa's population.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chelloa",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Gorlan_Palladane",
  "/wiki/Jenith",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Republic_Dark_Age",
  "/wiki/Aneese_Palladane",
  "/wiki/Jalen_Palladane",
  "/wiki/1032_BBY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Operation_Influx",
  "/wiki/Kerra_Holt",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Daiman",
  "/wiki/Corrector",
  "/wiki/Sith_trooper_(New_Sith_Wars)",
  "/wiki/Odion",
  "/wiki/Baradium/Legends",
  "/wiki/Vannar_Treece",
  "/wiki/Knight_Errant:_Aflame_4",
  "/wiki/Knight_Errant:_Aflame_5"
 ]
}