{
 "name": "Roan_Fel",
 "display_name": "Roan Fel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "138 ABY",
      "Jagged Fel",
      "over Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black and white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fel dynasty",
      "Fel Empire",
      "Empire-in-exileImperial Knights",
      "Imperial Knights"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Antares Draco"
     ]
    }
   ]
  }
 ],
 "content": "Roan Fel was a Human male who served as the third Galactic Emperor of the galaxy under the Fel dynasty to rule the Fel Empire. Roan was the grandson of Jagged Fel, the head of the Moff Council following the Second Galactic Civil War. He was also an Imperial Knight, part of a Force-sensitive organization that rejected the dark side.\nFollowing the Sith–Imperial War, he took control of the Fel Empire on Coruscant; however, he was soon deposed by Darth Krayt, who founded his own Sith Empire on Coruscant. Fel took control of the loyalist world of Bastion seven years later, and in the Second Imperial Civil War, he led other loyalists as the head of the Empire-in-exile, which opposed Krayt's rule. Fel talked of an alliance with Gar Stazi, the leader of the Galactic Alliance Remnant, as well as the fugitive members of the New Jedi Order. However, during the final battle above Coruscant, Fel gave into the dark side when he attempted to use a Sith bioweapon to kill all life on the planet, forcing Antares Draco to kill him. In the wake of the allies' subsequent victory over the Sith, Fel was later mourned during a solemn ceremony on the reclaimed Coruscant. However, the details of his death were covered up for political reasons.\nRoan Fel was the grandson of Jagged Fel, who led the Imperial Remnant's Moff Council in the time following the Second Galactic Civil War. During his youth, the heir of the resurrected Galactic Empire was trained as an Imperial Knight under his father's rule alongside fellow apprentice Treis Sinde. The two developed a close friendship, and Fel was known to rely greatly on Sinde's advice and wisdom. After his training ended and his father's death, Fel became Emperor and started to follow in the footsteps of his grandfather by continuing the Victory Without War program. A capable politician and a skilled military leader, Fel didn't underestimate the ambitions of the Moff Council and continuously played them against each other to maintain his base of power.\nAt some point during his reign, Fel married a Hapan woman named Elliah and he fathered a daughter, Marasiah. However, Elliah was at some point killed by Eshkar Niin, one of Fel's Imperial Knights and the only knight to turn his back on his vows. Antares Draco, who had studied under both Niin and Fel, had attempted to stop his former master, and struck him down when he failed. Niin, however, had actually faked defeat and fled to join the One Sith. Fel eventually made Draco second-in-command of the Imperial Knights.\nSometime before 127 ABY, the Galactic Alliance agreed to the Ossus Project, an attempt by the New Jedi Order to use Yuuzhan Vong terraforming technology to undo damage the Yuuzhan Vong had done to a number of worlds during their war with the galaxy. At first, the project was going smoothly. But it was soon sabotaged by the new Sith Order. Not knowing this, many people cast the blame on the Vong, believing them to be renewing their crusade against the galaxy. The Alliance, at the Jedi's urging, defended the Vong, which caused many Alliance worlds to stop supporting it. Fel met with Jedi Master Kol Skywalker and promised to stay the Empire's hand while Skywalker tried to prove that the project was sabotaged. But the Moff Council, seeing the opportunity to re-establish Imperial control over the galaxy, invoked the Treaty of Anaxes and declared war on a weakened Galactic Alliance.\nRoan Fel, unable to ignore the Moff Council's power to declare war, reluctantly went to war with the support of the new Sith Order. Unlike Darth Krayt and some on the Moff Council, the Emperor did not view the war as the means to achieve a grand ideological agenda. Rather, he saw it as an unfortunate political necessity, the best course of action for the Empire in a troubled galaxy. Though allied with the Sith, Fel had no desire to see the Jedi exterminated. He even forbade his Imperial Knights from fighting in the war.\nThree years later, the war was over. The Alliance fell with the defeat at Caamas and the conquest of Coruscant. It was only as the war was winding down that he realized that the Empire had been manipulated into the war by the new Sith Order and their ally on the Moff Council, Nyna Calixte. When the war ended, Fel asked the Jedi to surrender, and some of them did, but the majority of the Order refused. Fel ordered that the Jedi be allowed to return to Ossus, and called for a diplomatic mission once they had done so. But Moff Rulf Yage and Darth Nihl undermined his orders and attacked the Temple. The Massacre at Ossus, as it came to be known, wiped out half of the Jedi Order.\nFel seemed to have realized at some point that Darth Krayt and Grand Admiral Morlish Veed were plotting betrayal and, sometime after the war ended, made plans to arrest Veed. It was after this that Calixte approached Fel and told him about Krayt's intention to assassinate him at an upcoming meeting and advised him to escape. Fel realized that Calixte was telling the truth because if he died, Calixte would be useless to the Sith and would also die. So he arranged for a double to appear at the meeting instead of him. All while this was happening, he and Antares made their way through the sewers, slashing through droids before escaping. Fel escaped to plot his retaliation against Krayt and the Empire he had seized control of.\nAround 137 ABY, Fel returned to Bastion to retake the planet. Over the years, loyalist forces had gathered there, awaiting the return of their Emperor. With Antares Draco at his side, Fel took control of the planet, knowing that Krayt would be wary to launch a frontal assault on the heavily fortified planet.\nHowever, his daughter and heir, Princess Marasiah Fel, was soon to be caught up in the Sith plot. Darth Talon, one of Krayt's Hands, had been sent after the Princess in the hope that she could chase her into the arms of her father, her true quarry.\nEven though his daughter was a fugitive from the Sith, Emperor Fel nonetheless ordered his Imperial Knights not to search for her, as the Sith would likely use her to get to him. However, Antares Draco searched for the Princess, finding her in Vendaxa, where the Sith staged an attack in which Princess Fel nearly died, though she was healed by Cade Skywalker. Afterward, Princess Fel was taken to Bastion, where she persuaded her father to allow Skywalker to leave. Emperor Fel also reprimanded Draco and Ganner Krieg for disobeying his orders. However, Emperor Fel, ever the astute politician, announced that he would retroactively approve the rescue mission to prevent his authority from being undermined. He also informed Draco that he would not be able to marry Princess Marasiah.\nAfter the return of his daughter, Fel realized the Sith would now know that he had taken Bastion, meaning it would be difficult to bring forces loyal to him to the planet. Realizing he needed more help, he decided to form a desperate alliance with the Galactic Alliance Remnant, the Empire's oldest rivals for the past century and a half. He sent Captain Mingo Bovark to negotiate an alliance with Admiral Gar Stazi on The Wheel. Meanwhile, Moff Nyna Calixte , was trying to keep the Sith from capturing her son, Cade Skywalker. During this, she found out about the meeting on the Wheel. With the help of a Sith agent named Jor Tolin, Calixte was able to override the guns on Bovark's shuttle and have them fire on Stazi's shuttle, making it appear to be a trap set by Fel. The sabotage worked, and both Stazi and Bovark left the station. Fel's forces continued to stand alone.\nBy this time, the Sith knew that Fel had retaken Bastion. They also knew that launching a frontal assault on the planet would deal a crippling blow to their own forces. However, Darth Maladi found another way: assassinate Fel.\nLady Maladi dispatched Darth Kruhl to Bastion to kill Fel. Using the Pellaeon-class Star Destroyer Dauntless as bait, Kruhl slipped in and found Fel meditating in the Pellaeon Gardens. But Fel had sensed Kruhl land on the planet, and quickly reacted with his lightsaber. After a brief duel, Fel killed Kruhl with a blaster. Fel then had the entire crew of the Dauntless, except for Governor Vikar Dorn, executed to send a message to Krayt.\nBy this time, Moff Rulf Yage believed that Fel was—and had been for seven years—hiding in the Chiss Ascendancy. However, the Chiss Moff Fehlaaur'aitel'loro knew this allegation had not been proven.\nFel later sent several Imperial Knights to Mon Calamari to sabotage the Imperious-class Star Destroyer  that was being constructed there. They planted three sets of bombs on the Star Destroyer and rigged them to go off when the ship's weapons were activated. But when Admiral Stazi stole it in the Battle of Mon Calamari, the knights were able to avert disaster by informing Stazi of the bombs and disarming it. Stazi, impressed that Fel's forces would try to help him, then told Sigel Dare to contact Fel and tell him that he was willing to once again negotiate joining forces with him against the Sith.\nAt the time, Emperor Fel also received information of Cade Skywalker's escape from the Temple of the Sith. He feared Skywalker could have revealed information to Darth Krayt. He had even more regrets over allowing Skywalker to leave Bastion, stating he should have had him \"enlisted, incarcerated, or embalmed…\" He sent Draco, Krieg and Sia on a mission to track him down.\nWith the help of an undercover Imperial Knight, Cade was tracked to the Hidden Temple. There, Sia told the Council about her father's innocence in both the Sith–Imperial War and the Massacre at Ossus. The Council decided to consider allying with Roan Fel after hearing this.\nMaster Treis Sinde had survived, and joined the Mon Calamari Rangers in their fight against the Sith's genocide. When he contacted Emperor Fel, Fel told him to return to Bastion. Fel said the Mon Calamari would never ally with the Empire no matter what Sinde did, and Sinde agreed to return to Bastion.\nBut Sinde helped the Rangers defeat a Sith Leviathan that had been created to further the genocide. When he contacted Fel again, Fel once again told him to return to Bastion. Sinde asked when a transport would arrive to get him, and Fel said there wouldn't be one since he couldn't spare one. Sinde then smugly told Fel that without outside help, getting off Dac would be impossible. Fel, remembering how stubborn Sinde was, told him to return to Bastion when it was difficult rather than impossible.\nCade Skywalker proposed an assassination mission to the Jedi Council to get rid of the Dark Lord of the Sith. His theory, having seen that the Sith were not as united as they believed, was that with Krayt dead the other Sith would turn on each other just as they always had throughout history, and everything they had done would be undone. While the Jedi Council chose not to go through with this, Princess Fel told Draco, Krieg, and Rae to go with Cade on his mission.\nWhile on route, the party came across a Jedi Master of the old order named Celeste Morne. Morne had been plagued by the spirit of the Sith Karness Muur through the Muur Talisman for several thousand years. Morne agreed to join them after witnessing Cade's incredible healing powers.\nAfter the Imperial garrison at Had Abbadon fell to the anti-Sith strike force, Master Draco reported about the Talisman and its powers to Emperor Fel. Fel was intrigued by the notion of turning his enemies into monsters under his control, and ordered Draco to bring him Morne or the Talisman after Krayt had been assassinated. This caused both Ganner Krieg and Azlyn Rae's confidence in Fel to be shaken, with Krieg reminding Draco that Imperial Knights owe their allegiance to the Emperor only as long as he serves the light side of the Force, and should he fall to the dark side it was the Imperial Knights' duty to turn him back to the light or remove him from power.\nKrayt took the bait, and this resulted in a duel that saw Krayt killed by his most trusted advisor and the Imperial Knights failing to secure the talisman before it was destroyed by Cade Skywalker himself.\nDraco and Krieg reported back to Fel. The Emperor wasn't pleased with them: they weren't sure if Krayt was dead and they had failed to secure the Talisman. While Krieg argued the Talisman was too evil to use, Fel claimed nothing was too evil to be used against the Sith, especially against the armies who serve them. Then, he sent Krieg to retrieve Azlyn Rae, who had been taken to Kiffex by Skywalker and his crew, and Sigel Dare to retrieve Treis Sinde and ordered Draco to find out if Krayt was really dead. Fel couldn't risk trying to take back his throne without being absolutely sure.\nThe negotiations with the Alliance Remnant proved to be a success, resulting in an anti-Sith coalition between the Empire-in-Exile and Galactic Alliance Remnant.\nOne of the first actions of this new coalition was to attack the Sith loyal fleet at Ralltiir. The objectives of this attack was to seize the fleet and, with its capture, force the Sith to stretch their forces thinner. While the initial attack succeeded in getting the Sith Admiral to surrender, things quickly fell apart. One Sith ship refused to surrender, and Admiral Edouard Fenel, the commander of Fel's Bastion Second Fleet, ordered the ship be destroyed. This prompted the rest of the Coruscant fleet to self-destruct rather than accept capture. Furthermore, Stazi was forced to defend the surviving Sith-loyal crews and ships from Fenel's ruthless decision to execute them all.\nFel talked with Stazi after the battle. Fel told Stazi that they were not equals, since he was Emperor and Stazi was an Admiral. Stazi retorted by saying he was Head of State of the Alliance until a proper election could be held, making him Fel's equal, and told him they needed to coordinate their plans better. Fel seemed pleased with Stazi's words, and agreed with what he said. He also apologized for Fenel's ruthlessness.\nFel and his Empire had appointed a secret meeting with members of the New Jedi Order remnants near Agamar. However, Morlish Veed planned to ambush them, using the First Sith Imperial Strikeforce led by Moffs Rulf Yage and Fehlaaur'aitel'loro aboard the War Hammer. Their objective was to capture the deposed Emperor, so that he would face trial and execution, ending his rebellion.\nFel, accompanied by his daughter Marasiah and Imperial Knights Treis Sinde, Antares Draco, Ganner Krieg and Sigel Dare, traveled to Agamar on the Star Destroyer Dauntless. During a sparring session with Master Sinde, the old Knight asked his emperor why he had really called him back. Fel revealed that he feared that the past seven years of fighting the Sith had corrupted him. He wondered if the use of the dark side to free the galaxy from tyranny was acceptable. Sinde told him that it wasn't as Fel would just turn into another Darth Krayt. He also reminded his old friend that all the Imperial Knights, including his daughter, had sworn to kill him if he turned to the dark side. Fel also told Sinde that, if he wasn't so contrary and free-minded, he would have named him the leader of the Imperial Knights. Sinde told Fel that he didn't want the job: he was too busy taking care of Fel himself.\nFel and his party later landed on Agamar to await the Jedi. Unknown to him, the Sith-Imperial strike force had also arrived and was preparing to attack. However, he was saved by a group of hidden Knights, and fled into his shuttle Defender One, but lost his daughter to the Sith. He jumped away, avoiding capture by the Sith-led Imperials. The Dauntless held off the strike force long enough for the shuttle to escape to hyperspace, but the Star Destroyer was then destroyed by the War Hammer.\nShortly after the events on Agamar Fel gave his permission to Oron Jaeger to assist Admiral Gar Stazi with the Evacuation of Dac. Shortly after arriving back on Bastion, The Emperor was informed by Azlyn Rae and Rasi Tuum that his daughter was being taken to Coruscant. He later found out from his contact on Coruscant that Marasiah was being taken to Korriban. Fel then informed his Knights of the situation. He told Draco that Sia knew all of the Imperial codes as well as the location of the Jedi's Hidden Temple and that he had three hours to formulate a rescue plan and that if she could not be rescued she must be killed. Draco successfully rescued the Princess but was himself captured and presumed dead in the process. Shortly after this the Emperor called a meeting of his Knights and Shado Vao, to honor those fallen at Agamar as well as Antares Draco.\nAfter Krayt returned to power and began a renewed campaign to crush all resistance to his empire, Fel was informed by his brother-in-law  that their forces had captured Darth Maladi. Maladi had recently been defeated by Cade Skywalker and was eager for revenge against him. Maladi made Fel an offer: in exchange for Cade's head, she would create a Sith toxin for him known as Omega Red which could kill any species on a planet. Although Chalk thought such a weapon could be used on Korriban, Fel refused since such an action would make him and his empire pariahs to the galaxy's people.\nLater on Antares Draco was recovered by Cade Skywalker and his crew. Draco then revealed the Sith had tricked him into revealing the location of the Hidden Temple on Taivas. After Cade came up with a plan to defend the Temple and cripple the Sith, Fel committed his forces to help defend the planet under the command of Imperial Knight Treis Sinde.\nLater when Krayt released his Sith Troopers on Taivas, the forces loyal to Fel, and Gar Stazi, fled for Bastion along with the Jedi. The defeat at the hidden temple sent Fel over the edge: Fel went to Darth Maladi and forced her to create her Omega Red to fight the Sith. He also decided the forces opposed to Darth Krayt needed to make a surprise attack against Coruscant before the Sith could attack Bastion itself.\nThe battle was turned to better odds for the alliance with sabotage, but even then, they were losing as the Annihilators pounded their ships. Fel eventually decided to acquire Omega Red from Maladi so he could use it against Coruscant, unaware that the Sith were immune. Having become too immersed in the dark side to see right from wrong, Fel didn't care about the innocents planetside, whom he considered collaborators with the Sith, nor his allies. Draco protested as Fel prepared the toxin for drop off, and was then confronted by his daughter Sia and Treis Sinde, reminding him this was evil. The Emperor telekinetically slammed the pair into the wall with massive force, incapacitating them, and ordered Draco to launch the toxin. Draco, however, realized Fel's actions were dark side and reminded Fel that his oath as an Imperial Knight was to return the Emperor to the light or kill him should he fall to the dark side. Fel, enraged, attacked Draco.\nThe two dueled as Draco felt Krayt die by Skywalker's hand, but Fel refused to believe someone else had killed him and tried to set off the toxin, declaring he alone would kill the Sith. Draco was forced to strike Fel when he went to launch the toxin, killing him and making his daughter Empress. His funeral left out the details of his fall to the dark side and praised his efforts to fight the Sith. In the aftermath of Darth Krayt's Sith Empire's destruction, a Galactic Federation Triumvirate was formed as the new government of a unified galaxy. Alongside Admiral Stazi and Master K'Kruhk, Empress Marasiah Fel became one of the three new triumvirs.\nRoan Fel was a strong man who passionately believed in order and ruled with a firm hand, though he was not a tyrant. He was generally regarded as a relatively benevolent ruler and his reign saw far less oppression and abuse of power as Palpatine had when he ruled the Empire. However, to maintain his authority he regularly played the Moff Council against each other, which resulted in them allying with the One Sith and inadvertently led to his own exile. During his reign he was a strong supporter of the Imperial Mission and the Jedi, even those not affiliated with his own Imperial Knights. Fel was also known to be merciful, as he allowed both the Jedi Order and the remnants of the Galactic Alliance to exist.\nHowever, there was a darker side to Roan Fel. After being usurped, he became willing to do whatever it took to reclaim the Imperial throne, including using Sith magic against his enemies . He also executed traitors to his empire, such as when he had the entire crew of the Dauntless slaughtered to send a message to the Sith.\nHowever, Roan Fel was aware that he was slipping onto the path that Krayt had followed and called his old friend Treis Sinde to his side to give him advice on how to deal with this during the negotiations with the Jedi. In the end, he fell to the dark side, refusing to see that Krayt was dead or that what he was doing was evil, believing that only he could save the galaxy from the Sith, and was slain by Draco.\nA fully trained Imperial Knight, Roan Fel was an adept of the Force and a skilled lightsaber combatant. Fel was very talented at using the Force sense ability, to the point that he was able to feel the dark presence of Darth Kruhl the moment he landed on Bastion. This allowed him to react quickly to Kruhl's attempt on his life, fighting on par with the Sith Lord in a vicious lightsaber duel, during which he was able to deflect barrages of Force lightning with the blade of his lightsaber.\nIn addition to his considerable talents with a lightsaber, Fel demonstrated a proficiency in hand-to-hand combat. However, perhaps the most important of his talents was his preparedness. By anticipating his enemies, Fel was able to prepare himself for any number of situations, such as Kruhl's attempt on his life, by arming himself with a hold out blaster and cortosis gauntlets rather than just a lightsaber. These additions to his repertoire served as a surprise to Fel's adversaries, granting him a considerable advantage in combat.\nIn a post on the Jedi Council Forums, Jan Duursema agreed with a poster's assessment of Roan Fel's age being \"mid fifties\". Though non-canonical, this would mean for the character to be born around 82 ABY.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Fel_dynasty",
  "/wiki/Roan_(disambiguation)",
  "/wiki/Jagged_Fel",
  "/wiki/Fel_II",
  "/wiki/138_ABY",
  "/wiki/Jagged_Fel_(starship)",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Empire-in-exile",
  "/wiki/Imperial_Knight",
  "/wiki/Antares_Draco",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Darth_Krayt",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Planet/Legends",
  "/wiki/Bastion/Legends",
  "/wiki/137_ABY",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Gar_Stazi",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/New_Jedi_Order",
  "/wiki/Battle_of_Coruscant_(Second_Imperial_Civil_War)",
  "/wiki/Omega_Red",
  "/wiki/Funeral_of_Roan_Fel",
  "/wiki/Imperial_Remnant",
  "/wiki/Time/Legends",
  "/wiki/Treis_Sinde",
  "/wiki/Victory_Without_War",
  "/wiki/Elliah_Fel",
  "/wiki/Marasiah_Fel",
  "/wiki/Darth_Havok",
  "/wiki/One_Sith",
  "/wiki/127_ABY",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Ossus_Project",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kol_Skywalker",
  "/wiki/Treaty_of_Anaxes",
  "/wiki/Sith/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Battle_of_Caamas",
  "/wiki/Caamas/Legends",
  "/wiki/Battle_of_Coruscant_(Sith%E2%80%93Imperial_War)",
  "/wiki/Morrigan_Corde",
  "/wiki/Moff/Legends",
  "/wiki/Rulf_Yage",
  "/wiki/Darth_Nihl",
  "/wiki/Massacre_at_Ossus",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Morlish_Veed",
  "/wiki/Roan_Fel%27s_double",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Stormtrooper/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Fall_of_Bastion",
  "/wiki/Prince/Legends",
  "/wiki/Darth_Talon",
  "/wiki/Hand_(One_Sith)",
  "/wiki/Vendaxa/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Ganner_Krieg",
  "/wiki/Captain/Legends",
  "/wiki/Mingo_Bovark",
  "/wiki/Admiral/Legends",
  "/wiki/Darth_Kruhl",
  "/wiki/The_Wheel/Legends",
  "/wiki/Ryler_Dorant",
  "/wiki/Darth_Maladi",
  "/wiki/Duel_on_Bastion",
  "/wiki/Pellaeon-class_Star_Destroyer",
  "/wiki/Dauntless_(Pellaeon-class)",
  "/wiki/Pellaeon_Gardens",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Vikar_Dorn",
  "/wiki/Dauntless_crew_killing",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Fehlaaur%27aitel%27loro",
  "/wiki/Dac",
  "/wiki/Imperious-class_Star_Destroyer",
  "/wiki/Alliance_(Imperious-class)",
  "/wiki/Battle_of_Mon_Calamari_(Second_Imperial_Civil_War)",
  "/wiki/Sigel_Dare",
  "/wiki/Skirmish_at_the_Temple_of_the_Sith",
  "/wiki/Temple_of_the_Sith",
  "/wiki/Azlyn_Rae",
  "/wiki/Hidden_Temple_(Sith%E2%80%93Imperial_War)",
  "/wiki/Mon_Calamari_Rangers",
  "/wiki/Sea_Leviathan",
  "/wiki/Celeste_Morne",
  "/wiki/Muur_Talisman",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Karness_Muur",
  "/wiki/Had_Abbadon/Legends",
  "/wiki/Mission_to_Had_Abbadon",
  "/wiki/Rakghoul",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Battle_on_Had_Abbadon",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Kiffex/Legends",
  "/wiki/Battle_of_Ralltiir_(Second_Imperial_Civil_War)",
  "/wiki/Coruscant_Third_Fleet",
  "/wiki/Ralltiir/Legends",
  "/wiki/Peto_Kelsan",
  "/wiki/Edouard_Fenel",
  "/wiki/Bastion_Second_Fleet",
  "/wiki/Head_of_State/Legends",
  "/wiki/Agamar/Legends",
  "/wiki/Operation:_Thunderstroke",
  "/wiki/First_Sith_Imperial_Strikeforce",
  "/wiki/War_Hammer",
  "/wiki/Defender_One",
  "/wiki/Hyperspace/Legends",
  "/wiki/Oron_Jaeger",
  "/wiki/Evacuation_of_Dac",
  "/wiki/Rasi_Tuum",
  "/wiki/Korriban",
  "/wiki/Mission_to_Korriban_(Second_Imperial_Civil_War)",
  "/wiki/Shado_Vao",
  "/wiki/Telekinesis/Legends",
  "/wiki/Shiak",
  "/wiki/Galactic_Federation_Triumvirate",
  "/wiki/Triumvirate_(Galactic_Alliance)",
  "/wiki/Imperial_Mission",
  "/wiki/The_Force/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Jedi_Council_Forums",
  "/wiki/Category:Images_of_Roan_Fel",
  "/wiki/Legacy_(2006)_8",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Legacy_(2006)_2",
  "/wiki/Legacy_(2006)_3",
  "/wiki/Legacy_(2006)_4",
  "/wiki/Legacy_(2006)_5",
  "/wiki/Legacy_(2006)_6",
  "/wiki/Legacy_(2006)_7",
  "/wiki/Legacy_(2006)_9",
  "/wiki/Legacy_(2006)_11",
  "/wiki/Legacy_(2006)_13",
  "/wiki/Legacy_(2006)_15",
  "/wiki/Legacy_(2006)_16",
  "/wiki/Legacy_(2006)_18",
  "/wiki/Legacy_(2006)_22",
  "/wiki/Legacy_(2006)_23",
  "/wiki/Legacy_(2006)_24",
  "/wiki/Star_Wars:_Legacy:_The_Hidden_Temple",
  "/wiki/Legacy_(2006)_28",
  "/wiki/Legacy_(2006)_29",
  "/wiki/Legacy_(2006)_30",
  "/wiki/Legacy_(2006)_31",
  "/wiki/Legacy_(2006)_32",
  "/wiki/Legacy_(2006)_33",
  "/wiki/Legacy_(2006)_35",
  "/wiki/Legacy_(2006)_36",
  "/wiki/Legacy_(2006)_38",
  "/wiki/Legacy_(2006)_39",
  "/wiki/Legacy_(2006)_42",
  "/wiki/Star_Wars:_Legacy:_Monster",
  "/wiki/Legacy_(2006)_47",
  "/wiki/Legacy_(2006)_48",
  "/wiki/Legacy_(2006)_49",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Legacy%E2%80%94War_2",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Legacy%E2%80%94War_4",
  "/wiki/Legacy%E2%80%94War_5",
  "/wiki/Legacy%E2%80%94War_6",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Star_Wars_Insider",
  "/wiki/Legacies_of_Future_Orders",
  "/wiki/Star_Wars_Insider_88",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Star_Wars:_Panel_to_Panel_Volume_2:_Expanding_the_Universe",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_96",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Starships_of_the_Galaxy_(Saga_Edition)",
  "/wiki/Legacy_(2006)_0%C2%BD",
  "/wiki/Star_Wars_Miniatures",
  "/wiki/Legacy_of_the_Force_(Star_Wars_Miniatures)",
  "/wiki/Threats_of_the_Galaxy",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_101",
  "/wiki/Wizards.com",
  "/wiki/Behind_the_Threat:_The_Sith_(Part_5):_Antiheroes",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Star_Wars_Insider_105",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider_107",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/Star_Wars_Insider_118",
  "/wiki/Star_Wars_Insider_131",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/The_Essential_Atlas",
  "/wiki/Legendary_Authors",
  "/wiki/Star_Wars_Insider_154",
  "/wiki/Legacy_(2006)_46",
  "/wiki/Legacy_(2006)_50",
  "/wiki/Jan_Duursema",
  "/wiki/March_23",
  "/wiki/2013",
  "/wiki/130_ABY"
 ]
}