{
 "name": "Roan Shryne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Weytta"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 59 BBY",
      "Weytta"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi OrderOld Guard",
      "Old Guard",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Nat-Sem"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Roan Shryne's first Padawan",
      "Roan Shryne's second Padawan"
     ]
    }
   ]
  }
 ],
 "content": "Roan Shryne was a Human male Jedi Master who served the Jedi Order during the Clone Wars and briefly avoided Order 66. He wielded a blue lightsaber.\nRoan was born on Weytta to Jen and Jula Shryne. Against Jula's will, Jen surrendered the child to the Jedi when Roan was just over three years of age. This action resulted in Jula leaving Jen.\nRoan first faced serious combat as the Padawan of Jedi Master Nat-Sem around 48 BBY. During his early training at the Jedi Temple, Roan demonstrated a talent for being able to sense the Force in others and was encouraged to pursue a course that would have landed him in the Jedi Acquisition Division. When he attained the rank of Jedi Knight, Roan was offered a position within the Division, which took Force-sensitive children to the Jedi Temple, but he refused to do so because part of him was uncomfortable with taking children from their parents. Shryne came to be one of what many Jedi referred to as the \"Old Guard\", Jedi considered likely to be put on the Jedi High Council. Shryne, however, never attained that status.\nShortly before the Clone Wars, Roan went on the first of many missions to Murkhana, a world not far from his homeworld Weytta. He sought to bring down the crime lord Cash Garrulan. Instead, Garrulan became a Jedi informant and developed something of a friendship with Roan.\nHe would infiltrate this Outer Rim world many more times over the course of the Clone Wars, fatefully returning there in 19 BBY to fight alongside Commander Salvo hours before the end of the Clone Wars and prior to the execution of Order 66.\nRoan was part of the Jedi strike team at the First Battle of Geonosis in 22 BBY. Roan witnessed the death of his former mentor Nat-Sem as well as his first Padawan. His second Padawan was killed in the Battle of Manari in 19.5 BBY. By the end of the Clone Wars, Roan had lost his faith in the Force and the Jedi High Council. A sarcastic and bitter man, his connection to the Force became weak, and he struggled to use even elementary powers, getting by on experience and skill alone.\nRoan fought in the Battle of Deko Neimoidia alongside the 22nd Air Combat Wing, including the Republic commandos of Ion Team. He earned the respect of Captain Climber through the course of battling CIS enemies in various campaigns together. Roan Shryne was one of six Jedi who participated in the Battle of Murkhana, part of the Outer Rim Sieges in 19 BBY, while the Galactic Republic was searching for Grievous following his \"failed\" abduction of Palpatine. In the midst of the battle, Shryne saved Captain Climber's life while they were performing reconnaissance of a key medcenter that was housing a targeted shield generator. Climber later returned the favor by deliberately misdirecting an ambush per Commander Salvo's orders that would have otherwise killed Masters Roan Shryne, Bol Chatak, and Padawan Olee Starstone, thus sparing them from the initial onslaught of Order 66.\nThe trio deliberately allowed themselves to be captured by the Galactic Empire when they were disguised as CIS mercenaries. However, they encountered Darth Vader before they could leave Murkhana. In a duel instigated by Bol Chatak, Vader revealed his overwhelming strength, as he brought Chatak to her knees before decapitating her.\nFortunately for Shryne and Starstone, Vader was distracted, and they managed to escape Imperial custody due to Shryne's use of a mind trick on an unsuspecting clone trooper. With assistance and a fair amount of deception by Cash Garrulan, the Jedi managed to escape Murkhana aboard a CloakShape fighter.\nThey eventually rendezvoused with the Drunk Dancer, captained by Shryne's biological mother, Jula Shryne. Starstone, rather than Shryne, took the lead in gathering together survivors of the Great Jedi Purge. Shryne decided to give up the Jedi way and join up with the smuggler crew under his mother, discarding a lightsaber and his use of the Force in exchange for a blaster and his wits.\nShryne tried to help the crew deliver Senator Fang Zar from Alderaan to Sern Prime as their first smuggling job together. However, Zar was slain by Vader, who also injured Jula with his saber throw.\nDespite trying to embrace a new life and hide out as suggested by the Jedi Temple on his Jedi beacon transceiver, Shryne's true Jedi nature could not be forever denied, especially in the process of watching Olee Starstone naively falling into the Emperor's traps before his eyes. During a point at the Imperial subjugation of Kashyyyk, Shryne suddenly re-engaged himself as a Jedi Knight, shortly after Darth Vader had landed on the scene via his Theta-class T-2c shuttle, destroying Wookiee warriors and anything else in his path. Specifically, just prior to Shryne's arrival, Vader had dispatched defending Jedi Knights Siadem Forte and Iwo Kulka by beheading them simultaneously in one sweep, critically injured Padawan Klossi Anno and Agricultural Corps members Jambe Lu and Nam Poorf, and shortly engaged Olee Starstone afterwards.\nIntrepidly, Roan Shryne suddenly intervened on the scene, calling to his hand Forte's lightsaber from the balcony floor and decapitating Commander Appo right in front of Darth Vader, challenging the Sith apprentice to a duel. By doing so he allowed the Dancer crew and the younger Jedi to escape. The fateful duel against Vader ended in Shryne being dealt mortal injuries from force charged wood planks, despite some ingenious defensive and offensive tactics and insights during the battle, and only after Vader used Force Throw to hurl objects at Shryne from all directions, which quickly overwhelmed Shryne's defenses. However, the Dark Lord did not kill him outright, but rather decided to revel in telling the dying Jedi of the truth behind the Emperor's identity as a Sith Lord; the fact he was the Sith Apprentice of Lord Sidious; then finally, his former identity as Anakin Skywalker. This, he believed, was the final insult to the dying Jedi, letting him know how utterly the Order had been destroyed from within.\nHowever, Roan still died happy, sarcastically thanking Vader for causing him to become one again with the Force. In the moments before his death, he recalled a Force vision he had experienced which, although it predicted the circumstances of his death, gave him peace in knowing that the Force would never die.\nAs more Jedi were exterminated across the galaxy, the newly-made Galactic Emperor Palpatine ordered his Grand Vizier Sate Pestage to cover up the reasons for the Jedi's death. Pestage compiled a list of official records to fabricate the Jedi's reasons for death. Shryne's report, reported by Commander Bow, stated that the Jedi Knight was executed for repeatedly disrupting Imperial recruitment efforts on Kashyyyk.\nRoan Shryne was known for having a rather pessimistic personality, possibly because he lost two Padawans before Order 66. He also had a tendency to be sarcastic at times.\nDespite his sarcastic, bitter and pessimistic nature, Shryne's heart was in the right place and he sacrificed his life to help the other Jedi escape from Darth Vader. He also had a strong spirit and drive, something which even Darth Vader respected .\nShryne was very close friends with Climber, so close that the clone refused to execute him when he received Order 66. He also cared a great deal about Olee Starstone, even though she was not his Padawan, and was determined not to allow her to die, as his last two Padawans had. Shryne was also fond of Bol Chatak and felt sorrow when she was killed.\nRoan Shryne was well trained in lightsaber combat, being able to hold his own against Darth Vader for a lengthy period of time, even though he was wielding an unfamiliar lightsaber. He managed to land two blows on the Sith Lord before being defeated. It should be noted that Vader defeated him not through lightsaber prowess, but through superior command of the Force.\nAs time went on, Shryne's connection to the Force became weak and he struggled to use even simple Force powers, getting by on experience and skill alone. Gradually his Force connection returned and when he faced Vader for the final time, Olee Starstone knew he was a Jedi once more. Just before he died, Shryne had a vision of the future, foreseeing the Battle of Endor which would take place over two decades later. He was also reasonably skilled with the Mind trick ability, having successfully utilized it against a clone trooper.\nIn 2013, Hasbro revealed that Shryne would be coming in an action figure multipack along with fellow Jedi Sarrissa Jeng and Sephjet Josall, as well as Clone commander Ponds. Though Shryne wields a blue lightsaber, the figure appears to come with a green blade. He was played by an uncredited extra.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Weytta",
  "/wiki/59_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Old_Guard",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Nat-Sem",
  "/wiki/Roan_Shryne%27s_first_Padawan",
  "/wiki/Roan_Shryne%27s_second_Padawan",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jen_Shryne",
  "/wiki/Jula_Shryne",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/48_BBY/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/The_Force/Legends",
  "/wiki/Acquisition_Division/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Murkhana/Legends",
  "/wiki/Cash_Garrulan",
  "/wiki/Salvo",
  "/wiki/Geonosis_strike_team",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Battle_of_Manari",
  "/wiki/Battle_of_Deko_Neimoidia",
  "/wiki/22nd_Air_Combat_Wing",
  "/wiki/Clone_commando/Legends",
  "/wiki/Ion_Team",
  "/wiki/Climber_(clone)",
  "/wiki/Battle_of_Murkhana_(Clone_Wars)",
  "/wiki/Outer_Rim_Sieges/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Bol_Chatak",
  "/wiki/Olee_Starstone",
  "/wiki/Battle_of_Kashyyyk_(19_BBY)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/CloakShape_fighter/Legends",
  "/wiki/Drunk_Dancer",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Fang_Zar/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Sern_Prime/Legends",
  "/wiki/Jedi_beacon_transceiver",
  "/wiki/Theta-class_T-2c_shuttle/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Siadem_Forte",
  "/wiki/Iwo_Kulka",
  "/wiki/Klossi_Anno",
  "/wiki/Agricultural_Corps/Legends",
  "/wiki/Jambe_Lu",
  "/wiki/Nam_Poorf",
  "/wiki/CC-1119/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Grand_Vizier/Legends",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Casualty_Report:_Order_66",
  "/wiki/Commander/Legends",
  "/wiki/Bow_(clone_stormtrooper)",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/2013",
  "/wiki/Hasbro_Inc.",
  "/wiki/Sarrissa_Jeng",
  "/wiki/Sephjet_Josall/Legends",
  "/wiki/CC-6454",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Retcon",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader",
  "/wiki/Star_Wars_Insider",
  "/wiki/Order_66:_Destroy_All_Jedi",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/Han_Solo:_The_Early_Years",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_Saga_Legends",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut"
 ]
}