{
 "name": "Rodas Borgin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serenno"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Pre–19 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Borgin",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Rodas Borgin was a male Human who served as the head of House Borgin and Duke of Serenno.\nThe Human male Rodas Borgin hailed from Serenno, a terrestrial planet in the Outer Rim Territories, in the last decades of the Galactic Republic. As a member of the House Borgin, one of the major bloodlines that ruled the planet, he was born a wealthy patrician. His father was head of the house, bearing the title of Count.\nWhen the Clone Wars erupted in 22 BBY between the Galactic Republic and the Confederacy of Independent Systems, the nobles of Serenno sided against the Republic. They had been coerced into doing so because of their ties with the Confederacy's leader, Dooku, who was their liege lord the Count of Serenno. At the end of the three-year conflict, the Republic emerged victorious and was reorganized into an authoritarian Galactic Empire. Shortly thereafter, a black-armored envoy of the Galactic Empire known as Darth Vader visited the assembled nobles of Serenno in the Great Assembly House, and Rodas Borgin attended the gathering with his father. However, Rodas Borgin and the other patricians soon discovered that the meeting was a trap.\nVader accused the nobles of treason, stating that an exemplary punishment was to be applied to atone for Serenno's faults. The Emperor's envoy ordered that the son of each head of house should kill the current title holder and take his place. With Vader threatening to kill everyone in the room if they refused, Rodas Borgin was the first to accept that macabre bargain. With a heavy heart and tears in the eyes, he drew his ceremonial dagger and stabbed his father in the back. Although he admittedly loved his father, Rodas Borgin chose to preserve himself. Seeing what Rodas had done, the rest of the heirs started killing their own fathers. Soon the slaughter finished and the new head of the houses were officially named.\nRodas Borgin married the noblewoman Cretia of House Malvern, and the two sired a son named Pero. In 3 BBY, Borgin met the Imperial agent Jahan Cross and was one of the people to know that Cross had murdered the Count of Serenno Adan Dooku. Borgin hired Aveca Dunn to kidnap Adan's ten-year-old son Bron Dooku, with the intention of returning the boy to make it look like he had saved him. With that newfound glory, Borgin hoped he would be a hero and named regent of Serenno, but he did not tell Cross about his scheme. Protecting the young Dooku, Cross foiled Borgin's plans and tricked the bounty hunter Boba Fett into shooting Count Borgin.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Serenno/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Borgin/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Duke_of_Serenno",
  "/wiki/Planet/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Great_Houses_of_Serenno",
  "/wiki/Noble/Legends",
  "/wiki/Rodas_Borgin%27s_father",
  "/wiki/Count/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Great_Assembly_House/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Cleansing_of_Serenno",
  "/wiki/Death/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Dagger/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Cretia_Borgin",
  "/wiki/House_Malvern/Legends",
  "/wiki/Pero_Borgin",
  "/wiki/Jahan_Cross",
  "/wiki/Adan_Dooku",
  "/wiki/Aveca_Dunn",
  "/wiki/Bron_Dooku",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_1",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_2",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_3",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_4",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_5"
 ]
}