{
 "name": "Rodd",
 "display_name": "Rodd",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Fondor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Rodd was a male Human Senator of the Galactic Republic who represented Fondor and the Tapani sector until he joined the Confederacy of Independent Systems in 23 BBY and was replaced by Canny Mandary Bertar.\nSenator Rodd owned a Fondorian salvage hauler, the ship he arrived in to negotiate salvage rights to the alleged ancient vessel the Sun Runner. His salvage-rights opponent was the Skull Queen, the Margravine Quenelle of Nallastia. The negotiations were monitored by the Jedi Bultar Swan, Obi-Wan Kenobi, and Anakin Skywalker. Rodd's apparent interest in the vessel, however, was all part of an elaborate ruse to gain wealth.\nIn his scheming bid to assist Groodo the Hutt in destroying the Fondor Shipyards and overtaking the Fondor Spaceport, in order to secure a personal fortune, Rodd was evasive and accusatory of the Jedi. But his duplicity became suspect when he revealed to Obi-Wan Kenobi knowledge of the memory-wiped droids of Groodo's Sun Runner replica—thought to be the authentic ancient transport of the Royal Octans—knowledge about which memory wipe, therefore, he should not have been privy to.\nMonitoring their controlled-droid takeover of the Fondor Spaceport from Groodo's garish starship, Rodd and Groodo's droid engineer, Hurlo Holowan, could see, after the unexpected Jedi infiltration into their operation, that it wasn't going well: only one FX medical assistant droid of their original army of twelve varied droids was left. They originally had planned to seize control of the spaceport, wait until its orbit carried it over Fondor's most important surface factories, and then send the entire station crashing down upon the factories. Simple, and yet it had turned out not to be. Their ruse of the needed hour to issue demands was really meant to give them the time needed to align the spaceport with the precise point in Fondor's orbit for the planet's factories to be decimated.\nOn the brink of issuing an early destruction order , Groodo stopped short when Senator Rodd noticed on their view screen Nallastia's Princess Calvaria as she dashed from their group of captives to a fallen young man on the Spaceport landing pad. Groodo's plan abruptly changed again when Rodd suggested that the Skull Queen's daughter, highly ransom-worthy, was worth infinitely more alive than dead. And so, Holowan manipulated the last FX droid's actions, including the quick abduction of Calvaria, which had fortuitously presented itself, and the droid's landing-craft escape from the Spaceport. But they did not foresee that the craft would be tracked by Jedi Master Mace Windu, who followed in hot pursuit in a Delta-6 starfighter. Suddenly, as they observed the two vehicles approach the Hutt's cruiser, the Princess had become more trouble than she was worth, and Groodo commanded that they ditch the landing craft and flee.\nSoon thereafter, Rodd was hunted down by both Jango Fett, the bounty hunter who was hired by Darth Tyranus to take the Senator alive, and hunters Cradossk and his son Bossk, who were simultaneously hired for the job  by Wat Tambor, Foreman of the Techno Union and a member of the Separatist Council. Fett, in the end, was the one to achieve the task after battling a Razor Eater droid at Groodo's Esseles compound , and he turned Rodd over to Darth Tyranus alive. The Sith Lord, impressed with the concept of the Sun Runner scheme hatched by Groodo, Senator Rodd and Holowan—and with the ingenuity, ambition, talent, and secrecy they demonstrated—wished to recruit them to his cause.\nRodd grew up on Fondor and rose to one of its highest political positions. A sharp-featured, middle-aged human male, the Senator wore a black uniform bearing an embroidered logo of the starship manufacturer Republic Sienar Systems: he served as head of its Diplomatic Headquarters, located within the massive 360-hangar space station that orbited Fondor, Lunavolver Delta.\nThe Senator, however, because of the station's constant rotation that made him sick to his stomach, loathed the Lunavolver. As such, he would sit at his desk with his back to the window, which prevented him from seeing the slowly swirling view of Fondor. Despite his lofty leadership position—both within the space station and the galaxy generally—Rodd would have been happy to leave it all behind, just as long as he could take an enormous amount of money with him.\nRodd had a difficult time—more so, perhaps, than other beings —distinguishing one Hutt from another. As was the case between Groodo and his son, Boonda, for he simply could not tell them apart.\nUnderstandably protective of his \"legitimate\" Senatorial identity, Rodd was fond of disguises. As he awaited Groodo in the Fondor Spaceport—and to avoid detection by Fondor Space Patrol authorities—Rodd wore a heavy, hooded robe that covered his uniform and almost completely concealed his face. As an added precaution, he sprayed the robe with a foul-smelling chemical that encouraged people to keep their distance. Unfortunately, Rodd had very sensitive nostrils and could hardly wait to get out of the stinking disguise.\nSenator Rodd was clearly the principal source for Groodo's research into the legendary history of Fondor and Nallastia in his immaculate development of the Sun Runner replica at his Esseles-based shipyards. Rodd tried always to keep his communications with Groodo secure, using, for example, various private, encrypted codes in his HoloNet transceiver transmissions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Rodd",
  "/wiki/Star_Wars_Legends",
  "/wiki/Fondor/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Hurlo_Holowan",
  "/wiki/Senator/Legends",
  "/wiki/Tapani_sector/Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Canny_Mandary_Bertar",
  "/wiki/Fondorian",
  "/wiki/Salvage_hauler",
  "/wiki/False_Sun_Runner",
  "/wiki/Sun_Runner",
  "/wiki/Skull_Queen",
  "/wiki/Margravine",
  "/wiki/Quenelle",
  "/wiki/Nallastia",
  "/wiki/Jedi/Legends",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Groodo",
  "/wiki/Hutt/Legends",
  "/wiki/Fondor_Shipyards/Legends",
  "/wiki/Fondor_Spaceport",
  "/wiki/Droid/Legends",
  "/wiki/Royal_Octans",
  "/wiki/Droid_Control_Army",
  "/wiki/Starship/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/FX_medical_assistant",
  "/wiki/View_screen",
  "/wiki/Prince/Legends",
  "/wiki/Calvaria",
  "/wiki/Alto",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Delta-6_Sprite-class_starfighter",
  "/wiki/Cruiser/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Cradossk/Legends",
  "/wiki/Bossk/Legends",
  "/wiki/Wat_Tambor/Legends",
  "/wiki/Foreman/Legends",
  "/wiki/Techno_Union/Legends",
  "/wiki/Separatist_Council",
  "/wiki/Razor_Eater",
  "/wiki/Esseles/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Republic_Sienar_Systems/Legends",
  "/wiki/Lunavolver_Delta",
  "/wiki/Fondor_Space_Patrol",
  "/wiki/Robe/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Cloak_of_Deception",
  "/wiki/Star_Wars_Adventures_1:_Hunt_the_Sun_Runner",
  "/wiki/Star_Wars_Adventures_2:_The_Cavern_of_Screaming_Skulls",
  "/wiki/Star_Wars_Adventures_3:_The_Hostage_Princess",
  "/wiki/Star_Wars_Adventures_4:_Jango_Fett_vs._the_Razor_Eaters",
  "/wiki/Star_Wars_Adventures_5:_The_Shape-Shifter_Strikes",
  "/wiki/Star_Wars_Adventures_6:_The_Warlords_of_Balmorra",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galactic_Standard_Calendar"
 ]
}