{
 "name": "Rodin Higron",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Rodin Higron was a male Corellian gambler-turned-pirate who operated during the Galactic Civil War. His base of operations was located on the Oasis mining colony, in The Maelstrom.\nBorn on Corellia, Rodin Higron was a crafty gambler and privateer. In a particularly crooked game of sabacc, Higron won sole ownership of an oxite mining colony on a volcanic moon within the Maelstrom. The Maelstrom was home to a group of pirates known as the Riders of the Maelstrom, and while investigating the moon, Higron realized that the Malestrom was a perfect hunting ground and established his own group of privateers. However, Higron was a staunch supporter of the Alliance to Restore the Republic, and limited his targets to Imperial military and merchant starships. The moon also became the site of an Alliance safe world.\nAn unfortunate side effect of this action was that Imperial forces began to tighten their grip on the sector, causing a more hazardous operation for the pirate gangs. The leader of the Riders, Big Jak Targrim, became particularly furious with Higron for disrupting their profitable business and tried to crash the luxury liner Kuari Princess into Higron's base of operations. Luckily, a small group of Rebel agents was able to foil Targrim's plan and save Higron's operation.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Oasis_mining_colony",
  "/wiki/The_Maelstrom",
  "/wiki/Gambler/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Oxite",
  "/wiki/Mining/Legends",
  "/wiki/Volcano/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Riders_of_the_Maelstrom",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Safe_world/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Big_Jak_Targrim",
  "/wiki/Luxury_liner/Legends",
  "/wiki/Kuari_Princess/Legends",
  "/wiki/Riders_of_the_Maelstrom_(West_End_Games)",
  "/wiki/West_End_Games",
  "/wiki/Classic_Adventures:_Volume_Three",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}