{
 "name": "Rodin_Hlian_Verpalion",
 "display_name": "Rodin Hlian Verpalion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Around 50 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray-blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lord Rodin Hlian Verpalion was an Imperial noble.\nEarly in his life, Verpalion served aboard the cruiser Ballista along with Imre Talberenina, with whom he was acquainted. He eventually amassed a large personal fortune and rose to power in the Imperial Senate, where he won favor from Palpatine and was given the title of Imperial Advisor. In this capacity, Rodin spent his time handling sensitive situations for the Emperor, who he was totally loyal to.\nSoon after the Battle of Yavin, Verpalion was assigned as overseer of the NOVA project on Lianna. Rodin strongly disliked what he considered \"backwater\" worlds such as Lianna and desired the refinement and style of the Core worlds. In order to make Verpalion stay as short as possible, Lady Valles Santhe made Verpalion's living arrangements run counter to his taste, which forced him out after only a few days. He only returned to the planet periodically to check on the ongoing work. During a reception held in his honor, a team of Rebel operatives managed to steal a copy of the NOVA plans and sabotage the originals. When the device was finally tested during Verpalion's inspection, it failed to cloak the test ship, leaving Rodin furious and blaming Phillip Santhe for the failure.\nAt the time of the Rebel Alliance's sabotage of the NOVA project, it was rumored on Lianna that Lord Verpalion and Lady Valles's granddaughter Miri Santhe were \"more than just friends\". However, this was not true. After the Battle of Endor, Lord Verpalion petitioned the Empire to invade the planet, despite the neutral attitude of Valles Santhe; however, Lady Valles was able to keep Lianna neutral.\nOutwardly, Verpalion appeared to be a friendly and generous man, however he was quite capable of ruthlessly torturing and killing for pleasure. He was a close friend of Grand Moff Wilhuff Tarkin whose policies he admired. Rodin genuinely believed that the Empire was a force for good and that aliens, droids and other scum were inferior to Humans. He considered himself a patron of the arts.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/50_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Ballista_(cruiser)",
  "/wiki/Imre_Talberenina",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Imperial_Advisor",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/NOVA",
  "/wiki/Lianna/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Valles_Santhe",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Phillip_Santhe",
  "/wiki/Miri_Santhe",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Mission_to_Lianna",
  "/wiki/West_End_Games",
  "/wiki/The_Capture_of_Coh_Veshiv",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Dark_Empire_Sourcebook"
 ]
}