{
 "name": "Rogan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Questal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Questal Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Rogan was the husband of Tyerle and the brother-in-law of Rebel agent Tay Vanis.\nRogan's past is a mystery until the time he married Tyerle. They traveled to the planet Questal, trying to escape from the pressures of the Empire. They settled on Questal, but it was discovered that the planet was rich in Ardanium, which increased local crime and Imperial attention. When Questal was occupied by the Empire, with Moff Bandor as its ruler, Rogan started resistance cells to oppose them.\nAware of his activities, Bandor managed to capture Rogan and tortured him with a Hurlothrumbic Generator. Scared, Tyerle asked his brother Tay, by then a Alliance to Restore the Republic agent, for help. Vanis tried his best to rescue Rogan, but was himself captured and similarly tortured.\nA group of Rebel agents were then sent to rescue both Rogan and Tay Vanis. They managed to do so, and even captured Bandor in the process. Both Tay and Rogan were mindless at the beginning, but they recovered, in part thanks to Tyerle's love.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Rogan",
  "/wiki/Questal/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tyerle",
  "/wiki/Tay_Vanis",
  "/wiki/Ardanium",
  "/wiki/Moff/Legends",
  "/wiki/Bandor_(Moff)",
  "/wiki/Hurlothrumbic_Generator",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/The_Game_Chambers_of_Questal",
  "/wiki/West_End_Games",
  "/wiki/Classic_Adventures:_Volume_Five"
 ]
}