{
 "name": "Rogun Matt'rik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chagrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Violet"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Rogun Matt'rik, better known as Rogun the Butcher, was a male Chagrian who was one of the top crime lords in the galactic underworld during the Cold War and the Galactic War.\nRogun inherited his criminal empire after his mentor Ivory was imprisoned on the planet Belsavis. Three of his most notable traits was that he always owned a piece of the action, never backed down from a fight, and had a zero tolerance policy for failure.\nIn 3643 BBY, he got involved in the feud between Skavak and the Voidhound when Skavak stole a ship full of weapons meant for Rogun. Though the Voidhound insisted that Skavak was to blame, Rogun refused to accept excuses and repeatedly dispatched bounty hunters, after the smuggler, none of which were successful.\nA year later, Rogun's men tracked down the Voidhound at Port Nowhere. Communicating via hologram, Rogun had a first direct conversation with the smuggler and announced his bounty on his head, compelling every two-bit thug in hearing range to try and claim it. Not only did the Voidhound survive the skirmish, but also freed Rogun's captives, Darmas Pollaran and Senator Bevera Dodonna, unaware that the two were plotting against the Galactic Republic. Pollaran, an agent of Imperial Intelligence, told the Voidhound that Rogun was the right hand of the Voidwolf, and that they had to kill Rogun and take over his criminal empire to get to the man.\nRogun sent Languss Tuno to Hoth with a mission to kill the smuggler. However, Tuno suffered abuse at the hands of Shai Tenna and decided that more was to be gained by defecting from Rogun and joining the Voidhound's crew. Unaware that Rogun supported the Republic and deciding to take the mission more seriously after saving Dodonna from another of Rogun's bounty hunters, the Voidhound tracked down Ivory on Belsavis and managed to save him from Rogun's best hunter, Dust. The smuggler got from Ivory the information on Rogun's safehouses and afterwards disrupted Rogun's cyberbeast smuggling ring on Voss. In response, Rogun summoned all his surviving lieutenants to his safehouse on Tatooine.\nWhen confronted by Voidhound, Rogun accused the smuggler of being a traitor to the Republic, to the smuggler's confusion. Then suddenly, two Pureblood Sith, Chane and Desora interrupted their meeting, displaying a hologram of the Voidwolf, who mocked Voidhound's naivety. The Admiral revealed that Pollaran and Dodonna were working for the Voidwolf, and in reality, Rogun rooted for the Republic, and he was the only man standing in the way of the Voidwolf from unifying the galactic underworld for the Sith Empire.\nIgnoring the past differences, the Voidhound and Rogun joined in their efforts in surviving and killed both of the Sith. As a reward for saving his life, Rogun agreed to forget their previous dispute. The Voidhound made a deal with Rogun to take out the Voidwolf and the two then decided to continually work together, with Rogun sending the Voidhound to meet Curao on Corellia.\nRogun appears in the 2011 video game Star Wars: The Old Republic as one of the main antagonists of the smuggler storyline, though he and player join efforts in the end. In the dark side option, the player has the option to kill him on Tatooine. Alternatively, if Voidhound creates their own criminal empire, Rogun becomes one of their associates.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Rogun_Matt%27rik",
  "/wiki/Chagrian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Viidu",
  "/wiki/Crime_lord/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Ivory",
  "/wiki/Planet/Legends",
  "/wiki/Belsavis/Legends",
  "/wiki/3643_BBY",
  "/wiki/Skavak/Legends",
  "/wiki/Voidhound",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/3642_BBY",
  "/wiki/Port_Nowhere",
  "/wiki/Darmas_Pollaran",
  "/wiki/Senator/Legends",
  "/wiki/Bevera_Dodonna",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Harridax_Kirill",
  "/wiki/Death/Legends",
  "/wiki/Languss_Tuno",
  "/wiki/Hoth/Legends",
  "/wiki/Shai_Tenna",
  "/wiki/Dust_(Abyssin)",
  "/wiki/Ssorokk",
  "/wiki/Voss",
  "/wiki/Tatooine/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Chane",
  "/wiki/Desora",
  "/wiki/Admiral/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Sith/Legends",
  "/wiki/Curao",
  "/wiki/Corellia/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_3",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}