{
 "name": "Rohn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 19 BBY",
      "Ostor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "Rohn was a male Human general within the Galactic Empire. The Imperial enforcer, Darth Vader assigned him direct command of the Shrouded Offensive, a military operation at the Outer Rim planet of Ostor. He spent some time awaiting the sandstorms to subside, and reported to Vader when the sandstorms ended so they could commence the attack. However, he hated being in the star system, wanting to end the operation quickly so he could get out of the system. Although he gave orders to the Imperial forces, he himself did not participate directly, instead taking command from an armored transport far behind the lines. Hock Malsuum, one of the clone stormtroopers involved in the operation, cited Rohn being placed in charge of the operation as being one of three reasons  why the Shrouded Offensive ended up being one of the worst military disasters for the Galactic Empire, and cited the enemy force's commander, General Atticus Farstar, as being the more respectable leader between the two. Eventually, Rohn ordered the troops to pursue the Separatist troops when the latter seemingly called a retreat. Hock, finding the retreat suspicious, attempted to get Rohn to order them to fall back. However, Rohn refused to listen, forcing the clone trooper to shoot the general after boarding his transport.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Ostor",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/General/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Shrouded_Offensive",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Sandstorm/Legends",
  "/wiki/CT-5539",
  "/wiki/Clone_stormtrooper",
  "/wiki/Atticus_Farstar",
  "/wiki/Darth_Vader_and_the_Cry_of_Shadows_3"
 ]
}