{
 "name": "Rokak%27k",
 "display_name": "Rokak'k",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gree"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gree Enclave"
     ]
    }
   ]
  }
 ],
 "content": "Master Rokak'k was a male Gree who commanded the Rokak'k Baran, a transport ship that ferried information, goods, and beings around the various worlds of the Gree Enclave. Due to his position, he was considered to be one of the most influential masters of his time, and dedicated himself to ensuring that the Baran maintained its schedule as it traveled around its circuit.\nRokak'k commanded the Rokak'k Baran, a massive, city-like ship that served as the main transport for beings and goods moving throughout the Gree Enclave, a small region of space ruled by the Gree in the Veragi sector of the Outer Rim Territories. Due to his status as commander of the Baran, Rokak'k was the one of the most influential and respected masters—those Gree who had studied the ancient devices of Gree technology and were proficient in manipulating and using them—of his time. He commanded the 5,000 Gree who served aboard the Baran, including several lesser masters—such as Master Varat'k—and personally oversaw much of the ship's functions. Rokak'k ran a tight ship, and made it his priority to ensure that the Baran kept to its assigned schedule.\nRokak'k was a member of a guild—a political body within Gree society that masters belonged to, organized by profession—but had no time for their politics, believing it to be his duty to maintain the Baran's schedule as a means to stop the continued slide of Gree society into ruin. As the Gree had lost the knowledge to operate many of their advanced devices over the years, or create new ones to replace those destroyed, the Baran was the only vessel of its type that the Gree had to ferry news, messages, and trade goods between the Gree worlds.\nRokak'k handled many of the important devices on the Baran himself, and was well skilled in the operation and repair of the Rokak'k Baran. He was well acquainted with Gree bureaucratic procedure, knew about alien languages, and was extremely knowledgeable about planetary systems within the Gree Enclave. Rokak'k was often seen moving through the ship's corridors, ordering lesser masters and apprentices about. He tolerated the aliens that traveled on his ship as a necessary evil, but would ignore them and leave whenever one tried to approach him. Rokak'k was trained to use a blastrod, and carried one about his person along with a ceremonial whistle.\nRokak'k was first mentioned in The Gree Enclave by Timothy S. O'Brien, an article in the Star Wars Adventure Journal 8. The information was subsequently reprinted in Classic Adventures: Volume Four - The Best of the Journal.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Gree_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Gree_Enclave/Legends",
  "/wiki/Master_(Gree)",
  "/wiki/Commander/Legends",
  "/wiki/Rokak%27k_Baran",
  "/wiki/Transport/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/City/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Veragi_sector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Gree_technology",
  "/wiki/Varat%27k",
  "/wiki/Politics/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Blastrod",
  "/wiki/The_Gree_Enclave",
  "/wiki/Timothy_S._O%27Brien",
  "/wiki/Star_Wars_Adventure_Journal_8",
  "/wiki/Classic_Adventures:_Volume_Four_-_The_Best_of_the_Journal",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/West_End_Games",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion"
 ]
}