{
 "name": "Roland Durand",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Durand crime family"
     ]
    }
   ]
  }
 ],
 "content": "Roland Durand was a Devaronian male criminal and the son of the crime boss Isa Durand. Durand was a former client of the information broker Cid, whom he paid to deliver the lizard Ruby to him.\nDurand attempted to work with the Pyke Syndicate and forcefully took over Cid's Parlor on Ord Mantell due to the planet's connection to multiple hyperspace routes useful to the Pyke Syndicate. Cid and her employees, the clone mercenary unit known as the Bad Batch attempted a heist to steal the spice that Durand was set to sell to the Pykes, in order to disrupt his deal and remove him from power. Durand learned that the spice had been stolen, he and his men tried to reobtain the spice, a battle ensued causing the spice to be lost. Later he informed the Pykes, who forced Cid and the Bad Batch to retrieve the lost spice. Durand was held by the Pykes, as well as one member of the Bad Batch, Omega, who was used as their hostage until the Bad Batch had retrieved the spice. While being held, Durand told Omega that Ruby did not like many people when his pet snuggled up to her. After the spice was returned safely Omega and Cid convinced the Pykes to allow Durand to live since they were told by the Trandoshan if Durand died the Pyke Syndicate would ignite a war with his mother crime boss Isa Durand and knew how dangerous that would be since they just came out of hiding, but they cut off one of his horns as punishment. Durand departed, leaving the parlor back in Cid's hands.\nRoland Durand appeared in \"Infested,\" the thirteenth episode of the first season of the series Star Wars: The Bad Batch, released on Disney+ on July 23, 2021. He was voiced by Tom Taylorson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Durand",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Devaronian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Durand_crime_family",
  "/wiki/Crime_lord",
  "/wiki/Isa_Durand",
  "/wiki/Information_broker",
  "/wiki/Cid",
  "/wiki/Theft_of_Ruby",
  "/wiki/Ruby_(lizard)",
  "/wiki/Pyke_Syndicate",
  "/wiki/Cid%27s_Parlor",
  "/wiki/Ord_Mantell",
  "/wiki/Planet",
  "/wiki/Hyperspace_route",
  "/wiki/Cloning",
  "/wiki/Mercenary",
  "/wiki/Clone_Force_99",
  "/wiki/Spice",
  "/wiki/Pyke",
  "/wiki/Omega",
  "/wiki/Trandoshan",
  "/wiki/Infested",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Disney%2B",
  "/wiki/July_23",
  "/wiki/2021",
  "/wiki/Tom_Taylorson",
  "/wiki/Battle_Scars",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Roland_Durand"
 ]
}