{
 "name": "Romas_Navander",
 "display_name": "Romas Navander",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Military",
      "Alliance Military"
     ]
    }
   ]
  }
 ],
 "content": "Romas Navander was a human male who served as a lieutenant in the Alliance to Restore the Republic during the Galactic Civil War. He was among the rebel forces stationed in the control room of Echo Base on the planet Hoth. In 3 ABY, he listened to Captain Han Solo report his encounter with an Imperial Viper probe droid to Princess Leia Organa, which prompted the Alliance to begin evacuating Hoth.\nWhen Imperial forces arrived in the Hoth system, he was the first to inform General Carlist Rieekan. He later announced over Echo Base's speaker system that the first of the rebel transports had successfully passed through the Imperial blockade.\nLieutenant Romas Navander was a human male who served as an officer in the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. He was among the forces that were stationed in the rebel's Echo Base on the planet Hoth, where he worked as a controller in the base's command center.\nIn 3 ABY, Navander rushed with General Carlist Rieekan and a commander over to a control room terminal where Princess Leia Organa was listening to Captain Han Solo report his encounter with an Imperial Viper probe droid that he had destroyed near the base. Assuming that the Empire now knew their location, Rieekan ordered that the evacuation of Echo Base begin.\nDuring the preparations, Navander remained at his console in the command center, where he was alerted to the arrival of the Imperial Death Squadron in Sector Four within the Hoth system. He urgently motioned over Rieekan and informed him of the arrival of the Empire. Rieekan then gave Navander an order to reroute all power to the base's shields in order to prevent an orbital bombardment of Echo Base. Navander then called out to the command center that the Star Destroyer Tyrant was approaching. After the Imperials blockaded Hoth and began landing ground forces, the rebels launched the first of their GR-75 medium transports, Quantum Storm.\nEcho Base's v-150 ion cannon then fired at the Imperial blockade, disabling the the Tyrant and allowing the transport to escape unharmed. Navander announced the successful evacuation of the Quantum Storm over Echo Base's speaker system, prompting cheers from rebels waiting for evacuation. Ultimately, the Alliance successfully evacuated Echo Base, but sustained heavy casualties in doing so.\nNavander had fair skin, blue eyes, and graying brown hair.\nNavander wore a white bodysuit with a brown, sleeveless, high-collar jacket, and gray boots.\nRomas Navander first appeared in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. The character was portrayed by Burnell Tucker in the film and credited only as one of several \"Other Officers.\" Tucker also portrayed Wyron Serper in the film, and had previously played the character Del Goren in Star Wars: Episode IV A New Hope. Navander's scenes in the Echo Base control room were shot on Stage 1 at Elstree Studios between March 26 and 28, 1979. The speaker announcement of the first transport escaping Hoth was not performed by Tucker, but instead by actor Mark Hamill, who portrayed Luke Skywalker in the film.\nIn the new Star Wars canon, Navander was first identified in \"In the Trenches,\" a 2019 article published on the official website of Fantasy Flight Games, announcing the Rebel Veterans Unit Expansion for the roleplaying game Star Wars: Legion. Romas Navander's name originated in the Star Wars Legends continuity, where it was first used in 1996 on a card in the Hoth Limited expansion set of the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Romas_Navander",
  "/wiki/Romas_Navander/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alliance_Military",
  "/wiki/File:Navander-Rieekan.ogg",
  "/wiki/Lieutenant",
  "/wiki/Galactic_Civil_War",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/3_ABY",
  "/wiki/Captain",
  "/wiki/Han_Solo",
  "/wiki/Galactic_Empire",
  "/wiki/XJ9-CS14",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Death_Squadron",
  "/wiki/Hoth_system",
  "/wiki/General",
  "/wiki/Carlist_Rieekan",
  "/wiki/Quantum_Storm",
  "/wiki/GR-75_medium_transport",
  "/wiki/Blockade",
  "/wiki/File:Organa-Solo-Rieekan.ogg",
  "/wiki/Alliance_officer",
  "/wiki/Controller",
  "/wiki/Commander",
  "/wiki/File:Navander-Transport.ogg",
  "/wiki/Sector_Four_(Hoth_system)",
  "/wiki/Deflector_shield",
  "/wiki/Orbital_bombardment",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Tyrant",
  "/wiki/Blizzard_Force",
  "/wiki/V-150_Planet_Defender",
  "/wiki/Transport",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Boot",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Burnell_Tucker",
  "/wiki/Wyron_Serper",
  "/wiki/Del_Goren",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Elstree_Studios",
  "/wiki/March_26",
  "/wiki/March_28",
  "/wiki/1979",
  "/wiki/Mark_Hamill",
  "/wiki/Luke_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/2019",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Rebel_Veterans_Unit_Expansion",
  "/wiki/Roleplaying_game",
  "/wiki/Star_Wars:_Legion",
  "/wiki/Star_Wars_Legends",
  "/wiki/1996",
  "/wiki/Hoth_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Category:Audio_files_of_Romas_Navander",
  "/wiki/Category:Images_of_Romas_Navander",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Battle_of_Hoth_(Galaxy_of_Adventures)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Ion_Control",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Empire_Strikes_Fact!",
  "/wiki/Star_Wars_Insider_119"
 ]
}