{
 "name": "Rommul",
 "display_name": "Rommul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Klatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Treema Courthouse and Detention Area"
     ]
    }
   ]
  }
 ],
 "content": "Rommul was a male Klatooinian who worked as a guard in the Treema Courthouse and Detention Area on Klatooine. In 44 ABY, he guarded the psychotic Force-sensitive Dyon Stadd until Luke Skywalker and his son, Ben, arrived to take custody over him. After levitating Stadd out of the well where he was being kept, Luke Skywalker offered to levitate Rommul as well, but the officer Abara Mun suggested that Rommul would rather use their rope ladder.\nThe male Klatooinian Rommul served as a guard in the Treema Courthouse and Detention Area in Klatooine's capital city of Treema by 44 ABY. In that year, the Force-sensitive Dyon Stadd succumbed to a psychosis and nearly violated the area surrounding the Fountain of the Hutt Ancients, a sacred fountain in the Derelkoos Desert. He was stopped by Klatooinian authorities with the help of Jedi Knight Ben Skywalker and Sith apprentice Vestara Khai and taken to the Courthouse and Detention Center, where he was put on sedatives and placed at the bottom of an old well under the watch of Rommul.\nRommul guarded over Stadd until Skywalker and his father, Luke, arrived to transfer Stadd to a more secure area aboard their ship, the Jade Shadow. The Jedi jumped down into the pit, surprising Rommul, and quickly levitated Stadd up out of the well. Luke Skywalker then offered to levitate Rommul up as well, but the Security and Detention officer Abara Mun replied that he would probably rather come up using their rope ladder.\nRommul was somewhat surprised at the Skywalkers' means of arrival in the well, showing signs of alarm when they Force-leapt down to his side. When Skywalker offered to levitate Rommul out of the pit, Mun replied that she believed Rommul would prefer to return via their rope ladder.\nRommul first appeared briefly in the fifth novel of the Fate of the Jedi series, Fate of the Jedi: Allies, written by Christie Golden and released May 25, 2010.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Klatooine/Legends",
  "/wiki/Klatooinian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Treema_Courthouse_and_Detention_Area",
  "/wiki/44_ABY",
  "/wiki/Force_psychosis",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dyon_Stadd",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Telekinesis/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Abara_Mun",
  "/wiki/Rope/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Treema",
  "/wiki/Standard_year/Legends",
  "/wiki/Fountain_of_Ancients",
  "/wiki/Derelkoos_Desert",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Vestara_Khai",
  "/wiki/Starship/Legends",
  "/wiki/Jade_Shadow",
  "/wiki/Jedi/Legends",
  "/wiki/Force_Jump",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Christie_Golden",
  "/wiki/May_25",
  "/wiki/2010",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)"
 ]
}