{
 "name": "Romo Vax",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sennex",
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Romo Vax was a Human male criminal who lived during the Galactic Civil War. He was a member of the Sennex pirates on Tatooine.\nRomo Vax was a member of the Sennex, a group of despicable pirates and slavers, hostile to Jabba the Hutt. After the Battle of Yavin, Romo Vax succeeded in infiltrating Jabba Desilijic Tiure's criminal empire on Tatooine.\nIn 1 ABY, Romo Vax was pursued by a bounty hunter named Hizram Riean. Jabba's majordomo Bib Fortuna quickly dispatched a spacer to kill the bounty hunter before he could reach Jabba's Palace.\nAt some point, Fortuna suspected Romo Vax to double cross Jabba's organization so he hired the Wayfar spies to watch for Vax. However, the Sennex eventually figured out that he was watched. In 1 ABY, Bib Fortuna sent a spacer to retrieve information from Romo Vax for Jabba. In order to get rid of the Wayfar spies, Romo Vax convinced the spacer that the Wayfar spies were enemies of Jabba, when in reality they worked for Fortuna. The deceived spacer therefore killed several Wayfar spies in the desert, including their leader Dewall Paez. Vax later claimed that the information Bib Fortuna was looking for was stolen by Valarian slicers who also wiped the data from his datapad. The spacer then attacked Valarian hackers' bunker and retrieve the stolen data. In the end, Bib Fortuna discovered that Vax had made kill his spies and was also responsible for giving the information to the Valarians. The majordomo therefore ordered the spacer to assassinate the traitor. Romo Vax was ultimately killed by the spacer, along with his Sennex henchmen, in his secret hideout near Jabba's Palace.\nRomo Vax was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Romo Vax was present in the original release of the game, being part of the first version of the Jabba's Theme Park. Because Vax spawned under the generic \"noble\" template, his appearance was randomized under one of forty-two possible depictions and would fluctuate after each server reset.\nWith the release of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005, the Jabba's Theme Park was extensively revamped. In addition to major changes in the storyline, Romo Vax was given an unique appearance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sennex",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Bib_Fortuna/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Hizram_Riean",
  "/wiki/Majordomo/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Wayfar_spies",
  "/wiki/Dewall_Paez",
  "/wiki/Valarian_Syndicate",
  "/wiki/Slicer/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Valarian_hackers%27_bunker",
  "/wiki/Romo_Vax%27s_Hideout",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance",
  "/wiki/CorSec_Database_H-Z"
 ]
}