{
 "name": "Rona_Riggs",
 "display_name": "Rona Riggs",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Rona Riggs was a Human female living on Coruscant during the Cold War. She was born on Ord Mantell and was the cousin of Corso Riggs.\nRona and her cousin were close growing up, she even used him as interference to avoid being caught by her father while dating offworlders. Sometime during the Separatist War on Ord Mantell Corso left home to join the Peace Brigade. Rona went with him, but jumped ship at the first port, her only desire was get off Ord Mantell. She eventually ended up on Coruscant working as an underboss for the Black Sun Crime Syndicate smuggling spice with the help of Doctor Hope and Big Jan.\nIn 3643 BBY Corso tracked Rona down and met her on Coruscant, telling her that her mother and father died during the war on Ord Mantell. Deciding to play a prank on Corso, Rona arranged for him and the starship captain nicknamed the Voidhound to meet with Doctor Hope so the former would get implanted with a pack of spice to deliver to Big Jan. When Corso found out he was smuggling spice, the Voidhound destroyed the spice before confronting Doctor Hope, who admitted that Rona set them up. It was then that Rona chose to meet with her cousin face-to-face and shocked him by revealing that had taken to a life of crime. When told that the rest of their family were killed by separatists, Rona reacted with indifference. Corso begged Rona to leave the Black Sun, reminding her of their idealistic dreams, but she replied that she woke up and decided to live in reality. She then parted ways with her cousin, saying that he and the Voidhound could at least show her how to live a better life.\nDespite Rona turning out to be a big disappointment, Corso vowed never to stop believing in the good in people.\nRona Riggs is a non-player character in the Star Wars: The Old Republic video game, featured in the Smuggler companion mission for Corso Riggs, \"A Mule Out of Water\".\nThe Smuggler player character has the following dialogue options with Rona:",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Corso_Riggs",
  "/wiki/Corso_Riggs%27s_uncle",
  "/wiki/Separatist_War",
  "/wiki/Peace_Brigade_(Cold_War)",
  "/wiki/Spice/Legends",
  "/wiki/Doctor_Hope",
  "/wiki/Big_Jan",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/Rona_Riggs%27s_mother",
  "/wiki/Voidhound",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}