{
 "name": "Ronderu lij Kummar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kalee"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaleesh"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red-brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Qymaen jai Sheelal"
     ]
    }
   ]
  }
 ],
 "content": "Ronderu lij Kummar was a Kaleesh female and a close confidant of Qymaen jai Sheelal, the warrior who would later be known as General Grievous. Her origins were largely unknown; believed to hail from the Grendaju ice mass at the far south of the planet Kalee, she claimed not to belong to any one Kaleesh tribe, but to be a descendant of the gods. Rumors abounded regarding her true background, and some believed she never existed. A talented swordmaster and hunter, she worked as a wandering mercenary, hiring her skills to different tribal chieftains on Kalee.\nKummar later met the Kaleesh warrior Sheelal while hunting in the Kunbal jungle, and the two became steadfast companions. Outsiders did not know the full nature of their relationship, with some speculating that they were lovers, or that Kummar was Sheelal's long lost half-sister. Kummar joined Sheelal in his battles against the alien Yam'rii who had attempted to colonize their homeworld, fighting by his side in campaigns too numerous to count. The two were considered invincible when fighting together and had a reputation of twin demigods among their people, but when separated, they were considerably less deadly in combat. This led to Kummar's downfall; separated from Sheelal while fighting Yam'rii on the beaches of the Jenuwaa Sea, she was killed, and her body was dragged out to sea. A devastated Sheelal failed to retrieve her body, subsequently going on a pilgrimage to Abesmi and beginning a path of bloodshed and despair that would last his life. He took the name Grievous to signify his grieving existence, ultimately becoming a vicious warlord and later the Supreme Commander of the Separatist Droid Armies.\nRonderu was a female Kaleesh native to Kalee, though members of her species knew precious little other than that; some even questioned whether she ever existed. Knowledge of her origins rested largely on speculation and her own, unverifiable claims. Believed to a native of Grendaju, an icy mass at the southern tip of Kalee where the deadly karabbac predators roamed, she was thought to have belonged to a mysterious race of hunters and warriors. But, unlike the majority of Kaleesh, Ronderu was allied with no one tribe, preferring to live as a nomad. She was a master swordswoman, warrior, and hunter, usually wielding two Lig swords, and she donned a mask carved from a karabbac's skull.\nRonderu worked largely as a mercenary, or \"sellsword,\" on Kalee, hiring her abilities out to various rival Kaleesh tribal chieftains. She made grandiose claims that she was descended from the ancient Kaleesh gods, though there were various interpretations of her comments. In Kaleesh culture, dead ancestors were believed to have become gods, so many believed she merely meant that her family and tribe had all perished; rumors abounded that Ronderu herself was responsible for their supposed deaths. She became known as the Kummar, or the Incubus.\nEventually, Kummar chanced upon another skilled warrior in the Kunbal jungle, and the two would form a close bond. Kummar was hunting mumuu with her swords when Qymaen, a noted Kaleesh warrior, approached her. He had had a dream of himself hunting mumuu with Lig swords in the Kunbal jungle, and, intrigued, had traveled there to fulfill it; however, the figure of his vision was not himself, but Ronderu lij Kummar. Because of the nature of their introduction to each other, it was believed that they were living manifestations of the cryptic parable Sheelal, or The Dreamer/The Dreamt One. Kummar and Qymaen—having become known as Qymaen jai Sheelal—became steadfast companions, though the exact nature of their relationship was largely unknown; it was postulated by some that they were lovers, by others that she was Sheelal's long lost half-sister. They shared a bond, total and sacred, and they became comrades-in-arms. Sheelal was a leading figure in the war against the alien Yam'rii who had unscrupulously colonized Kalee with no consideration of the natives, and whom he hated with a passion; Kummar joined his crusade.\nKummar taught Sheelal the use of swords, drilling it into him, while in return he introduced her to the primitive Czerka Arms Outland rifle, which she warmed to. They embarked on countless campaigns against the Yam'rii together, sometimes alongside other warriors of varied origins, hacking and impaling their enemies and racking up a vast kill count. When fighting together, Kummar and Sheelal were almost invincible, working in tandem against their insectoid enemies, but while separated they were decidedly more vulnerable. Among their people, the two had reputations as twin demigods, blessed by their ancestors. At some point in their war with the Yam'rii, Kummar and Sheelal staved off Yam'rii attempting to invade Shrupak, the most sacred temple on Kalee, Kummar fighting with her swords and Sheelal with his slugthrower. Later, Kummar and Sheelal became separated during a battle with the Yam'rii on Kalee's beaches, by the Jenuwaa Sea. Unable to fight as effectively as when she was by her comrade-in-arms' side, she was violently killed by the barbed shears that were the Yam'rii's natural appendages. Her body was dragged out to sea.\nSheelal was distraught by his companion's death. He attempted to retrieve her body from the Jenuwaa Sea, to no avail, and it felt to him as if his soul was seeping out an imaginary but painful wound in his gut. Inconsolable, Sheelal made the perilous journey across the sea to Abesmi, a remote island monolith, to beseech the Kaleesh gods to resurrect Kummar so that he could see her one more time. His request fell on deaf ears, and Sheelal spent years trying to move on, with no success; ultimately, he decided that he was destined to suffer and mourn for his lost companion his entire life, and took the name \"Grievous.\" Grievous embarked on a path of destruction and despair that would last his entire life. He formed the elite Izvoshra fighting force, becoming the most barbaric warlord to ever live on Kalee. A bloodthirsty Grievous massacred the Yam'rii, chasing them off Kalee and pursuing them onto other colony worlds. The Galactic Republic eventually stood in and imposed harsh sanctions on the Kaleesh for Grievous' actions, and Kummar's homeworld entered a state of poverty.\nGrievous nearly perished in a shuttle crash several years later, and was remade as a cyborg. He served as the Supreme Commander of the Droid Armies of the Confederacy of Independent Systems during the Clone Wars, using the swordfighting skills Kummar had imparted on him with great effect against the Jedi. Grievous perished at the hands of the Jedi Master Obi-Wan Kenobi in 19 BBY, never having gotten over the death of Ronderu lij Kummar.\nAfter the Kaleesh–Imperial conflict, a female Kaleesh, who was believed to be the second incarnation of Kummar, led the Kaleesh people.\nRonderu lij Kummar was a being shrouded in mystery. She claimed to be the descendant of the Kaleesh gods, though this was unverified, and some individuals who lived after her time suspected she never actually existed. She had no loyalties, roaming from place to place and selling her services to different chieftains. Kummar was wild, and people were unsure what she was capable of; some thought it likely that she had killed her entire tribe. She was a talented warrior and hunter, preferring to use swords in combat and during the hunt.\nKummar had a great bond with Sheelal, the exact nature of which was not known. She might have been his long lost half-sister or his lover, depending on who one believed, but regardless, she and Sheelal were almost inseparable, fighting side-by-side for years. They were considered almost invincible, godlike by their fellow Kaleesh when fighting together, but when they fought separately they were far less effective, as evidenced by Kummar's death on the Jenuwaa's beaches. Sheelal spent the rest of his life in mourning over her death, never quenching his taste for bloodshed.\nThe character of Ronderu lij Kummar was created by Abel G. Peña for Unknown Soldier: The Story of General Grievous, published in Star Wars Insider 86 in February 2006. Joe Corroney illustrated art of Kummar. She was later featured in The Story of General Grievous: Lord of War, an online supplement to Insider 86 also written by Peña, and her name was listed as an example name for a member of the Kaleesh species in The Clone Wars Campaign Guide, released in early 2009. Ronderu's origins were based upon the story of Enkidu, a wild man who was raised by animals, from Ancient Mesopotamian work the Epic of Gilgamesh. In the story, Enkidu becomes the companion of Gilgamesh, on whom Grievous' origins were partly based. Wanting to have some differences between Ronderu's backstory and the Epic of Gilgamesh, Peña substituted the male Enkidu with the female Ronderu. Peña intentionally left the nature of the relationship between Grievous and Ronderu vague, hypothesizing that the two could have been merely best friends; lovers; half-siblings; both lovers and half-siblings; or have some other, unknowable type of relationship.\nWhen drawing Kummar's image for Insider, Corroney wanted to clearly establish that Kummar was a female. He considered playing up her bosom, but decided not to, picturing her as a lean and muscular fighter. He also thought the hair could have been part of the animal whose skull she wore as a mask. In his StarWars.com blog, Abel Peña spells the character's name as \"Ronderu lij Ku mmar,\" with a space between the \"u\" and \"m.\" However, this is not reflected in canon, as the non-spaced name is present in both works which reference the character.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Kalee/Legends",
  "/wiki/Kaleesh/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/General/Legends",
  "/wiki/Grendaju",
  "/wiki/Planet/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Kunbal_jungle",
  "/wiki/Huk_War",
  "/wiki/Alien/Legends",
  "/wiki/Yam%27rii/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Jenuwaa_Sea",
  "/wiki/Abesmi",
  "/wiki/Warlord/Legends",
  "/wiki/Supreme_Commander_of_the_Droid_Armies",
  "/wiki/Species/Legends",
  "/wiki/Karabbac/Legends",
  "/wiki/Lig_sword",
  "/wiki/Mumuu/Legends",
  "/wiki/The_Dreamer_and_the_Dreamt",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Outland_rifle",
  "/wiki/Insectoid/Legends",
  "/wiki/Shrupak",
  "/wiki/Slugthrower/Legends",
  "/wiki/Izvoshra/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Kaleesh%E2%80%93Imperial_conflict",
  "/wiki/Unidentified_female_Kaleesh_leader",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/February",
  "/wiki/2006",
  "/wiki/Joe_Corroney",
  "/wiki/The_Story_of_General_Grievous:_Lord_of_War",
  "/wiki/The_Clone_Wars_Campaign_Guide",
  "/wiki/2009",
  "/wiki/StarWars.com",
  "/wiki/Canon",
  "/wiki/Star_Wars_Insider",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Galaxy_at_War",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_27",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Official_Star_Wars_Fact_File_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_3_(2013)",
  "/wiki/Jedi_Council_Forums",
  "/wiki/March_23",
  "/wiki/2013",
  "/wiki/Star_Wars:_Blogs"
 ]
}