{
 "name": "Rond Fenimer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Rond Fenimer was a Human male who worked in a laboratory on Corellia as an administrative head during the time of the Galactic Civil War. He, and two other executives, Benn Calder and Pirt Rawklin, were killed by a spacer dispatched by Corellian Security Force Lieutenant Joth, when it became apparent that the laboratory was involved in some form of illicit activity. Upon being killed, the spacer employed by Lieutenant Joth collected Fenimer's passcode and used it to download information from his personal computer. Upon doing so, it was discovered that the laboratory was indeed involved in unsanctioned bioengineering projects.\nA Human male by the name of Rond Fenimer worked as an administrative head on an island laboratory on the Core World of Corellia during the time of the Galactic Civil War. Fenimer, and two other executives by the name of Benn Calder and Pirt Rawklin, oversaw the work of Mon Calamari Doctor Maldien, and the other researchers and security officers who operated within the laboratory. Meanwhile, in the capital city of Coronet, Lieutenant Joth of the Corellian Security Force became aware of rumors that the laboratory was involved in some form of illicit activity.\nEager to learn more, Joth employed a spacer to investigate the laboratory, and uncover more information. In the process of doing so, Joth instructed the spacer to kill Fenimer and the two other administrative heads. Despite putting up a fight with his small arsenal of pistols, Fenimer was killed, and the spacer collected from his body a passcode which was used to access and download information from his office computer. The information gleaned from the computer confirmed Lieutenant Joth's suspicions that the laboratory was being used for unsanctioned bioengineering projects on various creatures. In light of this, Joth ordered the spacer to shut down the facility.\nDuring his time as an administrative head in the Corellian laboratory, Rond Fenimer wore a long beige and brown-colored holiday jacket, over top a white and brown-colored muscle shirt. His other clothing consisted of a pair of light brown comfortable slacks and a pair of black dress shoes. His personal arsenal consisted of multiple types of blaster pistols and slugthrowers, including a D-18 pistol, an FWG-5 Flechette Smart Pistol, a Striker projectile pistol, and an SE-14 blaster pistol.\nRond Fenimer was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Rond Fenimer was added to the game with the release of the \"Publish 28\", on April 26, 2006. In the game, one of the quests, titled \"Coronet Murmurs: Agents of Destruction,\" featured Rond Fenimer. The objective of the quest was for players to kill Benn Calder, Pirt Rawklin, and Rond Fenimer for their passcodes, which could be used to proceed to the next quest objective.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Illegal_Lab_(Corellia)",
  "/wiki/Administrator/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Benn_Calder",
  "/wiki/Pirt_Rawklin",
  "/wiki/Death/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Lieutenant/Legends",
  "/wiki/Joth",
  "/wiki/Laboratory/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Bioengineering/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Maldien",
  "/wiki/Scientist/Legends",
  "/wiki/Security_officer/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Canon",
  "/wiki/Pistol/Legends",
  "/wiki/Species/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Holiday",
  "/wiki/Jacket/Legends",
  "/wiki/Shirt",
  "/wiki/Clothing/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Slugthrower/Legends",
  "/wiki/D-18_pistol",
  "/wiki/FWG-5_Flechette_Smart_Pistol",
  "/wiki/Striker_projectile_pistol",
  "/wiki/SE-14_blaster_pistol",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/April_26",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}