{
 "name": "Ronnan_Tyla_Vedij",
 "display_name": "Ronnan Tyla Vedij",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Navy",
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Baron Ronnan Tyla Vedij was a male Human from a wealthy family who was part of the Galactic Republic's navy. Vedij quickly obtained the rank of admiral, and later retired on the planet Coruscant while his two sons, Dhas Fenoep Vedij and Elon Vedij, served in the Imperial Navy of the Galactic Empire, the Republic's successor state. In 0 BBY, Vedij was killed by a traffic accident on Coruscant that Dhas believed was engineered by his father's enemies because the Baron had spoken out against the reworking of the Imperial Navy.\nRonnan Tyla Vedij was a Human born into a position of considerable wealth, and had family holdings on the planet Coruscant. A Baron, he chose to join the navy of the Galactic Republic, and, unlike his ancestors, took a combat-related role instead of buying a safe position. Vedij led a distinguished career in the navy, and once, when he was a bosun, suffered heavy wounds at the hands of alien commerce raiders. Vedij managed to deter the assault by himself, and this event caused him to be promoted to the rank of captain. Vedij later became an admiral, and while he was still in the navy, had two sons, Dhas and Elon Vedij, with his wife.\nThe Baron Admiral retired to Coruscant, and Vedij brought his sons up to believe in a strong military, something that was also believed by the Galactic Empire, the Republic's successor state. Dhas later joined the Imperial Navy, and was followed some years later by Elon. When Imperial Emperor Palpatine began to retool the military, Vedij became a vocal opponent of this movement. In 0 BBY, shortly after Dhas was transferred to the EF76 Nebulon-B escort frigate Far Orbit, Vedij and his wife were killed on Coruscant in a traffic accident, following a Robo-Hack misinterpreting routing instructions which caused it to go in the opposite direction. After Dhas, who inquired into the nature of the crash, was warned away by the Imperial Security Bureau, he believed that his father had been killed by the enemies he had made by opposing the retooling of the military. Dhas later led a mutiny on the Far Orbit because of the deaths of both his father and brother, who died fighting pirates shortly after Vedij.\nA man who believed in a strong military, Vedij chose to enter the line of combat in the navy instead of buying a safe position. Vedij was also a vocal opponent of Palpatine's changes to the military of the Empire.\nRonnan Tyla Vedij was first mentioned in 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games's Star Wars: The Roleplaying Game and was a sequel of sorts to the previous publication Pirates \u0026 Privateers, carrying on that book's theme by following the privateering vessel Far Orbit. Although Vedij is not identified as a Human in the book, this article assumes he is because his sons were Human.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Navy/Legends",
  "/wiki/Vedij_(disambiguation)",
  "/wiki/Coruscant/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Baron/Legends",
  "/wiki/Vedij_family",
  "/wiki/Military_rank/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dhas_Fenoep_Vedij",
  "/wiki/Elon_Vedij",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Death/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Space_warfare",
  "/wiki/Bosun/Legends",
  "/wiki/Unidentified_battle_(Ronnan_Tyla_Vedij)",
  "/wiki/Alien/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Ronnan_Tyla_Vedij%27s_wife",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Far_Orbit",
  "/wiki/Marriage/Legends",
  "/wiki/Robo-Hack",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Mutiny_on_the_Far_Orbit",
  "/wiki/Battle_of_the_Silent_Blades",
  "/wiki/1998",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Timothy_S._O%27Brien",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Privateer/Legends",
  "/wiki/Starship/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/0_ABY/Legends"
 ]
}