{
 "name": "RonTha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bandomeer"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Meerian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "RonTha was a Meerian who lived on the planet Bandomeer. He was a strict follower of rules and protocol, and believed in doing everything according to regulations. He took Obi-Wan Kenobi on a tour of the Agri-Corps Enrichment Zone building, and was very interested in the growth of the plants there, allowing himself to go on at considerable length about one small seed or the other. After Kenobi had been kidnapped from the Agri-Corps building by Offworld operatives and Xanatos, and taken to the deepsea mines of Bandomeer, RonTha was questioned by Qui-Gon Jinn, as to whether he had observed anything suspicious. At first, he denied being in the Agri-Corps building that night, as it was against rules to be there after hours. But after continued pressure from Jinn, he succumbed, and admitted that he had been in a orchard near the site of Kenobis' kidnapping, as he liked to have fruit from the orchard before bed. He told Jinn that he had seen some men carrying Kenobi away, and had followed in time to see them take him away by boat. He was then persuaded by Jinn to be allowed to take an Agri-Corps boat to rescue young Kenobi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bandomeer/Legends",
  "/wiki/Meerian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Agri-Corps_Enrichment_Zone",
  "/wiki/Plant/Legends",
  "/wiki/Offworld_Mining_Corporation",
  "/wiki/Xanatos",
  "/wiki/Deepsea_mines",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Orchard_(Eastern_Enrichment_Zone)",
  "/wiki/Agri-Corps_boat",
  "/wiki/Jedi_Apprentice:_The_Dark_Rival",
  "/wiki/Wizards.com",
  "/wiki/Ultimate_Alien_Anthology_Web_Enhancement",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}