{
 "name": "Ront_Byrnloo",
 "display_name": "Ront Byrnloo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown and gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure"
     ]
    }
   ]
  }
 ],
 "content": "Ront Byrnloo was a human male pirate and bounty hunter who worked as an enforcer for the Hutt crime lord Jabba Desilijic Tiure. He spent time at Chalmun's Spaceport Cantina in the spaceport of Mos Eisley on the planet Tatooine before accompanying Jabba to find the smuggler Han Solo in Docking Bay 94. Byrnloo and several other thugs began searching around Solo's ship, the Millennium Falcon, but the smuggler arrived and offered to pay back the money he owed the Hutt. After haggling with Solo over interest on the debt, Jabba called off Byrnloo and the others, and they left the docking bay.\nA native of the planet Corellia, the human male Ront Byrnloo was a pirate and bounty hunter who served the Hutt crime lord Jabba Desilijic Tiure as an enforcer. In the year 0 BBY, Byrnloo and two other human thugs were drinking at the bar of Chalmun's Spaceport Cantina in the spaceport of Mos Eisley on the planet Tatooine when local moisture farmer Luke Skywalker and the hermit Obi-Wan Kenobi entered with the droids C-3PO and R2-D2.\nByrnloo and the two others then left the cantina and joined Jabba, three Rodians, and the bounty hunter Boba Fett in traveling to Docking Bay 94 in Mos Eisley, where the YT-1300 light freighter known as the Millennium Falcon was docked. The starship belonged to Han Solo, a smuggler who worked for Jabba but owed him money after dumping a shipment of the Hutt's spice in space upon encountering an Imperial ship. Byrnloo and his cohorts began searching around the ship as Jabba called out to Solo to come out and meet him.\nThe sisters Brea and Senni Tonnika, who were planning on stealing the Falcon, then sneaked in the back of the docking bay. Upon seeing Byrnloo and the other thugs with Jabba, the pair abandoned their plan and left to look for a different ship. Solo, who was not aboard the ship at all, then surprised Byrnloo and the others when he addressed Jabba from the entryway to the bay, having just arrived from the nearby cantina.\nThe Hutt chastised Solo for having not repaid him and for killing Greedo, another of his thugs, in the cantina. Solo then offered to repay the Hutt with interest using credits from a job he had just accepted from Kenobi. The two haggled over the interest amount that the smuggler would pay, settling on fifteen percent. Satisfied, Jabba called off his men, and Byrnloo and the others made their way out of the docking bay.\nRont Byrnloo had light skin, brown eyes, and brown-and-gray hair, including a large beard. Boba Fett considered Byrnloo and the other henchmen in Docking Bay 94 \"duds\" and did not believe any of them were professional, while Han Solo considered them all ugly.\nRont Byrnloo carried a blaster pistol while in Docking Bay 94. He also wore black pants and boots and a white, long-sleeved shirt with a brown, sleeveless duster over it.\nRont Byrnloo was portrayed by the actor \"Big\" Ron Tarr in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. He was present for two scenes in the film, the cantina and the docking bay, the latter of which was cut from the original 1977 release but later included as part of the Special Edition re-release of the film in 1997. The docking bay scenes were filmed between Friday, April 9, and Thursday, April 22, 1976, on stage 3 at Elstree Studios, while the cantina scenes were filmed on stage 6 at Elstree between Tuesday, April 12, and Thursday, April 22.\nThe character went unnamed for forty years after his first appearance, until Lucasfilm Story Group member Pablo Hidalgo named him using a combination of the actor's name and the name of attendee Bryan Lewis at the \"Behind the Scenes of the Cantina\" panel at Star Wars Celebration Orlando on April 15, 2017. The idea of pirates accompanying Jabba to Docking Bay 94 originated in the third draft of the film's script, with the revised fourth draft originally describing the thugs accompanying Jabba as six alien pirates and purple creatures. While three Rodian aliens made it into the film, the purple creatures were replaced with humans, including Byrnloo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ront_Byrnloo",
  "/wiki/Unidentified_henchman_(Tatooine)",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/File:Solo-Twerps.ogg",
  "/wiki/Pirate",
  "/wiki/Bounty_hunter",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Time",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Spaceport",
  "/wiki/Mos_Eisley",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Docking_Bay_94",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Credit",
  "/wiki/Corellian",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Cantina",
  "/wiki/Moisture_farmer",
  "/wiki/Luke_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Droid",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Rodian",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Boba_Fett",
  "/wiki/Starship",
  "/wiki/Spice",
  "/wiki/Realspace",
  "/wiki/Galactic_Empire",
  "/wiki/File:Tonnikas-Blast.ogg",
  "/wiki/Brea_Tonnika",
  "/wiki/Senni_Tonnika",
  "/wiki/Thief",
  "/wiki/Hangar",
  "/wiki/Death",
  "/wiki/Greedo",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Blaster_pistol",
  "/wiki/Boot",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Ron_Tarr",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/1997",
  "/wiki/April_9",
  "/wiki/April_22",
  "/wiki/1976",
  "/wiki/Elstree_Studios",
  "/wiki/April_12",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Bryan_Lewis",
  "/wiki/Celebration_Orlando",
  "/wiki/April_15",
  "/wiki/2017",
  "/wiki/Alien",
  "/wiki/Star_Wars_Storybook_Collection:_Star_Wars:_The_Prequel_Trilogy_Stories_and_Star_Wars:_The_Original_Trilogy_Stories",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars:_A_New_Hope_Cinestory_Comic",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/A_Bad_Feeling_About_This",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/Added_Muscle",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/You_Owe_Me_a_Ride",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Ront_Byrnloo",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/File:RontByrnlooTwitter.png",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/The_Art_of_Star_Wars_Episode_IV:_A_New_Hope"
 ]
}