{
 "name": "Rook Kast",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown; later purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Death Watch",
      "Shadow Collective",
      "Mandalorian super commandos",
      "Mandalorian super commandos"
     ]
    }
   ]
  }
 ],
 "content": "Rook Kast was a human female Mandalorian warrior who led the Shadow Collective's super commandos during the Clone Wars. After Maul, leader of the Shadow Collective, was imprisoned by the Sith on Stygeon Prime, Kast and commando Gar Saxon freed Maul and brought him to a Shadow Collective base on Zanbar. They were tracked by the forces of the Confederacy of Independent Systems and, in the ensuing battle, forced to flee to Ord Mantell. From there, they repelled a Separatist attack. Kast and Maul captured the Droid Army General Grievous in orbit, while Maul's ground forces captured the Separatist leader, Count Dooku.\nThe Shadow Collective took their prisoners to a Mandalorian asteroid base, which was assaulted by the Galactic Republic and Jedi Order in an attempt to capture Dooku themselves. Kast, Maul, Dooku, and some of Maul's forces fled and set a course for Dathomir. They were tracked by Darth Sidious, the Dark Lord of the Sith, who fought alongside Dooku and Grievous in destroying the Shadow Collective forces. Kast recovered Maul from the battle, and they fled the planet.\nLater, Kast participated in the Siege of Mandalore and helped lure an unsuspecting Ahsoka Tano into the undercity of Sundari. There, she and several other super commandos surrounded the former Jedi Padawan for Maul, but she eventually managed to escape. Shortly afterwards, the super commandos managed to capture ARC Trooper Jesse and interrogate him. After his interrogation, Maul managed to rally the Mandalorians for one last push, but this led to defeat and Kast's capture at the hands of Bo-Katan Kryze.\nA human female born on the Outer Rim planet Mandalore, Rook Kast was the leader of the Mandalorian super commandos—Mandalorian soldiers who served the Sith Lord Maul and were a part of his criminal alliance, the Shadow Collective, during the Clone Wars.\nIn the year 19 BBY, after Maul was bested in combat by his former master, Darth Sidious, he was imprisoned in the Spire, a Confederacy of Independent Systems prison on the planet Stygeon Prime. Kast and Commander Gar Saxon followed Sidious and Maul to Stygeon, and were tasked by Mandalorian Prime Minister Almec, whom Maul had selected as the public leader of Mandalore after his takeover of the planet, with infiltrating the Spire and rescuing Maul.\nKast and Saxon dispatched two commando droids on the balcony of the prison's third level before updating the Prime Minister on their progress. After setting charges on the balcony entrance, the pair entered the prison and made their way to level seven, where Maul was being held. As they approached his cell, they encountered a quartet of droidekas and several B2-series super battle droids, but managed to deactivate the super battle droids and fire a missile at the droidekas, clearing the way to Maul's cell. Once Maul was freed, the two Mandalorians blew a hole in the prison wall and shot a zipline out towards their Gauntlet fighter, allowing the three to escape the planet and return to a Shadow Collective base on the moon of Zanbar. However, they were unaware that the Separatists had tracked them back to their base.\nSighting several incoming C-9979 landing crafts in Zanbar's atmosphere, Kast informed Maul that Separatist forces had arrived. The Zabrak ordered his troops to engage the Separatist Droid Army, resulting in a battle which saw heavy losses for both factions. As the battle neared its end, Maul engaged General Grievous, leader of the Droid Army, in a lightsaber duel. Kast, aboard Maul's Gauntlet fighter, the Nightbrother, ordered the pilot to lower the ship closer to Maul, allowing him to jump on board. Maul ordered Kast to take them away from the moon, and the remaining troops at Zanbar regrouped with the larger Shadow Collective force and traveled to a Black Sun base on Ord Mantell.\nIn Ord Mantell City, Kast attended a meeting with Maul, Saxon, Black Sun leader Ziton Moj, and Pyke Syndicate majordomo Fife. Maul, knowing that Separatist leader Count Dooku, Grievous, and the Droid Army would be coming for them, laid out a plan for the other four on how to deal with the incoming Confederate forces. After receiving word that a shuttle from Dathomir had arrived, which was carrying Nightbrothers to aid the Shadow Collective, Maul and Saxon left to greet the shuttle, while Maul ordered Kast to inform the others of his plan.\nThe Separatists forces soon arrived, bombarding the city from space before landing their own troops. As the Mandalorians, Black Sun, and Pykes engaged the Separatists on the planet surface, Maul and Kast took the Nightbrother into Ord Mantell's orbit and boarded Grievous's command ship. Maul stormed the ship's bridge and threatened to kill Grievous if he did not shut down the Separatist droids. Grievous complied, leading to a swift Shadow Collective victory which saw the capture of Grievous as well as Dooku, who had been battling the Nightbrothers on the surface of Ord Mantell.\nThe Shadow Collective took their captives back to Vizsla Keep 09, a Mandalorian supply outpost hidden in the rings of Phelbos, and Maul contacted his old master, Sidious, informing him of their capture. Maul ordered Kast to lock Grievous away in the outpost's brig while he spoke with Dooku. A Galactic Republic task force, led by Jedi Generals Mace Windu, Obi-Wan Kenobi, Tiplee, and Aayla Secura, soon arrived at the Keep and began to do battle with the Mandalorian forces.\nKast informed Maul that the Jedi had arrived in the third hangar, prompting Dooku to temporarily ally himself with Maul. The two Sith began dueling the Jedi, quickly leading to the death of Master Tiplee. Kast fired a missile at the Jedi, rendering both Secura and Windu unconscious. Maul, Dooku, Kast, and Saxon retreated from the outpost aboard the Nightbrother and traveled to Dathomir.\nShortly before entering Dathomir's atmosphere, Maul—revealing to Dooku that he knew the count still remained loyal to Sidious and did not truly wish to ally himself with Maul—had Kast hold her blaster to Dooku's head and watch his every move as their ship landed at the Nightbrother village, where they disembarked. Kast handed Dooku over to the Nightbrothers, who brought him and Maul to a chamber in the village which was said to be the heart of the power of Mother Talzin, a Dathomirian witch who had once led the Nightsisters and was the mother of Maul.\nAs Talzin drained Dooku's life force so that she could take physical form once again, Sidious and Grievous arrived on Dathomir aboard a cloaked ship and entered the chamber. The cyborg general and Dark Lord engaged Maul and the Talzin-possessed Dooku in lightsaber combat as Kast, on board the Nightbrother, communicated with Ziton Moj and Fife as their forces were bombarded by a Separatist assault. Kast ordered the two to follow their orders and fight, however they threatened to withdraw from the Shadow Collective if they did not receive support. After losing many of their own ships and not receiving assistance, Black Sun and the Pykes informed Kast that they would no longer support the Collective. Kast protested, threatening to track them down and kill them herself, however Moj and Fife remained unfazed, and ended their transmission.\nA commando informed Kast that a Separatist invasion fleet was approaching the planet, and the two flew to Maul's location and told him they needed to evacuate at once. Talzin, who had managed to regain her physical form, held off a barrage of Force lightning from Sidious and Dooku, who had regained control of his body, and told her son to leave without her. Maul refused, however the witch threw him back towards the Nightbrother so that he may escape. Despite Maul's protests, Kast and the other commando grabbed hold of Maul and pulled him up the ship's ramp. Maul cried out in anguish as he watched Grievous step forward and stab Talzin with his lightsabers, killing her. Maul, Kast, and the commando boarded the Nightbrother and fled the planet just as the Separatists landed their forces on Dathomir, ravaging the Nightbrother village.\nEventually, Kast and the rest of the super commandoes regrouped on Mandalore within the domed city of Sundari. During the last days of the Clone Wars, the Mandalore resistance and the Galactic Republic launched a joint invasion of Mandalore. After ending a transmission with the invaders, Almec tasked Kast with contacting the rest of the Collective, which had been reformed, and informing them about the invasion.\nLater, she ventured into the undercity of Sundari as part of a trap to lure out the former Jedi Padawan Ahsoka Tano. Gar Saxon and several other super commandos lured Republic forces down into the sewage ports and, as they explored, Kast contacted Almec to inform him of the plan's continued success before they were cutoff by an invasion of the royal palace. As the Republic forces ventured deeper into the undercity, Kast waited with her forces to ambush them. Eventually, Kast emerged from hiding and fired an explosive at the Republic forces, disorienting them and luring them out to be killed by her and the rest of the super commandos. After effortlessly eliminating the clone troopers in the undercity, the super commandos surrounded Tano as Maul emerged from hiding to confront her.\nAs Kast and the other Mandalorians continued to train their weapons on Tano, Maul walked out and spoke with the former Jedi. As they talked, Tano clicked a button on her wrist comm, calling her forces to her position. As they arrived, the Mandalorians entered a firefight with the clones as Maul and Tano crossed sabers. Knowing it wasn't time for a confrontation, Maul left along with Kast and the surviving Mandalorians. Tano and the clones continued to chase them through the undercity but the Mandalorians managed to throw the clones off their trail, disappearing deeper into the tunnels.\nIn a counterattack, the Mandalorians ambushed the clones on their way fortify C-deck, leading to the capture of ARC Trooper Jesse. Being brought before Maul, Jesse was kept in stun cuffs and held in place by Kast. As Jesse told Maul that he would not tell him anything, Maul made sure he knew the contrary was true as Kast began to smile. As Jesse continued to squirm, Maul probed his mind using the Force, searching for information on who Ahsoka Tano was. Kast held him in place as Jesse began to scream in agony.\nAfter Jesse's interrogation, Maul contacted the leaders of the syndicates within the Shadow Collective, telling them to go into hiding. As Saxon returned from his mission to assassinate Almec , Kast informed him of this fact. As Maul reminded Kast and Saxon of their help in liberating him from the Spire on Stygeon Prime, he turned towards them and informed them of him and Dooku's purpose in Sidious' grand plan. Kast then asked Maul what this meant, to which Maul informed all of the Mandalorians present that the galaxy would soon be controlled by another power and that they would thrive in the chaos. He promised them that they would die on the battlefield, as warriors, rallying the Mandalorians for one last attack against the Mandalorian resistance and Republic.\nIn one last counterattack, Kast and Saxon led a charge against the joint Mandalorian resistance and Republic forces while they attempted to move civilians to safe zones. As the two sides charged towards one another, Kast fired her blasters into the crowd of troopers, eventually coming face to face with several and killing each of them with ease. However, reinforcements from the Mandalorian resistance eventually arrived. With them arrived Bo-Katan Kryze, their leader, who entered into hand-to-hand combat with Kast before the Mandalorians were forced to surrender due to the overwhelming numbers of the Mandalorian resistance and Republic together. Maul then abandoned the Mandalorians as he attempted to escape, but was captured by Republic forces after losing his duel with Tano.\nRook Kast was intensely loyal to the Shadow Collective cause and to Maul, personally coming to evacuate him on multiple occasions and showing concern for his safety as he faced Grievous on Zanbar and even forcibly attempting to bring Maul onto his ship on Dathomir before the Separatists landed their troops and laid waste to the world. When Black Sun and the Pykes announced to Kast that they would no longer aid the Collective, Kast was quick to make the threat that she would go after them and kill them herself should they desert. Though some Mandalorians, such as Bo-Katan Kryze and many of her Nite Owls, refused to accept Maul as the leader of Mandalore due to him being an outsider—despite besting the previous leader, Pre Vizsla, in combat—Maul's non-Mandalorian heritage did not present an issue for Kast, and she faithfully served him regardless.\nAs a female member of the human species, Kast had brown hair, blue eyes, and fair skin. By the time of the Siege of Mandalore, Kast had purple hair.\nLike all Mandalorian soldiers, Kast wore Mandalorian armor over a black body glove, as well as a jetpack, which could be used to launch missiles. Around each of her forearms was a Mandalorian vambrace, which contained a zipline. Kast's armor, like most Mandalorian super commandos, was painted red and black, meant to resemble Maul's appearance, and featured the Shadow Collective's black hand symbol on her right shoulder pad. Kast's helmet was different from most traditional Mandalorian helmets however, featuring two pointed slopes atop it. During the Siege of Mandalore, Kast utilized two WESTAR-35 blaster pistols.\nRook Kast first appeared in Star Wars: Darth Maul—Son of Dathomir, a four-part comic miniseries written by Jeremy Barlow with art by Juan Frigeri that ran from May to August in 2014 and was adapted from unfinished episodes of the animated television series Star Wars: The Clone Wars. Prior to the release of Son of Dathomir, Kast was first mentioned in the \"Blaster\" section of Star Wars Insider 149, released on April 22, 2014, as one of the new things fans could expect to see in Son of Dathomir. Kast later appeared in the seventh season of Star Wars: The Clone Wars, where she was voiced by Vanessa Marshall.\nLucasfilm Story Group creative executive Pablo Hidalgo stated on Twitter that Rook Kast was one of a few elements that inspired the design of the Star Wars Rebels character Sabine Wren.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rook_Kast",
  "/wiki/Rook_Kast/Legends",
  "/wiki/Rook_(disambiguation)",
  "/wiki/Kast",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Mandalore",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Death_Watch",
  "/wiki/Shadow_Collective",
  "/wiki/Mandalorian_super_commando",
  "/wiki/Mandalorian",
  "/wiki/Soldier",
  "/wiki/Clone_Wars",
  "/wiki/Maul",
  "/wiki/Prison",
  "/wiki/Sith",
  "/wiki/Stygeon_Prime",
  "/wiki/Commando",
  "/wiki/Gar_Saxon",
  "/wiki/Escape_from_the_Spire",
  "/wiki/Zanbar_Death_Watch_camp",
  "/wiki/Zanbar",
  "/wiki/Confederacy_military",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Zanbar",
  "/wiki/Ord_Mantell",
  "/wiki/Battle_of_Ord_Mantell",
  "/wiki/Separatist_Droid_Army",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Orbit",
  "/wiki/Head_of_State",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Prisoner",
  "/wiki/Vizsla_Keep_09",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Order",
  "/wiki/Dathomir",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Second_Battle_of_Dathomir",
  "/wiki/Planet",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Ahsoka_Tano",
  "/wiki/Undercity",
  "/wiki/Sundari",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5597",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Reproduction",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Sith_Lord",
  "/wiki/Standard_year",
  "/wiki/19_BBY",
  "/wiki/Battle_of_Mandalore",
  "/wiki/Lightsaber_combat",
  "/wiki/Sith_Master",
  "/wiki/Spire_(Stygeon_Prime)",
  "/wiki/Commander",
  "/wiki/Prime_Minister",
  "/wiki/Almec",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/BX-series_droid_commando",
  "/wiki/Droideka",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Battle_droid",
  "/wiki/Missile",
  "/wiki/Kom%27rk-class_fighter/transport",
  "/wiki/Moon",
  "/wiki/C-9979_landing_craft",
  "/wiki/Atmosphere",
  "/wiki/Zabrak",
  "/wiki/Troop",
  "/wiki/Supreme_Martial_Commander_of_the_Separatist_Droid_Armies",
  "/wiki/Droid",
  "/wiki/Army",
  "/wiki/Lightsaber_duel",
  "/wiki/Starfighter",
  "/wiki/Nightbrother_(Gauntlet_fighter)",
  "/wiki/Pilot",
  "/wiki/Starship",
  "/wiki/Black_Sun",
  "/wiki/Ord_Mantell_City",
  "/wiki/Ziton_Moj",
  "/wiki/Pyke_Syndicate",
  "/wiki/Majordomo",
  "/wiki/Fife",
  "/wiki/Shuttle",
  "/wiki/Nightbrothers",
  "/wiki/Orbital_bombardment",
  "/wiki/City",
  "/wiki/Realspace",
  "/wiki/Pyke",
  "/wiki/Command_ship",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Bridge_(starship)",
  "/wiki/Death",
  "/wiki/Asteroid_field",
  "/wiki/Phelbos",
  "/wiki/Jedi_General",
  "/wiki/Mace_Windu",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Tiplee",
  "/wiki/Aayla_Secura",
  "/wiki/Assault_on_Vizsla_Keep_09",
  "/wiki/Hangar",
  "/wiki/Jedi_Master",
  "/wiki/Blaster",
  "/wiki/Nightbrother_village",
  "/wiki/Mother_(title)",
  "/wiki/Talzin",
  "/wiki/Dathomirian",
  "/wiki/Witch",
  "/wiki/Nightsisters",
  "/wiki/Parent",
  "/wiki/Cloaking_device",
  "/wiki/Scimitar",
  "/wiki/Cyborg",
  "/wiki/Possession",
  "/wiki/Lightsaber",
  "/wiki/Fleet",
  "/wiki/Force_lightning",
  "/wiki/File:RookKastAlmec.ogg",
  "/wiki/Mandalore_resistance",
  "/wiki/Clone_trooper",
  "/wiki/Wrist_comm",
  "/wiki/Time",
  "/wiki/File:MaulRook-TPA.ogg",
  "/wiki/C-deck",
  "/wiki/Stun_cuffs",
  "/wiki/Mind_probe",
  "/wiki/The_Force",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Nite_Owls",
  "/wiki/Mand%27alor",
  "/wiki/Pre_Vizsla",
  "/wiki/Species",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Mandalorian_armor",
  "/wiki/Body_glove",
  "/wiki/Jetpack",
  "/wiki/Limb",
  "/wiki/Mandalorian_vambrace",
  "/wiki/Armor",
  "/wiki/WESTAR-35_blaster_pistol",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Darth_Maul%E2%80%94Son_of_Dathomir",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Jeremy_Barlow",
  "/wiki/Juan_Frigeri",
  "/wiki/May",
  "/wiki/August",
  "/wiki/2014",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/April_22",
  "/wiki/The_Clone_Wars:_Season_Seven",
  "/wiki/Vanessa_Marshall",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Sabine_Wren",
  "/wiki/Category:Images_of_Rook_Kast",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_1",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_2",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_4",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/The_Phantom_Apprentice",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_68",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_73",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/The_End_of_the_Clone_Wars",
  "/wiki/The_Lawless",
  "/wiki/Eminence_(episode)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Shades_of_Reason",
  "/wiki/Databank_(website)",
  "/wiki/Dark_Disciple",
  "/wiki/Massacre",
  "/wiki/Nightsisters_(episode)",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Dave_Filoni",
  "/wiki/January_10",
  "/wiki/Titan_Magazines",
  "/wiki/File:Sabine_design_inspiration.png"
 ]
}