{
 "name": "Roos_Tarpals",
 "display_name": "Roos Tarpals",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.24 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple and white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gungan Grand Army"
     ]
    }
   ]
  }
 ],
 "content": "Roos Tarpals was a Gungan male who served in the Gungan Grand Army during the Invasion of Naboo and the Clone Wars. Prior to the Invasion of Naboo, he served as captain of a patrol in Otoh Gunga. After the Battle of Naboo, Tarpals was promoted to general. During the Clone Wars, he sacrificed himself to protect Naboo from being conquered by General Grievous.\nRoos Tarpals was a Gungan warrior who served in the Gungan Grand Army during the Invasion of Naboo. He was acquainted with Jar Jar Binks, who was banished from Otoh Gunga because of his \"clumsiness.\" During the Trade Federation's invasion of Naboo, Binks returned with two Jedi emissaries—Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi—who had come seeking help to get to the Naboo. Upon arriving, Tarpals and a colleague, who were riding kaadu, apprehended Binks. Tarpals warned Binks that he was in \"big doo-doo\" this time.\nTarpals brought Binks and the two Jedi visitors before Boss Nass, the ruler of Otoh Gunga. Master Jinn saved Binks from punishment by enlisting his services as a guide to bring them to Theed, the capital of Naboo. Boss Nass reluctantly granted Binks clemency and sent him away. Later, Tarpals was present when the Naboo Queen Padmé Amidala convinced the Gungans and Naboo to put aside their differences so that they could defeat the Trade Federation invaders. As a reward for his role in bringing the Gungans and Naboo together, Jar Jar Binks was promoted to the position of Bombad General in the Gungan Grand Army.\nDuring the battle on the Grassy Plains, Tarpals served under the command of General Binks. Despite fighting bravely, the Grand Army was outnumbered and forced to retreat by the Trade Federation's droid army. During their chaotic retreat, Tarpals saved Binks from being killed by the battle droid commander of an AAT tank. Shortly thereafter, both Tarpals and Binks were captured by battle droids. However, the destruction of the orbiting Droid Control Ship disabled all of the battle droids, turning the tide of the battle in favor of the Gungans and their Naboo allies.\nDuring the Clone Wars, Roos Tarpals was present when the Jedi Master Yoda requested assistance from the Gungan Grand Army to aid Mon Calamari forces during the Battle of Mon Cala. A Gungan detachment led by the Gungan Representative Binks fought Separatist forces led by Riff Tamson alongside Clone SCUBA troopers, Mon Calamari, and Quarren forces.\nAs the Clone Wars dragged on, tensions between the Gungans and the Naboo led the reigning Boss Lyonie to offer to aid the Confederacy of Independent Systems by sending the Gungan Grand Army to invade the Naboo capital of Theed. Unknown to everyone, Lyonie was being controlled through an amulet by Rish Loo, one of his ministers who was secretly working for the Separatist leader Count Dooku. Senator Amidala and the Jedi Knight Anakin Skywalker managed to remove the amulet from Lyonie. However, Rish Loo sent a squad of BX droid commandos to attack them, and Lyonie was wounded during the assault. With Lyonie unable to call off the attack, Binks assumed the identity of Boss Lyonie in an attempt to call off the Separatist attack.\nTarpals accompanied Binks when the fake \"Boss\" climbed aboard the Separatist landing ship to help \"coordinate the attack.\" While Binks distracted the Separatist commander General Grievous, Tarpals informed Amidala of the Separatist general's presence. When Grievous realized that Binks was an impostor, he pursued the Gungan outside the ship. Tarpals and several other Gungans surrounded the cyborg general and attacked him. Even with his battle droids deactivated, Grievous posed a significant threat, and he was well aware that he stood no chance against the Separatist General. Soon Tarpals and Grievous were fighting each other head to head. During the skirmish, Tarpals was mortally wounded but used the last of his strength to \"shock\" Grievous into submission, which caused the cyborg's internal systems shorted out, making it easy for nearby warriors to capture him. Despite his death, Tarpals helped to defeat a Separatist plot to divide the Gungans and Naboo. However, the Naboo and Gungans were forced to release General Grievous when Count Dooku captured and threatened Skywalker's life.\nDespite the fact that it cost him his life, Roos Tarpals accomplished something that not even the Jedi had done before: he defeated General Grievous. Though the Naboo and Gungan later exchanged Grievous for Anakin Skywalker, Roos Tarpals' sacrifice inspired his people to face an enemy that seemed unstoppable; and win it.\nA Gungan captain who went on to become the leading general of their Grand Army, Roos Tarpals was gravelly-voiced but loyal to his allies, willing to lay down his life to ensure their victory. Although he initially disliked the surface dwelling Naboo humans, he came to respect them after Queen Padmé Amidala's humble plea for help that proved she saw the Gungans as equals. Well into the Clone Wars, Tarpals still believed in the friendship between the Gungans and Naboo.\nEven though Tarpals had needed to go through many annoyances caused by Jar Jar Binks, the captain served under Binks during the Battle of Naboo Tarpals also appeared to have a friendship with Binks, and urged for the newly-promoted general to not give up. During the Clone Wars, the two successfully worked together.\nTarpals first appeared in Star Wars: Episode I The Phantom Menace, voiced by Steven Speirs. In Star Wars: The Clone Wars, he was voiced by Fred Tatasciore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Roos_Tarpals",
  "/wiki/Roos_Tarpals/Legends",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Special:Upload",
  "/wiki/Naboo",
  "/wiki/20_BBY",
  "/wiki/Gungan",
  "/wiki/Otolla",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Gungan_Grand_Army",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Clone_Wars",
  "/wiki/Captain",
  "/wiki/Otoh_Gunga",
  "/wiki/Battle_of_Naboo",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/File:Captain_Tarpals.png",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Trade_Federation",
  "/wiki/Jedi",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Kaadu",
  "/wiki/Boss",
  "/wiki/Rugor_Nass",
  "/wiki/Theed",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Boss_Meetup",
  "/wiki/Bombad_General",
  "/wiki/OOM_command_battle_droid",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/B1-series_battle_droid",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Yoda",
  "/wiki/Mon_Calamari",
  "/wiki/Battle_of_Mon_Cala",
  "/wiki/Riff_Tamson",
  "/wiki/Clone_SCUBA_trooper",
  "/wiki/Quarren",
  "/wiki/File:TarpalsSacrifice-SW.jpg",
  "/wiki/Lyonie",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Rish_Loo",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/BX-series_droid_commando",
  "/wiki/C-9979_landing_craft",
  "/wiki/File:Tarpals-leading-Gungans.png",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Steven_Speirs",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Fred_Tatasciore",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Gungan_Attack",
  "/wiki/Shadow_Warrior",
  "/wiki/Darth_Vader_(2020)_3",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Naboo_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/The_Clone_Wars_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/The_Separatists",
  "/wiki/The_Heroes_of_Naboo_and_Other_Characters_From_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Prisoners",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Death",
  "/wiki/Standard_year"
 ]
}