{
 "name": "Ropok",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "IsoTech"
     ]
    }
   ]
  }
 ],
 "content": "Ropok was a male Twi'lek who started the company IsoTech during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. During the war, Ropok sympathized with the Confederacy. When the conflict came to an end with a Republic victory, Ropok set up a deal with Captain Rel Harsol, the Separatist captain of the Munificent-class star frigate Sa Nalaor. Harsol had rescued the Separatist cybernetics expert Cratala from capture by the newly formed Galactic Empire, and the pair planned to work with Ropok to expand IsoTech into a black market cybernetics business. Harsol sent his droid IT-3PO to finalize the details of the plan, but when Cratala and Harsol reached Cholganna, the planet they intended to set up base on, their ship crashed onto the planet, where they became stranded and unable to communicate with the rest of the galaxy. Just prior to the ship's crash the captain attempted to send Ropok a message pod, containing data on the coordinates of their crash, but the pod never reached the Wheel space station where Ropok worked. Without the cybernetics, Ropok found other means to keep IsoTech going, but he was eventually arrested by Imperials and imprisoned. He died while incarcerated and his children, a son named Reom and a daughter named Shira, took over IsoTech, running it successfully, and eventually receiving the message pod which led to them hiring spacers to find and save the crew of the Sa Nalaor.\nRopok was first mentioned in 2013 in Beyond the Rim an adventure module written by Sterling Hershey for the Fantasy Flight Games roleplaying game, Star Wars: Edge of the Empire.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/IsoTech",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Rel_Harsol",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Sa_Nalaor/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Cratala",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Droid/Legends",
  "/wiki/IT-3PO",
  "/wiki/Cholganna/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Message_pod",
  "/wiki/The_Wheel/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Reom",
  "/wiki/Shira_(Twi%27lek)",
  "/wiki/Spacer/Legends",
  "/wiki/2013",
  "/wiki/Beyond_the_Rim",
  "/wiki/Sterling_Hershey",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}