{
 "name": "Rorax Falken",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Ghost Jedi"
     ]
    }
   ]
  }
 ],
 "content": "Rorax Falken was a renowned physicist and one of the multitude of scientists and engineers whose work was incorporated into the first Death Star.\nWhen he discovered that the Galactic Empire had put his well-intentioned ideas to use in a weapon of mass destruction, he suffered a massive nervous breakdown. Falken was confined to a repulsorchair from that point on and became very secretive. He was easily noticed because of his repulsorchair, but also by his wild and unkempt gray hair.\nAfter retiring to Mrlsst, Falken's work became the founding influence and songwriter for the band Ghost Jedi. His music had been praised throughout the galaxy as precise, yet emotionless, much like the scientific work he performed. The band also served as his agents on the planet.\nFalken later became a key member of the Phantom Project and secretly begun the development of the gravitic polarization beam. In addition to his research on these projects, he also supervised the installation of the security holocams that came to cover the entire Academy. Unknown to all but himself and a handful of co-conspirators, these cameras were two-way and also worked as projectors, allowing him to create holographic illusions at will anywhere on the campus. Using this technology, he eventually developed Mrlssi Laser Phantoms. The most famous of these was built on Taj Junak, a martyred Jedi Knight, and soon created rumors that the Academy was haunted by his ghost.\nWhile attempting to stall the Empire's realization that the project was a hoax in 4 ABY, he came into conflict with both Rogue Squadron, an Imperial task force commanded by Captain Loka Hask, and the latter's allies in the neo-Imperial Ante-Endor Association. Falken increasingly used Mrlssi Laser Phantoms to set the contending factions against each other, sowing confusion and distrust on the Academy grounds. First he falsified a security recording to imply that Alliance pilot Tycho Celchu had stolen secret materials, leading to the arrest of the Squadron's leader, Wedge Antilles. To further undermine the negotiations between the Academy authorities and the two galactic governments, he then used another Phantom, this one of the \"Ghost Jedi\", to help him escape. Finally, Falken also coerced the Wookiee Groznik into serving as his bodyguard by showing him a Phantom of Throm Loro, his master. All the while, as the bickering factions struggled, Falken watched them through the holocams from his orbital base of operations.\nRogue Squadron eventually discovered the location of Falken's base and invaded it, stealing the blueprints of the Gravitic Polarization Beam before escaping. Falken was killed shortly thereafter, when Hask's forces attacked his satellite base, but succeeded in denying the Empire the use of his ultimate weapon, which he destroyed by creating a hyperspace wormhole.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Ghost_Jedi",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Power_chair",
  "/wiki/Mrlsst/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Phantom_Project",
  "/wiki/Gravitic_polarization_beam",
  "/wiki/Holocamera",
  "/wiki/Mrlssi_Laser_Phantoms",
  "/wiki/Taj_Junak",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Force_ghost",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Loka_Hask",
  "/wiki/Ante-Endor_Association",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Groznik",
  "/wiki/Throm_Loro",
  "/wiki/Hyperspace_wormhole",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_The_Phantom_Affair",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_In_the_Empire%27s_Service",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/Star_Wars_Handbook_1:_X-Wing_Rogue_Squadron",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Suns_of_Fortune"
 ]
}