{
 "name": "Rora_Seake",
 "display_name": "Rora Seake",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red-orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Rora Seake was a Sith pureblood female who served as an assassin for the Sith Empire during the Cold War with the Galactic Republic. Known as a master of beasts, Seake kept two massive creatures known as jurgorans as her pets and controlled them in combat. In 3643 BBY, she was sent to the planet Taris to wipe out a small Republic colony, but the secrecy of her mission was compromised, and a young Jedi Knight defended the colony against Seake, killing both her and her pets.\nA female member of the Sith species, Rora Seake was trained as a Sith assassin by the Sith Empire and acquired two jurgorans—large creatures from the planet Dromund Kaas—that she kept as pets, using the Force to control them. As a result, she gained a reputation among the Empire as a master of beasts. In 3643 BBY, during the Cold War between the Empire and the Galactic Republic, Seake was sent to the planet Taris and tasked with wiping out one of the Republic's new colony settlements that it was establishing as part of its resettlement efforts. Seake was also alerted to the presence of Watcher One, an agent of the Empire's intelligence branch who was working for the Sith Lord Darth Angral. Seake brought her two pet jurgorans along with her to Taris and soon located her target—a bunker built along the shores of Lake Brell.\nHowever, Seake was irritated to find that a young Jedi Knight was already in the colony and was attempting to evacuate the colonists before she arrived. The Knight had learned of Seake's mission from the Imperial operative Watcher One and had rushed to intercept the assassin. As the presence of Seake and her jurgorans sent the colonists into a panic, the assassin warned the colonists that they should not have returned to Taris, and she questioned the Jedi as to how her opponent had learned of her supposedly secret mission. Seake then retreated and entered into a meditative state in order to control her jurgorans, but when the two creatures were killed by the Jedi Knight and a companion, an enraged Seake drew her own lightsaber and attacked the Jedi herself—a duel that ended with her death.\nRora Seake possessed a haughty attitude and believed in the superiority of the Sith Empire. She cared nothing for the feelings or well being of her pets and believed that because a Sith Empire had once ruled Taris, the planet was therefore forever a Sith world. Seake had the crimson skin and facial tendrils common to her species and had reddish-orange eyes.\nA skilled assassin, Seake was Force-sensitive and was proficient with various forms of Force lightning. She could take mental control of her jurgoran pets by entering a meditative trance; such a trance caused her to float above the ground, and she generated a sphere of lightning around herself while doing so. Seake was also trained in lightsaber combat and for covert assassination missions.\nSeake wielded an orange-colored double-bladed lightsaber and wore light armor with a face guard.\nRora Seake appeared in the Jedi Knight-class mission \"A More Immediate Concern\" in Star Wars: The Old Republic, a video game released by BioWare in 2011. The mission is only received if the player has a positive light side alignment at the end of the previous mission, while dark side players are instead sent to acquire stolen Jedi relics from pirates. Players can also refuse the mission to help the colonists, which rewards the player with dark side alignment points. As the Jedi Knight is a Republic class and is thus assumed to make decisions that reward in the maximum light side points, this article assumes the player saved the colonists and killed Seake. According to the game's text files, players originally were able to Force Persuade Seake into leaving, but that option was removed from the final game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3643_BBY",
  "/wiki/Taris/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Assassin/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Beast_master",
  "/wiki/Jurgoran",
  "/wiki/Animal_bond",
  "/wiki/Planet/Legends",
  "/wiki/Lake_Brell_colony",
  "/wiki/Hero_of_Tython",
  "/wiki/Death/Legends",
  "/wiki/Yelzrin",
  "/wiki/Species/Legends",
  "/wiki/Sith_training",
  "/wiki/Sith_assassin/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/The_Force/Legends",
  "/wiki/Taris_Resettlement_Initiative",
  "/wiki/Watcher_One",
  "/wiki/Agent/Legends",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Angral",
  "/wiki/Lake_Brell",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Operative",
  "/wiki/Jedi/Legends",
  "/wiki/Meditation/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Duel_in_the_Lake_Brell_colony_bunker",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Eye/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_artifact/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}