{
 "name": "Roric_Goldenfield",
 "display_name": "Roric Goldenfield",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Roric Goldenfield was a Human male rancher who lived on Tatooine during the Galactic Civil War.\nBy the time of the Battle of Yavin, Roric Goldenfield lived in a ranch near the city of Mos Eisley with his wife Helen Goldenfield.\nIn 1 ABY, Roric had become embattled with a band of pirates who had set up their base near his home on Tatooine. At some point, he managed to capture and imprison some of the pirates in his basement, after which he left his home to locate an Imperial garrison to have them arrested. He left his wife, Helen, to guard the pirates. While he was away, a spacer, on a quest to become the Hero of Tatooine, visited his home. Helen asked her guest if they would watch the prisoners while she took a break, to which the spacer agreed. During this time, the pirates tried to persuade the spacer to free them, but they refused and proceeded to tell Helen of their plans to escape. At that same moment, Roric had finally arrived back with two Imperial dark troopers following. The troopers promptly arrested the pirates and Roric thanked the anonymous spacer for protecting both his home and his wife.\nRoric Goldenfield was a non-playable character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Roric Goldenfield was added to the game as part of the \"Hero of Tatooine\" questline, released with \"Publish 9\" on June 29, 2004.\nBecause Roric Goldenfield spawned under the generic \"commoner_human_male\" template, his appearance was randomized under one of twelve possible depictions. He appeared consistently a Human male, however.\nThe \"Hero of Tatooine\" questline was extensively revamped upon the introduction of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005, but the \"Honor\" portion involving the Goldenfield family was not altered.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Helen_Goldenfield",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Ranch",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Sand_slum_pirates",
  "/wiki/Pirate_Base",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Quest_of_the_Hero_of_Tatooine",
  "/wiki/Hero_of_Tatooine",
  "/wiki/Exogen-class_dark_trooper",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_29",
  "/wiki/2004",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}