{
 "name": "Rorith_Khadur",
 "display_name": "Rorith Khadur",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kupohan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Thirty-First",
      "New Republic Thirty-First"
     ]
    }
   ]
  }
 ],
 "content": "Rorith Khadur was a male Kupohan who served as a soldier in the New Republic Thirty-First holding the rank of private. He took part in the Battle of Nag Ubdur where he and his men discovered the carnage of the massacre at the Ubdurian city of Binjai-Tin. A tearful Khadur later recounted the incident to the Queen of the Core Network journalist Tracene Kane and her Trandoshan camera operator Lug. Khadur later lost an arm when the besieged Imperial forces launched a suicide wave attack with TIE fighters.\nRorith Khadur was a male Kupohan who served as a New Republic soldier holding the rank of private during the Galactic Civil War. In 5 ABY, he saw action during the Battle of Nag Ubdur as part of the New Republic Thirty-First. He and his unit fought entrenched Imperial forces at Govneh Ridge, a plate shift where the ground bulged and was covered with tall crystals. During the fighting, Khadur's squad leader Hachinka was shot in the neck by a blaster. Khadur was splattered with blood from the blaster bolt. He and his comrades managed to evacuate her from the battle. Despite losing many soldiers, the Thirty-First managed to capture the ridge.\nKhadur and his unit later arrived at the Ubdurian city of Binjai-Tin where they discovered that the retreating Imperial forces had massacred the local population. Khadur was aware of the plight of the city's inhabitants under Imperial rule and was traumatized by the carnage. Later, he was interviewed by the Queen of the Core Network journalist Tracene Kane and the Trandoshan camera-operator Lug. A visible shell-shocked and traumatized Khadur recounted the earlier events of the fighting to Kane and Lug.\nFollowing the interview, Lug hugged Khadur and gave him a zlagfiend tooth as a good-luck token. In return, Khadur clasped Lug's hand in gratitude before walking off. Shortly later, he and his men were caught in a TIE fighter suicide attack which inflicted numerous casualties on New Republic forces in Binjai-Tin. Khadur himself lost an arm during the attack but still managed to cling on to Lug's good-luck token. However, Lug was crushed to death during the attack by a TIE solar panel.\nRorith Khadur was a young, wide-eyed Kupohan. As with many Kupohans, he had a pair of eye stalks and face pelts which were bound in a series of braids. As a young soldier, Khadur was troubled by the brutality of the fighting on Nag Ubdur. He was visibly traumatized after discovering a massacre perpetrated by Imperial forces in Binjai-Tin.\nRorith Khadur appeared as a minor character in Chuck Wendig's 2016 novel Aftermath: Life Debt.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kupohan",
  "/wiki/Gender",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Thirty-First",
  "/wiki/New_Republic_soldier",
  "/wiki/Military_rank",
  "/wiki/Private",
  "/wiki/Battle_of_Nag_Ubdur",
  "/wiki/Massacre_at_Binjai-Tin",
  "/wiki/Ubdurian",
  "/wiki/City",
  "/wiki/Binjai-Tin",
  "/wiki/Queen_of_the_Core_Network",
  "/wiki/Journalist",
  "/wiki/Tracene_Kane",
  "/wiki/Trandoshan",
  "/wiki/Lug",
  "/wiki/Limb",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Suicide",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Galactic_Civil_War",
  "/wiki/5_ABY",
  "/wiki/Ambush_at_Govneh_Ridge",
  "/wiki/Govneh_Ridge",
  "/wiki/Crystal",
  "/wiki/Squad_leader",
  "/wiki/Hachinka",
  "/wiki/Blaster",
  "/wiki/Blood",
  "/wiki/Soldier",
  "/wiki/Zlagfiend",
  "/wiki/Tooth",
  "/wiki/Death",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/TIE_line",
  "/wiki/Solar_collector",
  "/wiki/Eye",
  "/wiki/Chuck_Wendig",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}