{
 "name": "Rosack_Denahst",
 "display_name": "Rosack Denahst",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Defel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "A mining corporation"
     ]
    }
   ]
  }
 ],
 "content": "Rosack Denahst was a Defel male who worked as a miner in an outpost on the planet Codia's second moon at some point between 44 BBY and 32 BBY. After a group of burglars destroyed the outpost's power core, the unusual resulting radiation caused Denahst to go mad and slaughter several of the burglars.\nHe encountered the Jedi Obi-Wan Kenobi and Qui-Gon Jinn after they arrived at the outpost to investigate, battling Kenobi before fleeing. After the Jedi worked out what had happened to Denahst, the Defel attacked again, killing another of the thieves, but was ultimately incapacitated by Jinn, who used the Force to throw a mine cart at the Defel. Kenobi then repaired the power core, ending the radiation and allowing Denahst to recover his sanity. The Defel later thanked Kenobi but claimed he would carry the guilt of what he had done while frenzied for the rest of his life.\nRosack Denahst was a Defel male who worked for a mining corporation as a miner in an outpost on the planet Codia's second moon. At some point between 44 BBY and 32 BBY, a group of burglars used a non-incendiary photonic charge to destroy the fuel rod in the outpost's power core while attempting to steal a shipment of diamonds. The power core was composed primarily of solid accelerite, which reacted to the photonic burst by producing peculiar radioactivity that suppressed the entire light spectrum. As a Defel, a species capable of manipulating light, Denahst was particularly sensitive to the radiation and so was driven mad. Invisible in the completely darkened mine, Denahst slaughtered five of the thieves with his teeth and claws after they murdered six of the miners.\nAnother burglar, fatally wounded by Denahst, was left near the outpost's entrance. There, the wounded man encountered the Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, who had been sent to investigate the darkness at the outpost. The dying burglar muttered about Denahst's madness and the danger he posed, but did not reveal who he was talking about to the Jedi before perishing.\nRushing deeper into the mine to search for survivors, the Jedi encountered Denahst in a stairwell, where Kenobi was knocked aside by the Defel, who they perceived only as a shadow even while wearing modified macrobinoculars as goggles. Through the Force, Jinn sensed Denahst's anger and confusion and sent Kenobi deeper into the outpost after the shadow while he split off to find the source of a call for help.\nAfraid, Kenobi proceeded alone before coming upon Denahst, who he believed to be a thing of pure evil while viewing him fully through the macrobinoculars. The Jedi ordered Denahst to stop, but when the Defel charged, Kenobi tried to attack it with his lightsaber; however, as the Defel continued to vanish before him as it attacked, he began to wonder if it was in fact a phantom. This theory was disproven when the maddened miner's claws scratched Kenobi's cheek. The Jedi then removed his goggles and instead used the Force to sense the Defel, allowing Kenobi to kick Denahst in the jaw and causing him to flee.\nFollowing the encounter, Kenobi and Jinn learned about the power core's destruction from a surviving thief, and Kenobi suggested that they stow their lightsabers as he had sensed something pained about Denahst while fighting him. The Jedi then encountered the mine's Gran supervisor, who revealed Denahst's identity to them, allowing them to piece together the effect that the radiation had had on the Defel. The supervisor pitied Denahst, but declared that he had to be destroyed, although the Jedi claimed he could be saved instead. At that moment, Denahst attacked, killing the remaining burglar and grabbing the supervisor before Kenobi stunned the Defel with the Force.\nKenobi attempted to reason with the miner, but Denahst slashed at him, destroying the Jedi's goggles. Jinn then used the Force to hurl a mining cart at Denahst, incapacitating him. With the threat temporarily stalled, Kenobi and the supervisor were able to leave and repair the power core, although the Padawan was temporarily blinded in the process.\nWith the radiation nullified, Denahst recovered his sanity and visited Kenobi while the Jedi was recovering in the outpost's medical center. Denahst thanked the Jedi for saving him and revealed that the deaths he had caused would haunt him, although the supervisor tried to comfort him by saying he was not to blame. Kenobi eventually went on to become a Jedi Master, and, during the Clone Wars in 20 BBY, his former Padawan, Anakin Skywalker, asked him what had happened during the encounter with Denahst while the pair were on a mission on the planet Ando. Many years later, around 0 BBY, Kenobi reflected upon the incident and wrote about Denahst in his journals while sheltering in his home on the planet Tatooine during a sandstorm.\nAs a Defel, the wolf-like Denahst was especially sensitive to light and so was driven mad by the changes in radiation in the mine, murdering with tooth and claw while in his frenzied state and failing to respond to his own name. Upon his recovery, Denahst was haunted by what he had done while driven mad, and although he had only killed murderous thieves, he felt that he would carry the guilt with him for the rest of his life. Denahst had red eyes, brown fur, and gray skin.\nDenahst wore an orange mining uniform with a brown belt and was barefooted. While in a state of frenzy, his uniform was mostly torn to shreds, but after his recovery he donned an undamaged one.\nRosack Denahst was created for the second issue of the Star Wars: Obi-Wan comic series, which was written by Christopher Cantwell and illustrated by Luke Ross, with cover art of Denahst by Phil Noto. Prior to the comic's publication on June 29, 2022, Denahst was first pictured and indirectly mentioned in the solicitations blog post for the comic made on StarWars.com on March 15 of that year.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Defel",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Unidentified_mining_corporation",
  "/wiki/Miner",
  "/wiki/Unidentified_mining_outpost_(Codia%27s_second_moon)",
  "/wiki/Planet",
  "/wiki/Codia",
  "/wiki/Codia%27s_second_moon",
  "/wiki/44_BBY",
  "/wiki/32_BBY",
  "/wiki/Thief",
  "/wiki/Power_core",
  "/wiki/Radiation",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Mission_to_Codia%27s_second_moon",
  "/wiki/Unidentified_thief_(Codia%27s_second_moon)",
  "/wiki/The_Force",
  "/wiki/Mining",
  "/wiki/Non-incendiary_photonic_charge",
  "/wiki/Fuel",
  "/wiki/Diamond",
  "/wiki/Accelerite",
  "/wiki/Species",
  "/wiki/Death",
  "/wiki/Tooth",
  "/wiki/Unidentified_wounded_burglar",
  "/wiki/Jedi_Master",
  "/wiki/Padawan",
  "/wiki/Macrobinoculars",
  "/wiki/Goggles",
  "/wiki/Obi-Wan_Kenobi%27s_first_lightsaber",
  "/wiki/Mouth",
  "/wiki/Lightsaber",
  "/wiki/Gran",
  "/wiki/Unidentified_outpost_supervisor",
  "/wiki/Supervisor",
  "/wiki/Stun",
  "/wiki/Telekinesis",
  "/wiki/Clone_Wars",
  "/wiki/20_BBY",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Ando_(Mekedrix)",
  "/wiki/Ando",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/The_Journals_of_Ben_Kenobi",
  "/wiki/Ben_Kenobi%27s_home",
  "/wiki/Tatooine",
  "/wiki/Sandstorm",
  "/wiki/Wolf",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Obi-Wan_2",
  "/wiki/Star_Wars:_Obi-Wan_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Christopher_Cantwell",
  "/wiki/Luke_Ross",
  "/wiki/Phil_Noto",
  "/wiki/June_29",
  "/wiki/2022",
  "/wiki/StarWars.com",
  "/wiki/March_15",
  "/wiki/Obi-Wan_4",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Category:Images_of_Rosack_Denahst",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Reproduction",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Devaron_massacre",
  "/wiki/Monster",
  "/wiki/Maul",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Marvel_Comics"
 ]
}