{
 "name": "Roshti",
 "display_name": "Roshti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kiros"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow",
      "white",
      "and blue"
     ]
    }
   ]
  }
 ],
 "content": "Roshti was a male Togruta and the governor of the planet Kiros during the Clone Wars.\nAround 21 BBY, Roshti was governor of Kiros, a colony of peaceful Togruta. Fearing for his colony's safety in during the Clone Wars, he nevertheless negotiated with the Separatists. He was contacted by Jedi Grand Master Yoda, who warned the Togrutan against trusting Count Dooku, offering to send Republic troops to Kiros. When Dooku arrived with an invasion fleet of battle droids, Roshti again stated his wish for his people to remain neutral in the conflict. Dooku ignored the Governor, insisting that he would provide the Togrutans with a safe haven. In actuality, Roshti and the entire colony were sold to the Zygerrians as slaves.\nOn Zygerria, Roshti was separated from his fellow colonists and kept in a cell for the upcoming auction. Roshti was found by Obi-Wan Kenobi as he searched for the kidnapped Togrutain colonists, but was too weak to tell him where the other Togrutans were being held. Kenobi and Rex attempted to escape with the Governor on a brezak, but the escape was cut short by a well placed shot from a Zygerrian guard, hitting Kenobi and causing him and Roshti to fall off the brezak. Roshti was then brought to the slave auction to be sold, representing the entire Togrutan population. Before his auction could commence, the Queen introduced Obi-Wan. A fight broke out between the Jedi and the Zygerrians but Roshti, too weak to fight, could not contribute to the fight. He was captured and sent with Kenobi on the slave ship the Delta-T-3, to the Kadavo slave processing facility, where the other Togruta were being held.\nWhen Skywalker, Ahsoka Tano and Master Plo Koon attacked the facility, he was rescued along with the other Togrutans. Back on Coruscant while talking to Tano, he expressed his concerns for the safety of his people and stated his intention to join the Republic.\nRoshti's first appearance was in the comic The Clone Wars 1, which was released in 2008. The comics were later adapted into a story arc, which was featured in the fourth season of Star Wars: The Clone Wars.\nAccording to Dave Filoni, the script originally had Roshti knowing Ahsoka Tano's parents.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gupat_Roshti",
  "/wiki/Roshti",
  "/wiki/Canon",
  "/wiki/Roshti/Legends",
  "/wiki/Kiros/Legends",
  "/wiki/Togruta/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Zygerrian/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/CT-7567/Legends",
  "/wiki/Brezak/Legends",
  "/wiki/Delta-T-3/Legends",
  "/wiki/Kadavo_slave_processing_facility/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/The_Clone_Wars_1",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/Kidnapped",
  "/wiki/The_Clone_Wars_3",
  "/wiki/The_Clone_Wars_4",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/The_Clone_Wars_5",
  "/wiki/The_Clone_Wars_6",
  "/wiki/Escape_from_Kadavo",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.28",
  "/wiki/Encyclopedia_(StarWars.com)"
 ]
}