{
 "name": "Rosii",
 "display_name": "Rosii",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Security",
      "Galactic Alliance Security"
     ]
    }
   ]
  }
 ],
 "content": "Rosii was a male Rodian stationed at a secret Galactic Alliance Security blockhouse on Coruscant, where psychotic Jedi Knights Valin Horn and Jysella Horn were being held in carbonite in 43 ABY. Rosii served alongside Galactic Alliance Security Sergeant Weeze, and both were present when a group of Jedi entered the facility with permission from Judge Arabelle Lorteli to visit the Horns. Rosii and Weeze denied that the psychotic Jedi were there, claiming that the facility was used simply for storage, but a Galactic Alliance Security assault team under the command of Captain Atar arrived on the scene. The Jedi presented the document to Atar, who was forced to allow them access to the Horns.\nThe Rodian male Rosii served in Galactic Alliance Security around the time following the Second Galactic Civil War. In 43.5 ABY, he was stationed in Galactic Alliance Security Detention Center 81, a secret blockhouse under the command of Colonel Wruq Retk on the planet of Coruscant. Jedi Knight Valin Horn and his sister, Jedi Knight Jysella Horn, both came down with an enigmatic psychosis, and the Galactic Federation of Free Alliances decided to encase them in carbonite. They were eventually placed in the blockhouse in which Rosii was stationed.\nThe Jedi Order discovered the location of the Horn siblings, however, and obtained a document granting them permission to enter the facility by using a mind trick on Arabelle Lorteli—the head judge of the Court of Jedi Affairs. Jedi Knight Jaina Solo arrived at the facility and spoke with Rosii and another Rodian, Sergeant Weeze, in the lobby. The Rodians denied the fact that the Horns were in the facility, and Weeze raised an alarm. Solo quickly used the Force to push them away and dispatch of their blasters, and a group of Jedi Masters arrived at the facility with a large contingent of the press. Solo presented the document signed by Lorteli, and at that moment, a Galactic Alliance Security assault squad under the command of Captain Atar arrived. The Jedi then presented the document to Atar, who was forced to allow them into the facility.\nRosii was skinnier than Weeze, a fellow Rodian whom he worked alongside at a secret Galactic Alliance Security blockhouse. Rosii and Weeze attempted vainly to convince Jedi Knight Jaina Solo that the building was merely a storage facility.\nRosii was created by author Troy Denning for the 2009 novel Fate of the Jedi: Abyss, the third novel in the Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Galactic_Alliance_Security_Detention_Center_81",
  "/wiki/Galactic_Alliance_Security_blockhouse",
  "/wiki/Coruscant/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/Jysella_Horn",
  "/wiki/Carbonite/Legends",
  "/wiki/43_ABY",
  "/wiki/Sergeant/Legends",
  "/wiki/Weeze",
  "/wiki/Jedi/Legends",
  "/wiki/Judge/Legends",
  "/wiki/Arabelle_Lorteli",
  "/wiki/Captain/Legends",
  "/wiki/Atar",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Colonel/Legends",
  "/wiki/Wruq_Retk",
  "/wiki/Planet/Legends",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Valin_Horn",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Mind_trick/Legends",
  "/wiki/Court_of_Jedi_Affairs",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Troy_Denning",
  "/wiki/2009",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Outcast"
 ]
}