{
 "name": "Rostat Manr",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance of Free Planets",
      "New Republic",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Rostat Manr was a male Sullustan fighter pilot.\nHe began his career as a BTL Y-wing starfighter pilot for the Rebel Alliance during the last years of the Galactic Civil War. He continued serving the Alliance of Free Planets and then the New Republic until 7 ABY. At that point, he believed that his work was done, in addition to being tired of fighting. He therefore resigned his commission and began working as a private pilot.\nHe started working for Event Vistas, as a pilot of luxury cruise liners. A couple of months later, after he had shown sufficient skill, he was promoted to chief pilot on the Nebula Queen, a ship making regular runs to Coruscant. His co-pilot was another Sullustan called Nurm.\nWhile on a leave, Manr was kidnapped and brainwashed by agents of Imperial warlord Zsinj. He would continue with his usual job but, on a trigger phrase , he was supposed to deliberately crash the ship onto Coruscant .\nIt is unknown who activated him, but, during one of the Nebula Queen's regular runs to Coruscant, Manr heard the trigger phrase and obeyed, setting up a collision course with the planet. Before that could happen, Nurm took control from the auxiliary bridge and locked him out of the system. Furious, Manr raced to the auxiliary bridge to take back control, but was hit with a stun blast fired by Nurm , and knocked out. Manr was immediately taken into custody for examination.\nThanks to previous encounters with other Minefield subjects, including Twi'lek pilots Tal'dira and Nuro Tualin, Wedge Antilles, with significant input from Wraith Squadron, was expecting a brainwashed Sullustan as the next phase, and had warned General Airen Cracken to that effect. Because of that warning, and the subsequent preventative steps, Manr was the first sleeper agent to be taken alive. His examination and interrogation was no doubt very informative for New Republic Intelligence in identifying other victims.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Event_Vistas",
  "/wiki/Nebula_Queen",
  "/wiki/Nurm",
  "/wiki/Project_Minefield",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Coruscant/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Tal%27dira",
  "/wiki/Nuro_Tualin",
  "/wiki/Wraith_Squadron",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Rostat_Manr",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}