{
 "name": "Roth-Del Masona",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Roth-Del Masona was a male Human Jedi Master serving the Jedi Order and the Galactic Republic during the Clone Wars, the last galactic conflict of the Republic Classic era. During the war, Masona was appointed the adjutant of former Master of the Order, Jedi Master Mace Windu.\nDiscovered during his earliest days to be Force-sensitive, Roth-Del Masona was taken to the Coruscant Jedi Temple for training in the ways of the Force by the Jedi Order. A student of the Temple's academy, Masona was eventually taken as a Padawan after passing his last academy tests. After years of on-on-one study with a Jedi Master and crafting a blue-bladed lightsaber, Masona passed the Trials of Knighthood and was made a Jedi Knight by the Jedi High Council.\nAt the height of the Separatist Crisis that had erupted between the Galactic Republic and the Confederacy of Independent Systems, Masona was stationed on Coruscant when Master Mace Windu assembled a task force meant to rescue captured Jedi Obi-Wan Kenobi, who was sentenced to death by execution by the Confederacy's leaders, along with Senator Padmé Amidala and Jedi Padawan Anakin Skywalker. Arriving on the dusty world of Geonosis, Masona and his fellow Jedi stormed the Petranaki arena and rescued their fellow Jedi, though many others were killed in the process. When the Separatist Droid Army had the survivors surrounded and Confederacy leader Count Dooku ordered that the droids open fire on the survivors, Grand Master Yoda arrived with the Grand Army of the Republic and evacuated the remaining Jedi. Boarding a Republic gunship and flying out onto the plains of the world, Masona led a group of clone troopers in the first battle of the Clone Wars.\nReturning to the Temple on Coruscant, Masona accepted the rank of General within the Grand Army and also the position of adjutant of Master Windu himself. Fighting bravely in the three years of war, Jedi Master Masona was stationed on Coruscant when General Grievous, leader of the Separatist fleet, emerged from hyperspace in the skies of Galactic City. Along with Jedi Masters Roron Corobb, Foul Moudama, and B'ink Utrila, Masona was assigned to reinforce Master Shaak Ti and Stass Allie in locating and protecting the Supreme Chancellor. As the Republic war machine fought to protect the capital planet, Masona and his team were rushing Chancellor Palpatine into a bunker deep in the crust of Coruscant. As Master Shaak Ti fought to defend the doors to the bunker, Grievous slipped past unnoticed and engaged the four Jedi protecting Palpatine in a lightsaber duel. Grievous dueled them briefly, and, despite Masona being a renowned duelist, famous for his mastery of Ataru, Grievous was able to decapitate Masona, becoming the first casualty in the fight. Masona's comrade, Jedi Roron Corobb accidentally kicked Masona's head across the room during the fight, causing the Jedi to become distracted enough for Grievous to kill him and the remaining two defenders.\nRoth-Del Masona was portrayed by Leonard Thomas in Attack of the Clones, with \"Masona\" a tuckerization of Thomas' name.\nWhile unnamed in Labyrinth of Evil, the Jedi defending the Supreme Chancellor was retconned to be Masona by his mention in Unknown Soldier: The Story of General Grievous. His appearance in Labyrinth of Evil contradicts the same events as they were portrayed in the television series Star Wars: Clone Wars.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Labyrinth_of_Evil",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Petranaki_arena",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Battle_of_Geonosis_(disambiguation)",
  "/wiki/Jedi_General/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Galactic_City",
  "/wiki/Roron_Corobb/Legends",
  "/wiki/Foul_Moudama",
  "/wiki/B%27ink_Utrila",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Stass_Allie/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Tuckerization",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_114",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/StarWars.com",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Encyclopedia_(StarWars.com)"
 ]
}