{
 "name": "Roval",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Roval was a male Human who served as a lieutenant in the military of the reconstituted Sith Empire. He participated in the Battle of Corellia in 3640 BBY.\nRoval served in the reconstituted Sith Empire's military as a lieutenant. A Human male, the Imperial was stationed on Corellia during the Sith Empire's invasion of the world.\nOn the planet, caught in a fierce battle between the forces of the Empire and that of the Galactic Republic, the lieutenant's unit was tasked to advance towards the Republic's Sith War Memorial Garden at Axial Park.\nThe Imperials captured Corellian buildings as they fought through Republic troops, yet as the task force approached the Memorial Garden from a structure nearby, they became entrenched there before they could reach the Garden, though they were the closest of all Imperial forces to it.\nCaught in a web of Republic snipers nested between Axial Park and the Sith War Memorial, all attempts to further advance and conduct a final push into the War Memorial were of no use, and only eight Imperial Guard Commanders, three Sith, and four Imperial medics remained around the area, which was additionally surrounded by Republic heavy troopers led by Jedi Knights, these forces attacking the Imperials guarding the building's entrance whilst Republic master snipers and their subordinates set their scopes on the outpost's flanking walls.\nAmidst the firefight, an Imperial hero sent by General Hesker reached their outpost. This individual was allowed through the Imperial unit's defensive perimeter made before the outpost's entrance and found Roval taking shelter behind a desk deep within the building.\nMeeting with the new-arrival, Lieutenant Roval contacted Hesker, allowing the general to brief the Imperial hero on the final assault in the fight for Axial Park. The Empire-aligned individual then proceeded to sack the Republic's memorial gardens.\nRoval was clothed in Imperial uniform and wore a blaster rifle over his shoulders.\nRoval appears in the 2011 video game Star Wars: The Old Republic as a non-player character. During the Imperial-faction planetary storyline for Corellia, a dialogue segment with Lieutenant Roval ends and initiates the quests \"The Fight for Axial Park\" and \"Sacking the Gardens\" respectively.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Lieutenant/Legends",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Battle_of_Corellia",
  "/wiki/3640_BBY",
  "/wiki/Corellia/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Axial_Park",
  "/wiki/Corellian/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/General/Legends",
  "/wiki/Hesker",
  "/wiki/Clothing/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2011",
  "/wiki/Video_game"
 ]
}