{
 "name": "Rover  (pet)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Ando"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Meduza"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Owner(s)",
     "values": [
      "Cornelius Evazan"
     ]
    }
   ]
  }
 ],
 "content": "Rover was a male Meduza pet belonging to Doctor Cornelius Evazan, a wanted criminal who trained the creature to act as a bodyguard. Rover proved to be skilled at the job, as he was highly loyal to his master, and Evazan had little difficulty in training him. In one incident, Rover helped Evazan defeat four bounty hunters and then surrounded his master with his gelatinous body to protect him from a thermal detonator explosion. Although Evazan survived the blast and the subsequent fall, he squashed Rover in the drop, killing his loyal pet.\nAt some point following the Battle of Yavin in 0 ABY, the male Meduza Rover came into the possession of Doctor Cornelius Evazan, who had taken up residence on Ando. Though Meduza were considered difficult to train, Evazan was able to tame Rover, using the creature as a bodyguard. Thought to be insane by many, Evazan was wanted in several systems for mutilating unsuspecting victims during routine surgeries in hopes of learning the secrets of immortality. During his time on Ando, multiple bounty hunters had attacked him, hoping to capture the doctor and collect the bounty on his head. However, all of the bounty hunters had failed, as the Meduza had helped to protect Evazan from these intruders, using his ability to produce an electrical current to subdue the would-be captors. After the bounty hunters were stunned or killed, Rover then devoured them.\nDuring one meeting with his benefactor, an Aqualish senator, Evazan was attacked by three intruders. However, he had been alerted to them by Rover, who had spotted the trio of assailants outside Evazan's castle home. Evazan and his assistant, Ponda Baba, each shot an intruder, while Rover touched the other from behind with the stalks on top of his head, electrocuting the man. The Meduza then proceeded to swallow the three dead men.\nHowever, Evazan was not safe. The Human bounty hunter Gurion Silizzar, who had waited outside while his partners infiltrated the castle, managed to make his way in and catch Evazan by surprise by using a holoshroud. Silizzar wanted revenge for the seven family members of his Evazan had killed and sought to bring the doctor to justice. Holding him at gunpoint, Silizzar took Evazan up to the castle's roof, where a starship piloted by the other two members of his team landed to take Evazan off-world to a planet where he would be tried for his crimes.\nUnbeknownst to Silizzar, Rover was following the two. While Evazan attempted to stall his captors when they reached the rooftop, Rover crept closer. Though Silizzar spotted the Meduza before it could engulf him, Rover was able to shock Silizzar's arm, causing him to drop his blaster. After a brief skirmish between Evazan and Silizzar, the doctor was able to throw Silizzar over the edge to his death. However, the senator—whose consciousness Evazan had mistakenly transferred into Ponda Baba's body in an experiment earlier in the evening—appeared on the roof, where he dropped a thermal detonator, preparing to kill the doctor for ruining his life as a senator.\nAs Evazan screamed for help, his pet surrounded him, cushioning him from the blast. Though Evazan was protected by the Meduza in the subsequent fall, Rover himself was killed. The Meduza's final act had been one of sacrifice, saving his master at the expense of his own life.\nRover was highly loyal to his master, who in turn valued his pet's allegiance and protection. The Meduza saved his master from multiple bounty hunters and also protected Evazan from a thermal detonator explosion, though Rover was killed by the ensuing fall. Evazan was able to train Rover quite easily, despite the species' reputation of being difficult to train. The doctor commented that one reason that the Meduza was so malleable was that he was supplied with a frequent diet of bodies, as a number of bounty hunters had attacked Evazan—and died in their attempts—during his time on Ando.\nThe Meduza had a green, gelatinous body, and was covered in thin stalks that could produce an electrical current.\nRover first appeared in the short story Doctor Death: The Tale of Dr. Evazan and Ponda Baba, included in Tales from the Mos Eisley Cantina. He later received a brief mention in both The Essential Guide to Characters and The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rover_(disambiguation)",
  "/wiki/0_ABY/Legends",
  "/wiki/Ando/Legends",
  "/wiki/Meduza",
  "/wiki/Gender/Legends",
  "/wiki/Green_(disambiguation)",
  "/wiki/Cornelius_Evazan/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Unidentified_Andoan_senator",
  "/wiki/Evazan%27s_castle",
  "/wiki/Ponda_Baba/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gurion_Silizzar",
  "/wiki/Holographic_image_disguiser",
  "/wiki/Starship/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Species/Legends",
  "/wiki/Doctor_Death:_The_Tale_of_Dr._Evazan_and_Ponda_Baba",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}