{
 "name": "Rroorgli",
 "display_name": "Rroorgli",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Comet Broom Service"
     ]
    }
   ]
  }
 ],
 "content": "Rrooogli was a female Wookiee who lived in the Cularin system during the waning years of the Galactic Republic.\nRroorgli co-run the Comet Broom Service along with the male Wookiee Mronk. The service monitored and destroyed dangerous comets around the Cularin comet cloud and was based on Artom Station, where the two Wookiees had offices. During the time of the Clone Wars, Rroorgli and Mronk were hired by the Dark Jedi Garth Ezzar, who was in disguise as Jedi Master Lanius Qel-Bertuk, to initiate the Cometary Water Reclamation Project, a project that was suposedly to sent a comet into the atmosphere of the planet Almas.\nAfter the freighter Fricasseed Nerf was damaged because of faulty data supplied by the Comet Broom Service, the Heroes of Cularin were hired to investigate and they visited Rroorgli and Mronk on Artom Station. The Wookiees denied any wrong doing and gave the heroes a copy of some of the data that they had supplied to Cularin SpaceNav. A short time later, Rroorgli and Mronk were murdered by Ezzar, to help cover up the Cometary Project.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Comet_Broom_Service",
  "/wiki/Cularin_system",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mronk",
  "/wiki/Cularin_comet_cloud",
  "/wiki/Artom_Station",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Garth_Ezzar",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/Cometary_Water_Reclamation_Project",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Freighter/Legends",
  "/wiki/Fricasseed_Nerf",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Cularin_SpaceNav",
  "/wiki/At_Your_Service"
 ]
}