{
 "name": "Rrrn",
 "display_name": "Rrrn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mustafarian"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kkkt's clan"
     ]
    }
   ]
  }
 ],
 "content": "Rrrn was a Southern Mustafarian who lived on the planet Mustafar during the Imperial Era as a member of a clan led by Father Kkkt. Rrrn was part of a scouting party sent to investigate an object that had crashed on the planet. Upon arrival, the Mustafarian group was attacked by the Dark Lord of the Sith Darth Vader. Rrrn, the sole survivor of the ambush, alerted Kkkt of the threat. Kkkt then contacted the nearby Mustafarian clanholds and formed a union against the Sith Lord and his forces.\nRrrn was a Southern Mustafarian and a member of Father Kkkt's clan on the planet Mustafar during the time of the Galactic Empire. Around 14 BBY, Kkkt and the rest of the clan observed a fiery object crash onto Mustafar. Kkkt sent Rrrn, the Northern Mustafarians Sssp and Bbbl, and another Southern Mustafarian to investigate and report any findings. Arriving at the supposed crash site on two lava fleas, with Rrrn riding passenger behind Sssp, the group found nothing, and Sssp decided they should report back to Kkkt. Bbbl then spotted a dark figure nearby, the Dark Lord of the Sith Darth Vader. Vader hurled a rock at Bbbl using the Force and sent the Mustafarian flying into the lava.\nThe Mustafarians then shot at Vader, but he used his lightsaber to deflect the blaster bolts, killing one of the Mustafarians. When the Sith Lord next used the Force to lift and strangle Sssp in midair, Rrrn fled the scene atop the lava flea and reported the discovery of the dark figure to Kkkt. Fearing that the safety of his people was compromised, Kkkt contacted the nearby clanholds and united them against Vader and his Imperial might.\nUpon seeing two other fellow Mustafarians killed and Sssp being telekinetically lifted by Darth Vader, Rrrn chose to flee for safety and warn Father Kkkt of the impending threat.\nLike other Mustafarians, Rrrn wore armor and a breath mask as protection against Mustafar's heat. The Mustafarian also carried a Mustafarian blaster rifle and rode at the back of a lava flea during the scouting mission.\nRrrn first appeared in the Marvel comic Darth Vader  22, written by Charles Soule, penciled by Giuseppe Camuncoli, and published on October 17, 2018. The Mustafarian was later identified by name in Darth Vader  24, published on November 28, 2018.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Mustafarian",
  "/wiki/Southern_Mustafarian",
  "/wiki/Kkkt%27s_clan",
  "/wiki/Planet",
  "/wiki/Mustafar",
  "/wiki/Imperial_Era",
  "/wiki/Father_(title)",
  "/wiki/Kkkt",
  "/wiki/Scout",
  "/wiki/Naboo_Royal_Starship",
  "/wiki/Skirmish_on_Mustafar",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sith_Lord",
  "/wiki/Gender",
  "/wiki/Fortress_Vader_Imperial_garrison",
  "/wiki/Galactic_Empire",
  "/wiki/14_BBY",
  "/wiki/Fire",
  "/wiki/Northern_Mustafarian",
  "/wiki/Sssp",
  "/wiki/Bbbl",
  "/wiki/Lava_flea",
  "/wiki/Telekinesis",
  "/wiki/The_Force",
  "/wiki/Magma",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Blaster",
  "/wiki/Death",
  "/wiki/Force_choke",
  "/wiki/Flea",
  "/wiki/Darth",
  "/wiki/Armor",
  "/wiki/Breath_mask",
  "/wiki/Temperature",
  "/wiki/Mustafarian_blaster_rifle",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Darth_Vader_(2017)_22",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/October_17",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_24",
  "/wiki/November_28",
  "/wiki/Category:Images_of_Rrrn",
  "/wiki/Darth_Vader_(2017)_21",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Template:DVDLotS18",
  "/wiki/Standard_year",
  "/wiki/Darth_Vader_(2017)_23",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know"
 ]
}