{
 "name": "Ru-Ru",
 "display_name": "Ru-Ru",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Imroosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Ru-Ru was an Imroosian female Jedi archivist stationed at the Jedi Temple on Banchii during the High Republic Era.\nA member of the Jedi Order, Ru-Ru was trained as an archivist and the use of the Force. When the Order established a Jedi Temple on the frontier world Banchii, Ru-Ru was stationed at the new facility and charged with building and maintaining the archives within. Part of her responsibilities was to build and expand the Order's knowledge of the planet, with a special focus on the study of its ecology to best help the settlers and refuges establish farms and settlements on the planet. Using the droid DD-1A to scout the surrounding ecosystems and obtain data on flora and fauna, Ru-Ru spent time in the settlements getting to know the settlers and build trust between them and the Jedi. During her walks through the village, she aided the settlers in their work, even using the Force to help those who found themselves in trouble.\nWhen the settlements around the Temple were beset by Drengir attacks, Ru-Ru helped shepherd the villagers into the Temple so that they could be better protected. As the villagers got recovered from their plight, the Jedi struggled to keep the Drengir at bay, and were taken aback when one of the creatures emerged from the heart of the Temple itself. While Ru-Ru did not carry a lightsaber, she was able to help in the defense of the villagers with her mastery of the Force. Despite the overwhelming odds the Drengir presented, as they proved resilient to lightsaber attacks, Ru-Ru helped bolster the resolve of her fellow Jedi as they led the Drengir away from the Temple. Ultimately, through the combined concentration of the four Jedi, they doused the Drengir in fuel and trapped them within a firestorm, burning them to death. Following the assault, Ru-Ru helped the Banchii Jedi determine that the Drengir were a tool of the Nihil, possibly used as a forward assault to weaken the resolve of the settlers of Banchii before the launching of a full-scale invasion. Putting the planet on high alert, the Jedi agreed to fortify the settlements against the possibility of a future incursion by the marauders.\nIn the time after the Drengir attack, and the departure of Jedi Master Arkoff, Ru-Ru attended a meeting with Lily Tora-Asi and visiting Master Sav Malagán to discuss the discovery of several explosives in the settlement. Agreeing that Starlight Beacon should be made aware, Ru-Ru was the first to notice that the communications systems were down and the Temple was cut off from the rest of the galaxy. After Tora-Asi departed to warn the Beacon of the growing threat developing in the sector, Ru-Ru worked with Padawan Keerin Fionn to discover the source of the communications disruption; together they found evidence of sabotage and put the Temple on alert. When the assault by the Nihil did begin, Ru-Ru stood in defense of the Temple, standing side by side with the settlers who fired blasters in defense of their home. Using the Force to repulse the Nihils attempting to infiltrate the Temple, Ru-Ru covered the overwhelmed settlers as they retreated into the facility. As the Nihil reinforcements arrived, Jedi Tora-Asi declared the Temple lost and ordered Ru-Ru to take the Jedi Initiates into the forest while Master Malagán helped execute an end game. From the safety of the darkened forest, Ru-Ru and the Initiates watched with great sadness as the Jedi deliberately collapsed the Temple to keep the archives out of the hands of the Nihil. Gathering the settlers and the Initiates, Ru-Ru took the Temple's cargo ship and departed for Coruscant.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Imroosian",
  "/wiki/Gender",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_archivist",
  "/wiki/Jedi_Temple_(Banchii)",
  "/wiki/Banchii",
  "/wiki/High_Republic_Era",
  "/wiki/The_Force",
  "/wiki/DD-1A",
  "/wiki/Drengir",
  "/wiki/Lightsaber",
  "/wiki/Nihil",
  "/wiki/Jedi_Master",
  "/wiki/Arkoff",
  "/wiki/Lily_Tora-Asi",
  "/wiki/Sav_Malag%C3%A1n",
  "/wiki/Starlight_Beacon",
  "/wiki/The_galaxy",
  "/wiki/Padawan",
  "/wiki/Keerin_Fionn",
  "/wiki/Jedi_Initiate",
  "/wiki/Coruscant",
  "/wiki/The_Banchiians",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._1",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2"
 ]
}