{
 "name": "Rubix",
 "display_name": "Rubix",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shu-Torun"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Shu-Torun"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kingdom of Shu-Torun"
     ]
    }
   ]
  }
 ],
 "content": "Duke Rubix was a human male from the planet Shu-Torun who held the position of ore-duke during the reign of the Galactic Empire. When the Imperial Sith Lord Darth Vader visited Shu-Torun, the King of Shu-Torun arranged for a ball to be held in the royal palace which Rubix attended with his daughter. At the ball, the duke's daughter wished to dance with Vader, and so Rubix approached the Sith and demanded he dance. After Vader refused, Rubix persisted in his demands until the Imperial used the Force to lift the duke into the air and twirl him around, before dropping him. A number of troops working for the king then ambushed Vader, causing the guests of the ball to flee.\nRubix was an ore-duke on the mining planet Shu-Torun. During the Galactic Empire's reign, the planet was expected to provide ores for Imperial building projects, with the dukes also paying tithes to the Empire. The ore-dukes' displeasure at paying these fees eventually swayed the King of Shu-Torun to turn against the Empire. When the king learned that the Sith Lord Darth Vader would be visiting Shu-Torun as an Imperial representative checking why quotas were not being met, he plotted to kill the Sith. A ball was arranged in the subterranean abyssal rooms of the royal palace to showcase the culture of the planet to Vader, and Duke Rubix and his daughter, Bixene, were invited.\nWhen Vader entered the hall that the ball was taking place in, his guide Princess Trios ordered that the guests begin dancing the Shu-Torun counter-bore waltz. Rubix's daughter then expressed interest in dancing with the Sith himself, and Rubix approached Vader to make the request. Trios attempted to dissuade the duke from continuing to ask, but Rubix insisted, as he saw the refusal as an insult. Vader then agreed to \"dance\" and lifted Rubix into the air using the Force. He twirled the helpless duke around in front of the other stunned guests before dropping him from a height onto the ballroom floor. A group of the king's men then breached the room's wall in a burrowing vessel and attacked Vader, causing the guests of the ball to flee. Vader went on to kill the king and crown Trios as the new queen, promising her the support of the Empire if any of the ore-dukes rebelled.\nRubix was a human male with fair skin and brown hair. He demanded that Vader dance with his daughter, and refused to back down even when Princess Trios advised it, as he considered the refusal an insult.\nRubix wore a white robe with blue straps and white boots to the ball in the royal palace. He wore his hair in a ponytail held in place by a blue band and long curved gray earrings.\nRubix first appeared in Darth Vader Annual 1, a comic book written by Kieron Gillen and illustrated by Leinil Francis Yu for publication in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Darth_Vader_(2015)_19",
  "/wiki/Shu-Torun",
  "/wiki/0_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kingdom_of_Shu-Torun",
  "/wiki/Duke",
  "/wiki/Planet",
  "/wiki/Ore-duke",
  "/wiki/Galactic_Empire",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Shu-Torun",
  "/wiki/Unidentified_King_of_Shu-Torun",
  "/wiki/Shu-Torun_royal_palace",
  "/wiki/Bixene",
  "/wiki/Sith",
  "/wiki/The_Force",
  "/wiki/King",
  "/wiki/Mining",
  "/wiki/Death",
  "/wiki/Prince",
  "/wiki/Trios",
  "/wiki/Shu-Torun_counter-bore_waltz",
  "/wiki/Telekinesis",
  "/wiki/Queen",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Darth_Vader_Annual_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kieron_Gillen",
  "/wiki/Leinil_Francis_Yu",
  "/wiki/2015",
  "/wiki/Darth_Vader_(2015)_17",
  "/wiki/Darth_Vader_(2015)_18"
 ]
}