{
 "name": "Ruby_(lizard)",
 "display_name": "Ruby  (lizard)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lizard"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Owner(s)",
     "values": [
      "Roland Durand"
     ]
    }
   ]
  }
 ],
 "content": "Ruby was a female lizard that was considered highly valuable shortly after the formation of the Galactic Empire. She was stolen by the Rhokai gang due to the lizard's value, before the Devaronian criminal Roland Durand hired information broker Cid to deliver her to him. In turn, Cid dispatched the unit of former clone commandos known as the Bad Batch to steal Ruby from the Rhokai. During the theft of Ruby, the young clone Omega gave her the name Ruby which Durand retained after he took ownership of her.\nRuby was a female lizard of a species that was considered valuable during the early Imperial Era. The Devaronian criminal Roland Durand, a client of the Trandoshan information broker Cid, wished to acquire Ruby and paid Cid to procure and deliver the lizard to him. Cid dispatched the clones of Clone Force 99  to steal Ruby from the Rhokai gang, who had previously stolen her. The Rhokai pursued the clones' starship, Marauder, through space, but the clone commandos were able to escape into hyperspace with Ruby and deliver her to Cid. Ruby was provided to Durand, who kept her as a pet and retained Ruby as her name.\nDurand later ousted Cid from her parlor and took control of the establishment, bringing Ruby with him. Cid's regular patrons Bolo and Ketch kidnapped Ruby to lure Durand and his henchman from Cid's parlor so Cid and the Bad Batch could steal six crates of spice that Durand wanted to sell for the Pyke Syndicate. Durand loved Ruby and regularly pet her and rubbed her belly, so he threatened to kill her kidnappers.\nLater, Cid and the Bad Batch returned to Cid's Parlor, believing the Pykes would have neutralized Durand by the time they arrived. While they were mostly correct, Durand informed the Pykes that the clones and Cid were the ones who actually stole the spice, so the Pykes took the child clone Omega hostage and sent Cid and the other clones to retrieve the spice they'd stolen. While imprisoned next to Durand, Omega bonded with the Devaronian over Ruby's affection for both of them.\nEven though Durand double-crossed the Bad Batch and Cid, Omega stuck up for the Devaronian because Ruby liked him. This led Omega to conclude Durand couldn't be \"all bad.\"\nRuby first appeared in the episode \"Battle Scars\" of the Disney+ original web television show Star Wars: The Bad Batch. The episode became available to stream on June 11, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ruby_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Unidentified_lizard",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Roland_Durand",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Thief",
  "/wiki/Rhokai_gang",
  "/wiki/Lizard",
  "/wiki/Devaronian",
  "/wiki/Information_broker",
  "/wiki/Cid",
  "/wiki/Clone_commando",
  "/wiki/Clone_Force_99",
  "/wiki/Theft_of_Ruby",
  "/wiki/Cloning",
  "/wiki/Omega",
  "/wiki/Imperial_Era",
  "/wiki/Trandoshan",
  "/wiki/Starship",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Realspace",
  "/wiki/Hyperspace",
  "/wiki/Cid%27s_Parlor",
  "/wiki/Bolo",
  "/wiki/Ketch",
  "/wiki/Theft_on_Ord_Mantell",
  "/wiki/Spice",
  "/wiki/Pyke_Syndicate",
  "/wiki/Death",
  "/wiki/Pyke",
  "/wiki/Youngling",
  "/wiki/Battle_Scars",
  "/wiki/Disney%2B",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/June_11",
  "/wiki/2021",
  "/wiki/Infested",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)"
 ]
}