{
 "name": "Ruescott_Melshi",
 "display_name": "Ruescott Melshi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Between 39 BBY and 30 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unit Five-Two-D",
      "Table five",
      "Table five",
      "Alliance to Restore the Republic",
      "Special Forces Trackers Unit",
      "Extraction Team Bravo",
      "Rogue One",
      "Special Forces Trackers Unit",
      "Extraction Team Bravo",
      "Rogue One"
     ]
    }
   ]
  }
 ],
 "content": "Ruescott Melshi was a human male that served as a sergeant in the Alliance to Restore the Republic Special Forces during the early years of the Galactic Civil War against the Galactic Empire. In 5 BBY, he spent time on Narkina 5 as a prisoner and was sentenced to work Unit Five-Two-D's Table five section. During that time, he met fellow prisoner Cassian Andor.\nDuring his time in the rebellion, he was a close friend of Andor, who had become a Rebel Alliance Intelligence Service captain. Melshi was a veteran soldier and a respected commander, leading his troops by personal example. In 0 BBY, when the Alliance learned about the existence of the Empire's Death Star superweapon, Melshi led a rebel extraction team during the rescue of Jyn Erso—daughter of Galen Erso, the Death Star project's chief engineer—from a labor camp on the planet Wobani.\nAfter Erso's liberation, the Alliance employed her to make contact with her father, discovering that he had deliberately left a crucial weakness in the Death Star's design as an act of sabotage. In an effort to retrieve the Death Star's schematics needed to pinpoint that weak spot, Melshi helped Andor assemble a ragtag group of volunteers dubbed \"Rogue One.\" The squad then set off on a mission to the Imperial security complex on the planet Scarif, where the plans were being stored. During the subsequent battle on the planet, Melshi and the rest of Rogue One successfully obtained the Death Star plans, but they all gave their lives to ensure the mission's success.\nRuescott Melshi was a human male born at some point between 39 BBY and 30 BBY. Growing up in the galaxy ruled by the Galactic Empire, Melshi grew to detest the authoritarian government. He was eventually imprisoned by the Empire in the Imperial Prison Complex on the moon Narkina 5. Prisoners there deemed labor-worthy were put in in teams of seven to work assembly lines that produced mechanic widgets. Melshi was assigned to table five in Unit Five-Two-D on the facility's fifth level, where he labored in twelve-hour shifts in a team that included the prisoners Jemboc, Xaul, Taga, Ulaf, and Ham.\nMelshi went through a daily routine including eating food from a tube, waiting for the floor to be safe to step on, group showering, and work. The unit, managed by the prison laborer Kino Loy, saw its seven tables pitted against one another; the top table getting flavor in their food and the last placed one getting \"fried\" by the electrified floors. In 5 BBY, rebel activity on the planet Aldhani resulted in the Public Order Resentencing Directive legislation being passed and doubling all prisoners' sentences.\nMelshi's table had a new vacancy, which resulted in the team running behind on the unit leaderboard the next day after their seventh team member was lost. During the last hour of their shift, the room was called to a halt to receive a new prisoner for table five, all members but Loy putting their hands on their heads. The new inmate was Cassian Andor, who went by the alias \"Keef Girgo.\" After having a run down with Loy, Andor went to table five as the laborers resumed their shift and had an introduction with Melshi's team.\nThe team discussed the repercussions for falling behind on the leaderboard by ten points. Upon questions as to whether Loy would be lenient due to the team vacancy, Melshi claimed that ten points was too much to allow that, soon adding that the Imperial superiors were laughing at them. When Xaul called Andor \"new guy,\" Melshi corrected the inmate, telling him to call \"Keef\" by his name. Shortly after, Loy received a message that their work levels were too low, so he instructed them to work extra fast for the remaining thirty-nine minutes of the shift. The team got to work, Andor watching and learning from what they were doing. The table ultimately came last in the unit, and thus the seven inmates were fried as standard discipline.\nAfter the shift, the unit's inmates were led back to their sleeping block, where Andor was given a brief tour of it by Jemboc. Upon prompts by Melshi, the prisoners questioned \"Keef\" about the Public Order Resentencing Directive. As it had occurred during their sentence, the prisoners were desperate for news, although Andor denied any knowledge of it. As the other inmates spoke about getting punished for the rebel activity, Melshi chimed in and told Andor that the days on his sentence did not matter: the Empire would simply keep them there until they no longer had any need for them, and leaving was just a dream. Loy overheard the prisoner and shoved him against the wall to stop him speaking. At that moment, the nightly alarm began sounding, prompting the prisoners to head for their beds as the floor prepared to electrify.\nBy thirty shifts later, Andor was well accustomed to the daily factory routine Melshi had already gotten used to. Not long after, Veemoss, a worker at table three, took his own life by stepping on the sleeping block hall's floor while it was electrified during sleeping hours. Melshi and the other inmates threw around comments about the loss of a worker and the disturbance until Loy told them to be quiet and the intercom voice gave the rest of the unit ten seconds to return to their beds.\nThe next day, Melshi and his table were laboring when Andor begun predicting that a new inmate would arrive to join table three, additionally choosing to swap with Ulaf when the old man had a problem with his hand. After Loy confirmed Andor's suspicions on the new arrival, the latter smirked at Melshi, who looked back with a poker face. As the prison guards prepared to bring the new arrival, Andor left to make a run to the refresher, Melshi watching him go.\nAfter the new inmate was taken in and the shift passed, Melshi and the rest of the unit waited at their bridge alongside their room's night shift unit. With no sign of movement, Melshi remarked the Imperials could keep them on the bridge forever, Loy shutting him down. Taga began receiving sign messages from other inmates on other, indicating that something was occurring on the far side of the facility's second level. A few seconds later, the lights on the bridge cut off, then shortly reactivated. Loy made excuses about the prison staff making counts, Melshi sardonically questioning why they cut the power to do so, to the manager's annoyance. Taga and other sign communicators began receiving word that something serious had happened on level two, and Loy argued with them before the group was then advised by the intercom and proceeded to their sleeping block as usual.\nAt their beds, Melshi watched from his bunk as Andor attempted to probe information from Loy about the guard numbers, the manager being insistent that such behavior would be regrettable. Taking a different approach, Andor supported Melshi's stance on the facility, stating that the prisoners are cheaper than droids and easier to replace. After Loy made his opinion clear, Melshi shrugged his fingers Andor, who proceeded to assert ti the manager that the Imperials were not listening to them.\nThe next morning on the bridge, the Five-Two night shift had heard a rumor that both shifts of Unit-Two-Five on Level 2 had been \"fried.\" Zinska, the Five-Two night shift manager, said it was because the inmates were causing trouble. After the two shifts were put \"on program,\" Ulaf asked what had happened, and Melshi responded that they all had been set free. Without hesitation, Loy turned and began beating Melshi for sharing his opinion again, but was quickly stopped by Andor, who encouraged that Loy not reveal their level of awareness.\nNear the end of the day's shift, Ulaf's well-being was severely degrading and at the end of the shift eventually collapsed from a stroke. Melshi and Andor assisted him halfway across the bridge before he could not walk any longer. Loy supervised, having Zinska summon a med-tech to tend to the suffering worker. Waiting for a med-tech to arrive, Loy ordered Melshi to continue to the sleeping block while he and Andor stayed with Ulaf. Unfortunately for Ulaf, the medic, Doctor Rhasiv, was unable to help him and had the man euthanized.\nMelshi readily joined the Rebel Alliance during the early Galactic Civil War against the Empire, intent on fighting the Empire every step of the way. An experienced soldier and infiltrator, Melshi was given the rank of sergeant in the Pathfinders branch of the Rebel Alliance Special Forces due to his experience as an undercover soldier. During his time with the rebels, Melshi became a good friend of Captain Cassian Andor, a member of Rebel Alliance Intelligence Service. As an infiltrator, Melshi served as a leader on a number of missions and often had to perform dirty work in the name of the Rebellion.\nAt one point, Melshi served together with Lieutenant Caluan Ematt on Gaulus. Sharing his expertise with other members of the Rebellion, Melshi also made additions to a rebel field manual, writing a section on various Imperial stormtrooper variants and describing the distinctive features of each of those branches. By 0 BBY, Melshi was a member of the Massassi Group, the largest rebel cell operating from the Great Temple on the fourth moon of the planet Yavin, where he answered to General Davits Draven. By that point, the sergeant was considered one of the Alliance's seasoned veterans.\nIn 0 BBY, Andor received intelligence that the Empire was building a superweapon with enough firepower to destroy a planet. The Alliance, in an attempt to make contact with the weapon's leading engineer, Galen Erso, decided to locate his daughter, Jyn. The rebels uncovered recent arrest files on Erso indicating that she was being held inside Imperial Detention Center \u0026 Labor Camp LEG-817 on the planet Wobani under the alias \"Liana Hallik.\" Having verified that information, General Draven approved the formation of Extraction Team Bravo, a rapid-response team of Marine Corps led by Melshi. The team included two other rebel troopers as well as K-2SO, a reprogrammed Imperial KX-series security droid, which was recommended to Melshi by Andor.\nA rescue plan was personally devised by Melshi, who was able to find the exact location and moment when a rescue could be attempted. The extraction team used a U-wing starfighter designated Bravo One to reach Wobani, timing their arrival to coincide with the moment when Erso was being transported on a workers' convoy. Evading Imperial sensors, the team landed on the planet and proceeded undercover to a halfway point between the prison and the convoy's destination. With great risk to themselves, the team overtook and boarded one of the Empire's HCVw A9 turbo tanks that held the captive Erso. Melshi and his men took out two stormtrooper guards, after which the sergeant unlocked Erso's stuncuffs, informing her that she was being rescued. However, Erso believed that Melshi was a member of the Partisans group, sent by her former mentor Saw Gerrera with the mission to assassinate her. As such, when another prisoner asked Melshi to unbind him, Erso took advantage of the distraction, punching Melshi in the face and grabbing a nearby shovel. Erso knocked out Melshi and his companions with the shovel before rushing from the tank, only to be intercepted by K-2SO outside.\nWith Erso taken into custody, Melshi and the extraction team returned to Bravo One and left the planet. However, the team experienced a technical malfunction with the U-wing's navigation computer, rendering them unable to make the jump to hyperspace and forcing them to take refuge inside an asteroid field in the Wobani system. The situation necessitated K-2SO to call for assistance from the Alliance Fleet, which quickly responded by sending Red Flight, a group of four T-65B X-wing starfighters, to assist Melshi's team and provide escort until the rebel CR90 corvette Vigilant arrived to pick up the team. However, as soon as the Vigilant arrived in the system, an Imperial-class Star Destroyer emerged from hyperspace, destroying the corvette and catching Bravo One with a tractor beam. While Red Flight fought off the Star Destroyer's complement of TIE fighters, K-2SO was able to repair their craft's navigation computer. Red Flight then destroyed the Star Destroyer's targeting array, momentarily disabling the tractor beam and allowing Melshi's team to make the jump to hyperspace.\nSafely arriving on Yavin 4, Melshi escorted Erso to a meeting with the Alliance High Command, keeping her in binders and warning her not to try to escape again. After delivering his captive, Melshi also made sure to inform Lieutenant Voren Na'al that despite her young age, Erso should not be taken lightly, telling the lieutenant about Erso's ability to overpower trained Alliance troopers during her escape attempt on Wobani. The Alliance recruited Erso on a mission to locate her father, a task that she completed.\nThrough Galen, Jyn learned that the Imperial superweapon project was named the \"Death Star\" and that her father had secretly sabotaged the project. Galen had placed a crucial weakness in the station's design that could be taken advantage of in order to destroy the superweapon. However, the only way the Alliance could identify that weak spot was by obtaining a copy of the Death Star's technical readouts, which were being kept inside a secure vault in the Imperial security complex on the planet Scarif. Jyn attempted to persuade the Alliance High Command to assemble a strike team to retrieve the plans, but the rebel leaders vetoed the mission.\nHowever, before the official decision was even announced, Andor had started assembling a volunteer force to accompany Erso to Scarif. Melshi was against the Alliance High Command's decision to do nothing, so when he was approached by his friend and asked to form an infiltration team, he enthusiastically accepted the offer. Melshi hastily began assembling a team among the SpecForce commandos, making it clear that the mission was voluntary and those who joined were disobeying orders.\nMelshi was grateful when more than a dozen commandos volunteered for the mission—including the Drabatan warrior Paodok'Draba'Takat and a higher-ranking officer, Lieutenant Taidu Sefla—as well as some non-SpecForce soldiers, such as Corporal Stordan Tonc. Melshi and his recruits joined a team consisting of Andor, Erso, K-2SO, defected Imperial pilot Bodhi Rook, and the Guardians of the Whills Chirrut Îmwe and Baze Malbus to form a squad of over two dozen men. After appropriating as much rebel equipment as it could, the team—taking on the callsign Rogue One—boarded a stolen Imperial cargo ship, SW-0608, and departed for Scarif.\nAn important Imperial location, Scarif was protected by a planetary shield, with the orbital Shield Gate space station providing the sole means of entry. Since Rogue One was in possession of the stolen shuttle's Imperial access codes, the rebel infiltrators were able to pass through the Shield Gate. As the shuttle approached Landing Platform Nine of the Imperial security complex, Andor and Erso instructed the members of Rogue One in their plan. Melshi, Pao, Îmwe, and Malbus were to go with the main rebel team, which was supposed to provide a distraction and draw out as many Imperial forces from the complex as possible, allowing Andor, Erso, and K-2SO to sneak inside the data vault and steal the Death Star plans.\nDue to his complete trust in Melshi's skills, and believing that the sergeant had mission-specific knowldedge crucial to the success of the mission, Andor assigned him as the overall commander of the rebel forces instead of the highest-ranking officer, Lieutenant Sefla. After the shuttle landed, an Imperial inspection team boarded it, but the rebels, hidden inside a cargo compartment, overpowered them. Andor and Erso disguised themselves with uniforms taken from the Imperials and left the ship. Leaving five men aboard the shuttle with Rook, Melshi took the rest of the rebel troops and sneaked away through the shuttle's bottom hatch, using cover provided by blasts of coolant that spewed from the shuttle's purge vents per standard Imperial landing procedures.\nAs instructed by Andor, Melshi led his troops into the jungles of Scarif eastward from the shuttle, until they reached a small hillock near some Imperial barracks. Distributing demolition charges among his team, Melshi had his troops set explosives on the various landing pads outside of the complex while Îmwe and Malbus dispatched any stormtroopers who posed a danger to the infiltrators. After planting the charges, the team reassembled at Melshi's position at the barracks, taking cover and preparing for an ambush of Imperial forces. When Andor, Erso, and K-2SO entered the Imperial complex, Melshi received contact from Andor, who gave him the go-ahead to detonate the explosives. Melshi triggered the bombs, and the explosions on multiple landing pads led the Empire to believe that it was being attacked by multiple groups of rebels at once; Rook added to the confusion with false reports of rebel activity via radio. Responding to the attacks, the Imperial garrison rushed from the barracks, right into the path of Rogue One's fire.\nDue to the surprising nature of Melshi's attack, the battle at the barracks initially went in the rebels' favor. However, as Imperial reinforcements began to arrive in great numbers, Rogue One took heavy casualties. Melshi's troops attempted to hold their ground at the hillock, but the stormtroopers took a spearhead formation in an attempt to break their defense. In the heat of the battle, Melshi spotted a brief opportunity to break the Imperial formation. The sergeant ordered his forces into attack, and Rogue One destroyed a number of Imperials with a well-aimed shot from a missile launcher. However, Rogue One failed in its last-ditch attempt and had to retreat into the jungle, as the Empire threw all of its forces, including AT-ACT walkers and TIE strikers, at the rebels.\nMeanwhile, the Rebel Alliance fleet—having intercepted Imperial communications regarding rebel activity on the planet—arrived at Scarif to assist Rogue One. The Alliance was able to reinforce Melshi's squad on the surface with a number of U-wings carrying rebel troopers, while X-wings from Blue Squadron provided air support. The Empire quickly responded by closing the Shield Gate, effectively trapping the rebel forces on the surface and preventing them from contacting the rebel fleet. Melshi and a dozen survivors from the battle at the barracks emerged from the jungle onto the beach of Scarif, where they witnessed the arrival of rebel reinforcements, who successfully destroyed several AT-ACTs. In the midst of the continuing battle with Imperial forces, Melshi was contacted by Corporal Tonc—one of the troopers left behind at the shuttle with Rook—through the long-range communications booster that the sergeant carried.\nTonc and Rook informed Melshi that he needed to locate something called a \"master switch\" in order to link up the Imperial complex's massive Citadel Tower with Rook's shuttle. Doing so would allow Rook to contact the rebel fleet in space and instruct them to create an opening in the planetary shield, enabling Andor and Erso to transmit the Death Star plans to the rebel ships. Rook instructed Melshi that the master switch was located inside a bunker complex within the outer perimeter of the Citadel Tower. Following Rook's instructions, Melshi led the remainder of Rogue One—partially reinforced by arriving rebel troops—to the Citadel Tower. While the team was approaching the bunker complex, elite Imperial death troopers joined the fight, killing rebel soldiers one by one.\nAs he was trying to help a wounded rebel to safety, Melshi himself was hit by enemy blaster fire. Gravely injured, he was forced to take cover at the door of the bunker complex. The only ones who made it to the bunker alongside Melshi were Îmwe, Malbus, and Lieutenant Sefla. Melshi was contacted by Rook, who informed him that Andor and Erso had successfully retrieved the Death Star plans; now the rebels desperately needed to turn the master switch, which Melshi spotted located at a workstation ten meters away from the bunker, directly in the line of fire of the death troopers. Sefla attempted to make a run for it, but he was immediately gunned down by the enemy soldiers.\nA few moments later, Melshi succumbed to his injury and died as well. However, Îmwe was able to activate the master switch, before he and Malbus also met their ends at the hands of the death troopers. With the link between the Citadel Tower and Rogue One's shuttle established, Rook successfully contacted the rebel fleet, telling them about his plan to transmit the Death Star plans before being killed. The Alliance Fleet successfully destroyed the Shield Gate, allowing Andor and Erso to beam the Death Star plans to the rebel ships. Meanwhile, the Death Star arrived in orbit and fired its superlaser, destroying the Imperial security complex and killing any remaining rebel forces still on the surface of the planet, including Andor and Erso.\nThe Battle of Scarif was the first major victory for the Rebellion in the Galactic Civil War, and the successful extraction of the Death Star plans by Melshi's team allowed the Rebel Alliance to destroy the battle station shortly afterward during the Battle of Yavin. Lieutenant Ematt felt sorry for Melshi's passing, believing that the sergeant had met his end too early. Decades later, when Ematt—now a major in the Resistance against the First Order—obtained a copy of Melshi's article on stormtroopers, he fondly remembered the fallen sergeant. Ematt also considered using Melshi's successful extraction plan of Jyn Erso as a template for similar Resistance operations.\nStanding at 1.83 meters Ruescott Melshi was a tall, light-skinned man with brown eyes, black hair—which he kept almost completely shaven—and a stubble of facial hair. Despising the Empire, Melshi joined the Rebel Alliance and eventually became an experienced SpecForce soldier and a veteran member of the Rebellion. In that capacity, Melshi came to perform some dirty work for the Alliance, never hesitating to do so in the name of the Rebellion's pure ideals. Overall, the sergeant considered the Alliance Special Forces to be superior to its Imperial equivalent, and he believed that the SpecForce's successes would be a major contributing factor in defeating the Empire.\nThe sergeant led his soldiers by example and never asked his troops to do something he was unwilling to do himself in order to fulfill objectives that he considered achievable or at least worth risking everything for. He displayed calm leadership when resuing Erso, and when assembling his team to go Scarif, Melshi made sure to choose only volunteers, thoroughly explaining all dangers and repercussions of the upcoming mission. He cared for his fellow soldiers, trying to get a wounded rebel to safety on Scarif while being shot at by enemy troops. Due to his attitude, the troops under Melshi's command were ready to follow his orders unconditionally.\nMelshi was close friends with Cassian Andor, readily accepting his request to accompany him to Scarif, unafraid of the consequences of disobeying direct orders of the Alliance command. Andor, in turn, placed his complete trust in Melshi, assigning him as the overall commander of the Rogue One team, even though he was not the highest-ranking officer present on the mission. Although Melshi himself was on Scarif in violation of the Alliance's command authority, the sergeant did not appreciate it when those under his command disobeyed his orders. When the Guardians of the Whills refused to take explosives and instead chose to pick off patrolling stormtroopers, Melshi was displeased with their disobedience but allowed them to proceed with their own plans.\nAfter being hit with a shovel by Jyn Erso on Wobani, Melshi held a grudge against her. Recognizing her ability to disable trained Alliance soldiers, he kept her in binders all the way to Yavin 4. Upon arrival at the rebel base, he made sure to warn fellow rebels of the danger that she presented. He was acquainted with the Iakaru cover-fire specialist Bistan, finding him crazy but trusting in his ability to cover even the most dangerous of landings. While serving on Gaulus, Melshi also met Lieutenant Caluan Ematt, who fondly remembered the sergeant after his death, calling him an \"old nek\" and lamenting his passing.\nSergeant Melshi was a combative and practical commander who never shied away from improvisation when presented with a difficult mission. He was one of the most experienced soldiers in the Alliance, and his talent for improvisation proved crucial for the success on Scarif, where Melshi had to quickly adapt to rapid changes in strategy. Melshi was adept at reconnaissance and displayed an affinity for combat tactics, personally crafting a successful strategy to liberate Jyn Erso on Wobani. Highly intelligent, Melshi also quickly realized that since the Empire heavily outnumbered the rebels on Scarif, their only choice was to attack in such a way as to appear more powerful than they were. During the battle at the barracks, Melshi was also able to see an opening for a counterattack and tried to exploit it to regain the advantage in the fight.\nSeeing rebel forces arriving to assist Rogue One on Scarif, Melshi was grateful for the help, but he also predicted the immediate Imperial response, realizing that the Empire would close the planetary shield to cut off the rebels. As an infiltrator and a member of the Pathfinders, Melshi was an expert at wilderness fighting while camouflaged, which worked to his advantage in the jungles of Scarif. When Bodhi Rook tried to explain to Melshi the importance of the master switch, the latter was fairly confused with the terminology; a soldier first and foremost, Melshi had little knowledge of communications technology. In addition to his combat prowess and agility, Melshi also had some moderate skills in diplomacy. The sergeant was not Force-sensitive.\nLike the other prisoners of the Narkina 5 facility, Melshi wore white trousers and a white shirt that featured orange accents on its left side. As a SpecForce soldier, Melshi carried a variety of specialized equipment while on duty. When the sergeant was performing the extraction of Jyn Erso on Wobani, he was almost completely covered in gear, leading Erso to mistake him for a ruthless assassin sent after her by Gerrera. During the Battle of Scarif, Melshi was armed with an A-300 blaster rifle with a collapsed barrel and no stock, a model which he favored for its compactness. He wore a standard outfit of SpecForce commandos, consisting of trousers, a jacket and a vest—all with multiple pockets—along with reinforced gloves and boots. He was content with wearing a quilted fabric cap instead of a metal helmet worn by some of the troops under his command. A headset comlink repeater and earpiece were attached to his headgear, allowing orders to be relayed to Melshi and to his soldiers, and enabling the sergeant to monitor his unit's responses.\nTrained to operate in any kind of environment, Melshi was equipped with a pair of goggles meant to protect his eyes against shrapnel, dirt and intrusive atmosphere particles. He also carried a long-range communications booster, which allowed him to cut through Imperial jamming on Scarif and maintain communications with his squad. His other equipment included an additional comlink and a pair of quadnoculars as well as a heavy backpack with a long range communications amplifier. Melshi was responsible for handling the demolition work on Scarif, distributing the explosives and being the one to pull the trigger.\nRuescott Melshi first appeared in the 2016 Star Wars Anthology film Rogue One: A Star Wars Story, in which he was portrayed by actor Duncan Pow. Pow reprised his role for the Andor television series, released in 2022. Melshi was first revealed in the second trailer for the film on October 13, 2016. In the film, the character was addressed only by his last name; the first name \"Ruescott\" was established in the film's novelization, as well as the books Star Wars: Rogue One: Secret Mission and Star Wars: Rogue One: The Ultimate Visual Guide, all released simultaneously with the film on December 16, 2016.\nDuncan Pow joined the crew working on Rogue One: A Star Wars Story during the early stages of the film's production, initially as an assistant helping with actor auditions and screen tests. Eventually, he was himself cast as Melshi, an opportunity he was immensely grateful for. Pow described the experience of playing Sergeant Melshi and being a part of the Star Wars universe as a \"dream come true,\" as Star Wars: Episode V The Empire Strikes Back was the first ever film that he had seen at the cinema. He praised the overall filming experience as an amazing chance to live out his childhood dreams. With regard to the filming of the Scarif scenes—which were shot on the Maldives—Pow especially remembered the hot climate. His favorite scene to film was the action sequence in which Melshi got shot during the approach to the bunker. Pow has been following the portrayal of Melshi in other media adaptations of Rogue One, and he is aware of the first name of his character.\nThe adult and the junior novelizations of Rogue One give conflicting information with regard to the exact circumstances of Melshi's death. In the adult novel, Melshi succumbs to the blaster shot wound he received earlier and dies at the bunker doors. In the junior novel, more than four people reach the bunker doors. After Sefla unsuccessfully tries to reach the master switch, Melshi—seeing as there are no more volunteers to complete the mission—makes his own attempt to run for it rather than ordering one of his own men to do so. He makes it slightly farther than Sefla before he is gunned down by the enemy. Since his death in the film occurs off-screen, it is impossible to determine which variation of his death is canonical. This article currently follows the adult novel's depiction of events.\nAnother contradiction is presented in the book Star Wars: Rogue One: Ultimate Sticker Encyclopedia, which does not mention Melshi at any point. Instead, the book states that Lieutenant Sefla commanded the rebel troops on the ground during the Battle of Scarif. However, other sources, such as Star Wars: Rogue One: The Ultimate Visual Guide, have established that Melshi was the commander of ground forces despite being outranked by Sefla.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/39_BBY",
  "/wiki/30_BBY",
  "/wiki/0_BBY",
  "/wiki/Scarif",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Unit_Five-Two-D",
  "/wiki/Table_five",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/Extraction_Team_Bravo",
  "/wiki/Rogue_One",
  "/wiki/Sergeant",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/5_BBY",
  "/wiki/Narkina_5",
  "/wiki/Prisoner",
  "/wiki/Time",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Captain",
  "/wiki/Rebel_trooper",
  "/wiki/Commanding_officer",
  "/wiki/Troop",
  "/wiki/Mission_to_the_Ring_of_Kafrene",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Liberation_of_Erso",
  "/wiki/Jyn_Erso",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Death_Star",
  "/wiki/Engineer",
  "/wiki/Imperial_Detention_Center_%26_Labor_Camp_LEG-817",
  "/wiki/Planet",
  "/wiki/Wobani",
  "/wiki/Erso_family",
  "/wiki/Operation_Fracture",
  "/wiki/Parent",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Saboteur",
  "/wiki/Death_Star_plans",
  "/wiki/Squad",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death",
  "/wiki/Reproduction",
  "/wiki/The_galaxy",
  "/wiki/Prison",
  "/wiki/Narkina_5_Imperial_Prison_Complex",
  "/wiki/Moon",
  "/wiki/Standard_hour",
  "/wiki/Jemboc",
  "/wiki/Xaul",
  "/wiki/Taga",
  "/wiki/Ulaf",
  "/wiki/Ham",
  "/wiki/Standard_day",
  "/wiki/Foodstuff",
  "/wiki/Shower",
  "/wiki/Kino_Loy",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani",
  "/wiki/Public_Order_Resentencing_Directive",
  "/wiki/Standard_minute",
  "/wiki/Sleep",
  "/wiki/Dream",
  "/wiki/Veemoss",
  "/wiki/Standard_second",
  "/wiki/Refresher",
  "/wiki/Zinska",
  "/wiki/Doctor",
  "/wiki/Rhasiv",
  "/wiki/Soldier",
  "/wiki/Lieutenant",
  "/wiki/Caluan_Ematt",
  "/wiki/Gaulus",
  "/wiki/Combat_Tactics:_Rebel_Field_Manual",
  "/wiki/Stormtrooper",
  "/wiki/Massassi_Group",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Yavin_Prime",
  "/wiki/General",
  "/wiki/Davits_Draven",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Marine_Corps",
  "/wiki/K-2SO",
  "/wiki/Programmer",
  "/wiki/KX-series_security_droid",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Bravo_One",
  "/wiki/Transport",
  "/wiki/Convoy",
  "/wiki/Sensor",
  "/wiki/HCVw_A9_turbo_tank",
  "/wiki/Stuncuffs",
  "/wiki/Partisans",
  "/wiki/Saw_Gerrera",
  "/wiki/Assassin",
  "/wiki/Unidentified_prisoner_(Wobani)",
  "/wiki/Shovel",
  "/wiki/Tank_(vehicle)",
  "/wiki/Navigation_computer",
  "/wiki/Hyperspace",
  "/wiki/Asteroid_field",
  "/wiki/Wobani_system",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Red_Flight_(Rebel_Alliance)",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/CR90_corvette",
  "/wiki/Vigilant_(CR90_corvette)",
  "/wiki/Star_system",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Corvette",
  "/wiki/Tractor_beam",
  "/wiki/Star_Destroyer",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Computer",
  "/wiki/Tractor_beam_targeting_array",
  "/wiki/Alliance_High_Command",
  "/wiki/Voren_Na%27al",
  "/wiki/Trooper",
  "/wiki/Battle_on_Jedha",
  "/wiki/Battle_station",
  "/wiki/Scarif_vault",
  "/wiki/Special_forces",
  "/wiki/Commando",
  "/wiki/Drabatan",
  "/wiki/Paodok%27Draba%27Takat_Sap%27De%27Rekti_Nik%27Linke%27Ti%27_Ki%27Vef%27Nik%27NeSevef%27Li%27Kek",
  "/wiki/Military_rank",
  "/wiki/Alliance_officer",
  "/wiki/Taidu_Sefla",
  "/wiki/Corporal",
  "/wiki/Stordan_Tonc",
  "/wiki/Pilot",
  "/wiki/Bodhi_Rook",
  "/wiki/Guardians_of_the_Whills",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Baze_Malbus",
  "/wiki/Callsign",
  "/wiki/Thief",
  "/wiki/Zeta-class_Heavy_Cargo_Shuttle",
  "/wiki/SW-0608",
  "/wiki/Planetary_shield",
  "/wiki/Orbit",
  "/wiki/Shield_Gate",
  "/wiki/Space_station",
  "/wiki/Shuttle",
  "/wiki/Landing_Platform_Nine",
  "/wiki/Imperial_Military",
  "/wiki/Data_vault",
  "/wiki/Officer",
  "/wiki/Imperial_ground_crew",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Starship",
  "/wiki/Coolant",
  "/wiki/Jungle",
  "/wiki/Barracks",
  "/wiki/Hangar",
  "/wiki/Comm_unit",
  "/wiki/Garrison",
  "/wiki/Missile_launcher",
  "/wiki/All_Terrain_Armored_Cargo_Transport",
  "/wiki/TIE/sk_x1_experimental_air_superiority_fighter",
  "/wiki/Fleet",
  "/wiki/X-wing_starfighter",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/Beach",
  "/wiki/Citadel_Tower",
  "/wiki/Realspace",
  "/wiki/Deflector_shield",
  "/wiki/Death_trooper",
  "/wiki/Blaster",
  "/wiki/Blast_door",
  "/wiki/Superlaser",
  "/wiki/Battle_of_Yavin",
  "/wiki/Standard_decade",
  "/wiki/Major",
  "/wiki/Resistance",
  "/wiki/First_Order",
  "/wiki/The_Rebel_Files",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Imperial_Special_Forces",
  "/wiki/Iakaru",
  "/wiki/Bistan",
  "/wiki/Nek",
  "/wiki/Diplomat",
  "/wiki/Force-sensitive",
  "/wiki/A-300_blaster_rifle",
  "/wiki/Barrel",
  "/wiki/Stock",
  "/wiki/Jacket",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Helmet",
  "/wiki/Headset",
  "/wiki/Comlink",
  "/wiki/Ear",
  "/wiki/Goggles",
  "/wiki/Atmosphere",
  "/wiki/Quadnoculars",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Duncan_Pow",
  "/wiki/Andor_(television_series)",
  "/wiki/2022",
  "/wiki/October_13",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/December_16",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Rebel_Rising",
  "/wiki/Rebel_Rising_(audiobook)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/StarWars.com",
  "/wiki/Rogue_One:_A_Star_Wars_Story_-_The_Official_Collector%27s_Edition",
  "/wiki/Rogue_One:_A_Star_Wars_Story_-_The_Official_Mission_Debrief",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/2018_Topps_Star_Wars_Galactic_Files",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_38",
  "/wiki/Star_Wars_Universe",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/The_Birth_of_the_Rebellion",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Ruescott_Melshi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Kassa_(episode)",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope"
 ]
}