{
 "name": "Rugar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "black eyebrows"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Rugar was a Human male soldier who lived during the reign of the New Republic. He wore light-colored clothing with a large red shape in the center of his shirt. Rugar had brown hair and eyes, though his eyebrows were black. Rugar also had lightly colored skin with a small scar on his left cheek. As a soldier, Rugar wielded weapons such as the E-11 blaster rifle, thermal detonators, a Rail detonator, and the Imperial repeater rifle.\nRugar first appeared in the 1997 computer game Star Wars: Jedi Knight: Dark Forces II as a character who only appeared in the game's multiplayer addition as a playable character model. He appeared again in Jedi Knight's expansion pack, Star Wars: Jedi Knight: Mysteries of the Sith. Mysteries of the Sith introduced \"multiplayer personalities,\" a form of character creation that put different character models under different professions. Each profession also had their own set of starting weapons for a match, with Rugar being categorized as a soldier. Rugar's body texture was a slightly modified version of the body texture used by another multiplayer character named Santiago. Due to his multiplayer only appearances, Rugar's place in canon is uncertain.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Shirt",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Rail_detonator",
  "/wiki/Imperial_repeater_rifle",
  "/wiki/1997",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/Santiago",
  "/wiki/Canon"
 ]
}