{
 "name": "Ruggle Schmong",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Ruggle Schmong was a Sullustan male shipwright who developed the idea of funneling energy generated by a starship's propulsion systems back into its weapon systems of batteries, where it would be reutilized by the vessel. Around the time of the Clone Wars, following struggles to receive support from shipbuilding companies, Schmong gained an opportunity from those within the Confederacy of Independent Systems. Through the Confederacy, the Sullustan was offered with funding to design the Subjugator-class heavy cruiser, which was to be utilized by the government's naval forces.\nRuggle Schmong was a Sullustan male engineer and shipwright who dreamed of recapturing the waste heat and other propulsion byproducts of starships and funneling the energy into a massive grid of batteries. The idea was ambitious, but still needed some tinkering, and Schmong struggled to find a backer for his theoretical new system to power starships as shipbuilders concluded that the systems needed to capture the propulsion energy would require more space then was commercially viable.\nSchmong eventually received backing from the war ministers of the Confederacy of Independent Systems, who gave him a warm reception and offered all of the credits and raw materials he would need to realize his dream. Schmong then created the Subjugator-class heavy cruiser, a model of heavy cruiser based off a discarded SoroSuub Corporation starship design.\nSeparatist General Grievous used the first Subjugator-class vessel completed, the Malevolence, as his flagship to lead the Malevolence Campaign during the Clone Wars; however, he discovered that the ship proved a danger to itself as energy from its ion cannon often bleeding back into the ships other systems and disrupting them, a flaw in Schmong's design that the Galactic Republic ultimately used to destroy the ship in 22 BBY. Despite the loss, the Confederacy did make use of further Subjugator-class ships later in the war.\nIn the new Star Wars canon, Ruggle Schmong was first mentioned in the De Agostini magazine Star Wars: Build the Millennium Falcon 43 which was published around October 28, 2015. The character originated in the Star Wars Legends continuity, where he was first mentioned in annotation on the The Clone Wars: Decoded re-release of the Star Wars: The Clone Wars episode Rising Malevolence.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ruggle_Schmong",
  "/wiki/Ruggle_Schmong/Legends",
  "/wiki/Sullustan",
  "/wiki/Gender",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Shipwright",
  "/wiki/Starship",
  "/wiki/Battery",
  "/wiki/Time",
  "/wiki/Clone_Wars",
  "/wiki/Subjugator-class_heavy_cruiser",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/Engineer",
  "/wiki/Minister",
  "/wiki/Credit",
  "/wiki/Heavy_cruiser",
  "/wiki/SoroSuub_Corporation",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Malevolence",
  "/wiki/Flagship",
  "/wiki/Malevolence_Campaign",
  "/wiki/Ion_cannon",
  "/wiki/Galactic_Republic",
  "/wiki/22_BBY",
  "/wiki/Star_Wars",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon",
  "/wiki/October_28",
  "/wiki/2015",
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Clone_Wars:_Season_One#The_Clone_Wars:_Decoded",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Rising_Malevolence",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_43",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_2",
  "/wiki/January_14",
  "/wiki/January_8",
  "/wiki/November_6",
  "/wiki/2016"
 ]
}