{
 "name": "Rugor Nass",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.06 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gungan Grand Army",
      "Gungan High Council"
     ]
    }
   ]
  }
 ],
 "content": "Rugor Nass was a Gungan male who served as the Boss of the Gungan High Council during the Trade Federation's invasion of Naboo. At some point, Nass served in the Gungan Grand Army. When Nass served as Boss, he governed the Gungans from the city of Otoh Gunga within Naboo's oceans, keeping a close eye on Gungan affairs and, for a time, ensuring that the Gungans and the human population of Naboo did not interact.\nHe initially refused to help the Naboo during the invasion, rejecting Jedi Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi when they requested it, but ultimately had a change of heart when Queen Padmé Amidala knelt and pleaded her case before him in behalf of the Naboo and the Gungans, promising that administration the planet's affairs would be shared between the two races from that time forth. After the Battle of Naboo, in which the Naboo and the Gungans were victorious over the Federation, Nass joined Queen Amidala in peace. Nass' tenure as Boss ended sometime before or during the Clone Wars, and he attended Amidala's funeral after her death at the end of the war.\nRugor Nass was born on Naboo sometime prior to the Invasion of Naboo. Nass served in the Gungan Grand Army for a time; Tobler Ceel, the gungan with the most battlefield experience among high-ranking members of the officer corps, was a close friend and former comrade-in-arms to Nass. Nass later became the Boss of the Gungans, governing his people from the underwater city of Otoh Gunga beneath the planet's Lake Paonga.\nHe also gained the title of governor, with one of his first acts under the title being to order the construction a new distinguished boardroom and new office suites. Although the boardroom became the meeting chamber of the Gungan High Council, a number of the offices had yet to be given any purpose by the time of the Invasion of Naboo. A short time before the invasion, Boss Nass banished Jar Jar Binks for crashing his personal heyblibber submarine. Due to the difficult relationship between the Gungans and the human Naboo, Boss Nass thought the Naboo to be arrogant and condescending towards his people.\nShortly after the Trade Federation invasion, Boss Nass held an audience with the Jedi ambassadors Master Qui-Gon Jinn, his Padawan Obi-Wan Kenobi, and Jar Jar Binks. Binks had led the Jedi ambassadors to Otoh Gunga but had been arrested by Captain Roos Tarpals for breaking his banishment. Master Jinn had come to warn the Gungans about the threat posed by the Trade Federation to the entire planet. Believing this to be a matter between the Naboo and Federation, Nass refused to get involved. However, under Jinn's mind trick, he told them that the speediest way to the Naboo people was through the planet's core.\nWhen Master Jinn asked what was to happen to Binks, Nass replied that he would be punished. Jinn came to Bink's defense by pointing out that he had saved the Gungan's life and that Binks owed him a life debt. Master Jinn's words convinced Boss Nass, who allowed Binks to leave as a guide for the two Jedi. Boss Nass provided Binks and the Jedi with a bongo submarine to reach Theed. Despite the Gungans' refusal to get involved in the conflict, the Trade Federation soon turned its attention to the Gungan cities, leading to an evacuation of Otoh Gunga. The Gungans rallied at the Gungan Sacred Place to plan their retaliatory attacks in the Boss Meetup.\nLater, the Naboo Queen Padmé Amidala traveled to the Sacred Place to forge an alliance with Boss Nass and the Gungans. After Amidala's decoy Sabé initiated contact with Nass, Amidala revealed herself in order to gain his trust. She told Boss Nass that the Trade Federation had destroyed all that the Naboo and Gungans had built and fought for. If they did not work together, the Trade Federation would dominate the planet. Swayed by Amidala's appeal, Boss Nass decided to put aside his people's distrust of the Naboo and to be friends. As a result, the Gungans agreed to assist the Naboo and the Jedi in expelling the Trade Federation. To honor Binks for his role in bringing the two peoples together, Nass made him Bombad General of the Gungan Grand Army which diverted the Federation's army away from Theed and subsequently laughed loudly when Binks fainted in front of him.\nBoss Nass was later present at the joint victory celebrations held at Theed. There, he received a symbolic orb from Queen Amidala and vowed that the two peoples would live in peace. Following the parade, Nass was given a Blobball by the Queen and Binks.\nAt some point, Nass was succeeded by Lyonie as head of the Gungan High Council. At the end of the Clone Wars, Amidala died and Nass attended her funeral alongside Jar Jar Binks with a heavy heart, mourning the loss of both a dear friend and the woman who helped bring peace between their peoples.\nRugor Nass was a confident and proud ruler of the Gungan people. He was a pudgy and heavily-built Gungan who dressed in ornate robes befitting his status as a ruler. His personality was very loud and bombastic, though this was tempered somewhat when in formal circumstances, and he also had a considerable sense of humor, laughing uproariously when Jar Jar Binks fainted. He regarded the Human Naboo as arrogant and condescending towards his people and was initially reluctant to help them during the Trade Federation invasion of their planet. Nass also initially had a low opinion of Jar Jar Binks after the latter crashed his personal bongo submarine; leading the former to banish Binks into the swamps.\nWhile initially wary of the Naboo, Nass came to respect Queen Padmé Amidala after she urged the two people to put aside their differences in order to save their homeworld and civilizations from the Trade Federation. As a result, Nass buried his people's hatchet with the Naboo and committed the Gungan Grand Army to driving out the Federation. Following the expulsion of the Trade Federation, Nass publicly expressed his desire for the Gungans and Naboo to live in peace.\nRugor Nass first appeared in the 1999 film Star Wars: Episode I The Phantom Menace. He was a CGI character who was voiced by Brian Blessed, who reprised his role as Nass in the 2005 film Star Wars: Episode III Revenge of the Sith.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rugor_Nass",
  "/wiki/Rugor_Nass/Legends",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Raiders_of_the_Lost_Gundark",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Special:Upload",
  "/wiki/Naboo",
  "/wiki/Gungan",
  "/wiki/Ankura",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Gungan_Grand_Army",
  "/wiki/Gungan_High_Council",
  "/wiki/Boss",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Militiagung",
  "/wiki/City",
  "/wiki/Otoh_Gunga",
  "/wiki/Ocean",
  "/wiki/Time",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Battle_of_Naboo",
  "/wiki/Clone_Wars",
  "/wiki/Padm%C3%A9_Amidala%27s_funeral",
  "/wiki/Death",
  "/wiki/Tobler_Ceel",
  "/wiki/Surface_warfare",
  "/wiki/Officer_corps_(Gungans)",
  "/wiki/Lake_Paonga",
  "/wiki/Governor",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Heyblibber",
  "/wiki/Submarine",
  "/wiki/Jedi",
  "/wiki/Captain",
  "/wiki/Roos_Tarpals",
  "/wiki/Life_debt",
  "/wiki/Gungan_bongo_submarine",
  "/wiki/Theed",
  "/wiki/Gungan_Sacred_Place",
  "/wiki/Boss_Meetup",
  "/wiki/Sab%C3%A9",
  "/wiki/Bombad_General",
  "/wiki/Globe_of_Peace",
  "/wiki/Blobball",
  "/wiki/Lyonie",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Brian_Blessed",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_18",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Queen%27s_Hope",
  "/wiki/Darth_Vader_(2020)_3",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Exit_from_Endor",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_A_Galaxy_at_War",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_6",
  "/wiki/Databank_A-Z",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Naboo_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)"
 ]
}