{
 "name": "Rukh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Honoghr"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Noghri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.3 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Thrawn"
     ]
    }
   ]
  }
 ],
 "content": "Rukh was a male Noghri from Honoghr who served as the bodyguard and assassin of Imperial Grand Admiral Thrawn. Thrawn used Rukh's name as the override command for his sparring droids. Rukh was an excellent tracker and fighter with a strong senses of smell. During Darth Vader's mission with Thrawn, Rukh snuck around the barracks where Vader's personal forces resided, clearly not trusting them. In 1 BBY, Thrawn employed Rukh's services in hunting down members of the Spectres rebel cell and the Lothal resistance group. Rukh played an important role in capturing the Spectres leader and Rebel Alliance General Hera Syndulla during the failed attack on Lothal. Rukh would later see further action against the Spectres in the lead up to the Liberation of Lothal. Rukh perished at the hands of Garazeb Orrelios, who electrocuted him while fighting inside the Imperial Complex.\nIn 1 BBY, after the theft of the prototype TIE/d \"Defender\" Multi-Role Starfighter on Lothal, Grand Admiral Thrawn sent Rukh to assist Governor Arihnda Pryce in the search for the rebels responsible. Pryce suspected that the thieves would return to the vicinity of the crash site to retrieve the prototype's removed hyperdrive.\nUpon arriving at the crash site, Rukh smelled the Lasat rebel Garazeb Orrelios, as well as Ezra Bridger and Jai Kell, nearby where they were retrieving the drive. As the assassin approached the scene, Bridger attempted to stall him by claiming that he and Kell, who were both disguised as scout troopers, had just finished searching the area. The ruse did not work, and Rukh attacked the two. During the fight, he realized that Bridger was a Jedi when he used the Force to fling him into a rock. The two escaped on a speeder bike, with Rukh pursuing. Meanwhile, Orrelios had evaded the assassin and escaped with the hyperdrive in an Imperial Troop Transport.\nRukh chased Bridger and Kell through a labyrinth of rock spires on a speeder bike. He engaged Bridger in a brief fight, his electrostaff to Bridger's lightsaber. When the two rebels pulled ahead due to Rukh being forced to evade a boulder in his path, the assassin fired a homing beacon at their bike, which they did not notice. Rukh continued the pursuit, eventually launching his bike over a pile of rock that Bridger had created as an obstacle with a planted detonator While in the air, Rukh's bike was destroyed when Bridger fired upon it, and the rebels fled. Using his tracking device, Rukh located the rebel camp and sent Pryce the coordinates. However, due to the rebels' earlier escape, Pryce did not allow Rukh to take out the camp by himself, which he was confident he could do. She instead attacked with several tanks, a strategy that he criticized. After the Rebels had escaped the camp, deeper into the mountains, Rukh insisted that he be allowed to pursue, but Pryce refused, deciding instead to bomb the mountains.\nDuring the Rebel attack on Lothal, Rukh was stationed in Capital City. The rebels' attempts to destroy the Imperial fuel depot and factory had failed, as Thrawn had prepared a second set of TIE fighters to intercept the bombers after they broke through the blockade outside the planet. Upon being informed that some Rebel pilots may have survived their crash-landing, Thrawn tasked Rukh with capturing any survivors alive, only killing them if he had no choice. Thrawn also told him to capture Hera Syndulla, the attack's commander, at any cost. Rukh complied, and during his mission, he captured Rebel pilot Secon Daree and brought him to Pryce, who congratulated the assassin. Rukh later searched for Syndulla, acquiring her scent and found her helping another pilot, Mart Mattin. He ambushed the trio and engaged in a short skirmish with them. While he was unable to capture Mattin and Chopper, he managed to separate Syndulla from them, which led to her capture by Imperial forces.\nWhen the Spectres mounted a mission to rescue General Syndulla, Rukh was on patrol when he encountered two stormtroopers. Rukh asked the troopers if they had anything to report. His nostrils twitched as the Spectres passed over him in three Loth-bat gliders. Sensing something afoot, Rukh tried to warn Governor Pryce. While he was talking with her, the Jedi Knight Kanan Jarrus freed Syndulla from Pryce's office. Rukh pursued them by climbing up the Imperial Complex to the garbage chute on the south entrance. Rukh briefly fought with Kanan, resulting in the loss of Jarrus's lightsaber. However, Kanan pushed him off the building but Rukh managed to avoid death by clinging to a balcony. The rebels escaped on a glider but Kanan was killed.\nFollowing the death of Kanan Jarrus, Rukh was present in Governor Pryce's office during a hologram briefing with Grand Admiral Thrawn. Thrawn reprimanded Pryce for destroying the Lothal City fuel depot and disrupting the Empire's TIE Defender project on Lothal. After chastising Pryce, Thrawn warned Rukh that the rebels would strike recklessly and tasked him with eliminating them. As Rukh left the room, he smirked at the chastised Pryce.\nContinuing his hunt for the Spectres, Rukh encountered a scout trooper who had been knocked out by the Lasat Garazeb Orrelios. He narrowly escaped being killed by an explosive that Sabine Wren had planted on the trooper's bike. Rukh's sharp senses helped him to home in on Sabine and Zeb, and he followed them into the wilderness. Sabine and Zeb trapped him but Rukh turned the tables on them by activating his cloaking device. Armed with his cloaking device, Rukh viciously attacked Zeb.\nUsing her Mandalorian helmet's rangefinder, Sabine managed to shoot at Rukh. However, he was able to dodge her with superhuman reflexes and managed to knock out her helmet. After struggling with Zeb, Rukh retreated for a second round. This time, Sabine managed to neutralize his cloaking device by throwing a paint bomb at him, damaging his cloaking device and partially painting him. Now visible, he was quickly overpowered by Orrelios. Zeb almost beat him to death but was stopped by Sabine, who convinced him to spare Rukh's life. Wren instead spray-painted Rukh before sending him back to the Empire on a speeder bike.\nRukh accompanied Pryce on an invasion of the rebel base. Ryder Azadi nearly shot him, but decided to maintain his cover and let him go. Rukh fought with Ezra Bridger. When the rebels retreated into the cave, Rukh followed them with his men, and found Bridger standing in the dark. When Rukh taunted Bridger about his \"army,\" Bridger ignited his lightsaber, revealing a pack of Loth-wolves, terrifying him. In the ensuing battle, he was thrown off the encampment by the White Loth-wolf. While he survived the plunge, he lost his electrostaff.\nDespite being thrown by the loth-wolf, Rukh managed to survive the fall. Later, he found Commander Wolffe, Mart Mattin and Cikatro Vizago loading up the Ghost and attacked them. He easily subdued all three rebels and prepared to kill them, but became terrified when the white Loth-wolf returned and hastily boarded a stolen patrol transport to escape. He then informed Thrawn of Pryce's capture. Thrawn tasked him with disabling the Planetary Shield Generator.\nRukh managed to disable the generator, but was attacked by Orrelios, who fought him in the shield generator core. During their fight, Orrelios grabbed Rukh's foot as the Noghri attempted to gain the higher ground, and caught it in wires, crushing them and trapping Rukh's foot in the generator's wiring. As Kallus activated the shield generator, Zeb jumped to safety, but Rukh was stuck and unable to escape as the electric current burst across the generators, to the Noghri's horror. Realizing the shield was up as his bombardment did nothing to the city, Thrawn contacted Rukh for his status, but Orrelios had retrieved Rukh's comlink and laughingly informed Thrawn of the bodyguard's fate amidst the sound of Rukh being fried to death, which then went suddenly silent.\nRukh was fiercely loyal to the Galactic Empire in general and Grand Admiral Thrawn in particular, serving as the latter's bodyguard and top assassin. Unless ordered otherwise, he would pursue his targets relentlessly and without hesitation or remorse. From the moment he arrived on Lothal Rukh developed a rivalry with Governor Arihnda Pryce, showing contempt for her attempts at using brute force to subdue the rebels and receiving significant scorn from her over his abilities. After Pryce killed Kanan but destroyed the Imperial fuel depot on Lothal in the process, Rukh was present when she was admonished for her failure by Thrawn. He smirked in delight at the sight of his humbled rival.\nLike Pryce, Rukh was terrified of the Loth-wolves.\nAs a Noghri, Rukh could climb tall structures and travel quickly on all fours without tiring. His agility and reflexes made him formidable and unpredictable in close quarters combat. Despite this, he could be easily overpowered by Force-sensitives such as Bridger. Rukh also displayed a heightened sense of smell, catching the scent of Orrelios from a considerable distance, as well as easily seeing through Bridger and Kell's disguises.\nRukh proved skilled in melee combat even when outnumbered due to his use of a personal cloaking device. He had faster reflexes than a human and was able to match the Lasat Zeb's strength. However, when Rukh's cloaking device was compromised, he was no match for Zeb's brute force. Only Sabine's intervention saved him from death.\nRukh carried an electrostaff in combat, holding his own against the seasoned Bridger. He also employed tracking devices for help with finding targets, and knew how to operate a speeder bike. He also carried a personal cloaking device with him, as shown when he was fighting Garazeb Orrelios and Sabine Wren, which made him invisible.\nRukh was first introduced in Timothy Zahn's 1991 Star Wars Legends novel Heir to the Empire, as the bodyguard of Grand Admiral Thrawn. It was confirmed in Celebration Orlando 2017 that Rukh would appear in Star Wars Rebels Season Four with his voice provided by Star Wars veteran Warwick Davis.\nAccording to Rebels creator Dave Filoni, Rukh's confrontation against Zeb Orellios in the series finale \"Family Reunion – and Farewell\" was originally different, but it was re-staged as Filoni thought that the original didn't go anywhere and that it wasn't \"special\" enough.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rukh",
  "/wiki/Rukh/Legends",
  "/wiki/Keredian",
  "/wiki/Ruk",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Special:Upload",
  "/wiki/Honoghr",
  "/wiki/0_BBY",
  "/wiki/Lothal",
  "/wiki/Noghri",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Bodyguard",
  "/wiki/Assassin",
  "/wiki/Grand_Admiral",
  "/wiki/DT-series_sentry_droid",
  "/wiki/Anakin_Skywalker",
  "/wiki/1_BBY",
  "/wiki/Spectres",
  "/wiki/Lothal_resistance_group",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Attack_on_Lothal",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Imperial_Complex_(Lothal)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Theft_of_the_TIE_Defender_Elite",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/Thief",
  "/wiki/Hyperdrive",
  "/wiki/Lasat",
  "/wiki/Ezra_Bridger",
  "/wiki/Jai_Kell",
  "/wiki/Scout_trooper",
  "/wiki/Jedi",
  "/wiki/Force_push",
  "/wiki/The_Force",
  "/wiki/Speeder_bike",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Speeder",
  "/wiki/Electrostaff",
  "/wiki/Ezra%27s_second_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Homing_beacon",
  "/wiki/Detonator",
  "/wiki/Lothal_resistance_camp",
  "/wiki/TX-225_GAVr_%22Occupier%22_combat_assault_tank",
  "/wiki/Mountain",
  "/wiki/Capital_City",
  "/wiki/Lothal_City_fuel_depot",
  "/wiki/Imperial_Armory_Complex",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Bomber",
  "/wiki/Blockade",
  "/wiki/Planet",
  "/wiki/Rebel_pilot",
  "/wiki/Death",
  "/wiki/Commander",
  "/wiki/Pilot",
  "/wiki/Secon_Daree",
  "/wiki/Mart_Mattin",
  "/wiki/C1-10P",
  "/wiki/Imperial_Military",
  "/wiki/Rescue_of_Hera_Syndulla_(Lothal)",
  "/wiki/Loth-bat_glider",
  "/wiki/Jedi_Knight",
  "/wiki/Pryce%27s_office",
  "/wiki/Kanan_Jarrus%27_lightsaber",
  "/wiki/Hologram",
  "/wiki/Sinrich_optical_dephaser",
  "/wiki/Rangefinder",
  "/wiki/Paint_bomb",
  "/wiki/Loth-wolf",
  "/wiki/White_Loth-wolf",
  "/wiki/Wolffe",
  "/wiki/Cikatro_Vizago",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Force-sensitive",
  "/wiki/Dave_Filoni",
  "/wiki/Timothy_Zahn",
  "/wiki/1991",
  "/wiki/Star_Wars_Legends",
  "/wiki/Heir_to_the_Empire",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Celebration_Orlando",
  "/wiki/2017",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/Star_Wars",
  "/wiki/Warwick_Davis",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Through_Imperial_Eyes",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Kindred",
  "/wiki/Rebel_Assault",
  "/wiki/Jedi_Night",
  "/wiki/DUME",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/August_12",
  "/wiki/2018",
  "/wiki/May_24",
  "/wiki/2020"
 ]
}