{
 "name": "Rukil%27s_father",
 "display_name": "Rukil's father",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    },
    {
     "name": "Died",
     "values": [
      "pre-3956 BBY",
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Outcasts"
     ]
    }
   ]
  }
 ],
 "content": "This individual was a male Human that was exiled to the Undercity on the ecumenopolis world of Taris for crimes against the government of Taris. He was the father of Rukil.\nHe was a member of the Outcasts, but believed that they could escape the neglect by finding the Promised Land along with his father and son, though most other Outcasts were skeptical of it. Upon hearing that his father had gone searching for evidence and never returned, he set out himself to find the whereabouts of the Promised Lands, retracing where his father had found proof and he himself found more, writing them down in a journal but wouldn't be able to present it to the other Outcasts as he was attacked and killed by rakghouls, and both journals where lost in the Undercity sewers.\nHis son Rukil would continue the quest but never came close nor had recovered his father's or grandfather's journals, he was eventually forced to give up due to old age, and hired Malya to takeover, she found evidence that Rukil's father and grandfather had entered the lower sewers of Taris and entered the information in her journal, but she too wouldn't return with the information as she was also a rakghoul's victim, Rukil wouldn't find this out until 3956 BBY when he enlisted Revan to find her. Along the way Revan would successfully locate and claim all three journals and deliver them to Rukil.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Rukil%27s_father",
  "/wiki/Taris/Legends",
  "/wiki/3956_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Outcasts_(Taris)",
  "/wiki/Undercity_(Taris)",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Rukil",
  "/wiki/Promised_Land",
  "/wiki/Rukil%27s_grandfather",
  "/wiki/Rakghoul",
  "/wiki/Undercity_sewers",
  "/wiki/Malya",
  "/wiki/Revan/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Rukil%27s_father",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}