{
 "name": "Rukil%27s_grandfather",
 "display_name": "Rukil's grandfather",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    },
    {
     "name": "Died",
     "values": [
      "pre-3956 BBY",
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Outcasts"
     ]
    }
   ]
  }
 ],
 "content": "This individual was a male Human that was exiled to the Undercity on the ecumenopolis world of Taris for crimes against the government of Taris. He was the grandfather of Rukil.\nHe was a member of the Outcasts. Unlike the rest of the Outcasts who felt they were doomed to live in Taris's Undercity forever, he had believed that the Outcasts could escape by searching for the Promised Land, though most other outcasts treated the Promised Lands as mythical. Refusing to accept this he goes looking for any hints of the Promised Land, he succeeded which led him into the Undercity sewers, he also recorded his discoveries in a journal but failed to inform the Outcast village of such as he was attacked and killed by rakghouls, with his journal and its evidence being lost with him.\nHis son, Rukil's father also went on the hunt and was more successful in tracking the Promised Land and recorded them in his own journal but became a casualty of the sewer-dwelling rakghouls too, with his own news also failing to emerge.\nRukil himself would continue the quest but never came close nor had recovered his father's or grandfather's journals, he was eventually forced to give up due to old age, and hired Malya to takeover. She found evidence that Rukil's father and grandfather had entered the lower sewers of Taris and entered the information in her journal, but she too wouldn't return with the information as she was also a rakghoul's victim, Rukil wouldn't find this out until 3956 BBY when he enlisted Revan to find her. Along the way Revan would successfully locate and claim all three journals and deliver them to Rukil.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/3956_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Outcasts_(Taris)",
  "/wiki/Undercity_(Taris)",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Rukil",
  "/wiki/Promised_Land",
  "/wiki/Undercity_sewers",
  "/wiki/Outcast_village",
  "/wiki/Rakghoul",
  "/wiki/Rukil%27s_father",
  "/wiki/Malya",
  "/wiki/Revan/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Rukil%27s_grandfather",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}