{
 "name": "Ruku_Kooff",
 "display_name": "Ruku Kooff",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Ruku Kooff was a female Rodian sales executive.\nRuku Kooff was a member of a sales team that included Teeko Soonca and Mannee Swaano. While she was particularly friendly to humans, Ruku could barely tolerate her coworker, Mannee. Unbeknownst to her companions, \"Ruku\" was not her real name, but rather a false identity she had lived under for years. She belonged to a clan that was sentenced for extermination by Navik the Red. During a hunting outing with her coworkers and business associates, they were ambushed in a cavern and Ruku was killed by a group of Rodian bounty hunters. The rest of the hunting party were forced to leave her body behind in order to beat a hasty retreat. It was later revealed to her companions by Navik's Protectors that Ruku was \"a criminal\" and thereby sentenced to death.\nRuku, however, had faked her death, later stowing away in a weapons crate for a safe passage off Rodia. She planned to begin a new life somewhere in the galaxy.\nRuku Kooff was a friendly Rodian female, hiding in plain sight with her false identity. Her given name had not yet been revealed. Ruku was fond of a chak-root snuff that had a scent similar to rotting refuse. She had a peculiar—yet not uncommon among Rodians—speech impediment in which she had difficulty with pronouncing the \"hyu-\" syllable, instead vocalizing it as \"hoo-\", for example saying \"hoo-mans\" rather than \"humans.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ruku",
  "/wiki/Rodia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Teeko_Soonca",
  "/wiki/Mannee_Swaano",
  "/wiki/Human/Legends",
  "/wiki/Navik",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Chak-root/Legends",
  "/wiki/Shadows_of_the_Empire_Planets_Guide"
 ]
}