{
 "name": "Rune_Haako",
 "display_name": "Rune Haako",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Neimoidia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.96 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation",
      "Confederacy of Independent Systems",
      "Executive Separatist Council",
      "Executive Separatist Council"
     ]
    }
   ]
  }
 ],
 "content": "Rune Haako was a male Neimoidian official of the Trade Federation and a high ranking member of the Separatist Council.\nRune Haako was Viceroy Nute Gunray's right hand man, Settlement Officer and lieutenant during the Invasion of Naboo. He, Gunray and Dofine schemed with the Sith Lord Darth Sidious in order to achieve greater profits. On Sidious's orders, they made a blockade on Naboo, because of the new taxation of the formerly Free Trade Zones, and later invaded the planet. The Neimoidians attempted to make Queen Padmé Amidala sign a treaty to make the invasion legal by threatening to starve the people of the planet, but she successfully escaped the planet. To ensure all went according to his plan, Sidious sent his apprentice Darth Maul to oversee the occupation and to keep an eye on the Trade Federation leadership, which greatly unnerved the naturally cowardly Neimoidians. Gunray held Governor Sio Bibble prisoner and OOM-9 informed Gunray that they would soon draw out the Gungans and kill them. Gunray, Haako and Maul assured Sidious that the Federation will win and that Amidala would soon be forced to return in order to save her people. As they predicted, Amidala returned. Dofine perished and Gunray and Haako were sent to Coruscant, but ultimately they remained free.\nDuring the Separatist Crisis, Gunray, Haako and their partners from planets and corporations were invited to Geonosis by Count Dooku, Sidious's new apprentice. Gunray and Haako pledged the Trade Federation's support to the Confederacy of Independent Systems and asked that in return Dooku kill Amidala, the Federation's most hated enemy. Gunray, Haako, Dooku and Archduke Poggle the Lesser oversaw the failed execution of Jedi Knight Obi-Wan Kenobi, his Padawan Anakin Skywalker and Amidala in the Petranaki Arena, who were saved by the Jedi and the new Grand Army of the Republic. Traveling to the Geonosian Command Center, the two Neimoidians joined the other Separatist Council members and saw with their own eyes the First Battle of Geonosis via hologram. Haako declared it vital that the Federation starships be launched before retreating in a Sheathipede-class shuttle.\nAt the end of the war, the Separatist Council was called by General Grievous to Utapau, following the death of Dooku, and were sent to Mustafar where they resided up until the end of the war. Promised a great reward by Lord Sidious, Haako and the others waited for it to arrive, unaware that they were in fact to be killed by Darth Vader, on Sidious's orders. When Vader arrived, he proceeded to do just that, cutting down all in his path. At one point, Haako pleaded with the Sith Lord to cease the massacre, to no avail, and retreated into the conference room with Wat Tambor as Vader cut down Rute Gunnay before his eyes. This, however, did little more than delay their deaths by a few seconds and Vader killed both Haako and Tambor in quick succession, leaving only Gunray to fall moments after.\nA mean and greedy individual, Rune Haako served as Viceroy Gunray's legal counsel when the two led the invasion of Naboo.\nA male Neimoidian, Haako stood at 1.96 meters tall and had red eyes and green skin.\nRune Haako wore a Neimoidian clothing, and a crested fabric tiara. Rune Haako always travelled in Sheatipede-Class Transport Shuttles.\nRune Haako was played by Jerome Blake and voiced by James Taylor in The Phantom Menace. In Attack of the Clones, he was played by Alan Ruscoe and voiced by Chris Truswell , and played by Sandy Thompson in Revenge of the Sith.\nAfter filming for The Phantom Menace wrapped, Haako's mask was lost, resulting in the production crew giving Daultay Dofine's mask to Ruscoe instead, and for a time it was thought that this \"new\" Neimoidian would become a separate character named Gilramos Libkath. Within the new Star Wars canon, Haako was confirmed to be the Neimoidian present in Attack of the Clones through Star Wars: Geektionary: The Galaxy from A - Z.\nStar Wars: The Prequel Trilogy – A Graphic Novel, a graphic novel adaptation of the prequel trilogy, incorrectly depicts Haako as two separate characters, using Haako's appearance from The Phantom Menace to represent him and his later appearance from Attack of the Clones as another character. In this adaptation, the character who wears his Attack of the Clones robes walks behind Haako and Gunray in the hallway scene before the Geonosis summit. During the summit and arena battle, Haako stands with Gunray, while this other Neimoidian is present in the war room with Gunray. Additionally, this Neimoidian is given Gunray's line about the Separatist Army's failing status in the battle, while Dooku is given Haako's line about needing to send their starships into space.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rune_Haako",
  "/wiki/Rune_Haako/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Rune_Haako",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Neimoidia",
  "/wiki/19_BBY",
  "/wiki/Mustafar",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Trade_Federation",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Settlement_Officer",
  "/wiki/Lieutenant",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Daultay_Dofine",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Blockade",
  "/wiki/Naboo",
  "/wiki/Free_Trade_Zone",
  "/wiki/Planet",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo_(people)",
  "/wiki/Sith_apprentice",
  "/wiki/Eye",
  "/wiki/Governor",
  "/wiki/Sio_Bibble",
  "/wiki/Prisoner",
  "/wiki/OOM-9",
  "/wiki/Gungan",
  "/wiki/Death",
  "/wiki/Battle_of_Naboo",
  "/wiki/Coruscant",
  "/wiki/Separatist_Crisis",
  "/wiki/Geonosis",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Geonosian_accord",
  "/wiki/Archduke",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Petranaki_Arena",
  "/wiki/Jedi",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Geonosian_Command_Center",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Hologram",
  "/wiki/Starship",
  "/wiki/Sheathipede-class_transport_shuttle",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Utapau",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Darth",
  "/wiki/Wat_Tambor",
  "/wiki/Rute_Gunnay",
  "/wiki/Jerome_Blake",
  "/wiki/James_Taylor",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Alan_Ruscoe",
  "/wiki/Lott_Dod",
  "/wiki/Sandy_Thompson",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Gilramos_Libkath",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Prequel_trilogy",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/So_Much_More",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/Star_Wars_(2020)_28",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Luke_vs._Emperor_Palpatine_-_Rise_to_Evil",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Exit_from_Endor",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/StarWarsKids.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Separatists",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com"
 ]
}