{
 "name": "Rupo_Ud",
 "display_name": "Rupo Ud",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Ash Moon 1"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Rupo Ud was a human male professor and archaeologist. He served the Galactic Empire as an archaeological consultant for its Project Swarm, an operation to track down the base of the Rebel Alliance. When Central Isopter pilgrims shot down one of the project's probe droids over Ash Moon 1, Ud claimed it was the work of rebels, though in reality he only wished to investigate the ancient archaeological site on the moon. After arriving on Ash Moon 1, the team learned it was not home to a rebel base, while Ud was fascinated by the discoveries he found. The rogue archaeologist Chelli Aphra, placed on the team by Darth Vader, got Ud killed by an ancient trap so that she could be in charge of the team.\nDuring the time of the Galactic Empire, Rupo Ud worked as a professor and archaeologist. At some point, Ud met the scholar Korin Aphra, who referred to him as \"Milky Udders,\" regarding him on friendly terms. By 3 ABY, Ud worked on a team of archaeological consultants to the Empire's Project Swarm, a project to find the newest base of the Rebel Alliance. Stationed aboard the Executor, the flagship of the Sith Lord Darth Vader, Ud and the team were supervised by Major Yaltza.\nYaltza was eventually killed by Vader for a lack of results, and General Maximilian Veers took over the project. Ud, hoping to use Project Swarm to conduct archaeological research, claimed that the rebels would occupy ancient sites, as they had done so before. While working for Project Swarm, Ud came into conflict with colleague Doctor Chelli Aphra, rogue archaeologist and daughter of Korin, who had been given a position on the team after exposing a plot to assassinate Emperor Palpatine.\nDespite Aphra's doubts regarding Ud's suggestion, preliminary searches of the Empire's probe droid database provided him with a result—one such droid had been shot down over Ash Moon 1 in the Kartovian Formation. Veers commanded Professor Ud to lead a ground team to the moon, and Aphra, while insisting the structure was simply a deathshrine of the Central Isopter cult, eagerly joined the crew in order to avoid Vader.\nSeveral hours after landing on Ash Moon 1, Aphra's suspicions were proven true, with the team learning that the probe droid had been shot down by pilgrims. Ud was unbothered, however, having been successful in studying the structure. Aphra, who wished to take control of the archaeological team, conspired to kill Ud using the traps in the deathshrine. After leading Ud to the mouth of a carving set with one such trap, her ward Vulaada Klam relucantly activated the trap, causing the carving to slam shut on Ud, killing the professor.\nFollowing Ud's death, Aphra was given the role of supervisor as she had hoped, using her authority to pull the Imperial forces out of the moon, leaving Klam behind for her own safety. When later meeting with her father, Aphra compared him to Ud, leading Korin Aphra to ask how the professor was. Aphra callously joked about the circumstances of Ud's death, which concerned her father.\nA human male, Rupo Ud had gray hair, gray eyes, and light skin. Though he served the Empire as part of Project Swarm, Ud was not concerned about the Rebel Alliance or the greater conflict between the two, and instead wished to use the project's data to undertake an immense archaeological survey.\nUd held disdain for Doctor Aphra, criticizing her attitude, qualifications, and work while aboard the Executor. He ordered Aphra to stay in line and follow orders, worried that her insubordination would lead to punishment for the whole Project Swarm team, having seen Vader execute others with even less justification. Ud also scolded Aphra's ward Vulaada Klam, who had been conscripted as a janitor, for being distracted from her job.\nWhile working in the archaeology team aboard the Executor, Ud wore a white shirt with long black sleeves and black pants, over which he wore a white coat. He also wore a large pair of goggles that covered his eyes.\nRupo Ud first appeared in the comic Doctor Aphra  37, written by Simon Spurrier, illustrated by Caspar Wijngaard, and published by Marvel Comics on October 2, 2019. The following issue, also written by Spurrier and published on November 6, 2019, provided Ud's first name of \"Rupo.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/3_ABY",
  "/wiki/Ash_Moon_1",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Professor",
  "/wiki/Archaeologist",
  "/wiki/Project_Swarm",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Central_Isopter",
  "/wiki/Pilgrim",
  "/wiki/Probe_droid",
  "/wiki/Moon",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Anakin_Skywalker",
  "/wiki/Death",
  "/wiki/Imperial_Era",
  "/wiki/Scholar",
  "/wiki/Korin_Aphra",
  "/wiki/Executor",
  "/wiki/Flagship",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Supervisor",
  "/wiki/Major",
  "/wiki/Yaltza",
  "/wiki/General",
  "/wiki/Maximilian_Veers",
  "/wiki/Great_Temple",
  "/wiki/Doctor",
  "/wiki/Plot_to_assassinate_Emperor_Palpatine",
  "/wiki/Assassin",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Droid",
  "/wiki/Kartovian_Formation",
  "/wiki/Deathshrine",
  "/wiki/Standard_hour",
  "/wiki/Vulaada_Klam",
  "/wiki/Parent",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Galactic_Civil_War",
  "/wiki/Goggles",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Doctor_Aphra_(2016)_37",
  "/wiki/Simon_Spurrier",
  "/wiki/Caspar_Wijngaard",
  "/wiki/Marvel_Comics",
  "/wiki/October_2",
  "/wiki/2019",
  "/wiki/Doctor_Aphra_(2016)_38",
  "/wiki/November_6",
  "/wiki/Category:Images_of_Rupo_Ud",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Accresker_Jail",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/Standard_year",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth"
 ]
}