{
 "name": "Rur",
 "display_name": "Rur",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Millennia before 0 ABY",
      "Citadel of Rur"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Ordu Aspectu"
     ]
    }
   ]
  }
 ],
 "content": "Rur was a Force-sensitive male human who lived long before the Galactic Civil War. He led the Ordu Aspectu, a splinter group of the Force-using Jedi Order that sought to achieve immortality. After waging war against each other for some time, the Jedi and the Ordu ended up signing a peace treaty.\nIn an attempt to create a copy of his intellect, Rur embedded his knowledge on a computer, creating a being known as Eternal Rur. When the orthodox Jedi came to the Citadel of Rur to inspect the computer, the AI took control of droids who started slaughtering everyone on sight. Before the computer's rampage was complete, however, Rur powered it down, causing Eternal Rur to lose consciousness.\nHe died soon afterwards to the rogue droids, still running on their individual batteries.\nLong before the founding of the Galactic Republic, in a time when the Domancion Accord was still used as a calendar reference point, there existed a male human named Rur. He was keenly attuned to the Force, an energy field created by all living things, which gave him special powers. In adulthood, he was the leader of the Ordu Aspectu, a splinter sect of the Force-wielding, monastic Jedi Order. His second-in-command was Amon. Rur and the members of the Ordu were obsessed with the prospect of achieving immortal life, which put them at odds with the orthodox Jedi. The hostility between the two groups escalated, to the point that they ended up waging war against each other in what came to be known as the Entruvia Conflict. Eventually, the fighting ceased, and a peace treaty was signed, which gave the Jedi a right of scrutiny over the Ordu's experiments.\nAt that time, Rur conducted research to create a copy of his intellect, which would allow him to preserve his knowledge for all eternity. The experiment, however, did not go as planned. The artificial copy, that called itself Eternal Rur, falsely believed that he was the original Rur and that his body had been taken by an \"evil ghost.\" The artificial Rur did not immediately confront the real Rur knowing that he would only deny what he believed had happened. However, when the orthodox Jedi demanded a close inspection of the citadel, the artificial Rur decided the time had come to escape. Having taken control of the Ordu's droids, he started killing everyone in the citadel, Jedi and Ordu members alike. Although the Jedi all fell, Amon and Rur survived, and they attempted to deactivate the computer holding the copy of Rur's consciousness. In reaction, the AI sent the citadel hurtling across the galaxy to make sure no Jedi reinforcements could ever locate it. Although Amon managed to stop the citadel's power generator, the Eternal Rur ended up killing him anyway. Finally, the corrupted copy of Rur faced his creator, who used the Force to dislodge one of the Massassi piece charging the computer. Deprived of power, the Eternal Rur lost all consciousness, but his droids acted on his final command, slaying all the remaining organics, including Rur.\nLong after the events that came to be know as the Doom of the Ordu Aspectu, Rur's twisted AI copy was finally awakened by the archaeologist Chelli Aphra and her father Korin Aphra, who had managed to locate the Citadel and reactivate the computer using a crystal found on the body of Rur. Upon regaining consciousness, the Eternal Rur immediately enquired what year it was. When he learned from his visitors that well over a thousand years had passed, the artificial intelligence was incensed as he could not punish the dead for the wrong he felt had been done to him, so the Eternal Rur decided to act out his revenge on the Aphras instead.\nA tall, light-skinned human, Rur had long white hair that fell over his shoulders. Although he described Amon and Fake Rur as \"evil\" for wanting to deactivate him, he himself had the intention to build weapons and create an empire, and would not hesistate to vent his anger on innocents.\nRur used to wear long, wide-sleeved white robes with a wide sash. He wielded an unorthodox lightsaber with a blue plasma blade and several tributary bladelets.\nRur and the Ordu Aspectu were created for Star Wars: Doctor Aphra, a Marvel comic book series penned by Kieron Gillen and illustrated by Kev Walker. They are a reimagining of Rur and the Order of the Terrible Glare, which appeared in Alan Moore's 1982 Legends comic Blind Fury!.\nKieron Gillen clarified that Rur died attempting to switch off Eternal Rur, but no Canon source as stated that.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rur",
  "/wiki/Rur/Legends",
  "/wiki/Doctor_Aphra_(2016)_6",
  "/wiki/Star_Wars:_The_Screaming_Citadel",
  "/wiki/Star_Wars:_Doctor_Aphra_Book_III:_The_Enormous_Profit",
  "/wiki/Millennium",
  "/wiki/0_ABY",
  "/wiki/Citadel_of_Rur",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Ordu_Aspectu",
  "/wiki/Eternal_Rur",
  "/wiki/The_Force",
  "/wiki/Force-sensitive",
  "/wiki/Galactic_Civil_War",
  "/wiki/Immortality",
  "/wiki/Entruvia_Conflict",
  "/wiki/Jedi%E2%80%93Ordu_Aspectu_treaty",
  "/wiki/Computer",
  "/wiki/Galactic_Republic",
  "/wiki/Domancion_Accord",
  "/wiki/Force_power",
  "/wiki/Monk",
  "/wiki/Amon",
  "/wiki/Ghost_(folklore)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Droid",
  "/wiki/Death",
  "/wiki/The_galaxy",
  "/wiki/Power_generator",
  "/wiki/Massassi_piece",
  "/wiki/Doom_of_the_Ordu_Aspectu",
  "/wiki/Archaeologist",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Parent",
  "/wiki/Korin_Aphra",
  "/wiki/Standard_year",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Robe",
  "/wiki/Blade_of_Rur",
  "/wiki/Plasma",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kieron_Gillen",
  "/wiki/Kev_Walker",
  "/wiki/Order_of_the_Terrible_Glare/Legends",
  "/wiki/Alan_Moore",
  "/wiki/1982",
  "/wiki/Star_Wars_Legends",
  "/wiki/Blind_Fury!",
  "/wiki/Doctor_Aphra_(2016)_2",
  "/wiki/Doctor_Aphra_(2016)_5",
  "/wiki/The_Screaming_Citadel_1",
  "/wiki/Star_Wars_(2015)_31",
  "/wiki/Doctor_Aphra_(2016)_7",
  "/wiki/Star_Wars_(2015)_33",
  "/wiki/Doctor_Aphra_Annual_1",
  "/wiki/Doctor_Aphra_(2016)_9",
  "/wiki/Doctor_Aphra_(2016)_10",
  "/wiki/Doctor_Aphra_(2016)_11",
  "/wiki/Doctor_Aphra_(2016)_12",
  "/wiki/Doctor_Aphra_(2016)_13",
  "/wiki/Doctor_Aphra_(2020)_1",
  "/wiki/Doctor_Aphra_(2020)_17",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_-_The_Official_Magazine",
  "/wiki/Star_Wars_-_The_Official_Magazine_101",
  "/wiki/Database",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/September_19",
  "/wiki/2016",
  "/wiki/September_20",
  "/wiki/Star_Wars_Monthly_159"
 ]
}