{
 "name": "Rush_Clovis",
 "display_name": "Rush Clovis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Scipio"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Scipio"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.92 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "InterGalactic Banking Clan",
      "Banking Delegation",
      "Traxus Division",
      "Banking Delegation",
      "Traxus Division",
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate",
      "Confederacy of Independent Systems",
      "Neimoidian faction",
      "Neimoidian faction"
     ]
    }
   ]
  }
 ],
 "content": "Rush Clovis was a human male politician and baron from Scipio who became the leader of the InterGalactic Banking Clan during the final year of the Clone Wars. Once a member of the Galactic Republic, Clovis had represented his homeworld and the Banking Clan as a senator in the Galactic Senate. Though noble and sincere in his desire to maintain the honesty of the banks, he became intertwined with corporate interests during the Clone Wars and betrayed the Republic to fund weapons development for the Confederacy of Independent Systems. Clovis was disgraced and removed from the Senate for his betrayal but later sought out the Republic to aid his efforts to reform the Banking Clan. Although it seemed like he would free the Banking Clan of corruption, Clovis, unable to escape his past, was made a pawn for other powers.\nRaised in part as the adopted son of an influential Muun family on Scipio, Rush Clovis began his political career by joining the Galactic Senate. Initially dismissed as a corporate senator, Clovis garnered a reputation as a lackluster politician. He became enamored with Senator Padmé Amidala of the Chommell sector, who was in the same group of incoming senators. The two worked together during their early tenures, culminating in their proposal of the Mid Rim Cooperation Motion in response to a crisis on Bromlarch. After the legislation passed, Amidala rejected Clovis's advances and made their relationship strictly professional, but the two fell out soon afterward. Clovis became increasingly involved with business factions of the Senate and, like his peers, faced a conflict of interest when the Republic entered war with the Confederacy of Independent Systems.\nLike other commerce groups in the Senate, the InterGalactic Banking Clan declared itself a neutral entity in the Clone Wars, granting funds to both governments. As the war progressed, Clovis and Trade Federation representative Lott Dod partnered to fund a new Confederate droid foundry on Geonosis. Suspecting Clovis of treason, the Jedi High Council authorized Senator Amidala to spy on him and learn of his dealings. Clovis, believing that she wanted to reignite their former relationship, invited her to join him on Cato Neimoidia, where he was to finalize his deal with Dod in secret. Amidala discovered Clovis's investment in the droid foundry, but Dod poisoned her before she could report her findings, hoping to use her as leverage over Clovis in their financial agreement. Disregarding his deal with Dod, Clovis managed to secure an antidote for Amidala but, in doing so, allowed her to leave with information of his treason.\nRemoved from the Senate and replaced by Nix Card, Clovis became an adjudicator for the Banking Clan, which by the final year of the war faced financial collapse due to its divided funds. Wanting to solve these issues and return the banks to their former state, Clovis worked alongside Amidala to expose the full extent of the Banking Clan's economic troubles and corruption. Despite his change of heart, Clovis struck a deal with Confederate Head of State Dooku in secret to help him replace the leadership of the Banking Clan. Though he attempted to legitimize his office after assuming it, Clovis was made Dooku's pawn and forced to raise interest rates on the Republic. His deal backfired further when the Confederacy invaded Scipio to take control of the banks, leaving Clovis and a hostage Amidala trapped on the planet. The Republic invaded in kind, and in the ensuing battle, a conflicted and remorseful Clovis committed suicide in order to save Padmé.\nRush Clovis was born to human parents on the Outer Rim planet Scipio, the homeworld of the Muun species and an important world for the InterGalactic Banking Clan, an institution crucial to the economic health of the galaxy. Scipio was the location of the Main Vault fortress, one of the Banking Clan's primary vaults. Clovis and his family were servants in the household of one of the head Muun families, with his father being a personal attaché. Despite their lower status, Clovis, who was unaware growing up that he was a servant, caught the attention of the head of the Muun family, a banker who took a personal interest in the education of the young boy. The Muun allowed Clovis to study alongside his children, who were the same age as him. Tragedy struck, however, when Clovis was twelve. A shuttle accident claimed the lives of both Clovis's parents and the wife of the Muun banker, leaving Clovis an orphan and the Muun a widower.\nThe Muun adopted Clovis after the crash, treating him as though he was his own child. Now formally a part of the Muun family, Clovis was accepted as the banker's child everywhere they went. Because of how well integrated he was into Muun society, Clovis was unbothered by the fact he was a human, even though his species raised eyebrows to those who associated Scipio and the Banking Clan with the Muuns. Clovis was not fond of others stereotyping the Muuns as greedy and defended them against such accusations. The tragic shuttle crash was the only time Clovis faced great suffering in his early life, and he was relatively happy with his adoptive family for the remainder of his adolescence. Because he was the adopted son of the influential Muun, Clovis had an easy career path through the Banking Clan and the Muun government ahead of him and, with his powerful family backing him, rose to be a lower ranking member of the banks.\nIn 28 BBY, Clovis pursued a career in public service and was elected to represent Scipio and, by virtue of its connection to the banks, the Banking Clan in the Galactic Senate, the legislative arm of the Galactic Republic, as part of the Banking Delegation. Clovis was one of eight incoming senators at the time, including the former Queen of Naboo, Padmé Amidala, who had chosen to return to public office and take the place of the retired Oshadam as the senator of the Chommell sector. Clovis and the rest in the orientation group arrived on Coruscant, the Republic capital, six weeks before their first session.\nThese first six weeks of the new senator's terms were highly controlled and scheduled, with a great deal of protocol and institution for the representatives to learn. Each new senator was given a NON droid unit, which provided tours of the Senate Rotunda and the surrounding district. Clovis was overwhelmed by Coruscant compared to Scipio, and during the orientation period, he became an acquaintance to Senator Amidala. He learned about some Naboo traditions from her, and he formed a crush on her in the short time they had known each other. Only a few days before their first session, however, Amidala's NON unit malfunctioned and nearly killed her, news which made the holonet quickly.\nAt the end of the six week orientation, Clovis made his first official appearance as a senator at the new session of congress. Clovis was disinterested in the first session, as it consisted of various tabled motions but few debates. When the chime sounded to end the deliberations, Clovis left his senate pod and found Amidala outside the assembly. He made a remark about the the session, to which she agreed, and he brightened when he learned that she remembered his name. Knowing that she didn't receive the notification because her NON unit was decommissioned, he informed her that there was a reception for the new senators and other guests hosted by Supreme Chancellor Palpatine. Amidala thanked him for notifying her and invited him on a walk. As they walked to the reception, Clovis talked to her about Scipio and how overwhelmed he was by Coruscant. When Clovis mentioned how overwhelming she must have also felt, Padmé regarded him steadily, making him uneasy. The floundered Clovis clumsily mentioned the news reports of her recent near-death experience, then tried to save face and told her that she wasn't unqualified to be a senator, just new. He asked if they could learn to fit into their roles together, but Amidala was confused by his intentions and cryptically replied that they would learn \"soon enough,\" which pleased him anyway.\nWhen they reached the door to the reception, Clovis blithely walked past Palpatine's Red Guard without a retinue while Amidala and her people entered behind him. Clovis and Amidala split once inside, and they didn't see each other again until another function the following day for the Alderaanian delegation, though Clovis only saw her across the room and did not interact with her. Unknown to him was that the Padmé he saw was a decoy, her handmaiden Cordé. Clovis found the reception tedious and left early, deciding to explore Coruscant's nightlife instead. He discovered the nightclub Caraveg and had his droid take him there, and to his surprise, he found Senator Amidala there as well, alongside a small party. When they noticed each other, Clovis began to greet her, but she jumped up from her booth and dragged him to the table before he could speak, warning him not to shout her name in a public establishment. He expressed shock that Padmé's driver was able to get her to the club so quickly after the reception, and her driver, Daneska Varbarós, curtly told him that she was much better than his droid.\nAmidala introduced Clovis to Tonra and Sabé, a pair she described as friends from Naboo. She lied and told him that they were part of a cultural exchange on Coruscant when they were really members of her royal security, and they were there for a clandestine meeting with the senator. Fooled by her lie, Clovis told the table that Amidala had told him much about Naboo, then asked whether or not it was true that they were all artists. Tonra and Sabé sarcastically replied that they were an acrobat and a juggler, respectively, but Clovis was unaware of this and was astonished by their professions. He mentioned that he wanted to visit Naboo, but Amidala asked if he could give her a minute to speak to her friends alone. Clovis obliged, and Varbarós walked him over to the bar to allow Padmé privacy. A few moments later, Amidala waved at Varbarós to return, and Clovis began trailing behind her slowly, to Sabé's visible disappointment. As Sabé and Tonra said their goodbyes to Amidala, Clovis returned to the table, only to find them leaving. Disappointed, Clovis tried to convince them to stay and told them that there would be a concert later, but Padmé advised him to leave the club as well. As Sabé and Tonra left, Clovis asked Amidala where she was planning on going, but she instead began explaining more Naboo traditions.\nAfter Padmé had left the Caraveg, Clovis was seen inside by one of the newsnets, who wrote a story on the young senator ducking out on the Alderaanian reception and going to an incredibly dangerous nightclub. The news outlet did not know that Amidala had been there as well, and when interviewed, Clovis covered for her and told the reporters that he was meeting friends from home. In the time after his early days in office, Clovis began exploring the different committees and factions of the Senate, bouncing around financial groups. His reputation among his colleagues and their staff was lackluster. While some appreciated his lack of guile and innocent honesty, others found him a terrible politician and questioned his interests as he floated through money factions. Some were merely irritated by his personality.\nIn an incident at a gala hosted by Senator Mon Mothma of Chandrila in one of Coruscant's public gardens, Clovis spoke with Amidala, who was in reality Sabé dressed as a decoy, and passed what she considered a safe distance. Amidala's handmaiden, Cordé, stepped in to distract Clovis and ease Sabé. Over the next six months, Clovis became a regular visitor to Amidala while they both began settling into their offices. Since Clovis had started aligning himself with the Banking Clan's interests more seriously and Amidala had fallen in with a group of progressively-minded senators, they had no overlap in their schedules, and he began visiting her just to talk. His visits were always unannounced, to the annoyance of her staff. After the end of his first eight months in office, Clovis and the rest of the Senate were given a break period to return to their homeworlds before the start of the next congress.\nWhen Clovis and the rest of the Senate returned to Coruscant, a crisis broke out on the Mid Rim planet Bromlarch. Bromlarch was hit by a massive wave of seismic activity, which destroyed the planetary aqueduct system, threatening to collapse the planet's agriculture and endangering the millions who lived there. Shortly after returning from his break, Clovis was instructed to immediately attend an emergency hearing from Senator Bromlarch Caelor Gaans about the tragedy. After Gaans finished his plea, Clovis decided to make his first solo address before the Senate and requested approval from the Chancellor, and Palpatine allotted him time to speak. Clovis proposed that an auditing team be sent to Bromlarch to assess the damages and provide a cost estimate for repairs.\nHe stated that the Senate was capable of undertaking such a survey in place of the overwhelmed citizens of Bromlarch and that, once the team had a handle on the situation, they could make further decisions from there. Senator Mina Bonteri of Onderon, who had hardly spoken during the last session, seconded Clovis's motion. Chancellor Palpatine conferred with his advisors, including Vice Chair Mas Amedda, then accepted Clovis's proposal. He informed Clovis and Bonteri that he would ask the Jedi Order to provide one of their members to accompany them, as the Jedi would add a humanitarian ambassador rather than a policy-driven presence. He also permitted them to add whoever colleagues they wanted to their survey team.\nOnce the Senate adjourned, Clovis left his senate pod to find Bonteri. He found her and Padmé on a bench tucked in an alcove near the main corridor. He asked Bonteri if Amidala was their first volunteer, and she coolly answered yes. Pleased, Clovis told the two that he was putting forth his ship and its crew for use by the auditing team, and asked if they would be bringing anyone along with them. Amidala told him that she was bringing along a droid, and Bonteri said that she would bring her secretary to help cover the recording. Bonteri reminded Clovis that Senator Gaans would be with them, which she believed would give them a sufficient number for the group. Though Bonteri was making it clear that, even though Clovis had proposed the survey, she was in charge, Clovis was not offended and asked her and Amidala if they would be ready to depart in four hours. Both agreed with the time, and Clovis told them he would send his shuttle to pick them up when they were ready. Hoping to do what he could to help Bromlarch, Clovis purchased a supply of ration bars and medical supplies and crammed them in his ship's hold. Once the time came, Clovis gathered Gaans and the auditing team, which comprised Bonteri, Amidala, Bonteri's secretary, the droid R2-D2, and Jedi Master Depa Billaba, aboard his ship and left Coruscant for Bromlarch.\nWhen Clovis's ship reached Bromlarch, he had his pilot position the ship in orbit of Bromlarch so the survey team could view the planet's surface from above. While Gaans, Amidala, and Billaba were observing the lights of settlements with restored power from the viewport, Clovis entered the room and told them that they would be landing once their clearance came in and advised them to get ready. Padmé left the room to get R2-D2, and everyone else stayed behind to watch the landing procedures. The Bromlarch planetary council was waiting for them when the ship landed. Bonteri and Gaans departed the ship first, followed by Amidala and R2. Clovis attempted to walk beside her, but her droid forced him to walk by himself behind her, with Master Billaba making up the rear.\nGaans and Chief Councilor Eema embraced, and the senator introduced the survey team to the planetary leader. Eema apologized that she could not accommodate the group, but Clovis assured her that it was not a problem because they would stay aboard his ship. He also told Eema about the supplies he had bought, admitting that it wasn't a lot but expressing hope that it would help. Eema thanked him for the supplies and had the crates offloaded and packed into several of the shuttles on the landing pad. The Bromlarch Council could only spare one liaison to the diplomats, Ninui, who stayed behind while the councilors left for the city with Clovis's supplies.\nPadmé comforted Ninui and proposed that they take the ship back into orbit so they could use the landing pad. Clovis noticed that Ninui was stressed and suggested that they all go aboard his ship, so she could get something to eat and have some time to think in quiet. She smiled at Clovis gratefully, and he and Amidala brought her aboard while R2 and Billaba stayed outside on the dock. Clovis prepared her a tray of food and caf, and they were joined in the viewing room by Bonteri and her secretary. Bonteri told Ninui that they should keep the survey simple, which would make their motion easier to introduce in the Senate. Amidala asked her what it was she and her people needed most, and Clovis refilled her caf while she said that they needed water and food most urgently.\nBonteri noted that maintaining a water supply would mean repairing the aqueduct, but Ninui pointed out that the problem was more complicated since there was heavy rainfall in the Dravabi Province. Padmé stated that Bromlarch needed water control, and Clovis pointed out that it still meant they'd need to repair the aqueduct. Bonteri rebuked Clovis and said that Amidala was right to make the distinction, because the issue wasn't a lack of water but where the water was located. Amidala asked Ninui what Bromlarch needed to repair the aqueduct, and when she answered permacrete, Padmé said that she would be able to get those supplies to the planet through one of her committees. Bonteri told Ninui that she didn't have to remember all they were planning and assured her that her secretery would send her notes later.\nNinui was relieved and put her head on the table and told the group that she had never been so tired. Having never witnessed suffering on such a scale, Clovis looked at her with a strange expression on his face. He gently asked her to give their pilot the coordinates of anything else they needed to see on Bromlarch and recommended that she relax in one of the comfortable seats on the bridge. Ninui agreed, and Amidala left to ask if R2-D2 and Master Billaba wanted to join them on the aerial survey. After conducting the survey, the team completed their audit and prepared to return to Coruscant. They determined that Bonteri would make the official Senate report, and they would make their next decision based on the reaction it got in the Senate.\nJust before his ship dropped out of hyperspace above Coruscant, Clovis went to see Amidala to thank her for coming on the trip with him. He told her that he didn't know what to expect on Bromlarch and that he would have been overwhelmed without her help. Padmé complimented how he handled Ninui and how he was able to recognize that she needed support. Clovis said that it was easier when it was just one person and told Amidala that she could look to an entire planet in need of help and not flinch. She reminded him that she had practice at it, and he asked whether or not there was something else besides her time as Queen of Naboo. She took a deep breath and told him the story of her time working with her father on relief missions while she was a child. She told him that, on one mission to relocate the citizens of Shadda-Bi-Boran, the relief team was unable to replicate their environment properly. Clovis asked what happened to them, and she painfully admitted that they had all died.\nClovis searched her face for a moment and stated that she would do it again, which she confirmed, telling him that she would try as many times as possible to help those in need. The ship dropped out of hyperspace, and Clovis's pilot came on the comm to tell them to prepare for landing. Clovis remained silent until the ship was on the ground, when he told Amidala that, although they had come to the Senate for different reasons, they could do alright together if she wanted to. She informed him that she would keep it in mind, and he responded that he looked forward to it, addressing her as Amidala. She interjected and told him that he could call her Padmé, which she wouldn't mind as long as no one was around. Clovis told her that he was partial to his surname, which he shared with his late parents. Amidala mentioned to him that, on Naboo, they called people by whatever name they wished. Clovis asked what they did when someone wanted to change their name, and she simply replied that they would call them by their new name. He walked her to the ship's ramp, where she said goodbye to Master Billaba joined Senator Bonteri to be dropped off at her apartment.\nThe following morning, Bonteri gave her address to the Senate on the crisis and introduced a motion to fund the reconstruction of Bromlarch's infrastructure. After Bonteri finished her address, Senator Lott Dod of the Trade Federation was given the floor, and he immediately attacked Bonteri and Gaans for asking for too much funding from the Republic. Despite Gaans' interjection, Dod proposed that Bromlarch enter a private arrangement with the Trade Federation. He stated that the crisis was an internal problem that didn't warrant galactic intervention, and when Chancellor Palpatine brought the motion to a vote, the bill failed. In the aftermath of their failure, Bonteri abandoned the motion, and Amidala met with Senator Gaans and Senator Bail Organa of Alderaan, one of her allies, to persuade Gaans to dismiss any treaty with the Trade Federation. Clovis rushed to her office and burst into the room but skidded to a halt when he saw that she had guests. He looked to Amidala and told her that, as he had said earlier, they could work together to solve the issue and asked that she allow him to help. She agreed and told him that they had three days until the Trade Federation sent a treaty to Bromlarch, and that they had to workshop their motion instead of just reintroducing it. As he paced along the window, Clovis suggested that they focus on the votes and court key demographics.\nOrgana protested Clovis's idea because it was not how his faction operated, but Clovis pointed out that his idealist way of working would not help them beat Lott Dod's allies. Padmé agreed with Clovis's approach and noted that they had to flip Mid Rim senators, not representatives of the Core Worlds. Clovis told her that they had to target Mid Rim bloc leaders and not individual members, and Amidala mentioned Malastare as one voting bloc that would bring major support to their motion. Senator Gaans dejectedly said that Malastare would not change their minds, but Padmé disagreed and told him and Clovis that if they altered the motion to benefit more systems than just Bromlarch, they could flip various senators and their allies. Gaans asked what Malastare could want from the motion, and Amidala told him that they sought political power, especially in the wake of recent backsliding. Organa pointed out that they couldn't give them power, but Clovis instead suggested that they could give them credits, which he remarked was almost the same thing. Padmé and Clovis walked over to a small sitting area in her office, where he took out a datapad to continue mapping out their plan. Organa couldn't stay to help and Gaans had to speak with the Bromlarch Council, leaving Clovis and Amidala alone to work on the bill.\nOver the next three days, Clovis and Amidala worked nonstop on their motion. For the entire duration of the three days, they remained in her office, missing several Senate hearings and barely sleeping at all. Once it was finished, the Mid Rim Cooperation Motion involved more than a dozen key systems in a variety of resource trade deals that would help fund Bromlarch's infrastructure and solve a recent string of piracy. The motion also targeted the heads of every bloc they needed to lure a sufficient amount of votes away from the Trade Federation. As they made their final preparations, Clovis nervously joked that writing the legislation was the easy part, and the hard part would be selling it to the Senate.\nAmidala decided to pull in a favor from Chancellor Palpatine to get them on the schedule, and Clovis left to go to his office and change. Palpatine placed her first on that day's scheduled speakers, and she introduced the motion to the Senate later, laying out just how different systems would benefit from the bill and how they would work together. Lott Dod attempted to get the floor to recognize him, but Amidala and Clovis's bill grabbed the attention of the influential Senator Aks Moe, who represented the Congress of Malastare. After considering how much his world would benefit, Moe seconded the motion, followed by Senator Yarua of Kashyyyk. When Palpatine put the motion to a vote, it took only a matter of seconds for the results to tally, and the Chancellor announced that it had passed.\nShortly after their victory, Clovis returned to Amidala's office and congratulated her. She told him that they had done it together and thanked him for all he had done. He remarked that he could sleep for a week after all they had been through, and as she explained that they still had finish organizing, he kissed her, not noticing that her handmaiden Versé was present. Padmé immediately pushed him away and told him no, and he expressed confusion at her. She again told him no, and he pulled away from her angrily. In her queen's voice, she informed him that they were only colleagues, and he simply told her that he would take his leave and stalked out of the room. In the aftermath of the incident, Clovis walked out on the Mid Rim Cooperation motion like Bonteri had, leaving Amidala alone with her allies to implement it. Clovis didn't take her rejection of him well, and though he and Amidala retained a strictly professional relationship and served on some of the same committees for a time, they fell out of touch.\nAfter his time as Scipio's senator, Clovic became the senator who directly represented the Banking Clan. After gaining his new role and being recruited by Count Dooku to aid the Confederacy of Independent Systems during the Separatist Crisis, he reached out to Separatist groups and began a working relationship with the CIS, particularly with the Neimoidian faction of the Trade Federation. He kept his ties to the Confederacy a secret to maintain his place in the Republic Senate. Shortly afterward, the Republic and Confederacy began to fight each other in the Clone Wars. During the conflict, Clovis secretly conspired with Federation Senator Lott Dod and Geonosian Archduke Poggle the Lesser to rebuild a droid foundry on Geonosis in exchange for the profits it would yield. However, the Jedi Council suspected that he was dealing with the Separatists and asked Senator Amidala to spy on Clovis and uncover his plans.\nClovis then met Amidala for lunch and asked her to come with him to Cato Neimoidia to speak to her diplomatic contacts among the Neimoidians. They both went to Cato Neimoidia aboard her star skiff accompanied by Captain Gregar Typho, R2-D2, and Anakin Skywalker disguised as her pilot. After they landed, Clovis and Amidala were greeted by Dod. Clovis showed Dod and Poggle a disk that digitally carried the coordinates to the new droid foundry. He told them that it was the largest ever built and that it would bring great profits to them; but Poggle and Dod demanded a greater share of the profits for the risks they took. He refused to comply and went to Senator Amidala. He gave her a relishing tour, sharing with her some of his private investments.\nClovis was then embraced by Amidala who told him that she was glad to be there with him, and fainted. He realized that she had been poisoned and he confronted Dod about this, but Dod assured him that she was a Republic spy. Clovis refused to believe it, until he saw that Amidala had stolen his disk. He later confronted her, but she told him that she did it for the Republic. Skywalker came in to protect her. Clovis told him that Dod poisoned her. At first, Skywalker wanted to start negotiating with Dod, but Clovis said that Dod would kill him if he found out about the disk. Clovis ultimately decided to get Amidala to her ship. However, Dod refused to let them leave. Clovis began threatening and tempting to kill Lott Dod unless the immoral Neimoidian gave him the antidote.\nAfter Dod had given him the antidote, Clovis and Skywalker got Amidala to the ship. Clovis asked for the disk, but Skywalker refused, leaving him behind. Watching Skywalker leave, he was suddenly called over by Dod, who stood with Poggle and a force of B1-series battle droids, who were armed with E-5 blaster rifles. Even though it was assumed he was then killed, Clovis actually survived and managed to extricate himself from the situation thanks to his loyalty to the banks and wealth. Although his reputation in the Senate was ruined, he found great success upon returning to working for the Banking Clan.\nIn the year 19 BBY, Clovis worked with Amidala again when she came to Scipio for a loan from the InterGalactic Banking Clan. However, Amidala refused to work with Clovis and walked off. However, after an assassination attempt by the bounty hunter Embo, he was able to convince Amidala to help him in exposing the Banking Clan's corruption to the Senate.\nThe next day, while under the façade of the transaction, the two infiltrated the building after one of Amidala's handmaidens cut the power. Amidala found the records and downloaded them. They then presented the information to Supreme Chancellor Palpatine, who ordered the two to investigate. Later that night, after Clovis tried to force a kiss on Amidala, Skywalker burst in and the two got into a violent fight, during which Clovis got injured badly. While a medical droid was tending to him, the droid revealed a message from Count Dooku, who stated that if the corruption was exposed, Clovis would be head of the Banking Clan.\nClovis and Nix Card then reported to Palpatine that they had exposed the corruption. The Core Five were removed from power, and Clovis was selected to head the Banking Clan by the Confederacy. The Republic voted for the same effect. In return for his favor, Dooku forced Clovis to raise interest rates on Republic loans, which caused outrage in the Senate.\nAs Clovis assumed power, Dooku arrived and a Separatist invasion of Scipio ensued, which was framed as a Clovis-endorsed takeover. Following this, Anakin Skywalker led an immediate Republic retaliation to retake Scipio. During the battle, a downed vulture droid crashed into Clovis' office containing Skywalker, Amidala, and Clovis. Sliding down the rooftop, Skywalker was able to catch both Clovis and Amidala before falling off the edge. Skywalker was only strong enough to hold one person and, recognizing this, Clovis let go of Skywalker and subsequently fell to his death, sacrificing himself to save Amidala.\nAs a child that was adopted by the InterGalactic Banking Clan, Rush Clovis was mostly raised by the Muuns. However, this did not stop him from becoming a successful politician. Before the Clone Wars, Clovis was a very skilled young politician, entering the Galactic Senate at the same time as the former Queen of Naboo, Padmé Amidala. They became close, with Clovis gaining feelings for her. He kissed her after their Mid Rim Cooperation Movement succeeded, which horrified Amidala. Clovis was saddened that their closeness fell apart after that.\nAfter the onset of the Clone Wars, Clovis continued his work in the Republic senate but also engaged in clandestine activity with the Separatists for profit. He was not above using poison and also at one point threatened to kill his former associate Lott Dod. Later into the war, Clovis tried to win back the trust of the Republic and Amidala, helping them to expose the Banking Clan from hiding their account funds, but later succumbed to pressure from Count Dooku, helping maneuver him into power after convincing the Republic senate to allow him to become the leader of the banks. Clovis unknowingly helped Supreme Chancellor Sheev Palpatine, secretly the Sith Lord Darth Sidious, gain control after the banks after Scipio became a battlefield and the Republic forcefully took control of the banks. He later felt remorse for his actions and during the battle, chose to give up his life to save Amidala's.\nDespite Clovis' various deceptions, he cared deeply for Amidala. He was persistent in his attempts to court her, which greatly angered her secret husband Anakin Skywalker. When the two fought in Amidala's apartment after Skywalker caught Clovis attempting to kiss Amidala, Clovis showed some skill in hand-to-hand combat, although he was no match for a Jedi Knight. Like many politicians, Clovis was a skilled liar.\nRush Clovis made his first appearance in \"Senate Spy,\" the season two episode of the television series Star Wars: The Clone Wars, written by Melinda Hsu, Drew Z. Greenberg, and Brian Larsen and directed by Steward Lee. It released on Cartoon Network on October 16, 2009. He was portrayed by Robin Atkin Downes. The book Skywalker: A Family at War claimed that it was impossible to tell whether Skywalker let Clovis fall to his death or if the Senator let go of the Jedi's grip, with the text claiming that the truth was likely a combination of both possibilities, but Clovis' death in the episode \"Crisis at the Heart\" clearly shows that Skywalker tried to hold onto both him and Amidala, only for Clovis to give his own life by letting go to save her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rush_Clovis",
  "/wiki/Rush_Clovis/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Rush_Clovis",
  "/wiki/Scipio",
  "/wiki/19_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Traxus_Division",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Neimoidian_faction",
  "/wiki/Politics",
  "/wiki/Baron",
  "/wiki/Clone_Wars",
  "/wiki/Senator",
  "/wiki/Muun",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Chommell_sector",
  "/wiki/Mid_Rim_Cooperation_Motion",
  "/wiki/Bromlarch",
  "/wiki/Trade_Federation",
  "/wiki/Lott_Dod",
  "/wiki/Geonosis_primary_droid_foundry",
  "/wiki/Geonosis",
  "/wiki/Jedi_High_Council",
  "/wiki/Mission_to_Cato_Neimoidia",
  "/wiki/Cato_Neimoidia",
  "/wiki/Poison",
  "/wiki/Nix_Card",
  "/wiki/Mission_to_Scipio",
  "/wiki/Head_of_State",
  "/wiki/Dooku",
  "/wiki/Core_Five",
  "/wiki/Invasion_of_Scipio",
  "/wiki/Death",
  "/wiki/Suicide",
  "/wiki/Parent",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Homeworld",
  "/wiki/The_galaxy",
  "/wiki/Main_Vault_fortress",
  "/wiki/Rush_Clovis%27s_father",
  "/wiki/Unidentified_Muun_banker",
  "/wiki/Banker",
  "/wiki/Youngling",
  "/wiki/Shuttle",
  "/wiki/28_BBY",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Naboo",
  "/wiki/Oshadam",
  "/wiki/Coruscant",
  "/wiki/Capital",
  "/wiki/NON_unit",
  "/wiki/Senate_Rotunda",
  "/wiki/Federal_District",
  "/wiki/Supreme_Chancellor",
  "/wiki/Palpatine",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Alderaanian_delegation",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Cord%C3%A9",
  "/wiki/Caraveg",
  "/wiki/Daneska_Varbar%C3%B3s",
  "/wiki/Tonra",
  "/wiki/Sab%C3%A9",
  "/wiki/Acrobat",
  "/wiki/Mon_Mothma",
  "/wiki/Chandrila",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Bromlarch_planetary_aqueduct_system",
  "/wiki/Caelor_Gaans",
  "/wiki/Mina_Bonteri",
  "/wiki/Onderon",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Jedi_Order",
  "/wiki/R2-D2",
  "/wiki/Jedi_Master",
  "/wiki/Depa_Billaba",
  "/wiki/Bromlarch_Council",
  "/wiki/Councillor",
  "/wiki/Eema",
  "/wiki/Ninui",
  "/wiki/Caf",
  "/wiki/Dravabi_Province",
  "/wiki/Permacrete",
  "/wiki/Committee_for_transportation_of_construction_materials",
  "/wiki/Shadda-Bi-Boran",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaan",
  "/wiki/Aks_Moe",
  "/wiki/Congress_of_Malastare",
  "/wiki/Yarua",
  "/wiki/Kashyyyk",
  "/wiki/Vers%C3%A9",
  "/wiki/Count",
  "/wiki/Separatist_Crisis",
  "/wiki/Geonosian",
  "/wiki/Archduke",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Neimoidian",
  "/wiki/J-type_Naboo_star_skiff",
  "/wiki/Gregar_Typho",
  "/wiki/Anakin_Skywalker",
  "/wiki/B1-series_battle_droid",
  "/wiki/E-5_blaster_rifle",
  "/wiki/Bounty_hunter",
  "/wiki/Embo",
  "/wiki/Darth_Sidious",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Sith_Lord",
  "/wiki/Senate_Spy",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Melinda_Hsu",
  "/wiki/Drew_Z._Greenberg",
  "/wiki/Brian_Larsen",
  "/wiki/Steward_Lee",
  "/wiki/Cartoon_Network",
  "/wiki/October_16",
  "/wiki/2009",
  "/wiki/Robin_Atkin_Downes",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/An_Old_Friend",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Category:Audio_files_of_Rush_Clovis",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau",
  "/wiki/Standard_year",
  "/wiki/Endless_Vigil",
  "/wiki/Invasion_of_Naboo",
  "/wiki/32_BBY",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic",
  "/wiki/The_Naboo_Crisis"
 ]
}