{
 "name": "Ruug_Quarnom",
 "display_name": "Ruug Quarnom",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cato Neimoidia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cato Neimoidian government",
      "Neimoidian special forces",
      "Neimoidian Royal Guard",
      "Neimoidian special forces",
      "Neimoidian Royal Guard"
     ]
    }
   ]
  }
 ],
 "content": "Ruug Quarnom was a Neimoidian female soldier who served as a commando in the Neimoidian Defense Legion and later the Neimoidian Royal Guard during the Clone Wars. Working alongside her fellow guardsman Ketar Nor, Quarnom was eventually assigned a role in providing aid to and investigating a bombing of the Cadesura district of Zarra, Cato Neimoidia's capital city. During the mission, she collaborated with Jedi Master Obi-Wan Kenobi, all the while struggling with the frustrations of her partner toward the Galactic Republic, as well as her suspicions against the Separatist emmisary and Sith assassin, Asajj Ventress.\nRuug Quarnom was a Neimoidian female soldier who lived during the Clone Wars. Prior to the outbreak of the conflict between the Galactic Republic and Confederacy of Independent Systems, Quarnom served as an elite commando in the Neimoidian special forces of the Neimoidian Defense Legion, carrying out missions on dozens of worlds. In her various missions Quarnom experienced many facets of wartime, including the deaths of others. She had also been involved in black ops missions in the Outer Rim Territories, during which she would protect or sabotage supply lanes, blockades, or other missions in which the interests of the Neimoidians and Trade Federation would overlap. During her time as an operative, she had heard many things about the Jedi Knights, though had no firsthand experience with them. After questioning the judgement of the Trade Federation, Quarnom was demoted to serving as a royal guard, posted in Cato Neimoidia's capital city of Zarra. Nonetheless, she took the assignment in good faith.\nFollowing the Cadesura disaster, a bombing which destroyed the entire Cadesura district of Zarra in 22 BBY, Quarnom and her partner, Ketar Nor, were among the first to respond, approaching the site of the disaster in their patrol ship. Quarnom speculated as to why such violence had occurred, believing Cato Neimoidia to be neutral despite the actions of Nute Gunray and his alleged splinter faction of the Trade Federation. After Nor blamed the Republic for the attack, Quarnom quelled him, reminding them of their mandate to help people. She then took out a holographic map of the area as several other ships landed for support, teams of Neimoidians and rescue droids around her clearing through rubble and searching for survivors. As she surveyed the destruction, she mentally echoed Nor's belief that someone would have to pay, but was unsure who deserved it.\nAfter beginning to provide aid to the scene of the disaster, Quarnom could feel accumulated grime and the stench of decay cling to her body, regardless of how much she showered. The hours of toiling to save lives or locate bodies—all the while being covered in soot and inhaling fumes—not only took its toll on her body, but on her mind as well. After washing up in the guard station of Zarra's capital complex, her body still felt raw, and as if her nerves were exposed. She walked along the top-floor hallway carrying the pieces and modules of her rifle in one case and the segments of her custom armor in another. Upon arriving outside, she was able to observe the plumes of smoke in Cadesura.\nWhile on the top floor, Quarnom observed her partner, Nor, in a courtyard one story down, as he fired upon a training battle droid to vent his frustrations. She understood his frustration due to the sheer scale of the destruction in Cadesura, especially in comparison to the death and destruction she had seen in the past. Dropping both cases of equipment down and vaulting over the ledge—rolling to carry her momentum forward safely—Quarnom landed in the courtyard to speak with Nor. First joking that she could teach Nor how to vault as she did, she then stacked her cases of equipment on top of one another, then approached her partner, stating that her offer would better serve his time than target practice.\nNor clarified to Quarnom that his assault on the droid was not target practice, and she verbally empathized with his need to vent his frustrations with violence against the droid. She then assured him that it wasn't his job to understand the disaster that had occurred. While Quarnom's own faith had been shaken by the events in Cadesura, she decided to keep her fragility hidden from Nor, reminding him that he had helped people while silently considering to motivate him like a soldier. Deciding to take a more empathetic approach, she instead decided to point out that Cato Neimoidia was relying on them, which helped to somewhat boost his morale. Standing up, Quarnom then offered her hand to Nor, who took it, allowing her to boost him up. She ordered him to get some rest, sternly repeating the order a second time before grabbing her equipment and leaving. Just as she exited, she saw Nor once again preparing to open fire on the training droids, and briefly considered giving him a tip to improve his aim stability before deciding to leave him to burn off his frustrations.\nEventually, Quarnom and Nor had spent the span of a few days performing a variety of tasks, including clearing rubble and stopping fires from reaching explosive gas lines, as well as providing medical services. While on duty in Cadesura, Quarnom's experiences were far more intense compared to past murders or incidents she had bore witness to. Throughout the course of their duties providing aid, they would routinely swap out to perform shifts in the halls of Cato Neimoidian government buildings. Quarnom's continued advice for Nor to keep his emotions checked continuously went unheeded, though she typically let him vent his frustrations away anyway. As Nor rambled about his misgivings toward the Republic while he and Quarnom were on guard duty, Quarnom eventually interrupted, asking him if he had gotten any sleep following a long night of fighting battle droids. Quarnom lightly commented that she hoped he had at least cleaned up, and took his laughter as an apology, laughing alongside him.\nAs their shift came closer to ending, Quarnom told Nor that he should take a break from fighting droids for the night. When he protested that he wanted to make a difference, she responded that she would take him to the surface to investigate up close, but only if he rested in return—providing watching a holo or drinking an agaric ale as examples. Nor replied that she could not give him orders due to being equal rank, she insisted that it was an order from the rank of experience and age. As she appeared to have gotten through to him, they soon came to notice a new voice—that of Sith assassin Asajj Ventress—becoming audible from within the room they were guarding.\nQuarnom's training and memory of other Neimoidian officials helped her realize that Ventress' voice was an unfamiliar one, and she recognized it as a female voice, hardened and spiteful with a gravel to it, yet also dignity. The changes in inflection in her voice raised Quarnom's suspicions, and she observed Nor tense up as he became distracted from his duties by the ongoing conversation. Ruug continued to watch Nor as the conversation continued, observing him tightening his fists, shifting his boots, and exhaling in grief. At some point in the conversation, Ruug noted a playful lift in the conversation, and she surmised that the woman speaking would be grinning. Shifting her rifle to reflect the inside of the room, she could see Cato Nemoidian minister of defense Alluv Eyam, a local official by the name of Feldus Spar, and Ventress, whom she did not recognize.\nThe last of the three caught Ruug's gaze in the reflection for a moment, before cutting her conversation short, walking towards their post, having overheard Nor's frustrations with the Republic. Eyam and Spar followed Ventress, who brought pressure to Quarnom's senses, making her feel as though something was off. Believing that the woman was suspicious and attemping to intimidate with presence alone, Quarnom interjected, stating that guards were not permitted to engage with passersby. Ventress apologized, stating she appreciated the hard word the guards did. However, she stated that she would offer a sympathetic ear to any misgivings against the Republic, all while Quarnom watched Nor, whose expression had changed during this interaction. As Ventress and the other officials then left, Quarnom silently cursed toward them.\nWhile on duty at the site of the Cadesura disaster, Quarnom was spotted by Jedi Master Obi-Wan Kenobi as she scanned the area, climbing over ledges and rubble before sending a transmission over her comlink. As Kenobi was distracted by the snap of a twig, Quarnom spotted him, training her rifle on the Jedi—who had ignited his lightsaber—while Nor ordered him to freeze. While the two Neimoidian guards had their sights trained on Kenobi, Quarnom hoped that Ketar would not act brashly in the moment, especially as the Jedi now held his ignited lightsaber in front of them. She then presumed his identity as Kenobi based on the conversation she had overheard prior.\nWhile she kept her rifle's scope trained on Kenobi, she picked up her spectrometer, which had completed its chemical residue scan. As Quarnom attached it to her belt, he spoke to her directly, informing her that he meant her no harm. He then stepped back while raising his hands, ensuring he could see both Quarnom and Nor. She felt as though the Jedi was being sincere, but remained wary given the state of galactic affairs. Speaking to him, she informed him that it was illegal to be present beneath the fog without a permit, especially at the site of an investigation. The Jedi responded that, while he lacked a permit, he was conducting an investigation. Nor responded harshly, accusing him of attempting to cover up possible involvement from the Galactic Republic. As a result, Quarnom surmised that Nor had consulted Ventress rather than getting rest as she had suggested.\nQuarnom interrupted Nor's ranting, attempting to calm the situation in full awareness of what Kenobi could do with his lightsaber. Now directing herself to the Jedi, she prompted him to explain why he was in the investigation site. He responded once again that he was present as an emmisary for the investigation on behalf of the Republic, which prompted Nor to prod as to why the Jedi would sneak there at night if he had seen the site during the day. Quarnom took note of this, pondering if he had learned that from Ventress, due to her herself being unaware of this information. As Kenobi searched for a considerate manner of responding, she silently appreciated the care he took to do so, also pondering if the \"bureacracy\" that he mentioned to be monitoring him referred to Ventress.\nNor then asked Quarnom if she believed Kenobi. Kenobi responded instead, stating that the guilty party did not matter to him despite his beliefs, only the truth. Prompting Quarnom, he noted to her that he could see she was investigating as well. As the Jedi turned off his lightsaber, Nor activated his own lamp in order to provide a source of light. The change in light prompted Quarnom to spot something in the shadows. She activated night vision on her scope, and spotted a korgee beast, which was preparing to attack Kenobi. Firing, she downed the creature, preventing it from attacking its Jedi prey.\nQuarnom then holstered her sniper rifle, and climbed over debris to get to the korgee beast, intending to mend its wound. She ordered Nor to bring her a medpac and rations, and began to patch its wound with bacta and laser sutures while Nor began to feed it. Kenobi aided them, calming its mind with the Force. Quarnom explained to the Jedi that korgee beasts could become aggressive when hungry, and that they were typically docile creatures. As she tended to the korgee beast, it nudged her with its nose before limping toward a ration Nor had tossed in another direction. Kenobi then properly introduced himself to Quarnom, who, in turn, introduced herself and Nor to him. When Nor made a sour expression in response to his introduction, Quarnom felt some empathy from Kenobi in regards to their relationship.\nKenobi inquired about Quarnom's equipment, and she responded that only those who were good enough possessed such equipment. She then reminded him that he had dropped his lightsaber, while affirming her own desire to learn the truth behind the disaster. Picking Kenobi's lightsaber up, she observed it—surprised at the craftmanship and its weight—before handing it back to him in a show of good faith. Kenobi locked his eyes with Quarnom and nodded in approval; all the while, she ignored a glare from Nor.\nAfter meeting Kenobi, Quarnom and Nor began to collaborate with him, leading him to other areas of the investigation, including those that more clearly displayed the collateral damage of the disaster. Quarnom showed Kenobi irregularities in the blast radius, as well as information on her datapad regarding compiled evidence and traces of evaporated materials. After investigating for four hours, Kenobi stated that, while he was unaware of Neimoidian sleep cycles, he himself was going to get some rest. Quarnom concurred as she poured the contents of a small vial onto some of the rubble. As the contents of the vial bubbled up in a chemical reaction, she informed the Jedi that she would send him the results once they were finished.\nKenobi complimented Quarnom's work despite her lack of a proper lab, and she responded that experience was of help to her despite her lack of \"Jedi powers.\" She then handed Nor a device, ordering him to run process four-C with an exposure time of six seconds. Kenobi was curious about how the guards had learned about chemistry and explosives, assuming they had not done so in basic training. Quarnom responded that she was simply a guard trying to teach people like Ketar why their work mattered, prompting Kenobi to ask if she was wearing a guard uniform. She considered his question for a moment, before stating that he was inquisitive. She then explained that her uniform was from her former assignment in the Neimoidian Defense Legion, before storing away her devices and beginning to walk toward their shuttle.\nKenobi asked Quarnom if she was looking for a quieter life. She responded that she wasn't necessarily, but that other \"important\" people had decided she needed to be quieter. The Jedi then commented that she sounded as if she was dissatisfied with the Trade Federation, a comment she regarded as \"binary.\" Quarnom clarified that she believed in the concept of the Trade Federation, as it gave the Neimoidians a voice. When Nor piped up, stating that the Separatist cause allowed the Neimoidians to prove their worth, Quarnom gave a light smile in response, replying that Cato Neimoidia and the Trade Federation were neutral. Nor further pressed that neutrality in the face of oppression was, in fact, further oppression, to which she replied that perhaps—in their case—it was independence, and a freedom to choose.\nKenobi then expressed that the viewpoint regarding oppression and neutrality depended on context, and Quarnom agreed. The Jedi responded that Quarnom reminded him of a like-minded friend of his. Afterward, Quarnom stated that she could believe in the Trade Federation while disliking its leadership over the course of the prior decade, as well as recognize the flaws of the Republic while believing some of its people to be reasonable. As Nor continued to interject with misgivings of Republic culture and law, Quarnom continually acknowledged his comments, while simultaneously attempting to quell his distaste. After walking for some time, Kenobi spotted a secluded bunker, and briefly considered asking the two guards to accompany him given their equipment. Instead, he informed them that he would return to his ship, and Quarnom nodded as she and Nor boarded their own shuttle. After they lifted off and flew out of view, however, Kenobi proceeded toward the bunker.\nAfter investigating the bunker, Kenobi went to a pub that Quarnom had suggested, and was almost surprised by the fact that she was sitting in the pub next to him. Kenobi pointed out that he had saved a seat for both her and Nor, but she laughed, stating that she needed a break due to Nor's moodiness. She then flipped a coin to the bartender, asking what Kenobi's word for an apprentice was. He responded that the term was \"Padawan\", while wondering if her resolve and morality would help keep her from overreacting to data indicating possible involvement from the Republic. He then told her that his own apprentice, Anakin Skywalker, had just recently been promoted, operating independently from Kenobi. When Quarnom laughed, asking how long it would be before reality hit Skywalker, Kenobi responded that he was more stubborn than Nor was.\nQuarnom, disgruntled, stated that Nor was a good kid, just negatively affected by ongoing events. She then stated that she was trying to keep him away from Ventress, finding her too eager to lend an ear. When Kenobi replied that he was not fond of any agent of Count Dooku's, Quarnom expressed gratitude for Kenobi's honesty. She then took a sip of her drink, before revealing that she had data for Kenobi. Kenobi revealed the same to her, and they toasted their drinks before starting to go over their collected information. Quarnom revealed that she had taken further scans, as well as accessed security recordings in order to identify the exact chemical mixture for the blast radius, as well as explosion heat, among other aspects. Sliding her datapad to Kenobi, she then stated that she had a lead.\nKenobi pondered Ruug's information, wondering if he truly wanted to know the truth, as well as if Ruug's lead was the same as his own—or if the bunker was, in fact, hers. Quarnom clarified that her lead was just that, and that further analysis would need to be run. She continued by stating that it was difficult to gain access to a lab discreetly at the moment, and that they would find out if her information was definitive. Quarnom then told Kenobi to forget she said anything, not wanting to introduce bias to his investigation. Asking what his data was, she was disappointed to be presented with only forensic evidence, rather than any leads. Meanwhile, Kenobi refrained from telling her about the datapad that could incriminate the Republic.\nQuarnom let out a sigh, defeated, only for Kenobi to assure her that he had faith in the truth, and that they needed to trust. She chuckled in response, remembering the Jedi's status as peacekeepers and expressing admiration of his optimism. Giving a toast to a trust for one another, she then stated that she had a bad feeling about the state of things. Kenobi emphasized to her that she needed to have faith in both trust and the truth. Quarnom admitted that the truth was bent by people like her, who killed both those deserving and undeserving due to only orders. She then revealed that she realized all of her targets deserved their fates, from certain perspectives. Continuing, she expressed that everyone in the galaxy was connected, and for every gain there was a loss for someone else, devoid of true justice.\nKenobi told Quarnom that he was sorry she felt that way. Regardless, she continued, stating that though she could rationalize the fates of her targets, she couldn't help but see those who died in Cadesura as innocent. Repeating twice that Cato Neimoidia was a neutral planet, she slumped over the bar. The Jedi reassured her that they would uncover the truth, only for her to question if that would honor or do right by the people who were lost. When Kenobi told her that it would not, but that it was what they should do because it was just, Quarnom responded that he was correct in theory. However, she believed that the galaxy could break people. He then expressed that they must have hope, she only responded that she had become numb to hope long ago, all the while waving down the bartender once again.\nMeanwhile, Ventress was attempting to convince Nor to bomb the office of Republic diplomat Rosbuen Frisk. When Nor expressed hesitance to do so, Ventress questioned his trust in Kenobi. Nor responded that his trust in Kenobi was an extension of his trust in Quarnom. When Kenobi had been called to a meeting to discuss his findings, as well as evidence that he had been communicating with the Republic, he took note of Quarnom's absence. When it was declared that Kenobi would be charged with hiding evidence and violating the terms of his stay, Quarnom was among the guards ordered to apprehend him, though she had a look of concern on her face, which grew with every passing second. Kenobi speculated if her worry was for him, her people, or the galaxy.\nKenobi considered his options as the guards surrounded him, taking note of Quarnom's specialized equipment and training, in contrast to the standard equipment and training of the other guards. When he ignited his lightsaber, improvising his escape, Quarnom refrained from firing upon him, the first shot instead coming from Nor. As the Jedi continued to deflect the incoming fire from Nor, Quarnom kept her rifle trained on him, though still did not fire. He then escaped using Force speed, but was caught in a nearby hall by Quarnom, who ordered the other guards to give her a clear shot while she trained her sniper rifle on Kenobi.\nThe Jedi balanced his options, debating whether or not he should trust Quarnom. Reaching out with the Force, he found that she was fully focused, and without conflict. Nor screamed at his partner to open fire, but she snapped back, exclaiming that there were civilians in the line of fire. As her diversion lent Kenobi time to escape, he began to back toward a nearby window. Just as Quarnom intentionally fired her rifle late, the Jedi dove out of the window, escaping.\nQuarnom had been fully aware of how Nor would likely react before she pulled the trigger, but was satisfied that the civilians present would be a sufficient cover story. At the same time, she was furious with Nor for brandishing his pistol so brazenly around innocent people or uninvolved government officials. Quarnom then turned her attention back to Kenobi, predicting where he could have escaped using the information she had. She had assisted Kenobi in making his escape look good, calculating her risk of accidentally harming him, as well as the circumstances that created a reasonable assumption for how she acted.\nFurious, Nor approached Quarnom, exclaiming that she had a clear shot on Kenobi. Despite expecting her partner's outburst, she chastized him for losing his composure, reminding him of their relative experience in the field. Quarnom pondered Nor's interactions with Ventress, concluding that it had led to the new evidence he never even confronted his partner about, as well as his strong desire to outright kill Kenobi despite the danger it brought civilians. Taking a note of the Jedi's own care to avoid civilian harm, she reprimanded Nor for his haste, reminding him that it could have brought harm to others. Internally, she cursed herself for not taking Ventress seriously before.\nQuarnom was unsurprised that Kenobi had contacted another Jedi, concluding that his data analysis had to have come from somewhere. However, she was still concerned over the previously unknown datapad. Despite acknowledging that Kenobi never denied the datapad's legitimacy, as well as his own likely risk assessment, Quarnom was equally as angry with the Jedi as she was with her partner. She stated that he was onto something, and that Ventress and Nor's intervention had impeded the investigation. Ventress implied that Quarnom was perhaps biased in favor of Kenobi, and the Guardswoman responded that her trust came from experience. The Sith assassin simply replied that guard duty had softened Quarnom's skills at risk assessment.\nDefiant to Ventress' claim, Quarnom turned back to the ledge Kenobi had escaped over. She overheard Nor and other guards chattering about seekers that had been deployed to search for Kenobi, but internally took note that aerial remotes would be incapable of stopping him. Concluding that the Jedi must have had a plan to resolve things peacefully, she became determined to locate him first. She retracted the barrel of her rifle and holstered it, ignoring Ventress, who informed them she would board the next transport in search of Kenobi. Quarnom and Nor then boarded a transport, the former grabbing onto a handrail to balance herself.\nAs Kenobi continued to make his escape, Quarnom eventually began pursuing him, brandishing a pistol rather than her typical sniper rifle while ordering her allies to cover her. As guards organized behind her, Kenobi surrendered, Quarnom loudly but calmly instructing him not to move. Quarnom then ordered Kenobi to place his hands behind his back, and began to apprehend him using binders. The Jedi thanked her for her diversion in the hallway, only for her to respond by questioning why he hadn't informed her of the datapad. When Kenobi replied that he wanted to be certain it was authentic, Quarnom commented that honesty would have earned her trust. He then apologized to her in agreeance.\nAs Quarnom continued to apprehend Kenobi, she noted his lack of lightsaber, which he had hid earlier. He reassured her that he was improvising, stating that the datapad incriminated the Republic without context and that it required further investigation. Though Quarnom stated that her comrades had already made up their minds, she also told the Jedi that she would do what she could to help. Nor then approached, yelling at Kenobi before Quarnom ordered Nor to stand down, as their target had already been apprehended. When Nor refused, Quarnom stepped in-between her partner and Kenobi, repeating that their job was now done, and that Kenobi would stand trial.\nVentress arrived as well soon after, agreeing with Quarnom that Kenobi would stand trial. She then, however, brought up the matter of his lightsaber. Trusting Quarnom to cover for him, Kenobi stated that the seeker droids had shot it out of his hand, destroying it. The Neimoidian operative reaffirmed this, stating that she had seen it herself and that the security cameras could be checked, though they might not have captured the correct angle. Ventress then got closer to Quarnom, staring her down as she questioned whether or not she had been mind tricked. Quarnom stood her ground, repeating her prior claim before questioning if Ventress took issue with her actions. The assassin then let off, claiming that she trusted Quarnom's judgment.\nWhile Kenobi was in Neimoidian custody, he lamented that Skywalker could have helped investigate Quarnom's lead. Meanwhile, Ventress spoke with Nor, asking him if he trusted Quarnom. He replied that he did, adding that his partner had looked after him ever since he joined. Ventress then pushed further, asking if Quarnom's activity had grown strange or out of character ever since Kenobi's arrival. When Nor stared at her without a response, Ventress concluded that Quarnom was keeping him away from her. However, Nor stated that Quarnom had been looking out for his well-being, as she knew he had been tired. Ensnaring Nor's line of thought, Ventress then reminded Nor that, despite his partner's decorated past, she had still missed when chasing after Kenobi. The assassin then affirmed to Nor that he had to break the hold she claimed Kenobi had over Quarnom, stating that loyalty could be exploited and the Jedi likely had a grip on Quarnom's mind. In another location on Cato Neimoidia, Skywalker, Jedi youngling Mill Alibeth, and the R2-series astromech droid R2-D2 saw Quarnom in a news broadcast of Kenobi's capture, noting her specialized armor.\nAs Kenobi meditated in his cell, Quarnom arrived, holding a device which she then used to disable the cell's surveillance. She held a finger to her lips to ensure Kenobi remained silent as she did so, then put the device away. The Jedi prisoner proceeded to ask if Quarnom intended to break him out, to which she replied that it would depend on what they figured out. She then apologized to Kenobi for Nor's actions, ensuring them that, despite his impulsiveness, they were fueled by patriotism rather than malice. Kenobi laughed in agreement due to his own experience with Skywalker. Afterwards, he advised Quarnom to keep her partner away from Ventress. Quarnom agreed, stating that she had tried, but that her trust for Kenobi was also beginning to wane. The Neimoidian soldier then requested that Kenobi tell her the truth once more. After he responded, she asked if he would have hidden it from her had the evidence pointed toward Separatist responsibility.\nQuarnom continued that it was Kenobi's own biases that had convinced him to hide the truth, then informed him that her own lead implied that the Separatists were indeed responsible, with explosions matching Separatist blazer bombs detailed in the report. When he questioned the authenticity, Quarnom replied that she would bet her life on it—as well as Kenobi's. Kenobi then began to assume this confirmed the Separatist's responsibility, but she soon admonished him, reminding him of his biases and her own experiences in framing evidence. The two then agreed to move forward in their investigation on a basis of trust, ensuring to find the truth no matter upon whom the blame fell. Quarnom stated that whoever was responsible was likely playing both sides, attempting to influence both the Republic and the Separatists into increasing tensions. She questioned who would have benefitted from this, and they both agreed that involvement from the Trade Federation, a neutral party, a rogue agent, or the Bounty Hunters' Guild would be an impossibility. Quarnom then raised the question of whether or not the culprit emulated both factions' protocols, or if both factions had been coerced into involvement.\nKenobi stated that the importance of the investigation lied not within discovering the culprit's identity, but by proving to both the Republic and the Separatists that they needed to reach common ground in order to learn the truth. As Quarnom's device beeped, notifying her that surveillance would soon reactivate, she asked Kenobi if he was confident bringing the evidence to the Republic would lead to peace, which he assured her he did. She then ensured him that he would only help him escape if it was in the best interests of her people, and that she would be arrested at best and killed at worst should she be caught doing so. Kenobi then asked her if she believed in her government's ideals. Quarnom only replied that one could always believe in a cause without agreeing with its leadership, as she opened the door, prompting Kenobi to make a decision. When he decided that he would remain in custody, Quarnom asked if he was certain. After he confirmed that he was, she exited the cell as Kenobi stated that he hoped she would be there when he needed her.\nQuarnom was a Neimoidian female with dark green skin. She was devoted to her planet's neutrality and the protection of her people, and believed that her partner, Nor, was naïve, and that his innocence would be shattered in the event that he would ever have to kill someone. Though Nor was taller than her, in her eyes he seemed as tiny as a newborn Neimoidian grub. While on duty, she operated with a soldierlike methodical cadence. Her relationship with Nor was friendly, but was a give-and-take due to Nor's naivety and strong feelings. Her posture had a noticeable difference from other Neimoidians, as if she physically carried the weight of experience on her shoulders.\nQuarnom believed in the concept of the Trade Federation due to the benefits, voice, and recognition it provided her people. However, she also found herself dissatisfied with its leadership over the course of a decade, and she was reassigned after voicing her misgivings. Her belief in the Trade Federation and the purpose it served largely stemmed from a dissatisfaction toward the Republic, and its own failure to recognize Cato Neimoidia as something other than an asset in shipping and commerce. Inversely, she recognized core, systemic issues plaguing the Republic, but still believed that some individuals living within it had the capacity for reason.\nQuarnom had a history of missions and training, which aided her in picking up all details that could help identify a situation. Her mind was constantly scanning for details and information such as tone, sounds, or environmental factors, gathering as much of it as possible. As a result, she had a running knowledge and memories of all Neimoidian officials and dignitaries, as well as local handling of Trade Federation business and the disaster in Cadesura. Quarnom was also capable of reading people, observing any tics or tells they might show in order to predict what they might do. She was incredibly nimble and graceful, despite her lack of sensitivity to the Force.\nQuarnom utilized a custom sniper rifle, which felt to her like an extension of her own limbs. She also possessed as set of segmented custom armor. Both her armor and rifle could be broken up into segments and pieces or modules, respectively, and placed within cases for transport. She would always return both to her quarters with her, not for safety, but instead because she felt incomplete without them. During the chase for Obi-Wan Kenobi, Quarnom utilized a pistol rather than her sniper rifle. She also had access to binders she could utilize to apprehend targets.\nRuug Quarnom first appeared in the 2022 novel Brotherhood, written by Mike Chen. In the acknowledgements of the book, Chen stated that Quarnom had been inspired by actress Nana Visitor's portrayal of Kira Nerys, a character from the science fiction television series Star Trek: Deep Space Nine. Likewise, Quarnom's name is derived from the Deep Space Nine characters Quark, Rom, and Nog, all members of the Ferengi species. This choice stemmed from a desire of Chen's to explore the Neimoidians in a similar fashion to the way Deep Space Nine explored the Ferengi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Cato_Neimoidia",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cato_Neimoidian_government",
  "/wiki/Neimoidian_special_forces",
  "/wiki/Neimoidian_Royal_Guard",
  "/wiki/Soldier",
  "/wiki/Commando",
  "/wiki/Neimoidian_Defense_Legion",
  "/wiki/Clone_Wars",
  "/wiki/Ketar_Nor",
  "/wiki/Cadesura_disaster",
  "/wiki/Cadesura_district",
  "/wiki/Zarra",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Sith_assassin",
  "/wiki/Asajj_Ventress",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hyperlane",
  "/wiki/Blockade",
  "/wiki/Trade_Federation",
  "/wiki/Jedi_Knight",
  "/wiki/22_BBY",
  "/wiki/Patrol_ship",
  "/wiki/Nute_Gunray",
  "/wiki/Hologram",
  "/wiki/Map",
  "/wiki/Rescue_droid",
  "/wiki/Huttese",
  "/wiki/Shower",
  "/wiki/Rifle",
  "/wiki/Armor",
  "/wiki/Battle_droid",
  "/wiki/Droid",
  "/wiki/Sleep",
  "/wiki/Training_droid",
  "/wiki/Standard_day",
  "/wiki/Holodrama",
  "/wiki/Agaric_ale",
  "/wiki/Alluv_Eyam",
  "/wiki/Feldus_Spar",
  "/wiki/Comlink",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Scope",
  "/wiki/Spectrometer",
  "/wiki/Belt",
  "/wiki/Lamp",
  "/wiki/Night_vision",
  "/wiki/Korgee_beast",
  "/wiki/Sniper_rifle",
  "/wiki/Medpac",
  "/wiki/Bacta",
  "/wiki/Laser_suture",
  "/wiki/The_Force",
  "/wiki/Datapad",
  "/wiki/Process_four-C",
  "/wiki/Shuttle",
  "/wiki/Coin",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Alcohol",
  "/wiki/I_have_a_bad_feeling_about_this",
  "/wiki/The_galaxy",
  "/wiki/Diplomat",
  "/wiki/Rosbuen_Frisk",
  "/wiki/Force_speed",
  "/wiki/Pistol",
  "/wiki/Seeker_(droid)",
  "/wiki/Remote",
  "/wiki/Transport",
  "/wiki/Binder",
  "/wiki/Security_camera",
  "/wiki/Mind_trick",
  "/wiki/Youngling",
  "/wiki/Mill_Alibeth",
  "/wiki/R2-series_astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Blazer_bomb",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Force-sensitive",
  "/wiki/Limb",
  "/wiki/2022",
  "/wiki/Brotherhood",
  "/wiki/Mike_Chen_(author)",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/November_2",
  "/wiki/2021"
 ]
}