{
 "name": "Ruusaan Skirata",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 55 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Ruusaan Skirata, nicknamed Ruu, was the youngest child and only biological daughter of the Mandalorian mercenary Kal Skirata and his non-Mandalorian wife Ilippi. She was the youngest and only sister of Ijaat and Tor Skirata.\nWhile she bore a Mandalorian name , Ruusaan was raised by her mother and absorbed her mother's opinion on Mandalorians, but she apparently didn't disown her father along with her brothers. During his mission to find Ko Sai, Kal Skirata thought about trying to find his daughter once the job was done.\nAt sometime during the Clone Wars, Ruusaan was captured fighting for the Confederacy of Independent Systems and placed in a Republic Detention Center on Pols Anaxes. Jedi Knight-turned-Mandalorian Bardan Jusik, ex-Advanced Recon Commandos Sull and Spar, and ex-Clone commando Fi disguised themselves to sneak into the detention center and used fake documents stating orders to transfer her to Coruscant. She was reunited with her father during the Battle of Coruscant.\nAfter the battle, Ruusaan along with most of her father's clan moved to Mandalore. It was there where the funeral of Etain Tur-Mukan was held which she attended. A few days after the funeral, she and her father took a walk around a lake just north of Kal's bastion in Kyrimorut finally getting a chance to talk about their respective lives and what they've done.\nGiven that her eldest brother, Tor Skirata, is described as being three years older than Ruusaan Skirata as well as being thirty-nine years of age, in Order 66: A Republic Commando Novel, it can be interpolated that she was born sometime around 55 BBY and is about thirty-six years old in Order 66: A Republic Commando Novel, when she is reunited with her father. During the events of Imperial Commando: 501st, it was stated that in 8 years, Cov her clone lover would be older than Ruusaan.\nRuusaan Skirata is also described as having the same \"piercing blue eyes and the prominent cheekbones\" of her father in Order 66: A Republic Commando Novel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/55_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Ilippi_Skirata",
  "/wiki/Ijaat_Skirata",
  "/wiki/Tor_Skirata",
  "/wiki/Ko_Sai/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Republic_Detention_Center",
  "/wiki/Pols_Anaxes",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bardan_Jusik",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Alpha-30",
  "/wiki/Spar",
  "/wiki/Clone_commando/Legends",
  "/wiki/Fi_Skirata",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Clan_Skirata",
  "/wiki/Mandalore/Legends",
  "/wiki/Funeral_of_Etain_Tur-Mukan",
  "/wiki/Etain_Tur-Mukan",
  "/wiki/Kyrimorut",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Cov_(clone_trooper)",
  "/wiki/Bone/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ruusaan_Skirata",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Republic_Commando:_True_Colors"
 ]
}