{
 "name": "Ruwan_Tokai",
 "display_name": "Ruwan Tokai",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ruwan Tokai was a Human male technical sergeant of the Galactic Empire who was posted to the Great Temple of the Massassi on Yavin 4 during the Galactic Civil War. A year after the Battle of Yavin in 1 ABY, Sergeant Tokai examined a piece of the DS-1 Orbital Battle Station, a moon-sized Imperial battlestation better known as the Death Star. After sending a courier of his to deliver the fragment to a warrant officer for further analysis, Sergeant Tokai was put at risk of court-martial due to the Death Star salvage being above his security clearance. To avoid punitive action, Sergeant Tokai procured from his superior officer a \"retroactive authorization\" which retroactively granted the sergeant the right to have examined the piece of the massive Imperial battlestation.\nA Human male technical sergeant of the Galactic Empire by the name of Ruwan Tokai was alive during time of the major galactic conflict known as the Galactic Civil War, during which the Alliance to Restore the Republic won a decisive victory against the Galactic Empire at the Battle of Yavin in 0 BBY. About 6 months later, the Rebel Alliance evacuated the moon of Yavin 4. By around 1 ABY, Sergeant Ruwan Tokai and other Imperial officers were posted to the Great Temple of the Massassi formerly used by the Rebel's as their base of operations.\nDuring his time at the temple, Sergeant Tokai examined a fallen piece from the destroyed DS-1 Orbital Battle Station, the moon-sized Imperial battlestation better known as the Death Star. The Death Star fragment was an unidentifiable piece of durasteel, possibly a hull fragment from the destroyed battlestation. While examining the piece, the sergeant lamented the affect the humidity of Yavin 4's jungle environment had on their equipment. The Death Star fragment, for instance, was covered in moss. However, any attempt to clean the piece risked removing vital chemical traces which would help the Imperials learn what happened to the Death Star.\nTo better examine the piece, Sergeant Ruwan Tokai sent a courier of his to deliver the fragment to a warrant officer II for further analysis. After the courier handed the fragment over to the warrant officer in the nearby Ersham Ridge region, the officer expressed surprise that the technical sergeant was allowed to examine it in the first place. All salvage from the Death Star was declared by the Empire as a classified secret. Arousing suspicion, the warrant officer said he would look into Sergeant Ruwan Tokai's clearance level. The courier returned to Sergeant Tokai to inform him of the warrant officer's suspicions, as well as to collect payment allocated from Sergeant Tokai's equipment restoration budget. The technical sergeant claimed that no one had told him Death Star salvage was classified, and he hoped nothing bad would happen to him as a result of this fact.\nUnfortunately for Ruwan Tokai, his worst fears were realized when he received news that he was at risk of being court-martialed for examining the piece of the Death Star, which was above his security clearance. Fearing he could be sent to the Spice Mines of Kessel, Sergeant Tokai frantically begged his courier to procure a \"retroactive authorization\" from his superior officer, a man who held the rank of lieutenant colonel in the Imperial Military. The courier agreed to help out the panicked sergeant, even though this meant traversing a dangerous area of the Ersham Ridge known to harbor Rebel activity. Although the courier was attacked by a Rebel first lieutenant and two of their commandos, the courier managed to kill them off, and successfully reach Ruwan Tokai's superior officer. Fortunately for Sergeant Tokai, his superior was understanding of his situation, and dismissed it as an understandable little slip-up. With the retroactive authorization procured, the courier returned to a grateful Ruwan Tokai, who paid the loyal Imperial servant out of his own funds. Free to continue his service to the Empire, Sergeant Ruwan Tokai then remembered that the warrant officer had also examined the same Death Star piece. Tokai hoped that he would not get into the same kind of trouble as he did.\nRuwan Tokai had fair skin, brown hair, and blue-colored eyes. During his time at the Great Temple, Ruwan Tokai remarked how he despised the humidity of the jungle moon. Nevertheless, he carried on his duties, sometimes with ill conceived consequences. When Sergeant Tokai was at risk of court-martial for examining a piece of the Death Star above his security clearance, the Imperial officer panicked, and begged his courier to retrieve a retroactive authorization from his superior. Ruwan Tokai had something of a generous disposition. When the courier carried out his tasks, he saw to it that the individual received compensation, either from his allocated budget, or from his very own personal funds.\nDuring his post at the Great Temple on Yavin 4, Ruwan Tokai wore a typical Imperial officer's uniform. This uniform consisted of a grey tunic and trousers, a cap with an affixed officer's disc, a black belt with a silver-colored buckle, black boots, and black gloves.\nSergeant Ruwan Tokai was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Players who performed a series of quests for Tokai had to deliver a Death Star fragment to a warrant officer, and receive a retroactive authorization from a lieutenant colonel. Completing the first quest would earn the player 40 credits, while completing the second would earn the player 50 credits. Although the player could choose not to do Tokai's quests, this article assumes 100% game completion. Ruwan Tokai was one of only few NPCs in Star Wars Galaxies for which a definitive quest timeline could be established. In his first quest, he referenced the destruction of the Death Star as having taken place \"last year,\" indicating a quest timeline of around 1 ABY.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Tech_Sergeant",
  "/wiki/Great_Temple/Legends",
  "/wiki/Massassi/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Battlestation",
  "/wiki/Death_Star/Legends",
  "/wiki/Courier/Legends",
  "/wiki/Warrant_Officer/Legends",
  "/wiki/Court-martial/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Time/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Evacuation_of_Yavin",
  "/wiki/Durasteel/Legends",
  "/wiki/Hull/Legends",
  "/wiki/Jungle/Legends",
  "/wiki/Moss/Legends",
  "/wiki/Canon",
  "/wiki/Officer/Legends",
  "/wiki/Ersham_Ridge",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/Kessel/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Lieutenant_Colonel/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/First_Lieutenant/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Death/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Imperial_officer%27s_tunic/Legends",
  "/wiki/Hat/Legends",
  "/wiki/Imperial_officer%27s_disc",
  "/wiki/Belt/Legends",
  "/wiki/Silver/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Officer%27s_gloves",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Doom_Mission",
  "/wiki/Rebellion_Era_Campaign_Guide"
 ]
}