{
 "name": "Rya_Skodhan",
 "display_name": "Rya Skodhan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mantooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 28 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Intelligence",
      "Alliance Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Rya Skodhan was a Human woman, who around 0 BBY was both a thief and a Rebel operative\nRya Skodhan was born on the planet of Mantooine around 28 BBY. She worked as a burglar but after she was almost caught while raiding an Imperial installation, she decided to lie low for a while and she began working as a sabacc hustler. She encountered General Airen Cracken of the Rebel Alliance and after he lost three months' pay to her, he persuaded her to join the Alliance.\nBy 0 BBY Skodhan worked as a sabacc dealer in the Imperial Palace Casino Hotel on Ord Mantell, where she spied on Imperial officers who played at her table. She also used her skills as a burglar to break into the rooms of Imperial officers and search for anything that could help the Alliance, disguising the intrusion as petty theft.\nSkodhan was a Human female with brown hair that she braided and coiled around her head. She had lightly tanned skin and was never seen without a jeweled stud in the left side of her nose. Despite working for the Rebellion she still had a penchant for jewelry and Cracken feared that this would either distract her or even lead to her downfall. She was a cautious agent and had a system worked out to identify fellow Rebels. The rebel operative would comment on her hair and she would deal the Rebel a winning hand. If the Rebel then folded she would deal them specific cards in a specific pattern that would identify the data drop.\nSkodhan was an incredibly skilled gambler and a skilled liar as well which made her a very effective sabacc hustler. She had spent enough time on Ord Mantell to be able to navigate its local government and had contacts in place to learn valuable information about the coming and goings of the planet. Her time as a burglar gave her talent in pick pocketing, sneaking, appraising jewelery, and working with or around security systems and computers. She also picked up a few combat skills and was decent with blasters, melee weapons and her fists.\nSkodhan wore a black jumpsuit when she was burglarizing and had a flashy casino uniform when she was working. She hid a hold-out blaster within the coils of her hair and was able to retrieve it in seconds if necessary. She also used a GenCo-3 electronic lockpicker, a marked sabacc deck and wore various pieces of jewelry.\nRya Skodhan was designed by Paul Balsamo for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. She was illustrated by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mantooine/Legends",
  "/wiki/28_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/0_BBY/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Imperial_Palace_Casino_Hotel",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/GenCo-3_electronic_lockpicker",
  "/wiki/Paul_Balsamo",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Vilardi"
 ]
}