{
 "name": "Ryamn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rutian Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey-blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Death's Claw pirates"
     ]
    }
   ]
  }
 ],
 "content": "Ryamn was a male Rutian Twi'lek who worked for the Death's Claw pirates as a doctor during the Cold War between the Galactic Republic and the reconstituted Sith Empire.\nA Rutian Twi'lek, Ryamn became a legal doctor sometime before the Cold War between the Galactic Republic and the Sith Empire. Sometime after that, he became entangled with the Death's Claw pirate organization, and began to work as the group's doctor on Taris.\nWhen Doctor Ianna Cel asked a Republic-allied individual to recover a sample of rakghoul serum from the pirates, the individual fought their way through the pirates' base and found the infirmary. Before they could take the serum, Ryamn warned them not to take it, or the rakghoul-infected pirates in the medbay would transform and attack. Ryamn convinced the individual to leave the serum by telling them that he found it in the ruins of Dynamet General Hospital. The individual left Ryamn the serum, warning the Twi'lek that they would come back if they couldn't find it.\nRyamn was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He appears in the Taris mission \"Pirate Medicine\" for Republic players. Players can choose to leave the serum for light side points, or they can take it for dark side points. If they take it, they are forced to fight all of the infected pirates.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rutian/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Death%27s_Claw",
  "/wiki/Pirate/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Taris/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Ianna_Cel",
  "/wiki/Rakghoul_serum",
  "/wiki/Dynamet_General_Hospital",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011"
 ]
}