{
 "name": "Rycus Kilran",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dromund Kaas"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c .3692 BBY",
      "Dromund Kaas"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3641 BBY",
      "The Maelstrom"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireImperial Armada",
      "Imperial Armada"
     ]
    }
   ]
  }
 ],
 "content": "Rycus Kilran was a Human male who served as Grand Moff of the Sith Empire during the Cold War and the Galactic War. He was best known for his role during the Sacking of Coruscant, which earned him the nickname of the \"Butcher of Coruscant,\" and as the pacifier of the Togruta Uprising.\nBorn on Dromund Kaas to a wealthy family with a proud military tradition, Kilran grew into a creative strategist and military leader. He proved himself, to no one's surprise, a capable right-hand man to the Sith during the Empire's early assaults on the Brema sector. When his Sith superior died during the Battle of Ord Ibanna, who Rycus was serving as tactical advisor—he assumed command of the ragged Imperial fleet and led them to a swift and decisive victory.\nIn the years that followed, Kilran's authority grew with his list of triumphs, and both the Sith and the Minister of War learned respect for his unorthodox strategies. His brutally effective strikes during the final days of the war, as well as his tactics during the Sacking of Coruscant, earned the Captain the nickname \"the Butcher of Coruscant\" among Republic civilians, a name he adopted with characteristic irony. His heroic stand against a Jedi boarding party earned him his scars. After the war ended, he was granted the honorary title Grand Moff in recognition of his contributions.\nAfter the time of the Great Galactic War, Kilran ordered Revinal Orzik, captain of the Black Talon, to intercept a Republic warship, the Brentaal Star, and eliminate the wanted passenger, a renegade Imperial general. When Captain Orzik refused to carry on what he saw as a suicide mission, Kilran sent a small team of operatives to take care of the situation, even while dealing with a Republic boarding party sent against him from a small vessel, the Esseles.\nTowards the end of the Cold War, Kilran was charged with maintaining the prison within the Maelstrom where the Sith Emperor had held a powerful prisoner - the Jedi Master Revan - for three hundred years. He was confronted by the same Republic strike team from the Esseles, now dispatched by Master Oteg. The team had obtained a Gree computer to navigate the Maelstrom from the Imperial base on Taral V, despite Kilran's efforts to bombard the planet before they could successfully escape.\nImpressed and infuriated by the persistence of the Republic team, Kilran personally boarded the prison and informed Darth Malgus - who was watching from a nearby holoterminal - that he would put the intruders out of their misery. Malgus ordered him to focus solely on preserving the prisoner, but Kilran elected to attack anyway, believing he could deal with the problem. In the end, however, he proved unable to withstand the assault as the Republic forces struck him down in the prison's core, putting an end to the Butcher of Coruscant.\nUpon his death, Kilran was succeeded by Grand Moff Ilyan Regus.\nApart from being the most cunning strategist the Empire has to offer, he has been described as both charismatic and an intellectual genius. He is also very patriotic towards the Empire and would no doubt fight to the bitter end for it. He also had a strong sense of pride; when he was faced with the team of individuals who had repeatedly humiliated him he was willing to disobey Darth Malgus and try to kill them rather than securing Revan like he was ordered to. He was also a great lover of fine wines.\nKilran was first introduced through a development diary released by BioWare. He is voiced by Simon Templeman.\nThere are several phrases written in Aurebesh on his page at the official site. When transliterated, they read \"defense of the secret prison,\" \"Chasing the General,\" and \"personal combat expert.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/3692_BBY",
  "/wiki/3641_BBY",
  "/wiki/The_Maelstrom",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Minister_of_War_(Sith_Empire)",
  "/wiki/Black_Talon",
  "/wiki/File:Kilran-MyNameIs-TOR.ogg",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Togruta_Uprising",
  "/wiki/Revinal_Orzik",
  "/wiki/Sith/Legends",
  "/wiki/Brema_sector",
  "/wiki/Unidentified_Imperial_commander_(Brema_sector)",
  "/wiki/Battle_of_Ord_Ibanna",
  "/wiki/Advisor/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Brentaal_Star",
  "/wiki/The_General",
  "/wiki/Esseles_(starship)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Tenebrae",
  "/wiki/Revan/Legends",
  "/wiki/Oteg",
  "/wiki/Gree_computer",
  "/wiki/Taral_V_Imperial_fortress",
  "/wiki/Taral_V",
  "/wiki/Darth_Malgus",
  "/wiki/Ilyan_Regus",
  "/wiki/Wine/Legends",
  "/wiki/BioWare",
  "/wiki/Simon_Templeman",
  "/wiki/Aurebesh/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/3643_BBY",
  "/wiki/Hero_of_Tython",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Battle_of_Ilum",
  "/wiki/3640_BBY",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/3642_BBY"
 ]
}