{
 "name": "Ryder",
 "display_name": "Ryder",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 11 ABY and 19 ABY",
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Grey Squadron",
      "Grey Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Ryder was a Human male member of the New Republic Grey Squadron, which was commanded by the Force-sensitive clone X2. Ryder was among the Grey Squadron pilots who accompanied X2 to the planet Dathomir in an effort to locate X2's brother, X1, an Imperial warlord. During the mission, Ryder fell victim to sabotage when the squadron's X-wings were rigged with detpacks by one of X1's Imperials.\nRyder was a light-skinned Human male who served as a pilot in Grey Squadron, a New Republic military unit led by the Force-sensitive clone X2. At some point between the years 11 ABY and 19 ABY, Ryder accompanied X2 and the rest of Grey Squadron on a mission to the planet Dathomir. There, X2 hoped to track down his genetic brother, X1, who had established himself as a warlord following the death of Galactic Emperor Palpatine and was seeking galactic domination.\nUpon arrival to the planet in their X-wing starfighters, Grey Squadron decided to land in the middle of the planet's swamps, in order to avoid detection. The squadron soon discovered that X1 possessed a base on the surface of Dathomir, and X2 sensed that his brother had been working on something important there. However, X1 had left the planet, and his base subsequently came under attack by the Nightsister clan of Dathomiri Witches. Having defeated both the Nightsisters and X1's Imperials, X2 and Grey Squadron member Shara went inside the base—which was revealed to contain X1's cloning laboratory—to retrieve important data from X1's office, leaving Ryder and the other pilots at a landing pad with their starfighters.\nHowever, while X2 and Shara were away, an Imperial loyal to X1 managed to infiltrate the landing site undetected and plant detpacks onto the squadron's X-wings. The resulting series of explosions killed most of Grey Squadron and destroyed their starfighters. Ryder himself was mortally wounded, but he survived long enough to see X2 and Shara's return. Grey Squadron captured the saboteur, and X2 Force-choked him in a gust of anger. He then led the remainder of his squadron in an attack on an orbiting Imperial-class Star Destroyer, destroying it in an act of retaliation.\nRyder appeared in the Nintendo DS version of the 2009 video game Star Wars Battlefront: Elite Squadron, which was published by LucasArts.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/New_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Ryder_Windham",
  "/wiki/Lothalite",
  "/wiki/Ryder_Azadi",
  "/wiki/11_ABY/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Grey_Squadron",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/X2",
  "/wiki/Planet/Legends",
  "/wiki/Mission_to_Dathomir_(Galactic_Civil_War)",
  "/wiki/X1",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Death/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Detonation_pack",
  "/wiki/Unidentified_Imperial_saboteur",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Standard_year/Legends",
  "/wiki/DNA/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/X1%27s_Dathomir_base",
  "/wiki/Force_sense/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Shara",
  "/wiki/Telekinesis/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Nintendo_DS",
  "/wiki/2009",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Battlefront:_Elite_Squadron",
  "/wiki/LucasArts",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Pellaeon%E2%80%93Gavrisom_Treaty"
 ]
}