{
 "name": "Rydel_Delan",
 "display_name": "Rydel Delan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sanyassan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lok Revenants",
      "Tansarii Point Station"
     ]
    }
   ]
  }
 ],
 "content": "Rydel Delan was a male Sanyassan fighter and martial artist who lived during the Galactic Civil War.\nRydel Delan was a master of melee weapon and unarmed combat. He used to work for the pirate warlord Nym on Lok for a period of time but he eventually moved to the Bright Jewel system. After the Battle of Yavin, he worked out of the close combat training room as the brawling master on Tansarii Point Station, a space station located above Ord Mantell in the Bright Jewel system.\nIn 1 ABY, the Sanyassan hired a spacer to deal with a number of problems on the station. Delan first tasked the spacer with thinning down the increasing number of wild creatures in Tansarii Point Station's atrium, flits and scyks, that were becoming very aggressive. Later, the spacer helped the local cantina owner, Tiarsis, with a bully. While doing so, the spacer discovered that a group of renegades calling themselves the Genesis Red was planning to sabotage the station. The spacer therefore headed to the lower level of Tansarii Point Station where he fought the saboteurs and prevented them to achieve their insane project. In fact, the pirates had broken through the outer hull of the station, creating a very dangerous situation for its inhabitants. In order to avoid more damage, Rydel asked the spacer to kill the leader of the Genesis Red gang, known himself as Genesis Red. The spacer eventually succeeded in doing so, earning the respect and reconnaissance of Rydel Delan for saving numerous beings in Tansarii Point Station.\nDelan used to wear a Marauder armor. He also owned several old pieces of fighter equipment including a tarnished brawling champion's ring, a frayed pit fighter's belt and a warp Brawler's bracelet one of which he gave to the spacer in thanks for his help. He also carried a sword, an axe and a knuckler as his own weapons however for killing Genesis Red he gave one to the spacer to show his gratitude. One of Rydel's swords was left behind at a Downed Blood Razor's Transport on Lok, only to later be retrieved by a spacer exploring the area.\nRydel Delan was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Rydel Delan was added to the game as part of the \"New Player Tutorial,\" introduced with the release of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005. He gave the player several optional side quests of varying levels of difficulty.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sanyassan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Martial_artist",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Inaldra/Legends",
  "/wiki/Inaldra%27s_Lieutenant",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Pirate/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Flit",
  "/wiki/Scyk/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Tiarsis",
  "/wiki/Genesis_Red_(gang)",
  "/wiki/Genesis_Red/Legends",
  "/wiki/Marauder_Reconnaissance_Armor",
  "/wiki/Ring/Legends",
  "/wiki/Pit_fighting/Legends",
  "/wiki/Bracelet/Legends",
  "/wiki/Sword/Legends",
  "/wiki/Axe",
  "/wiki/Knuckle_plate_vibro_blade",
  "/wiki/Downed_Blood_Razor%27s_Transport",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}