{
 "name": "Ryle_Torsyn",
 "display_name": "Ryle Torsyn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Gold Squadron",
      "Gold Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Ryle Torsyn was a human male who served as a pilot in the Alliance to Restore the Republic. While in the rebel base on the planet Dantooine, he discovered an Imperial tracking device in a delivery of equipment, which led to the base being evacuated.\nIn 0 BBY, Torsyn was stationed in the Alliance's new base in the Great Temple on the moon Yavin 4. When the Empire's Death Star superweapon entered the Yavin system to destroy the base, Torsyn piloted a BTL-A4 Y-wing assault starfighter/bomber as part of Gold Squadron in the Battle of Yavin. Torsyn was killed along with all but one member of his squadron, but the Alliance managed to destroy the Death Star.\nThe human male Ryle Torsyn joined the Starfighter Corps of the Alliance to Restore the Republic as a volunteer pilot while the Alliance was based in its first headquarters on the planet Dantooine. during the Imperial Era. He spent time at the Dantooine base, which was intended to be temporary, but its use continued and security grew lax until Torsyn eventually discovered an Imperial tracking device hidden in a delivery of equipment. The device was destroyed and the base was immediately evacuated, although unbeknownst to the rebels, the device had actually failed and the Empire remained unaware of the Dantooine base.\nThe Alliance soon created a new headquarters in the Great Temple on the moon Yavin 4 where Torsyn and his colleagues were transferred. In 0 BBY, the Empire learned of the new base's location and the Death Star superweapon was sent to the Yavin system to destroy it. Having learned of a vulnerability in the weapon's design, the Alliance mounted an attack on it.\nTorsyn was selected to fly one of the eight BTL-A4 Y-wing assault starfighter/bombers that made up Gold Squadron under the command of Gold Leader Jon Vander. The pilot climbed into his vehicle in the hangar of the Great Temple before being handed his K-22995 light flight helmet by a member of the ground crew. After the initial attack on the Death Star began, Vander broke the squadron, taking Dex Tiree and Davish Krail to make a trench run while Torsin and the other four pilots in the squadron split off and held back.\nAfter Gazdo Woolcob became the first member of the squadron to be shot down, Vander ordered Torsyn and the three other survivors to engage the Imperial TIE fighters and hold them off while he, Tiree, and Krail entered the trench; however, Gold Leader and his wingmen were then all killed during the run. Torsyn was then shot down by enemy fire, perishing along with two of the other Gold Squadron pilots before Red Leader Garven Dreis began a second run down the trench. The second trench run also failed, but the third succeeded when Red Squadron Luke Skywalker destroyed the Death Star. This left Lieutenant Evaan Verlaine as the only surviving member of Gold Squadron.\nTorsyn had brown hair, blue eyes, and light skin.\nRyle Torsyn wore an orange flight suit with a white flak vest and a K-22995 light flight helmet marked with two blue Rebel Alliance starbirds. He had two data cylinders on his left sleeve and wore a pair of black flight gauntlets while piloting a BTL-A4 Y-wing assault starfighter/bomber during the Battle of Yavin.\nRyle Torsyn first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. According to the fan site Aveleyman, he was portrayed by John Ketteringham. The scenes in the Great Temple hangar were filmed on H Stage at Shepperton Studios in London between June 9 and 14, 1976. In the current Star Wars canon, the character was first identified in the thirty-seventh issue of De Agostini's Star Wars: Build the Millennium Falcon magazine, which was published around September 16, 2015. Build the Millennium Falcon used the spelling \"Ryle Torsin\" for the character's name, but The Pilots of the Rebel Alliance, part of De Agostini's Star Wars Encyclopedia line released on March 4, 2022, used the spelling \"Ryle Torsyn\". This article assumes the more recent source to be correct.\nThe character was previously identified in the Star Wars Legends continuity, using the spelling \"Ryle Torsyn,\" which was first used on two cards in the 1998 \"Special Edition Limited\" expansion to the Star Wars Customizable Card Game. In Legends, Torsyn used the callsign Gold Three during the Battle of Yavin; however, in canon, the callsign is instead used by Evaan Verlaine.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ryle_Torsyn",
  "/wiki/Ryle_Torsyn/Legends",
  "/wiki/0_BBY",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Rebel_pilot",
  "/wiki/Dantooine_base",
  "/wiki/Planet",
  "/wiki/Dantooine",
  "/wiki/Galactic_Empire",
  "/wiki/Homing_beacon",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Pilot",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Gold_Squadron",
  "/wiki/Battle_of_Yavin",
  "/wiki/Death",
  "/wiki/Evaan_Verlaine",
  "/wiki/Squadron",
  "/wiki/Death_Star",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Imperial_Era",
  "/wiki/Time",
  "/wiki/Death_Star_plans",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Commanding_officer",
  "/wiki/Gold_Leader",
  "/wiki/Jon_Vander",
  "/wiki/Starship",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Rebel_technician",
  "/wiki/Dex_Tiree",
  "/wiki/Davish_Krail",
  "/wiki/Meridian_trench",
  "/wiki/Gazdo_Woolcob",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Red_Leader",
  "/wiki/Garven_Dreis",
  "/wiki/Luke_Skywalker",
  "/wiki/Lieutenant",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Flight_suit",
  "/wiki/Flak_vest",
  "/wiki/Flight_helmet",
  "/wiki/Rebel_Alliance_starbird",
  "/wiki/Code_cylinder",
  "/wiki/Flight_glove",
  "/wiki/Starfighter",
  "/wiki/Bomber",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/John_Ketteringham",
  "/wiki/Shepperton_Studios",
  "/wiki/June_9",
  "/wiki/June_14",
  "/wiki/1976",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_37",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/September_16",
  "/wiki/2015",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/March_4",
  "/wiki/2022",
  "/wiki/Star_Wars_Legends",
  "/wiki/1998",
  "/wiki/Special_Edition_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Call_sign",
  "/wiki/Gold_Three/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Callsign",
  "/wiki/Grounded",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Category:Images_of_Ryle_Torsyn",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Sparks_(short_story)",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/A_New_Hope_-_The_Film_Novel",
  "/wiki/November_4",
  "/wiki/2018",
  "/wiki/The_Making_of_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_2",
  "/wiki/January_14",
  "/wiki/January_8",
  "/wiki/November_6",
  "/wiki/2016"
 ]
}