{
 "name": "Rynert",
 "display_name": "Rynert",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Rynert was a Human male resident of the Taloraan City on the planet of Taloraan and a supporter of Confederacy of Independent Systems during the Clone Wars.\nIn 21 BBY city's magister Orlin Denache secretly signed a treaty with Count Dooku, who was interested in making Taloraan a member of the Confederacy of Independent Systems. A Munificent-class star frigate under the command of Captain Canteval was sent to the planet and local Separatist supporters led by Rynert began to smuggle B1-Series battle droids and droidekas into the city.\nMeanwhile, Jedi Knights Obi-Wan Kenobi and Anakin Skywalker arrived at Taloraan to ensure that the planet remained loyal to the Republic, accompanied by Skywalker's Padawan Ahsoka Tano. After Tano and the protocol droid C9-RX0 accidentally discovered battle droids stocked within the city, Rynert destroyed the droid and tried to take on the padawan as well, but was Force-pushed into the wall by Tano, who managed to escape. Rynert immediately reported the fact to Canteval, who ordered the droids to attack the Jedi, revealing the Separatist presence within the city. Kenobi and Skywalker tried to reach their Nu-class attack shuttle, but were incapacitated when the shuttle was blown up by Rynert. Rynert intended to kill the Jedi, but emissary Sech Govlinder insisted that the Jedi be taken into custody instead.\nAfter securing the Jedi in the warehouse, Rynert tried to re-establish contact with Canteval and left for the upper city platform to try to acquire a better signal. While he was gone, Sech Govlinder freed both Jedi and led them to the city's central communication tower, where the Jedi were able to patch a message to their Star Destroyer, Resolute. Rynert informed Canteval that the ship was within their firing range, but without the element of surprise Canteval's Munificent was unable to overpower the Venator on its own. With its shield weakening, the Munificent took several direct hits into its engines and, unable to maintain altitude, was sucked into the gas giant's core.\nMeanwhile, the Resolute has sent several LAAT/i with clone reinforcements to help the loyalists regain control of the city. Rynert and his followers tried to hold, but against the combined strength of the Jedi, clone troopers, Denfrandi loyalists and the Wind Raiders they were outmatched.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Taloraan_City",
  "/wiki/Planet/Legends",
  "/wiki/Taloraan/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Orlin_Denache",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Canteval",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Droideka/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/C9-RX0",
  "/wiki/Battle_droid/Legends",
  "/wiki/Nu-class_attack_shuttle",
  "/wiki/Sech_Govlinder",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Resolute/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Denfrandi",
  "/wiki/Wind_Raiders/Legends",
  "/wiki/The_Clone_Wars:_The_Wind_Raiders_of_Taloraan"
 ]
}