{
 "name": "Rynog Asokaji",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Alliance Navy",
      "Club Bwua'tu"
     ]
    }
   ]
  }
 ],
 "content": "Rynog Asokaji was a male Bith and the aide-de-camp of the Admiral Nek Bwua'tu, Chief of the Galactic Alliance Navy. When an assassination attempt left Bwua'tu in a coma, Asokaji at first blamed Chief of State Natasi Daala for the act in retaliation for Bwua'tu's attempt to make a deal with interim Grand Master Kenth Hamner to allow the Jedi Order to launch their StealthXs. Daala merely praised him for his bravery and requested that he ask permission to speak freely with her in the future, and the two came to be on good terms. Asokaji later suspected that the Jedi were behind the attack, although Daala and her Chief of Staff, Wynn Dorvan, remained dubious. Asokaji offered to send 5,000 marines against the Jedi if Daala so wished, but she declined.\nWhen Bwua'tu regained consciousness, Asokaji was delighted to see him again and was one of the few, along with Bwu'tu's uncle Eramuth Bwua'tu, Wynn Dorvan, and Leia and Han Solo, to know that he was still fully functional. Knowing that a conspiracy had targeted him, Bwua'tu feigned brain damage. Brainstorming between Dorvan and Bwua'tu over the recent events, namely the coup that overthrew Daala, led them to deduce that Bwua'tu's replacement, Admiral Sallinor Parova, was a part of the conspiracy. With assistance from Han Solo, Asokaji kidnapped Parova and they imprisonned her in the Jedi Temple. There, Dorvan, Bwua'tu and Asokaji interrogated Parova but she refused to tell them anything. A few moments after they left her, she was killed by members of the Lost Tribe of Sith.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Alliance_Defense_Fleet",
  "/wiki/Club_Bwua%27tu",
  "/wiki/Admiral/Legends",
  "/wiki/Nek_Bwua%27tu",
  "/wiki/Chief_of_the_Navy",
  "/wiki/Attack_on_Nek_Bwua%27tu",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Grand_Master/Legends",
  "/wiki/Kenth_Hamner",
  "/wiki/New_Jedi_Order",
  "/wiki/StealthX",
  "/wiki/Jedi/Legends",
  "/wiki/Chief_of_Staff/Legends",
  "/wiki/Wynn_Dorvan",
  "/wiki/Galactic_Alliance_Marines",
  "/wiki/Eramuth_Bwua%27tu",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Plan_Delta",
  "/wiki/Sallinor_Parova",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)"
 ]
}