{
 "name": "Ryoo_Thule",
 "display_name": "Ryoo Thule",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark gray",
      "dusted with gold"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Naberrie"
     ]
    }
   ]
  }
 ],
 "content": "Ryoo Thule was a Human female from Naboo. She was the mother of Jobal Naberrie, the maternal grandmother of Sola Naberrie and Padmé Amidala, and the great-grandmother of Ryoo and Pooja Naberrie, Luke Skywalker, and Leia Organa.\nShe was murdered by Inquisitor Malorum at Varykino in 19 BBY after the latter threateningly insisted to get more details about Amidala's pregnancy and death.\nRyoo Thule was a female Human from the Mid Rim planet of Naboo. She had a sister and was married to an unidentified man who died many years before the end of the Galactic Republic. From their marriage was born a daughter, Jobal, who had a happy childhood and received a good education.\nThule was good friends with another Naboo woman named Winama Naberrie. The two secretly plotted to marry off their children, Jobal and Ruwee, and were the first to be surprised when they both actually fell in love. The young couple got married in 51 BBY. Winama died in 33 BBY, a year before the Battle of Naboo.\nThule's great-granddaughter, Ryoo Naberrie, was named after her. The name was also shared by a blue and yellow flower that grew near the city of Keren.\nIn 19 BBY, Thule was the overseer of the funeral of her granddaughter Padmé Amidala, as was the custom on Naboo. Feeling great grief at her beloved grandchild's passing, Thule spent the next six months mourning at Translucence Cove in Varykino.\nAfter all these months, Thule finally decided that it was time to return to Theed, as she knew that Amidala would not have wanted her to live in seclusion for the rest of her life. However, Thule had been having a strange feeling ever since she woke up, but tried to comfort herself by thinking that she was only anxious to let go of her grief. It was the only possible explanation why her heart fluttered, or why Amidala felt so especially close to her that morning.\nThule suddenly realized she was not alone in the retreat. A man named Malorum, one of the Empire's Inquisitors, had come to interrogate Thule about Amidala and her mysterious pregnancy. As soon as Thule saw his eyes, she understood what she had been feeling all morning. She knew she was going to die. Eventually, Malorum proved her right. Her hesitation and defiance to his questions led him to deduce that Amidala's offspring had not died. The Inquisitor then proceeded to kill Thule. A short while later, Ferus Olin and Trever Flume arrived in turn at Varykino. With her dying breath, Thule begged Olin to protect her granddaughter's memory.\nMalorum's knowledge of the existence of the Skywalker twins died with him during a lightsaber duel with Olin. He fell to his death inside the Theed power generator when he tried to retrieve his lightsaber that was tumbling down the pit. Olin had watched him struggle in the Force, desperately trying to hold onto his lightsaber, knowing that if he lost it he would be disgraced and would never become a Sith.\nRyoo Thule was a small and sturdy female Human with white hair and dark gray eyes dusted with gold. She had a great sense of family and cared deeply for her relatives. While walking down to Varykino's lake, she could feel the presence of her lost ones, such as her husband and her recently deceased grandchild Padmé Amidala. Thule was devastated when Amidala—to whom she had felt closer than any of her other granddaughters—mysteriously died, shortly after the end of the Clone Wars. The tragedy led Thule to live in isolation for six months.\nThule also seemed to have a certain sense of precognition. On the day of her death, she woke up before dawn with the unsettling feeling that something was wrong, and as soon as she saw Malorum, she knew the Inquisitor would eventually kill her.\nWhen Malorum confronted Thule, he felt that the elderly woman was full of love, strength, and courage. Even though she was deeply afraid of him and already knew what he would do to her, Thule stood up to the Inquisitor and refused to tell him what he wanted to know out of love and loyalty to Amidala.\nThe character of Ryoo Thule was first mentioned in the eightieth issue of The Official Star Wars Fact File, published in 2003. She later made her first appearance in Jude Watson's young reader novel The Last of the Jedi: Death on Naboo, released in April 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Naberrie",
  "/wiki/Parent/Legends",
  "/wiki/Jobal_Naberrie/Legends",
  "/wiki/Sola_Naberrie/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Ryoo_Naberrie/Legends",
  "/wiki/Pooja_Naberrie/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Death/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Malorum",
  "/wiki/Varykino/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Winama_Naberrie",
  "/wiki/Ruwee_Naberrie/Legends",
  "/wiki/51_BBY/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Ryoo",
  "/wiki/City/Legends",
  "/wiki/Keren/Legends",
  "/wiki/Funeral_of_Padm%C3%A9_Amidala",
  "/wiki/Standard_month/Legends",
  "/wiki/Translucence_Cove",
  "/wiki/Time/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Heart/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Trever_Flume",
  "/wiki/Skywalker_family/Legends",
  "/wiki/Twin/Legends",
  "/wiki/Uprising_in_Theed",
  "/wiki/Power_generator/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Unidentified_Naboo_lake",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Precognition/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/The_Official_Star_Wars_Fact_File_80",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/2003",
  "/wiki/Jude_Watson",
  "/wiki/The_Last_of_the_Jedi:_Death_on_Naboo",
  "/wiki/April",
  "/wiki/2006",
  "/wiki/The_Official_Star_Wars_Fact_File_105",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Library_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/Star_Wars_Annual_2009",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/Star_Wars_Episode_I_Journal:_Queen_Amidala"
 ]
}