{
 "name": "Ryso",
 "display_name": "Ryso",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Ryso was a male Human who lived on Ord Mantell as a child during the Cold War between the Galactic Republic and the Sith Empire.\nAs a child, Ryso lived on Ord Mantell in Talloran village during the Great Galactic War. During the Cold War, the Mantellian Separatist Movement declared civil war in an attempt to secede from the Republic, and separatists stormed Ryso's home village of Talloran. The separatists forced the settlers out of the village, destroying many of the buildings and causing them to flee to nearby Fort Garnik.\nThe settlers camped outside of the Republic base, and during this time Ryso suffered from a medical condition or injury causing pain. The symptoms were treatable but the lack of supplies meant it went untreated. A fellow refugee, a female Cathar Yael, managed to steal medical supplies from the Republic when one of Sergeant Hurd's men fell asleep guarding Garnik's most recent medical shipment. After retrieving the supplies the medicine was taken from Yael by a group of separatists who stole the shipment from her before she could distribute the supplies.\nRyso asked Yael for medication for his painful symptoms but was informed that the Cathar had no medicine for him. Immediately after this while the boy was still present, a smuggler and Republic trooper sent to find the lost medication by Sergeant Hurd, confronted Yael about the medicine and its location. Yael persuaded the pair to recover the medicine and return it to her, which they did. Yael then gave Ryso medicine for his pain.\nRyso's only appearance to date is in the BioWare MMORPG Star Wars: The Old Republic as part of the mission \"Mercy\" on Ord Mantell. He is seen when first approaching Yael and during the following conversation players can threaten Ryso's life to persuade Yael to tell them where the medicine is as a dark side option. It is currently impossible for Imperial players to interact with Ryso as there is no way for Imperials to travel to Ord Mantell.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Talloran_village",
  "/wiki/Great_Galactic_War",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Separatist_War",
  "/wiki/Fort_Garnik",
  "/wiki/Cathar/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Hurd",
  "/wiki/Voidhound",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/BioWare",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Yael"
 ]
}