{
 "name": "S%27Shah",
 "display_name": "S'Shah",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serphidi"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Serphidi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Serp"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "King S'Shah was the ruler of the planet Serphidi during the Galactic Civil War. An Imperial-aligned tyrant, S'Shah bucked Serp tradition by circumventing ancient bans upon technology, and turning their yearly jousting competitions into bloodsport. However, S'Shah lost his crown in 3 ABY, when Rebel pilot Luke Skywalker, acting on the behalf of rival challenger Elglih, defeated S'Shah in one of these Doom-Jousts.\nA male member of the reptilian Serp species, S'Shah reigned as King of the planet Serphidi during the era of the Galactic Civil War. S'Shah took the throne on a world that had previously been devastated by generations of war, which had been brought to an end by the unity of all Serps under a single king, the banning of technology, and the outlet of the Serps' violent impulses into yearly jousting contests. As king, S'Shah went against tradition by reintroducing some forbidden technology and integrating into the jousts, turning them into deadly \"Doom-Jousts\" that were proclaimed as the only legitimate way for S'Shah to be deposed as King. And while popular sentiment among most Serps was friendly towards the Rebel Alliance, King S'Shah—who was seen by many as a ruthless tyrant—aligned himself to the Galactic Empire, prompting the Rebels to send several operatives to Serphidi in 3 ABY to overthrow S'Shah and secure the planet's support\nTheir landing went poorly, with one Rebel pilot killed and another, Captain Cinda Tarheel, taken back to S'Shah as a prisoner. S'Shah planned on eating Tarheel after the yearly Doom-Joust, where he was challenged for the throne by an elderly Serp named Elglih Claiming injury, Elglih had his squire, Luke Skywalker—another of the Rebel pilots who had traveled to Serphidi—stand in his place for the joust. An amused S'Shah allowed Skywalker to compete after realizing that he and Tarheel knew one another, but was defeated in single combat. S'Shah feigned surrender and attempted to attack Skywalker from behind with a micro-jolt, but the Human sensed his betrayal and killed S'Shah with his energy lance.\nA autocratic king, S'Shah ruled Serphidi with an iron fist, using the threat of violence to keep his people in line and ensure he held onto his throne. S'Shah backed up these sentiments as a particularly skilled jouster and combatant, one quite confident in his abilities. S'Shah considered himself a gourmet with a refined palate, and enjoyed eating Humans as a particular delicacy.\nS'Shah appeared in Star Wars  64, written by David Michelinie and Michael Fleisher, illustrated by Joe Brozowski and released in 1982.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Serphidi/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Serp",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/King/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Elglih",
  "/wiki/Doom-Joust/Legends",
  "/wiki/Reptile/Legends",
  "/wiki/Species/Legends",
  "/wiki/Berl_(Alliance)",
  "/wiki/Death/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Cinda_Tarheel/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Micro-jolt",
  "/wiki/Energy_lance",
  "/wiki/Human/Legends",
  "/wiki/Star_Wars_(1977)_64",
  "/wiki/David_Michelinie",
  "/wiki/Michael_Fleisher",
  "/wiki/Joe_Brozowski",
  "/wiki/1982"
 ]
}