{
 "name": "Sa%27har_Kateen",
 "display_name": "Sa'har Kateen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Denolm Orr"
     ]
    }
   ]
  }
 ],
 "content": "Sa'har Kateen was a Force-sensitive Twi'lek female who lived during the time of the Old Republic. Separated from her brother Ri'kan Kateen at a young age, Kateen trained as a Padawan of the Jedi Order under Jedi Master Denolm Orr. During a mission to the planet Elom, Kateen's worldview was challenged by Darth Malgus, who convinced the Padawan that the fates of Ri'kan and herself had been unjustly determined by the Jedi. As the Temple of Nul crumbled around them, Malgus killed Orr and left Kateen to fend for herself, urging her to decide her own future.\nYears before the third Galactic War, Sa'har and her brother Ri'kan Kateen were shown to be Force-sensitive at a young age, though Sa'har had a stronger connection to The Force than her brother. The two Twi'leks were soon discovered by Jedi Master Denolm Orr, who took Sa'har as his Padawan but left Ri'kan behind due to his connection to the Force not being strong enough.\nOver the years Sa'har grew into a powerful and trusted Jedi Padawan under her master's wing. She eventually joined Orr's master and a team consisting of Jedi Master Gan Enok, Material Analysis Dr. Mykon Ora, Chief Engineer Rolan Aun and Specialist Tiriz Etto to search for Darth Nul's creations at the planet Elom. By the time they reached the Temple of Nul only Sa'har and Orr were alive.\nAt the temple, Sa'har and her master encountered a Sith Warrior that arrived to get a holocron from a device inside the temple. The young Jedi and her Master proved to be a worthy match to the Sith Warrior, in the middle of their duel, Orr told Sa'har to destroy the machine inside the temple as well as all records of it, but the two were surprised by the arrival of the renegade Sith Lord Darth Malgus, who stabbed the Sith Warrior they were fighting and also attempted to get the holocron.\nAs Sa'har went after the machine, Malgus tried to attack her with his Force lightning, but the Padawan quickly dodged it and made it to the device while her Master fought the Sith Lord. Once at the machine, Sa'har was met with a vision of her past, where she saw how her Master left her brother behind when he took only her as his Padawan. She became overwhelmed with these memories and listened to Malgus talk about the pain and fear the Jedi caused her by keeping the secret of the Force from her brother.\nOrr eventually used the Force to destroy the machine and free Sa'har from its control, but as the young Padawan retrieved the holocron from the machine, she refused to give it to Orr, saying that he could've saved her brother. Both Padawan and Master fought for the holocron, allowing Malgus to recover from the fight and entangle Orr with the Force before striking him down. Back to her senses, Sa'har dueled the Sith Lord for the holocron, but she was unfortunately Force-pushed and was later buried under the rubble of the falling temple by Malgus, who used this opportunity to snatch the holocron from her hands. The Sith Lord left Sa'har to her own fate while he told her that she needed to break free of her cage if she was ready.\nSa'har survived the destruction of the temple and made it out alive long after Malgus left, as the renegade Sith Lord was captured and later imprisoned by the Alliance Commander, Lana Beniko and their reinforcements. While sneaking out of the wreckage, Sa'har saw that the holocron was hidden amid the temple's rubble and was apparently left there by Malgus before being captured, the Padawan then grabbed the holocron with the Force before running away with it.\nAfter escaping Elom with the holocron, Sa'haar seemingly \"rescued\" her brother, Ri'kan Kateen, who was imprisoned by unknown forces which she assumed to be slave traders. Sa'haar had to face Ri'kan's anger towards her as he felt abandoned by her and was less interested in repairing their relationship which led Sa'haar to offer her help to which Ri'kan refused any help for himself but then told her that he knew of someone who needed help. Later Sa'haar travelled with Ri'kan to meet up with Heta Kol and the Hidden Chain.\nEven at a young age, Sa'har was strong with the Force, which prompted her to be chosen by Denolm Orr as his Padawan. Despite only being a Padawan she was able to rival the powers of her master when preventing him from snatching the holocron from her with the Force. Thought she lost her duel against Darth Malgus, Sa'har was able to keep up a fight with the rogue Sith Lord to the point where she made Malgus lose one of his sabers.\nSa'har Kateen was first mentioned in \"Mission Abstract: Investigate link between Darth Malgus and the planet Elom,\" a short story posted on the official Star Wars: The Old Republic website on October 1, 2021. She later featured prominently in Disorder, a cinematic trailer for The Old Republic's expansion Legacy of the Sith. Both the trailer and the expansion were released on February 15, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Denolm_Orr",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ri%27kan_Kateen",
  "/wiki/Youngling/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mission_to_Elom",
  "/wiki/Planet/Legends",
  "/wiki/Elom_(planet)/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/Jedi/Legends",
  "/wiki/Temple_of_Nul",
  "/wiki/Death/Legends",
  "/wiki/Third_Galactic_War",
  "/wiki/The_Force/Legends",
  "/wiki/Gan_Enok",
  "/wiki/Mykon_Ora",
  "/wiki/Rolan_Aun",
  "/wiki/Tiriz_Etto",
  "/wiki/Sith_Warrior",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Lana_Beniko",
  "/wiki/Elom/Legends",
  "/wiki/Heta_Kol",
  "/wiki/Hidden_Chain",
  "/wiki/Mission_Abstract:_Investigate_link_between_Darth_Malgus_and_the_planet_Elom",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/October_1",
  "/wiki/2021",
  "/wiki/Disorder",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/February_15",
  "/wiki/2022",
  "/wiki/All_That%27s_Left",
  "/wiki/Carrick_Station"
 ]
}