{
 "name": "Saarai  (Chagrian)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chagrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith",
      "Darth Krayt's Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Saarai, a Chagrian female, was a Sith apprentice and the daughter of the Sith Lord Darth Wyyrlok, who was the Dark Lord Darth Krayt's Voice and second-in-command of the Empire and One Sith. She was also expected to become the fourth Chagrian to have the name Wyyrlok bestowed upon her. In 137 ABY, after Darth Krayt's apparent death on Had Abbadon—Saarai's father actually murdered Krayt after the latter sustained severe injuries from a battle with a group led by former Jedi Cade Skywalker—Saarai guarded Krayt's stasis chamber in the ancient Sith Lord XoXaan's temple on the planet Korriban, per her father's instructions to not allow anyone entrance. When Saarai was confronted by Darth Stryfe, one of Krayt's Hands who participated in the battle in which Krayt was seemingly killed, she managed to successfully keep Stryfe from entering the chamber. Saarai's father intervened before she could kill Stryfe.\nA few months later, in 138 ABY, Saarai and the One Sith felt the call of Darth Krayt through the Force, revealing that he was alive and not in stasis despite Wyyrlok's claims. After her father openly admitted to usurping Krayt, Saarai left the galactic capital Coruscant per his instructions, because her power had not yet been fully developed. Although her father was slain by Krayt in their confrontation, Saarai continued to serve the Sith Order, even after Krayt himself was killed by Cade Skywalker and the Sith were defeated by the combined efforts of the forces of deposed Emperor Roan Fel, Galactic Alliance Admiral Gar Stazi, and the Jedi Order. After the establishment of the Galactic Federation Triumvirate, Saarai operated as a Sith agent who, under the leadership of Darth Nihl, would infiltrate the galactic governments in an effort to destroy the One Sith Order's enemies from within.\nThe Chagrian female Saarai was born to the Sith Lord Darth Wyyrlok, the third in a line of Chagrian Sith Lords named Wyyrlok, in the time period of the Sith–Imperial War. From her youth, Saarai was instructed on the planet Korriban in the ways of the One Sith Order, whose leader was the Dark Lord of the Sith Darth Krayt, also the Emperor of the Galactic Empire. After Wyyrlok secretly rendered Darth Krayt inactive, Saarai was placed in charge of guarding Krayt's tomb within XoXaan's Temple while her father prepared it.\nWhen a recently revived Darth Stryfe demanded entrance to the tomb, she refused to allow him to enter. Stryfe attacked her, and after a protracted unarmed fight, Saarai overpowered the experienced Sith Lord. Using her considerable Force talents, she literally had his body bending to her will. However, her father came out and ordered her to cease before she could kill Stryfe. Then, he had Saarai return to her duty and let Stryfe enter the Stasis Room so they could discuss Krayt's \"serious condition.\"\nSome time later, Saarai transferred to Coruscant. She was present at her father's side when the resurrected Darth Krayt made his presence and will felt by all Sith through the dark side of the Force. However, once word was received that Darth Krayt was on his way to Coruscant, Darth Wyyrlok convinced his hesitant daughter to flee the planet since her powers were not fully realized. Saarai was not present when Lord Krayt marched into the Temple of the Sith and killed her father in a duel. Months later, after the death of Darth Krayt and the collapse of the Sith Empire, Saarai went into hiding among the galactic populace. She was following the orders of Darth Nihl, successor of Lord Krayt, who ordered the Sith to disperse and infiltrate the various governments throughout the galaxy and await the time for their revenge.\nSaarai appeared to have a close bond with her father and was reluctant to leave him when the resurrected Darth Krayt attacked the Temple of the Sith. She also refused to allow Darth Stryfe to enter Darth Krayt's tomb and despite being a Sith apprentice she was willing to fight him to stop him from entering. It was only after Darth Wyyrlok commanded her to stop using her telekinetic powers that she allowed Stryfe to enter. She remained loyal to the One Sith and, after Krayt's death, continued to serve the new order under Darth Nihl. Her given name in the Sith language meant \"truth.\"\nEven though she was merely an \"unmarked\" Sith apprentice, Saarai was highly proficient in the dark side of the Force. She was highly skilled with telekinesis, being capable of overpowering a Sith Lord as powerful as Darth Stryfe, who had served as both the Fist and a Hand, able to employ the Force to exert pressure on Lord Stryfe's heart, and then use the Force to twist his muscular body.\nSaarai was created by John Ostrander for the Star Wars: Legacy comic series, and was first mentioned by her father, the third Darth Wyyrlok, in the fourteenth issue. She made her first appearance and was first identified in the Legacy in the thirty-fourth issue, which was the first issue of the Storms story arc. She later was featured in Legacy's fiftieth and final issue, and also appeared in the first and sixth issues of the follow-up miniseries Star Wars: Legacy—War. Saarai was drawn by Jan Duursema for all of her appearances in Legacy and Legacy—War. She was mentioned in her father's entry in The Complete Star Wars Encyclopedia, which was released in 2008.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Saarai",
  "/wiki/Nikkos_Tyris",
  "/wiki/Saarai-kaar",
  "/wiki/Jensaarai/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Chagrian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Voice",
  "/wiki/Regent/Legends",
  "/wiki/137_ABY",
  "/wiki/Battle_on_Had_Abbadon",
  "/wiki/Had_Abbadon/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Stasis_Room",
  "/wiki/XoXaan",
  "/wiki/XoXaan%27s_Temple",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/Darth_Stryfe",
  "/wiki/Hand_(One_Sith)",
  "/wiki/Death/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/138_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Assault_on_the_Temple_of_the_Sith",
  "/wiki/Battle_of_Coruscant_(Second_Imperial_Civil_War)",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Federation_Triumvirate",
  "/wiki/Agent/Legends",
  "/wiki/Darth_Nihl",
  "/wiki/Reproduction/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Time/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Youngling/Legends",
  "/wiki/Sith_training",
  "/wiki/Temple_of_the_Sith",
  "/wiki/The_galaxy/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Fist",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_14",
  "/wiki/Legacy_(2006)_34",
  "/wiki/Star_Wars:_Legacy:_Storms",
  "/wiki/Legacy_(2006)_50",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Legacy%E2%80%94War_6",
  "/wiki/Star_Wars:_Legacy%E2%80%94War",
  "/wiki/Jan_Duursema",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/StarWars.com"
 ]
}