{
 "name": "Saarcheen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Saarcheen was a male Wookiee from Kashyyyk. In the second century before the Galactic Civil War, he took part in a dangerous expedition in the Shadowlands with older Wookiees, and he witnessed the untimely death of his best friend Barraak.\nSaarcheen was a male Wookiee, a species of hairy mammals who lived in the wroshyr trees of Kashyyyk. In 185 BBY, he and his friend Barraak were still young pups. They were training to become great warriors under the guidance of Tarfful, an Wookiee teenager who had already gone through his hrrtayyk rite of passage and become an adult. That year, the two friends embarked with their seniors Tarffull, Chewbacca and Ralrracheen on a dangerous journey in Kashyyyk's Shadowlands. Those were the deepest, densest part of the Kashyyykian forest floor on the planet Kashyyyk, and were inhabited by savage beasts.\nWhile there, the group encountered a group of slavers who sought to ensare live Wookiees. Saarcheen was caught by Lix, rat-like individual, but was rescued by Chewbacca. However, the encounter escalated into more violence, and Saarcheen saw his best friend Barraak die while trying to fight Lix. Crushed with grief, Saarcheen was taken back to the higher levels of the forest by Ralrracheen, while Chewbacca and Tarfful stayed in the Shadowlands to fight the slavers.\nSaarcheen was a blue-eyed Wookiee pup. He sported a thick coat of silver fur with darker markings on both his chest and the top of his head. While still a youngling by Wookiee standards, he was eager to prove his worth. He was also a devoted friend, showing respect to Tarfful and sharing a great complicity with Barraak. When the latter died, Saarcheen burst into tears.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Shadowlands/Legends",
  "/wiki/Barraak",
  "/wiki/Species/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Mammal/Legends",
  "/wiki/Wroshyr_tree/Legends",
  "/wiki/185_BBY",
  "/wiki/Pup_(Wookiee)",
  "/wiki/Tarfful/Legends",
  "/wiki/Hrrtayyk_ceremony/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Ralrracheen",
  "/wiki/Tree/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Lix",
  "/wiki/Rat/Legends",
  "/wiki/Death/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Breast/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Star_Wars_Adventures:_Chewbacca_and_the_Slavers_of_the_Shadowlands",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Secrets_of_Kashyyyk",
  "/wiki/Star_Wars_Gamer_4"
 ]
}