{
 "name": "Sabine_Wren",
 "display_name": "Sabine Wren",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Krownest",
      "Mandalore"
     ]
    },
    {
     "name": "Born",
     "values": [
      "21 BBY",
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "52 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later multicolored"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "House Vizsla",
      "Clan Wren",
      "Clan Wren"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "Spectres",
      "Spectres",
      "Mandalorian resistance"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kanan Jarrus"
     ]
    }
   ]
  }
 ],
 "content": "Sabine Wren was a human female Mandalorian warrior and revolutionary leader during the early rebellion against the Galactic Empire. Her artistry during the rebellion inspired the symbol of the Alliance to Restore the Republic, and her claim over the ancient Mandalorian weapon known as the Darksaber made her a symbol to Clan Wren and the hopes of freeing her people's homeworld of Mandalore from the rule of the Empire.\nPrior to becoming a rebel, Wren was a cadet at the Imperial Academy of Mandalore. She built weapons she believed would be used for peace but were instead used against her family and her people. Wracked with guilt, Wren left Mandalore and was branded a traitor by the Empire and her mother, Ursa Wren, leader of the clan. Wren worked as a bounty hunter alongside her friend Ketsu Onyo before being recruited by Captain Hera Syndulla and the Jedi Kanan Jarrus to join their rebel crew aboard the starship Ghost. Together, the crew fought against the Empire and used Wren's art as a symbol of hope. They became part of a larger rebel movement, with Wren's work continuing to inspire the fledgling rebellion.\nIn 2 BBY, while hunting down the rogue Sith Lord and former ruler of Mandalore Maul, Wren discovered the Darksaber on Dathomir. She initially wanted nothing to do with it, but Jarrus and Fenn Rau, a Mandalorian Protector of Concord Dawn who joined the rebellion, convinced her to wield it so she could unite the Mandalorian people and bring them into the rebellion. Wren returned to her family and convinced them of the Empire's treachery, helping to kill Gar Saxon, the Imperial Viceroy of Mandalore, in the process. After aiding her family in the Mandalorian Civil War, Sabine returned to aid the Rebel Alliance's struggle against the Empire. Wren and the Ghost Crew eventually returned to Lothal. During this time, Jarrus was killed, but she and the other members of the Lothal resistance group went onto fight to liberate the planet. While they succeeded, it was only after her friend Ezra Bridger disappeared into hyperspace with the Star Destroyer Chimaera. After the Empire's fall in the Battle of Jakku, Wren and Ahsoka Tano launched a search for their missing friend.\nA human female, Sabine Wren was born on the planet Mandalore in the waning years of the Galactic Republic, into Clan Wren of House Vizsla. Her mother Ursa was a member of Death Watch during a time when Mandalore had fallen into chaos after the collapse of the New Mandalorian government, near the end of the Clone Wars. She was raised in part on Mandalore but also considered Clan Wren's ancestral home of Krownest to be her homeworld. Trained from an early age in Mandalorian warrior culture, Wren forged her distinctive armor with her family, and also inherited her Nite Owls helmet from someone whose identity she was reluctant to reveal. Her father, artist Alrich Wren, took Sabine to see the statue of Tarre Vizsla while her younger brother Tristan Wren was only an infant.\nAfter the Clone Wars ended, the Galactic Empire established a presence on Mandalore and opened an Imperial Academy, which Wren attended as a Imperial cadet. As a youth, she believed in the Empire and, even as it put her through some \"rough stuff,\" followed its orders blindly. During her time at the Academy, she studied the tactics of Twi'lek Resistance leader Cham Syndulla and Mandalorian Protector leader Fenn Rau during the Clone Wars. This would eventually put her at odds with the Imperial establishment there, and led to a nightmarish experience.\nAs a young and idealistic Imperial cadet, Sabine built an Arc Pulse Generator that she nicknamed the \"Duchess,\" which reacted with the beskar alloy inside the Mandalorian armor, incinerating the armor and disintegrating their wearers. The weapon was regarded by many Mandalorians as an abomination because it turned their armor against them; Mandalorian armor held a sacrosanct place in Mandalorian culture since it was passed down from generation to generation. As Wren witnessed the Empire subjugating Mandalore, she was wracked with guilt at her own role in helping the Empire build the weapon used to oppress her people.\nWhen she spoke out against the Empire, Sabine's mother, her father, and her brother sided with the Empire and was banished. Traumatized and estranged from her family, Sabine escaped the Imperial Academy with the help of her friend, Ketsu Onyo, and deserted the Empire. Sabine's decision to renounce the Empire had serious ramifications for her family. Her father became a hostage of Viceroy Gar Saxon, the Emperor's Hand and the Imperial puppet ruler of Mandalore. Her mother Ursa was forced to prove her clan's loyalty to the Empire while her brother Tristan was forced to serve in Saxon's Imperial Super Commandos so that the family could remain in Saxon's favor. Before fleeing Mandalore, Sabine also destroyed her weapon. However, the Empire was able to use her research to build another arc pulse generator.\nDuring her escape from Mandalore, Wren received no small amount of help from Wookiees, for which Wren felt she owed them a debt. Wren and Onyo then became bounty hunting partners; the two were like sisters, though Wren was the softer of the two. Together, they dreamed of joining the criminal organization Black Sun, all the while doing things just for money and caring only about themselves in an attempt to survive. Ultimately, they parted on bad terms due to Onyo getting \"greedy\" and leaving Wren for dead.\nAt some point, while on the run from an Imperial attempt to capture her after she had left the Academy, a man named Janard saved her life by knocking over a stack of freight containers to block the Imperials' path while she escaped. Eventually, the brutal Imperial crackdown on her homeworld and the consequent loss of her family pushed Wren into open rebellion.\nBy the age of 16, Wren had joined a rebel cell on the planet Lothal consisting of the Twi'lek captain Hera Syndulla, the former Jedi Padawan Kanan Jarrus, the astromech droid C1-10P \"Chopper,\" and the Lasat warrior Garazeb Orrelios. The Spectres operated from the modified VCX-100 light freighter Ghost. Giving Wren a second chance in life, the Spectres regularly raided the Imperials for supplies which they distributed to the needy and sabotage missions.\nOn one such mission, Wren  was tasked with creating a diversion that would allow the Ghost to escape. She infiltrated a TIE fighter landing platform in Lothal's Capital City and spray-painted graffiti of a violet starbird onto a TIE fighter wing. She was then noticed and hunted down by stormtrooper TK-626, his captain, and four others. Wren eventually detonated a paint bomb, creating a colorful explosion that left the stormtroopers stunned and splattered in blue paint, but alive, and strode off into the city amid grateful locals, an event that earned her the nickname \"The Artist\" among local stormtroopers. Wren, or an individual closely matching her description, was on Lothal's most-wanted list for wreaking havoc on an Imperial airfield.\nIn their next mission to steal Imperial crates, Wren, Jarrus, and Orrelios went to the main square of Capital City where a group of stormtroopers led by Supply Master Cumberlayne Aresko were transferring several crates containing food and blasters to the Imperial Portal. At a hand signal given by Jarrus, Wren threw a hand grenade at one of the Imperials' 614-AvA speeder bikes, throwing them into disarray. Jarrus and Orrelios then took advantage of the chaos to ambush the Imperials, but a local pickpocket Ezra Bridger stole one of the speeders. Wren however stole back one of the crates and returned to the Ghost.\nAccompanied by Bridger , the Ghost crew fended off a few TIE fighters and went to Tarkintown, where they distributed the stolen food crates; they also sold the stolen blasters to the Cikatro Vizago to obtain information about the location of an Imperial Gozanti-class cruiser ferrying several enslaved Wookiee prisoners. Subsequently, they commenced the mission and infiltrated the Gozanti, unaware that Imperial Security Bureau Agent Kallus had set a trap for them. He and several stormtroopers were hiding in the transport compartment, ready to apprehend the rebel boarders. After learning of this deception, Wren and Chopper disabled the ship's artificial gravity systems for two minutes, which temporarily slowed down Kallus and his stormtroopers and allowed for their escape, except Bridger, who was captured by Kallus and taken aboard his Imperial I-class Star Destroyer, Lawbringer. As the Ghost fled into hyperspace, Sabine detonated the explosives she had left behind, destroying the Gozanti cruiser.\nUpon realizing that Orrelios had left Bridger behind, the Ghost crew decided to rescue the boy, though by the time they arrived in the Star Destroyer's hangar bay, Bridger had escaped his cell and learnt that the Imperials were transporting the Wookiee slaves to the spice mines of Kessel. Using the information, the Ghost traveled to Spice mine K76 and Wren assisted Jarrus and Orrelios in attacking the Wookiees' stormtrooper guards while Bridger freed the prisoners, a skirmish during which Jarrus revealed himself as a Great Jedi Purge survivor. Ultimately, they managed to liberate the Wookiees and escape in a shipping container that was ferried by the Ghost; later, they parted when the Wookiees boarded an Auzituck anti-slaver gunship. Yet, the rebels were joined by Bridger, who would train under Jarrus as a Jedi.\nSince the crew of the Ghost was running low on fuel and supplies, they decided to steal a weapons shipment from a spaceport on Garel to sell it to Vizago before it fell into the hands of the Empire. For the mission, all but Syndulla boarded Star Commuter 2000 shuttle ST-45 and arranged for Imperial Minister Maketh Tua to rely on Wren's translating skills in her negotiations with Aqualish arms dealer Amda Wabo, by preventing Tua's borrowed droids, R2-D2 and C-3PO, from helping her. Wren offered her services as a translator and asked Wabo tell her the weapons' location in Bay 7, but deliberately mistranslated this as \"Bay 17\" in order to mislead Tua. After disembarking, Wren and the crew headed to Bay 7 where they discovered that the shipment was an T-7 ion disruptor rifles.\nBefore the rebels could finish loading the contraband weapons onto the Ghost, piloted by Syndulla, they were confronted by Tua and several stormtroopers. They were accompanied by C-3PO and R2-D2, who during the confrontation stowed away in the Ghost; unbeknownst to the rebels, the two droids were on a secret mission to prevent the Imperials from taking the weapons. Returning to Lothal, the rebels attempted to sell the rifles to Vizago, but before they could complete the transaction, the two parties were interrupted by the arrival of Kallus, two AT-DP walkers and several stormtroopers. While Vizago fled, Jarrus refused to let the weapons fall into Imperial hands and ordered Wren to destroy them; she, at R2-D2's suggestion, overloaded the disruptors and fired them at the stormtroopers instead. Yet, forced to escape, they left on the Ghost, after which they returned the stowaway droids to their owner, Bail Organa. He never identified himself but rewarded the rebels for returning them.\nSometime later, while Bridger was running down Chopper in the halls of the ship, he stopped by Wren's room to offer her some \"inspiration\" for her artwork although she did not express any interest. Soon afterward, she was inspired by Chopper's prank to Orrelios and Bridger  and made a graffiti of it in their quarters, much to their embarrassment.\nFollowing a HoloNet transmission from Senator-in-exile Gall Trayvis that announced that Jedi Master Luminara Unduli was still alive but imprisoned at the Spire, Jarrus decided to mount a rescue mission for Unduli and told the crew to prepare for the operation. Wren, for her part, studied the schematics of the Spire, and while en route to the Stygeon system, explained that the prison was impregnable and that they had never faced anything as secure as the Spire's defenses. Despite the odds, the rebels continued on their way to Stygeon Prime and left Chopper to look after the Ghost in orbit, whereas the rest descended on the Phantom. Upon arriving, Wren and her comrades landed on the prison's landing platform and overpowered four stormtroopers who were guarding the facility's entrance, while Syndulla awaited aboard the Phantom.\nAfter entering the prison, Wren accessed a computer and discovered that Unduli was held in an isolation cell in the Spire's lower levels, which contradicted her schematics. Jarrus then devised a backup plan in which Wren and Orrelios were to guard the turbolift while he and Bridger ventured to Unduli's cell. Meanwhile, Wren discovered that the Empire was jamming their signal and quickly deduced that they had stumbled into a trap and decided to find another escape route, disabling the lifts along the way to slow down Imperial reinforcements. While fleeing through the complex, Wren and Orrelios encountered Jarrus and Bridger, who were fleeing the Grand Inquisitor.\nAfter dodging several closing blast doors, the four entered an empty hangar bay, where Bridger and Jarrus used the Force to open the hangar's outer doors. However, they encountered numerous stormtroopers and parked TIE fighters waiting for them on the other side. During the ensuing skirmish, Syndulla arrived in the Phantom accompanied by a large swarm of tibidees. With the Inquisitor and his troops preoccupied, Wren and her comrades managed to escape into hyperspace.\nLater on, during a mission to destroy a massive kyber crystal, Wren along with Orrelios and Chopper kept a watch over Bridger while he infiltrated Lothal's Academy for Young Imperials to steal a decoder containing the shipment's location. While Chopper infiltrated the Academy disguised as an Imperial astromech droid, Wren and Orrelios waited outside the Academy to evacuate Bridger once he had accomplished his mission. When he managed to secure the decoder with the assistance of fellow cadet Zare Leonis, Bridger passed the device to Chopper who then gave it to Wren; she, in turn, transmitted the crystal's coordinates to Jarrus and Syndulla, who then intercepted and destroyed the Imperial convoy transporting the crystal. Wren then made arrangements to pass it to Leonis' friend Merei Spanjaf, who needed it to hack into the Imperial data network to find Leonis's sister, Dhara. Afterwards, as requested by Bridger, Wren and Orrelios staged a diversionary attack on the Academy the following day so that he could escape with Jai Kell. As planned, Wren and Orrelios attacked the academy, allowing Bridger and Kell to reunite with them and, together, return to the Ghost.\nDuring the course of a mission provided by Syndulla's mysterious contact \"Fulcrum,\" Wren along with Bridger and Syndulla were on the Phantom when it was attacked by several TIE fighters. Distrustful of the reliability of Fulcrum's intel, Wren questioned Syndulla for more information about her source, leading to a rift between the two. Not content with being kept in the dark, Wren interrupted Jarrus and Syndulla's conversation in the Ghost's cockpit; Jarrus, however, told her that he trusted \"Fulcrum\" because Syndulla trusted in her contact, prompting Wren to accompany Syndulla on a supply run to Fort Anaxes at the Anaxes asteroid belt, where they were supposed to meet \"Fulcrum.\"\nAs the two departed on the VCX-series auxiliary starfighter and landed on PM-1203, they found the crates ready for them to transport and no sign of \"Fulcrum,\" and Wren apologized to Syndulla for her attitude, explaining that she simply wanted to be trusted by Syndulla and Jarrus and that she was not walking into another nightmare as the one she had experienced at the Imperial Academy. Syndulla assured Wren that they did trust her and, following rebel protocol, simply asked her to have faith. Before Wren could answer, the two were attacked by fyrnocks. After deducing the creatures could not tolerate light, they loaded all the supplies onto the Phantom and tried to take off, only to find that Bridger, Orrelios, and Chopper had not finished the shuttle's fuel tank repairs, leaving them stranded.\nAfter Syndulla contacted the rest of the crew for help, Wren devised a plan to use rhydonium explosives to keep at bay the creatures should the sunlight disappear. However, they quickly ran out of explosives and, when they were cornered and forced to get atop the Phantom, the Ghost came to their rescue. Once safely aboard the freighter, Syndulla assured Wren that she trusted her and promised she would eventually understand the cause they were fighting for, and Wren to try and trust her.\nFollowing a raid on an Imperial supply yard, the crew was in need of parts to repair the Ghost and so, went to Osisis Station in the Regani sector. Hoping to obtain the parts from long-time-\"associate\" Galus Vez's black market operation, the team met with the Besalisk, but as the Empire had been doubling their inspections since their last visit, he refused to the transaction and challenged Syndulla to a race in Fool's Run. Although she won, Vez tried to retaliate by handing them over to the Empire. However, on Jarrus' orders, Wren and Orrelios took out one of Vez's cargo ships and placed explosives on another two. Threatened into cooperation, Vez gave the parts to the rebels and the Ghost departed after Wren managed to leave a starbird graffiti stencil in the station's outer hull.\nWhile Orrelios and Jarrus were away to destroy on a mission an Imperial transmission center with the Phantom, Wren, Syndulla, Chopper, and Bridger remained on the Ghost. However, an Imperial showed up and attacked them, prompting the rebels to defend themselves and Syndulla to enter an ion storm to lose them. Manning the nose turret, Wren destroyed two TIE fighters before the storm took the Ghost's systems down. In the ensuing repairs, Wren fixed the targeting systems and when Bridger was done with his part, she was able to destroy a Gozanti cruiser, and the Ghost was able to escape the storm and rendezvous with Orrelios and Jarrus.\nDuring a mission to swipe the Lothal Academy's new recruits, Wren heard about a slave trading operation on Oon and, after leaving a graffiti calling card so that the rest of the crew knew where she was, let herself be captured for a self-imposed mission. Wren put little resistance but her spirit earned her the recommendation of the captor to his employer, MaDall; taking the suggestion, the Zygerrian made of Wren her personal slave and outfitted her with a shock collar. That night, while MaDall was asleep, Wren sneaked away to reconnoiter the location, but a slaver captured and returned her to MaDall. While her master was again asleep, Wren made a painting of the Zygerrian woman, deactivated her collar and saw that her attempts had inspired a rebellion among the slaves. Wren then engaged in a electro-whip duel with MaDall and defeated her, after which she waited for the Ghost to arrive. Agreeing to relocate the freed slaves, Jarrus and Syndulla let MaDall free, and Wren suggested her that she could fight against the Empire.\nContacted by \"Fulcrum,\" the Ghost crew was to pick up supplies on Kaller, where crates were ready and waiting for them, for the Tarkintown refugees. Wren and the team arrived at the coordinates where the crates had been waiting for them but found them empty. Furthermore, the provincial governor, Gamut Key, and his constabularies arrived at the scene, for they had received a tip that smugglers were using the area as a drop point and demanded that they let him search the ship. With nothing to hide, Syndulla allowed them; before long, Key and his men left them to their devices. Instead of leaving empty-handed, the team decided to track the shipment themselves. Once they reached Plateau City, Jarrus decided to split the team up to cover more ground, and Wren went to search with Orrelios.\nEventually, Wren and the others learned from Chopper that Jarrus had been stabbed in the back and had passed out from blood loss, and quickly moved him to a medcenter where he was put into a bacta tank. As they waited for him to regain consciousness, Imperial forces surrounded the medical facility and demanded that the rebels surrender, and later, erupted into the building. Protecting Jarrus, they fought the stormtroopers even as they threatened to overwhelm them.\nOn Empire Day, Wren and her comrades visited Old Jho's Pit Stop, where they learned that the Empire had launched a manhunt for a Rodian, and where Jarrus decided to sabotage the Empire Day celebrations in Capital City. Though Bridger refused, Wren and the rest of the team went to the Imperial parade. During the operation, Wren and Orrelios distracted the crowd and Imperial personnel by throwing fireworks into the sky, while Jarrus planted a detonator on the newly unveiled TIE Advanced v1 prototype on display. Following the explosion, the rebels escaped, but as Syndulla could not extract them with the Ghost, Wren and Jarrus followed Bridger to his old residence, while Orrelios rendezvoused with Syndulla. At Bridger's family home, however, they found the fugitive Rodian, Tseebo, who had once been a friend of Bridger's missing parents.\nWren then noticed that Tseebo was wearing an AJ^6 cybernetic implant and learned that it carried invaluable information on Imperial Military secrets. She also took a holodisk that Bridger has left, before Jarrus decided to smuggle the Rodian off Lothal. Together, Wren and Jarrus stole an Imperial Troop Transport. Wren drove the transport through the city's main gate in spite of the Imperial lockdown  and until they were extracted by Syndulla in the Ghost. However, the freighter was soon attacked by the Grand Inquisitor's TIE squadron, an attack during which Wren and Bridger learned that Tseebo knew the fate of his parents, and that the Inquisitor had placed an XX-23 S-thread tracker on the Phantom. Jarrus then decided to use the Phantom and lure the Inquisitor to Fort Anaxes, in Bridger's company.\nBefore they left for the asteroid, Wren tried to convince him to talk to Tseebo about his parents, but as he declined out of resentment towards Tseebo, Wren opted to repair the holodisk while he was away. As the waited for their return, Wren and Orrelios stayed aboard the Ghost while Syndulla and Tseebo boarded Fulcrum's corvette that would take him into hiding. After Bridger and Jarrus returned from Anaxes, Wren gave the boy the holodisk  she had salvaged from his home as a birthday present.\nSometime later, Bridger showed Wren the TIE fighter that he and Orrelios had stolen. While she gave it a paint job, their activity delayed Bridger in his Jedi lesson with Jarrus. After their venture to a Jedi Temple, Bridger began to build his own lightsaber; for its construction, Wren supplied him modulation circuits and an energy gate, and was present when he ignited the lightsaber for the first time.\nAfter Orrelios  bet Chopper and lost him to Lando Calrissian in a game of sabacc, Jarrus brought Calrissian to the Ghost as he had agreed to a deal: in exchange of smuggling some cargo past the Lothal Imperial blockade, Calrissian would pay the team and return the droid. Although Syndulla was furious over the arrangement, she nonetheless agreed to the offer. As they departed Lothal and were in hyperspace, Calrissian spotted some of Wren's art painted inside the ship and mentioned his familiarity with the artist Janyor of Bith, who happened to be one of Wren's favorite artists. Wren, pleased that her art was both appreciated and understood for a change, offered to show him more of her art.\nAfter the Ghost docked with Merchant One and Syndulla traded herself as a slave to crime lord Azmorigan according to Calrissian's plan, they obtained Calrissian's cargo. The smuggler and Wren welcomed Syndulla when she returned to the Ghost in one of the Merchant's escape pods, and then went to see what Calrissian's cargo was—a puffer pig—, only to find that Orrelios had scared the creature. The pig had inflated to more than three times its normal size, blocking their way to the cockpit, and forced Jarrus to pilot through the blockade and land near Calrissian's estate. However, the Ghost crew and Calrissian were surprised to find a resentful Azmorigan and his men waiting for them. In the ensuing skirmish, the rebels managed to scare Azmorigan off. The rebels, in turn, left Calrissian when it seemed he would not pay them; yet, it was because he knew that Chopper had taken a fuel canister from him.\nDuring a relief mission for Tarkintown, Wren and the rebels delivered several crates of foodstuff to the settlers; unbeknownst to them, the food had been poisoned by Kallus, prompting those who had eaten to become ill, among them Mindiz, for whom Orrelios had a soft spot. Although they were planning to obtain the medicine from Capital City, Orrelios left on his own and prompted Wren and the others to go help him at a medical facility. After obtaining a antidote for the Tarkintown settlers, they found Orrelios at Kallus' mercy, they intervened and engaged in a firefight with the Imperials. After retreating aboard the Ghost, they distributed the medicine and saved the settlers, including Mindiz.\nWren along with Orrelios and Chopper took part in one of Bridger's Jedi training sessions, so that he learned to redirect blaster fire at a specific target; instead, he had a vision of them fighting alongside Senator-in-exile Gall Trayvis. Following the training session, the Ghost crew received a transmission from Trayvis telling them to meet at the Lothal Lothal City Capitol Building. After Bridger confirmed an Imperial operation with his friend Zare Leonis, Wren and her comrades decided to sneak into the building through the sewers in order to warn Trayvis. Per Jarrus' orders, Wren and Orrelios went to the rooftop to provide cover fire to Syndulla, Jarrus, and Bridger's meeting with Trayvis.\nYet, during the meeting, they were ambushed by Kallus's forces, prompting Wren and Orrelios to activate smoke bombs to cover their escape, with Wren throwing a thermal detonator once they did. To evade their Imperial pursuers and protect Trayvis, they fled down the sewers and split into two groups: Wren traveled with Orrelios and Jarrus to provide a distraction to their pursuers, while Bridger and Syndulla accompanied the fugitive senator, who revealed his loyalty to the Empire and attempted to kill Bridger and Syndulla. Once he was overpowered by her, the rebels met up and managed to exit the sewers after Jarrus used the Force to temporarily stop a large circular fan. After reuniting with Chopper at the manhole, they fled back to the Ghost.\nSometime afterward, a Clawdite seeking to collect the bounty that the Empire had put on their heads infiltrated the Ghost. After Chopper was attacked, the intruder knocked Wren out and impersonated her, but when the crew discovered the real Wren, the Clawdite started a firefight and changed her appearance to that of Bridger's until Orrelios attacked it. Ultimately, it was Bridger who stunned the impersonator, whom the crew dropped on a moon and left.\nLater on, Wren and Chopper intruded into the Lothal Imperial Academy to destroy a weapons cache. Hacking the academy's security system to get the access code, the two got past the main door, but Chopper forgot to zap one of three guards, letting the third to set off the alarm. During the pursuit, Wren and Chopper made the \"escape through the lift hatch\" trick and made their way into the main weapons area. As she proceeded to plant the charges, she was surprised by Dunum, who held her at gunpoint until he was stunned by a probe droid, betrayed by fellow Imperials, Aresko and Myles Grint. Wren then finished with the charges and, after Chopper made a hole in the wall, she sent the pick-up signal to Orrelios, who extracted them on a X-34 landspeeder. She then detonated the charges, damaging the Imperial Complex.\nNot too long after, Wren participated in a raid near Jalath with Bridger and Jarrus. Successful in their endeavor, they returned to the Ghost to find that Senator Trayvis had publicly declared his loyalties to the Empire and had condemned them as terrorists in the HoloNet. To counter his claims, Jarrus decided to transmit their own message to the people of Lothal and tell the truth about the Empire. After Wren, Bridger, and Jarrus went to Imperial Command Center for some reconnaissance, a dwarf probe droid caught glimpse of them alerting Grand Moff Wilhuff Tarkin of their presence. Unaware of the trap, the rebels continued with their mission, and Wren prepared a data spike for Chopper to upload it into the tower's computer core. During the operation itself, she distracted the stormtroopers thereby ramming her Undicur-class jumpspeeder into a gun turret while Orrelios hijacked the other one to destroy the last remaining turret, enabling Jarrus and Bridger to bring Chopper as Wren eliminated the remaining troopers inside the tower.\nOnce he installed the spike, Wren worked to have the transmitter operational, just as Imperial reinforcements arrived. Once she got a signal, Jarrus ordered them all to take the tower's lift to meet Syndulla on the Phantom at the top. On Jarrus' orders, they were forced to leave without him and return to the Ghost, from where Bridger was the one to give their message to Lothal and the surrounding systems before the tower was destroyed by Tarkin. Distressed by Jarrus' capture, the next day, they vowed to rescue him and hijacked an AT-DP walker on patrol in an attempt to hack into the Imperial data network to find his location, only to find that the network was down.\nOnce they retreated to the Ghost, Syndulla received word from \"Fulcrum\" that they were to stop their search for Jarrus for the greater good of the rebellion, and in turn, forbade her crew from continuing the effort. However, Wren, Chopper and Orrelios Bridger disobeyed her collaborated so that Bridger could make a deal with Cikatro Vizago: the Devaronian told him that the Imperials were using courier droids due to the communication tower's destruction. Though Syndulla discovered their ruse, she was convinced with Bridger's plan to use Chopper to infiltrate an Imperial communications ship and obtain Jarrus' location. For the mission, Wren disguised Chopper as an Imperial courier with a paint job and, along with Orrelios, abducted 264 so that Chopper could take his place. Their mission a success, they learned that Jarrus was to be transported to the Mustafar system aboard the Sovereign.\nSubsequently, Wren and her comrades stole Transport Ship 63378 so that they could get close to the Imperial fleet over Mustafar. For the operation, Wren also outfitted Bridger and Orrelios' stolen TIE fighter with EMP grenades to disable the Sovereign with a pulse detonation. Leaving Chopper to guard their stolen cruiser, Wren and the rest boarded the Star Destroyer and made their way to Jarrus' cell, until they were forced to separate with Bridger going alone to free Jarrus from his cell. Meanwhile, Wren had the idea to use their TIE fighter to escape, just as the Sovereign's destruction started due to its power core being destroyed in the aftermath of Jarrus' duel with the now-dead Grand Inquisitor. Soon joined by Jarrus and Bridger in the Inquisitor's TIE Advanced, the team escaped the derelict vessel, only to be pursued by a swarm of TIE fighters. They were only saved when Chopper arrived with the Phoenix Squadron. Docking their TIEs with Chopper's ship, they made the jump into hyperspace and returned to the Ghost, where Wren and her comrades learned from Syndulla that they were part of a larger rebellion and Fulcrum's identity as Ahsoka Tano.\nLater on, Wren along with Orrelios and Bridger participated in a mission to rescue Zare Leonis. Earlier, the crew of the Ghost had picked up Zare's girlfriend Merei Spanjaf, her parents Gandr and Jessa, Leonis' parents Leo and Tepha, and their nanny droid Auntie Nags at the edge of the Garel system as part of an arrangement with the Ithorian tavern keeper Old Jho to deliver them into hiding. After Merei discovered that Leonis had been exposed as a traitor and was facing trial, she successfully convinced Sabine and her two rebel companions to help rescue Leonis.\nWithout seeking Syndulla's permission, Wren and her companions traveled with Spanjaf and Jessa to the planet Arkanis. They landed on the roof of Area Null, a secret Imperial facility that was connected to the Arkanis Imperial Academy. Making their way downstairs, Sabine and her companions encountered Zare and another prisoner named Beck Ollet, who had already managed to free themselves and were planning to rescue Zare's sister Dhara, who was also held in Area Null. Wren and Orrelios took Jessa down to the main computer node to lock Imperial reinforcements out of the facility and the elevators. Wren instructed Spanjaf to slice into Area Null's network and find Dhara. The rescue mission was a success. Wren and her companions' reunited both Zare and Dhara with their parents escaping back to Garel before TIE fighters arrived.\nSometime later, after stealing food from an Imperial vessel and Thrad Senator Nadea Tural's rescue by Syndulla, her presence aboard the Ghost attracted Imperial attention before long. Following an effective attack by TIE fighters that took out the Ghost's shields and hyperdrive, they were promptly boarded by Commander Earll's forces, who intended to retrieve Senator Tural. During the skirmish, Wren and Orrelios were stunned, leaving Jarrus and Bridger to clear the ship from troopers after Tural's intervention, and Syndulla to make the escape to Camson, where they parted ways with Tural.\nWhen Wren was informed that her old friend Janard, who had given her intel on Imperial activity every now and then, had been captured by the Empire, she set out to rescue him as she felt she owed him and was willing to do anything to save him. Accompanied by Syndulla and Tano, they managed to locate Janard's transport on the aquatic planet of Quila. Hit by an asteroid, the cruiser had crash-landed and sent a distress signal that they followed. While Syndulla remained on the Ghost, Wren and Tano changed into sub-aquatic gear and dived in to enter the sinking Imperial vessel. Once inside, they tried to reach the detention cells through the wreckage, when an eel attacked Wren and disconnected her oxygen tubes. Tano saved her and shared some of hers before going to the empty cells. Refusing to give up, Wren continued their search in the non-inundated areas and eventually found Janard. After their reunion, the three went to the bridge, only to find Imperial opposition. In the skirmish, Janard was shot by a stormtrooper and died in Wren's arms, as he told her to carry on fighting the Empire. As they got out of the sinking vessel, Syndulla picked them up and went to reunite with the fleet.\nUpon joining Commander Jun Sato's Phoenix Squadron and after a while of not returning to Lothal, Wren and her comrades took part in a mission to steal shield generators from an Imperial convoy. During the skirmish, Wren manned the Phantom and used its armament to liberate the supplies from one of the Imperial vessels so that Syndulla could secure them, after which Wren docked the Phantom in the Ghost. Once away from danger, the Ghost crew took on another mission: to extract the defecting Minister Maketh Tua in exchange for Imperial secrets. Wren and her comrades departed for Lothal aboard a Star Commuter 2000 to avoid detection and, leaving Orrelios and Chopper to guard the transport, the rebels went to rendezvous with Tua before she boarded the Sentinel-class landing craft that would take her to Tarkin.\nHowever, Kallus had set up a trap for them, by rigging the Minister's shuttle to explode once she entered, and laid the blame of Tua's death on the rebels. With the failure of their mission , the Ghost crew was forced to retreat into hiding in Bridger's former residence. When it, too, was attacked, they deduced the Imperial Complex's forces were stretched thin due to the manhunt and infiltrated its Armory. After Wren noticed unguarded 49-v99 Deflectors, they were in the process of loading them to a vacant shuttle when they were accosted by Darth Vader. Through a team effort, they managed to knock down two walkers over him, but as he survived unscathed, Wren tried to earn Jarrus and Bridger time to board their stolen shuttle, and took two shots at the Dark Lord of the Sith with her pistols, but he deflected them back to her.\nAs her armor shielded her from the blaster bolts, they escaped aboard the shuttle  and contacted Calrissian for assistance. He agreed in exchange for half their shield generators and had W1-LE assist in their escape arrangements. At his estate, Wren programmed several masking transponders to replicate their stolen shuttle's signal; with them, they passed through the blockade safely  and rendezvoused with the Phoenix fleet. However, Vader alone attacked with his TIE Advanced, causing extensive damage to Phoenix Squadron and the Phoenix Home. With the fleet defeated and Lothal under siege, the Phoenix fleet and the Ghost chose to use Garel temporarily as its new base of operations, using multiple spaceports to hide their ships.\nFollowing the incident, Wren dyed her hair once again and gave her armor a new paint job. For its part, the Rebel network faced a shortage of bases and facilities, and so, Ahsoka Tano sent the Ghost crew to meet with an old friend of hers, who might know where to find such bases, on Seelos. Upon arriving in the Seelos system, Syndulla and Chopper stayed behind on the Ghost to repair the ship, while the others approached Tano's friend with the Phantom in the desert below. Using the head of an old tactical droid, they located him in an antiquated AT-TE walker and discovered that Tano's friend, Captain Rex, and his companions Wolffe and Gregor, were veteran clone troopers. Though Rex refused to Bridger's urging to join the fight against the Empire, he agreed to put together a list of coordinates of bases and facilities for the rebellion. Meanwhile, with the Phantom parked on the AT-TE, Gregor convinced them to help them in a joopa hunt, and through a team effort during which Wren kept the regulator's line working, they captured \"Big Bongo.\"\nStaying for dinner, Rex left Wren record the list of potential bases and other potentially useful intel in data-tapes from their main computer; instead, she discovered that Wolffe  had secretly alerted the Empire to their presence. An Imperial probe droid also damaged the Phantom before it was destroyed by Rex, but the Empire already knew their location. Wren promptly worked to repair their ship's damaged engines but only had it ready when All Terrain Armored Transports closed in on them, where they could shut the Phantom down, forcing them to stay a bit longer and to enter the oncoming sandstorm inside the AT-TE. Using the Force, Jarrus led them through the storm, while Bridger shot an AT-AT at its weak point; then, they escaped the storm and were to abandon the clones. However, Jarrus gave in and they saved the clones from the two remaining AT-ATs before Syndulla arrived with the Ghost. Ultimately, Rex decided to join the rebellion and they together went to the Phoenix fleet, where Rex reunited with Tano.\nSometime later, during one of Bridger's lessons, Wren and Chopper connived to play a prank on him by locking Chopper's feet to the Ghost's metallic floor. The prank, however, sparked another of Jarrus and Rex's all-too-common-by-then discussions. At the same time, Syndulla assigned Wren, Orrelios, and Chopper on a mission to salvage medical supplies from an abandoned Republic medical station. They were joined by Bridger, who was trying to avoid Jarrus and Rex, and together the four traveled to the station in the Phantom. Once inside, they made it to the command center, where Wren ordered to restart a control panel, but the droid instead jump-started the whole station—unwittingly making their presence be detected by the nearby Relentless. Once Chopper corrected his mistake, Wren accessed the station's database but found it corrupted. Leaving Chopper to repair it, Wren, Orrelios, and Bridger searched for the medical supplies.\nWhen Chopper was attacked, Wren and Bridger used the ventilation shafts to help him, yet also leaving Orrelios behind. Instead of the astromech, they lured into a trap by the Seventh Sister and one of her ID9 seeker droids. Though they tried to run away from her, the Fifth Brother intervened, and ultimately, Wren was separated from Bridger when he closed a blast door with his lightsaber and was subsequently captured by the Seventh Sister. Wren then went to meet Orrelios, only for the Fifth Brother to go to their encounter and to turn Wren's explosives against them. In the explosion, the two were separated and the Brother took the unconscious Wren to where the Sister was interrogating Bridger; there, both Wren and Bridger refused to give away the fleet or Jarrus' location.\nPretending to be \"Commander Meiloorun,\" Orrelios then contacted them on the comlink, and Wren refused his help only for the Brother to threaten to behead her with his lightsaber, prompting Bridger to accept his help. Told to meet at Bay 5 by the Lasat, the four made their way to the indicated hangar where Orrelios  had secured the Phantom to the roof and detached it to fire upon the inquisitors. With the two distracted, Wren and Orrelios entered the Phantom. They were about to leave but the Inquisitors kept the ship from leaving by use of the Force, and so, Wren began to shoot them forcing the Brother to release the grip to protect himself. Unable to hold them alone, the Sister was forced to let go and the rebels escaped. Once they returned to the Ghost, they informed Jarrus of their encounter but also delivered their report to Commander Sato.\nLater on, while they hid in Garel, Wren and the rest of the crew  participated in a mission to find fuel cells to deliver to the people of ice world of Rinn, who were experiencing an energy crisis.\nUpon the first, but failed attempt of Phoenix Squadron and the Ghost to break the blockade of Ibaar and deliver relief supplies to the starving people in the planet below—plus the loss of Phoenix leader and a transport ship—, Rex suggested that they made contact with Quarrie. However, the Mon Calamari engineer, rumored to have developed a prototype starfighter, would only discuss the ship in person, on Shantipole. For the mission, Wren and Orrelios accompanied Syndulla on the Phantom, while Jarrus, Bridger, and Chopper used the Ghost to pick up the supplies for the second attempt to break the blockade. Upon surviving the Phantom's crash-landing on Shantipole, the three met Quarrie; he showed them Prototype B6, also called the \"Blade Wing.\" While Wren and Orrelios were initially skeptical of the Blade Wing's effectiveness, they were mollified when Syndulla completed her test flight.\nJarrus then contacted them to inform them that the blockade run had started, and Syndulla resolved to depart for Ibaar immediately. Wren, however, notified that the Blade Wing's energy drain from the multi-cannon firing system had killed the hyperdrive; however, they found a way around the problem when Quarrie revealed that he had his assistant, BG-81, modify the Phantom to include a hyperdrive system. Using the Phantom to tow the Blade Wing to the blockade run, Wren accompanied Syndulla as her gunner. As they flew ahead of Phoenix Squadron and, once in sight of a target, Wren fired the Prototype B6's multi-cannon, instantly destroying one of the Imperial Arquitens-class light cruisers, and clearing the path for the Ghost to deliver its relief supplies to the Ibaarians. After their rendezvous with the crew, Sato, and Quarrie, Wren was present when Syndulla was promoted to Phoenix Leader and saluted her.\nSyndulla assigned Wren to a mission of her own: to pick up a courier with important information at Garel City's spaceport and transport him to Havoc Outpost. With Bridger and Chopper as a backup, they were told that the courier would respond to code phrase \"It's a long way to Alderaan.\" Along the way, Wren noticed a familiar symbol scribbled on a nearby wall, Ketsu Onyo's calling card, and quickly deduced that Onyo was in the area. For the next few hours, Wren and Bridger greeted disembarking passengers with the phrase to no avail, until a GNK-series power droid called EG-86 responded to it. Before they could proceed, Onyo revealed herself and attempted to collect EG-86 for Black Sun but Wren refused to let Onyo have her way. Interrupted by stormtroopers, the rebels evacuated EG-86 onto a nearby GX1 short hauler while Ketsu was busy attacking the troopers.\nDuring the take-off, after shutting down the hauler's pilot droid, they were separated from Bridger while Onyo pursued them on her ship, the Shadow Caster. Onyo then damaged their hauler's hyperdrive and blasted open their side door and Chopper was sucked into space before Wren sealed the hatch. Wren was then contacted by Onyo, who demanded that Wren surrender the power droid or she would blast the shuttle to pieces. Seeing as Chopper was disabling her ship's weapons array from outside, Wren distracted Onyo by talking; she derided her own desire to join Black Sun, which she now knew were slavers and assassins who only cared about profits and body counts. Nevertheless, Onyo fired to find it disabled, and Wren tried to catch Chopper and fly away until she realized Onyo had captured Chopper with the Caster's tractor beam projector.\nUnable to leave him behind, Wren offered to make a trade and agreed to dock their ships. However, Wren told EG-86 to remain in the hauler while she spoke to Onyo. Realizing that Wren would not give up EG-86, Onyo offered to share her cut for it, but Wren asserted that she no longer did things just for money. In a leap of faith, Wren forgave Onyo for betraying her and claimed she still trusted in her, trying to give her \"sister\" a second chance in life. Before Onyo could answer, an Imperial vessel announced that they were to board her stolen shuttle; forced to put aside their differences and to work together, they observed that it seemed they were friends once again.\nUnable to escape, Wren had Chopper overload the hauler's hyperdrive and then go to the Caster to prepare to disengage the docking tube on her signal. Using Onyo's armory of explosives, Wren rigged the shuttle to explode and told the shuttle's pilot droid to exercise emergency protocol and powered up the ship's thrusters. However, the Imperial vessel was aware of this and shot at the shuttle, damaging the tube and knocking Wren unconscious. As the pilot droid attempted to leave, Onyo saved Wren and helped her aboard the Caster. Once inside, Chopper disconnected the two ships and was about to leave when the Imperial cruiser used their tractor beams to impede their escape. It also dragged the shuttle and so, its explosion damaged the cruiser and enabled the Shadow Caster to slip away. Together, Wren and Onyo delivered EG-86 to R2-D2 to Havoc Outpost and returned to Garel, where they were greeted by Syndulla and Bridger; before parting ways, Wren thanked Onyo for saving her life and told her that she was welcome to join the Rebellion.\nUpon the Liberator's capture in the Del Zennis system by Brom Titus's Imperial Interdictor, Wren recalled that during her Academy days she had learned that the Empire was developing a new cruiser with gravity well projectors that were capable of pulling ships out of hyperspace. As Jarrus and Rex were to carry out the rescue mission for Sato, Bridger and the rest of the crew, Wren was inspired to paint a new stencil of the two working together in the Sentinel-class shuttle they would use to infiltrate the Interdictor.\nSabine took charge of a package that contained a holo-map. En route to the drop-off point, Sabine ran into a pair of stormtroopers. She made her escape by jumping across several rooftops. However, she dropped the package and it was picked up by Jyn Erso. Sabine followed Erso in order to retrieve the package before the stormtroopers captured her and the map. As Erso reached a dead end, Sabine shot at some chains, and caused the cargo to crash on the stormtroopers. Sabine confronted Erso and asked for the map. At first, Erso refused, but ultimately gave Sabine the map after the Mandalorian convinced her to allow her to keep helping people. Erso wished her good luck before scaling a wall and running off, which impressed Sabine. After her encounter with Erso, Sabine made contact with the Phoenix cell and left the scene.\nWren was monitoring Imperial transmissions when she received intelligence that the Imperial fleet blockading Lothal had left its orbit for unknown purposes; Bridger, who had just experienced a vision of his parents, interpreted it as a sign that they had to return to his homeworld immediately. Willing to accompany him, they ordered Orrelios and Chopper to return to the Ghost from their supply run, when Wren realized that the Empire had pulled its patrols back in its preparations for a major strike: a battle against the rebel presence on Garel. Upon Orrelios and Chopper's return, the Ghost took to the skies of Garel, where before they could escape, the Liberator was trapped by the Relentless's tractor beam. While Jarrus, Bridger, and Chopper departed on the Phantom for Lothal, Wren, Syndulla and Orrelios remained to help the fleet's command ship. On Wren's idea, they tried to use the torpedoes to disable the tractor beam, but the intervention of a TIE fighter damaged the weapons systems. Instead, Syndulla freed the Liberator by ramming the side of the Ghost on the tractor beam to disable it.\nSometime later they received word that Senator Organa was sending reinforcements to Lothal with his agent and daughter, Princess Leia Organa. They set out to meet them and rescued her, Jarrus, Bridger, Chopper as well as Lothal ex-governor Ryder Azadi from an Imperial altercation. Once away from the skirmish, Wren and Orrelios were told of the fate of Bridger's parents and gave their condolences to the boy. However, they immediately set out to steal Organa's ships, three Sphyrna-class Hammerhead corvettes: while Organa, Jarrus, and Bridger  distracted Lieutenant Yogar Lyste, Wren, Azadi and Chopper unlocked the gravity locks that kept Organa's ships in Imperial custody.\nDuring the operation, they deactivated the first device and Wren boarded the freed corvette, only to depart to Lothal and reunite with the rest of the fleet. The two other ones, piloted by Jarrus and Azadi, and the Ghost soon arrived with all the rebels but Organa, who stayed behind to perpetuate the ruse that she was a loyal Imperial citizen.\nSometime later, Wren undertook a solo mission to obtain data-tapes from Leia that contained the locations of numerous Imperial bases. In order to meet Organa without exposing her secret involvement in the Rebellion, Wren posed as a bounty hunter to \"abduct\" Organa and separate her from her stormtrooper security detail. She was nervous before the mission, as she did not know much about Organa. She ambushed the troopers with a paint bomb and escaped with Organa. After introducing herself, Organa prepared to hand over the tape cassette. However, the pair were tracked down by the assassin droid IG-88, which also desired to acquire the data-tape. Wren whipped out another paint bomb and when it triggered, Wren and Organa fled the scene, running back towards the stormtroopers. Wren hid out of sight and Organa ordered her bodyguards to engage the droid. While the stormtroopers were distracted, Organa handed the tape over to Wren. Sabine thanked her, addressing her by her title of princess, but Organa insisted that she call her Leia. Sabine smiled and said that she would keep fighting on the outside while she fought on the inside. Organa expressed gratitude and expressed her desire to work with her in the future before the two parted ways.\nIn a discussion for a new hyperspace route to the Lothal sector with Phoenix command, Wren recommended that they used the Concord Dawn system, a Mandalorian colony not yet under Imperial subjugation. Unaware of their allegiance, they decided to try diplomatic venues and Wren accompanied Syndulla and Phoenix Squadron in a RZ-1 A-wing interceptor. Upon arriving in Concord Dawn space, Syndulla requested safe passage for the rebellion, but the Imperial-aligned leader of the Protectors of Concord Dawn, Fenn Rau, refused. He and his men then attacked the rebel squadron. Forced to retreat, on Syndulla's orders, Wren made the jump back to the fleet, only to be followed by Syndulla, who was gravely injured by the attack. Though Syndulla's vital signs stabilized, Wren promised her that they were going to answer for the attack.\nJarrus, who recognized Rau from the Clone Wars, then took it upon himself to infiltrate the Protectors Camp and negotiate, and allowed only Chopper to accompany him. Wren, however, sneaked in the Phantom and went with him. After a discussion in which he wanted to complete Syndulla's goal to recruit the Protectors, Wren accepted with the condition that she could destroy their Fang fighters if Rau refused. Together, they infiltrated the base, and leaving Jarrus to talk to Rau, Wren planted the explosives. Before long, the Mandalorians were alerted to her presence and surrounded Wren, but she invoked the code and called Rau out for battle. Jarrus implored Wren not to kill Rau; she only told him to trust her, as she and Rau held steady in a standoff. Wren proved to be faster by landing a direct hit to Rau's blaster, and activated the scattered explosives, destroying the starfighters.\nAs Wren had been unable to destroy Rau's ship and the Protector was headed for the ship with the intent to destroy the rebel fleet, Jarrus went after him; meanwhile, Wren rendezvoused with Chopper and boarded the Phantom to pursue Rau's ship, besieged by Jarrus. The Jedi then brought Rau aboard the Phantom. Now a rebel prisoner, Rau ordered his men to stand down and allow the rebels safe passage through Concord Dawn without any mention of the rebels to the Empire, lest Concord Dawn fell to Imperial servitude―thus forming an uneasy alliance between the Protectors and the rebellion.\nSabine and the other crew of the Ghost accompanied Ezra to Nixus Hub 218. Ezra had received a tip from his one-time \"business partner\" Hondo Ohnaka about the arrival of two refugees at the spaceport. Upon landing, Sabine asked Ezra where he had gotten his transmitter from but Ezra received no response from Hondo. When they approached the cargo section, they discovered Imperial stormtroopers arresting two Lasat refugees, who had been hiding in a cargo container. Sabine and her rebel companions assaulted the Imperials and freed the Lasat captives. Shortly later, Hondo turned up and revealed that he was Ezra's mysterious source.\nThe Lasat identified themselves as the former Lasan High Honor Guardsman Gron and the mystic Chava the Wise. From Gron, Sabine and the other rebels learned that Zeb had once been a captain in the Honor Guard. As the rebels made their way back to the Ghost, Chava told them that she and her companion were searching for the legendary Lasat planet of Lira San, which was rumored to be a safe refuge for the Lasat species. The rebels were pursued by more stormtroopers but they managed to escape back to the Ghost with the help of Hondo, who sealed several exits to prevent the Imperials from pursuing them. During the gunfight, Sabine and Hera shot the stormtroopers blocking their path to the Ghost's hangar bay.\nAfter boarding the Ghost, Sabine and her companions fled into hyperspace. Sabine helped Hera pilot the Ghost during the ship's journey through hyperspace. Chava and Gron also began a ritual to help them find Lira San, which did not appear on any official star charts. Chava also spoke of a prophecy which stated that Lira San would only be found if the \"child\" saved both the \"warrior\" and the \"fool.\" While initially reluctant, Zeb agreed to take part in order to save his people. Sabine and the other rebels were present when Zeb used his bo-rifle to pinpoint Lira San's location on a holographic map generated by Chopper. After determining Lira San's location, the rebels set a course for Wild Space, a region which lay beyond the Outer Rim Territories.\nAs the Ghost approached Wild Space, they encountered a new obstacle in the form of an imploded star cluster; which blocked their path to Lira San. The rebels' problems were further compounded when an Imperial light cruiser captained by Agent Kallus exited hyperspace behind them. Sabine and Hera manned the Ghost's controls as the ship attempted to brave the maelstrom ahead. At that point, Zeb fulfilled the ancient Lasat prophecy by using his bo-rifle to guide the Ghost through the maelstrom ahead. Sabine and Hera were initially taken by surprise but were relieved when their ship entered the gravitational field intact. Meanwhile, the Imperial cruiser was forced to retreat due to damage from the gravitational pull of the star cluster.\nUpon entering the imploded star cluster, the Ghost jumped into hyperspace. Sabine and the other rebels were knocked out by a bright blast of light. When they awoke, they found themselves in an unknown region of space. Shortly later, they sighted Lira San on the horizon. Sabine and the other rebels stayed aboard while Zeb along with Gron and Chava traveled down to Lira San in the Phantom. The three Lasat subsequently discovered that Lira San was the original homeworld of the Lasat species and that it was home to millions of Lasat. While Gron and Chava elected to settle in Lira San, Zeb returned to rejoin the crew of the Ghost. Reunited, Sabine and her rebel companions exited the imploded star cluster through a safe route which Zeb had discovered.\nSabine and her fellow rebels later took part in a raid on a Mining Guild asteroid gas refinery to obtain fuel supplies for the Ghost and the fleet. While traveling to the refinery, Sabine and her captain Hera was at the helm of the Ghost when their ship was surrounded by a herd of purrgil, large space-dwelling creatures that were capable of hyperspace travel. While Hera wanted to open fire on the purrgil, Kanan and Ezra advised caution. Shortly later, the crew of the Ghost fought off two TIE/mg Mining Guild starfighters which attempted to drive away the purrgil.\nUsing the Ghost's sensors, Sabine quickly tracked down the TIE fighters to the asteroid gas refinery. They also realized that the purrgil were traveling to the same destination. After they had parked the Ghost on a cliff overlooking the refinery, Sabine used her macrobinoculars to study the facility. While most the facility was defended by Rodian gunners and TIE fighters, she spotted a large platform that was used as a landing zone for shuttles picking up fuel canisters. The platform was undefended but they had to act fast. When the crew was assembled, Sabine and Hera outlined their plans to infiltrate the refinery and steal the canisters. Before leaving, they would ignite the volatile Clouzon-36 in the nearby planetoid to destroy the refinery; effectively denying it to the Empire.\nFor the mission, Sabine along with Kanan, Chopper, and Ezra would jump from the Ghost and land on the landing platform. Kanan was initially annoyed after learning that Sabine had stylized his stolen stormtrooper helmet. During the jump, Sabine took a ride on Chopper, who used his rear rockets to control his descent. While Sabine, Chopper, and Kanan had no problems landing on a bridge, Ezra miscalculated his jump and almost descended into the planetoid below. After landing, the rebels came under attack from the Mining Guild guards. Sabine attempted to activate the detonators but was stopped by Ezra who convinced her and the other rebels that the purrgil depended on the gas to survive.\nAfter fighting off the Rodian guards, Sabine and her rebel comrades managed to secure the landing zone for the Ghost. After the Ghost landed, Sabine and the other rebels helped Chopper to load the canisters into the ship's cargo hold while Kanan and Ezra held back the refinery's security forces. During the fighter, Ezra was knocked off his gun emplacement while Kanan was cornered by two more TIE fighters. The refinery's boss Yushyn attempted to force the rebels to surrender. However, Ezra resurfaced with the purrgil and attacked the Mining Guild forces. Having finished refueling the Ghost, Sabine and her rebel comrades departed into space but not before destroying the refinery.\nIn space, Sabine and her rebel comrades were reunited with Ezra, who revealed that he had managed to establish a bond with the Purrgil King. The purrgil were not native to the planetoid but depended on the gas there to survive and to travel into hyperspace. The crew of the Ghost then followed their purrgil allies through hyperspace.\nWith the rebellion losing starfighters and pilots at a faster rate than they could replace, Sabine and her fellow rebels took part in a mission to steal an Imperial fighter-carrier seen orbiting Ryloth. Needing help, Hera contacted her estranged father Cham Syndulla, the leader of the Ryloth rebels. Cham and his companions Numa and Gobi Glie rendezvoused with the Ghost in deep space. Upon meeting Cham, Sabine told him that she had learned about his tactics and role as the leader of the Twi'lek Resistance during her time at the Imperial Academy on Mandalore.\nLater, Sabine and the other rebels attended a briefing where Hera outlined her plan to use a stolen TIE/sa bomber to infiltrate and hijack the Imperial fighter carrier. Cham disagreed with Hera's plans and advocated destroying the vessel in order to demonstrate the Ryloth rebels' strength. In the end, Hera managed to convince Cham to put aside their difference and work together with her rebel cell to capture the ship for the rebellion.\nSabine later accompanied the two rebel cells aboard Cham's Nu-class attack/transport shuttle to Ryloth. During the journey, Sabine and the other rebels befriended Cham and his companions, who regaled them with stories about the Clone Wars and the Battle of Lessu. After exiting hyperspace, they entered their TIE bomber and headed towards the fighter carrier. In order to get aboard, Hera arranged for two rebel A-wing starfighters to attack their bomber. This ruse worked and the rebels were able to land their TIE aboard the fighter-carrier.\nAfter landing, Sabine spotted that the Twi'lek rebels had brought a bag of detonators. Before Sabine and her fellow rebels could respond, Cham and his companions stunned them. Cham and his companions then proceeded with their original mission to destroy the fighter-carrier. When Sabine and her companions stirred, she and Ezra informed Hera that the Ryloth rebels had brought explosives with them. Resolving to stop Cham, the rebels split up. While Hera, Kanan, Chopper, and Ezra headed to the command bridge, Sabine and Zeb headed to the munitions rack to stop Numa and Gobi.\nThey eventually caught up with the two Twi'leks but were caught in a three-way blaster battle with Imperial stormtroopers. In the end, Sabine and Zeb managed to trip up Numa and Gobi by using a mouse droid to trip them up. With the two Twi'leks incapacitated, Sabine and Zeb bound them with restraints. Meanwhile, Hera had managed to convince Cham to abandon their differences and work together to secure the fighter carrier. Joining forces, the two rebel cells fought off Imperial reinforcements trying to reclaim the ship and repaired the ship's hyperdrive. Sabine also helped Ezra and Cham to shove a TIE bomber laden with explosives into the path of an Imperial light cruiser, destroying the enemy vessel. Having accomplished their mission, Sabine and the other rebels escaped into hyperspace with the stolen Imperial fighter-carrier. After Hera and Cham reconciled, Sabine and her fellow rebels were present in the carrier's hangar bay where they bade farewell to Cham and his companions.\nSabine Wren and her fellow rebels including Rex traveled to the Geonosis system to investigate an Imperial construction module orbiting Geonosis. After the Ghost landed in the abandoned module's hangar bay, she along with Ezra, Kanan, and Zeb ventured into the complex only to be surrounded by Imperial stormtroopers under Agent Kallus, a perennial foe of the crew of the Ghost. Following a skirmish, Sabine and most of her companions managed to make it back to the Ghost. However, Zeb was separated during the struggle and fled into an escape pod, only to be pursued by Kallus.\nSabine and her fellow rebels then managed to escape their Imperial pursuers but stayed in the Geonosis system to search for their missing comrade Zeb. Despite efforts to track the trajectory of his escape pod and to sweep Geonosis with the Phantom, the rebels were unable to find their missing comrade. Meanwhile, Zeb and Kallus managed to land on icy Bahryn, one of Geonosis' moons. Together, they established an unlikely friendship to survive the cold and managed to escape several bonzami predators. After finding shelter and fixing his transponder, Sabine and her fellow rebels reunited with Zeb.\nSabine Wren was aboard the Ghost while Ezra, Kanan, and Chopper traveled on the Phantom to Oosalon to scout the planet as a potential site for a new rebel base. Shortly later, Ahsoka Tano visited the Ghost, and the ship later rendezvoused with the Phantom in deep space. Once aboard, Sabine and her fellow rebels learned that the two Jedi had encountered two Inquisitors known as the Fifth Brother and the Seventh Sister on Oosalon. Fearing that the Inquisitors would hamper the three Jedis' efforts to aid the rebellion, Kanan, Ezra, and Ahsoka traveled to the Jedi Temple on Lothal. Sabine along with Hera and Zeb watched the Jedi and Chopper depart aboard the Phantom. When Sabine asked where they were going, Hera replied that it was sometimes better not to know.\nSabine Wren and her fellow rebels attended a meeting aboard the former Imperial fighter carrier, which had become the Phoenix Squadron's new flagship, to discuss plans to establish a rebel base on Berzite's moon in the Yost system. The meeting was also attended by the Rex and Sabine's old friend Ketsu Onyo, who had decided to help the rebellion. Ketsu recommended Berzite's moon on the grounds that it lacked an Imperial presence. However, the fighter carrier lacked enough fuel to travel to the Yost system. Sabine, who had been tracking Imperial fleet movements, then suggested raiding an incoming Imperial fuel shipment at Horizon Base. Upon arriving at Horizon Base, Hera and the other rebels made their way to the depot while the astromech droid Chopper stayed behind to guard the Ghost and to keep a watch for Imperial forces.\nSabine and her friends managed to steal the fuel but were pursued by Imperial stormtroopers. They managed to make their way back to the ship but could not find Chopper; who was distracted by a droid leg being sold at a nearby stall. Upon arriving back at the Phoenix fleet, they found the fleet under attack from an Imperial force led by Admiral Kassius Konstantine, who gave his men orders to stop the Ghost from delivering fuel to the fighter carrier. However, the Ghost was able to dock in one of the fighter carrier's hangar bay due to the intervention of Ketsu's starship Shadow Caster. After refueling the fighter carrier, Sabine and the rebel fleet made preparations to depart to the Yost system. However, Hera and Commander Sato received warning from Chopper and the former Imperial inventory droid AP-5 that the Empire had set a trap in the Yost system. With the help of AP-5, the rebels instead fled to the planet Atollon, which had no Imperial presence.\nAt Atollon, Sabine and the other rebels reunited with Chopper and AP-5, who had stolen an Imperial cargo ship. Sabine also repaired the badly-damaged AP-5, who had been blasted during the takeover. Chopper willingly relinquished his stolen droid leg to provide Sabine with parts to repair his friend. When AP-5 awoke, he chided Chopper for the \"illogical act\" of sacrificing his leg to fix him. Sabine and her fellow rebels watched the two droids insulting each other verbally before exiting the common room.\nWhile Sabine was working on the Ghost, Hera alerted her that Ketsu, having left Black Sun, was going to help her with a mission to secure food rations. Sabine was excited that her friend was going to join them and disappointed when Hera reminded her that she was only working with them for the money and was not necessarily ready to join the Rebellion, reminding Sabine that it had even taken her a while to come around to the idea. She later hid behind a stack of crates in Garel City, waiting for Ketsu, who eventually jumped down next to her. Sabine then gave her the chance to join the Rebellion, saying that they wanted her in the family they had built, but Ketsu remained hesitant.\nTogether, they attempted to bypass a security door to enter a restricted area, but while Sabine tried to work on the panel, Ketsu told her to stand back and blasted the door, allowing them to enter. Sabine led them on their search for loading bay nineteen, where Hera's intel told them the food would be located, and Ketsu expressed remorse that they were stealing supplies instead of taking down Imperials. Sabine reminded her that the Rebellion was not always about combat and more about helping people in any way they could. However, they were quickly discovered and battled several stormtrooper guards. When one of the food canisters fell, Sabine covered Ketsu while she rescued a Chadra-Fan boy. Sabine then called in Spectre 2 to pick them up. Sabine, Ketsu, and the boy were then picked up by the Ghost. After dropping off the boy, Ketsu admitted that it felt good to work for a good cause. As thanks, Sabine spray-painted a red starbird on Ketsu's charred pauldron, and her friend decided to join the Rebellion.\nLater, when Sabine was cleaning her speeder, Hera approached and said that they were late to rendezvous with Ketsu, saying that Sabine was her ride. Sabine was happy to test her speeder's engine. They arrived at the spaceport to meet Ketsu only for her to arrive after them, zooming past them on a speeder and jumping off before the vehicle crashed into a container and exploded. Hera handed her the data to give to the informant, but when Sabine offered to drive, Ketsu said that the informant insisted that she go alone. Sabine was reluctant to lend her friend her favorite speeder that she had just finished painting, but obliged. Sabine nervously paced inside the Ghost until Ketsu returned, sheepishly telling Sabine that she had crashed her speeder and presented her with the broken steering mechanism. While Sabine was saddened, she told Ketsu that she was glad that she was safe and offered to teach her how to repair a speeder engine.\nSabine joined Hera on a mission to an Imperial facility in order to obtain medical supplies for the Rebellion. During their rendezvous, Sabine told Hera that the transport they were looking at was the correct transport, although Hera remained skeptical. However, Sabine's decision proved to have been made too hastily, as they boarded the wrong shuttle and found themselves surrounded by stormtroopers while the shuttle with the medical supplies flew off.\nRushing back into the cockpit, Sabine told Hera that she had made a mistake as the stormtrooper began cutting through the door. Hera began to fly the ship in a manner that caused the stormtroopers to be tossed around the cargo hold as the two rebels realized that Chopper was flying the ship with the medical supplies right next to them. Seeing Chopper, Sabine came up with a new plan to jump to the other shuttle from the cockpit. She attempted to shoot the glass around the cockpit, but Hera grabbed her arm and popped it off using the ship's controls. Before jumping, Hera disabled the controls. Sabine extended her arm, waiting for Hera to jump, and, when she did, she just barely managed to grab on to the boarding ramp. Sabine helped her up, and, as Hera made it onto the ship. After they landed, Sabine apologized for her mistake, and Hera cautioning her against rushing into things before accepting her apology.\nFollowing the discovery of Atollon, the Phoenix rebels established a base on the planet called Chopper Base. Sabine and the other Spectres assisted in the establishment of the base by ferrying supplies from the fleet. On one supply run to deliver power generators, Sabine and Captain Syndulla were at the helm of the Ghost. During the journey, Sabine and Hera watched Kanan and Ezra undergoing a lightsaber training session in the ship's cargo hold. When Sabine complimented Ezra's improved abilities, the young apprentice took it as a \"put-down.\"\nAfter landing at Chopper Base, Sabine and her fellow rebels met Rex in the command center. Rex informed them that this scout had found an underground source of water. Sabine also helped the Phoenix rebels plant sensor beacons around the base to provide a warning for intruders. Later that evening, Sabine and Rex received a report that a fellow rebel named Lieutenant Dicer had not returned from planting a sensor marker in the northern perimeter. The two ventured to Dicer's last known location in the Phantom.\nUpon arriving there, Sabine and Rex found Dicer's sensor marker and helmet but no sign of the rebel. While examining her helmet, Rex concluded that Dicer had been taken after she had planted the sensor marker. At that point, Rex sensed movement coming from a \"rock\" behind Sabine. This \"rock\" turned out to be a krykna, a large spidery creature. Sabine managed to fight off the krykna with two blaster pistols and call for help. However, Rex was overpowered and taken captive by the krykna.\nShortly later, the other Spectres arrived in the Ghost and Sabine informed her comrades that Rex had been taken by the krykna. While Chopper guarded the Ghost, Sabine and her fellow rebels explored the tunnels. While Ezra and Kanan explored one section, Sabine along with Hera and Zeb explored a different section which led them to an underground nest. There, they managed to free Rex but were then pursued by several krykna. After reuniting with Ezra and Kanan, the Spectres escaped the tunnels and made their way back to the Ghost.\nAfter boarding the ship, Sabine and her fellow rebels attempted to escape but the ship was trapped under a web woven by the krykna. Under Hera's orders, Sabine diverted all auxiliary power to the hull. This had the effect of electrocuting a krykna but it failed to drive the creatures away. As the fighting continued, Sabine realized that the krykna avoided the sensor marker and suggested using the machine to hold the creatures at bay so that the rebels could break free of their web.\nDuring the rebel counter-attack, Ezra and Kanan used their Force powers to hurl Sabine towards the sensor marker. However, they miscalculated and she landed in a pit. Sabine managed to reach the top and escape a krykna that was lurking at the bottom of the pit. Using the sensor marker, Sabine managed to fight her way back to the Ghost. Meanwhile, Ezra and Kanan used their lightsabers to break the web around the ship. Having freed the Ghost, the rebels were able to flee back to Chopper Base.\nThe following day, the Phoenix rebels managed to secure Chopper base from the krykna by erecting a fence of sensor markers around the base. Sabine and Kanan watch the rebels erecting the fence. At that point, Sabine took the opportunity to tell Kanan that Hera wanted to speak to him about the upcoming Jedi-only mission to Malachor. Kanan and Ezra were planning to travel there with the former Padawan Ahsoka Tano to seek answers about how they could fight against the Sith.\nSabine and her fellow rebels including Rex stayed behind on Atollon while Kanan, Ezra, Chopper, and Ahsoka went on the mission to Malachor. When Kanan, Ezra, and Chopper returned from Malachor, Sabine and her fellow rebels were there to greet them when the Phantom arrived at Chopper Base. While Hera hugged the now-blinded Kanan, Sabine and the other rebels remained silent. When Ezra exited the Phantom, Sabine along with Zeb and Rex looked with sadness upon realizing that Ahsoka had not survived the mission. Later, she and the other Spectres returned to the Ghost where they silently came to terms with Kanan's blindness and Ahsoka's apparent death.\nAfter the incident on Malachor, Sabine again changed the style and color of her hair. She also further decorated her armor. Sabine and her team later took part in a mission to Naraka to rescue the Weequay pirate Hondo Ohnaka, whom they had previously encountered at Nixus Hub 218. While Hera waited aboard the Ghost, Sabine and her team climbed under a bridge. After taking out two stormtroopers, they were joined by Chopper. Together, the rebels made their way inside the prison.\nOnce inside the prison, the rebel team located cell 6611 where Hondo was being held. While Sabine was reluctant to rescue the opportunistic pirate, Ezra assured her that his information was reliable. When Sabine encountered Hondo's Ugnaught companion Terba, she expressed a reluctance to rescue the second target until Hondo assured her that Terba had access to information of interest to the rebellion. Sabine then spotted a stormtrooper sneaking up behind Ezra. Following a firefight, the rebels, Hondo, and Terba fled down a turbolift. Inside the lift, Sabine lent Hondo a Mandalorian blaster and warned him to return it.\nUpon exiting the lift, Sabine and Ezra opened fire on several stormtroopers. Following a brief skirmish, the rebels headed to the entrance. Terba then took the opportunity to break away from the group but was struck dead by laser fire from an AT-DP walker that was blocking their path. Trapped between Imperial forces on both sides, Sabine threw a grenade which killed the stormtroopers behind them. Chopper then shut the door. Meanwhile, Ezra used the Force to compel the AT-DP pilot to turn on his comrades and to drive his walker off the platform.\nWhen Sabine asked Ezra if Kanan had taught him that power, Ezra coolly replied that this was not the case. In secret, he had been delving into a Sith holocron he had obtained on Malachor. When the Ghost finally arrived, Sabine and her fellow rebels jumped onto the hull of the ship. Once aboard, Sabine reported to Hera about Terba's death. This prompted an argument between Ezra and Hera.\nSabine and the other rebels later took part in a briefing where Hondo revealed that the Imperials were dismantling Old Republic Y-wing starfighters at the junkyard Reklam Station inside the gas planet Yarma. Sabine was a member of a recon mission led by Ezra, who had been promoted to the rank of Lieutenant Commander. Sabine and her team were tasked with scouting Reklam Station. Together with Rex and Hondo, the recon team traveled to Reklam Station.\nOn the way, they had to exit hyperspace at Sereeda Waypoint in Mining Guild space. The Phantom was discovered by a Mining Guild patrol but Sabine and Chopper managed to shoot down two Mining Guild TIE fighters. Ezra then advocated destroying the Mining Guild command ship but Sabine pointed out that the Guild would have already alerted the Empire to their presence. The rebel team then traveled to Yarma. While Sabine flew the shuttle, Hondo guided her through the gassy atmosphere. The rebels eventually spotted Reklam Station in the distance.\nHowever, they were attacked by two Imperial DTS-series Dismantler Droids. Chopper and Rex managed to destroy their pursuers but the Phantom sustained damaged and dived into the depths of Yarma. Sabine managed to regain control of the ship and parked it beneath Reklam Station. Once aboard the station, the rebels and Hondo convinced several Ugnaught laborers to assist them in stealing the Y-wings in return for gaining their freedom. After shutting down the conveyor belt, the rebels began refueling the starfighters at Sabine's insistence.\nBefore the could finish refueling, they were spotted by a third dismantler droid, which alerted the Imperial Commander Brom Titus. Titus activated the magnetic locks and ordered the dismantler droid to attack the rebels. The dismantler droid attacked Chopper before attempting to throw Sabine and Zeb off a Y-wing. However, Rex used a magnetic crane to throw the droid off the station into the fiery depths of Yarma. Meanwhile, Ezra destroyed the station's power plant which freed the Y-wings. Sabine then instructed Chopper to activate the relay navigation system and autopilot the Y-wings.\nAs the station disintegrated, Sabine and the other rebels minus Ezra escaped on the Y-wings into space. However, they were intercepted by an Imperial Star Destroyer, which deployed TIE fighters. Following a brief dogfight, the rebels were rescued by Phoenix Squadron, which dispatched the Quasar Fire-class cruiser-carrier Phoenix Nest to evacuate them. Sabine and the team managed to evacuate the Y-wings aboard the carrier while Hera and Kanan rescued Ezra. Back at Chopper Base, Sabine learned from Hera that the five stolen Y-wings were to be transferred to General Jan Dodonna's unit.\nLater, Sabine along with Hera, Chopper, and Zeb was captured by the former Sith apprentice Maul, whom Ezra and Kanan had encountered earlier on Malachor. Maul had lured the rebels into a trap by attacking the crew of a Phoenix Hammerhead corvette. Maul then demanded that Kanan and Ezra hand him the Sith holocron they had recovered on Malachor and Kanan's Jedi holocron. If they failed, he threatened to execute his prisoners. After Maul inspected Sabine's artwork and surmised that the Ghost was their home, he forced Hera to take him on a tour of the ship, and Sabine protested. However, Maul told her she should trust him as he once ruled her homeworld of Mandalore. When Zeb asked her if it was true, she replied, \"Unfortunately.\"\nSabine and the other rebels later took part in an escape attempt. They managed to knock out Maul's repurposed tour guide droids and flee into the cargo hold. There, the Spectres attempted to trap Maul with the magnetizer. However, the Sith Lord broke free with his lightsaber, hit Zeb with a box an threw Wren into Hera with the Force. Maul then reasserted his authority and warned his prisoners that they were only alive as long as they were useful to him. Maul took his captives to the abandoned Mandalorian asteroid station Vizsla Keep 09 where he rendezvoused with Kanan and Ezra.\nAfter collecting the holocrons, Maul double-crossed Ezra and Kanan and ordered his droids to execute the prisoner. However, the droids were destroyed by Kanan. Sabine and the other rebels then confronted Maul in the command center. Maul and Ezra had combined the holocrons in order to see visions of the future. Sabine and the others except Kanan were blinded by the bright pink light. However, Kanan managed to convince Ezra to end the ritual by closing his eyes. The former Sith managed to escape into space afterwards.\nSabine went undercover as an Imperial cadet named \"Ria Talla\" to infiltrate Skystrike Academy and assist defecting cadets that an informant had alerted them to. Sabine went alone on this mission, due to being the least recognizable of the rebel cell and having been an Imperial cadet before. When she arrived at Skystrike Academy, she put her credentials in an Imperial astromech droid. The droid initially rejected her credentials, which prompted the attending Imperial officer to take her aside for questioning. Sabine took her helmet off and told the officer her problem, blew the dust off the credentials and put it back in the droid. None of the Imperials present noticed her as part of the rebel cell, and the droid accepted her credentials.\nThe next day, Captain Vult Skerris sent Sabine and Wedge out on a simulation. They took out several Y-Wing fighters and arrived at a damaged transport. Sabine told Skerris that Imperial protocols dictated that the ship had to be boarded first, but Skerris insisted on destroying it. She voiced her protest and after the simulation, reported for a debriefing. After the debriefing, Wedge was impressed with Sabine's instincts but warned her that others in the Academy didn't share her views. She later overheard Wedge arguing with two of his friends, Hobbie and Rake about defecting. Later on, Sabine told Wedge that she was actually a rebel agent that was sent in to help defecting cadets, and formulated a plan.\nSkerris later ordered a combat simulation, which Sabine recognized as the chance to escape quickly. During the simulation, she gave the signal to break off. Unfortunately, Pryce pressed a button that removed their solar collectors and left them stranded. The Imperials killed one of the defectors and then attacked the rebel transport, forcing them to temporarily abandon them.\nBack in the Academy, Pryce told the remaining three cadets that she was aware that one of them was a rebel agent. Pryce presumed that Wedge was the agent and attempted to strap him to the torture device when Sabine revealed herself as the agent. Pryce ordered the two boys away and pulled up a glyph, recognizing Sabine as a former Imperial cadet and mockingly welcomed her back. Sabine later broke free from two Stormtroopers guarding her and engaged in a short fist fight with Pryce. The two were almost evenly matched, but Sabine eventually got the upper hand by pushing Pryce into the torture device's stinger, knocking her out, and escaped the cell.\nSabine then found Wedge and Hobbie, and freed them from their cell. They attempted to find a way out when the Imperials seal the doors around them. Kallus then appeared and opened the blast door. Suspicious of Kallus, Sabine asked him to give her a good reason to trust him. Kallus told them to avoid Levels 3 to 5 and use Hangar 24 to escape, and asked Sabine to send Garazeb Orrelios his regards and that they were even now. They then hijacked a bomber and headed for space when Skerris pursued them, only to be saved when Ezra's CR90 corvette appeared. Sabine was surprised by his presence, and Ezra replied that they stuck around just in-case she managed to escape. When they arrived at the rebel base, Sabine introduced Wedge and Hobbie to Commander Sato.\nFollowing a supply run to Hera's father Cham Syndulla's Free Ryloth movement, Sabine, the other Spectres, and Cham's band volunteered to helped Hera recover a family heirloom, the Kalikori, from Imperial forces. Imperial forces under Grand Admiral Thrawn had made advances against the Free Ryloth rebels and captured Tann Province. Thrawn had requisitioned the former Syndulla residence as his new local headquarters. Cham had been unable to take the Kalikori with him while fleeing his former home.\nWhile Hera, Ezra, and Chopper infiltrated the former Syndulla home, Sabine and the two rebel cells launched an attack on Imperial forces in the Tulara Ravine. Sabine blew up an AT-DP walker and an Imperial Troop Transport. The other rebels then attack before retreating into the wilderness. However, they were pursued by a second AT-DP walker and Syndulla's blurrg steed was gunned down. Sabine and the other rebels then positioned themselves around the rocks but were unable to stop the walker's advance.\nThe walker then stopped firing to broadcast a hologram message from Captain Slavin, Thrawn's second-in-command. Slavin revealed that the Empire had captured Hera and Ezra. He demanded that Cham surrender himself in exchange for their safe return. Cham complied with the ultimatum in order to save his daughter. Sabine then piloted Cham and the other rebels to the Syndulla residence where the exchange would take place. However, the rebels were able to escape after Chopper activated several explosives which disoriented the Imperials. After fleeing into the wilderness, Sabine and the other crew mingled with Cham's subordinates Numa and Gobi Glie. Despite failing to recover the Kalikori from Thrawn, Hera found renewed contentment and love with her father, Kanan, and her crew including Sabine.\nSabine later accompanied her fellow crew and Rex on a mission to Agamar. While Rex, Kanan, Ezra, Zeb, and Chopper explored an abandoned Separatist supply ship to salvage proton bombs, Sabine and Hera flew the Ghost to raid an Imperial fuel depot. They were pursued by TIE fighters. During the pursuit, Sabine remarked that Ezra and Kanan would be expecting them soon. However, they had not heard from their comrades; who had been captured by the Separatist super tactical droid Kalani. The rebels managed to escape their Imperial pursuers and resume contact with Kanan, who had made peace with Kalani and found a new transport for the Ghost.\nIn an attempt to win the Protectors' leader Fenn Rau over to the rebellion, Sabine played a game of Cubikahd with him. However, Rau was adamant that the Protectors were doing enough for the rebellion by letting them travel through the Concord Dawn system. Their meeting was interrupted by Zeb, who summoned them for a war room briefing with Hera and Commander Sato. After losing contact with the Protectors, Sato suspected that the Mandalorians were setting a trap for them. To clear the Protectors' name, Rau offered to travel to the Concord Dawn system to reason with them. Hera dispatched Rau along with Sabine, Ezra, and Chopper on a mission to probe the system.\nSabine, her rebel comrades, and Rau traveled to the Concord Dawn system in the Phantom II. During the journey, Rau managed to knock out Ezra, stun Sabine and land the ship on the third moon of Concord Dawn. After awakening, Sabine and Ezra were freed from their restraints by Chopper. They soon discovered Rau at the top of a hill. After rejoining Rau, they discovered that another Mandalorian force had attacked and massacred the Protectors. Rau was angry at Sabine and blamed the rebellion for the deaths of his men. While arguing, Ezra and Chopper sensed a signal approach. When a dwarf probe droid appeared, Ezra used the Force to trap the droid while Sabine destroyed it with her blaster. Rau wanted to bargain with the Empire but Sabine disagreed. She sent Chopper to secure the Phantom II.\nThe rebels and Rau were then attacked by a column of Imperial Super Commandos led by Gar Saxon, the Imperial Viceroy of Mandalore. Sabine and Rau managed to flee but Ezra and Chopper were captured. While hiding, Rau advised Sabine not to rescue Ezra in order to avoid drawing attention to themselves. They then observed the movements of the Super Commandos from a safe vantage point on a hill. Despite Rau's hatred for the rebellion, Sabine managed to convince him to help her rescue her friends by appealing to his hatred for Rau. Putting their plans into action, Sabine knocked out a Super Commando and stole his jetpack. Rau then secured the Phantom II. She then used smoke grenades to disorientate Saxon and his guards and rescue Ezra and Chopper.\nThe rebels attempted to flee aboard the Phantom II but discovered that Rau had stolen the craft. Sabine and her companions were then surrounded by Saxon, who chastised her for deserting the Imperial Academy and demanded that she pledge her fealty to him. Instead, Sabine got Chopper to upload frequency 337 feedback onto the Super Commandos' helmet, knocking them out. Sabine then donned her jetpack and held onto Ezra while Chopper ignited his rocket thrusters. The rebels were soon pursued by the Super Commandos. Due to Ezra's extra weight, Sabine was forced to fly low and the boy narrowly avoided colliding with a rock. With a Super Commando closing in on them, she dropped Ezra on a pinnacle. The Jedi used his lightsaber to damage the Super Commando's jetpack, causing him to fall. Sabine then reunited with Ezra and they proceeded towards Saxon's starship.\nSaxon and his three remaining men followed the rebels into a narrower part of the canyon. In order to delay them, Sabine threw grenades at Super Commando, blocking his path. When Saxon and another Super Commando fired upon her, Sabine lost hold of Ezra, and he landed on Chopper. Sabine then shot a second Mandalorian warrior with her blaster, causing his jetpack to explode. The rebels eventually reached Saxon's ship but the Super Commandos caught up with them. One of the Super Commandos seized Sabine's helmet. Saxon ordered his remaining Commando to shoot Ezra while he executed Sabine. Before they could carry out their execution, Rau arrived on the Phantom II and attacked Saxon's vessel and the remaining Commando. When Sabine and Ezra tried to board the Phantom II, Gar Saxon tackled Sabine and told her that he was going to bring her into the empire. They fought for a few seconds until Sabine managed to flee with Ezra and Chopper aboard their shuttle. Once aboard the ship, Sabine confronted Rau about his sudden change of heart. Rau explained that he realized that she was willing to die for her friends even though they were not Mandalorians. He praised her for remaining true to the \"old ways\" and told her that she had gained his respect. When Ezra remarked that the Mandalorians were crazy, Rau responded that he was crazy enough to join the rebellion. Sabine then welcomed Rau to the family as they departed the Concord Dawn system.\nAfter receiving intelligence that the Empire was planning to impose martial law on the planet Mykapo, Commander Sato sent Sabine, her fellow rebels, and Phoenix Squadron on a mission to evacuate local rebel sympathizers. Upon arriving in the system, Sabine spotted a YT-2400 light freighter skirmish with Imperial forces. The Spectres and Phoenix squadron helped by attacking the TIE fighters. Sabine expressed surprise when the freighter destroyed an Imperial Gozanti-class cruiser. The freighter crew declined the rebels' offer for assistance and identified themselves as the Iron Squadron.\nWhile Kanan and Zeb assisted with the evacuation efforts, Sabine accompanied Hera, Ezra, and Chopper aboard the Iron Squadron's ship Sato's Hammer. Once aboard, they were greeted by the crew members Gooti Terez, Jonner Jin, and the astromech droid R3-A3. When Sabine noted that the ship was in a state of disarray, Ezra advised her not to offend the crew while Gooti told them not to touch anything. Sabine along with Hera and Ezra tried to convince the ship's captain Mart Mattin to leave the system. However, Mart and his crew insisted on staying.\nUnable to reason with Iron Squadron, Hera made preparations to leave the Mykapo system and rendezvous the Ghost with the rebel fleet. However, Ezra convinced Hera to let him, Sabine, and Chopper repair the Iron Squadron's hyperdrive in order to win them over. Sabine and Chopper joined forces with R3-A3 to repair the hyperdrive. Despite their efforts, they were unable to restore the ship systems because Mart had diverted power to the ship's laser cannons and deflector shields. When Imperial forces under Admiral Konstantine arrived, Sabine and Ezra managed to convince Gooti and Jonner to see reason but Mart refused to back down.\nSabine and the other rebels managed to flee aboard the Phantom II but Mart stayed behind on the Sato's Hammer to fight Konstantine's ships. Mart's ship was damaged and he was stranded in space. Sabine and the other rebels managed to flee into hyperspace. Sabine later attended a briefing aboard the Ghost where the Spectres, the remaining Iron Squadron crew, and the holographic forms of Rex and Commander Sato received a distress call from Mart. Hera mounted a rescue mission to save Mart and the rebels traveled back to the system.\nWhen Mart responded that the Imperials had attached something to the hull of his ship, Sabine recognized that it was a magno-mine. Chopper and R3-A3 managed to remove the mine. The rebels then managed to rescue Mart and his ship. The Spectres and Iron Squadron managed to escape destruction due to the intervention of Commander Sato's reinforcements. Sato was the uncle of Mart and had come to rescue his nephew. After damaging Konstantine's Imperial light cruiser with the magno-mine, the rebels managed to escape into hyperspace shortly after Grand Admiral Thrawn arrived on his Star Destroyer Chimaera. Sabine was later present at Chopper Base when Mart reconciled with his uncle and embraces his crew.\nWhen Hondo tried to solicit the Spectres' help in retrieving cargo from a stricken Imperial cargo ship on the planet Wynkahthu, Sabine opined that Hondo could not be trusted since he had gotten them into trouble half the time. After a tense meeting, the Spectres agreed to assist Hondo and his business partner Azmorigan in recovering the treasure in return for obtaining the ship's proton bombs, a commodity desired by the rebellion. Prior to the mission, Sabine used the Ghost's sensors to examine the cargo ship and discovered that it had gotten stuck in one of Wynkahthu's atmospheric storms.\nLater, Sabine inquired about Hondo's Ugnaught crew but was met by obfuscation. Later, the rebels learned that Hondo had lost most of his Ugnaught team except Melch while trying to board the cargo ship. While studying the sensor charts, Sabine discovered that they could not offload cargo from the Imperial cargo ship the normal way since it was sitting above a vortex. As a result, Hera solicited the services of the Imperial inventory droid AP-5, who worked with Zeb to devise a plan to retrieve the ship's cargo safely. For the mission, Sabine stayed aboard the Ghost's cargo ramp to receive the cargo from Zeb's salvage team.\nAfter Zeb's team opened the Ghost's outer cargo doors and attached grappling cables to the ship's hull, Sabine stored several shipments of proton bombs. Sabine kept Hera and Kanan informed about the deteriorating windy conditions. The salvage mission was complicated by a lightning strike that caused the cargo ship to dip into the vortex. Despite the presence of DT-series sentry droids, the rebels and their confederates managed to remove their cargo and evacuate the cargo ship before the vessel was ripped apart by the vortex. Sabine was present when the rebels examined their cargo and Hondo \"reunited\" with Melch.\nSabine along with Hera and Zeb stayed behind at Chopper Base while Ezra, Kanan, and Chopper undertook a mission to infiltrate the Imperial Armory Complex to steal the plans for a new Imperial weapon. She along with Zeb and Commander Sato watch as Hera corresponded with the rebellion's local Lothal contact Ryder Azadi via hologram. During the meeting, Ryder informed the Spectres and Sato that the factory was on full lockdown and that they had lost contact with Ezra, Kanan, and Chopper. Sabine and her comrades listened as Ryder informed the rebels about the new Imperial commander Grand Admiral Thrawn and that he was planning to launch an attack on the factory.\nAfter Ezra's team escaped the factory with the plans, Sabine decrypted them and discovered that they were the blueprints for a prototype TIE Interceptor that was fitted with deflector shields. Hera and Kanan feared that if the starfighter was produced in large numbers, it would pose a threat to the rebellion. Sabine expressed shock that Agent Kallus had helped Ezra and his team to escape despite Kallus' role in helping her and the defecting cadets flee the Skystrike Academy. However, Zeb vouched for Kallus. Hera then counseled her crew to be cautious of Kallus until they could discern what game he was playing.\nFollowing Ezra's mission, Sabine attended a briefing chaired by Hera to discuss the upcoming attack on the Lothal Imperial factory. During the meeting, Sabine asked if Thrawn was present on Lothal. Hera replied that there was an increase in Imperial ships above Lothal but could not confirm Thrawn's presence. Sabine was present when Ezra began exhibiting erratic behavior and fainted after claiming that he had seen a vision of Maul. Sabine later questioned Ezra about the incident in his private quarters.\nWhen Ezra insisted that he was fit and insisted on proceeding with the mission, Sabine went to load an extra set of explosives aboard the Ghost. When the inventory droid AP-5 argued, Sabine insisted that she was the weapons expert and knew the right amount of explosives they needed. AP-5 grumbled but complied with Sabine's orders. When Sabine remarked that AP-5 and Chopper came from the same supply line, Chopper responded that she needed to change her attitude. Before they could argue, Ezra went on a rampage and Sabine told Chopper to get Kanan.\nEzra was about to kill a rebel trooper whom he mistook for Maul when Kanan and Sabine restrained him. After Ezra came back to his senses, Hera decided to relieve him of his duties until Kanan had dealt with the threat of Maul. Under Kanan's orders, Sabine monitored Ezra's wrist comm. Meanwhile, Kanan and Ezra went to commune with Bendu in the wilderness. Maul then appeared and convinced Ezra to accompany him to Dathomir in order to severe their mental link. After Maul's ship Nightbrother jumped into hyperspace, Sabine was able to track Ezra and Maul.\nSabine and Kanan followed Maul and Ezra to Dathomir in the shuttle Phantom II. After landing outside the Nightsister lair, the rebels entered the cave where they found that Maul and Ezra had completed the ritual which involved summoning the spirits of fallen Nightsisters. Sabine and Kanan opened fire on the Nightsisters but were possessed by the spirits. The possessed Sabine and Kanan then attacked Ezra and Maul. Ezra was forced to dodge Sabine's blaster bolts.\nEzra and Maul managed to escape the cave. Since the spirits' power came from the altar, the possessed Sabine and Kanan were unable to leave the cave. Unwilling to abandon his friends, Ezra re-entered the cave. The possessed Sabine crept up behind Ezra and attacked him with the Darksaber, an ancient Mandalorian weapon and symbol of power. Following a struggle, Ezra managed to use the Force to push Sabine out of the cave. This exorcised the Nightsister spirit. Ezra then told Sabine not to reenter the cave while he freed Kanan and destroyed the altar; vanishing the spirits.\nFollowing the skirmish, Sabine re-entered the cave. When Ezra reprimanded her, she responded that she had never listened to him before. Ezra then informed her and Kanan that the Jedi Master Obi-Wan Kenobi held the key to destroying the Sith. The three resolved to stop Maul from reaching Kenobi so that they could learn how to destroy the Sith. Before leaving, Sabine then picked up the Darksaber and took it with her.\nAt the request of Senator Organa, the Spectres and Rex undertook a mission to find the rebel operative Saw Gerrera, who has been investigating the mysterious disappearance of the Geonosian species. After the Ghost entered Geonosis's atmosphere, Sabine had difficulty making contact with Saw and speculated that he and his team could be underground. The rebels landed their ship two klicks near where Saw had transmitted his last signal to Rebel Command. Sabine, Zeb, and Hera stayed aboard the Ghost while Rex, Kanan, Ezra, and Chopper explored an underground labyrinth near a Geonosian structure.\nLater, Hera dispatched Sabine and Zeb to trace the energy source that Saw had sighted before losing contact with Rebel Command. Despite the sandstorm, Sabine and Zeb managed to find a fully operational military grade deflector shield generator. Believing that Chopper Base could make use of the technology, Hera ordered Sabine and Zeb to extract the deflector core. Whenever Zeb expressed concerns about what the shield generator was protecting, she responded by telling him to work fast.\nWorking together, Sabine and Zeb managed to extract the deflector core by the time the sandstorm had died down. Sabine then discovered that the deflector core was surrounded by several inactive droidekas. After some discussion with Zeb and Hera, the rebels agreed to carefully bring the deflector core back to the Ghost. On the way, the Geonosian Klik-Klak, who was being pursued by the other Spectres and Saw, activated the droidekas. Sabine managed to use her technical expertise to reactivate the deflector core and create an energy field to protect her and Zeb. The two rebels held out long enough for their comrades underground to capture Klik-Klak and destroy his droid controller.\nSabine and Zeb then loaded the deflector core aboard the Ghost when Hera informed them that an Arquitens-class command cruiser had entered the Geonosis system. Sabine finished storing the deflector core while Zeb entered the cave to warn the other rebels. When the Ghost was attacked by two TIE bombers, Sabine and Zeb manned the ship's guns and managed to shoot them down. The rebels then flew the Ghost into a central air shaft where they picked up their comrades, Saw, and Klik-Klak.\nThe rebels and Saw then became embroiled in an argument over taking Klik-Klak off-world. When the rebels refused to accept Saw's demands, Saw threatened to destroy the Geonosian queen egg that Klik-Klak was guarding. The rebels and Saw put aside their differences to repel a boarding party of Jumptroopers that had been dispatched by Captain Brunson's light cruiser. During the brief skirmish, Sabine donned her jetpack and took out two Jumptroopers with a grenade. The rebels then fled into the depths of Geonosis where they discovered several poison canisters which confirmed that the Empire had perpetrated genocide against the Geonosian species. Sabine recognized the canisters as belonging to the Imperial weapons division.\nHaving discovered what had befallen the Geonosian species, Saw released Klik-Klak and the Geonosian queen egg. The rebels then managed to break through Brunson's light cruiser by firing their ship's cannons and proton bombs. They then escaped into space and informed Commander Sato and Senator Organa about Saw's rescue and their findings on Geonosis.\nAfter the Secret mission to Geonosis, Sabine and some of the Spectres embarked on a training mission near Chopper Base, along with Wedge Antilles and Derek Klivian. Prior to leaving, she told the despondent Captain Zeb, who had been appointed Chief of Security, to cheer up. During the group's absence, an E-XD-series infiltrator droid designated EXD-9 infiltrated Chopper Base. With the assistance of AP-5 and Chopper, Zeb managed to send it back to its Imperial Star Destroyer base with its armed proton torpedo warhead.\nThe warhead activated, triggering a chain reaction which destroyed the Imperial starship. Although Zeb's handling of the incident kept the location of Chopper Base secret, for the time being, it narrowed down the search area for Grand Admiral Thrawn's Seventh Fleet. After the rebels received a message from Fulcrum praising them for turning the infiltrator droid into an improvised bomb, Sabine asked Zeb and AP-5 what was going on. AP-5 was about to recount the story but Zeb playfully muzzled him.\nAfter discovering the Darksaber on Dathomir, Sabine handed it to Kanan for safekeeping. She refused to wield the weapon since she was still haunted by her estranged relationship with her family. After briefly haggling with Chopper over the transport of supplies, Sabine went to her cabin aboard the Ghost to reflect on her art. Chopper later entered the room to inform her that the other rebels and Fenn Rau had gathered in the ship's common room for a meeting. Sabine soon discovered that the Darksaber was to be the subject of the meeting.\nDue to her self-doubt and family issues, Sabine initially rebuffed the suggestion of her rebel comrades and Fenn that she master the use of the Darksaber and assume leadership of the Mandalorians. After Hera pointed out that the Mandalorians could help the rebellion attack Lothal, Sabine reluctantly acceded to begin training with the Darksaber under Kanan and Ezra's tutelage. However, she was still upset with Fenn and the other rebels due to the baggage associated with the Darksaber.\nIn order to avoid the distractions of Chopper Base, Kanan and Ezra took Sabine to train in the wilderness. After setting up camp, Kanan got Sabine to demonstrate her combat skills with a training saber, which was a stick that he had fashioned with Zeb. Despite her combat skills, Sabine was outmaneuvered by Kanan, who used the Force to compensate for his blindness. Unimpressed with Sabine's skills, he instructed Ezra to train her with lightsaber combat forms using the sticks as a substitute. Kanan was unwilling to let her use the Darksaber because he did not want Sabine to harm herself. For the next two days, Ezra drilled Sabine in lightsaber combat forms.\nAfter two days had passed, Sabine's fellow Mandalorian compatriot Fenn Rau arrived with provisions including a Mandalorian vambrace. Rau explained that the vambrace was equipped with paralyzing darts, cables, and a repulsor meant to counteract the Force abilities of the Jedi. Resuming the training session, Sabine used the repulsor on her vambrace to gain the upper hand over Ezra. Cockily, she challenged Kanan, temporarily immobilizing him with her grappling line. After a moment, Kanan was able to break free with his lightsaber and took the opportunity to lecture to Sabine that while such tools are helpful and might save her life from time to time, only training and discipline would keep her alive in the long run. Frustrated with Kanan for holding back her training, Sabine stormed off to a nearby cave to regain her composure.\nLater, Ezra met up with Sabine to comfort her. He reassured her that Kanan was not an easy teacher but that he meant well. Sabine then responded that she knew how to fight but did not want the responsibilities that came with the Darksaber. When Ezra asked about her family, Sabine told him that they regarded her as a traitor and disgrace. Due to her estranged family ties, Sabine believed that she lacked the prestige needed to lead her people. Ezra then comforted her by reminding her that at least she could still return to her parents unlike him.\nRealizing that Ezra was right, Sabine went to the wilderness to clear her mind. Meanwhile, Kanan corresponded with Hera who advised him to let Sabine train with the Darksaber. She explained that holding back Sabine's training would only hurt her. Kanan realized that he had been wrong and apologized to Sabine when she returned from her walk. Sabine in return apologized to Kanan for her hostile attitude. The two then parried with Sabine wielding the Darksaber against Kanan's lightsaber.\nDuring the sparring session, Kanan challenged her about her past decisions to leave the Empire and abandon her family. Sabine revealed that she had left the Empire and her family due to her guilt at her own role in helping the Empire to build weapons used to subjugate Mandalore. Sabine also related how her family had turned on her for speaking out against the Empire and cast her out. Consumed by her pent-up emotions, Sabine gained the upper hand over Kanan, but did not kill him.\nAfter completing her trials, Sabine broke down weeping. A sympathetic Kanan then told her that the Empire ruled through fear and that her family were in a prison of their own making. Kanan then reassured her that she could free them. Along with Fenn and Ezra, he then resolved to help Sabine to use the Darksaber to rally the Mandalorians to the rebellion.\nFollowing her trials, Sabine along with Ezra, Kanan, Chopper, and Fenn Rau traveled on a mission to her former home Krownest in an attempt to recruit her family into the rebellion. Sabine suspected that they still saw her as a traitor and did not expect her to be welcomed there. Her expectations came true as Clan Wren warriors attacked the Phantom II, forcing it to crash-land onto the planet's surface. After landing, Fenn and Chopper hid in the ship while Sabine, Kanan, and Ezra confronted the Clan Wren warriors. A shootout ensued after Ezra ignited his green lightsaber. The Mandalorian warriors' leader ceased fired after hearing Sabine's voice. Sabine quickly learned that the warrior was her brother Tristan. Following a brief reunion, Sabine and her fellow rebels accompanied Tristan and the Mandalorians back to the Wren Stronghold.\nAfter arriving at her ancestral home, Sabine was greeted by her estranged mother Ursa. After seeing Sabine in the presence of the Jedi rebels, Ursa was about to imprison her daughter. However, Sabine told her mother they needed to talk and showed her the Darksaber. When Ursa told her daughter that she was unwelcome, Sabine responded that she had joined the rebellion. Sabine's mother allowed Sabine and her visitors to enter the Wren stronghold but ordered them to surrender their weapons including the Darksaber. While Kanan and Ezra were reluctant to part with their lightsabers, she managed to convince them by telling them that it would help the rebellion win the war.\nInside the stronghold, Ursa criticized her daughter's decision to join the rebellion and told her that the Darksaber was a mere symbol. Sabine's mother also appraised her daughter about the trouble that her actions had brought on her family within Mandalorian society. Sabine also argued with her mother and brother about Gar Saxon's role in murdering the Mandalorian Protectors. Unable to reach a common ground, Ursa ordered Sabine to walk with her. Daughter and mother continued their conversation over a balcony in private. When Sabine confronted Ursa over her decision to align Clan Wren with the Empire, her mother told her that their clan had little choice but to submit to Viceroy Saxon. Saxon had threatened Clan Wren with destruction and taken Sabine's father hostage to ensure the family's cooperation.\nWhen Sabine related that she did not obtain the Darksaber in a fight, Ursa responded that her daughter's ownership of the weapon was disputed due to the circumstances of its acquisition. When Sabine accused her mother of putting power and politics over her family, Ursa responded that she was doing everything she could to protect her family. Ursa then told her daughter she took after her father but had not turned out the way they had hoped. Sabine responded that she was still her mother's daughter. Sabine also told her mother that she and her rebel comrades had come to seek Clan Wren's support for the rebellion. Before they could continue the conversation, Tristan arrived and informed Ursa that Sundari was requesting an audience with her.\nTristan then invited his older sister for a sparring session. While sparring with metal rods, Sabine took the opportunity to ask Tristan whether he thought she was a traitor. Tristan confirmed that this was not the case but explained that the other clans regarded her family as traitors. When Sabine learned that from Tristan that her mother had planned to trade the Darksaber and her Jedi comrades to Viceroy Saxon, Sabine rushed to the throne room. There, she found that Saxon and his Imperial Super Commandos had already arrived to take the Darksaber and the Jedi into their custody. When Sabine protested, Saxon told her that her mother was loyal to him. Tristan then told his sister that it was for the best. When Ursa demanded that Saxon uphold his side of the bargain and spare Sabine, Saxon ordered his men to execute Clan Wren for allegedly colluding with \"traitors.\"\nBefore Saxon could put his plans into action, Fenn Rau arrived in the throne room and handed the Jedi back their lightsabers. During the ensuing skirmish, Sabine joined her family, the Jedi, and Fenn in defeating Saxon's guards. Ezra gave Sabine his green lightsaber, which she used to save her mother from being killed by Saxon, who was wielding the Darksaber. After igniting their jetpacks, Sabine and Saxon blasted their way out of the throne room and fought on the ice outside the Wren stronghold. Sabine dueled with Saxon and used her Personal Combat Shield to fend off his blasts. Sabine eventually managed to damage Saxon's jetpack, forcing him to fight her on the ice. Following a fierce duel, Sabine managed to recover the Darksaber and defeat Saxon. While Mandalorian tradition required her to execute her defeated foe, Sabine chose to spare his life. Unwilling to accept defeat, Saxon tried to kill her but was instead shot by Ursa, who was unwilling to let anyone harm her daughter.\nDue to her role in defeating Viceroy Saxon, Sabine regained the respect of her family. Tired of running, Sabine decided to stay behind with her family and Fenn Rau to helped reunify Mandalore. With the death of Gar Saxon, Mandalore would face a power vacuum. Sabine embraced Kanan before the Jedi departed with Chopper to rejoin the rebellion. She also thanked Kanan and Ezra for teaching her. While Clan Wren was still unwilling to help the rebellion, they had become sympathetic to the rebels. Despite her unwillingness to become Mandalore's new leader, Sabine still vowed to help Mandalore find it's true leader.\nSabine Wren was present in Clan Wren's throne room with her mother Ursa and Fenn Rau when the rebels Ezra and Chopper arrived with news of Grand Admiral Thrawn's siege of Atollon. Ezra pleaded for Clan Wren to send reinforcements to aid them. However, Clan Wren was locked in a civil war against the Imperial-backed Clan Saxon. Fenn and Ursa advised against diverting Clan Wren's already stretched forces and resources to Atollon.\nDuring the meeting, Sabine, her clan, and the rebels studied a holographic battle plan of Thrawn's Seventh Fleet above Atollon. Sabine found that the Imperials had a second Interdictor vessel which was preventing the rebel fleet from fleeing into hyperspace. With Fenn and Tristan opposed to Mandalorian involvement, Ezra and Chopper decided to leave and return to Atollon. When Sabine insisted on coming along with them, Tristan countered that Ezra's mission was impossible. Sabine responded that her friends \"made the impossible possible\" and thanked the rebels for reuniting her with her family.\nMoved by her daughter's loyalty to her friends, Ursa relented and allowed Sabine to recruit volunteers and ships for the Atollon mission. Fenn agreed to help lead the attack on Thrawn's Seventh Fleet. The rebels and Mandalorians exited hyperspace behind the Seventh Fleet. While Fenn's Fang fighters attacked the fleet, Sabine and Ezra flew the Gauntlet starfighter Nightbrother to the second Interdictor cruiser and deployed a landing party. The Mandalorian warriors and Ezra proceeded to attack the gravity well projectors with blasters and explosives.\nThe Mandalorians succeeded in blowing up the Interdictor cruiser, allowing the remaining rebel forces led by Captain Syndulla and General Dodonna to flee to hyperspace. Sabine reunited with Hera aboard the Ghost and was present when Ursa apologized for the rebel losses and thanked Hera for bringing her daughter back. Sabine then told Hera that she wanted to return a favor to her mother by helping them in their civil war. While Hera was unable to commit rebel reinforcements, she allowed Sabine to return to her people.\nSabine and her brother went to see Tarre Vizsla's statue. Once there, she discovered that the Empire had set up an outpost on the statue. Angered, Sabine decided that they would take out the outpost promptly despite Tristan's warnings. The two siblings then set up several detonators on the outpost and then cut one the metal beams with the Darksaber. After moving to a safe distance, Tristan set off the detonators which caused the outpost to come off the statue. Sabine then believed that the statue was smiling at them for what they did.\nSabine and her family later attempted to rescue her father, who was a hostage of Clan Saxon and was facing execution. Sabine was joined by several of her fellow Spectres including Kanan, Ezra, and Chopper, and the Mandalorian Protector Fenn Rau. Sabine led a joint Mandalorian and rebel assault on an Imperial prison to rescue Alrich. Their forces assembled in a trench and prepared to attack an Imperial outpost. Sabine led the assault, weilding the Darksaber against the stormtroopers, who were soon reinforced by a pair of AT-DP walkers. However, Sabine's forces were saved from defeat by the arrival of a trio of warriors from Clan Kryze led by Lady Bo-Katan Kryze, a former leader of the Death Watch and the sister of the late Satine Kryze. They defeated the walkers and entered the prison.\nDespite defeating the Imperial defenders, Sabine was dismayed to discover that her father Alrich had already been evacuated. At the top level of the prison, Sabine then chatted with her new ally Lady Bo-Katan, who had served as regent over Mandalore until she had been ousted by Clan Saxon and the Empire. Since Bo-Katan was regarded by many to be the rightful ruler of Mandalore, Sabine tried to offer her the Darksaber, thinking her to be a worthy ruler. However, Bo-Katan refused, believing that she had already had her chance to rule and failed. Shortly later, Sabine's mother Ursa and brother Tristan arrived and informed her that her father Alrich was being transported to the Mandalorian capital city of Sundari for execution.\nIdentifying the Imperial convoy transporting Alrich, Sabine and her allies set up their ambush above a canyon. After Fenn Rau detected a single passenger in the middle Imperial Troop Transport, Sabine devised a plan which involved one of them sneaking in after the others caused a diversion. Sabine led the attack by flying down with her jetpack and ambushing several scout troopers, who were riding speeder bikes. She also threw a paint bomb at the middle transport, blocking the view of the drivers. While Ezra landed on the middle transport, Sabine acquired a speeder. The Mandalorians and rebels managed to defeat the Imperial forces while Ezra managed to overpower the Imperial troops aboard the middle transport and rescue Alrich before the transport tumbled down a cliff.\nSabine managed to rescue Ezra after he had Force jumped out of the descending transport. After reuniting with her father, Sabine contacted her mother to bring the good news. Ursa and Tristan were skirmishing with Imperial forces and had forced them into a retreat. This elation was short-lived when the Imperials deployed an AT-DP walker that was armed with the Duchess, an arc generator that Sabine had helped to develop during her days at the Imperial Academy. Recognizing the weapon's sound waves, Sabine tried to warn her mother and brother. However, the comlink signal was cut off.\nSabine and her allies arrived at the battlefield where they found the charred armor and disintegrated bodies of several Clan Wren warriors. Stricken by grief and guilt, Sabine collapsed in tears, believing that her mother and brother had died. Fortunately for Sabine, Ursa and Tristan had managed to take shelter and survived the weapon's effects. The group was then attacked by Imperial Super Commandos and TIE fighters, but managed to escape aboard one of Bo-Katan's Gauntlet fighters. After a brief aerial skirmish, the rebels and Mandalorians managed to retreat to Bo-Katan's camp.\nDuring the journey, Sabine was accosted by a furious Bo-Katan, who was angered to learn that Sabine had created the \"Duchess,\" a weapon that could target Mandalorian armor. By reacting with the beskar alloy in Mandalorian armor, the Duchess turned the strength of the Mandalorians against them. Sabine had destroyed the weapon but was distraught to learn that the Empire had used her research to create another one. When Ezra asked the Mandalorians why they did not make their armor from another alloy, Sabine explained that the armor was ancestral heirlooms passed down to the next generation. At Bo-Katan's camp, Sabine was greeted with hostility by some of the Mandalorians, who resented her earlier collaboration with the Empire as a young cadet. Bo-Katan spoke out in Sabine's defense, warning that attacking her would antagonize Clan Wren.\nSabine offered to atone for her misdeeds by leading an attack to destroy the \"Duchess\" once and for all. With the aid of Bo-Katan, the rebels and Mandalorians devised a plan to raid Tiber Saxon's Star Destroyer above Sundari. One team would destroy the weapon while the other would erase the weapon's blueprint from the Imperial database, ending the threat once and for all. In private, Fenn Rau and Bo-Katan confided that Sabine had a lot of potential for leadership of Mandalore. The Mandalorians and rebels infiltrated Tiber Saxon's Star Destroyer, which was docking above Sundari.\nThey managed to sneak into the hangar but were spotted. At the advice of Thrawn, Tiber Saxon had concocted a plan to trap Sabine in order to force her to harness the arc generator's full potential. While Kanan, Ezra, and Chopper searched for the Imperial databases, Sabine and Bo-Katan went to find the Duchess. The two managed to find the weapon but were ambushed by Tiber, who unleashed the weapon's energy rays on them. Tiber forced Sabine to strengthen the machine's power. However, Sabine instead reprogrammed the Duchess to target anyone wearing stormtrooper armor, including Saxon himself, who activated the weapon unknowingly and accidentally targeted his own forces. Sabine considered killing Saxon, but relented after Bo-Katan warned her that doing so would make her little better than the Empire.\nHeeding Bo-Katan, Sabine spared Saxon and instead slashed the Duchess' power core with the Darksaber. The rebels and Mandalorians then escaped as Saxon's Star Destroyer exploded due to the malfunctioning weapon. Arriving back at Bo-Katan's camp, Sabine reassured Bo-Katan that she was the rightful leader and once again offered her the Darksaber. Sabine's family and Fenn Rau then joined the other Mandalorian clans in swearing allegiance to Bo-Katan, who accepted the Darksaber and the mantle of leadership over the Mandalorian clans.\nFollowing the events on Mandalore, Sabine and the other Spectres traveled aboard the Gauntlet to Yavin 4 to join the larger Rebel Alliance. Upon arriving, they were greeted by Zeb. Shortly later, Hera's squadron of Y-wings returned from a supply run. Hera's Y-wing had sustained damaged during the run and almost collided with the Spectres. Sabine and the other Spectres then attended a briefing with the Alliance leadership including Mon Mothma, Senator Bail Organa, General Dodonna, and the former Imperial Agent Kallus.\nUsing intelligence supplied by Saw Gerrera, the rebels had learned that the Empire was tracking their movements using a relay station on the planet Jalindi. While the Alliance disagreed with Saw's ruthless and violent methods, they reluctantly used his information. At the advice of Kallus, the Spectres agreed to undertake a mission to insert a spike on the Jalindi relay's dish. While traveling to Jalindi, Hera and Kanan briefed Sabine, Ezra, and Chopper about their plan. To avoid detection, the rebels would only activate their jetpacks at the last moment.\nThe Spectres' plan proceeded initially and Sabine and her comrades managed to land on the Jalindi relay. Before they could plant the spike, they were interrupted by the arrival of Commander Brom Titus' light cruiser Marauder. After failing to distract Titus, Sabine opted to destroy the Jalindi relay with detonators. While she attached the detonators, Ezra fought with the relay's stormtroopers while Chopper realigned the dish in order to disorient the defenders. The Ghost was unable to assist since it was being pursued by TIE Defenders.\nDuring the skirmish, Sabine saved Ezra from falling out of the dish. Shortly later, Saw Gerrera arrived in a U-wing piloted by the Partisan Edrio. He offered Sabine and her comrades a lift, which they gladly accepted. After escaping aboard the U-wing, Saw destroyed the Jalindi relay and the Marauder with proton bombs. Before the Ghost could dock with Saw's U-wing to pick up the Spectres, a Star Destroyer emerged from hyperspace. Before jumping into hyperspace, Saw invited Sabine and her comrades to \"fight with a real army for a change.\"\nWhile traveling through hyperspace, Saw briefed Sabine and the others about his quest to investigate why the Empire had exterminated the Geonosians, and what they were hiding. Saw informed that he had intelligence that the Empire was smuggling something through Faos Station. Despite Chopper's objections, Sabine and Ezra agreed to the mission. After arriving, Sabine gave Chopper a new paint job to disguise him as an Imperial droid. While Sabine saw no sign of the Empire at the station, Saw countered that the Empire was hiding in plain sight.\nThe rebels infiltrated Freighter 2716 by hiding in a cargo container pulled by Chopper. While the freighter traveled through hyperspace, Edrio followed in Saw's U-wing using Saw's tracker. Aboard the freighter, the rebels discovered an Imperial shuttle in hold 12 and that hold 17 was a restricted area. After subduing the stormtrooper sentries, the rebels discovered that hold 17 was holding several power and reactor technicians who had been kidnapped by the Empire for an unknown purpose.\nWhile Ezra advocated evacuating the civilians aboard the Imperial shuttle in hold 12, Sabine pointed out that the hangar was guarded and proposed using the ship's escape pods. Sabine also advocated shutting down the ship's hyperdrive to force the ship to jump out of hyperspace so that they could escape. While Sabine and the other rebels made their way to the hyperdrive, Chopper was tasked with leading the civilians to the escape pods. On the way, Ezra heard \"singing\" emanating from a door through the Force.\nInside, the rebels encountered a squad of death troopers. After subduing most of the troopers except their commander DT-F16, the rebels discovered that the freighter was transporting a giant kyber crystal. Meanwhile, DT-F16 alerted the ship's commander, who jettisoned the escape pods to prevent the rebels and civilians from escaping. While Saw was determined to follow the freighter to its destination so that they could find out what the Empire was doing to the crystal, Sabine and Ezra insisted on safeguarding the civilians aboard. Saw agreed to guard the crystal while Sabine and Ezra headed to the engine room.\nSabine and Ezra managed to subdue the guards there but were stunned by Saw before they could disable the hyperdrive. Upon awakening, Sabine and Ezra found themselves restrained in binders. They also discovered that Saw had brought the crystal into the engine room. Shortly later, the freighter exited hyperspace in the empty Tonnis sector where it was intercepted by Captain Slavin's Star Destroyer, which had come to pick up the crystal. Frustrated that the mission had failed its objective, Saw destabilized the kyber crystal with Ezra's lightsaber and damaged the hyperdrive; seeking to create an explosion.\nDespite their differences, Sabine and Ezra managed to convince Saw to remove their restraints. Still determined to rescue the civilians, the rebels declined Saw's offer of a ride. After arranging with Chopper to bring the civilians to the shuttle in hold 12, Sabine and Ezra raced there and fought DT-F16 and her remaining troopers. The rebels and civilians then escaped aboard the shuttle before the kyber crystal exploded and destroyed both the freighter and Slavin's Star Destroyer. Though the rebels escaped the inferno, their shuttle's engines were damaged.\nFortunately for Sabine and the others, they were picked up by the Ghost. The liberated civilians volunteered to join the Rebellion out of gratitude to their rescuers. Sabine and Ezra briefed Kanan about their second encounter with the kyber crystal. When Sabine asked if it was possible to weaponize these crystals, Kanan replied that he was unsure.\nAfter the Alliance received intelligence about the Empire's new TIE/D Defender Elite project on Lothal, Sabine accompanied the Spectres on an undercover mission to the Imperial–occupied world. The crime lord Vizago managed to smuggle the Spectres in his ship Broken Horn while delivering a shipment of puffer pigs. After landing on Lothal, the Spectres split up to evade their Imperial pursuers. Sabine along with Ezra and Chopper visited the late Old Jho's former cantina in Jhothal, which had been taken over by the Empire.\nWhile Chopper waited outside, Ezra and Sabine ordered some drinks. They learned that Jho had been executing for aiding the Rebellion and that the Imperial pilot Baron Valen Rudor was now managing the cantina. Sabine had to caution Ezra not to show anger when Rudor ridiculed Jho. Before Rudor could question the strangers further, the two rebels were met by the former cadet Jai Kell, whom Ezra had rescued from the Grand Inquisitor years earlier. Kell managed to allay Rudor's suspicion by paying the Spectres' drinks. After leaving the cantina, Jai revealed that he had joined Ryder's Lothal resistance group and contacted Ryder to arrange an extraction.\nSabine and the Spectres soon reunited and escaped down Jhothal's sewers. Pursued by Imperial forces, the rebels used starbirds graffiti etched onto the walls to guide them to Ryder's rendezvous point. After eluding stormtroopers, the rebels managed to exit the sewers and meet Ryder, who evacuated them aboard a U-wing.\nLater, Sabine along with Ezra, Zeb, and Ryder Azadi stalked the Imperial testing facility where the TIE/D Defender Elite was being stabled. After confirming the starfighter's existence, Sabine proposed stealing the ship's flight data recorder so that the Alliance would know the fighter's capabilities. Despite problems bringing the weapon back to Yavin 4, Sabine and Ezra decided to pursue their plan. Infiltrating the base, the Sabine entered the TIE/D Defender Elite while Ezra kept watch. Before Sabine could extract the flight data recorder, Grand Admiral Thrawn and Governor Pryce arrived at the airfield to witness a test flight.\nBefore Commander Vult Skerris could enter the fighter for a test flight, Ezra distracted the stormtroopers and a gunfight broke out. Surrounded by death troopers, Sabine and Ezra flew away with the Defender Elite. Before leaving, Sabine used the fighter's armament to destroy the parked TIE fighters, TIE Interceptors, and Thrawn's shuttle. While flying the TIE Defender Elite, Sabine told Ezra that the fighter was equipped with a hyperdrive and suggesting using the craft to return with the flight recorder to the Rebellion. However, the Defender was pursued by three TIE Interceptors.\nWhile Ezra engaged the Interceptors in a dogfight, Sabine deactivated the homing beacon so that the Empire could not track them down. However, Governor Pryce activates the kill-switch. Sabine managed to cut off the signal which allowed the fighter to land on its remaining wing in Lothal's wilderness. Despite the loss of the TIE/D Defender Elite, Sabine proposed recovering the starfighter's hyperdrive so that they could install it on Ryder's U-wing. After hiding the hyperdrive, Ezra and Sabine traveled with the flight data recorder through the wilderness while evading Imperial gunships. During their travels, the two encountered a loth-wolf, a mythical creature long believed to be extinct. The loth-wolf put Sabine to sleep before interacting with Ezra. The loth-wolf then carried the two young humans to a clearing where they were picked up by Hera and Kanan, who had come in Ryder's U-wing.\nThe following day, Sabine stayed behind at the Lothal resistance camp while Ezra, Zeb, and Jai Kell returned to the crash site to retrieve the hyperdrive. While waiting, Sabine expressed doubt that she would be able to install the hyperdrive on the aging U-wing but Hera reassured Sabine that she had faith in her abilities. Despite being pursued by Imperial forces, Zeb managed to return to the camp with the hyperdrive using a stolen Imperial Troop Transport. Sabine and the other rebels initially mistook Zeb's hijacked transport for a \"hostile\" but were mollified to see Zeb with the hyperdrive. Sabine then got to work on installing the hyperdrive onto Ryder's U-wing. This enabled Hera and Chopper to escape off-world with the stolen flight data recorder. Sabine and the other rebels then fled Imperial forces into a network of underground caves with the help of a pack of loth-wolves. The wolves led the Spectres and Ryder into a mountain ledge. After doing calculations, Sabine surmised that they had entered Lothal's southern hemisphere.\nAfter setting up base inside the caves, Sabine and the other rebels encountered Mining Guild Ore crawler Crawler 413-24, which was harvesting Lothal's surface for raw minerals. When Zeb recommended boarding the transport, Sabine concurred after discovering that the crawler had a long-range transmitter. While Ryder and the other Spectres followed in a speeder, Sabine used her jetpack to scout the walker and take out a sentry droid with a paralyzing dart. After Ezra, Kanan, and Zeb boarded the crawler, Ryder drove away in his speeder. Once inside the crawler, the Spectres overpowered the Trandoshan Mining Guild captain Seevor but failed to prevent him from alerting the Mining Guild.\nSabine then repaired the old transmitter and discovered a signal originating from the reactor room. While Sabine and Ezra manned the bridge, Kanan and Zeb went to investigate. Below, they encountered several indentured prisoners including Vizago but were attacked by the foreman Proach. Following a struggle, Zeb managed to kill Proach. When Imperial forces responded to Seevor's distress signal, Sabine along with Ezra and Kanan hid in the bridge's cupboards while Zeb disguised himself as the foreman and Vizago pretended to be the captain. This convinced the Imperials, who promptly withdrew. However, Seevor managed to escape through the ventilators into the engine room and shut down the reactor. Sabine powered up the transmitter while Ezra fought and killed Seevor.\nAfter repairing the transmitter, the Spectres were able to re-establish contact with Hera. Hera informed them that Rebel Command had authorized a strike on Lothal. The Spectres on Lothal were designated as the ground support team. The liberated prisoners including Vizago also joined the rebel cause out of gratitude to their rescuers.\nDuring the Alliance's failed strike against Lothal's Imperial factories, Sabine, along with Kanan, Ezra, and Zeb planted explosives on the anti-air defenses outside the Imperial Armory Complex. When Zeb asked if the explosives were powerful enough, Sabine reassured him that they would work. After planting their explosives, the rebels retreated on speeder bikes with Sabine igniting the detonator. Despite achieving this objective, the rebels were forced to abort the attack after Grand Admiral Thrawn inflicted heavy casualties on Hera's strike force. While retreating back to Ryder's camp, Kanan headed back to Capital City to rescue Hera. Sabine wanted to follow Kanan but Ezra reassured her that Kanan would handle the situation.\nAfter regrouping at the Lothal cliff dwelling, Sabine took part in the Spectres' mission to rescue their leader Hera Syndulla. While planning their rescue mission, Sabine accompanied Ezra and Zeb to Ezra's former \"roost.\" After Ezra sensed that Hera was in the Imperial Complex, Sabine then confirmed that Hera was in Governor Pryce's office on the 157th level of the Imperial Complex. Sabine then joined Ezra, Zeb, and Chopper in assembling three Loth-bat gliders. While Ezra had proposed the idea, Sabine seconded it on the grounds that the Empire was equipped to target high-tech machinery and would overlook low-tech gliders.\nFor the mission, Sabine and Ezra donned TIE fighter pilot uniforms while Kanan cut his hair. Sabine, Ezra, and Kanan rode the gliders while Zeb and Chopper towed them into the air using a speeder bike. Using the gliders, the Spectres managed to land at the Imperial Complex's south entrance garbage chute. While Kanan went to rescue Hera, Sabine and Ezra infiltrated the Imperial complex's hangar bay. When Sabine heard the alarms go off, she and Ezra realized that Kanan had rescued Hera. She and Ezra then boarded a patrol transport disguised as the pilot and co-pilot respectively. They were accompanied by several stormtroopers, who had been dispatched by Governor Pryce to hunt down the escapees.\nAfter learning that Hera and Kanan had headed to the Lothal City fuel depot, Sabine and Ezra dumped the stormtroopers on their transport overboard. Sabine then shot down another transport while Ezra took another out with his lightsaber. Sabine and Ezra then managed to rendezvous with Kanan and Hera at the Lothal City fuel depot, finding the couple embracing each other. Before they could leave, Governor Pryce arrived with a phalanx of AT-AT walkers and opened fire on the depot. Kanan used his Force powers to hold back the energy wave but was killed during the explosion. Sabine and the other Spectres escaped on their gunship.\nFollowing the death of Kanan, Sabine and her fellow Spectres mourned the death of their comrade. After hearing Alton Kastle announce a parade in Capital City to celebrate the Empire's \"victory,\" Sabine and Zeb decided to sabotage Pryce's parade in the Capital City in order to avenge Kanan's death. When she and Zeb arrived on the outskirts of Capital City on their speeder bikes, Sabine initially believed that the Empire had grown and that the rebels were outnumbered. However, Zeb pointed out that the Imperial factories were not belching out smoke. As a result, the two realized that Kanan's sacrifice had not been in vain.\nZeb then knocked out a scout trooper, which enabled Sabine to use the trooper's bike to tap into the local Imperial network. As a result, Sabine learned that the TIE Defender factory had been damaged during the fuel depot's explosion and realized that Pryce was trying to cover that up by holding a parade. She then vowed to get even with the Empire. Before leaving, Sabine planted a bomb on the scout trooper's bike. Sabine and Zeb's presence attracted the attention of the Noghri tracker Rukh, who had been sent by Thrawn to hunt down the remaining Specters.\nAfter witnessing the explosion, Sabine then saw the \"thing\" she and Ezra encountered at the airfield. Knowing they could not let Rukh track them back to their base, Sabine and Zeb decided to ambush him. However, Rukh activated his cloaking device, which gave him an initial advantage. Sabine tried to shoot at Rukh with her rangefinder but the athletic Noghri was able to dodge her shots. Sabine then used a paint bomb on him that allowed Zeb to knock him out. When Zeb attempted to pummel Rukh to death, Sabine stopped him. After convincing Zeb to spare Rukh's life, she spray painted Rukh and sent him back to the Capital. Upon their return to the base, Sabine told Hera, Chopper, and Ezra that Kanan's death had not been in vain since they had managed to shut down the TIE Defender factory.\nAt the urging of Ezra, Sabine and her fellow Spectres embarked on a mission to save the Lothal Jedi Temple from the Empire. Prior to the mission, Sabine and her comrades examined a key stone that the loth-wolf \"Dume\" and his pack brought from Lothal's Jedi Temple. Sabine and her companions then traveled to the Jedi Temple on a pack of loth-wolves that Ezra had summoned. Despite the temple being located in the northern hemisphere, the loth-wolves were able to hasten the journey by generating hyper tunnels.\nUpon arriving at the Lothal Jedi Temple, the Spectres discovered that the Empire and Mining Guild were excavating the Temple. With the help of Zeb, the Spectres were able to obtain two sets of scout trooper armor. Sabine assumed the identity of the scout trooper LS-515. Infiltrating the camp, Sabine and Ezra began examining several artifacts but were reprimanded by the Imperial Minister Veris Hydan, who was supervising the dig. After escaping the notice of Hydan and a Death trooper commander, the Spectres tapped Hydan's communications with the help of Chopper.\nThe rebels subsequently learned that the Emperor was interested in a painting of the Mortis gods, which Hydan believed was the key to unlocking the temple's secrets. Sabine and Ezra headed to the mural and used the key stone to begin decoding the \"Gateway.\" Sabine subsequently drew the attention of a pair of stormtroopers, who asked LS-515 why she was not on patrol. Dissatisfied with her answer, they brought her to Minister Hydan who identified her as a rebel spy. Hydan then attempted to apprehend Ezra but he managed to flee into a portal, which led to a mystical realm known as the World Between Worlds.\nAfter Hydan had locked down the camp, Sabine was brought into his mobile command center. Minister Hydan attempted to flatter Sabine by praising her artistic talents but Sabine remained uncooperative and defiant. As the conversation continued, Hydan mocked Ezra's ability to survive in the World Between Worlds and warned that the Emperor would eventually find him. Sabine soon realized that whoever controlled the portal to the World Between Worlds would also control time and the fate of the universe. When Hydan quizzed her about the Mortis gods, Sabine taunted that she was \"smarter than him.\" Hydan then forced her to cooperate by ordering one of his death troopers to strike her across the head with his rifle butt.\nTogether, Sabine and Hydan studied a holographic project of the painting of the Mortis gods. The two realized that the Father was pointing the way to the portal and that the wolves were the portal guardians. When Sabine asked about the convor, Hydan speculated that the creature was a servant of the Daughter or the Daughter acting as a spirit guide. As a result, Sabine realized that if the Daughter opened the \"Gateway,\" the Son was the key to closing the portal. Shortly later, a stormtrooper reported that something was happening to the portal. At that point, Sabine heard a faint knocking from Zeb as Hera activated the command center's thrusters. With the command center tilting on its top, Sabine took the opportunity to escape and shot a death trooper.\nAs the mobile command center collapsed on a pile of crates, Sabine and her fellow rebels fled towards the painting of the Mortis gods. There, they were joined by Ezra, who had encountered Ahsoka Tano and barely escaped the Emperor. At the urging of Ezra, Sabine and Zeb helped him to seal back the portal. Zeb lifted Ezra up, enabling him to touch the Son who sealed the \"Gateway.\" This caused the Lothal Jedi Temple to the ground, taking a distraught Hydan with it. Sabine and her rebel comrades then escaped on a Mining Guild excavation driller that Chopper had commandeered. Sabine drove the stolen transport away from the Jedi Temple. Later, they returned and found that the temple had sunk completely into the ground.\nAfter returning to the Lothal Resistance's base, Sabine and the other rebels attended a briefing to discuss their plan to take Capital City back from the Empire. Since the rebels lacked the numbers to capture Capital City, Ezra and Ryder Azadi concocted a plan to lure Governor Pryce and her forces to their base. As part of the ruse, Ryder pretended to betray his fellow rebels to the Empire.\nAs planned, Governor Pryce led a fleet of patrol transports, jumptroopers, and stormtroopers to the rebel cliff base. During the skirmish, Sabine, using her jetpack, was able to take out several of the jumptroopers and the transport. As Governor Pryce's forces encircled the rebels, Sabine and the others retreated to a defensive position on top of their captured ore crawler. However, Pryce ordered one of her gunships to destroy the ore crawler. Amidst the falling debris, Sabine managed to rescue Vizago but they were captured by the Empire.\nWhen Governor Pryce thanked Ryder for his help, Sabine pretended to be angry at him, only to reveal that Ryder had merely lured Pryce into a trap. As Hera arrived with reinforcements, Sabine then had Chopper jam the Imperial forces' communications. With the help of Hera's reinforcements and the loth-wolf pack, Sabine and her rebel comrades were able to defeat the Imperial forces and capture Pryce.\nSabine then took part in a rebel operation to infiltrate the Dome, the center of Imperial power on Lothal. Using the captive Pryce, the rebels managed to land their stolen patrol transports on the Dome's executive landing platform. After landing, Sabine and Zeb engaged stormtroopers in a gun battle while Ketsu unlocked the blast doors. Following a brief skirmish, the rebels were able to take control of the Dome's control room and issue a faux Protocol 13 to recall all Imperial forces to the Dome.\nAfter the majority of Lothal's Imperial forces had evacuated aboard the Dome, Sabine then prepared to fire the Dome's thrusters, which had not been fired in years. The Dome was a mobile Imperial Planetary Occupation Facility. However, their plan was delayed by the arrival of Thrawn and his Star Destroyer Chimaera. Sabine then told Rex to raise the planetary shields but they had been disabled by Rukh. As a show of force, Thrawn bombarded parts of Capital City and demanded that Ezra meet him aboard the Chimaera to surrender.\nFollowing Thrawn's ultimatum, Sabine and the other rebels debated their next move. Though Hera did not want Ezra to go, Sabine and Chopper helped Ezra to escape aboard a patrol transport to confront Thrawn. In Ezra's absence, Sabine convinced Hera and Rex to trust in Ezra's decision. After studying the base's schematics, she came up with a plan to raise the shields and take control of the two power terminals. Hera approved of Sabine's plan in order to buy Ezra more time.\nUnder Sabine's leadership, the rebel forces were split into two teams which went to secure the northern and southern power terminals. Despite resistance from Rukh's Imperial forces, the rebels managed to secure the power terminals. During the course of the mission, Sabine guided her rebel comrades and even sealed a blast door to aid Rex's team. Though Chopper was electrocuted by the network terminal, Sabine told Rex to find the shield generator's manual override. As a result, the rebels were able to reactivate the Dome's shield generator, shielding Capital City from Thrawn's second bombardment wave.\nAfter a pod of purrgil summoned by Ezra devastated much of the Imperial fleet and carried away Thrawn, the Chimaera, and Ezra himself, Sabine got Chopper to fire up the Dome's thrusters. After lift-off, Sabine and her fellow rebels evacuated aboard the Ghost before Imperial troops retook the control room. Following their evacuation, Sabine detonated the detonators inside the Dome, destroying the Imperial base and wiping out much of the Imperial garrison on Lothal. Before she did so she said, \"For Kanan and Ezra.\"\nFollowing the destruction of the Dome, Sabine and the other Spectres listened to a pre-recorded hologram message by Ezra telling them that they were the best family he could hope for. The rebels then gazed down over Capital City as the Ghost did a fly-over.\nFollowing the Battle of Jakku and the Empire's fall, Sabine remained on Lothal to defend it in honor of Ezra and his sacrifice. She reflected on the separate paths taken by her fellow rebel comrades in the aftermath of the Liberation of Lothal. To honor her rebel cell's contributions to freeing Lothal and sense of family, she painted a mural of them flanked by loth-wolves and loth-cats. At some point following the disintegration of the Empire, Sabine traveled with the former Jedi Padawan Ahsoka Tano on a quest to bring Ezra home.\nBy the time of the outbreak of the conflict between the Resistance and the First Order, Sabine Wren was credited by the renowned painter, poet, and intellectual Janyor of Bith with painting several pro-Rebellion and anti-Imperial propaganda posters including Defaced Join and Fly For Freedom. However, her authorship of Join the Rebellion was disputed. Historians also speculated that Sabine's work inspired the Commission for the Preservation of the New Order artist Coba Dunivee's Imperial Campaign Poster 34.371.C.\nSometime after the Battle of Crait, the now-retired Wedge recalled his experience escaping Skystrike Academy upon arriving at Coronet City on Corellia, remembering how he was prepared to defect to the Rebellion when Sabine arrived.\nA free-spirited young woman with an artistic flair, Sabine Wren was driven by a desire to express herself artistically, and a fundamental distaste for following instructions she disagreed with. Despite her frequent feisty and sarcastic quipping, she rarely let personal feelings get in the way of her job and remained focused on the objective at hand, though she still did her job with her unique artistic panache. One of her trademarks was to paint different rebel insignias with her airbrushes when the Spectres carried out their missions.\nAs an artist, Wren appreciated color and saw artistic license in her explosives. She saw the galaxy as her canvas—everything from her hair and armor to the walls of the Ghost could be improved with bursts of color and an expressive line, and took particular delight in repainting Imperial gear, armor, and vehicles, turning the Empire's dark and drab equipment into expressions of freedom. Wren had a practice makes perfect attitude to her art, and so, whenever she was struck by inspiration, she tended to paint on whatever there was at hand, and would work on her art aboard the Ghost during her downtime. A major influence in her works was Janyor of Bith. She also enjoyed compliments and talking about art, though she knew better than to trust Lando Calrissian's silver tongue when he tried to flatter her.\nThough her training in the Mandalorian warrior traditions  were often at odds with her artistic sensibilities, she was proud of her riotously colored armor, which was like a second skin to her, and sometimes forgot she had it on and fell asleep in it. Her armor's breastplate had a starbird painted on it; the legendary creature, which represented her own free spirit and desire to liberate the galaxy from the Empire, had become her symbol and trademark.\nShe exuded confidence in her combat skills, often facing off against numerous foes with ease. Despite her bravado, she occasionally doubted the possibility of defeating the Empire based on her past as an Imperial cadet. That past, in which a younger Wren had once trusted the Empire implicitly and followed its orders blindly, was marked a nightmarish experience that opened Wren's eyes to the Empire's true nature, and had caused her to despise the Imperial regime. This experience made her instinctively rebel when asked to follow orders unquestioningly. As she grew to dislike secrecy, Wren sometimes let her more juvenile side cloud her better judgment in these matters. She also developed a somewhat callous streak towards Imperial enemies. Although Sabine performed many successful missions for the Rebel cause, she would still experience some nerves before some of their bigger missions. She enjoyed being challenged and found some excitement in her operations. During her academy training, Wren also had a few bad experiences with underwater missions that led her to develop a strong dislike for water; it could also wash away art, which she thought should never be allowed to happen.\nBecause of her resourcefulness and improvisational gifts, Kanan Jarrus and Hera Syndulla deferred to Wren when to improvise a plan or in case they needed to devise an entire operation, trusting her skills and knowledge. As noted by Ezra Bridger, Wren was something of a loner among the crew of the Ghost, spending a lot of time in her room, and showing a tendency to eat and do combat practice on her own. Although the crew took a long time to all bond, their hostile arguments turned into comfortable disagreements as they went through both good and bad times together. They learned to rely on and trust each other and shared a hope that kept them all going.\nWren was tormented by guilt over her role in helping the Empire to build weapons used to subjugate Mandalore. When she spoke out, her family chose to side with the Empire and cast her out. Unable to cope with her past, Wren found comfort and self-expression in art and graffiti. She initially regarded the Darksaber as an ill omen for bringing nothing but trouble to her family. As a result, Wren was initially unwilling to assume the responsibility and leadership which came with wielding the weapon. With the help of Bridger, Rau, and Jarrus, Wren managed to overcome her fears and to master the weapon. After her trials, Sabine found the inner strength to meet with her estranged family. Despite the hostility of her mother Ursa, Sabine still found the courage to stand up for her beliefs and values. Sabine regarded Gar Saxon as a traitor for his role in murdering the Mandalorian Protectors, whom she regarded as true Mandalorian patriots. Despite her ideological differences with her family, Sabine still respected her parents and her brother Tristan.\nSabine refused to abandon her rebel comrades Kanan and Ezra even though her mother Ursa had tried to trade them with Saxon for the safety of her family. Sabine and her family repaired their strained relationship after Gar Saxon reneged on his deal with Ursa and tried to destroy Clan Wren. Due to Bridger and Jarrus' training, Sabine found the fortitude to take on the Viceroy in single combat. Sabine was also magnanimous in victory and decided to spare Saxon's life. Saxon, however, did not return the favor and tried to shoot her in the back. Seeking to rebuild ties with her family, Sabine elected not to return with Ezra and Kanan to the rebellion. Instead, she dedicated herself to helping Clan Wren to reunite the Mandalorians. While Sabine did not regard herself as Mandalore's new leader, she vowed to help her people find that individual.\nLater, Sabine's loyalty to her rebel friends led her to convince her mother, Ursa Wren, and Fenn Rau to lend forces to help the besieged Phoenix Squadron and Massassi Group during the Battle of Atollon. As a warrior, Sabine was familiar with the military strategy and proposed concentrating the Mandalorian attack on the Imperial Interdictor vessel in order to facilitate the rebels' escape.\nThe older Sabine regretted her youthful idealistic naivety which led her to build the \"Duchess,\" an energy weapon capable of turning the beskar alloy inside Mandalorian armor against their wearers. Seeing the weapon being used to subjugate Mandalore turned her against the Empire. Sabine's desire to atone for her past wrongs led her to lead a joint Mandalorian-rebel mission to destroy the weapon. Sabine's love for her family led her to save her father. Sabine was distraught when she thought that her mother Ursa and brother Tristan had perished at the hands of the \"Duchess.\" While Sabine could be passionate and vengeful towards foes like Tiber Saxon, she chose not to descend to the same level of her enemy at the urging of Bo-Katan. Bo-Katan recognized Sabine's potential as a military leader. In return, Sabine recognized Bo-Katan's leadership qualities and successfully convinced her to assume the Darksaber and the mantle of Mandalorian leadership.\nWhile Sabine along with Ezra agreed to help Saw Gerrera in his quest to uncover the Empire's secret weapon, they became disillusioned with Saw's callous disregard for the lives of non-combatants and his determination to achieve results by any means necessary. As a resourceful fighter who planned ahead, Sabine advocated stealing the TIE/D Defender Elite's flight data recorder to aid the Alliance's war effort against the Empire. After losing their escape transport, Sabine proposed recovering the fighter's hyperdrive so that they could use Ryder's U-wing to transport the flight recorder back to the Rebellion.\nSabine's sense of comradeship led her to participate in a mission to rescue Hera. Sabine was devastated by the death of Kanan and sought revenge against the Empire. However, she came to make peace with Kanan's sacrifice upon realizing that he had helped advance their mission to knock out Thrawn's TIE Defender factory on Lothal. Despite her hatred of the Empire, Sabine acted as a voice of caution and stopped Zeb from pummeling the Noghri Rukh to death. Sabine also maintained a defiant face towards Minister Hydan and was unmoved by his flattery.\nAfter Ryder Azadi pretended to betray the Spectres and their rebel allies, Sabine feigned anger at him. Sabine also showed leadership and ingenuity when she devised a plan to reactivate the Dome's shield generators that involved splitting the rebels into two teams. Sabine regarded her fellow Spectres as family and painted a mural of them in honor of their memory. Her bond to Ezra led her to undertake a quest with Ahsoka Tano following the Battle of Endor to bring him home.\nUrsa Wren was Sabine's mother and the matriarch of Clan Wren. When Sabine, Ezra Bridger, Kanan Jarrus, and the Mandalorian Protector Fenn Rau set out on a mission to Krownest to recruit Clan Wren to help the Rebellion, Ursa was very reluctant to trust her daughter at first due to her past mistakes that had lasting ramifications for Clan Wren and also all of Mandalore. However, after Gar Saxon's betrayal, she changed her mind, shooting and killing Saxon after he tried to shoot Sabine in the aftermath of their duel that saw Sabine defeat him. Ursa then was pleased to have Sabine stay with them even as her Rebel friends returned to their cause. Ursa later went on to assist her daughter in the rescue of her husband, Alrich, which they successfully did with the help of Sabine's Rebel friends, and worked with her and Bo-Katan Kryze in destroying Tiber Saxon's Star Destroyer and the \"Duchess\" superweapon, allowing her daughter to right her wrongs and destroy the weapon that she had helped create.\nThough she was first and foremost a free-spirited artist, Wren had been trained as a Mandalorian warrior from an early age, and had extensive expertise and knowledge in weaponry, as well as proficiency in numerous combat skills. A prodigy of sorts, accomplished and acrobatic warrior and saboteur, both Hera Syndulla and Kanan Jarrus had the greatest respect for Wren's skills and trusted her expertise on the inner workings of the Imperial military, a remnant of her past as a cadet at the Imperial Academy on Mandalore. As munitions specialist of the Ghost crew, she maintained and tuned all weapons but her crewmates' lightsabers, but also created many of the explosive devices she and the team used. She also took lessons from Kanan and Ezra in lightsaber combat after she took the Darksaber from Dathomir. Sabine claimed to be able to track Ezra Bridger by his smell.\nAs a demolitions expert, Wren could rig anything to explode, and in a fashion that was not only effective but also artistic. She had the knowledge to manufacture her own explosives, and had enough knowledge of how the chemical elements of explosives worked in conjunction with fuels and even other munitions to create explosions infused with her unique touch. Also trained as an electronics and munitions engineer, she had used such skills to tinker with her twin WESTAR-35 blaster pistols effectively, allowing her to increase their power efficiency and adding other features. She demonstrated enough piloting skills to man a Gozanti-class cruiser, a Lambda-class T-4a shuttle, the auxiliary starfighter Phantom, a Hammerhead corvette, and an Imperial Troop Transport, most of them in non-combat situations. However, onboard the Ghost, she usually served as a gunner.\nCalling on her skills as a slicer, Wren used her much-tinkered computer-linked gauntlets to break into the Imperial encryption of Tseebo's implants, and to help Chopper slice into an Imperial transmission system by preparing a data spike. Wren also had some skills as a mechanic, repairing the Ghost or the Phantom when the need arose.\nFluent in several languages, Wren had the ability to learn new languages quickly. Before she left the Academy, she was the fastest cadet to complete the language unit during espionage training. She spoke Galactic Basic Standard, Mando'a, Huttese, Rodian, Aqualish, Binary, and some Shyriiwook. During her days at the Imperial Academy, Sabine used her mechanical talents to build an Arc Pulse Generator known as the \"Duchess\". However, she turned against the Empire after learning that the weapon was used to subjugate Mandalore. As the creator of the Duchess, Sabine was the only one who could truly master its full potential.\nWhile Wren was a skilled fighter, she was initially unable to match the Force powers and experience of Kanan Jarrus at the start of her training. Under Bridger's tutelage, Wren became familiar with lightsaber fighting strokes by sparring with sticks, eventually defeating him. She also learned how to wield the Darksaber against Jarrus's lightsaber during a training session. Wren was also a competent pilot and was able to land the Phantom II safely on Krownest despite the ship being damaged by enemy fire. Though her brother proved to be more skilled with the weapons, Sabine was also competent when fighting with metal rods against her brother as well as a training saber. Due to Jarrus and Bridger's tutelage, Sabine was able to use a combination of Mandalorian gadgets and her lightsaber skills to defeat Gar Saxon and take possession of the Darksaber.\nSabine was adept at undercover missions due to her Imperial Academy background. She posed as an Imperial pilot and later as a scout trooper during two missions on Lothal. Sabine also used her talent with art to decipher a Lothal Jedi Temple key stone, which was crucial to unlocking a Gateway to the mystical World Between Worlds. On missions, she would frequently take time to paint Rebel starbirds on nearby walls or buildings, a stylized symbol that evolved from her personal signature to the symbol of the Rebel Alliance. Throughout her time with the Rebellion, she painted many Alliance vehicles, including her Joben T-85 speeder bike, the Phantom, the Phantom II, and Hera Syndulla's U-wing. She also was responsible for several important paintings, including the posters Fly For Freedom and Defaced Join and a portrait honoring an iconic New Republic pilot who saved many lives at the Criigo insurrection.\nWhile Sabine was a skilled fighter on the battlefield who was able to take out jumptroopers, she also had an appreciation of strategy and devised a successful plan to restart the Dome's shield generator.\nWren wore a suit of Mandalorian armor which she heavily customized after leaving Mandalore, no longer being bound by the restrictions placed on armor customization by the Death Watch. She kept the insulating body glove to which the armor bonded, but stripped away much of the rest to give the greatest amount of mobility possible, keeping only the collar armor, ankle plates, breastplate, knee, elbow and shoulder pads. She also wears a pair of knee-high boots, which kind of look like rain boots/galoshes. The only part of her armor that Wren did not reduce or personalize was the Nite Owls helmet she wore, as she had inherited it; nevertheless, she did upgrade the comlink-incorporated helmet's interior electronics. The headwear retained its traditional targeting viewfinder and macrobinocular viewplate and, though it featured a variety of control interfaces, Wren rarely used them. She did, however, make use of the helmet's holo-imager, using its video and image recording features to capture her artistic efforts. She also wore a pair of computer-linked gauntlets, but rarely used their weaponized components or her jetpack and rocket pack, equipment used more commonly by the Death Watch. Her pauldrons and helmet were blaster-proof to at least the point that bolts fired from a WESTAR-35 blaster pistol would not penetrate them, as evidenced when Darth Vader deflected two shots from her pistols into her right pauldron and helmet without injuring her.\nWren applied a personalized paint job to each part of her armor based on the color scheme of her inherited helmet. This consisted of a pink color scheme around the time Bridger joined the crew of the Ghost, but changed to include more orange between the Siege of Lothal and her meeting with the clones on Seelos. Consistent throughout both color schemes were an image of an anooba on the left shoulder pad, a black and white dejarik pattern on the right shoulder pad, and a starbird on her breastplate. Other designs included the Aurebesh number five that denoted her callsign Spectre 5, as well as a convor and a fyrnock. By 5 ABY, her newest designs included a rebel starbird on the right shoulder and a purrgil on the left one. On top of the custom paint job, Wren's clothes and armor were often splattered with paint from her most recent project.\nIn battle, Wren used a pair of WESTAR-35 blaster pistols that were linked to her helmet's targeting systems. During a fight, her helmet would warn her of low ammo to prevent her running out at an inconvenient time, although the handles of the blasters themselves would pulse as a warning of low ammo if she was fighting helmetless. When not fighting Wren kept the pistols in a pair of nerf hide holsters around her waist. As with her armor, Wren painted her pistols, although they were both sealed to prevent the paint interfering with the internal systems. Along with the holsters, she kept a backup comlink on her belt.\nTo make her art, Wren used airbrushes that released a fine pressurized mist of paint, the width, color and intensity of which she could easily change, and could be configured with her favorite stencils, allowing her to tag things quickly during missions. She also possessed a deluxe paint sprayer she had converted from a fire extinguisher, which she only used outside due to its large area cover and sensitive trigger. The artist's favorite tools for art though were her explosives, which she personally constructed to release paint or colored explosions, and almost always had detonators on her belt, in her satchel and, sometimes, her pockets. Wren generally found thermal detonators too overpowered for her tastes and much preferred detonate tape. Aside from sprayers and explosives, Wren made use of color sticks and stencils when creating art, also wearing a respirator if working with paint fumes. Furthermore, using modified thermal detonators, she created paint bombs that simultaneously destroyed equipment and vehicles but also covered the area with paint.\nSabine was adept at using Mandalorian vambrace, equipped with a repulsor, a grappling line, paralyzing darts, a shield emitter, a flamethrower and paired blaster barrels. Under the tutelage of Ezra and Kanan, Sabine learned how to wield the Darksaber; a symbol of Mandalorian power, through the use of lightsaber combat. Sabine knew how to fight with a quarterstaff. Sabine's helmet, armor, and jetpack could also operate in zero gravity space.\nSabine Wren is a character in the animated television series Star Wars Rebels. Her name was revealed via tie-in material. She is voiced by actress Tiya Sircar. Her surname was first revealed in the 148th issue of the Star Wars Insider magazine. At Celebration Anaheim in 2015, it was revealed that Wren's appearance would change for Star Wars Rebels Season Two. Changes included her hair being dyed blue and a new set of armor. The same happened in the following two seasons.\nAccording to the StarWars.com blogger James Burns, Sabine Wren's name was a reference to the Sabine women from Roman history. This legendary episode in Roman history influenced later Western literature and films like Stephen Vincent Benét's short story The Sobbin' Women and the 1950s musical Seven Brides for Seven Brothers. Burns also confirmed that the Star Wars Rebels director Dave Filoni and producer Simon Kinberg had named Sabine and the other protagonists after historical and Biblical figures to give them a greater sense of purpose and meaning. Her \"Ria Talla\" alias was originally going to be a Rebel pilot and companion to Jyn Erso in Rogue One: A Star Wars Story.\nSabine Wren will be portrayed by Natasha Liu Bordizzo in the television series Ahsoka.\nSabine Wren appears in Angry Birds Star Wars II. She rescued the orphan Ezra Bridger and used her paint bombs to attack the Imperials. They managed to escape from Agent Kallus and leave Lothal aboard the Ghost with Bridger in tow.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_Rebellion_Begins",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Endangered,_Part_1",
  "/wiki/Endangered,_Part_2",
  "/wiki/A_Trooper%27s_Worth",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Krownest",
  "/wiki/Mandalore",
  "/wiki/21_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/House_Vizsla",
  "/wiki/Clan_Wren",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Spectres",
  "/wiki/Mandalorian_resistance",
  "/wiki/Kanan_Jarrus",
  "/wiki/Lightsaber_combat",
  "/wiki/Mandalorian",
  "/wiki/Soldier",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/Artist",
  "/wiki/Darksaber",
  "/wiki/Homeworld",
  "/wiki/Cadet",
  "/wiki/Imperial_Academy_of_Mandalore",
  "/wiki/Ursa_Wren",
  "/wiki/Bounty_hunter",
  "/wiki/Ketsu_Onyo",
  "/wiki/Captain",
  "/wiki/Hera_Syndulla",
  "/wiki/Jedi",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/2_BBY",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Dathomir",
  "/wiki/Fenn_Rau",
  "/wiki/Mandalorian_Protectors",
  "/wiki/Concord_Dawn",
  "/wiki/Death",
  "/wiki/Gar_Saxon",
  "/wiki/Mandalorian_Civil_War_(Imperial_Era)",
  "/wiki/Rescue_of_Hera_Syndulla_(Lothal)",
  "/wiki/Lothal_resistance_group",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Ezra_Bridger",
  "/wiki/Hyperspace",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Chimaera",
  "/wiki/Battle_of_Jakku",
  "/wiki/Ahsoka_Tano",
  "/wiki/Search_for_Ezra",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/Galactic_Republic",
  "/wiki/Clan_Vizsla",
  "/wiki/Parent",
  "/wiki/Death_Watch",
  "/wiki/Time",
  "/wiki/New_Mandalorians",
  "/wiki/Clone_Wars",
  "/wiki/Mandalorian_armor",
  "/wiki/Nite_Owls",
  "/wiki/Alrich_Wren",
  "/wiki/Statue_of_Tarre_Vizsla",
  "/wiki/Tarre_Vizsla",
  "/wiki/Tristan_Wren",
  "/wiki/Imperial_cadet",
  "/wiki/Twi%27lek_Resistance",
  "/wiki/Cham_Syndulla",
  "/wiki/Arc_Pulse_Generator",
  "/wiki/Beskar",
  "/wiki/Viceroy",
  "/wiki/Emperor%27s_Hand",
  "/wiki/Imperial_Super_Commando",
  "/wiki/Wookiee",
  "/wiki/Black_Sun",
  "/wiki/Janard",
  "/wiki/Lothal",
  "/wiki/Twi%27lek",
  "/wiki/Padawan",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Lasat",
  "/wiki/Garazeb_Orrelios",
  "/wiki/VCX-100_light_freighter",
  "/wiki/Attack_on_a_Lothal_airfield",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Capital_City",
  "/wiki/Graffiti",
  "/wiki/Starbird_(symbol)",
  "/wiki/Stormtrooper",
  "/wiki/TK-626",
  "/wiki/Unidentified_stormtrooper_commander_(Lothal)",
  "/wiki/Paint_bomb",
  "/wiki/City",
  "/wiki/Lothal%27s_most-wanted_list",
  "/wiki/File:SabineCrewTeamFamily-SOR.ogg",
  "/wiki/Heist_in_Capital_City",
  "/wiki/Supply_Master",
  "/wiki/Cumberlayne_Aresko",
  "/wiki/Blaster",
  "/wiki/614-AvA_speeder_bike",
  "/wiki/Speeder",
  "/wiki/Lothal_re-settlement_camp_43",
  "/wiki/Cikatro_Vizago",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Slavery",
  "/wiki/Prisoner",
  "/wiki/Mission_to_free_Wookiee_prisoners",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Lawbringer",
  "/wiki/Cruiser",
  "/wiki/Star_Destroyer",
  "/wiki/Hangar",
  "/wiki/Spice_mines_of_Kessel",
  "/wiki/Kessel",
  "/wiki/Spice_mine_K76",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Auzituck_anti-slaver_gunship",
  "/wiki/Jedi_training",
  "/wiki/Fuel",
  "/wiki/Mission_to_steal_Imperial_weapons",
  "/wiki/Spaceport",
  "/wiki/Garel",
  "/wiki/Star_Commuter_2000",
  "/wiki/Shuttle",
  "/wiki/ST-45",
  "/wiki/Minister",
  "/wiki/Maketh_Tua",
  "/wiki/Aqualish",
  "/wiki/Amda_Wabo",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/T-7_ion_disruptor_rifle",
  "/wiki/Rifle",
  "/wiki/All_Terrain_Defense_Pod",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Attack_on_Imperial_Troop_Transports",
  "/wiki/HoloNet",
  "/wiki/Senator",
  "/wiki/Gall_Trayvis",
  "/wiki/Jedi_Master",
  "/wiki/Luminara_Unduli",
  "/wiki/Spire_(Stygeon_Prime)",
  "/wiki/Stygeon_system",
  "/wiki/Prison",
  "/wiki/Stygeon_Prime",
  "/wiki/Phantom",
  "/wiki/Computer",
  "/wiki/Turbolift",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Blast_door",
  "/wiki/The_Force",
  "/wiki/Tibidee",
  "/wiki/Inquisitorius",
  "/wiki/Troop",
  "/wiki/Mission_to_destroy_a_kyber_crystal",
  "/wiki/Kyber_crystal",
  "/wiki/Academy_for_Young_Imperials",
  "/wiki/Decoder",
  "/wiki/Zare_Leonis",
  "/wiki/Merei_Spanjaf",
  "/wiki/Dhara_Leonis",
  "/wiki/Jai_Kell",
  "/wiki/Attack_on_an_Imperial_convoy",
  "/wiki/Cockpit",
  "/wiki/Fort_Anaxes",
  "/wiki/Anaxes_asteroid_belt",
  "/wiki/VCX-series_auxiliary_starfighter",
  "/wiki/PM-1203",
  "/wiki/Fyrnock",
  "/wiki/Rhydonium",
  "/wiki/Freighter",
  "/wiki/Raid_on_an_Imperial_supply_yard",
  "/wiki/Osisis_Station",
  "/wiki/Regani_sector",
  "/wiki/Galus_Vez",
  "/wiki/Black_market",
  "/wiki/Besalisk",
  "/wiki/Fool%27s_Run",
  "/wiki/Space_station",
  "/wiki/Hull",
  "/wiki/Skirmish_near_an_ion_storm",
  "/wiki/Ion_storm",
  "/wiki/Turret",
  "/wiki/Targeting_computer",
  "/wiki/MaDall%27s_slave_empire",
  "/wiki/Oon",
  "/wiki/Mission_to_free_MaDall%27s_slaves",
  "/wiki/MaDall",
  "/wiki/Zygerrian",
  "/wiki/Shock_collar",
  "/wiki/Electro-whip",
  "/wiki/Kaller",
  "/wiki/Governor",
  "/wiki/Gamut_Key",
  "/wiki/Smuggler",
  "/wiki/Plateau_City",
  "/wiki/Blood",
  "/wiki/Medcenter",
  "/wiki/Bacta_tank",
  "/wiki/Empire_Day",
  "/wiki/Old_Jho%27s_Pit_Stop",
  "/wiki/Rodian",
  "/wiki/Fireworks",
  "/wiki/TIE_Advanced_v1",
  "/wiki/Bridger_household",
  "/wiki/Tseebo",
  "/wiki/AJ%5E6_cyborg_construct",
  "/wiki/Imperial_Military",
  "/wiki/Rescue_of_Tseebo",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Transport",
  "/wiki/Squadron",
  "/wiki/XX-23_S-thread_tracker",
  "/wiki/Asteroid",
  "/wiki/Ahsoka_Tano%27s_corvette",
  "/wiki/Ephraim_Bridger",
  "/wiki/Mira_Bridger",
  "/wiki/Rebels_TIE_fighter",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Ezra_Bridger%27s_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Sabacc",
  "/wiki/Blockade",
  "/wiki/Droid",
  "/wiki/Janyor",
  "/wiki/Bith",
  "/wiki/Merchant_One",
  "/wiki/Crime_lord",
  "/wiki/Azmorigan",
  "/wiki/Escape_pod",
  "/wiki/Puffer_pig",
  "/wiki/Mission_to_Lando_Calrissian%27s_farm",
  "/wiki/Foodstuff",
  "/wiki/Poison",
  "/wiki/Mindiz",
  "/wiki/Antidote",
  "/wiki/Force_vision",
  "/wiki/Lothal_City_Capitol_Building",
  "/wiki/Trap_in_the_Old_Republic_Senate_Building",
  "/wiki/Smoke_bomb",
  "/wiki/Thermal_detonator",
  "/wiki/Clawdite",
  "/wiki/Bounty",
  "/wiki/Stun",
  "/wiki/Moon",
  "/wiki/Dunum",
  "/wiki/Probe_droid",
  "/wiki/Myles_Grint",
  "/wiki/X-34_landspeeder",
  "/wiki/Imperial_Complex_(Lothal)",
  "/wiki/Raid_near_Jalath",
  "/wiki/Jalath",
  "/wiki/Imperial_Command_Center",
  "/wiki/Dwarf_probe_droid",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Raid_on_the_communications_tower",
  "/wiki/Computer_spike",
  "/wiki/Undicur-class_jumpspeeder",
  "/wiki/Star_system",
  "/wiki/Action_at_Mustafar",
  "/wiki/Devaronian",
  "/wiki/R4_courier_droid",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/264",
  "/wiki/Mustafar_system",
  "/wiki/Sovereign",
  "/wiki/Evac_One",
  "/wiki/Imperial_Navy",
  "/wiki/Mustafar",
  "/wiki/Electro_Magnetic_Pulse_grenade",
  "/wiki/Reactor",
  "/wiki/Lightsaber_duel",
  "/wiki/The_Inquisitor%27s_TIE_Advanced",
  "/wiki/Phoenix_Squadron",
  "/wiki/Rescue_of_Dhara_Leonis",
  "/wiki/Gandr_Spanjaf",
  "/wiki/Jessa_Spanjaf",
  "/wiki/Leo_Leonis",
  "/wiki/Tepha_Leonis",
  "/wiki/Auntie_Nags",
  "/wiki/Garel_system",
  "/wiki/Ithorian",
  "/wiki/Jho",
  "/wiki/Arkanis",
  "/wiki/Area_Null",
  "/wiki/Arkanis_Academy",
  "/wiki/Beck_Ollet",
  "/wiki/Thrad",
  "/wiki/Nadea_Tural",
  "/wiki/Hyperdrive",
  "/wiki/Commander",
  "/wiki/Earll",
  "/wiki/Trooper",
  "/wiki/Camson",
  "/wiki/Water",
  "/wiki/Quila",
  "/wiki/Eel",
  "/wiki/Oxygen",
  "/wiki/Bridge_(starship)",
  "/wiki/Jun_Sato",
  "/wiki/Mission_to_steal_Imperial_shield_generators",
  "/wiki/Deflector_shield_generator",
  "/wiki/Mission_to_Lothal_(4_BBY)",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Imperial_Armory_Complex",
  "/wiki/49-v99_Deflector",
  "/wiki/Anakin_Skywalker",
  "/wiki/Walker",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Blaster_pistol",
  "/wiki/Homing_beacon",
  "/wiki/W1-LE",
  "/wiki/Masking_transponder",
  "/wiki/Attack_on_Phoenix_Squadron_(4_BBY)",
  "/wiki/Darth_Vader%27s_TIE_Advanced",
  "/wiki/Phoenix_Home",
  "/wiki/Siege_of_Lothal",
  "/wiki/Seelos",
  "/wiki/Seelos_system",
  "/wiki/Desert",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Wolffe",
  "/wiki/Gregor",
  "/wiki/Clone_trooper",
  "/wiki/Joopa",
  "/wiki/Data-tape",
  "/wiki/Engine",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Assault_on_Seelos",
  "/wiki/Sandstorm",
  "/wiki/Skirmish_aboard_a_Republic_medical_station",
  "/wiki/Unidentified_Haven-class_medical_station",
  "/wiki/Haven-class_medical_station",
  "/wiki/Relentless",
  "/wiki/Seventh_Sister",
  "/wiki/ID9_seeker_droid",
  "/wiki/Fifth_Brother",
  "/wiki/Rinn",
  "/wiki/Blockade_of_Ibaar",
  "/wiki/Phoenix_Leader_(Ibaar)",
  "/wiki/Quarrie",
  "/wiki/Mon_Calamari",
  "/wiki/Engineer",
  "/wiki/Shantipole",
  "/wiki/Prototype_B6",
  "/wiki/Ibaar",
  "/wiki/BG-81",
  "/wiki/Arquitens-class_light_cruiser",
  "/wiki/Phoenix_Leader",
  "/wiki/Garel_City",
  "/wiki/Garel_City_Spaceport",
  "/wiki/Havoc_Outpost",
  "/wiki/Alderaan",
  "/wiki/Standard_hour",
  "/wiki/GNK-series_power_droid",
  "/wiki/EG-86",
  "/wiki/GX1_short_hauler",
  "/wiki/Unidentified_RX-Series_pilot_droid_(Garel)",
  "/wiki/Shadow_Caster",
  "/wiki/Realspace",
  "/wiki/Power_droid",
  "/wiki/Assassin",
  "/wiki/Tractor_beam_projector",
  "/wiki/Tractor_beam",
  "/wiki/Liberator_(CR90_corvette)",
  "/wiki/Del_Zennis_system",
  "/wiki/Brom_Titus",
  "/wiki/Imperial_Interdictor",
  "/wiki/Gravity_well_projector",
  "/wiki/Rescue_on_the_Imperial_Interdictor",
  "/wiki/Interdictor_vessel",
  "/wiki/Jyn_Erso",
  "/wiki/Battle_of_Garel",
  "/wiki/Command_ship",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Ryder_Azadi",
  "/wiki/Sphyrna-class_Hammerhead_corvette",
  "/wiki/Lieutenant",
  "/wiki/Yogar_Lyste",
  "/wiki/Gravity_lock",
  "/wiki/Mission_on_Lothal",
  "/wiki/Corvette",
  "/wiki/Assassin_droid",
  "/wiki/IG-88B",
  "/wiki/Hyperspace_route",
  "/wiki/Lothal_sector",
  "/wiki/Concord_Dawn_system",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Dogfight_over_Concord_Dawn",
  "/wiki/Third_Battle_of_Mygeeto",
  "/wiki/Mission_to_the_third_moon_of_Concord_Dawn",
  "/wiki/Protectors_Camp",
  "/wiki/Fang-class",
  "/wiki/Mandalorian_code",
  "/wiki/Starfighter",
  "/wiki/Nixus_Hub_218",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Refugee",
  "/wiki/Transmitter",
  "/wiki/Cargo_container",
  "/wiki/Lasan_High_Honor_Guard",
  "/wiki/Gron",
  "/wiki/Chava",
  "/wiki/Lira_San",
  "/wiki/Prophecy_of_the_Three",
  "/wiki/Bo-rifle",
  "/wiki/Hologram",
  "/wiki/Wild_Space",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Star_cluster/Legends",
  "/wiki/Mining_Guild",
  "/wiki/Asteroid_Belt_Gas_Refinery",
  "/wiki/Purrgil",
  "/wiki/TIE/mg_Mining_Guild_starfighter",
  "/wiki/Macrobinoculars",
  "/wiki/Clouzon-36",
  "/wiki/Unidentified_planetoid_(Mining_Guild)",
  "/wiki/Yushyn",
  "/wiki/Purrgil_King",
  "/wiki/Pilot",
  "/wiki/Mission_to_Ryloth_(Phoenix_Squadron)",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Ryloth",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Numa",
  "/wiki/Gobi_Glie",
  "/wiki/TIE/sa_bomber",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Battle_of_Ryloth",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/Geonosis_system",
  "/wiki/ICM-092792",
  "/wiki/Geonosis",
  "/wiki/Bahryn",
  "/wiki/Bonzami",
  "/wiki/Escape_pod_transponder",
  "/wiki/Oosalon",
  "/wiki/Berzite%27s_moon",
  "/wiki/Yost_system",
  "/wiki/Heist_at_Horizon_Base",
  "/wiki/Horizon_Base",
  "/wiki/Ambulatory_strut",
  "/wiki/Admiral",
  "/wiki/Kassius_Konstantine",
  "/wiki/Inventory_droid",
  "/wiki/AP-5",
  "/wiki/Atollon",
  "/wiki/Class_four_container_transport",
  "/wiki/Joben_T-85_speeder_bike",
  "/wiki/Medkit",
  "/wiki/Chopper_Base",
  "/wiki/Sensor_beacon",
  "/wiki/Dicer",
  "/wiki/Krykna",
  "/wiki/Malachor",
  "/wiki/Mission_to_Malachor",
  "/wiki/Rescue_of_Hondo_Ohnaka",
  "/wiki/Naraka",
  "/wiki/Weequay",
  "/wiki/Pirate",
  "/wiki/Ugnaught",
  "/wiki/Terba",
  "/wiki/Grenade",
  "/wiki/Imperial_combat_driver",
  "/wiki/Sith_holocron",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Reklam_Station",
  "/wiki/Yarma",
  "/wiki/Lieutenant_Commander",
  "/wiki/Sereeda_Waypoint",
  "/wiki/DTS-series_Dismantler_Droid",
  "/wiki/Phoenix_Nest",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Massassi_Group",
  "/wiki/Sith_apprentice",
  "/wiki/Kanan_Jarrus%27_holocron",
  "/wiki/RIC-1200",
  "/wiki/Magnetizer",
  "/wiki/Maul%27s_lightsaber",
  "/wiki/Vizsla_Keep_09",
  "/wiki/Holocron_fusion",
  "/wiki/Skystrike_Academy",
  "/wiki/Vult_Skerris",
  "/wiki/Kalikori",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Tann_Province",
  "/wiki/Syndulla_residence",
  "/wiki/Tulara_Ravine",
  "/wiki/Blurrg",
  "/wiki/Slavin",
  "/wiki/Mission_to_Agamar_(2_BBY)",
  "/wiki/Agamar",
  "/wiki/DH-Omni_Support_Vessel",
  "/wiki/Proton_bomb",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/ST-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Kalani",
  "/wiki/Phantom_II",
  "/wiki/Cubikahd",
  "/wiki/Second_mission_to_the_third_moon_of_Concord_Dawn",
  "/wiki/Mykapo",
  "/wiki/YT-2400_light_freighter",
  "/wiki/Skirmish_over_Mykapo",
  "/wiki/Iron_Squadron",
  "/wiki/Sato%27s_Hammer",
  "/wiki/Gooti_Terez",
  "/wiki/Jonner_Jin",
  "/wiki/R3-A3",
  "/wiki/Mart_Mattin",
  "/wiki/Deflector_shield",
  "/wiki/Magno-mine",
  "/wiki/Wynkahthu",
  "/wiki/Melch",
  "/wiki/Mission_to_loot_an_Imperial_cargo_ship",
  "/wiki/DT-series_sentry_droid",
  "/wiki/Infiltration_of_the_Imperial_Armory_Complex",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Wrist_comm",
  "/wiki/Bendu",
  "/wiki/Nightbrother_(Gauntlet_fighter)",
  "/wiki/Nightsister_lair",
  "/wiki/Nightsisters",
  "/wiki/Skirmish_on_Dathomir",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mission_to_investigate_Geonosis",
  "/wiki/Saw_Gerrera",
  "/wiki/Geonosian",
  "/wiki/Partisans",
  "/wiki/Alliance_High_Command",
  "/wiki/Deflector_core",
  "/wiki/Droideka",
  "/wiki/Klik-Klak",
  "/wiki/Brunson%27s_Arquitens-class_command_cruiser",
  "/wiki/Karina",
  "/wiki/Jumptrooper",
  "/wiki/Brunson",
  "/wiki/Sterilization_of_Geonosis",
  "/wiki/Imperial_Military_Department_of_Advanced_Weapons_Research",
  "/wiki/Secret_mission_to_Geonosis",
  "/wiki/Wedge_Antilles",
  "/wiki/Derek_Klivian",
  "/wiki/Chief_of_Security",
  "/wiki/E-XD-series_infiltrator_droid",
  "/wiki/EXD-9",
  "/wiki/EXD-9%27s_infiltration_of_Chopper_Base",
  "/wiki/Proton_torpedo",
  "/wiki/7th_Fleet",
  "/wiki/Lightsaber_training_staff",
  "/wiki/Mandalorian_vambrace",
  "/wiki/Kanan_Jarrus%27_lightsaber",
  "/wiki/Wren_Stronghold",
  "/wiki/Sundari",
  "/wiki/Skirmish_on_Krownest",
  "/wiki/Personal_Combat_Shield",
  "/wiki/Battle_of_Atollon",
  "/wiki/Clan_Saxon",
  "/wiki/Gauntlet_starfighter",
  "/wiki/Mission_to_Mandalore",
  "/wiki/Mandalore_prison_outpost",
  "/wiki/Clan_Kryze",
  "/wiki/Lord",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Satine_Kryze",
  "/wiki/Regent",
  "/wiki/Scout_trooper",
  "/wiki/Speeder_bike",
  "/wiki/Force_jump",
  "/wiki/Comlink",
  "/wiki/Kom%27rk-class_fighter/transport",
  "/wiki/Tiber_Saxon%27s_Star_Destroyer",
  "/wiki/Stormtrooper_armor",
  "/wiki/Yavin_4",
  "/wiki/Jalindi_Station",
  "/wiki/Jalindi",
  "/wiki/Mission_to_Jalindi",
  "/wiki/Jetpack",
  "/wiki/Marauder_(Arquitens-class)",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Edrio",
  "/wiki/Faos_Station",
  "/wiki/Freighter_2716",
  "/wiki/DT-F16%27s_squad",
  "/wiki/Death_trooper",
  "/wiki/DT-F16",
  "/wiki/Tonnis_sector",
  "/wiki/Slavin%27s_Star_Destroyer",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/Theft_of_the_TIE_Defender_Elite",
  "/wiki/Broken_Horn",
  "/wiki/Jhothal",
  "/wiki/Baron",
  "/wiki/Valen_Rudor",
  "/wiki/Lothal_Imperial_airfield",
  "/wiki/Flight_data_recorder",
  "/wiki/LAAT/le_patrol_gunship",
  "/wiki/Loth-wolf",
  "/wiki/Lothal_resistance_camp",
  "/wiki/Lothal_cliff_dwelling",
  "/wiki/Ore_crawler",
  "/wiki/Crawler_413-24",
  "/wiki/IG-RM_bodyguard_and_enforcer_droid",
  "/wiki/Paralyzing_dart",
  "/wiki/Trandoshan",
  "/wiki/Seevor",
  "/wiki/Proach",
  "/wiki/Attack_on_Lothal",
  "/wiki/LothalNet_comm_tower_E-272",
  "/wiki/Pryce%27s_office",
  "/wiki/Loth-bat_glider",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Lothal_City_fuel_depot",
  "/wiki/Alton_Kastle",
  "/wiki/Rukh",
  "/wiki/Sinrich_optical_dephaser",
  "/wiki/Rangefinder",
  "/wiki/Mission_to_the_Lothal_Jedi_Temple",
  "/wiki/Lothal_Jedi_Temple_key_stone",
  "/wiki/Dume_(Loth-wolf)",
  "/wiki/Hyperspace_tunneling",
  "/wiki/Excavation_of_the_Lothal_Jedi_Temple",
  "/wiki/LS-515",
  "/wiki/Veris_Hydan",
  "/wiki/Painting_of_the_Mortis_gods",
  "/wiki/Portal",
  "/wiki/World_Between_Worlds",
  "/wiki/Mobile_command_center",
  "/wiki/Force_wielder",
  "/wiki/Father_(Mortis)",
  "/wiki/Daughter",
  "/wiki/Son",
  "/wiki/Darth_Sidious",
  "/wiki/Mining_Guild_excavation_driller",
  "/wiki/Protocol_13",
  "/wiki/Imperial_Planetary_Occupation_Facility",
  "/wiki/Network_terminal",
  "/wiki/Cold_War",
  "/wiki/Resistance",
  "/wiki/First_Order",
  "/wiki/Untitled_(defaced_Join)",
  "/wiki/Fly_For_Freedom",
  "/wiki/Join_the_Rebellion",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order",
  "/wiki/Coba_Dunivee",
  "/wiki/Imperial_Campaign_Poster_34.371.C",
  "/wiki/Battle_of_Crait",
  "/wiki/Coronet_City",
  "/wiki/Corellia",
  "/wiki/Airbrush",
  "/wiki/Noghri",
  "/wiki/Saboteur",
  "/wiki/WESTAR-35_blaster_pistol",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Gunner",
  "/wiki/Slicer",
  "/wiki/Language",
  "/wiki/Spy",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Mando%27a",
  "/wiki/Huttese",
  "/wiki/Rodian_(language)",
  "/wiki/Aqualish_(language)",
  "/wiki/Binary",
  "/wiki/Shyriiwook",
  "/wiki/Rebel_Alliance_starbird",
  "/wiki/Unidentified_New_Republic_pilot_(Criigo)",
  "/wiki/Criigo_insurrection",
  "/wiki/Body_glove",
  "/wiki/Macrobinocular_viewplate",
  "/wiki/Holo-imager",
  "/wiki/Anooba",
  "/wiki/Dejarik",
  "/wiki/Nerf",
  "/wiki/Holster",
  "/wiki/Detonator",
  "/wiki/Breath_mask",
  "/wiki/Repulsorlift",
  "/wiki/Grappling_line",
  "/wiki/Flamethrower",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Tiya_Sircar",
  "/wiki/Star_Wars_Insider_148",
  "/wiki/Star_Wars_Insider",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/StarWars.com",
  "/wiki/James_Burns",
  "/wiki/Dave_Filoni",
  "/wiki/Simon_Kinberg",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Natasha_Liu_Bordizzo",
  "/wiki/Ahsoka_(television_series)",
  "/wiki/Angry_Birds_Star_Wars_II",
  "/wiki/Category:Audio_files_of_Sabine_Wren",
  "/wiki/Category:Images_of_Sabine_Wren",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_1",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volumes_1_%26_2",
  "/wiki/Thrawn_6",
  "/wiki/Star_Wars_Rebels:_Ghost_Raid",
  "/wiki/Rise_of_the_Rebels",
  "/wiki/Art_Attack",
  "/wiki/Sabine%27s_Art_Attack",
  "/wiki/Zeb_to_the_Rescue",
  "/wiki/Ezra_and_the_Pilot",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Spark_of_Rebellion:_A_Star_Wars_Rebels_Cinestory_Comic",
  "/wiki/Ezra%27s_Wookiee_Rescue",
  "/wiki/Droids_in_Distress_(book)",
  "/wiki/The_Secret_Jedi:_The_Adventures_of_Kanan_Jarrus:_Rebel_Leader",
  "/wiki/Droids_in_Distress",
  "/wiki/Fighter_Flight",
  "/wiki/Ring_Race",
  "/wiki/Star_Wars_Rebels_Magazine_1",
  "/wiki/Rise_of_the_Old_Masters",
  "/wiki/The_Inquisitor%27s_Trap",
  "/wiki/Learning_Patience",
  "/wiki/Star_Wars_Rebels_Magazine_2",
  "/wiki/Servants_of_the_Empire:_Rebel_in_the_Ranks",
  "/wiki/Breaking_Ranks",
  "/wiki/The_Fake_Jedi",
  "/wiki/Star_Wars_Rebels_Magazine_3",
  "/wiki/Out_of_Darkness",
  "/wiki/Hera%27s_Phantom_Flight",
  "/wiki/Star_Wars_Rebels:_Rebel_Strike",
  "/wiki/Empire_Day_(episode)",
  "/wiki/Ezra%27s_Duel_with_Danger",
  "/wiki/Gathering_Forces",
  "/wiki/Return_of_the_Slavers",
  "/wiki/Star_Wars_Rebels_Magazine_4",
  "/wiki/Eyes_on_the_Prize",
  "/wiki/Star_Wars_Rebels_Magazine_5",
  "/wiki/Kanan_1",
  "/wiki/Kanan_5",
  "/wiki/Kanan_6",
  "/wiki/Kanan_7",
  "/wiki/Kanan_8",
  "/wiki/Kanan_9",
  "/wiki/Kanan_10",
  "/wiki/Kanan_11",
  "/wiki/Kanan_12",
  "/wiki/Path_of_the_Jedi",
  "/wiki/Kanan%27s_Jedi_Training",
  "/wiki/Sabotaged_Supplies",
  "/wiki/Star_Wars_Rebels_Magazine_7",
  "/wiki/Idiot%27s_Array_(episode)",
  "/wiki/Always_Bet_on_Chopper",
  "/wiki/Servants_of_the_Empire:_Imperial_Justice",
  "/wiki/Vision_of_Hope",
  "/wiki/Ezra%27s_Vision",
  "/wiki/Star_Wars_Rebels_Magazine_8",
  "/wiki/Assessment",
  "/wiki/Star_Wars_Rebels_Magazine_11",
  "/wiki/Servants_of_the_Empire:_The_Secret_Academy",
  "/wiki/Call_to_Action",
  "/wiki/Battle_to_the_End",
  "/wiki/Rebel_Resolve",
  "/wiki/Fire_Across_the_Galaxy",
  "/wiki/Senate_Perspective",
  "/wiki/Star_Wars_Rebels_Magazine_9",
  "/wiki/Ocean_Rescue",
  "/wiki/Star_Wars_Rebels_Magazine_12",
  "/wiki/Star_Wars_Rebels:_Recon_Missions",
  "/wiki/Star_Wars_Rebels:_Chopper_Chase",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal",
  "/wiki/Star_Wars_Rebels:_Team_Tactics",
  "/wiki/Star_Wars_Rebels:_Battle_Plans_from_Darth_Vader",
  "/wiki/The_Lost_Commanders",
  "/wiki/Relics_of_the_Old_Republic",
  "/wiki/Always_Two_There_Are",
  "/wiki/Brothers_of_the_Broken_Horn",
  "/wiki/Star_Wars_Rebels:_Strike_Missions",
  "/wiki/Wings_of_the_Master",
  "/wiki/Blood_Sisters",
  "/wiki/Too_Late_to_Change",
  "/wiki/Star_Wars_Rebels_Magazine_28",
  "/wiki/Stealth_Strike",
  "/wiki/The_Size_of_the_Fight",
  "/wiki/Legacy_(episode)",
  "/wiki/A_Princess_on_Lothal",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Bounty_of_Trouble",
  "/wiki/Forces_of_Destiny:_The_Leia_Chronicles",
  "/wiki/Forces_of_Destiny:_The_Leia_Chronicles_%26_The_Rey_Chronicles",
  "/wiki/The_Protector_of_Concord_Dawn",
  "/wiki/Legends_of_the_Lasat",
  "/wiki/Academy_Cadets",
  "/wiki/Star_Wars_Rebels_Magazine_18",
  "/wiki/The_Call",
  "/wiki/Escaping_the_Scrap_Pile",
  "/wiki/Star_Wars_Rebels_Magazine_19",
  "/wiki/The_Ballad_of_264",
  "/wiki/Homecoming",
  "/wiki/A_Time_to_Survive",
  "/wiki/Star_Wars_Rebels_Magazine_27",
  "/wiki/The_Wrong_Crowd",
  "/wiki/The_Honorable_Ones",
  "/wiki/Shroud_of_Darkness",
  "/wiki/The_Forgotten_Droid",
  "/wiki/The_Second_Chance",
  "/wiki/The_Mystery_of_Chopper_Base",
  "/wiki/The_Thune_Cargo",
  "/wiki/Star_Wars_Rebels_Magazine_22",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Star_Wars_Rebels:_Special_Ops",
  "/wiki/Newest_Recruit",
  "/wiki/Crash_Course",
  "/wiki/Hasty_Departure",
  "/wiki/Accidental_Allies",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_7",
  "/wiki/Star_Wars_Adventures_(2017)_8",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/The_Holocrons_of_Fate",
  "/wiki/The_Antilles_Extraction",
  "/wiki/Hera%27s_Heroes",
  "/wiki/Sons_of_the_Sky",
  "/wiki/Star_Wars_Rebels_Magazine_33",
  "/wiki/The_Last_Battle",
  "/wiki/Imperial_Supercommandos",
  "/wiki/Star_Wars_Rebels_Animation",
  "/wiki/Star_Wars_Rebels_Animation_1",
  "/wiki/Iron_Squadron_(episode)",
  "/wiki/The_Wynkahthu_Job",
  "/wiki/An_Inside_Man",
  "/wiki/To_Thy_Metal_Heart_Be_True",
  "/wiki/Visions_and_Voices",
  "/wiki/Ghosts_of_Geonosis",
  "/wiki/Warhead_(episode)",
  "/wiki/Trials_of_the_Darksaber",
  "/wiki/Legacy_of_Mandalore",
  "/wiki/Art_History",
  "/wiki/Through_Imperial_Eyes",
  "/wiki/Zero_Hour",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore",
  "/wiki/In_the_Name_of_the_Rebellion",
  "/wiki/Never_Far_Behind",
  "/wiki/The_Occupation",
  "/wiki/Flight_of_the_Defender",
  "/wiki/Kindred",
  "/wiki/Crawler_Commandeers",
  "/wiki/Rebel_Assault",
  "/wiki/Jedi_Night",
  "/wiki/DUME",
  "/wiki/Wolves_and_a_Door",
  "/wiki/A_World_Between_Worlds",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Rendezvous_Point_(short_story)",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/LEGO_Star_Wars_Movie_Short",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Friends_Like_These",
  "/wiki/Launchpad",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Rebels:_Meet_the_Rebels",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Ultimate_Sticker_Collection:_Star_Wars_Rebels",
  "/wiki/A_New_Hero",
  "/wiki/Star_Wars_Rebels:_Head_to_Head",
  "/wiki/Hera:_A_New_Breed_of_Hero",
  "/wiki/Star_Wars_Insider_151",
  "/wiki/Fangirls",
  "/wiki/Star_Wars",
  "/wiki/Rebel_Rouser",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/Cowboy_Jedi",
  "/wiki/Rebel_with_a_Cause",
  "/wiki/Mandalorian_Graffiti",
  "/wiki/HoloNet_News_promotional_posters",
  "/wiki/Star_Wars_Insider_153",
  "/wiki/The_Art_of_Rebels",
  "/wiki/Star_Wars_Magazine",
  "/wiki/Star_Wars_Magazine_3",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars_Command",
  "/wiki/Star_Wars_Rebels_(toy_line)",
  "/wiki/Vanessa%27s_View",
  "/wiki/Star_Wars_Insider_154",
  "/wiki/Designing_Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_Beware_the_Inquisitor!",
  "/wiki/Rebels,_Animated",
  "/wiki/Star_Wars_Insider_155",
  "/wiki/Note_for_Note:_The_Music_of_Star_Wars_Rebels",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Rebels",
  "/wiki/Sabine_My_Rebel_Sketchbook",
  "/wiki/Star_Wars_Rebels_Recounted",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/Bounty_Hunters_(Star_Wars_Insider)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_62",
  "/wiki/Star_Wars_Rebels:_Fight_the_Empire",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_68",
  "/wiki/Star_Wars_Insider_157",
  "/wiki/Red_Five_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Rebels:_Rebel_Power!",
  "/wiki/Star_Wars_Insider_160",
  "/wiki/Star_Wars_Insider_167",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Who%3F_What%3F_Why%3F_Wren!",
  "/wiki/Star_Wars_Insider_168",
  "/wiki/Star_Wars_Rebels_Annual_2016",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_39",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Awakenings",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_69",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_6",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Meet_the_Heroes",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_Imperial_Assault_(Fantasy_Flight_Games)",
  "/wiki/Sabine_Wren_and_Zeb_Orrelios_Ally_Pack",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_5",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_8",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Star_Wars:_Legion",
  "/wiki/Sabine_Wren_Operative_Expansion",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/StarWarsKids.com",
  "/wiki/TIE_Fighters",
  "/wiki/Phoenix_Cell_Squadron_Pack",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Princess_Leia_Organa",
  "/wiki/Protocol_and_Service_Droids",
  "/wiki/Star_Wars_Inside_Intel:_Mandalorian_Armor",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/5_BBY",
  "/wiki/Reproduction",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Lawless",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Tim_Veekhoven",
  "/wiki/File:Season_2_Sabine_twitter.png",
  "/wiki/The_Art_of_Rogue_One:_A_Star_Wars_Story"
 ]
}