{
 "name": "Sabla-Mandibu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Miraluka"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Council of Reconciliation",
      "Council of Reconciliation"
     ]
    }
   ]
  }
 ],
 "content": "Sabla-Mandibu was a female Miraluka Jedi Master of the Council of Reconciliation and a renowned Seer of the Jedi Order. Serving at the Coruscant Jedi Temple in the years preceeding the Ruusan Reformation, Master Mandibu was an expert at analyzing holocrons. Among her many contributions to the Order during her years of service was her authorship of several chapters of the Temple guidebook titled, The Jedi Path: A Manual for Students of the Force. Writing down her knowledge of the Sense and Alter abilities and their application with the Force, Master Mandibu left a lasting impression on future generations through her words.\nLike all Jedi of the era, Master Mandibu served the Order during the New Sith Wars and helped rebuild the Jedi academy after the Ruusan Reformations. Following the war, Master Mandibu was appointed to sit on the Council of Reconciliation, working as liaison between the Galactic Republic and several different political factions.\nWhen her fellow Masters proposed that a guidebook to the life of the Jedi be written, Master Mandibu agreed to work on the project, contributing three chapters. Hoping to emphasize the virtue of the Jedi Consulars as well as give a detailed description of the Sense and Alter abilities of the Jedi, Master Mandibu's teachings were passed down in the tome for several generations.\nWhile it did not make it into the finished edition, Daniel Wallace, author of The Jedi Path: A Manual for Students of the Force, released a list detailing the genders and species of each of the authors of the in-universe The Jedi Path: A Manual for Students of the Force. Master Mandibu is revealed to be a female Miraluka.\nSabla-Mandibu's name is a tuckerization of Mandy Bulat, friend of author Daniel Wallace and former staff member at Star Wars news site TheForce.net.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Miraluka/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Council_of_Reconciliation/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Seer",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Ruusan_Reformation",
  "/wiki/Holocron/Legends",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force",
  "/wiki/Force_power/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Jedi_academy",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/Daniel_Wallace",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Tuckerization",
  "/wiki/TheForce.net",
  "/wiki/StarWars.com",
  "/wiki/Jedi_Council_Forums",
  "/wiki/Star_Wars:_Blogs"
 ]
}