{
 "name": "Sabol",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Sabol was an Imperial Lieutenant who was stationed in Bestine during 1 ABY.\nDuring her time in Bestine, Sabol was tasked with the duty of assassinating a Rebel General aboard a Corellian Corvette. Seeing no reason why this Rebel should survive, she tasked a group of Imperials to board the Corvette and eliminate the Rebel General for her. However, before the Imperials could be granted passage to the Corvette, she had to first acquire Rebel documents with important information. After searching various locations, including the abandoned Rebel base on Dantooine, a crashed Star Tours liner on Dathomir, and the Afarathu Cave on Corellia, the Imperials finally found the documents Sabol sought. The Imperials were then given a ticket to hand to an Imperial TIE pilot at the Emperor's Retreat.\nFrom here, the Imperials were flown on a Lambda-class shuttle to the Corvette. After boarding the Corvette, the Imperial fought their way through the corridors, and assassinated the Rebel General. After evacuating the Corvette through the ship's escape pods, the Imperial returned to Sabol, and were commended for their service. The Imperial Medal of Honor was awarded to the Imperials for their exemplary work.\nSabol is a Non-Player Character in the MMORPG Star Wars Galaxies. In the game, players may take a mission from her which involves killing a Rebel General on a Corvette. After completing the mission, the players are given a badge, a schematic for an AV-21, and several other rewards.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Dantooine_base/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Star_Tours/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Afarathu_Cave",
  "/wiki/Corellia/Legends",
  "/wiki/TIE_pilot",
  "/wiki/Emperor%27s_Retreat/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Imperial_Medal_of_Honor",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/AV-21_landspeeder",
  "/wiki/Sony"
 ]
}