{
 "name": "Sach%C3%A9",
 "display_name": "Saché",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "44 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Naboo Royal Handmaidens",
      "Naboo Royal Handmaidens",
      "Galactic Republic",
      "Naboo resistance",
      "Naboo planetary legislative assembly",
      "Amidalans"
     ]
    }
   ]
  }
 ],
 "content": "Saché, born Sashah Adova, was a female human who served as one of the handmaidens of Amidala, Queen of Naboo. During the Invasion of Naboo, Saché and Yané remained behind as her sovereign and the other handmaidens fled Naboo with Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi. Whilst she remained on Naboo, Saché carried messages for a resistance group until she was caught by droids and subject to interrogation by the Trade Federation, which resulted in a large collection of scars around her neck, body and arms. During the interrogation, Saché saved the lives of members of the Royal Naboo Security Forces by refusing to name them.\nThe Royal Security Forces repaid Saché's bravery with loyalty second only to Amidala and, after she announced her intention to run for a seat in the planetary legislative assembly, it was done with their full support. In 28 BBY, the same year Amidala's term as queen ended, Saché was accepted into the assembly and moved into a home with Yané. Around 24 BBY, they became married.\nSaché became an infuential member of Queen Réillata's government and, when Governor Sio Bibble finally retired following Amidala's death in 19 BBY, Saché was the favorite to succeed him. However, under self-proclaimed Galactic Emperor Sheev Palpatine's decree, the election was suspended and a new position was created to oversee the daily operations of the Naboo government, a position granted to former Captain Quarsh Panaka, the man who trained Amidala, Saché and the handmaidens for their security arrangement.\nSashah Adova, a human female, was born on the planet Naboo in the year 44 BBY. In 32 BBY, when she was twelve years old, she was recruited by Captain Quarsh Panaka of the Royal Naboo Security Forces to serve as one of the handmaidens for newly-elected Queen Padmé Amidala.\nPanaka first encountered Adova at an acting workshop he visited during his search for qualified handmaidens. After he quite literally tripped over Adova hiding in an alcove, he became intrigued by both her and her advice on one of the other girls at the workshop, Eirtama Ballory. He later surmised that she had tripped him on purpose in order to sneakily convince him that she was right for the job, which she had wanted all along. Along with Ballory, Rabene Tonsort, and Suyan Higin, Adova was introduced to Amidala at the end of her second week on the throne. Panaka introduced Adova last, unsure how to explain his reasoning that the girl, who was younger than the Queen and all the other candidates, was qualified. Amidala subsequently brought the girls to her apartment in the Theed Royal Palace to speak with them privately, alongside her first handmaiden, Tsabin.\nThere, Amidala and her new handmaidens discussed the details of their new positions, and what Amidala hoped for from them. Adova explained to Amidala that Panaka thought the girls would work for him directly as an extension of the Royal Security Forces, not understanding the Queen's wishes, and that he had something on Tonsort—her past as an art forger—that he thought he could use to control her. After further discussion, Adova suggested that the girls could be Amidala's shadow. Tonsort, noting her own slight notoriety, suggested that the handmaidens all take new names that matched Amidala's given one. When Ballory was hesitant, Adova noted that if she wanted to become famous under her real name, the position of handmaiden was not for her; her words led Ballory to acquiesce to the idea. Adova, noting her position as the youngest of the handmaidens and the least likely to be called on as Amidala's stand-in, volunteered to be the Queen's page. When Tonsort suggested that the disguised Amidala should also be a page, Adova also volunteered to help ease a reluctant Panaka into the idea. When it came time to pick her new name, she dubbed herself Saché.\nAs the handmaidens began a rotation of sharing bedrooms, Saché refused to share one with Higin—now Yané—yet would not admit to Yané or the group why; Yané agreed with her, but likewise would not provide a reason. Frustrated, Amidala agreed to a rotation that kept the pair separate despite not understanding why it seemed so personal. Although Saché and Yané did not explain themselves, they had both developed an interest in the other.\nEarly in Amidala's reign, Naboo was invaded by the Trade Federation. Amidala and Tsabin, now known as Sabé, switched places as the invasion forces closed in on Theed. Saché did the elder handmaiden's hair as part of the deception. When Amidala, her handmaidens and her guards were rescued from the battle droids that had captured them by the Jedi Qui-Gon Jinn and Obi-Wan Kenobi, Saché and Yané stayed behind on Naboo with elements of the Royal Security Forces that led a resistance against the occupation as Amidala and company escaped to Coruscant to rally assistance.\nDuring the occupation, Saché helped the resistance maintain coded communications using a system devised by Yané. Saché and Yané soon confessed their mutual affections to each other while sharing a cot. Early on, they managed to pass a coded message to the queen when Saché asked Bibble to tell Amidala a specific phrase: \"the death toll is catastrophic.\" The word \"toll\" was a pre-arranged alert word, which would let Amidala know that one of the handmaidens left behind on Naboo was still alive and that she could concentrate on her own mission. Satisfied that Saché's feigned terror would tug at the queen's heartstrings, Gunray agreed that the message would be sent. Saché also carried messages around the prison camp. She was eventually captured by the droid forces and tortured for information, but she held out and refused to name any Royal Security Forces members, such as Mariek Panaka. Amidala eventually returned to Naboo with the Jedi, upon which Saché and Yané were reunited with her and the other handmaidens. The regrouped royal party travelled to the swamps to enlist the aid of the Gungans in driving the Trade Federation out.\nWhen Queen Amidala stepped down, Saché ran for a seat in the Planetary Legislative Assembly and won. She and Yané moved into a home together, a large house purchased by Yané to foster children who were orphaned by their homeworld's occupation. Saché worked closely with Sio Bibble, who was a friend and mentor to her. She also stayed in touch with Amidala and the other three handmaidens.\nSome time after Amidala became a Senator, Saché invited her and all of the handmaidens to a dinner party she hosted in the southwest hall in the Naboo royal palace. Yané was the only one unable to attend due to staying at their home to take care of the twins she was fostering. Although Saché was disappointed that Yané could not attend, she told Amidala how proud she was of Yané.\nAround 24 BBY, Saché and Yané got married. Yané's designs for their garments incorporated their wedding fabric in accordance with Naboo tradition, with each wearing some of the other's fabric. Their mirrored outfits reflected their own personal tastes; Saché wore wide-legged trousers instead of a skirt like Yané's.\nSaché walked with the other surviving handmaidens in the procession at Amidala's funeral. Shortly before or around that time, Sio Bibble stepped down as governor. Saché had been a favorite to win the election for the next governor of Naboo, but the Empire instead installed Quarsh Panaka in the new position of Moff.\nSaché was a human female native from Naboo. She had brown hair, brown eyes, and fair skin. Saché's role in the handmaidens' work as a security and intelligence team was to spy in plain sight, and to serve as a distraction while the others got up to trouble behind her. She often played up people's perception of her as small, young, or meek to gain an advantage. People talked around her; either they overlooked her, or they viewed her as the easiest of Amidala's handmaidens to talk to. Saché was also unusually observant. She was the only person to figure out what Panaka was doing when he was recruiting handmaidens for the queen, and gave him advice that helped push him into recruiting Ballory. In addition to her skills at information gathering, she was the second best shot among the handmaidens, after Sabé.\nAs a result of her torture at the hands of the Trade Federation occupying forces after her capture, her body was covered with scars that she usually concealed under clothing. Saché was considered very brave for withstanding torture without revealing information that would have jeopardized the Naboo resistance. Because of this, she was also hailed as a Hero of Naboo, which helped her win her election to the Planetary Legislative Assembly.\nSaché had a tendency to \"get quiet,\" as she put it, from time to time. She preferred to keep her feelings to herself and often had trouble articulating them. That sometimes caused interpersonal trouble; during the early days of her time as handmaiden, Saché did not want to share a room with Yané, and the combination of her inflexibility on the subject and her refusal to explain why became the center of one of the handmaidens' first arguments as a group. Especially after her torture, Saché let go of her annoyances towards Yané as they bonded during the occupation of Naboo, with the two developing a romantic relationship.\nSaché was portrayed by Sofia Coppola in the 1999 film Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy. Coppola considers director George Lucas, a long-time friend and working partner of her father Francis Ford Coppola, \"like an uncle to me—he used to send me and my brother Roman Star Wars toys when we were little,\" and upon hearing he was going back to the saga, \"thought it'd be so fun to see how they make them\" as she was preparing her own directorial debut The Virgin Suicides, released that same year. When she asked Lucas if she could attend the shoot, he offered her the role of Saché, and she accepted as \"it seemed like a good vantage point to watch without getting in the way.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sach%C3%A9",
  "/wiki/Sach%C3%A9/Legends",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Hope",
  "/wiki/Darth_Vader_(2020)_4",
  "/wiki/Darth_Vader_(2020)_28",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Sach%C3%A9",
  "/wiki/Naboo",
  "/wiki/44_BBY",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Galactic_Republic",
  "/wiki/Naboo_resistance",
  "/wiki/Naboo_planetary_legislative_assembly",
  "/wiki/Amidalans",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Yan%C3%A9",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Battle_droid",
  "/wiki/Torture",
  "/wiki/Trade_Federation",
  "/wiki/Limb",
  "/wiki/Royal_Naboo_Security_Forces",
  "/wiki/Planet",
  "/wiki/28_BBY",
  "/wiki/Standard_year",
  "/wiki/Queen",
  "/wiki/24_BBY",
  "/wiki/Marriage",
  "/wiki/R%C3%A9illata",
  "/wiki/Governor_of_Naboo",
  "/wiki/Sio_Bibble",
  "/wiki/19_BBY",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Moff",
  "/wiki/Quarsh_Panaka",
  "/wiki/Reproduction",
  "/wiki/32_BBY",
  "/wiki/Captain",
  "/wiki/Eirta%C3%A9",
  "/wiki/Rab%C3%A9_Tonsort",
  "/wiki/Theed_Royal_Palace",
  "/wiki/Sab%C3%A9",
  "/wiki/Forger_(profession)",
  "/wiki/Theed",
  "/wiki/Jedi",
  "/wiki/Coruscant",
  "/wiki/Camp_Four",
  "/wiki/Mariek_Panaka",
  "/wiki/Gungan",
  "/wiki/Twin",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Sofia_Coppola",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/George_Lucas",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Darth_Vader_(2020)_5",
  "/wiki/Darth_Vader_(2020)_24",
  "/wiki/Darth_Vader_(2020)_30",
  "/wiki/Revelations_1",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Inside_Intel:_Padm%C3%A9%27s_Real_Last_Name",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Category:Images_of_Sach%C3%A9",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Centimeter",
  "/wiki/Clone_Wars",
  "/wiki/22_BBY",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/December_6",
  "/wiki/2018"
 ]
}