{
 "name": "Saedhe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Khoonda Militia"
     ]
    }
   ]
  }
 ],
 "content": "Saedhe was a Human male and a former Customs Inspector for the Galactic Republic.\nAfter many years working for the Republic, Saedhe was asked to join the Khoonda Militia on Dantooine as an investigator. He met Meetra Surik there while investigating a possible murder. A Western Fringe farmer was attempting to reach Khoonda with a load of atmospheric sensors when he somehow crashed and died. Saedhe had suspected foul play since there should be no way for the Kinrath to have caught the farmer. Bao-Dur then suspected something was wrong due to the fact that atmospheric sensors would be needed for seasonal data collection, whereas Dantooine was too temperate—the equipment would be better used on tectonic or unstable terrains. Saedhe claimed he needed them back because they were expensive pieces of equipment. In reality, however, the atmospheric sensors had a hidden surveillance device, which Bao-Dur discovered. Surik then confronted Saedhe, and he admitted that he was using the sensors to gather information regarding transmissions between Azkul and his mercenaries and a second source, which was most likely the Exchange. He offered her 5,000 credits, but she took only 3,000, saying that Saedhe would need the credits more than she did.\nIn the game Star Wars: Knights of the Old Republic II: The Sith Lords, if Bao-Dur is not with you when you talk to Saedhe, then the player will not be able to suspect a thing. The player could return the sensors and get 3,000 credits. A player with a high enough Awareness skill can convince him to give 4,000 credits. But if G0-T0 is in the party he can convince Saedhe to give the player 5,000. This doesn't affect the player's alignment. Oddly, G0-T0 refers to Saedhe as if he were female.\nAlternatively, if Terena Adare is told of this then Zherron will lose his position as head of the guard and have the position replaced by Berun Modrul , but this offers no alignment change, nor the reward that Saedhe promises.\nYou can also threaten to tell the truth to Azkul, which prompts Saedhe to tell you he is alerting the militia. You can then murder him, which earns you 5,000 credits and some influence with HK-47 if he is in your party.\nSaedhe originally possessed a unique white head model, but it was altered to a more generic old black male model in the final release of the game. The original model can be seen in the game's restoration mod, better known as \"The Sith Lords Restored Content Mod,\" or TSLRCM.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Khoonda_Militia",
  "/wiki/Customs_Inspector",
  "/wiki/Khoonda",
  "/wiki/Meetra_Surik",
  "/wiki/Atmospheric_sensor",
  "/wiki/Kinrath/Legends",
  "/wiki/Bao-Dur",
  "/wiki/Azkul",
  "/wiki/Mercenary/Legends",
  "/wiki/Exchange",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/G0-T0",
  "/wiki/Terena_Adare",
  "/wiki/Zherron",
  "/wiki/Berun_Modrul",
  "/wiki/HK-47"
 ]
}