{
 "name": "Saelt-Marae",
 "display_name": "Saelt-Marae",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yarkora"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Saelt-Marae was a Yarkora male who worked as an informant for the Hutt crime lord Jabba Desilijic Tiure. He would pose as a merchant and uncover plots against the Hutt while at Jabba's Palace on the planet Tatooine. In 0 ABY, he was in the palace when the Sith Lord Darth Vader arrived to speak with Jabba, but was then dismissed from the Hutt's throne room.\nIn 4 ABY, Saelt-Marae was sat in the throne room with the Whiphid J'Quille when the droids R2-D2 and C-3PO arrived with a message from their master, the Jedi Knight Luke Skywalker. The message was presented to Jabba and asked that the Hutt bargain for the freedom of the smuggler Han Solo, who was imprisoned in carbonite on one of the throne room's walls. The Yarkora was then among the courtiers that watched a performance by the Max Rebo Band that ended in the enslaved dancer Oola being fed to Jabba's pet rancor, Pateesa.\nAfter Oola's death, Princess Leia Organa arrived at the palace disguised as the bounty hunter Boushh as part of a plan to rescue Solo. She brought the Wookiee Chewbacca with her as a prisoner and negotiated with Jabba over the bounty on the Wookiee, producing an active thermal detonator to threaten him into paying more. Saelt-Marae and others ducked for cover, but Jabba only laughed and agreed to a higher price.\nThe next day, Skywalker arrived and tried to negotiate with Jabba, but was dropped into the rancor pit. Saelt-Marae was part of the crowd that gathered to watch as the Jedi slew the rancor, after which Jabba sentenced Skywalker, Solo, and Chewbacca to death at the Great Pit of Carkoon. Saelt-Marae accompanied Jabba on the sail barge Khetanna to watch the executions, but the prisoners attacked their captors and ultimately Organa killed Jabba before destroying the barge.\nSaelt-Marae was a Yarkora male who served as an informant for the Hutt crime lord Jabba Desilijic Tiure, working to uncover potential plots against his employer. Based at the Hutt's palace on the desert planet Tatooine, the Yarkora would pose as a Tatooine merchant to spy on Jabba's enemies inside the palace, which was a job for life. In 0 ABY, Saelt-Marae was stood at the back of a crowd of thugs that Jabba summoned to his throne room to attack the Sith Lord Darth Vader. Vader cut down the rest of the thugs in the group and then threatened Jabba until the Hutt submitted.\nIt was in this capacity as an informant that, in 4 ABY, he was present in Jabba's throne room, sat beside the Whiphid J'Quille in one of the booths when Bib Fortuna, Jabba's majordomo, and two Gamorrean guards escorted the droids R2-D2 and C-3PO into the room. R2-D2 then played a hologram of the droids' master, Jedi Luke Skywalker, for Jabba, in which Skywalker asked to bargain with the Hutt for the freedom of the smuggler Han Solo, a friend of the Jedi's whom Jabba kept frozen in carbonite while displaying him in the palace. Skywalker ended the message by gifting Jabba the two droids, but the Hutt declared he had no interest in losing Solo.\nSaelt-Marae was again sat in one of the throne room's booths when Jabba and his court watched a performance of the song \"Jedi Rocks\" by the Max Rebo Band. When the song ended, Jabba had them repeat the number, but during the second performance, the Hutt interrupted the song when he dropped the enslaved dancer Oola into a pit below the throne room after she refused his advances. The Yarkora remained in the booth while the court then gleefully watched as Oola was devored by Jabba's pet rancor, Pateesa. With the commotion over, Saelt-Marae and the rest of the court's attention was drawn to the throne room's entry way by the sound of blaster fire. He turned as Princess Leia Organa, disguised as the bounty hunter Boushh, entered the room with the Wookiee Chewbacca as her prisoner.\nOrgana demanded double the bounty the Jabba had set on Chewbacca, and produced an active thermal detonator in order to threaten the Hutt. The sight of the weapon caused Saelt-Marae to take cover along with many other courtiers, but Jabba just laughed and gave a slightly increased counter-offer that Organa accepted, allowing Chewbacca to be taken away to the palace dungeons. Organa's true objective in the palace was to rescue Solo, but Jabba had seen through her disguise and set a trap for her. Later that night, Saelt-Marae and many other members of the court were laying in wait behind curtains in the throne room when Organa snuck back in and freed the smuggler from the carbonite. Once she removed her mask, Jabba revealed the trap and had the curtains pulled back to reveal Saelt-Marae and the others, who were stood on the stairs leading to the throne room's exit, blocking Organa and Solo's path.\nWith Solo and Organa taken prisoner, Skywalker himself soon arrived at the palace. Saelt-Marae was resting in the throne room booth nearest the entry way with J'Quille and a human girl when Skywalker entered, having used a mind trick on Fortuna to convince the majordomo to wake Jabba up. Once Jabba was awake, the rest of the court began to rise as well while Skywalker demanded that Solo and the others be let free. Jabba refused, and when Skywalker threatened him with a blaster pistol, the crime lord dropped the Jedi and the unfortunate Gamorrean Jubnuk into the rancor pit. Saelt-Marae and J'Quille gathered around the grill again to watch, but Skywalker managed to slay the beast after it ate the Gamorrean.\nLando Calrissian, an ally of Skywalker's working undercover as one of Jabba's guards, then pushed past the Yarkora and the Whiphid in order to get down to the pit and drag Skywalker back up to the throne room. Solo and Chewbacca were also brought up, and Jabba sentenced the trio to death, declaring they would be executed at the Great Pit of Carkoon. The prisoners were then marched from the throne room, with Saelt-Marae and other court members following behind them in a crowd.\nIn order to reach the Great Pit of Carkoon, where the prisoners would be fed to a sarlacc, Saelt-Marae traveled with Jabba on the Khetanna, the Hutt's personal sail barge. At the pit, those on the barge gathered at the windows to watch the prisoners be executed, but Skywalker managed to free himself and began attacking Jabba's men. In the chaos that ensued, Organa, who was on board the Khetanna, smashed a panel that controlled the shutters on the sail barge's windows, causing them to close and throw the interior of the barge into darkness. Saelt-Marae panicked and rushed around the barge as Organa killed Jabba by strangling him with her chain. She then escaped to the deck of the sail barge where she used a laser cannon to destroy the vehicle before escaping with her allies.\nSaelt-Marae had tan skin, white hair and black eyes. He stood 2.2 meters  tall.\nSaelt-Marae was played by Sean Crawford in the 1983 film Star Wars: Episode VI Return of the Jedi. In the film, he went unnamed. Saelt-Marae was given the name \"Yak Face\" during the production of Return of the Jedi and listed as number 31 on a list of all the creatures being made for the film dates to November 4, 1981. The character was first named in Star Wars Trilogy Sourcebook, Special Edition, a Star Wars Legends supplement for Star Wars: The Roleplaying Game by West End Games.\nWhile filming of Return of the Jedi was underway, Saelt-Marae was originally supposed to have a quarrel with Ree-Yees, leading C-3PO to intervene in order to separate them. Though it was filmed, it was ultimately cut from the film's release. The palace throne room scenes were filmed between January 25 and February 8, 1982 on Stage 8 at Elstree Studios and the sail barge interior shots filmed on Stage 9 between February 9 and February 11. A maquette of the character measuring ten centimeters by fourteen centimeters by eighteen centimeters was made for the film. The mask was sculpted by Industrial Light \u0026 Magic employee Judy Hawkins.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Saelt-Marae",
  "/wiki/Saelt-Marae/Legends",
  "/wiki/Yarkora",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Merchant",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/0_ABY",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Throne",
  "/wiki/4_ABY",
  "/wiki/Whiphid",
  "/wiki/J%27Quille",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Max_Rebo_Band",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Death",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Bounty_hunter",
  "/wiki/Boushh",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Prisoner",
  "/wiki/Bounty",
  "/wiki/Thermal_detonator",
  "/wiki/Jedi",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Desert",
  "/wiki/Bib_Fortuna",
  "/wiki/Majordomo",
  "/wiki/Gamorrean",
  "/wiki/Hologram",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Blaster",
  "/wiki/Human",
  "/wiki/Mind_trick",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Jubnuk",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Sarlacc",
  "/wiki/Laser_cannon",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Sean_Crawford",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/November_4",
  "/wiki/1981",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/Ree-Yees",
  "/wiki/January_25",
  "/wiki/February_8",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/February_9",
  "/wiki/February_11",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Category:Images_of_Saelt-Marae",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Star_Wars:_Darth_Vader_(2015)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Battle_of_Yavin",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Secret_mission_to_Geonosis",
  "/wiki/Darth_Vader_(2015)_4",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Databank_(original)",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Chronicles"
 ]
}