{
 "name": "Saes Rrogon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kalee"
     ]
    },
    {
     "name": "Died",
     "values": [
      "41.5 ABY",
      "Harbinger"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaleesh"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Relin Druur"
     ]
    }
   ]
  }
 ],
 "content": "Saes Rrogon was a male Kaleesh Jedi-turned-Sith Lord serving the Old Sith Empire during the onset of the Great Hyperspace War.\nBorn on Kalee, Rrogon was the Padawan of Jedi Master Relin Druur. But the Kaleesh was twisted by Lignan crystals during an assignment and he fled to the Sith Empire.\nIn 5000 BBY, as the Great Hyperspace War began, Rrogan was the captain of the Sith dreadnaught Harbinger. He and his crew were given a special assignment by the Dark Lord of the Sith, Naga Sadow: collecting Lignan crystals from the Phaegon system for the crucial battle of Kirrek. It was then that Relin Druur and his new Padawan, Drev Hassin, attacked the Harbinger, intending to stop Saes from bringing the ore from leaving the system. Saes dueled his former master, seeking to end the score between them once and for all. He succeeded in wounding Druur, but had failed to stop him damaging the Harbinger's hyperdrive.\nDruur's actions caused the Harbinger to accidentally jump over five thousand years into the future. With the Lignan ore, Saes used the Force to keep his ship together until it was out of the warp. Upon learning of what had happened, Saes intended to return his cargo to Sith space, unsure of what had happened to the Empire. Facing off against Druur for the last time, he died at the hands of his former Master, who was angered by the death of Drev Hassin.\nA male Kaleesh, Saes Rrogon was originally apprenticed to Jedi Master Relin Druur. While on a mission together, however, they discovered Lignan crystals, an ore strong with the dark side of the Force. It may have been that Saes was corrupted by the Lignan, resulting in his leaving the Jedi Order to join Naga Sadow's Sith Empire.\nIn 5000 BBY, during the Sith invasion of the Galactic Republic known as the Great Hyperspace War, Rrogon was a captain in Sadow's fleet and commanded the Sith starship Harbinger. He was given the mission of extracting Lignan crystals from the Phaegon system. These crystals were vital for Sadow's invasion plan on Kirrek.\nSaes and his crew aboard the Harbinger had traveled more than five thousand years in time because of a hyperdrive half destroyed by Relin Druur. Rrogon's ship contained Lignan. He had the ore to bring back to Naga Sadow to help win the Battle of Kirrek. Rrogon dueled his former Master aboard the Harbinger and died in the battle after Druur used his own anger at his life's failures to kill his former apprentice using Rrogon's own lightsaber, stabbing him in the chest. Druur subsequently crashed the Harbinger on a frozen moon, destroying both the ship and the Lignan and dying as soon as the ship collided with the moon's surface.\nSaes Rrogon was a Sith Lord, and often made threats to those who chose to disobey him. He also incorperated Kaleesh views into his combat style and position as a Sith and Captain. Seas often used a flexible, stark-white facemask that he could shape into the likenesses of animals from his homeworld of Kaleesh.\nThe Kaleesh darksider, however, displayed great arrogance in his abilities. This caused him to underestimate his former Jedi Master Relin Druur, who using the dark side, Force-choked Saes and impaled him with his own lightsaber, killing him.\nSaes had exceptional power and he was known to have had the ability to conjure Force lightning. He displayed the skill of confrontation his Relin, he demonstrated Force Choke. His most impressive use of the Force, was when he drew upon the power of the Lignan ore to pull the Harbinger out of hyperspace.\nSaes also had some knowledge of lightsaber combat, which was great enough to sever his old Master's arm off and nearly kill him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Saes_Rrogon",
  "/wiki/Kalee/Legends",
  "/wiki/41_ABY",
  "/wiki/Harbinger_(Sith_dreadnaught)",
  "/wiki/Kaleesh/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Relin_Druur",
  "/wiki/Jedi/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Lignan_crystal",
  "/wiki/5000_BBY/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Sith_dreadnaught",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Phaegon_system",
  "/wiki/Battle_of_Kirrek_(Great_Hyperspace_War)",
  "/wiki/Kirrek",
  "/wiki/Drev_Hassin",
  "/wiki/Skirmish_over_Phaegon_III",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Time_travel/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Time/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Mission_to_the_frozen_moon",
  "/wiki/Death/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Shiak",
  "/wiki/Frozen_moon",
  "/wiki/Moon/Legends",
  "/wiki/Special:EditPage/:Saes_Rrogon",
  "/wiki/Darksider",
  "/wiki/Force_lightning/Legends",
  "/wiki/Telekinesis/Legends#Choking_powers",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Saes_Rrogon",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/Lost_Tribe_of_the_Sith:_Savior",
  "/wiki/Lost_Tribe_of_the_Sith:_Pantheon",
  "/wiki/Crosscurrent",
  "/wiki/Riptide_(novel)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}