{
 "name": "Safonne_Pendon",
 "display_name": "Safonne Pendon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "21 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pendon's pirates"
     ]
    }
   ]
  }
 ],
 "content": "Safonne Pendon was a male Rodian pirate leader. Pendon commanded a modest, though effective, fleet of ships from his corvette flagship Safonne's Sword. He targeted New Republic convoys, forcing the crews to surrender, while taking possession of both the ships and their cargoes.\nSafonne Pendon was born on the planet Rodia in 21 BBY. Pendon operated as a pirate during the Galactic Civil War, leading a fleet from his CR90 corvette Safonne's Sword. His forces included the Ithorian Venithon Twins, several heavily-modified light freighters, two DP20 frigates, and a GAT-12 Skipray Blastboat. Pendon's base of operations were located in the Mieru'kar sector, on the icy planet of Seltaya Major. He discovered the world after a failed raid against an Imperial Star Galleon-class frigate. During the height of the Galactic Empire, Pendon sold the merchandise he plundered to other criminal elements, and on occasion, the Alliance to Restore the Republic.\nPendon's organization was big enough to rival with the Hy'thor pirate group. Due to this, on 2 ABY, Hy'thor leader Ompiach sent some of his pirates  to negotiate a treaty with Pendon. Unfortunately, the meeting became a naval battle.\nDuring the battle, the crossfire damaged a Rebel freighter with a valuable cargo. The freighter crash-landed in a nearby planet and the Hy'thor pirates followed it to plunder the cargo. It was unclear if Pendon felt any need to do so.\nWith the rise of the New Republic, Pendon no longer dealt with the former Alliance, and instead began dealing with the Empire, as well as his usual clientele in the criminal underworld. Starting in 6 ABY, Pendon began targeting New Republic starships, and each time overwhelming pirate forces forced the surrender of New Republic ships. The New Republic posted a reward of 12,500 credits for Pendon's capture on the charges of piracy, theft, and sabotage.\nSafonne Pendon was a Rodian male who was 1.75 meters tall. He was an adept commander and intimidating individual, as well as a shrewd bargainer and con man.\nPendon was trained in the use of blasters, blaster artillery, grenades, and melee combat. He also had survival training. Pendon was knowledgeable about alien species, cultures, languages, and planetary systems, and had an understanding of bureaucratic procedure and the criminal underworld. A capable pilot, Pendon could fly capital ships, small transports, and starfighters, as well as plot courses through hyperspace. He was also able to use the weapons and deflector shield systems on small vessels, and operate repulsorlift vehicles. Pendon could program and repair computers and droids, perform demolitions, and bypass security systems.\nPendon wielded a blaster pistol and vibroblade, and carried a comlink and datapad.\nPendon was first profiled in Wanted by Cracken, published by West End Games in 1993. Rob Caswell provided the illustration for Pendon.\nHis surname was sometimes misspelled \"Pendonn\" in Alliance Intelligence Reports.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodia/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Pendon%27s_pirates",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Safonne%27s_Sword",
  "/wiki/New_Republic/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Venithon_Twins",
  "/wiki/Light_freighter/Legends",
  "/wiki/DP20_frigate",
  "/wiki/GAT-12_Skipray_Blastboat",
  "/wiki/Mieru%27kar_sector",
  "/wiki/Seltaya_Major",
  "/wiki/Star_Galleon-class_frigate",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Hy%27thor_Group",
  "/wiki/2_ABY/Legends",
  "/wiki/Ompiach",
  "/wiki/Freighter/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_artillery",
  "/wiki/Grenade/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/West_End_Games",
  "/wiki/1993",
  "/wiki/Rob_Caswell",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Casus_Belli",
  "/wiki/Le_facteur_X",
  "/wiki/Casus_Belli_115"
 ]
}