{
 "name": "Saganu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss AscendancyChiss Expansionary Defense ForceHouse Miurani",
      "Chiss Expansionary Defense Force",
      "House Miurani",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Saganu was the male Chiss Aristocra of House Miurani during the Galactic War between Galactic Republic and Sith Empire.\nSaganu served as the Aristocra of House Miurani and as a commander in the Chiss Expansionary Defense Force in 3642 BBY, at the start of the Galactic War between Galactic Republic and Sith Empire. Occasionally, he performed diplomatic duties for the Chiss Ascendancy. During the war, Saganu and his troops were stationed on Hoth to help the Chiss's allies of the Sith Empire to seize the planet from the Republic. Saganu also provided assistance to the Imperial Intelligence before it was disbanded that year, although it was hidden from official records.\nOn Hoth, he was stationed at the outpost called Zero Station where he supervised his people and Ensign Raina Temple in their efforts to aid their Sith allies against the Galactic Republic. Together, Saganu and Temple aided the Imperial Intelligence agent Cipher Nine in tracking down rogue Imperial Admiral Layek Davos across Hoth's frozen surface.\nDuring the Eternal Empire's attack on known space, Saganu brokered the deal between Emperor Arcann and the Ascendancy. His cool-headed negotiation tactics helping the Chiss to retain the majority of their worlds in exchange for large production resources for the Eternal Fleet. His agreement earned him a promotion to Supreme Commander of the Chiss Expansionary Defense Force, with him overseeing all of the Chiss's military campaigns.\nAfter the Eternal Empire's defeat, Aristocra Saganu contacted the Alliance's Commander offering information regarding Theron Shan, a recent supposed traitor of the Alliance. He assisted the Commander in locating Theron Shan on the Chiss world of Copero, providing the Commander with political immunity whilst on the operation, due to Theron Shan's association with a traitor to the Ascendancy, Syndic Zenta. During the operation, Saganu offered the Commander the services of the Chiss Expansionary Defense Force in exchange for the death of Syndic Zenta.\nSaganu can be romanced if the Agent is female. If the Agent is of the Chiss species, he will have additional dialogue options in conversations with Saganu and also be made a merit adoptive of House Miurani.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Chiss_Expansionary_Defense_Force",
  "/wiki/House_Miurani",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Aristocra/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Commander/Legends",
  "/wiki/3642_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Zero_Station",
  "/wiki/Ensign/Legends",
  "/wiki/Raina_Temple",
  "/wiki/Sith/Legends",
  "/wiki/Cipher_Nine",
  "/wiki/Admiral/Legends",
  "/wiki/Layek_Davos",
  "/wiki/Eternal_Empire",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Emperor/Legends",
  "/wiki/Arcann",
  "/wiki/Eternal_Fleet",
  "/wiki/Supreme_Commander",
  "/wiki/War_against_Zakuul",
  "/wiki/Alliance_Commander",
  "/wiki/Theron_Shan",
  "/wiki/Copero/Legends",
  "/wiki/Mission_to_Copero",
  "/wiki/Syndic/Legends",
  "/wiki/Zenta",
  "/wiki/Merit_adoptive/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}