{
 "name": "Sahr",
 "display_name": "Sahr",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  }
 ],
 "content": "Sahr was a female, Blonde–haired individual who worked with the pirate Larken on board his starship Pillage as a gunner. Sahr became Larken's partner and gunner after she sold him a tip as to the location of the Helix–class light interceptor, Kizbon's Box. With this information Larken and Sahr, along with two other pirate vessels named Trust Me and Profit, the latter of which was piloted by an individual named Druug, attempted to capture the Box. The group positioned themselves near the space station, Darknon Station under the cover of a magnetic storm in preparation to ambush their target. When the Box arrived the three ships moved in on the supposedly unarmed target but were horrified to find their mark had several hidden armaments including proton torpedos. With the torpedoes it destroyed Trust Me and Profit before it's owner commed Larken and Sahr in the Pillage, addressing them both by name. Whilst acting as Larken's gunner Sahr wore a white blouse and black pants. She was short and lithe of stature and smiled pleasantly when Larken spoke to her.\nSahr first appeared in 1995 the article \"A Buyer's Guide to Alternative Starships\" which was published in the fifth issue of the Star Wars Adventure Journal series of supplement books for West End Games, Star Wars: The Roleplaying Game. The article was written by Stephen Luminati and included two short stories to illustrate some of the ships mentioned. Larken appeared in one of these, titled \"Kizbon's Box\" which gave no information as to what era it was set in.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Larken",
  "/wiki/Starship/Legends",
  "/wiki/Pillage",
  "/wiki/Helix-class_light_interceptor",
  "/wiki/Kizbon%27s_Box",
  "/wiki/Trust_Me",
  "/wiki/Profit_(pirate_ship)",
  "/wiki/Pilot/Legends",
  "/wiki/Druug",
  "/wiki/Ambush_near_Darknon_Station",
  "/wiki/Space_station/Legends",
  "/wiki/Darknon_Station",
  "/wiki/Ion_storm/Legends",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Unidentified_pilot_(Kizbon%27s_Box)",
  "/wiki/Comlink/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/1995",
  "/wiki/A_Buyer%27s_Guide_to_Alternative_Starships",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Stephen_Luminati"
 ]
}