{
 "name": "Sai_Sircu",
 "display_name": "Sai Sircu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 21 BBY",
      "Devastation"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human or Dathomirian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Nightsisters"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Sai Sircu was a member of the Nightsisters of Dathomir during the time of the Clone Wars.\nShe and her fellow sister Yansu Grjak led an army of Nightsisters during the war between the Galactic Republic and the Confederacy of Independent Systems. At that time, they formed an alliance with Count Dooku and the Separatists in order to bring about the downfall of the Jedi Order. She first attacked the Sedawan with her sister. It was later revealed on Dathomir that she had more sinister intentions in mind—the subjugation of the galaxy.\nSai Sircu fought a pair of Jedi on her homeworld of Dathomir but was unable to prevent them from helping her valuable captive, Luminara Unduli, escape. After the Jedi freed Unduli, they pursued Sircu, who was confronted by a group of clone troops under the command of Cody. Using her dark powers, she managed to defeat them, but the capabilities of the Jedi were greater than hers, and she was forced to retreat. Meanwhile, the Republic established a garrison on Dathomir, capturing dozens of Nightsisters.\nSircu, however, eluded clone security and regrouped with her allies on the superweapon Devastation, which included Count Dooku, his apprentice Asajj Ventress, and Darth Sidious himself, who made a rare appearance via holotransmitter. Dooku and Sircu assured Sidious that their weapon was far more powerful than any of them could have anticipated, and Ventress suggested a demonstration. Sidious agreed and Ventress set a course for Dathomir, but Sircu, angered over the sudden betrayel, blasted Dooku and Ventress with dark energy, forcing them out of the bridge. She now had command of the ship.\nWhile Dooku made contact with his Master, Ventress confronted two of the six Jedi who had appeared to deactivate the Devastation. However, Sircu accidentally gave her Jedi enemies an edge when she attacked Ventress, sealing their escape. Later, Anakin Skywalker and Mace Windu would confront her in the ship's main weapon chamber as she tried to insert the power from the gathered crystals into herself, which would make her extremely powerful were she to succeed. The two Jedi vanquished her and she perished as she lost control of her power and exploded in a burst of energy that destroyed the superweapon and the ship before it could target Coruscant or other important planets. All six Jedi, along with Dooku and Ventress were able to flee to safely on their ships in the ensuing destruction.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Devastation",
  "/wiki/Human/Legends",
  "/wiki/Dathomirian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Yansu_Grjak",
  "/wiki/Palpatine/Legends",
  "/wiki/Army/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars:_Jedi_Alliance",
  "/wiki/Star_Wars:_The_Clone_Wars:_Jedi_Alliance:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Everything_You_Always_Wanted_to_Know_about_the_Nightsisters_but_Were_Afraid_to_Ask",
  "/wiki/Star_Wars_Insider_122"
 ]
}