{
 "name": "Saile Minnau",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Graying brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance navy",
      "Resistance navy"
     ]
    }
   ]
  }
 ],
 "content": "Saile Minnau was a human male who served as a Resistance fleet guard during the war against the First Order. After the fleet was destroyed following the Battle of D'Qar in 34 ABY, the survivors evacuated to the planet Crait to make a last stand. After the Resistance forces were forced to retreat within the Rebel base they had occupied, Minnau was among those in the base who witnessed the Jedi Master Luke Skywalker leave to confront the First Order alone. The Resistance survivors then escaped aboard the Millennium Falcon.\nSaile Minnau was a human male who served as a guard in the fleet of the Resistance during its war against the First Order. In 34 ABY, the fleet evacuated from the Resistance base on the planet D'Qar but was pursued by ships of the First Order Navy and destroyed vessel by vessel until the only capital ship remaining was the MC85 Star Cruiser Raddus. Those on board the Raddus then evacuated on board U-55 orbital loadlifters to the planet Crait, where they occupied an old Rebel outpost and prepared to make a last stand.\nMinnau was among the Resistance forces who made it to the base, where they fought the First Order from the trenches and using V-4X-D ski speeders before being forced to retreat back into the base once the First Order fired its superlaser siege cannon. As their enemy advanced, the Resistance learned that there was no reinforcements coming to aid them; however, just as hope seemed lost, Jedi Master Luke Skywalker appeared in the base.\nAs Skywalker walked out of the base toward the First Order, Minnau rose from behind one of the baricades alongside fellow Resistance members Salaka Kuchimba and Koo Millham, starring in confusion at the Jedi. Skywalker, who was in fact Force projecting from the planet Ahch-To, then confronted the forces of the First Order and its Supreme Leader, Kylo Ren, alone in order to buy the surviving Resistance members time to escape. After following vulptexs through a hidden tunnel out of the base, all of the surviving Resistance members were picked up by the YT-1300 light freighter known as the Millennium Falcon and escaped from Crait. Minnau shared his surname with Teckla Minnau, a handmaiden from the planet Naboo.\nMinnau had fair skin, graying brown hair, and blue eyes.\nMinnau wore a brown uniform that included a Resistance combat helmet, brown boots, gloves, and a belt. He also used a bandolier of pouches and carried a EL-16 blaster rifle.\nSaile Minnau appeared in the 2017 sequel trilogy film, Star Wars: Episode VIII The Last Jedi. The character was portrayed by Nathan Hamill, who appeared in a cameo alongside his siblings, Griffin Hamill and Chelsea Hamill, who portrayed Kuchimba and Millham respectively. The trio are shown staring at the return of Luke Skywalker, who is portrayed by their father, Mark Hamill.\nNathan Hamill's character was not named in the film, but received identification in Star Wars: The Last Jedi: The Visual Dictionary, a reference book written by Pablo Hidalgo and released in conjunction with the film. Hamill previously portrayed a character in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace, who he named Rehtul Minnau, a name that was later used in official sources but not tied explicitly to Hamill's character in the film. Hamill has stated that he considers Rehtul to be Saile's grandfather due to their shared surname.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_navy",
  "/wiki/Resistance_trooper",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Fleet",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/34_ABY",
  "/wiki/Planet",
  "/wiki/Crait",
  "/wiki/Crait_outpost",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Millennium_Falcon",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Starship",
  "/wiki/First_Order_Navy",
  "/wiki/Capital_ship",
  "/wiki/MC85_Star_Cruiser",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/U-55_orbital_loadlifter",
  "/wiki/Battle_of_Crait",
  "/wiki/V-4X-D_ski_speeder",
  "/wiki/Superlaser_siege_cannon",
  "/wiki/Salaka_Kuchimba",
  "/wiki/Koo_Millham",
  "/wiki/Jedi",
  "/wiki/Force_projection",
  "/wiki/Ahch-To",
  "/wiki/Supreme_Leader",
  "/wiki/Ben_Solo",
  "/wiki/Time",
  "/wiki/Vulptex",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Teckla_Minnau",
  "/wiki/Handmaiden/Legends",
  "/wiki/Naboo",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Helmet",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Belt",
  "/wiki/Bandolier",
  "/wiki/EL-16_blaster_rifle",
  "/wiki/2017",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Nathan_Hamill",
  "/wiki/Chelsea_Hamill",
  "/wiki/Mark_Hamill",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Rehtul_Minnau",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Pursuit_of_Peace",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)"
 ]
}