{
 "name": "Sajar",
 "display_name": "Sajar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Decades before 3653 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dark Council",
      "Dark Council",
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tol Braga"
     ]
    }
   ]
  }
 ],
 "content": "Sajar was a Human male who was known as Darth Sajar in his time as a Dark Lord of the Sith and member of the ruling Dark Council of the reconstituted Sith Empire during the Great Galactic War. He attempted to trap and kill the Jedi Master Tol Braga on the planet Dantooine, but Braga convinced Sajar to abandon the Sith and join the Jedi Order. Sajar renounced the Empire and his seat on the Council to become Braga's Padawan, and he studied the ways of the light side of the Force throughout the rest of the war and the subsequent Cold War.\nWhile Sajar was stationed on Quesh in 3642 BBY to guard a military base, he was caught in an Imperial invasion. Slipping back into the grasp of the dark side after killing several prisoners and recognized by Imperial forces, Sajar decided to die a servant of the light at the hands of the Emperor's Wrath, the Sith Emperor's personal executioner, rather than become a Sith once more. However, Sajar and the troopers of the Republic Military's Eighty-sixth Infantry received reinforcements when Braga sent the Jedi Knight known as the Hero of Tython to rescue Sajar. The Knight's efforts in the battle to save the base ensured that Sajar could return to the Jedi and receive redemption.\nA Human male born many decades before the end of the Great Galactic War with the Galactic Republic, Sajar was powerful enough in the Force to become Darth Sajar, a Sith Lord and a member of the Sith Empire's ruling Dark Council. During his tenure as a Dark Lord of the Sith on the Council, Sajar learned of the existence of the Children of the Emperor—the agents who were unknowing extensions of the Sith Emperor's will.\nSometime before the end of the war in 3653 BBY, Sajar lured the Jedi Master Tol Braga into a trap on the planet Dantooine by professing a desire for peace. The Kel Dor Jedi had contacted many Sith during the conflict in an attempt to start peace talks, and Sajar took advantage of that by attempting to kill the Jedi Master when he arrived. The two dueled for a total of three days, debating the Force and their respective sides throughout the entire fight. Their fight ended when Braga convinced Sajar to abandon the dark side and join the Jedi Order, and the Sith Lord renounced his title to become Braga's Padawan.\nAs Braga's student, Sajar studied the light side of the Force during the rest of the war and the subsequent Cold War after sharing much of his knowledge of the Empire with the Jedi Council. Among the information he gave the Council was the existence of the Children, though their purpose or locations remained unknown to the Jedi. Sajar served as the inspiration for Braga's later mission to capture and redeem the Sith Emperor himself.\nSajar was still a Padawan by 3642 BBY, by which time Braga had sent him on an assignment from the Jedi homeworld of Tython to guard the Republic's Adrenal Research Base on the planet Quesh. Quesh's adrenal production made the planet a vital Republic resource, but its peacefulness made it a viable place for Sajar to meditate while also serving the Republic. The facility was guarded by a detachment from the Republic Military's Eighty-sixth Infantry under Lieutenant Gundo.\nHowever, that peace was shattered when the Empire invaded, and Gundo's forces captured several Imperial scouts. The Republic troopers turned the prisoners over to Sajar for interrogation, but the scouts angered the Padawan and caused his Sith personality to resurface. Sajar brutally murdered the defenseless and shackled prisoners and lied to Gundo and his men when they learned of their deaths. Imperial forces soon arrived outside the cliffs within which the facility was located, and in a frenzy of anger, Sajar telekinetically hurled the scouts' corpses at his enemies. An Imperial officer recognized Sajar as the traitorous Darth Sajar and warned the former Sith that the Emperor's Wrath—the Sith Emperor's personal immortal executioner and an individual whom even the Dark Council feared—was coming.\nRegaining control of himself, Sajar decided that he would rather die at the Wrath's hand than become Darth Sajar once more, and he refused to fight, knowing that doing so would cause him to return to the dark side. Bereft of Sajar's aid, Gundo ordered his men to prepare their defenses anyway, and Sajar ignored his Master's attempts to reach him via holocomm. Braga learned of the situation from Gundo and sent the Jedi Knight known as the Hero of Tython to Quesh in order to rescue Sajar, and the despondent Padawan revealed the truth to the Hero upon the Knight's arrival.\nWhen Gundo requested the Jedi's aid in defending the main entrance while his engineers jury-rigged a set of ray shield generators, Sajar begged the Knight not to ask him to fight, and the Hero acknowledged the Padawan's request by ordering him to help the engineers set up the ray shields. While the Knight and a companion battled Imperial and Sith attackers and pushed them back to the facility's main entrance, Sajar worked with the Eighty-sixth's engineers to bring the ray shields online, and with Sajar's help they were able to seal the base in half the time it would normally have taken. After the shields were activated, the Hero encountered Lord Scourge, the Emperor's Wrath, who showed interest in the Knight before departing and leaving Sajar to his own fate. Once the Hero returned, Sajar agreed with the other Jedi's suggestion that he return to Tython, with the Hero reminding the Padawan that Braga had sent aid because he cared for his student—and that he would forgive Sajar's actions if given the chance.\nTrue to his word, Sajar soon returned to Tython and informed the Council of the events on Quesh. He began his training anew on the Order's homeworld, shedding his guilt and remorse over his actions when he understood that they would only precipitate another fall to the dark side. He later sent a message to the Hero of Tython, thanking the Jedi for the chance at redemption and expressing his gratitude at being able to walk the path to the light once more.\nLight-skinned with green eyes and short-cut brown hair, Sajar was greatly defined by his time as both a Jedi and a Sith. As a Sith Lord and member of the Dark Council, Darth Sajar was charged with the protection of the Empire's civilization at all costs, and he would not hesitate to press the offensive or seize an advantage in order to eliminate a threat. Even Sajar himself acknowledged that he was ruthless and brutal in the treatment of his enemies as a Sith, and that trait prompted him to kill the Imperial scouts in what he described as a \"slaughter\" when his anger led to the resurfacing of his Sith personality.\nUpon hearing of Tol Braga's attempts to begin peace talks, Sajar saw an opportunity to eliminate a Jedi Master and took it, believing that Braga's desire for peace made him the weaker of the two. However, he was also a capable and intelligent individual who could engage in a serious and thought-provoking debate. Over the course of their three-day duel, Braga was able to convince the Dark Councilor to become a Jedi, and Sajar abandoned his title and use of the dark side to study under the Kel Dor.\nBy the time of the Cold War, Sajar had come to greatly regret his actions as a Sith and wholeheartedly embraced the light side of the Force. Despite his training, however, he lost control of his emotions when confronted with the enemy and lost faith in his abilities and right to be a Jedi. Fear of the Emperor's Wrath brought him back to his senses, and the Padawan decided that it would be better to die a Jedi than become what he characterized as a \"monster\" again. At the Hero of Tython's urging, Sajar returned to Tython and began training as a Jedi once more, letting go of his guilt under the instruction of the Masters at the Jedi Temple. He was grateful for the chance to redeem himself and intended to walk the path to become a Jedi regardless of the difficulties ahead of him.\nDarth Sajar spent decades as a Sith, and he excelled at channeling his hatred to strengthen himself in battle. However, as a Jedi, he embraced the light side of the Force and spent years retraining himself under the guidance of Braga to abandon the ways of the Sith. Sajar was powerful in the use of the Force, and he demonstrated significant endurance and combat prowess when he dueled Braga for three days straight. Sajar also showed impressive familiarity with computers and engineering, helping a team of experienced technicians double their efficiency in setting up and activating jury-rigged ray shielding.\nAs a Jedi Padawan, Sajar utilized traditional unarmored Jedi robes and a blue-bladed lightsaber, though he refused to use it after his brief fall on Quesh in fear of becoming a Sith. He wielded his lightsaber with a two-handed grip, favoring overhead strikes and close-combat attacks.\nSajar first appeared in the Jedi Knight mission \"The Emperor's Wrath\" in Star Wars: The Old Republic, a video game developed by BioWare and released in 2011. In the mission, Tol Braga sends the player to Quesh to investigate why Sajar is not responding to his communications, and the Knight is then forced to defend the research facility from an Imperial attack. The player can choose to force Sajar to fight for dark side alignment points, allow him to hide for light side points, or have him aid the engineers for additional light side points. If Sajar fights, he will aid the player in battling the Imperials and Sith in the base, though he runs away from the main entrance after realizing he is falling back to the dark side. After the battle, the player can then convince Sajar to return to Tython for more light side points or cover up Sajar's murder of the scouts for dark side points. As a Republic character, the Jedi Knight is assumed to only choose the light side options, so this article assumes that the player has Sajar aid the engineers and return to Tython.\nSajar later sends a message to the player thanking them for either sending him to Tython or covering up the incident, depending on their choice. An earlier Jedi Knight mission, \"The Defector,\" identifies Sajar as the source of the Jedi Council's information on the Children of the Emperor, though he is not mentioned by name. The 2012 reference guide Star Wars: The Old Republic Encyclopedia explains the backstory behind Sajar's duel with Braga in an entry on the Kel Dor Jedi, though it mistakenly places the duel on the moon Nar Shaddaa instead of Dantooine.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Jedi/Legends",
  "/wiki/Sajar_Ohmo",
  "/wiki/Clan_of_the_Toribota",
  "/wiki/Standard_decade/Legends",
  "/wiki/3653_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Tol_Braga",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Time/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Quesh",
  "/wiki/3642_BBY",
  "/wiki/Adrenal_Research_Base",
  "/wiki/Quesh_war",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Tenebrae",
  "/wiki/Republic_trooper",
  "/wiki/Republic_Military/Legends",
  "/wiki/Eighty-sixth_Infantry",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Reproduction/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Duel_on_Dantooine",
  "/wiki/Standard_day/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Hunt_for_the_Sith_Emperor",
  "/wiki/Homeworld/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Adrenal",
  "/wiki/Meditation/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Gundo",
  "/wiki/Scout/Legends",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Telekinesis/Legends",
  "/wiki/Unidentified_Imperial_officer_(Quesh)",
  "/wiki/Immortality/Legends",
  "/wiki/Holocomm/Legends",
  "/wiki/Canon",
  "/wiki/Engineer/Legends",
  "/wiki/Ray_shield_generator/Legends",
  "/wiki/Ray_shield/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Scourge",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jedi_Temple_(Tython)/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Lightsaber/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Category:Images_of_Sajar",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Template:TOR_dates/2"
 ]
}