{
 "name": "Sakas",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mikkian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Special Forces Trackers Unit",
      "Special Forces Trackers Unit"
     ]
    }
   ]
  }
 ],
 "content": "Sakas was a Mikkian female soldier who fought for the Alliance to Restore the Republic during the Galactic Civil War. She was a member of the Pathfinders, an Rebel Alliance Special Forces unit commanded by General Han Solo, and fought alongside Sergeant Kes Dameron during the raid at the Wretch of Tayron in the weeks following the Battle of Endor.\nIn the course of the raid, she and Dameron destroyed an All Terrain Scout Transport that, when it crashed, destroyed part of the outer wall along the Imperial Security Bureau base that the Pathfinders were assaulting. As a result, the Pathfinders were able to enter the base, where they hacked into the Imperial network and learned a number of the Empire's secrets—including the commencement of Operation: Cinder, a potentially devastating Imperial attack carried out against a number of planets in the galaxy.\nSakas fought as a soldier in the Alliance to Restore the Republic during the Galactic Civil War, the Alliance's struggle to overthrow the Galactic Empire. Nearly three weeks after the Battle of Endor, in which the Alliance delivered a devastating blow to the Empire by destroying its second Death Star superweapon and defeating Emperor Palpatine, Sakas served with the Pathfinders, an Rebel Alliance Special Forces unit under the command of General Han Solo, in a raid on an Imperial Security Bureau black site at the Wretch of Tayron in the Outer Rim Territories.\nBefore the raid commenced, members of the Pathfinders took different positions throughout the area. Sakas was positioned with Sergeant Kes Dameron on a ridge overlooking the base, where they prepared to fire a missile at their target. Once all teams reported they were ready to commence with the attack, Solo gave the order to fire. Dameron fired the missile at an All Terrain Scout Transport inside the base's walls, which exposed an opening when the walker crashed through and destroyed a section of the wall.\nSakas and Dameron, who reported to Solo that an entrance was exposed, charged through the breach and opened fire on the Imperial forces they found inside. Together, they took out several stormtroopers, scout troopers, and a 74-Z speeder bike. Dameron was nearly cornered by a scout trooper, and Sakas called out to warn him of the impending attack. The sergeant was saved by the timely arrival of Chewbacca, General Solo's Wookiee companion.\nSolo and the rest of the Pathfinders arrived soon thereafter, and the team assembled to wait for their protocol droid, C-3PO, whose job it was to hack into the Imperial computers. Once the droid arrived, the Pathfinders entered the base and fought their way through Imperial forces. They confronted the base's commander, who attempted to flee to the base's computer network so he could wipe its data before the Rebel team got to it. Once confronted, however, the commanding officer offered his surrender, and the Pathfinders secured the base.\nSakas was present in the base's command center when C-3PO hacked into the computers and uncovered Imperial secrets, including the launch of Operation: Cinder, an Imperial contingency order that targeted a number of planets in the galaxy as retribution for the Emperor's death. The actions of Sakas and the Pathfinders at the Wretch of Tayron gave the Alliance the chance to fight against Operation: Cinder and stop the Imperial attacks when they were unleashed, including on the Emperor's homeworld of Naboo.\nSakas was a pink-skinned, blue-eyed Mikkian female.\nDuring the raid at the Wretch of Tayron, Sakas donned the standard uniform of the Pathfinders, which they wore during and after the Battle of Endor. She wielded an A280 blaster rifle during the raid.\nSakas was introduced in the 2015 comic book Shattered Empire 3. The comic was written by Greg Rucka, and the art for the panels in which Sakas appeared was drawn by Marco Checchetto. The issue was released October 14, 2015. In a post on his Tumblr page, dated October 15, 2015, Marvel Comics editor Jordan D. White confirmed that Sakas is a member of the Mikkian species.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Wookieepedia:AgriCorps",
  "/wiki/Wookieepedia:AC/Sakas",
  "/wiki/Mikkian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/Rebel_trooper",
  "/wiki/Galactic_Civil_War",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/General",
  "/wiki/Han_Solo",
  "/wiki/Sergeant",
  "/wiki/Kes_Dameron",
  "/wiki/Raid_at_the_Wretch_of_Tayron",
  "/wiki/Standard_week",
  "/wiki/Battle_of_Endor",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Slicer",
  "/wiki/Galactic_Empire",
  "/wiki/Computer",
  "/wiki/Operation:_Cinder",
  "/wiki/Planet",
  "/wiki/The_galaxy",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Wretch_of_Tayron",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Mountain",
  "/wiki/Missile",
  "/wiki/Walker",
  "/wiki/Stormtrooper",
  "/wiki/Scout_trooper",
  "/wiki/74-Z_speeder_bike",
  "/wiki/Scout",
  "/wiki/Trooper",
  "/wiki/Chewbacca",
  "/wiki/Wookiee",
  "/wiki/3PO-series_protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Protocol_droid",
  "/wiki/Unidentified_Imperial_base_commander",
  "/wiki/Commanding_officer",
  "/wiki/Death",
  "/wiki/Tayron",
  "/wiki/Homeworld",
  "/wiki/Naboo",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/A280_blaster_rifle",
  "/wiki/2015",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Shattered_Empire_3",
  "/wiki/Greg_Rucka",
  "/wiki/Marco_Checchetto",
  "/wiki/October_14",
  "/wiki/October_15",
  "/wiki/Marvel_Comics",
  "/wiki/Jordan_D._White",
  "/wiki/Species",
  "/wiki/The_Princess_and_the_Scoundrel_(audiobook)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Rebel_Alliance",
  "/wiki/Category:Images_of_Sakas",
  "/wiki/Shattered_Empire_2",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Shattered_Empire_1",
  "/wiki/File:Sakas-Tumblr.png"
 ]
}