{
 "name": "Sal-Deron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Republic Strategic Information Service",
      "Republic Strategic Information Service"
     ]
    }
   ]
  }
 ],
 "content": "Sal-Deron was a Human female and Jedi Master during the third galactic conflict between Galactic Republic and Sith Empire. She worked with the Republic Strategic Information Service and was one of their best operatives.\nMaster Sal-Deron was a Jedi Master that was well-versed in reconnaissance and intelligence, skills generally lacked by most members of the Jedi Order. For this reason, she was recruited by the Republic Strategic Information Service to assist in their operations. Though many agents were skeptical of Sal-Deron's ability to perform sensitive operations, she soon proved her worth and was considered by Jonas Balkar to be \"one of the best covert operators he had ever known.\" Sal-Deron developed a reputation of achieving her goals even without the use of the Force, gaining her the respect of friends and foes alike.\nWhen the Eternal Empire invaded the rest of the galaxy, the information service's agents helped her go underground and she began to work on tracking down former Jedi and identifying promising recruits for the Jedi Order, a job she also excelled at. Sal-Deron continued this task after the Eternal Empire was toppled.\nWhen the Commander, Arn Peralun, and Aryn Leneer returned from their mission to the old Dantooine Jedi Enclave, where they investigated the whereabouts of Darth Malgus, Sal-Deron was one of the Jedi chosen by Master Gnost-Dural to discuss the next moves in rebuilding the Jedi after the war against Zakuul. Gnost-Dural chose to invite her, along with Tau Idair and Vinyor Tesh, to the gathering because Gnost-Dural believed them to be the Order's most important representatives.\nIf the player is an Imperial who has decided to side with the Republic they will meet Jonas Balkar and Sal-Deron on Nar Shaddaa. During that meeting Master Sal-Deron will ask the player to help protect the remaining Jedi that she would soon be summoning to return to the Galactic Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sal_(disambiguation)",
  "/wiki/Quite_A_Story_To_Tell",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Third_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Agent/Legends",
  "/wiki/Jonas_Balkar",
  "/wiki/The_Force/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/The_galaxy",
  "/wiki/Jedi/Legends",
  "/wiki/War_against_Zakuul",
  "/wiki/Alliance_Commander",
  "/wiki/Arn_Peralun",
  "/wiki/Aryn_Leneer",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Darth_Malgus",
  "/wiki/Tau_Idair",
  "/wiki/Vinyor_Tesh",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith"
 ]
}