{
 "name": "Salacious B. Crumb",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kowak"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kowakian monkey-lizard"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "0.7 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "9 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Salacious B. Crumb was a Kowakian monkey-lizard who worked as a jester in the court of the crime lord Jabba Desilijic Tiure during the Galactic Civil War. Known for his shrill laughter, Crumb kept his master amused until his death during the rescue of Han Solo by members of the Alliance to Restore the Republic.\nA male Kowakian monkey-lizard from the planet Kowak, Salacious B. Crumb was known for his shrill, cackling laughter and sophisticated sense of humor like his fellow monkey-lizards. Many individuals of his species served as favored pets among denizens of the underworld, retaining their apparently hilarious-sounding names, and Crumb was no exception, becoming the unofficial court jester of the Hutt crime lord Jabba Desilijic Tiure. Crumb's association with Jabba began when the thief stowed away on the Hutt's starship, and was found and captured by the Twi'lek Bib Fortuna.\nJabba struck up a unique deal with the monkey-lizard; if Crumb could amuse Jabba at least once a day, he would be allowed to eat and drink as much as he pleased, but, if he failed, he would be slain. Crumb lived in this manner for over a dozen standard years, and henceforth sat beside Jabba to mercilessly tease and imitate captives, amusing his master greatly with his mimicry and laughter. Crumb even imitated visitors, courtiers, and even Jabba himself, and used his position on the Hutt's dais to steal morsels of food. Jabba's noxious pet was tolerated because of the amusement he brought Jabba, and because of his unwavering support for his master.\nCrumb was present at Jabba's side when the Dark Lord of the Sith Darth Vader arrived in Jabba's Palace to negotiate with the Hutt, and later accompanied his master aboard the sail barge Khetanna to celebrate with Vader. Crumb laughed uproariously as Jabba's gangsters fired at a herd of banthas, causing Vader to threaten the creature's life should he laugh again in his presence.\nCrumb was present when members of the Rebel Alliance came to rescue Han Solo from his boss' clutches. While they managed to free Solo they were quickly recaptured and Jabba took former Alderaan Princess Leia Organa as his slave. After a failed negotiation Jedi Knight Luke Skywalker killed Jabba's pet rancor Pateesa. He accompanied his boss and his guests on the ill-fated Khetanna to the Great Pit of Carkoon, where Jabba planned to execute some of the Rebels. The foul gangster's effort at execution was quickly thwarted by the Rebels carefully laid plan.\nWhen Skywalker managed to free himself and as the Rebels began fending off Jabba's Guards; general mayhem broke out on the sail barge. Leia cut off the lights of the barge, Jabba's guests, including Crumb, ran in search of an exit from the barge while Organa seized the moment to choke Jabba to death with her chain. Following Jabba's death, Crumb attacked C-3PO, almost snatching one of his eyes, but R2-D2 went to the rescue of the droid and shocked Crumb, who turned away annoyed. Crumb was apparently killed when the Khetanna was destroyed by the Rebels, who then re-united and escaped.\nA Kowakian monkey-lizard with a distinctive shrill cackle, Salacious Crumb usually sat on Jabba's lap, where he frequently stole food and mimicked, as the palace's unofficial jester, Jabba's courtiers, visitors and sometimes even Jabba himself. In fact, Salacious was just tolerated because his antics amused the Hutt and because of his unwavering support of his master.He also loved tracking Jabba's tail move back and forth.\nSalacious was also known for his lack of respect, a trait which was demonstrated when the Sith Lord Darth Vader arrived to negotiate with the Hutt. Aboard Jabba's sail barge Khetanna, he laughed uproariously as the Hutt's gangsters fired at a herd of banthas. The Sith Lord threatened the jester's life should he laugh again in his presence.He would even sometimes mercilessly tease Jabba's captives and enjoyed watching Jabba torment others.\nSalacious knew many individual's secrets and he was completely willing to use those secrets for his own personal gain or amusement. He had no moral code and was only loyal to Jabba.\nAccording to the mole-flea Lugubrious Mote, Salacious was not very intelligent. She described him as \"dumber than a newborn rancor.\"\nSalacious B. Crumb was voiced by Mark Dodson and controlled by puppeteer Tim Rose, who also worked with the puppet of Admiral Gial Ackbar, in the 1983 film Star Wars: Episode VI Return of the Jedi. As seen in the 1985 documentary From Star Wars to Jedi: The Making of a Saga, Rose actually gave Crumb a voice , which he frequently used in conjunction with the puppet to joke around on set, but his voice was ultimately replaced with Dodson's. Salacious B. Crumb ended up being actor Anthony Daniels' favorite character of the series. Sound designer Ben Burtt described Salacious' laugh as a \"funny, hyena-like laugh.\"\nThe original idea for the character of Salacious came from Ben Burtt. He said it would be funny to have a small creature sitting on the shoulder of another creature and repeating everything the larger creature said during arguments.\nThe puppet for Salacious was created by Tony McVey. Its name was accidentally created by The Empire Strikes Back and Return of the Jedi puppeteer Phil Tippett. George Lucas had given them the task of deciding the character's name. While trying to decide on a name, Tippett and his crew went out to lunch. They had drunken \"a few pitchers of beer,\" and on exit Tippett decided to bend down to tie his shoes. He said \"Wait a minute, guys, while I tie my soolacious,\" slurring the word \"Shoelaces.\" A crew member immediately recognized its potential. While George Lucas initially rejected the name for Jabba's jester, he changed it to Salacious and added the word \"Crumb\" for the character's surname as an homage to underground comic book artist Robert Crumb.\nAccording to Michael Carter, the actor who played Jabba's majordomo Bib Fortuna, in a TheForce.net interview, during the filming of Jedi, there were several scenes which involved Jess and Salacious B. Crumb, but these scenes, according to him, were cut from the final edit of the film. However, some of these scenes appeared in the non-canonical \"Lapti Nek\": The Music Video from Jabba's Palace and in Warwick Davis' documentary Return of the Ewok.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Salacious_B._Crumb",
  "/wiki/Salacious_B._Crumb/Legends",
  "/wiki/Star_Wars_(2015)_15",
  "/wiki/Star_Wars_(2015)_34",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Special:Upload",
  "/wiki/Kowak",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Kowakian_monkey-lizard",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/C-3PO",
  "/wiki/Jester_(occupation)",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Galactic_Civil_War",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Han_Solo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Planet",
  "/wiki/Species",
  "/wiki/Hutt",
  "/wiki/Starship",
  "/wiki/Twi%27lek",
  "/wiki/Bib_Fortuna",
  "/wiki/Standard_day",
  "/wiki/Death",
  "/wiki/Standard_year",
  "/wiki/Foodstuff",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Herd",
  "/wiki/Bantha",
  "/wiki/Alderaan",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Slavery",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Droid",
  "/wiki/Sith_Lord",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Mole-flea",
  "/wiki/Lugubrious_Mote",
  "/wiki/Mark_Dodson",
  "/wiki/Tim_Rose",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/1985",
  "/wiki/From_Star_Wars_to_Jedi:_The_Making_of_a_Saga",
  "/wiki/Anthony_Daniels",
  "/wiki/Ben_Burtt",
  "/wiki/Tony_McVey",
  "/wiki/Phil_Tippett",
  "/wiki/George_Lucas",
  "/wiki/Michael_Carter",
  "/wiki/Majordomo",
  "/wiki/TheForce.net",
  "/wiki/Jess",
  "/wiki/%22Lapti_Nek%22:_The_Music_Video_from_Jabba%27s_Palace",
  "/wiki/Warwick_Davis",
  "/wiki/Return_of_the_Ewok",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/5-Minute_Star_Wars_Villain_Stories",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/The_Hoojib_Menace",
  "/wiki/Star_Wars_Adventures_Annual_2021",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_4",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Added_Muscle",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Star_Wars_(2015)_4",
  "/wiki/Age_of_Rebellion_-_Jabba_the_Hutt_1",
  "/wiki/Choose_Your_Destiny:_An_Escape_Mission",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Boba_Fett_-_The_Bounty_Hunter",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Jabba_the_Hutt_1",
  "/wiki/Star_Wars:_Tales_from_the_Rancor_Pit",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Rescue_from_Jabba%27s_Palace_(World_of_Reading)",
  "/wiki/Luke_vs._Jabba_-_Sail_Barge_Escape",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/A_Vader_Family_Sithmas",
  "/wiki/LEGO_Star_Wars_Summer_Vacation",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_ABC-3PO",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Practical",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_-_The_Official_Magazine",
  "/wiki/Star_Wars_-_The_Official_Magazine_101",
  "/wiki/Database",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/February_17",
  "/wiki/2013"
 ]
}