{
 "name": "Salle Serpa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free AlliancesGalactic Alliance Guard",
      "Galactic Alliance Guard"
     ]
    }
   ]
  }
 ],
 "content": "Salle Serpa was a major in the Galactic Alliance Guard. He was especially noted for his willingness to utilize excessive force when the situation called for extraordinary measures. His taste for brutality and apparent psychological instability caused Jaina Solo to believe that Serpa had been chosen to lead the GAG troopers to the Jedi Academy on Ossus by Darth Caedus, primarily because of the Major's lack of a moral sense of right and wrong.\nTo gain access to the academy, Serpa declared a medical emergency aboard the ship carrying a GAG battalion and requested medical aid. While Jaina tried to find out why he was at the academy, Serpa used a hidden hold out blaster in his sleeve to kill one of his own troopers in order to prove his readiness to kill anyone. When asked why he didn't just take the academy, he told Jaina that orbital bombardment was rather extreme. When Darth Caedus ordered that all of the Jedi on Ossus were to be executed in response to the Order's apparent betrayal, Major Serpa began shooting off Tionne Solusar's limbs. This action drew out the Jedi from hiding, only to be killed by GAG snipers. When Jaina and the children fought back, Serpa used a young girl as a body shield, only to have his arm cut off from behind by Zekk.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Major/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Jedi_Academy_(Ossus)",
  "/wiki/Ossus/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Battle_of_Ossus_(Second_Galactic_Civil_War)",
  "/wiki/Tionne_Solusar",
  "/wiki/Zekk",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Crucible_(novel)",
  "/wiki/Crucible_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}