{
 "name": "Salovan Fische",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Salovan Fische was a male Human pirate from Corellia who lived several centuries before the rise of the Empire. He was notable for establishing a secret base within the bowels of Resh 9376, a comet whose existence was largely unknown to galactic society. However, his crew eventually mutinied and left him stranded within the comet, where he languished for six years until he died.\nVery little is known of this man's life prior to his discovery of Resh 9376, save for the fact that he stumbled across the pertinent information in a long-forgotten survey compiled by an automated Corellian exploration vessel over 200 years earlier. The vessel's records indicated that the otherwise-unremarkable comet contained a \"cavernous anomaly in the comet's anterior quadrant, possibly the result of prior habitation.\" Intrigued, Fische and his band of pirates traveled to the comet's location in the Outer Rim and made a complete survey of the drifting planetoid, including several forays into the anterior caverns. It was just what the Corellian vagabond had been looking for—a mobile base, hidden from prying eyes in an insignificant comet that few people realized existed.\nFor the next decade, Fische and his crew used the comet as a base, lashing captured starships to the interior walls and using the primary cavern to store booty. In time, the pirates fashioned several of the smaller caverns into sealed chambers and used their ever-growing funds to make Resh 9376 into a more comfortable hideout. Fische, emboldened by his successes and filled with ambitious dreams of turning the comet into a full-fledged shadowport of his own, secured a number of mining droids and other excavating equipment in order to hollow out the rest of the comet.\nHowever, his luck eventually ran out. Following a series of failed raids against well-guarded merchant convoys--and tired of the comet's miserable living conditions, Fische's crew mutinied, leaving him marooned within Resh 9376 with nothing but a number of mining droids. He languished within for nearly six years before dying of undetermined causes, using that time to chip away at the comet's interior.\nBefore his death, several of Fische's former crew sold the comet's information to the Anjiliac kajidic, who saw potential in Resh 9376. Despite stories of Fische's lavish and decadent lifestyle, the Hutt clan would not actively seek to exploit the preconstructed base for another century. Once the Hutts moved in, they took Fische's rudimentary cave complex and turned it into a respectable shadowport, which came to be known as Point Nadir.\nIn addition to this, stories began to circulate amongst the comet's later inhabitants that Fische had hidden a treasure trove of goods and riches somewhere in one of the unexplored caverns. This legendary treasure, which eventually came to be known as Fische's Legacy, was the subject of many impromptu treasure hunts during the Anjiliacs' tenure over Resh 9376. The exact contents and origin of the treasure varied from one storyteller to another: in one instance, the Legacy consists of booty taken from captured freighters; in another, the loot was a motherlode of priceless gems and ores that Fische found during his solitude.\nThe exact era in which Salovan Fische lived has not been confirmed. However, given that much of the content provided in the Scum and Villainy sourcebook is set within or near the Imperial Period, and that the Anjiliac Hutts have controlled Point Nadir for at least one hundred years  after buying the information from his former crew, the very latest that he could have died would be sometime between 300 BBY-200 BBY.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Point_Nadir",
  "/wiki/Resh_9376/Legends",
  "/wiki/Comet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Death/Legends",
  "/wiki/Corellian_Engineering_Corporation/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Shadowport/Legends",
  "/wiki/Mining_droid",
  "/wiki/Anjiliac",
  "/wiki/Kajidic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Fische%27s_Legacy",
  "/wiki/Freighter/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Scum_and_Villainy_(sourcebook)",
  "/wiki/Imperial_Period",
  "/wiki/300_BBY/Legends",
  "/wiki/200_BBY/Legends"
 ]
}