{
 "name": "Samara_Kebyc",
 "display_name": "Samara Kebyc",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bespin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cloud City Miner's Guild"
     ]
    }
   ]
  }
 ],
 "content": "Samara Kebyc, a Human female living in Cloud City on Bespin during the Galactic Civil War, was a senior accountant for the Cloud City Miner's Guild, administering the annual dues of the miners with membership in the organization. Like Lando Calrissian, the Baron Administrator of Cloud City, Kebyc opposed corruption, acting at times against other members of the guild. She was present in Cloud City when Calrissian called for an evacuation before Imperial forces could subjugate the mining operation.\nA Human female, Samara Kebyc was a resident of the Tibanna gas mining colony Cloud City above the gas giant planet Bespin during the Galactic Civil War. There, she was a member of the Cloud City Miner's Guild, an organization under the jurisdiction of Cloud City's Baron Administrator, Lando Calrissian. The Miner's Guild was not part of the galaxy-spanning Mining Guild, the attentions of which the Cloud City mining operation was too small to attract. Kebyc served as a senior accountant for the guild, and her duties included administration of the members' annual dues.\nPrior to Calrissian's administration of Cloud City, corruption there was rife, and so he sought to reduce it wherever possible. Kebyc was also involved in such efforts, seeking to end corruption among other members of the Miner's Guild. With the aid of Bespin Wing Guard Gir Endac, Kebyc tracked down several corrupt guild officials.\nKebyc was present in a Cloud City corridor in 3 ABY, conversing with other residents, as Calrissian led Han Solo, Princess Leia Organa, and Chewbacca—representatives of the Alliance to Restore the Republic—past on the way to a meeting in which Calrissian handed the three over to the custody of the Dark Lord Darth Vader of the Galactic Empire, in an effort to prevent further Imperial intervention in Cloud City's operation. When Imperial forces nonetheless descended upon Cloud City to occupy the facility in violation of his agreement with Vader, Calrissian ordered the city's inhabitants to evacuate.\nSamara Kebyc held a high position within the Cloud City Miner's Guild; as a senior accountant for the group, she administrated funds such as the annual membership dues from the miners. Parallel to Lando Calrissian's efforts to the same effect, Kebyc fought corruption among the members of the guild. She had brown hair and light skin.\nSamara Kebyc first appeared as an unnamed and uncredited extra in the 1980 film Star Wars: Episode V The Empire Strikes Back, in which she can be seen having a discussion as Lando Calrissian, Han Solo, Princess Leia, and Chewbacca walk past. She was provided a name and a detailed character history through the November 1997 Cloud City Limited expansion set of the Decipher Star Wars Customizable Card Game. According to a Star Wars CCG fan site, Kebyc was named as an anagram of Decipher employee Becky Higgerson. The March 2014 Rogues Gallery department from Star Wars Insider 148 first identified her full name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Samara_(disambiguation)",
  "/wiki/Bespin/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cloud_City_Miner%27s_Guild",
  "/wiki/Cloud_City/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Accountant/Legends",
  "/wiki/Administrator/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Occupation_of_Bespin",
  "/wiki/Tibanna/Legends",
  "/wiki/City/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Mining_Guild/Legends",
  "/wiki/Bespin_Wing_Guard/Legends",
  "/wiki/Gir_Endac",
  "/wiki/3_ABY/Legends",
  "/wiki/Bespinite/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Chewbacca/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Hair/Legends",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/November",
  "/wiki/1997",
  "/wiki/Cloud_City_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Tuckerization",
  "/wiki/Becky_Higgerson",
  "/wiki/March",
  "/wiki/2014",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_148",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Wizards.com",
  "/wiki/Bespin:_Action_Tidings",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/August_15",
  "/wiki/2005",
  "/wiki/November_1",
  "/wiki/2022"
 ]
}