{
 "name": "Sami  (Cantrosian)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cantros 7"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cantrosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pale gold"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Minka's faction"
     ]
    }
   ]
  }
 ],
 "content": "Sami was a Cantrosian male and member of a Cantrosian faction loyal to the Rebel Alliance. In 4 ABY, he became involved in a conspiracy in his home system and fought alongside the heroes of the Rebellion against a suspected Imperial cell. Sami learned that one of his closest allies, Durne, was manipulating the situation, and that their supposed enemies were in fact loyal to the Rebellion. After the traitor was arrested, Sami and his companion Minka sought to repair relations among their people and find a common ground with them.\nA Cantrosian male, Sami was born in the capital of the Outer Rim world of Cantros 7. He was part of a Cantrosian faction loyal to the Rebel Alliance, and worked with fellow fighters Minka and intelligence coordinator Durne. Based on Durne's intelligence, Sami and the others in his faction came to believe that an opposing Cantrosian faction was loyal to the Galactic Empire and was taking orders from Emperor Palpatine himself.\nIn 4 ABY, Sami was stationed on an asteroid base in the Cantros system when Minka set out to reach the nearest Rebel base and seek aid; however, she was attacked by Y-wing pilots from the opposing faction. Her X-wing starfighter was shot down on the planet Saijo, but she was rescued by Rebel heroes Han Solo, Leia Organa, and Luke Skywalker. Minka then brought the heroes back to the asteroid base and introduced them to Sami and Durne. The Rebels informed the Cantrosians that there was no Imperial activity in the Cantros system, nor had there ever been, causing Sami to question who they were fighting. Durne insisted that the reports from his intelligence network should be trusted, but Solo suggested that the Rebels investigate the opposing faction. Sami and Minka then joined them in traveling aboard Solo's starship, the Millennium Falcon, to the base of the supposedly Imperial faction on a nearby planet.\nWhile aboard the Falcon with Minka, Sami keenly questioned Skywalker and his companions about the activities of the Rebellion, although the Rebels did not reveal their own heroic status. The Falcon was then hit by enemy fire from more Cantrosian Y-wings and was forced to land in a gully on the rival faction's planet. Observing that the sides of the fissure were too steep to climb, Sami was amazed as Skywalker used the Force to levitate Organa and Minka to safety. The local faction, led by the Cantrosian Niru, converged on the gully, and Sami was captured along with Skywalker and Solo. Sami was shocked when he discovered that their captors were Rebels and joined Solo in assertively declaring their allegiance.\nSami's shock turned to anger when Durne appeared, ordering Niru and her subordinates to kill their captives, declaring them to be Imperial sympathizers. Durne was manipulating the situation, having been hired by Nagai commander Knife to sow distrust and internecine hostility among the Cantrosians by suggesting that some were allied with the Empire. The situation became an all-out battle when Organa and Minka intervened; aware that both sides were allies, Sami told Minka to use the stun setting on her blaster as she leapt into the fray. Durne was captured and, with the tensions between the factions defused, Sami and Minka began interacting with the others in the Rebel cell, learning about each other and forming a mutual bond.\nSami was a passionate supporter of the Rebel Alliance and espoused its ideals vehemently, even expressing his willingness to die for the cause. He also showed affection for Minka, referring to her as \"darling\" and often sitting or standing close to his companion and holding her. Sami had orange eyes, pale golden fur, and curly hair of the same hue.\nSami wore a purple jumpsuit and dark brown boots.\nSami appeared in the Marvel Comics issue Star Wars 93, which was published on December 18, 1984. The comic was written by Mary Jo Duffy and illustrated by Sal Buscema.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sami",
  "/wiki/Cantros_7",
  "/wiki/Cantrosian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Minka%27s_faction",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Cantros_system",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Niru%27s_faction",
  "/wiki/Durne",
  "/wiki/Minka",
  "/wiki/Capital/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Cantrosian_asteroid_base",
  "/wiki/BTL-A4_Y-wing_starfighter",
  "/wiki/Pilot/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Saijo/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Niru%27s_base",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Niru",
  "/wiki/Death/Legends",
  "/wiki/Nagai",
  "/wiki/Commander/Legends",
  "/wiki/Ozrei_N%27takkilomandrife",
  "/wiki/Skirmish_in_the_Cantros_system",
  "/wiki/Stun/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(1977)_93",
  "/wiki/December_18",
  "/wiki/1984",
  "/wiki/Mary_Jo_Duffy",
  "/wiki/Sal_Buscema",
  "/wiki/Category:Images_of_Sami",
  "/wiki/Species/Legends",
  "/wiki/Coruscant_Nights_II:_Street_of_Shadows",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_Forgotten_War:_The_Nagai_and_the_Tofs",
  "/wiki/Standard_week/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/Marvel_Age",
  "/wiki/February",
  "/wiki/1985"
 ]
}