{
 "name": "Samnel Peers",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "204th Imperial Fighter Wing",
      "Imperial Navy's officer corps",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Samnel Peers was a human TIE fighter pilot and second lieutenant in the Galactic Empire's 204th Imperial Fighter Wing. Six months before the Battle of Endor in 4 ABY, Peers was part of a squadron of twelve TIE pilots loaned to the Imperial-class Star Destroyer Sanction to defend the Trenchenovu shipyards. Peers' squadron nearly obliterated an attacking squadron of rebel BTL-A4 Y-wing assault starfighter/bombers, with only the rebel pilot Nath Tensent fleeing with his life. Peers died sometime in the following seven months.\nDuring the Galactic Civil War, the human Samnel Peers served as a TIE fighter pilot in the Galactic Empire's 204th Imperial Fighter Wing with the rank of second lieutenant. Six months before the Battle of Endor in 4 ABY, Peers was among a squadron of twelve TIE pilots which were lent to the Imperial-class Star Destroyer Sanction by 204th Colonel Shakara Nuress to protect the Trenchenovu shipyards against an expected Rebel Alliance attack.\nDuring the rebel attack, Peers' squadron ambushed the attacking squadron of BTL-A4 Y-wing assault starfighter/bombers during its bombing run on the Trenchenovu shipyards. The Sanction cut the bombers off from their initial escape attempt, and so the rebels flew through the shipyards to the other side of them. Peers and the other TIE pilots chased the rebel bombers, whittling down their enemies' numbers until Nath Tensent, the sole rebel survivor, escaped into hyperspace.\nPeers perished within the following seven months after the battle at Trenchenovu, along with the other eleven TIE pilots who had fought at the shipyards. After those seven months, Tensent confronted Nuress at gunpoint, asking for the names of those who had massacred his squadron so that he could get revenge on them. After he learned that the twelve pilots, including Peers, were already dead, Tensent fatally shot Nuress instead when she confirmed that she had approved the Peers' squadron's deployment to Trenchenovu.\nSamnel Peers was first mentioned in the 2019 novel Alphabet Squadron, the first installment of the Star Wars: Alphabet Squadron trilogy, which was written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/4_ABY",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Second_Lieutenant",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Endor",
  "/wiki/Squadron",
  "/wiki/TIE_line",
  "/wiki/Pilot",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Sanction",
  "/wiki/Battle_at_Trenchenovu",
  "/wiki/Trenchenovu_shipyards",
  "/wiki/Nath_Tensent%27s_squadron",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Rebel_pilot",
  "/wiki/Nath_Tensent",
  "/wiki/Death",
  "/wiki/Galactic_Civil_War",
  "/wiki/Military_rank",
  "/wiki/Colonel",
  "/wiki/Shakara_Nuress",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Trenchenovu",
  "/wiki/Shipyard",
  "/wiki/Bomber",
  "/wiki/Twin_ion_engine",
  "/wiki/Hyperspace",
  "/wiki/Blaster",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Attack_on_Pandem_Nai",
  "/wiki/Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}