{
 "name": "Sanar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pydyr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pydyrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Sanar was a male Pydyrian who worked as a subordinate to the portmaster of the moon Pydyr in 44 ABY.\nA male Pydyrian, Sanar was employed at a port on the moon, Pydyr. A subordinate of Portmaster Najee, Sanar was working at the port when Luke Skywalker, the exiled Grand Master of the New Jedi Order, arrived on the moon in 44 ABY. At the time, Sanar and other port staff were under strict orders to restrict all access to the moon as an unknown, seemingly contagious plague had broken out across the populace. Despite the quarantine, Master Skywalker insisted he be allowed to move about the planet, as he was searching the mysterious entity called Abeloth and believed her to have recently landed on the world.\nSeeking Sanar's cooperation when faced with a defiant Najee, Skywalker urged the man to let him, his son Jedi Knight Ben Skywalker, and their acquaintance Vestara Khai pass through the port. Despite threats from Najee, Sanar could not bring himself to deny the famous Jedi Master and allowed them to pass undisturbed out of the port and provided the Jedi with information that aided them in finding Abeloth and ending the plague; which was in fact simply an illusion created through the White Current.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Pydyr",
  "/wiki/Pydyrian",
  "/wiki/Gender/Legends",
  "/wiki/Moon/Legends",
  "/wiki/44_ABY",
  "/wiki/Portmaster",
  "/wiki/Najee",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Planet/Legends",
  "/wiki/Abeloth",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Vestara_Khai",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/White_Current",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)"
 ]
}