{
 "name": "Sandage",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Count Sandage was a councilor to King Kayos of Aquilae, as well as a Senator. He favored signing a unequal treaty with the Galactic Empire, arguing that the Aquilaeans would be crushed if they refused.\nKayos ordered Sandage to travel to Alderaan to carry the King's reply, once it had been decided upon.\nLater, when the King and his convoy were killed en route to meet with the Aquilaean High Senate, Luke Skywalker ordered the Senator held under house arrest. Sandage then appeared and informed Skywalker that the Senate had surrendered, claiming to have Queen Breha's written directive to do so. Nonetheless, Skywalker refused to stand down but Sandage reminded him that he was committing treason and his troops would not follow him, thus forcing the Jedi to recall his remaining fighters. However, the Space Fortress destroyed Devil Squadron, outraging Skywalker, who ordered Sandage out of his war room, promising that the war has scarcely begun.\nSandage then contacted Darth Vader and the Imperial forces and gave them the secret location of the Underground Fortress. When Leia and her brothers Windy and Biggs were given to Skywalker to escort to safety on Ophuchi, Sandage attempted to intervene, intent on turning over the royal family to the Empire. He arrived with an escort of soldiers and confronted Skywalker, who claimed that he was moving the Queen's children on her order, but Sandage insisted that it was unnecessary, claiming that Empire promised their safety and drew his lazerpistol, but was cut down by Skywalker's lightsaber.\nSandage survived unchanged into the first draft, though he now was a Senator on Townowi. Wan Sandage, a podracer, was given the name, though not the persona, of Count Sandage, in The Phantom Menace.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Wan_Sandage/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Count/Legends",
  "/wiki/King/Legends",
  "/wiki/Kayos",
  "/wiki/Aquilae_(The_Star_Wars)",
  "/wiki/Senator/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alderaan_(New_Galactic_Empire)",
  "/wiki/Luke_Skywalker_(The_Star_Wars)",
  "/wiki/Breha_(The_Star_Wars)",
  "/wiki/Darth_Vader_(New_Galactic_Empire)",
  "/wiki/Underground_Fortress",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Windy_Starkiller",
  "/wiki/Biggs_Darklighter/Legends",
  "/wiki/Ophuchi",
  "/wiki/Lazerpistol",
  "/wiki/Lightsaber/Legends",
  "/wiki/Townowi",
  "/wiki/Podracer/Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/The_Star_Wars_1",
  "/wiki/The_Star_Wars_3",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/The_Star_Wars:_First_Draft",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Databank_(original)"
 ]
}