{
 "name": "Sanjay Rash",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Onderon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY Onderon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.74 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Court of Onderon",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Sanjay Rash was a human male monarch who ruled as King of Onderon during the Clone Wars. After taking the throne from his predecessor, King Ramsis Dendup, Rash gained the military support of the Confederacy of Independent Systems. However, a band of rebels opposed the Separatist occupation of their home planet and supported Dendup's claim against Rash. With the help of the Jedi Order and the Galactic Republic, Steela Gerrera's insurgents fought a successful campaign to drive the battle droid army off of Onderon. During the evacuation, Rash was executed by General Kalani on Count Dooku's orders. As a result, Dendup regained control of the royal government.\nWhen the Clone Wars began, King Ramsis Dendup was forced to either join up with the Galactic Republic or the Confederacy of Independent Systems. In the end he chose neither, so the Separatists invaded the capital of Onderon, Iziz, against the king's will. With the CIS in control, Sanjay Rash was chosen to be the successor of the old king, but not as a true king, but as a puppet of Dooku to keep an eye on the planet. With Sanjay Rash now in control, Dendup was imprisoned in the palace's garden.\nHowever, a small band of rebels started fighting against the droids and Sanjay's rule and were forced to retreat into the jungles. There, they contacted the Jedi High Council and the Republic for help. The Council sent the Jedi Obi-Wan Kenobi, Anakin Skywalker, and Ahsoka Tano as well as Clone Captain Rex to train the rebels. Once the Jedi made their way to the planet, they were led to their outpost in the jungle. With captured Separatist battle droids and munitions, the Jedi trained the rebels how to disable tanks and droidekas with grenades as well as target practice.\nMeanwhile in the city, probe droids were sent to investigate the site after the Republic ship that brought the Jedi to the planet failed to register. The droids discovered the base of the rebels and a battalion was sent to eradicate them. After a short battle the rebels were able to take down the battle droids and were ready to head inside the capital.\nOnce in the city, the rebels began small strikes against the droid patrols. The news eventually came to the ears of the false-king Rash, who ordered Dendup to call off the attacks, thinking he was the one behind them, even though he had no access to the outside. Dendup suggested that he could only stop the attacks by ending the droid occupation.\nThe same night the rebels made an attack on the city's power generator, disabling it for good. Without power, the droids were unable to recharge and would eventually be disabled one by one. With the darkness as their cover, the rebels were able to ambush battle droid patrols with ease. The rebels' actions made Rash even more distraught, and he demanded better troops from Count Dooku. The count, although displeased for the king's ability to not take care of the rebels, agreed to send more reinforcements, and also send a super tactical droid named Kalani to succeed where the king had failed.\nAs the Onderon rebels continued their strikes against the droids in the city, Rash prepared to act against them. Back in the palace, General Akenathen Tandin identified Steela and Saw Gerrera as well as Lux Bonteri as the key members of the rebels. General Tandin suggested that the Royal Onderon Militia be allowed to handle the rebels, but Kalani refused, suspecting that the militia could have rebel sympathizers among them. Rash was getting more and more frustrated, and called Dendup again to his throne and ordered his predecessor to stop the attacks. Once again, Dendup denied that he had no part in the rebels' doings and said it was the will of the people that justified their actions. The King was done with the terrorist's acts and ordered Dendup's execution the next day, hoping it would break the rebels' moral and stop the attacks.\nThat night, Saw Gerrera tried to free the former king, but was captured and now taken part of the execution. However, before the executions began, the rebels attempted to rescue Dendup, knocking out King Rash in the process, but failed as droid reinforcements arrived. Because of this, they all joined the execution, but before they could proceed any further, General Tandin betrayed the Separatist King and joined the rebels, along with the royal guard. With Tandin holding Rash as hostage while the others escaped, Ahsoka Tano jumped out of the crowd and knocked the droids down and escaped to the rebels' secret hideout. Rash's droids attempted to pursue them, but were stopped as the crowd stopped them, now sided with the rebels.\nNow that the king was free and General Tandin had joined the fight, the rebels prepared the final part of the battle. They set up a base in the mountains located to the east from Iziz. Rash and Kalani sent a massive army along with new HMP droid gunships to eradicate the rebels. At first the new gunships seemed indestructible, but Anakin Skywalker managed to buy an effective few rocket launchers from Hondo Ohnaka per Ahsoka Tano's request. The rebels were able to destroy the gunships and win the battle, but at the cost of losing Steela Gerrera.\nBack at Iziz, King Rash was desperate and demanded more troops from Count Dooku, but he wasn't interested in a prolonged war and ordered Kalani to retreat the remaining army to Agamar. Count Dooku signaled to Kalani to kill Rash, who stood up as he protested to the Count's orders but before he could finish, he was shot dead by Kalani. As Kalani and the droid army retreated from the planet, the rule was brought back to Dendup, ending the Separatist occupation.\nSanjay Rash first appeared in \"A War on Two Fronts,\" the second episode of the fifth season of Star Wars: The Clone Wars. He was voiced by Kirk Thornton.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sanjay_Rash",
  "/wiki/Sanjay_Rash/Legends",
  "/wiki/Special:Upload",
  "/wiki/Onderon",
  "/wiki/20_BBY",
  "/wiki/Human",
  "/wiki/Onderonian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Royal_Court_of_Onderon",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Monarchy",
  "/wiki/King",
  "/wiki/Clone_Wars",
  "/wiki/Throne",
  "/wiki/Ramsis_Dendup",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Onderon_rebels",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Steela_Gerrera",
  "/wiki/Onderonian_Civil_War",
  "/wiki/Battle_droid",
  "/wiki/Army",
  "/wiki/Death",
  "/wiki/General",
  "/wiki/Kalani",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Invasion_of_Onderon",
  "/wiki/Capital",
  "/wiki/Iziz",
  "/wiki/Prison",
  "/wiki/Droid",
  "/wiki/Jungle",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ahsoka_Tano",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/Droideka",
  "/wiki/Grenade",
  "/wiki/City",
  "/wiki/Probe_droid",
  "/wiki/Starship",
  "/wiki/Battalion",
  "/wiki/Troop",
  "/wiki/ST-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Akenathen_Tandin",
  "/wiki/Saw_Gerrera",
  "/wiki/Lux_Bonteri",
  "/wiki/Royal_Onderon_Militia",
  "/wiki/Terrorist",
  "/wiki/Standard_day",
  "/wiki/Mountain",
  "/wiki/HMP_droid_gunship",
  "/wiki/Gunship",
  "/wiki/RPS-6_rocket_launcher",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Agamar",
  "/wiki/A_War_on_Two_Fronts",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Kirk_Thornton",
  "/wiki/Front_Runners",
  "/wiki/The_Soft_War",
  "/wiki/Tipping_Points",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_57",
  "/wiki/Droid_Directory",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Battle_Droids_and_Other_War_Droids",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/22_BBY",
  "/wiki/19_BBY",
  "/wiki/The_Gathering",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/StarWars.com"
 ]
}