{
 "name": "Sankaran",
 "display_name": "Sankaran",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Captain Sankaran was an officer in the Imperial military, a lean man whose close-cropped hair had gone gray, but who retained a dark moustache that hung down on either side of his mouth to the line of his jaw.\nEight months after the Battle of Yavin, he was serving aboard the Star Destroyer Reprisal, holding an important position under Commander Demmings.\nDuring this time, Sankaran appeared baffled by a series of failures in Reprisal's gunnery when the ship was serving under Lord Darth Vader's direct command, but this was later revealed to be due to the treachery of Lieutenant Garil Dox, and he may, like Vader and Demmings, have been aware of his subordinate's treachery all along.\nSankaran held the rank of captain, but it is not clear whether this was a relatively senior line command rank in the Imperial Navy, in which case he is likely to have been Demmings' executive officer, or or the lower rank of the same name used by elements of the military like the Imperial Army and Stormtrooper Corps.\nThe plot of A Model Officer hinges on the treachery of Garil Dox, an Alderaanian serving with Reprisal's gunnery division. Sankaran is evidently his superior, his role in this story being mainly to interface between the crew pit and Commander Demmings, who is serving as the Star Destroyer's captain. However, Demmings almost undoubtedly holds a rank above Captain of the Line, and it is not unknown for senior personnel to base themselves in the crew pits as Sankaran does here; so in the absence of categorical evidence, it is impossible to say for sure exactly what rank and role he held.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Demmings",
  "/wiki/Captain/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Reprisal_(Imperial_II-class)",
  "/wiki/Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Garil_Dox",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Empire_35",
  "/wiki/Alderaan/Legends",
  "/wiki/Captain_of_the_Line/Legends"
 ]
}