{
 "name": "Sannus_Lorrick",
 "display_name": "Sannus Lorrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tion Hegemony"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3639 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human",
      "Rakghoul"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tion Hegemony"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Sannus Lorrick was a Human male Tionese scientist at the time of the Galactic War between the Galactic Republic and the reconstituted Sith Empire.\nA Human male native of the Tion Hegemony who held the position of Royal Science Advisor in the decades before the Cold War, Lorrick carried out illegal experiments in viral modification and gene splicing for almost a decade before being discovered. The fifteen specimens that were still alive in his labs were so altered that it could not be proven that they had been members of any sentient species, so he was largely acquitted and exiled from the Hegemony instead of being imprisoned. Lorrick vowed revenge and eventually began experimenting on the rakghoul virus in his laboratory on Ord Mantell. With his assistants Doctors Asirr, Evad, Addy Ingrol, and Tarkom—who all believed that he was searching for a cure—Lorrick manipulated the virus and increased its capacity to cross the species barrier.\nFinally, around 3639 BBY, Lorrick hired a series of pilots to carry infected creatures to the planets of the Hegemony, and his gift of an infected risp to the smuggler Zama Brak led to the destruction of the Stardream and an outbreak on Tatooine. As four Tionese planets fell to the rakghoul virus, the pilot Melarra unknowingly aided Lorrick by spreading the plague to Kaon. Ingrol and the other assistants discovered Lorrick's true plans and attempted to stop him, but they were infected with the virus and placed under his control. Lorrick battled a strike team sent to eliminate him after his role in the Tion outbreak was discovered, and even the doctor's self-infection with the virus was not enough to prevent his death at their hands.\nDoctor Lorrick was introduced in the 2011 Star Wars MMORPG Star Wars: The Old Republic as part of the game update 1.2 \"Legacy\" being a part of the \"Rise of the Rakghouls\" Story arc, as well as the 2012 World event, the Rakghoul pandemic. Both Republic and Imperial players can confront and defeat him in the Flashpoint \"Lost Island\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tion_Hegemony/Legends",
  "/wiki/3639_BBY",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Rakghoul",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tionese_(people)",
  "/wiki/Scientist/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sentience/Legends",
  "/wiki/Species/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Asirr",
  "/wiki/Evad",
  "/wiki/Addy_Ingrol",
  "/wiki/Tarkom",
  "/wiki/Rakghoul_serum",
  "/wiki/Planet/Legends",
  "/wiki/Risp",
  "/wiki/Smuggler/Legends",
  "/wiki/Zama_Brak",
  "/wiki/Stardream",
  "/wiki/Rakghoul_pandemic",
  "/wiki/Tatooine/Legends",
  "/wiki/Melarra",
  "/wiki/Tion_Hegemony_rakghoul_outbreak",
  "/wiki/Kaon",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/2012",
  "/wiki/Galactic_Standard_Calendar"
 ]
}