{
 "name": "Sano_Sauro",
 "display_name": "Sano Sauro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Eeropha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGalactic Senate",
      "Galactic Senate",
      "Galactic EmpireImperial Senate",
      "Imperial Senate"
     ]
    }
   ]
  }
 ],
 "content": "Sano Sauro was a male Human prosecutor for the Galactic Senate and later the senator of Eeropha for a number of decades near the end of the Galactic Republic. He had a number of political confrontations with the Jedi, particularly Obi-Wan Kenobi.\nIn 44 BBY, Sauro served as the prosecutor for Vox Chun, the father of Jedi hopeful, Bruck Chun. Bruck, who had aided the Dark Jedi Xanatos in infiltrating the Jedi Temple, was accidentally killed by Obi-Wan Kenobi in the Jedi Temple. He interrogated Obi-Wan, who was accused of killing Bruck intentionally, and fellow Jedi Bant Eerin, who was almost drowned intentionally by Bruck. Sauro tried to find them guilty, exaggerating and twisting the truth. However, the Jedi were proven innocent despite his attempts.\nOver the next few decades, Sauro became Senator of Eeropha. During this time, he discovered a young Granta Omega and sponsored him so that he could attend the All Science Research Academy on Yerphonia.\nA few years before the outbreak of the Clone Wars, Obi-Wan Kenobi discovered that Senator Sauro had ties to Omega; ties that Sauro denied and made sure that Kenobi could not prove. He, in fact, was the head of a committee that in 26 BBY sponsored a scientific expedition to Haariden, which was part of a secret plot with Omega to obtain titanite.\nIn 24 BBY, Sauro helped his friend Omega again , this time politically. He and newly elected Senator Bog Divinian began to make anti-Jedi accusations in order to dissolve the Galactic Senate's support of the Jedi Order. A vote was to be held in the Senate over whether or not the Jedi should be involved in Senate activities. This was all part of Omega and Sauro's master scheme. By leaking Jenna Zan Arbor's drug called the Zone of Self-Containment into the ventilation shafts of the Senate, as well as assassinating Supreme Chancellor Palpatine, Sauro's supporters could easily garner him a seat as the new Supreme Chancellor of the Galactic Republic. This would also give Omega unlimited power in destroying the Jedi.\nHowever, thanks to the actions of Obi-Wan Kenobi, Anakin Skywalker, Siri Tachi, and Ferus Olin, this plot was thwarted. When the actual Senate vote came, Sauro turned his back on Bog Divinian, and sided with those who were against banning funding to the Jedi Order. His reasons for doing this were because he was offered the position of Deputy Chancellor by Palpatine himself, which quickly accepted high office, however, tempted Sauro with even more power. Palpatine's true motives for creating the new position were, of course, based on political expediency, in order to transform a rabid political enemy into a quick 'friend'—but more to the point, to maintain a close eye on Sauro's actions, by having now reined him in.\nIn his office, Senator Sano Sauro kept a broken lightsaber sold to him by a Duros and which was rumored to have belonged to Jedi Master Mace Windu. Sauro prized the claing-bush thorns as emblems not only of his planet Eeropha, but also of his protégé, Granta Omega, a native of the planet's moon. Four of the tall red thorns rose from the corners of Sauro's long but low Senate office desk, \"stabbing the air.\" And, upon Palpatine's appointment of Sauro to the position of Deputy Chancellor , in a temporary garden in the exterior courtyard outside the Galactic Senate complex, twin horns of the bloodred bush could be seen towering above the exotic flowers there.\nUnder the emerging Empire, Sauro was already ingratiated into Palpatine's inner circle. Sauro hand-picked Imperial advisors and sent them to strategic planets in the Core Worlds. By 18 BBY, Sauro owned a ship called the True Justice which held speedy trials to quickly put people accused of political crimes in prison. Two of these prisoners were Roan Lands and Dona Telamark. During their trial, however, the two were rescued by the Jedi Solace, the Bothan Oryon, and Trever Flume, all friends of Ferus Olin.\nPalpatine was aware of Sauro's plans to use Force-sensitive children to train pilots in hope of creating an invincible fleet. He allowed him to keep his plan—for the time being. But when Sano tried to prevent Ferus' friends from escaping, the Emperor was asking to see him. Sauro soon found himself in a job as the headmaster of the Imperial Naval Academy, which he considered a demotion from his previous position as Senator. He was ordered by Darth Vader to find a cadet with undivided loyalty to the Empire on a need-to-know basis project. He decided to send Lune Oddo Divinian, the Force-sensitive son of his former protege Bog Divinian. He did this to take revenge on Bog, who had risen above him in the Imperial hierarchy by becoming governor of the Leemurtoo system.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Eeropha",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/44_BBY/Legends",
  "/wiki/Vox_Chun",
  "/wiki/Bruck_Chun",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Xanatos",
  "/wiki/Jedi_Temple",
  "/wiki/Obi-Wan_Kenobi%27s_Senate_hearing",
  "/wiki/Bant_Eerin/Legends",
  "/wiki/Granta_Omega",
  "/wiki/All_Science_Research_Academy",
  "/wiki/Yerphonia",
  "/wiki/Clone_Wars/Legends",
  "/wiki/26_BBY/Legends",
  "/wiki/Mission_to_Haariden",
  "/wiki/Haariden",
  "/wiki/Titanite",
  "/wiki/24_BBY/Legends",
  "/wiki/Bog_Divinian",
  "/wiki/Anti-Jedi_sentiment/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jenna_Zan_Arbor",
  "/wiki/Zone_of_Self-Containment",
  "/wiki/Senate_utility_tunnels",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Siri_Tachi/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Attack_on_the_Senate_Building",
  "/wiki/Deputy_Chancellor",
  "/wiki/Lightsaber/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Claing_bush",
  "/wiki/Nierport_VII",
  "/wiki/Imperial_advisors",
  "/wiki/Core_Worlds/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/True_Justice",
  "/wiki/Roan_Lands",
  "/wiki/Dona_Telamark",
  "/wiki/Fy-Tor-Ana",
  "/wiki/Bothan/Legends",
  "/wiki/Oryon",
  "/wiki/Trever_Flume",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Imperial_Naval_Academy_(Coruscant)",
  "/wiki/Darth/Legends",
  "/wiki/Cadet/Legends",
  "/wiki/Lune_Oddo_Divinian",
  "/wiki/Leemurtoo_system",
  "/wiki/Jedi_Apprentice_Special_Edition:_Deceptions",
  "/wiki/Jedi_Quest:_The_Master_of_Disguise",
  "/wiki/Jedi_Quest:_The_School_of_Fear",
  "/wiki/Jedi_Quest:_The_Shadow_Trap",
  "/wiki/Jedi_Quest:_The_Changing_of_the_Guard",
  "/wiki/Jedi_Quest:_The_False_Peace",
  "/wiki/The_Last_of_the_Jedi:_A_Tangled_Web",
  "/wiki/The_Last_of_the_Jedi:_Return_of_the_Dark_Side",
  "/wiki/The_Last_of_the_Jedi:_Secret_Weapon",
  "/wiki/The_Last_of_the_Jedi:_Against_the_Empire",
  "/wiki/The_Last_of_the_Jedi:_Master_of_Deception",
  "/wiki/The_Last_of_the_Jedi:_Reckoning",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}