{
 "name": "Santiago",
 "display_name": "Santiago",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "black eyebrows"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Santiago was a Human male soldier who was alive during the reign of the New Republic, active during the years of 5 and 10 ABY. Santiago had light-colored skin, brown hair, brown eyes, and black eyebrows. He also had a large vertical scar going down his right eye. He wore light-colored clothing with a large blue patch in the center of his shirt. As a soldier, Santiago wielded weapons such as an E-11 blaster rifle, thermal detonators, a rail detonator, and an Imperial repeater rifle.\nSantiago first appeared in the 1997 computer game Star Wars: Jedi Knight: Dark Forces II as a character who only appeared in the game's multiplayer addition as a playable character model. He appeared again in Jedi Knight's expansion pack, Star Wars: Jedi Knight: Mysteries of the Sith. Mysteries of the Sith introduced \"multiplayer personalities,\" a form of character creation that put different character models under different professions, with each one having its own set of starting weapons for a match. In the game, Santiago was categorized as a soldier. He also shared the same head model and texture with the multiplayer character Admiral, and his body texture was a slightly modified version of Rugar's.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Time/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Shirt",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Rail_detonator",
  "/wiki/Imperial_repeater_rifle",
  "/wiki/1997",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/Admiral_(soldier)",
  "/wiki/Rugar",
  "/wiki/The_New_Essential_Chronology"
 ]
}