{
 "name": "Sanya_Tagge",
 "display_name": "Sanya Tagge",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tepasi"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Tepasi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Tagge",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Sanya Tagge was a Human female member of the House of Tagge, and served as baroness from during the Separatist Crisis and the Clone Wars. She was the mother of Silas, Cassio, Ulric, Domina and Orman. It was Orman who succeeded her as House ruler.\nIn 22 BBY, Sanya was quick to announce her family's devotion to the Galactic Republic, becoming one of the few major business conglomerates not to join the Confederacy of Independent Systems. She was replaced by Orman Tagge after her death near the end of the Clone Wars.\nWhen more and more systems were leaving the Galactic Republic shortly before the outbreak of the Clone Wars in 22 BBY, Sanya reassured the people of her homeworld Tepasi that her family would continue to be loyal to the Republic. She pointed out that House Tagge was aware of the heritage of its ancestral ancestor, one of the original founders of the Republic, and continued to support her family's attachment to the Republic, her belief in the Supreme Chancellor, and her willingness to continue serving her faith in the Republic.\nThe Baroness, while expressing her loyalty to the Republic unequivocally, withheld promises of concrete assistance to the government. At that time, House Tagge had a fleet of over five thousand armed ships and a private army of over one million soldiers. Nonetheless, Sanya's manifestation of loyalty to a corporation like that of her family was unusual, as most large corporations remained neutral during the crisis. In 20 BBY, the title of House Tagge, with all the privileges, duties, and duties associated with it, fell to Sanya's then seventeen-year-old son Orman. The new Baron Tagge continued the republic-friendly policy of his mother.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Sanya_Tagge",
  "/wiki/Tepasi/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_of_Tagge/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Silas_Tagge/Legends",
  "/wiki/Cassio_Tagge/Legends",
  "/wiki/Ulric_Tagge/Legends",
  "/wiki/Domina_Tagge/Legends",
  "/wiki/Orman_Tagge/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Republic",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_49",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/Star_Wars_Insider",
  "/wiki/Republic_HoloNet_News_Core_Edition_15:2:22",
  "/wiki/Star_Wars_Insider_74"
 ]
}