{
 "name": "Saphrro",
 "display_name": "Saphrro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mantellian Separatist Movement"
     ]
    }
   ]
  }
 ],
 "content": "Saphrro was a Human male who lived during the Cold War between the Galactic Republic and the Sith Empire. By 3643 BBY, he was a part of the Mantellian Separatist Movement during the Separatist War, a conflict in which the group attempted to overthrow the Republic-backed government of the planet Ord Mantell. That year, Saphrro fought against Republic forces as the commander of one of the cells on the island of Avilatan. During his time as a commander, he held a meeting to organize personnel transfers with two other Separatist cell commanders named Bol and Vyru at the Separatist base on Mannett Point, a small island off the coast of Avilatan. While the meeting was taking place, a newly recruited sergeant of the Republic Special Forces unit known as Havoc Squad infiltrated the base, killed Saphrro and his fellow commanders, and took the information in their possession pertaining to their forces.\nA Human male, Saphrro lived during the Cold War, a period of unrest between the Galactic Republic and the Sith Empire. At the same time as the more widespread conflict, Saphrro was a member of a Separatist Movement bent on overthrowing the Republic-backed government on the planet Ord Mantell in a struggle that became known as the Separatist War. He eventually attained the rank of commander and was in charge of one of the Separatist cells fighting against the Republic's armed forces by the year 3643 BBY on Avilatan, an island on Ord Mantell. That year, Saphrro went to meet with two other Separatist cell commanders at a Separatist base on Mannett Point, a small island off the coast of Avilatan. There, he and the other commanders, whose names were Bol and Vyru, discussed how to coordinate their operations and the transfer of troops between the various cells on the island. By that time, Saphrro had a reputation with the Separatists and was viewed by an officer named Dalern as one of the group's greatest heroes. Due to his and the other commanders' importance, the number of guards at the base was increased, and a force field generator was installed to protect the meeting area.\nWhile Saphrro and the other commanders met at the base, two members of the Republic Special Forces unit Havoc Squad—Captain Zora and a newly recruited sergeant—infiltrated the heavily defended base in search of a ZR-57 orbital strike bomb that the Separatists had recently stolen. Upon disabling the force field and finding that the bomb was not being stored in the facility, the two soldiers interrogated Dalern and learned that Saphrro and the other Separatist cell commanders were the reason for the increased security. Lieutenant Aric Jorgan of Ord Mantell Infantry Command ordered the sergeant to obtain the commanders' data on Separatist troop strength and cell locations as well as to eliminate them all as priority-one targets. Bol and Vyru noticed the sergeant's approach, and Bol ordered Saphrro to wipe all of their data from their computer. Saphrro protested that they were only up against one trooper and prompted the other two commanders to fight back against the sergeant. However, Saphrro and the other two commanders were killed, and the sergeant was able to obtain their data since Saphrro had not deleted it.\nSaphrro was a heavily built individual with tan-colored skin and brown eyes. At the time of his death, he wore his brown hair in two stripes running from the top of his forehead to the back of his head, with a pair of thinner stripes running from front to back on each side of his head. As a cell commander, Saphrro had a large amount of knowledge of the Separatist cell's troop strengths and location on the island of Avilatan. Viewed by Officer Dalern as a great hero of the Separatist cause, Saphrro was also important enough to be involved in coordinating personnel transfers and operations with other cell commanders. He had enough experience with computers for Bol to order him to delete the data when confronted by the Republic sergeant. He was also proficient enough with a blaster pistol to use it in combat against the sergeant.\nDuring his time as a Separatist cell commander, Saphrro wore red-and-gray-colored armor and utilized a personal energy shield that emitted a spherical blue-colored energy field when in use. He also carried a blaster pistol.\nSaphrro first appears in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare. He is featured in \"Mannett Point,\" an early quest available on the planet Ord Mantell for players of the Trooper class. At the conclusion of the quest, the player is required to kill Saphrro, along with Bol and Vyru, the other two Separatist cell commanders with him at Mannett Point. After eliminating the commanders, the player must recover their data on the Separatist cells and forces for the island of Avilatan. Saphrro's line of dialogue telling his fellow commanders to kill the player differs depending on whether the player character is male or female.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3643_BBY",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Separatist_War",
  "/wiki/Ord_Mantell_Central_Authority",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Republic_Army",
  "/wiki/Commander/Legends",
  "/wiki/Avilatan",
  "/wiki/Time/Legends",
  "/wiki/Bol_(Separatist)",
  "/wiki/Vyru",
  "/wiki/Separatist_Base",
  "/wiki/Mannett_Point",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Squad/Legends",
  "/wiki/Havoc_Squad",
  "/wiki/Mission_to_Mannett_Point_(Havoc_Squad)",
  "/wiki/Death/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Dalern",
  "/wiki/Force-field_generator",
  "/wiki/Captain/Legends",
  "/wiki/Zora",
  "/wiki/ZR-57_orbital_strike_bomb",
  "/wiki/Force_field/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Aric_Jorgan",
  "/wiki/Ord_Mantell_Infantry_Command",
  "/wiki/Troop/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Double_stripe",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Personal_energy_shield/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Voidhound"
 ]
}