{
 "name": "Saquesh",
 "display_name": "Saquesh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Exchange"
     ]
    }
   ]
  }
 ],
 "content": "Saquesh was a male Quarren who oversaw the Exchange's presence in the Refugee Sector on Nar Shaddaa as of 3951 BBY, during the First Jedi Purge.\nWhile he served as one of Exchange leader Goto's underbosses, Saquesh became a part of his immediate superior Visquis' ambitious plan to lure a Jedi to him. On Visquis' orders, the Quarren deliberately mistreated the refugees, cutting the living spaces allotted to them by half, on top of that claimed by the Serroco gang. Included among his retinue of enforcers and bodyguards were over a dozen Gamorreans, as well as a number of Weequay and Trandoshan thugs.\nSaquesh attempted to use the refugees as slaves, kidnapping a child named Adana in order to sell her to the Hutts. Concerned for the well-being of the refugees, Meetra Surik convinced Saquesh to release Adana.\nThe Quarren made no effort to hide his disdain for humans, but he despised them- mainly the refugees- for being weak, not simply for being human.\nIn the non-canon dark side storyline, Meetra Surik may side with him and assist his operations in the Refugee Sector.\nAnother option allows Surik to intimidate Saquesh by either demanding that the Quarren ease his grip on the refugees or Surik will be forced to kill him. This gives the player light side points, however this causes Saquesh and his thugs to attack.\nSurik may also have killed him if she was caught stealing their supplies or failed to intimidate him into freeing Adana.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/3951_BBY",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Exchange",
  "/wiki/Refugee_Sector",
  "/wiki/First_Jedi_Purge",
  "/wiki/Visquis",
  "/wiki/Serroco_(gang)",
  "/wiki/Gamorrean/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Adana_(Human)",
  "/wiki/Hutt/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Saquesh",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}