{
 "name": "Sar_Labooda",
 "display_name": "Sar Labooda",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chalacta"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi assault team",
      "Jedi assault team"
     ]
    }
   ]
  }
 ],
 "content": "Sar Labooda was a human female from the planet Chalacta who was orphaned by space pirates. She and her sister Depa Billaba were then rescued by the Jedi Mace Windu and joined the Jedi Order on the planet Coruscant. In 22 BBY, Labooda was part of the Jedi assault team led by Windu to the planet Geonosis in an effort to rescue Jedi Knight Obi-Wan Kenobi from the Confederacy of Independent Systems. Labooda infiltrated the Petranaki Arena where Kenobi was being held and confronted the Separatist forces alongside the other Jedi, but was killed during the fighting.\nSar Labooda was a Chalactan human female from the planet Chalacta. She and her sister, Depa Billaba, were orphaned by space pirates when Billaba was just a girl, but the pair were rescued from their homeworld by the Jedi Mace Windu. Windu took the sisters to the planet Coruscant, where they both found a home at the Jedi Temple and became members of the Jedi Order, the guardians of the Galactic Republic. Billaba became Windu's Padawan and by 32 BBY, had achieved the rank of Jedi Master and earned a seat on the Jedi High Council.\nDuring the Separatist Crisis in 22 BBY, Labooda was part of a 212 Jedi assault team led by Windu to the planet Geonosis in order to rescue Jedi Knight Obi-Wan Kenobi. Kenobi had been captured while spying on the leaders of the newly formed Confederacy of Independent Systems and was sentenced to be executed alongside his Padawan Anakin Skywalker and Senator Padmé Amidala in the Geonosian Petranaki Arena.\nAfter Kenobi, Skywalker, and Amidala fended off a trio of arena beasts, Separatist battle droids were deployed to the arena to execute them. However, before the droids could kill the trio, Windu and the other Jedi revealed their presence, having infiltrated the stands of the the arena. As fighting broke out between the droids and the Jedi on the arena floor, Labooda lept from a doorway and fought back to back with another Jedi on a walkway in the stands, cutting down 3464 and another B1-series battle droid that had begun firing on her. Although the Republic were ultimately victorious on Geonosis, Labooda perished during the fighting.\nSar Labooda was a Force-sensitive human with brown hair, brown eyes, and light skin.\nLabooda wore dark brown Jedi robes with a brown belt and brown boots. She wielded a lightsaber with a green blade.\nAccording to the fan website Aveleyman, Sar Labooda was portrayed by Emma Howard in the prequel trilogy film Star Wars: Episode II Attack of the Clones which was released on May 16, 2002. The Jedi battle in the Petranaki Arena scenes were filmed on Stage 3 at Fox Studios, Sydney, between August 10 and August 15, 2000.\nWhen casting the humanoid Jedi fighters for the arena scene, director George Lucas wanted to maintain visual continuity with Jedi characters scene in the 1999 film Star Wars: Episode I The Phantom Menace. As such, Howard's costume included a Mark of Illumination and the same haircut that Depa Billaba had sported in Episode I; however, as it was clear on screen that the actors cast in Australia were not the same as those in cast in England for the previous film—Dipika O'Neill Joti in the case of Billaba—it was decided that the Episode II Jedi would become new characters instead, leading to the creation of Sar Labooda.\nIn the current Star Wars canon, Labooda's name was first used in the 2015 reference book Ultimate Star Wars. In the Star Wars Legends continuity, Labooda was mentioned prior to the release of Attack of the Clones in HoloNet News Vol. 531 #55, an May 10, 2002 issue published on the HoloNet News website as part of the marketing for the film. The article was written by Pablo Hidalgo and Paul Ens.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sar_Labooda",
  "/wiki/Sar_Labooda/Legends",
  "/wiki/Chalacta",
  "/wiki/22_BBY",
  "/wiki/Geonosis",
  "/wiki/Human",
  "/wiki/Chalactan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_assault_team",
  "/wiki/File:Windu-What_Jedi.ogg",
  "/wiki/Planet",
  "/wiki/Pirate",
  "/wiki/Depa_Billaba",
  "/wiki/Jedi",
  "/wiki/Mace_Windu",
  "/wiki/Coruscant",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Petranaki_Arena",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Death",
  "/wiki/Homeworld",
  "/wiki/Imperial_Palace",
  "/wiki/Galactic_Republic",
  "/wiki/Padawan",
  "/wiki/32_BBY",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_High_Council",
  "/wiki/Battle_droid",
  "/wiki/Separatist_Crisis",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Geonosian",
  "/wiki/Droid",
  "/wiki/3464",
  "/wiki/B1-series_battle_droid",
  "/wiki/Force-sensitive",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Jedi_robes",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Lightsaber",
  "/wiki/Emma_Howard",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/May_16",
  "/wiki/2002",
  "/wiki/Fox_Studios,_Sydney",
  "/wiki/August_10",
  "/wiki/August_15",
  "/wiki/2000",
  "/wiki/George_Lucas",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Mark_of_Illumination",
  "/wiki/Dipika_O%27Neill_Joti",
  "/wiki/Star_Wars",
  "/wiki/2015",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Legends",
  "/wiki/HoloNet_News_Vol._531_55",
  "/wiki/May_10",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Paul_Ens",
  "/wiki/Category:Images_of_Sar_Labooda",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Secret_Jedi:_The_Adventures_of_Kanan_Jarrus:_Rebel_Leader",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/November_5",
  "/wiki/2018",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/The_Star_Wars_Archives:_Episodes_I%E2%80%93III,_1999%E2%80%932005",
  "/wiki/Star_Wars_Insider",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Jedi_Council_Forums",
  "/wiki/June_11",
  "/wiki/2022",
  "/wiki/October_31",
  "/wiki/2006"
 ]
}