{
 "name": "Sarenda",
 "display_name": "Sarenda",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taanab"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Sarenda was a Force-sensitive Human female from Taanab who traveled to Spintir in order to find out more about her Force-sensitive nature.\nSarenda grew up part of a large family with several sisters on a small farm on Taanab. She was very protective of her sisters, and anyone who suffered at the hand of others. While she had a close relationship with all of her sisters, Sarenda always wanted more space to herself. She found some solace working with her father and aunt in the farm's garage. There, she learned the skills of a mechanic while repairing farm equipment and seemed to have a natural affinity for fixing things.\nSarenda found her greatest pleasure in exploring the wilderness that surrounded her family's farm. She would regularly explore dark caves and forested areas, often scaring the local grunn dogs. During one such trip, she discovered an hand-carved cave close to the family farm. The cavern was filled with large statues and intricately carved walls as well as the skeleton of a long-deceased alien in whose hand she discovered an ancient unknown device. After tinkering with the cylinder in her family's machine shop, she was able to activate the energy blade. Sparked with curiosity, she sought out her father and aunt for answers. They told her that she had found a lightsaber and that her ability to activate it meant she was sensitive to the Force. Sarenda's aunt advised her it was time for her to leave Taanab and directed her to seek out an old friend and scholar named Hethan Romund who could tell her more about her heritage.\nBefore Sarenda could reach her, however, Romund was captured by the darksider Malefax and taken to Spintir. Sarenda joined forces with Belandi Feearr, Pon Edestus and Dao Jodh, other Force-sensitives who also sought to learn about the Force from Romund. Together, they set out in 0 ABY to rescue her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taanab/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Spintir/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Cave/Legends",
  "/wiki/Forest/Legends",
  "/wiki/Skeleton/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Hethan_Romund",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Darksider",
  "/wiki/Malefax",
  "/wiki/Belandi_Feearr",
  "/wiki/Pon_Edestus",
  "/wiki/Dao_Jodh",
  "/wiki/0_ABY/Legends",
  "/wiki/Rescue_of_Hethan_Romund",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Mountaintop_Rescue",
  "/wiki/Star_Wars:_Force_and_Destiny_Beginner_Game",
  "/wiki/Lure_of_the_Lost",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Meditation_and_Mastery"
 ]
}