{
 "name": "Saren_Llalik",
 "display_name": "Saren Llalik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Plavin 6"
     ]
    },
    {
     "name": "Born",
     "values": [
      "30 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Task Force on Alliance Security",
      "Alliance Intelligence",
      "Task Force on Alliance Security",
      "Alliance Intelligence",
      "BioTech Industries"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Saren Llalik was a Human female cyborg technology researcher from Plavin 6. As an authority in cyborg technology, Llalik was responsible for several quality products such as the Borg Construct Aj^6. As a secret agent of the Rebel Alliance, she also developed an espionage system to provide the Alliance with sensitive and top-secret information about new technologies developed in the company she worked for, BioTech Industries. Llalik's work saved the lives of many Rebel soldiers, and Alliance General Airen Cracken considered himself to be in debt to Llalik.\nLlalik was also the younger sister of Doctor Nashiak Llalik, a developer of armor technology who, unlike his sister, chose to work for the Galactic Empire. In 2 ABY, Llalik wrote reports for Alliance Intelligence on her brother and another engineer and potential threat to Rebel activities, Doctor Cinto Alaras.\nBorn on the humid planet Plavin 6, Saren Llalik was the third child and only daughter of Doctors Nash and Loran Llalik. Her elder brother and middle child of the family, Nashiak Llalik, interested in armors from a young age, entertained Saren during their childhood by telling her tales about the Death Watch and the Sun Guard, and their respective armors. Saren and her oldest brother joined the Rebel Alliance around the same time that Nashiak joined COMPNOR, an umbrella organization of the Galactic Empire. Saren, however, hid her affiliation so she could work as a secret agent. Both Saren and Nashiak became gurus in their respective fields of expertise: Saren as a cyborg technology expert, and Nashiak as an armor technology expert.\nBy 1 ABY, Llalik had become the Director of Prosthetic Design for BioTech Industries, a corporation dealing in medical and cyborg technologies. As a cybernetic specialist working in different experimental designs, she was reputable for the high quality design projects she directed and managed, including the cybernetic implant Borg Construct Aj^6 unit. Llalik worked from a laboratory in a restricted area of BioTech's headquarters in the Corellian system, and she also developed a system to provide top-secret information to the Rebel command, including military designs for the Empire, using an unwitting 2-1B surgical droid at her lab. Llalik had included an espionage module in the droid, using it to store files about new cybernetic designs. Medical technician Kena Shont, also a Rebel agent, later downloaded the files onto her personal datapad and gave the information to the Rebel command. As BioTech maintenance could not detect the sabotage unless they performed an analysis that only the Director of Prosthetic Design—Llalik herself—could request, her work remained undiscovered. Through her work for the Alliance, mostly by providing the Alliance with secret information and useful new technological designs, Llalik saved many lives and earned the respect of Alliance General Airen Cracken, who considered himself to be in debt to her and even included her in his own contact list.\nIn 2 ABY, while Llalik was on an extended paid vacation, she helped the Task Force on Alliance Security as a consultant on medical and cyborg advances that could be used against the Empire. In that role, she wrote a report on the threat posed by Doctor Cinto Alaras, an engineer with no known political affiliation, and on Rebel agent Sommen, who was working undercover for the same corporation as Alaras. Llalik also wrote a report on her own brother Nashiak, who had become an armor designer for Imperial military projects.\nIn 4 ABY, shortly after the Battle of Endor, Llalik was still active as a member of the soon-to-be Alliance of Free Planets. At that point, she was well-respected because of her engineering work that provided the soldiers of the Alliance with new technologies. Alliance historian Voren Na'al compared the importance of her work with that of Generals Jan Dodonna and Airen Cracken.\nSaren Llalik had advanced technical skills in several fields, including the programming, design, and maintenance of computers, droids, and prosthetics, as well as management, medicine, and cyborgs. She was also knowledgeable in other skills, including alien species, security, and even forgery. Llalik underwent training to increase her physical endurance, and although she knew how to use a blaster and even evade a shot, she rarely carried any weapon. Her equipment included a datapad, a diagnostic computer, a comlink, and a medpac, along with an ID to access her own lab.\nLlalik was very fond of her older brother Nashiak, and she believed him to be a very good engineer in his field. Not wanting to think badly of him, she also believed he was simply blind to the evil uses of his projects, and not really as cruel as his employers. She also wished that Nashiak would join the Alliance so that she could work with him and share their free time together.\nSaren Llalik was first mentioned in the roleplaying game book Cracken's Rebel Operatives , published by West End Games, edited by Bill Smith, and written by several authors. The book included a graphical depiction of Llalik by Brian Schomburg. Llalik was also mentioned in two other roleplaying books by the same company and co-written by Smith, Alliance Intelligence Reports  and The Truce at Bakura Sourcebook .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Plavin_6",
  "/wiki/30_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Alliance_Intelligence",
  "/wiki/BioTech_Industries/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Borg_Construct_Aj%5E6",
  "/wiki/Spy/Legends",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Nashiak_Llalik",
  "/wiki/Armor/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Cinto_Alaras",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Nash_Llalik",
  "/wiki/Loran_Llalik",
  "/wiki/Death_Watch/Legends",
  "/wiki/Sun_Guard",
  "/wiki/Unidentified_Llalik_child",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Director_of_Prosthetic_Design",
  "/wiki/Cybernetics/Legends",
  "/wiki/Laboratory/Legends",
  "/wiki/Corellian_system",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/2-1B_surgical_droid",
  "/wiki/Espionage_droid",
  "/wiki/Droid/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Kena_Shont",
  "/wiki/Datapad/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Sommen",
  "/wiki/4_ABY/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/1994",
  "/wiki/West_End_Games",
  "/wiki/Bill_Smith",
  "/wiki/Brian_Schomburg",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/1995",
  "/wiki/The_Truce_at_Bakura_Sourcebook",
  "/wiki/1996"
 ]
}