{
 "name": "Sarguillo",
 "display_name": "Sarguillo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aurilia"
     ]
    }
   ]
  }
 ],
 "content": "Captain Sarguillo was a male Zabrak in charge of defending the village of Aurilia on the planet Dathomir during the Galactic Civil War.\nSarguillo would keep the village safe through any way possible. He once tasked a Force-sensitive individual sent to the village by the Old Man to kill a patrol of Sith Shadows, afterward sending the individual to capture a Commander from one of the Shadows' bases for interrogation. Sometime after this, he led the defense of the village against hordes of Shadows with the help of the Force-sensitive individual.\nSometime later Aurilia was attacked by stormtroopers and Mellichae, a Dark Jedi imprisoned there, made his escape. Two days after, a Rebel agent visited the village, looking for a fragment of the Codex of Tython, an ancient Jedi Holocron, kept by Mellichae. Captain Sarguillo explained the agent that Mellichae had escaped and pointed where to find the Dark Jedi. He could not bring him to justice himself, because he was forced to remain in Aurilia to keep peace. Although the agent was attacked by both Mellichae and the Sith Shadows, he was able to defeat them and recover the piece of Holocron from the Zabrak. Afterward, Mellichae was once again returned to custody in Aurilia. The agent then went looking for Axkva Min, a Nightsister imprisoned in the Nightsister Stronghold. Sarguillo provided the agent with the Key of Exile required to enter the Chamber of Banishment, where Min was being kept prisoner.\nSarguillo appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony and published by LucasArts, prior to its closure on December 15, 2011.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Aurilia",
  "/wiki/Captain/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Old_Man",
  "/wiki/Sith_Shadow",
  "/wiki/Commander/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Mellichae",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Codex_of_Tython",
  "/wiki/Jedi/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Axkva_Min",
  "/wiki/Nightsisters/Legends",
  "/wiki/Nightsister_Stronghold",
  "/wiki/Key_of_Exile",
  "/wiki/Chamber_of_Banishment",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Template:SWGTCG"
 ]
}