{
 "name": "Sariss",
 "display_name": "Sariss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dromund Kaas"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Ruusan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Prophets of the Dark Side",
      "Galactic Empire",
      "Seven Dark Jedi"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Prophets of the Dark Side",
      "Jerec"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Merili",
      "Yun",
      "Gorc",
      "Picaroon C. Boodle"
     ]
    }
   ]
  }
 ],
 "content": "Sariss, alias \"Prophetess,\" was a Force-sensitive female Human who was one of seven Dark Jedi attempting to reclaim the Valley of the Jedi sometime after the Galactic Empire's defeat at the Battle of Endor.\nBorn the daughter of Imperial Warlord Cronal, Sariss was trained in the ways of the Force by the Prophets of the Dark Side on Dromund Kaas. As she grew up, she became an apprentice to Inquisitor Jerec, who completed her training as a Dark Jedi. She was one of Jerec's most loyal followers.\nSariss never knew that she was the daughter of Lord Cronal, one of the Prophets of the Dark Side who raised her in the dark ways of the Force on Dromund Kaas. There, Sariss first met her future master, Jerec of the Inquisitorius in the Galactic Empire. Because Cronal held to a creed of violent nihilism, the mere existence of his daughter constituted a shocking offense, as it was tribute to creation instead of destruction. Consequently, Sariss was disavowed by her father in the most horrid way he could conspire. Cronal not only allowed his fellow Prophets to freely engage her in carnal relations, but he also partook in the repeated rape himself.\n\"Prophetess\" was the alter ego assumed by Sariss on Tatooine, where, working in cooperation with local governor Tour Aryon, she posed as a local fortune teller as cover for her true job as a spy for the Secret Order of the Empire. As a fortune teller, she claimed that Wuher was the reincarnated soul of Cedo Partu. Wuher never allowed the Prophetess to enter Chalmun's Spaceport Cantina.\nIn the hours before the Battle of Yavin, as part of her espionage, she trailed Jabba Desilijic Tiure and his bodyguards to Docking Bay 94 in Mos Eisley. Shortly thereafter, Sariss had to quickly make way for a group of stormtroopers rushing to the docking bay in a vain attempt to prevent the escape of the droid R2-D2, holder of datatapes containing the stolen plans of the first Death Star.\nDuring the rebellion on Tatooine that followed the Battle of Endor four years later, Sariss abandoned her post to become a Dark Jedi apprenticed to Jerec, although outwardly she claimed devotion to the Empire's Church of the Dark Side. In her role as a disciple of the quasi-religion, she seduced a wealthy Epicanthix mineral baron on Panatha, to whom she became engaged. Sariss then seduced his son, Yun, whom she taught her \"faith.\" She convinced Yun to kill his own father—then gave the baron's wealth to her master, and also presented him with Yun, whom Jerec took as an apprentice. In time, Yun would also come to regard Sariss as his master.\nWith the death of Emperor Palpatine in 4 ABY, Sariss assisted Jerec in his efforts to rebuild the collapsing Empire and locate the Valley of the Jedi, a Force nexus formed in the final battle of the New Sith Wars more than a thousand years before. After learning that a surviving Jedi Master of the Old Republic, Qu Rahn, might know the location of the lost Valley, Jerec blockaded the planet Dorlo to intercept Rahn in the midst of a mission for the Rebel Alliance. Sariss's master then dispatched a landing party led by herself, her apprentice Yun, and her compeer Maw. Hunted down by Maw's ability to \"smell\" fear and anxiety, Rahn let Cee Norley to ambush the Imperials. Norley managed to destroy the landing party's troop-bearing skimmer before being executed by Sariss. Pondering on why a Rebel was left behind to be sacrificed, she realised that they wanted to buy time in order to fell aboard a ship. Indeed, Rahn's team made it to a CR90 corvette, and as the Dark Jedi trio pursued the Rebel craft, their own skimmer was caught in the corvette's slipstream and crashed. Sariss and the others aboard survived the impact, though their helmsman suffered a hit on his head. Sariss killed him to solve the problem.\nJerec was able to capture the Rebel corvette by deploying a tractor beam from his waiting Super Star Destroyer, the Vengeance. Sariss, Yun, and Maw regrouped with Jerec and their three cohorts on the Vengeance's bridge, where their master interrogated Qu Rahn. Jerec called her by his side, asking if this inexperienced pilot, two scientists and a bedraggled old Jedi were the beings who really escape three of his apprentices, expressed his disappointment and asked her not to let it happen again.\nThe Jedi refused to respond even as his Rebel companions were murdered one by one, then sought to goad his captors into his own execution; but Jerec instead resorted to violating Rahn's mind. He discovered that although Qu Rahn did not know the location of the Valley, his friend Morgan Katarn—killed by Jerec several years earlier—had known, and hidden a map leading to it in his home on the planet Sulon. Qu Rahn made his last stand by Force pulling Yun's lightsaber from its hilt and fought the assembled Dark Jedi; Sariss saw Boc attempting to stop the Jedi, and beinginjured, before she Sariss came next, but she was no match for Rahn, who blocked all her classical movements. It was Jerec who intervened and slew the Jedi Master.\nSariss was sent to Sulon with Boc and Yun to gather the pieces of the hidden map, which were discovered in the ceiling of Morgan Katarn's homestead by the droid information broker 8t88. She ordered her apprentice to accompany 8t88 to the city of Barons Hed to decipher the stone map while she returned to the Vengeance and reported on their progress. Yun soon transmitted the digitized map and destroyed the original on Jerec's order, foiling the efforts of another Jedi: Kyle Katarn, son of Morgan, who sought to beat Jerec to the Valley of the Jedi. The Dark Jedi were able to determine that the Valley lay on the planet Ruusan; Jerec mobilized his forces and established an excavation site on the world.\nA short time later, Sariss spoke with Yun, conveying Jerec's acknowledgement that Yun had done well. She gave him his next assignment: to discover the status of Patrol Zulu, Able, Mary 341, which was long overdue. Sariss later accompanied Jerec when the Dark Jedi Master confronted young Katarn, furious at the Rebel Jedi's slaying of Maw on a landing pad near Jerec's personal cargo ship, the Sulon Star. Jerec sought to turn Katarn to the dark side by persuading him to kill his partner and love, Jan Ors, whom Jerec's men had captured earlier. Katarn managed to hold off his anger and keep to the light side of the Force, and Yun watched as Sariss pushed the Jedi into the Sulon Star then sent the doomed ship plumetting to the surface.\nKatarn managed to escape from the Sulon Star in his own ship, the Moldy Crow, though he crashed the vessel in the process. He was later found unconscious by Sariss, Boc, and Yun and taken to be executed. As Sariss struck at Katarn with her lightsaber, Yun, in an act of pure instinct, deflected his master's blow, which collided with his own body and inflicted a mortal wound. Tears came to Sariss's eyes as she struggled to comprehend why Yun would turn against her. Yun eventually told her that Kyle was a true Jedi, and that he shouldn't be killed, and deserved a fighting chance. Watching her apprentice die, she chose to spare Kyle and engage him in a lightsaber duel.\nYet enraged by the loss of Yun, Sariss was determined to destroy the self-trained Jedi. She initially held the advantage, but as they locked blades she came to realize the meaning of Yun's final words to her: that Kyle was a true Jedi of the light side. Katarn countered her own use of a lightsaber technique known as the Flowing Water Cut and ran her through the chest with his blade. Sariss would die of the wound, and Kyle went on to rescue Jan and defeat the last of the Dark Jedi cadre, Boc Aseca and Jerec, once and for all.\nBy human standards, Sariss was a woman of medium height, and considered attractive . Similar to Jerec she wore always black with a red collar; according to the fashion of many other human females, she also painted red her lips and nails. Her hair was groomed short, like that of many human males.\nJerec's Dark Jedi were all ruthless, and Sariss was especially lusty for power; this trait won Jerec's trust, being especially close among his Lieutenants. She was the only one who called Jerec \"My lord\".\nSariss was quiet and reserved, but a formidable opponent in combat and deemed the most skilled lightsaber fighter of the seven Dark Jedi, relying almost exclusively on her fencing skills instead of using additional Force powers.\nShe was also the only known practitioner of Deadly Sight, allowing her a measure of ranged attack as well.\nSariss was played by Valerie Wildman in Star Wars: Jedi Knight: Dark Forces II. Sariss has also appeared in the graphic novella adaptations of the Dark Forces series, where her perspective is expanded. Audio dramas were produced based on the graphic novellas, including Rebel Agent and Jedi Knight. In all these instances, Sariss was voiced by Nancy Crocker.\nIn the non-canonical ending of Star Wars: Jedi Knight: Dark Forces II, where Kyle chooses the dark side, he kills Yun instead of Sariss, and she later appears as Emperor Katarn's aide.\nWilliam C. Dietz and Dave Dorman, in their novella Dark Forces: Jedi Knight, add a further dimension to the relationship between Sariss and Yun. They reveal that she considered Yun a very good and talented student, and also that he was the closest thing to a friend she ever had. In the novella, Yun's block superficially injures her in the arm.\nIn the audio version of Dark Forces: Jedi Knight, Sariss deliberately kills Yun when he tries to stop her. She shows no remorse in Yun's death which enrages Kyle leading him to kill her.\nThe figure of the 'Prophetess' was initially only an uncredited extra appearing for a second in A New Hope. Afterwards, that figure's backstory as the \"Prophetess\" was created for the Star Wars Customizable Card Game. Abel G. Peña, in his The Dark Forces Saga articles, retconned the Prophetess and Sariss into the same character. An unidentified illustration for a Dark Side Adept in Threats of the Galaxy matched the appearance of a lightsaber-wielding Prophetess.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Prophetess",
  "/wiki/Dromund_Kaas",
  "/wiki/5_ABY/Legends",
  "/wiki/Ruusan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Prophets_of_the_Dark_Side",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Seven_Dark_Jedi",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Merili",
  "/wiki/Yun",
  "/wiki/Gorc",
  "/wiki/Picaroon_C._Boodle",
  "/wiki/Qu_Rahn/Legends",
  "/wiki/Force_ghost",
  "/wiki/Kyle_Katarn",
  "/wiki/File:QuRahn-Sariss.ogg",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Cronal",
  "/wiki/The_Force/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Reproduction/Legends#Non-reproductive_mating",
  "/wiki/Tatooine/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Tour_Aryon",
  "/wiki/Wuher/Legends",
  "/wiki/Cedo_Partu",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Standard_hour",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Docking_Bay_94/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Datatape",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Rebellion_on_Tatooine",
  "/wiki/Standard_year",
  "/wiki/Church_of_the_Dark_Side",
  "/wiki/Epicanthix",
  "/wiki/Panatha",
  "/wiki/Palpatine/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Force_nexus",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/New_Sith_Wars",
  "/wiki/1000_BBY",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Galactic_Republic",
  "/wiki/Dorlo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Maw_(Jedi)",
  "/wiki/Force_sense/Legends",
  "/wiki/Cee_Norley",
  "/wiki/Troop/Legends",
  "/wiki/Skimmer/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Helmsman/Legends",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Vengeance_(Vengeance-class)",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Force_drain/Legends",
  "/wiki/Morgan_Katarn",
  "/wiki/Sulon",
  "/wiki/Force_pull",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Droid/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/8t88/Legends",
  "/wiki/City/Legends",
  "/wiki/Barons_Hed",
  "/wiki/Patrol_341",
  "/wiki/Jan_Ors",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Moldy_Crow/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Flowing_Water",
  "/wiki/Boc_Aseca",
  "/wiki/Special:EditPage/:Sariss",
  "/wiki/Mouth/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Deadly_Sight",
  "/wiki/Valerie_Wildman",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Dark_Forces:_Rebel_Agent_audio_drama",
  "/wiki/Dark_Forces:_Jedi_Knight_audio_drama",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/William_C._Dietz",
  "/wiki/Dave_Dorman",
  "/wiki/Dark_Forces:_Jedi_Knight",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Retcon",
  "/wiki/Dark_Side_Adept",
  "/wiki/Threats_of_the_Galaxy",
  "/wiki/Journey_to_Mos_Eisley",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/Dark_Forces:_Rebel_Agent",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/Canon",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/1977_Topps_Star_Wars_Series_3",
  "/wiki/Galaxy_Guide_7:_Mos_Eisley",
  "/wiki/The_Farlander_Papers",
  "/wiki/X-Wing:_The_Official_Strategy_Guide",
  "/wiki/Premiere_Limited",
  "/wiki/Star_Wars_Insider",
  "/wiki/Building_a_Better_Jedi:_Justin_Chin_on_Dark_Forces_II",
  "/wiki/Star_Wars_Insider_31",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II:_The_Official_Strategy_Guide",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_40",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_Power_of_the_Jedi",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Wizards.com",
  "/wiki/Kyle_Katarn%27s_Tale",
  "/wiki/Refresher_Reading",
  "/wiki/Star_Wars_Insider_91",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/Barely_Tolerable:_Alien_Henchmen_of_the_Empire",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Knowledge_and_Defense"
 ]
}