{
 "name": "Sarissa_Jeng",
 "display_name": "Sarissa Jeng",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi assault team",
      "Jedi assault team"
     ]
    }
   ]
  }
 ],
 "content": "Sarissa Jeng was a human female member of the Jedi Order during the Separatist Crisis. In 22 BBY, Jeng was one of the 212 Jedi who traveled to the planet Geonosis to rescue the Jedi Knight Obi-Wan Kenobi. During the battle, she cut down a Geonosian with her lightsaber before the Galactic Republic and Jedi ultimately emerged victorious over the Confederacy of Independent Systems.\nSarissa Jeng was a human female who served as a member of the Jedi Order, guardians of the Galactic Republic, during the Separatist Crisis. In 22 BBY, she was one of 212 Jedi that made up an assault team led by Jedi Master Mace Windu to the planet Geonosis in order to rescue the Jedi Knight Obi-Wan Kenobi, who had been captured while spying on the leaders of the newly formed Confederacy of Independent Systems. Kenobi, along with his Padawan, Anakin Skywalker, and Senator Padmé Amidala, had been sentenced to death and faced execution in the Petranaki Arena.\nWhile the trio of prisoners freed themselves and fought off the beasts that were meant to kill them, Jeng and the other Jedi infiltrated the arena and revealed their presence as Windu confronted Count Dooku, head of the Confederacy. An army of battle droids then entered the arena and attacked the Jedi with the support of the native Geonosians, who had joined the Confederacy. While fighting on the arena floor, Jeng gave a battle cry as she used her lightsaber to cut down a Geonosian warrior. The Jedi assault team was eventually overwhelmed by the droids, who surrounded a group of surviving Jedi, although Jeng was not among them. Grand Master Yoda then arrived with the new Grand Army of the Republic and rescued the survivors before ultimately claiming victory over the Separatists.\nJeng had brown eyes, light skin, and brown hair, the latter of which she wore braided in a crown style.\nIn the arena, Jeng wore Jedi robes that included a dark brown tunic over a light brown shirt. She used a blue-bladed lightsaber in combat.\nSarissa Jeng was created for the prequel trilogy film Star Wars: Episode II Attack of the Clones which was released on May 16, 2002. She was portrayed uncredited by Karen Wilson according to the fan website Aveleyman. Jeng's body is shown among the dead in an unfinished cut of the film's Battle of Geonosis in which a group of Jedi raid a Droid Control Ship in an attempt to shut down the Separatist battle droids. The Jedi battle in the Petranaki Arena scenes were filmed on Stage 3 at Fox Studios, Sydney, between August 10 and August 15, 2000.\nIn the current Star Wars canon, Jeng was first named on a card added to the Star Wars: Card Trader app in 2021. The name originated in the Star Wars Legends continuity as Sarrissa Jeng, appearing prior to the release of Attack of the Clones in HoloNet News Vol. 531 #52, an April 18, 2002 issue published on the HoloNet News website as part of the marketing for the film. The article was written by Pablo Hidalgo and Paul Ens.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sarissa_Jeng",
  "/wiki/Sarrissa_Jeng",
  "/wiki/Jeng",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_assault_team",
  "/wiki/File:Jeng-Hah.ogg",
  "/wiki/Separatist_Crisis",
  "/wiki/22_BBY",
  "/wiki/Jedi",
  "/wiki/Planet",
  "/wiki/Geonosis",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Geonosian",
  "/wiki/Lightsaber",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/File:Windu-What_Jedi.ogg",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Death",
  "/wiki/Death_penalty",
  "/wiki/Petranaki_Arena",
  "/wiki/Prisoner",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Battle_droid",
  "/wiki/Homeworld",
  "/wiki/Warrior_caste_(Geonosian)",
  "/wiki/Droid",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Braid",
  "/wiki/Jedi_robes",
  "/wiki/Clothing",
  "/wiki/Lightsaber_combat",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/May_16",
  "/wiki/2002",
  "/wiki/Karen_Wilson",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Fox_Studios,_Sydney",
  "/wiki/August_10",
  "/wiki/August_15",
  "/wiki/2000",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/2021",
  "/wiki/Star_Wars_Legends",
  "/wiki/HoloNet_News_Vol._531_52",
  "/wiki/April_18",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Paul_Ens",
  "/wiki/Star_Wars:_The_Skywalker_Saga",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Category:Images_of_Sarissa_Jeng",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/July_4",
  "/wiki/The_Star_Wars_Archives:_Episodes_I%E2%80%93III,_1999%E2%80%932005",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Jedi_Council_Forums",
  "/wiki/September_20",
  "/wiki/2020",
  "/wiki/October_31",
  "/wiki/2006"
 ]
}