{
 "name": "Sarkli",
 "display_name": "Sarkli",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Starfighter Corps",
      "Alliance Starfighter Corps",
      "Galactic Empire",
      "Imperial Navy",
      "Storm Commando Core",
      "Imperial Navy",
      "Storm Commando Core"
     ]
    }
   ]
  }
 ],
 "content": "Sarkli was a Human male captain in the Galactic Empire's Stormtrooper Corps during the Galactic Civil War. A member of the elite storm commandos, Sarkli was the nephew of Admiral Firmus Piett and one of the Empire's best spies, even finding audience with Emperor Palpatine. Prior to his involvement in the Empire, Sarkli was an X-wing starfighter pilot for the Rebel Alliance, flying under Commander Luke Skywalker in Red Squadron. Sarkli was among the Rebel force that assisted in the evacuation of the Alliance's Yavin 4 base, and later assisted in the operation to extract Imperial defector Tycho Celchu from the planet Dantooine. Sarkli, who was known for his big ego, eventually defected to the Empire during a rebel defense of the planet Ralltiir.\nDuring his time with the Empire, Sarkli disrupted Rebel plans to free Alliance prisoners of war from a facility orbiting the planet Bakura, eventually being tracked to the planet Geonosis by the Rebel starfighter unit Rogue Squadron. He managed to survive this encounter, and was later assigned to the forest moon of Endor, where he guarded the shield bunker protecting the superweapon Death Star II. Sarkli would ultimately be killed during the Battle of Endor by General Han Solo of the Rebel Alliance, who infiltrated the bunker with a team of Rebel operatives.\nSarkli, a Human male, was born prior to 0 BBY as the nephew of Firmus Piett, an Admiral under the galaxy's governing body, the Galactic Empire. Sarkli was eventually pit against his uncle's side during the Galactic Civil War when he was recruited by the freedom-fighting movement known as the Rebel Alliance sometime around the Battle of Yavin.\nDuring one of the routine raids on the Alliance's base on the moon Yavin 4 conducted by Imperial forces, Sarkli accompanied pilots Luke Skywalker and Wedge Antilles with the mission of defending the Rebel transport Luminous. Sarkli provided an aerial defense of the Great Temple while Skywalker and Antilles extracted General Jan Dodonna and Lieutenant Bren Derlin, who were trapped inside. Sarkli ultimately saved the group from a pair of Imperial scout walkers in the main hangar bay.\nSarkli later accompanied Red Squadron to a meeting with Tycho Celchu, a Rebel sympathizer wishing to defect from the Empire. However, when Celchu's rendezvous point on the planet Dantooine was compromised by Imperial storm commandos, the meeting was quickly converted into a rescue operation. Commander Skywalker took it upon himself to infiltrate the makeshift Imperial camp to rescue Celchu, ordering Sarkli and the rest of the strike team to wait with the ships. During Skywalker's absence, the team was wiped out by a sudden Imperial ambush, leaving Sarkli the only survivor, who reported what was happening to Skywalker when he and Celchu were arriving back to the landing area.\nSarkli later took part in a Rebel operation to save a group of scientists holed up by a team of storm commandos in a city on Ralltiir. Although Sarkli initially flew with Red Squadron during the mission and helped stem the flow of Imperial reinforcements, he used the battle as an opportunity to defect to the Empire, surrendering himself to a storm commando convoy. Sarkli quickly made a name for himself in the Empire, becoming captain of a storm commando unit. Sarkli also became a renowned spy, even finding personal favor with Emperor Palpatine.\nFollowing the Battle of Hoth, Sarkli interfered with a Rebel rescue mission over the planet Bakura. Piloting an Imperial escort carrier, he boarded and destroyed a Rebel transport carrying several Rebel prisoners of war rescued from the orbital detainment facility before fleeing to Geonosis. He lured the pursuing Alliance fleet into an ambush in the Geonosian asteroid field, where he engaged in combat with former wingman Wedge Antilles. Sarkli's escort carrier sustained critical damage during the fight, forcing him to retreat to the planet's surface in an escape pod. Antilles pursued Sarkli into the Geonosian canyons, where Sarkli attacked him using a LAAT/i gunship. Using a single E-Web blaster cannon stolen from an Imperial stormtrooper, Antilles damaged Sarkli's gunship, causing it to careen into one of the canyon walls.\nSarkli managed to survive the incident, and was later present on the superweapon Death Star II over the forest moon of Endor during Darth Vader's visit to the station in 4 ABY.\nSarkli was later assigned to the shield bunker on the sanctuary moon, commanding a storm commando sentry unit. His unit failed to prevent a Rebel strike team led by General Han Solo from entering the bunker and planting explosives. In a last ditch effort, Sarkli confronted Solo with a blaster rifle and attempted to block his escape from the exploding bunker, with Solo telling him that the Empire was finished, and Sarkli had chosen the wrong side. The two men simultaneously tried to kill each other and retreat from the bunker. Sarkli ultimately received a fatal wound from Solo's blaster near the main entrance after a short skirmish through the hallways, falling to Solo despite his skill with a blaster. His uncle, Admiral Piett, would die in the same battle when Rebel pilot Arvel Crynyd careened his starfighter into the bridge of the flagship Executor.\nSarkli had a large ego, one which would ultimately lead to his defection from the Rebellion. During his time under Red Squadron, he was not as respected as pilots such as his commander, Luke Skywalker, who was sometimes credited with Sarkli's successes. During the Empire's raid on Yavin 4, General Dodonna overlooked Sarkli's heroic actions in saving them from two Imperial walkers in the main hanger bay, instead claiming he owed his life to Skywalker. He also often felt restrained by his commander's orders, and vocally expressed dismay at being ordered to stand down from battle on Dantooine. Moments before his ultimate defection to the Empire on Ralltiir, Sarkli claimed a person of his own skill was above the Rebellion.\nAs an Imperial, Sarkli viewed the Empire as a peacekeeping entity, and the Rebellion as an inhibitor of that peace. His commitment to the Empire's cause, going as far as to having no qualms with killing his former allies, led him to become one of their most valuable assets, and he was considered a master spy. However, despite his abilities with a blaster, he was never able to best his former allies in the Rebel Alliance, ultimately meeting his end by challenging his former teammate Han Solo.\nSarkli's first appearance in Star Wars canon was in the film Star Wars: Episode VI Return of the Jedi as a nameless Imperial officer during the Death Star II hangar bay scenes. In 2000, the Star Wars Customizable Card Game named Sarkli in the Legends continuity and established him as a highly commendable spy and relative of Piett who found favor with Emperor Palpatine.\nSarkli was fleshed out in the LucasArts video game Star Wars: Rogue Squadron III: Rebel Strike, voiced by Robin Atkin Downes. He initially appears as an ally and wingmate to the player in the missions \"Revenge of the Empire,\" \"Defiance on Dantooine,\" and \"Defenders of Ralltiir\" before becoming the game's primary antagonist. The first time the player fights him during the mission \"Relics of Geonosis,\" Sarkli pilots a salvaged Republic gunship and is shot down by the player with an E-web cannon. He is fought a second and final time in the final mission of the Endor campaign, \"Triumph of the Rebellion.\" The player, as Han Solo, engages in a firefight with Sarkli  while escaping the burning bunker on Endor.\nSeveral images found on T-bone's Star Wars Universe website show that Sarkli was meant to appear in at least two more scenes in Return of the Jedi. The first four images show Sarkli and other Imperial officers heading toward the Death Star's hangar bay to greet Palpatine upon his arrival. The last two images show an extended version of the Emperor's arrival, with Sarkli visible on the penultimate photo.\nStock footage of scenes from Return of the Jedi was later added into the special edition of Star Wars: Episode V The Empire Strikes Back. Although the extra playing Sarkli can be seen during Darth Vader's return to the Executor, that does not necessarily make Sarkli canonically appear in the film.\nSarkli is present during the non-canon exploits of fallen Jedi Knight Galen Marek's clone, the Dark Apprentice, in the Infinities expansion of the LucasArts video game Star Wars: The Force Unleashed II, voiced by Jaron Monroe. The Dark Apprentice is tasked with countering the Rebel attack on the shield generator on Endor to keep the second Death Star secure, killing the Wookiee Chewbacca, Princess Leia Organa, and Han Solo, the last being Sarkli's would-be murderer. After the death of Organa, Emperor Palpatine orders Captain Sarkli to lead his men in a mission to destroy the Dark Apprentice. A fleet commanded by Sarkli is seen enclosing around the Dark Apprentice before the game cuts to black. Sarkli's name is misspelled as \"Sarcli\" in the mission's end credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Firmus_Piett%27s_nephew",
  "/wiki/Sarkli",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/4_ABY/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Starfighter_Corps",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Storm_commando",
  "/wiki/Captain/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Firmus_Piett/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Red_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/Evacuation_of_Yavin",
  "/wiki/Great_Temple/Legends",
  "/wiki/Mission_to_Dantooine",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Defense_of_Ralltiir",
  "/wiki/Ralltiir/Legends",
  "/wiki/Bakura/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/General/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Luminous/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Bren_Derlin/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/City/Legends",
  "/wiki/Convoy/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Raid_at_Bakura",
  "/wiki/Imperial_escort_carrier/Legends",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Battle_of_Geonosis_(Galactic_Civil_War)",
  "/wiki/Escape_pod/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/E-Web_heavy_repeating_blaster",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Endor_(planet)/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Unit",
  "/wiki/Endor_strike_team/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Arvel_Crynyd/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/2000",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/LucasArts",
  "/wiki/Star_Wars:_Rogue_Squadron_III:_Rebel_Strike",
  "/wiki/Robin_Atkin_Downes",
  "/wiki/Star_Wars_Trilogy_(Special_Edition)",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galen_Marek",
  "/wiki/Cloning/Legends",
  "/wiki/Dark_Apprentice",
  "/wiki/Infinities",
  "/wiki/Star_Wars:_The_Force_Unleashed_II",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(PhotoComic)",
  "/wiki/Classic_Star_Wars:_Return_of_the_Jedi_(book-and-tape)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/1983_Topps_Star_Wars:_Return_of_the_Jedi_Series_1",
  "/wiki/Imperial_Sourcebook",
  "/wiki/The_Art_of_Star_Wars_Episode_VI:_Return_of_the_Jedi",
  "/wiki/Star_Wars:_The_Magic_of_Myth_(book)",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Death_Star_II_Limited",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/Star_Wars:_Rogue_Squadron_III:_Rebel_Strike:_The_Official_Nintendo_Player%27s_Guide",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Men_Who_Built_the_Empire",
  "/wiki/Star_Wars_Insider_96",
  "/wiki/Template:SWGTCG",
  "/wiki/Star_Wars_Insider_Special_Edition_2010",
  "/wiki/Databank_(original)",
  "/wiki/Death_Star_Owner%27s_Technical_Manual",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/The_New_Essential_Chronology"
 ]
}