{
 "name": "Sarlim Gastess",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gastess' Finance",
      "Inc."
     ]
    }
   ]
  }
 ],
 "content": "Sarlim Gastess was one of the few Gotals with non-functional head cones. Without the natural ability to sense emotions, he was a clinical psychopath by Gotal standards. Despite this disability, or possibly because of it, he became a successful businessman in the Parmic sector of the Outer Rim Territories during the Imperial era. Gastess was feared by other Gotals, but he functioned well among non-Gotals, using his overbearing personality to make up for his poor eyesight and hearing.\nHis company, Gastess' Finance, Inc., operated by executing hostile takeovers of smaller companies, firing the existing management, and running them into the ground for a quick infusion of credits. Afterward, the company would be either be sold off or disbanded, with its assets liquidated. Eventually, even planetary-sized corporations were targeted by Gastess' Finance. After Gastess was finished with a planetary corporation, the inhabitants were open to exploitation or even slavery by the Empire.\nSarlim Gastess tightly controlled the operations of his company, and took pleasure in the destruction of his adversaries in the business world. He usually carried a blaster pistol openly on his right hip.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gastess%27_Finance,_Inc.",
  "/wiki/Parmic_sector",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Slavery/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}