{
 "name": "Sarna_(Sith_military)",
 "display_name": "Sarna  (Sith military)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Sarna was a female Human Sith trooper and Sith officer stationed on the planet of Taris in 3956 BBY as part of the Sith occupation of that planet. She had the rank of Junior Officer First Class.\nA couple of days after the Sith under Darth Malak had conquered Taris, Sarna had decided to throw a party in her apartment in order for some of the troopers to blow off some steam. At the party she became drunk on Tarisian ale despite the warnings from her friend Yun Genda, who had heard of the potency of the beverage.\nSarna may have met the amnesiac Revan, along with Carth Onasi in the Upper City Cantina, not realizing that they were in fact Republic officers.\nRevan and Carth proceeded to steal her armor after she passed out.\nSarna was an attractive young woman with red hair and brown eyes. She maintained a positive outlook on life despite her career within the ranks of the Sith.\nSarna had no genuine loyalty to the Sith. She simply worked to make a living. She even stated that if she could find another job, she would retire her uniform.\nWhile conversing with Revan, Sarna became intrigued by the soldier. It is possible she became attracted to him.\nSarna will only arrange an invitation for the player if the player is male; if the player is female then they speak to Yun Genda.\nAn alternative to attending the party involves heading to the northern part of the Upper City - specifically the North Apartments. The player can come across a Aqualish member of the Hidden Beks being harassed by Sith soldiers and is threatened with death. The player could intervene to save the Aqualish victim or simply allow him to get executed by the Sith Soldiers and can threaten the soldiers afterward. The player can loot a Sith uniform from one of the bodies regardless of the choice they decide to make. Once this incident takes place, Sarna and Yun Genda will no longer appear.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sarna_(Queen)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Sith_officer",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/3956_BBY",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Tarisian_ale",
  "/wiki/Yun_Genda",
  "/wiki/Revan/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Upper_City_Cantina",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/North_Apartments",
  "/wiki/Unidentified_Aqualish_(North_Apartments)",
  "/wiki/Hidden_Beks",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}