{
 "name": "Sarrissa Jeng",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Sarrissa Jeng was a female Human Jedi Knight serving the Jedi Order and the Galactic Republic in the waning years of the Republic Classic era.\nDiscovered to be Force-sensitive at a young age, Sarrissa Jeng was given to the Coruscant Jedi Temple for induction within the Jedi Order's academy. Trained in the ways of the Force, Jeng eventually graduated and was selected as a Padawan by a Jedi Master. Eventually building herself a blue-bladed lightsaber and passing her Trials of Knighthood, Jeng was made a Jedi Knight by the Jedi High Council.\nActive during the Separatist Crisis, a growing division between the Galactic Republic and the Confederacy of Independent Systems, Jedi Jeng was dispatched as the leader of a six-member Jedi task force to the Gotal colony world Atzerri. There, Jeng and her team of diplomats were to negotiate the release of Emissary Nathanjo Nirrelz, a Gotal representative taken hostage by the Roshu Sune during the battle of Antar 4. During the negotiations, a group of unaffiliated vigilantes opened fire on the Roshu Shone guerrillas. This attack panicked the Gotal Roshu Shone, who opened fire on their captives. Leaping to defend the unarmed hostages, Jeng and her fellow Jedi managed to subdue the guerrillas on their commuter hopper, but not before Jedi Kaloor Cofi and Antyard-Wo Shissan lost their lives. Emerging from the firefight, Jedi Jeng and a Mon Calamari Jedi Knight escorted Emissary Nirrelz to safety while the other Jedi helped transport the surviving hostages to medcenters in the nearby cities of Skreeka and Talos.\nAfter the fighting ended, the surviving Jedi departed for Aleen Minor and the Order's chapter house there for the funerals of Jedi Cofi and Shissan. Meanwhile across the HoloNet News network, the Jedi were heavily criticized by Gotal Foreign Affairs Commune leader Shagrad Loset for what he saw as meddling in an internal affair. Rebuffing this assault on the Order, Jedi Master and High Council member Shaak Ti commended the Jedi effort on Atzerri.\nIt wasn't long before tensions between the Confederacy and the Republic came to a head. When the Confederacy captured Jedi Obi-Wan Kenobi, Anakin Skywalker, and Naboo Senator Padmé Amidala, Master of the Order Mace Windu assembled all available Jedi in a massive strike team. Stationed at the Coruscant Temple at the time, Jeng answered Master Windu's call and departed for the Separatist foundry world, Geonosis, with 200 of her colleagues. Landing on the dusty plains of Geonosis, Jeng and her comrades stormed the Petranaki arena and engaged the Separatist Droid Army on the arena floor, with Jeng herself dispatching a Geonosian warrior with a loud battle cry. Unfortunately, Jeng was ultimately overwhelmed and killed, her name being amongst the 170 Jedi who perished in the battle.\nSarrissa Jeng wielded a blue-bladed lightsaber and was a practitioner of Form VI: Niman. While a skilled warrior, she perished in the Battle of Geonosis due to her preferred style not being able to cope with the sheer number of opponents.\nSarrissa Jeng was portrayed by Karen Wilson, a student of Byron Bay Kendo Club.\nIn a behind the scenes cut that never made the movie, Sarrissa's body can be seen. There is a video titled \"Raid on the Droid Control Ship.\" It is at the end of this video that Sarrissa's body can be seen.\nThe Hasbro Star Wars toys infosite Rebelscum.com announced on August 9, 2013 that a Sarissa Jeng action figure was due for release as part of a Geonosis 4-figure Multipack for the end of the same year.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sarissa_Jeng",
  "/wiki/Sarrissa_Jeng",
  "/wiki/Jeng",
  "/wiki/22_BBY/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/File:Jeng-Hah.ogg",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Atzerri/Legends",
  "/wiki/Jedi_Diplomat",
  "/wiki/Nathanjo_Nirrelz",
  "/wiki/Gotal_hostage_standoff",
  "/wiki/Roshu_Sune/Legends",
  "/wiki/Battle_of_Antar_4",
  "/wiki/Antar_4/Legends",
  "/wiki/Commuter_hopper",
  "/wiki/Kaloor_Cofi",
  "/wiki/Antyard-Wo_Shissan",
  "/wiki/Unidentified_Mon_Calamari_Jedi_Knight",
  "/wiki/Medcenter/Legends",
  "/wiki/Skreeka",
  "/wiki/Talos",
  "/wiki/Aleen_Minor/Legends",
  "/wiki/Jedi_chapter_house_(Aleen_Minor)",
  "/wiki/Jedi_funeral/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Gotal_Foreign_Affairs_Commune",
  "/wiki/Shagrad_Loset",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/Petranaki_arena",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Form_VI/Legends",
  "/wiki/Karen_Wilson",
  "/wiki/HoloNet_News_Vol._531_52",
  "/wiki/HoloNet_News_Vol._531_53",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_102",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_Saga_Legends"
 ]
}