{
 "name": "Sarro_Xaj",
 "display_name": "Sarro Xaj",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "1020 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "990 BBY",
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Over 2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Olive-brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Army of Light",
      "Army of Light"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Raskta Lsu"
     ]
    }
   ]
  }
 ],
 "content": "Sarro Xaj was a Human male Jedi Knight who had a massive physique and studied under Master Raskta Lsu, and fought alongside her in the New Sith Wars on Ruusan. He was promoted to the rank of Jedi Knight around 997 BBY and followed in her footsteps, training to become a Jedi Weapon Master.\nXaj joined Raskta Lsu, Worror Dowmat, Valenthyne Farfalla and Johun Othone on the Justice Crusader to Tython, in pursuit of the Sith Lord Darth Bane and his apprentice Zannah. Once they arrived at Belia Darzu's castle, they immediately engaged in a duel with Darth Bane and Darth Zannah.\nXaj wielded a blue double-bladed lightsaber nearly three meters long and attacked Zannah in concert with his fellow Jedi Othone. However, Othone's lack of skill hindered Xaj's efforts. As Xaj pressed his offensive he was interrupted by Othone's basic strikes and was forced to pull up his attacks in order to avoid killing his companion. At one point in the battle, Farfalla called for reinforcements, and Xaj shouted for Othone to help him, leaving Xaj to duel Zannah alone. Xaj overpowered Zannah in one-on-one combat, using the Force channeled through him by Worror's battle meditation. He exhausted his opponent with his superior strength and drove her back into a corner. As he moved to finish her off, Worror's concentration was broken and his battle meditation cut off, robbing Xaj of the power afforded to him by the Ithorian Jedi Master. Xaj hesitated and glanced toward his companions to see what had happened. Zannah used the opportunity to assault Xaj's mind with Sith sorcery and then killed him with a blow to his chest.\nFollowing his death on Tython, the Jedi High Council, alerted to the existence of Darth Bane by Caleb of Ambria, sent a team of Jedi, including Masters Tho'natu and Obba, to destroy him. On Ambria, in Caleb's camp, the Jedi discovered the lightsaber hilts of the slain Jedi, including Xaj's. Upon the team's arrival, they were assaulted by a deranged Darovit, whom they assumed to be Bane suffering from overexposure to the orbalisk armor. Slaying him, they deemed that the Sith were extinct, and returned the lightsaber hilts to the Temple.\nOnce returned to the Temple, the Jedi created a memorial to those Jedi who were responsible for the destruction of the Sith. All five Jedi's lightsaber hilts were set into a large white stone block in the gardens around the base of the Tower of First Knowledge. Under each hilt was a depiction of its wielder, along with their name.\nSarro Xaj was a massive man, standing over two meters tall and weighing 150 kilograms. He had olive brown skin and a single topknot of black hair. In his youth, Xaj's passion for lightsaber combat was enough to catch the eye of Weapons Master Raskta Lsu. He was confident in his abilities, humorously speculating that the upcoming battle with the Sith Lords on Tython might be too easy. He even smiled at Zannah in the midst of combat once he was able to engage her in a duel alone, free of the encumbrance of Othone.\nAs a Padawan, Xaj chose to follow his master's footsteps in seeking to perfect his skills with a lightsaber. He joined his master in the Ruusan campaign, and a few years after the New Sith Wars, Lsu completed his training, deeming him worthy of the rank of Jedi Knight. Eventually he earned the rank of Weapons Master. His skill with a double-bladed lightsaber was enough to overwhelm Darth Zannah in one-on-one combat with the aid of Worror's battle meditation. Zannah described Xaj's fighting style as having more refinement than Bane's. Once the effects were cut off, he was distracted and was unable to defend himself from Zannah's Sith sorcery, resulting in his death.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1020_BBY",
  "/wiki/990_BBY",
  "/wiki/Tython/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Raskta_Lsu",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Ruusan/Legends",
  "/wiki/997_BBY",
  "/wiki/Jedi_Weapon_Master",
  "/wiki/File:Duel_on_Tython.jpg",
  "/wiki/Worror_Dowmat",
  "/wiki/Valenthyne_Farfalla",
  "/wiki/Johun_Othone",
  "/wiki/Justice_Crusader",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Belia_Darzu",
  "/wiki/Duel_on_Tython",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Battle_meditation",
  "/wiki/Ithorian/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Sith_magic",
  "/wiki/Death/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Caleb",
  "/wiki/Ambria/Legends",
  "/wiki/Tho%27natu",
  "/wiki/Obba",
  "/wiki/Lightsaber_hilt/Legends",
  "/wiki/Darovit",
  "/wiki/Orbalisk_armor",
  "/wiki/Confrontation_on_Ambria",
  "/wiki/Tower_of_First_Knowledge/Legends",
  "/wiki/Kilogram/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ruusan_campaign",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Art_of_Warfare",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_14"
 ]
}