{
 "name": "Sasha ot Sulem",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians"
     ]
    }
   ]
  }
 ],
 "content": "Sasha ot Sulem was a Human female, the daughter of Rundil ot Sulem. She was kidnapped and long raised by the Mandalorians on Dantooine, and knew only an odd version of Mando'a, the Mandalorian language, and Galactic Basic Standard. She finally managed to escape them, and hid in the cargo bay of the Ebon Hawk, which had landed at the Jedi Enclave.\nWhile at the Enclave, Revan met Lur Arka Sulas, who was searching for the girl on behalf of her parents. Revan found the little stowaway and mastered enough of her strange language to persuade her to go home with Lur.\nThe quest of Sasha includes understanding Sasha's strange version of the Mandalorian language and using it to communicate with her. The dialect that Revan learns from Sasha is unrelated to the one created by Karen Traviss. There is a glitch involving Sasha in KOTOR which allows the player to get unlimited dark side points. The player must simply tell Sasha to leave, then talk to her before she does and again tell her to leave. This gives the player more dark side points than would normally be given without exploiting this glitch.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Sasha",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Lur_Arka_Sulas",
  "/wiki/Revan/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Rundil_ot_Sulem",
  "/wiki/Dantooine/Legends",
  "/wiki/Sasha_ot_Sulem%27s_dialect",
  "/wiki/Mando%27a/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Karen_Traviss",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}