{
 "name": "Sasha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Sasha was a Human female explorer who was a member of the Alliance to Restore the Republic until she broke all ties with the Rebellion and made a living from her scouting skills on Onderon.\nSasha's parents were early Rebel Alliance members who raised her lovingly and constantly moved between uninhabited planets on the run from the Galactic Empire, which from a young age sparked Sasha's interest in exploring.\nAs she grew up, Sasha also joined the Rebels, inspired by a desire to bring back harmony and democracy to the galaxy. Her idealism, however, was broken after an eventful mission on Onderon, in which, after accidentally giving away her position to Imperials, she was left without support from the Rebels and survived only to remain stranded on Onderon for some time.\nAfter the abandonment by the Rebels, Sasha saw her loyalty to the Rebel Alliance shattered. She then resorted to selling her skills as a scout to make a living, and, although she made good profit from it, she always wished to leave the planet where so many of her mates perished.\nWhen Twi'lek bounty hunter Oskara hired Sasha to track down an individual through wild country, she took her to Mos Shuuta, Tatooine as a reward for the successfully completed mission.\nOn Tatooine, Sasha kept working as a freelance explorer and began friendships with Oskara and technician Mathus, Teemo the Hutt's leading mechanic. Tagging along with them, she took part in a rescue mission to save one of Teemo's servants.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sasha_ot_Sulem",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Onderon/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Mission_to_Onderon_(Galactic_Civil_War)",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Oskara",
  "/wiki/Mos_Shuuta",
  "/wiki/Tatooine/Legends",
  "/wiki/Mathus",
  "/wiki/Teemo",
  "/wiki/Hutt/Legends",
  "/wiki/The_Long_Arm_of_the_Hutt",
  "/wiki/Star_Wars:_Edge_of_the_Empire_Core_Rulebook",
  "/wiki/Star_Wars:_Edge_of_the_Empire_Game_Master%27s_Kit",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Balance_of_the_Force",
  "/wiki/Star_Wars:_Age_of_Rebellion_Core_Rulebook",
  "/wiki/Fantasy_Flight_Games"
 ]
}