{
 "name": "Sasnak_Toxis",
 "display_name": "Sasnak Toxis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Defel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "New Republic Special Forces",
      "New Republic Special Forces"
     ]
    }
   ]
  }
 ],
 "content": "Sasnak Toxis, sometimes abbreviated to Sas, was a Defel officer, a member of the Rebel Alliance, and a personal enemy of the pirate Chordak. The son of Colonel Caleb Hctaqsas, Sasnak Toxis fought Chordak and slavers on Corulag and worked with fellow Defel spy Thar'quan who operated undercover at Hctaqsas Metals.\nHe later became a Lieutenant Commander for the New Republic Special Forces and survived an attempt on his life made by the rogue agent Ma'w'shiye. The fugitive miner Mihalik was known to be loyal to Toxis.\nSasnak \"Sas\" Toxis, a Defel, was the son of Colonel Caleb Hctaqsas. In time, he joined the Alliance to Restore the Republic and became an enemy of pirate Chordak.\nToxis met with Rebel lieutenant Alton Lochner and commander Derembus Sitnalta on Corulag. There, they saw Chordak and his ally, the slaver Talas Piran, dealing with their stock. Toxis noticed that several of the slaves were people he knew personally. The event became a fight until the prefect arrived; the Rebels ran away  and some twenty-four slaves were freed. Sitnalta later compiled a report on this event, theorizing that Piran would want to slave the three Rebels he had fought that day.\nToxis also worked along with Rebel saboteur Thar'quan, a Defel spy who was operating undercover as a miners for Hctaqsas Metals. During his time with Toxis, Thar'quan suffered injuries in the line of duty. He would later show proudly the scars of his time with Toxis.\nIn times of the New Republic, Toxis was a Lieutenant Commander of the New Republic Special Forces. Former Alliance operative Ma'w'shiye made an attempt on Toxis' and on several other officers' lives, including Lochner and Sitnalta among others. They survived and became three of the leaders of a SpecForces team formed to track down Ma'w'shiye.\nAlso in times of the New Republic, Toxis was known to have the loyalty of Svivreni miner Mihalik, formerly an extraction manager for Toxis Metals and fugitive.\nSasnak Toxis was first mentioned in the entry about Thar'quan on datapage 46 of Cracken's Rebel Operatives, a roleplaying game book published by West End Games in 1994. That particular datapage was written by Craig Robert Carey with J. Michael Denbo.\nThis character is called \"Sasnak Toxis \" in Cracken's Rebel Operatives and misspelled \"Sasnaq Toxis \" in Star Wars Adventure Journal #10. \"Hctaqsas Metals\" was the name of the corporation where Toxis' ally Thar'quan was working at in Cracken's Rebel Operatives, but the source does not specify whether Toxis also worked there or not.\nWhen talking about Mihalik, Star Wars Adventure Journal #10 also mentions a company called \"Toxis Metals,\" without specifying if it is related to Sasnak Toxis.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Defel/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Special_Forces/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Chordak",
  "/wiki/Colonel/Legends",
  "/wiki/Caleb_Hctaqsas",
  "/wiki/Slavery/Legends",
  "/wiki/Corulag/Legends",
  "/wiki/Thar%27quan",
  "/wiki/Hctaqsas_Metals",
  "/wiki/Lieutenant_Commander/Legends",
  "/wiki/Ma%27w%27shiye",
  "/wiki/Miner/Legends",
  "/wiki/Mihalik",
  "/wiki/Lieutenant/Legends",
  "/wiki/Alton_Lochner",
  "/wiki/Commander/Legends",
  "/wiki/Derembus_Sitnalta",
  "/wiki/Talas_Piran",
  "/wiki/Prefect/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Svivreni",
  "/wiki/Toxis_Metals",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Roleplaying_game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Craig_Robert_Carey",
  "/wiki/J._Michael_Denbo",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}