{
 "name": "Sata Neek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tibrin"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Oridol Cluster"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ishi Tib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Riot Squadron",
      "Riot Squadron",
      "New Republic",
      "Riot Squadron",
      "Riot Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Sata Neek was an Ishi Tib male who served in the New Republic's Riot Squadron. Neek fought in the Battle of Endor and continued to serve in Riot Squadron until the Attack on the Hellion's Dare, where he was killed by pilots of the 204th Imperial Fighter Wing. He was good friends with Wyl Lark.\nSata Neek was born on the planet Tibrin. At some point, he joined the Alliance to Restore the Republic as an A-wing pilot. Sata Neek participated in the Battle of Endor and survived to see the rise of the New Republic. He went on tour to celebrate with his friends from Riot Squadron and go on scouting missions with the Hellion's Dare. He became close friends with and a mentor to the young Wyl Lark. Sata Neek remained with the squadron until his death in the Oridol Cluster. After surviving the majority of the chase through the Oridol Cluster, surviving to learn some of the tactics of the pilots, including Snapper, Blink, Char, the Twins, and others. He was around for the deaths of most of his comrades, and he died in the final battle between the 204th Imperial Fighter Wing and Riot and Hound Squadrons, being shot down by one of the TIE pilots right before the battle ended and the Hellion's Dare was destroyed. His death greatly impacted Wyl Lark.\nSata Neek was a dramatic storyteller despite many of his stories being false or made up. He was prone to boasting about his piloting skills and exaggerating stories and his own abilities. He was known to be kind and a good friend, particularly with his comrades in arms.\nSata Neek was shown to be a capable fighter pilot, being one of the last survivors in the Attack on the Hellion's Dare.\nSata Neek flew an A-wing for the Alliance to Restore the Republic, and afterwards the New Republic. The vessel got him through much of the Galactic Civil War, until his death in 4 ABY.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Tibrin",
  "/wiki/4_ABY",
  "/wiki/Oridol_Cluster",
  "/wiki/Ishi_Tib",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Riot_Squadron",
  "/wiki/New_Republic",
  "/wiki/Squadron",
  "/wiki/Battle_of_Endor",
  "/wiki/Attack_on_the_Hellion%27s_Dare",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Wyl_Lark",
  "/wiki/A-wing",
  "/wiki/Hellion%27s_Dare",
  "/wiki/Death",
  "/wiki/Garl_Lykan",
  "/wiki/Palal_Seedia",
  "/wiki/Char",
  "/wiki/Hound_Squadron",
  "/wiki/TIE_pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Standard_month",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}