{
 "name": "Sateen Vestswe",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Organa",
      "Galactic Republic",
      "Alderaanian delegation",
      "Alderaanian delegation"
     ]
    }
   ]
  }
 ],
 "content": "Sateen Vestswe was a human male who served as an aide to Senator Bail Organa of the planet Alderaan during the Clone Wars between the Confederacy of Independent Systems and the Galactic Republic. In 19 BBY, he walked with Organa through one of the corridors of the Tantive III, Organa's consular ship, as the senator spoke about aiding the Jedi following the Republic's issuing of Order 66.\nSateen Vestswe was a human male who served as an aide to Senator Bail Organa of the planet Alderaan, who was a member of Alderaan's House of Organa and part of the Senate of the Galactic Republic's Alderaanian delegation. Organa was a member of the Delegation of 2,000 during the Clone Wars between the Republic and the Confederacy of Independent Systems, meaning that Vestswe needed to be loyal and willing to keep many secrets in order to protect the senator during such dangerous times.\nIn 19 BBY, Vestswe was on board the Tantive III, Organa's consular ship, as it took off from the planet Coruscant shortly after the Republic issued Order 66, condemning all members of the Jedi Order as traitors. Vestwe walked down one of the ship's corridors toward the bridge with Organa, Captain Raymus Antilles, and fellow aid Sheltay Retrac as the senator spoke about trying to intercept some of the surviving Jedi before they walked into a trap. Organa then went on to aid Jedi Master Obi-Wan Kenobi and Grand Master Yoda.\nVestswe had light skin, green eyes, and brown hair.\nWhile on the Tantive III, Vestswe wore a green tunic with a gray jacket, black pants, black boots, and a brown belt where he holstered a Kueget LN-21 blaster pistol.\nSateen Vestswe was portrayed by Scott Mewett in the prequel trilogy film Star Wars: Episode III Revenge of the Sith, which was released on May 19, 2005. The character's scene was filmed on Stage 7 at Fox Studios, Sydney on July 24, 2003. Vestswe was to appear in an additional scene that was cut from the film in which he and Organa found security on Coruscant increasingly hard to bypass while speaking with a member of the Senate Guard. The design of Senator Zinn Paulness in the Star Wars: The Clone Wars television series was based on Vestswe.\nIn the current Star Wars canon, Vestswe was identified in the 2017 reference book Star Wars: The Visual Encyclopedia. The name originated in the Star Wars Legends continuity, where it was first used in Dressing a Galaxy: The Costumes of Star Wars, a reference book written by Trisha Biggar and published on October 11, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sateen_Vestswe",
  "/wiki/Sateen_Vestswe/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_of_Organa",
  "/wiki/Galactic_Republic",
  "/wiki/Alderaanian_delegation",
  "/wiki/Aide",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/19_BBY",
  "/wiki/Tantive_III",
  "/wiki/Starship",
  "/wiki/Jedi",
  "/wiki/Order_66",
  "/wiki/Galactic_Senate",
  "/wiki/Delegation_of_2,000",
  "/wiki/Time",
  "/wiki/Coruscant",
  "/wiki/Jedi_Order",
  "/wiki/Bridge_(starship)",
  "/wiki/Captain",
  "/wiki/Raymus_Antilles",
  "/wiki/Sheltay_Retrac",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Kueget_LN-21_blaster_pistol",
  "/wiki/Scott_Mewett",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/May_19",
  "/wiki/2005",
  "/wiki/Fox_Studios,_Sydney",
  "/wiki/July_24",
  "/wiki/2003",
  "/wiki/Senate_Guard",
  "/wiki/Zinn_Paulness",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Legends",
  "/wiki/Dressing_a_Galaxy:_The_Costumes_of_Star_Wars",
  "/wiki/Trisha_Biggar",
  "/wiki/October_11",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Sateen_Vestswe",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith",
  "/wiki/April_24",
  "/wiki/2022"
 ]
}