{
 "name": "Satine_Kryze",
 "display_name": "Satine Kryze",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kalevala"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.77 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "House Kryze",
      "Clan Kryze",
      "Clan Kryze"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "New Mandalorians",
      "Mandalorian Government Council",
      "Mandalorian Government Council",
      "Galactic Republic",
      "Council of Neutral Systems",
      "Council of Neutral Systems",
      "Mandalore resistance"
     ]
    }
   ]
  }
 ],
 "content": "Satine Kryze, a human female Mandalorian, was the Duchess of Kalevala and the pacifistic ruler of the New Mandalorians and the planet Mandalore during the final decades of the Galactic Republic. Believing that change was Mandalore's only hope for a future, she longed to move her people beyond their violent warrior history. Although Mandalore prospered under her leadership, her goals made her a controversial figure and she faced opposition from Mandalorian groups who rejected her peaceful ideology. As the widespread Clone Wars raged across the galaxy, Kryze attempted in vain to keep Mandalore out of the conflict. One of the primary and most vocal critics of the war, she fought against the rising extremism and militarism that threatened her world. The burden of peace cost Kryze nearly everything as the war continued, and she ultimately fell victim to the forces that conspired to take her down.\nA major advocate of the New Mandalorian movement in her youth, Kryze became the leader of Mandalore following the Mandalorian Civil War between the reformist New Mandalorians and the Mandalorian warriors of tradition. The war cost an immense loss of life, and Kryze led Mandalore through reconstruction, helping the planet rebuild into a peaceful society. Her actions continued to face opposition from insurgent groups, most actively the terrorist group Death Watch, among whose members was Kryze's estranged sister Bo-Katan. While Mandalore maintained its peace and prospered under Kryze, the Republic began to fracture and entered war with the Confederacy of Independent Systems. Kryze chose not to choose a side in the conflict, making sure that Mandalore was neutral and becoming the leader of the Council of Neutral Systems. This move earned Kryze criticism from both the Republic and Confederacy, both of whom considered Mandalore to be a crucial asset to their war efforts.\nThe Clone Wars tested Kryze's leadership to its limit, with her planet facing supply shortages and an increase in terrorist activity by Death Watch. The threat of Death Watch led the Republic to consider occupying Mandalore, but Kryze knew that the Republic had, in reality, wanted access to the system and that an occupation would only bring the war with it. Despite political setbacks, assassination attempts, and even an arrest warrant being levied against her, Kryze managed to appeal to the Republic Senate and halt the occupation before it could begin. Kryze's efforts also brought about the end of the Death Watch threat for a time. Mandalore continued to face issues as the war continued, with the growing presence of a black market on the planet and corruption among Kryze's fellow leaders. Kryze's defense of neutrality alienated her from the Republic and, although not many, she managed to find allies to help her deal with the crises, including her close friend, Jedi Master Obi-Wan Kenobi, with whom she had a complicated past.\nAs the war raged on, Death Watch became affiliated with the rogue Sith Lord Maul, who brought together several crime families to aid them in defeating Kryze once and for all. Known as the Shadow Collective, Maul led Death Watch leader Pre Vizsla and their militia to Mandalore's capital, tearing through the city and causing chaos. Kryze was deposed and arrested, though infighting among Death Watch brought about the death of Vizsla by Maul's hand as well as the defection of Bo-Katan. Bo-Katan freed Kryze from prison, and the two reconciled in order to find a way to rid Mandalore of Maul. The rescue was short-lived, though before her recapture Kryze was able to contact Kenobi on Coruscant. Maul, having a lust for revenge against Kenobi for an incident from years earlier, murdered the captive Kryze in front of the Jedi. Kryze died in Kenobi's arms, proclaiming her love for her friend as her government lay in ruin and Mandalore's era of peace and pacifism ended.\nSatine Kryze was a Mandalorian born to Duke Adonai Kryze on the Outer Rim world of Kalevala, into Clan Kryze under House Kryze. Satine was the sister of Bo-Katan, and the two shared a nephew named Korkie, with whom Satine was very close. At a young age, Kryze was brought to the homeworld of the Mandalorian people, Mandalore. Living on Mandalore during her early life, she took her first steps and spoke her first words on the planet and was alive at a time where she was able to experience some of Mandalore's grass plains and wildlife before they became ravaged by wars. One of Satine's oldest and closest friends was Prince Tal Merrik of Kalevala.\nAs she grew up, Satine received an education and lived a relatively normal childhood despite Mandalore's conflicts. Mandalore was a planet with a long and violent history of warring factions both internal and external, but after centuries of countless wars and the environmental decline of their homeworld, many Mandalorians believed that change was needed. With warfare become increasingly advanced and destructive, Mandalore suffered and the planet's native biodiversity all but ceased to exist. Mandalorian culture was dominated by clans, and rivalries between these groups could prove brutal and long-lasting. The harsh reality of their once-beautiful world led many Mandalorians to alter their attittudes on their ancient traditions and look to reform as a way of saving their society.\nBy Kryze's time, there was a rising group birthed in the city of Sundari known as the New Mandalorians, which sought to reform Mandalorian society along peaceful lines by channeling the culture's best aspects away from self-destructive warring. Kryze, believing that Mandalore needed to change in order to have a future, was a major proponent of the New Mandalorians. While still young, Satine began working with the political faction to help create a constructive future for her people. Kryze's ideology was in stark opposition to more conservative-minded individuals on Mandalore who wanted to preserve the old ways and continue the Mandalorian custom of waging war for the glory of their world.\nThe New Mandalorians realized that this expertise in warfare was of no lasting benefit to the majority of Mandalorians and would only lead Mandalore further towards its destruction. With support from most Mandalorian citizens, the group gradually began to grow in strength in order to challenge the minority of traditional warriors. These traditionalists used violence to hold on to power as Kryze rose to prominence and became the de facto leader of the New Mandalorians. Kryze's goals and aspirations drove a wedge between her and Bo-Katan, who believed in embracing Mandalore's martial past.\nIn the year 42 BBY, as the New Mandalorians increased in strength and became a major political and ideological force on Mandalore, a civil war broke out between the reformist movement and the traditional Mandalorian warriors for control of the planet, with Satine's ascension to the leadership of the New Mandalorians being a major catalyst. The war decimated the already-damaged surface of Mandalore, and the capital city of Keldabe was devastated. Among the many casualties of the war was Satine's father. In the aftermath of his death, Satine was recognized by her title of nobility as the Duchess of Kalevala.\nAs the violent conflict grew, the traditionalists sent bounty hunters after Satine to eliminate her. With these mercenaries tracking her every move, the Galactic Republic, which had long coexisted with Mandalore through treaties, decided to intervene and sent Jedi Master Qui-Gon Jinn and his apprentice, Obi-Wan Kenobi, to protect the young duchess from her enemies. The increasing threats against Satine left Jinn with no choice but to relocate her offworld, and the trio escaped Mandalore to go into hiding. They remained on the run with no certainties about what the next day would bring for nearly a year. At some point, they were attacked by a swarm of venom-mites on Draboon, and Obi-Wan carried Satine to safety. Unfortunately, the chivalric act was tarnished somewhat as the Padawan accidentally fell and dropped her unceremoniously, leaving her with a permanent scar from the fall.\nDespite the extreme circumstances and the short time they spent together, Satine and Obi-Wan began to develop feelings for each other, and she shared with him her wishes for a peaceful Mandalore. During their time together, she also gave him the nickname \"Ben,\" and they fell in love, but neither acted on their emotions when they had the chance. Eventually, the New Mandalorians managed to defeat the martial traditionalists, and Satine was allowed to return to Mandalore. The death toll wrought by the war was immense, and the young duchess was left with the difficult task of rebuilding her world. Although Obi-Wan would have left the Jedi Order to stay with Kryze, both he and the duchess set aside their feelings with deep regret to return to their duties. They each had a difficult time processing the end of their relationship, both feeling remorse and relief at their respective choices not to carry on their unlikely romance.\nA short time before the Naboo Crisis, Jinn referenced Obi-Wan and Satine's relationship while he and his apprentice were reading tax reform bills from the Galactic Senate. He was bothered by Obi-Wan's seeming indifference to labor and trade disputes and used his apprentice's romance with Satine as a rebuke against treating such things trivially. Obi-Wan, understanding his master's intention, quickly changed the subject away from Kryze.\nThe victors of the war, Duchess Satine and the New Mandalorians were recognized as the rulers of Mandalore. After Kenobi and Jinn left Mandalore, Satine began work on the challenging task of rebuilding following the damages caused by the war alone. The considerable number of deaths had left Satine with a fierce hatred of violence, and she became a staunch pacifist. Likewise, many New Mandalorians adopted a similar pacifistic viewpoint. The surviving traditionalists were exiled to the Mandalorian moon of Concordia, where infighting for dominance led many to believe that they had died out. Sundari became the new capital of Mandalore and a memorial to those who died during the war was established at Peace Park.\nUnder Kryze's regime, the brutal warfare between Mandalorian clans ceased and power was coalesced into the New Mandalorian government. Kryze reformed the government of Mandalore into a cabinet of ministers known as the Mandalorian Government Council, who were each charged with governing different aspects of the planet. Although Kryze oversaw the workings of the ministry, the body itself was chaired by a Prime Minister. By the time of the Clone Wars, the position was occupied by Almec. While Mandalore was under the direct jurisdiction of the Ruling Council, the other planets and moons of the Mandalore sector became provinces and were led by various acting governors. Although no longer the dominant political force on Mandalore, clans continued to hold cultural significance.\nAs part of a push to do away with the internal warring that had brought Mandalore to near-destruction, Duchess Satine looked to phase out the violent traditions that had led to the civil war. Kryze outlawed many ancient Mandalorian weaponry and practices, such as the use of mobile vaults as a form of imprisonment. Although Kryze opposed Mandalore's violent ways, she and many adherents of pacifism still practiced much of their culture's nonviolent customs. One of few martial practices to see continued use under the New Mandalorians was the tradition of the Protectors, a group of elite warriors who were charged with the protection of the Mandalorian ruler. As such, they formed the personal guard of Duchess Satine. Unlike the Mandalorian clans of old, the Protectors were trained to show restraint when possible, in keeping with Kryze's philosophy. Though most Mandalorian clans recognized Satine's rule and her laws despite the removal of violence from their traditions, several were not convinced of the New Mandalorian ideals and continued to cling to their older heritage, in thought if not in deed.\nUnder Satine's rule, Mandalore prospered and turned into a modern and peaceful society. However, her reforms were actively opposed by a group of conservatives known as the Death Watch, which formed from the last remaining insurgents of the civil war. Despite their banishment and infighting, remnants of the traditionalists secretly rebuilt their strength to overthrow the duchess and reclaim Mandalore. The Death Watch considered Kryze and her pacifist ideals unworthy to rule Mandalore, especially in the wake of her father's death. Their machinations saw them seek to infiltrate the New Mandalorian government, and they used fear tactics to recruit individuals from throughout the Mandalore sector to their cause. Death Watch's attacks on Satine's government had limited success in swaying public opinion, however, and throughout much of her reign, the duchess and her ideals were popular among the people of Mandalore. Aware of the Death Watch's activities, Satine assigned several officials she trusted, such as Prime Minister Almec and Concordia Governor Pre Vizsla, to investigate and root out the movement. Kryze was also aware that her estranged sister had joined the violent splinter group.\nMandalore continued to flourish under Duchess Satine's rule despite the Galactic Republic's increasingly fragile state. A crisis emerged as several thousand dissatisfied member systems of the Republic absconded from the government and joined the nascent Confederacy of Independent Systems, prompting a militarized response from the Republic that led to the outbreak of full-scale war with the Battle of Geonosis in 22 BBY. Early into the war, trade and supply routes became a point of contention and Kryze introduced rationing policies to her world, with Prime Minister Almec in charge of overseeing their implementation.\nDespite being officially a member of the Republic, Kryze was adamant in keeping Mandalore out of the conflict and declared neutrality for her planet and her people, determined to avoid allowing her people to endure another war. Duchess Satine was not alone in her stance, and she entered dialogue with other like-minded systems across the galaxy. As a result of these talks, Kryze helped establish the Council of Neutral Systems, a group of over 1,500 star systems that wished to stay neutral. As the designated regent of the organization, Satine was a leading advocate for their position of neutrality as well as the primary representative in negotiations with the Republic Senate. As a result, Mandalore and its fellow neutral systems could technically remain part of the Republic and enjoy economic relations with the government but offer no support to the war effort.\nSticking to her pacifist ideals proved difficult for Satine during the galactic war, and she found herself facing threats from various angles. Kryze and her government tried to downplay and minimize the influence of Death Watch as the exiled insurgents began increasing their activity. Her choice to declare neutrality drew the ire of both the Republic and the Confederacy, as both governments viewed Mandalore space as a vital key to their war strategies. Many in the Republic saw the Mandalore sector as a key component in the war effort given its location between the Republic capital Coruscant and the Outer Rim along the Hydian Way. From her palace in Sundari, Kryze gave speeches promoting principles of de-escalation and non-intervention in efforts to recruit star systems into the Council of Neutral Systems. Satine's animated speeches were reported on by Republic news outlets, such as HoloNet News, who featured panels of analysts discussing her actions and criticizing her as a Separatist agent.\nKryze's firebrand activism earned her notoriety across the galaxy, and her speeches were often shown on the Holonet alongside those of Supreme Chancellor Palpatine of the Republic and Confederate Head of State Dooku. Among those who witnessed her speeches was Obi-Wan Kenobi, now a Jedi Master and member of the Jedi High Council. Since the Mandalorian Civil War, Kenobi had kept tabs on Satine's career, both because he cared for her as an old friend and out of concern, having seen firsthand the volatile situation in which she had risen to power. Kryze had apparently kept up on him in kind, which Kenobi began to suspect after watching her speak in a live broadcast from the Royal Palace. In her speech, she denounced extremism and called for de-escalation of the conflict, but seemingly quoted words Obi-Wan had publicly given in favor of the Republic during a mission on Cato Neimoidia, although with an altered message advocating for nonviolence.\nIn addition to what she saw as extremism in the Republic and Confederacy, Kryze began opposing the actions of the Jedi Order, which had become politicized over the years and emerged as the leaders of the Republic's military. Initially, Satine managed to hold both the Republic and Confederacy at bay and spread the message of the Council of Neutral Systems. The neutrality of the New Mandalorians would become endangered, however, when the increasingly resurgent Death Watch tipped the scales against the duchess. Both the New Mandalorians under Kryze and the Death Watch opposed a Republic presence on Mandalore, and as Death Watch began targeting Republic forces, rumors started circulating that Satine was building an army for the Confederacy.\nThe rumors that Kryze was building an army for the Confederacy boldened following a Death Watch attack on a Republic cruiser. The terrorist in question was seen by holographic feed wearing traditional Mandalorian armor, and the Jedi High Council dispatched Obi-Wan Kenobi to meet with Kryze and investigate the situation in response. Upon arriving to Sundari, Kenobi traveled to the Royal Palace and was greeted by Prime Minister Almec in the Grand Salon. Duchess Satine, accompanied by her Protectors and Merrik, who now served as Kalevala's senator in the Republic, entered the room as the two discussed the situation and quipped about Obi-Wan's return to Mandalore to see her again. Kenobi complimented her beauty, but Kryze rebutted his kind words, which she believed were coming from someone accusing her of treachery. The Jedi told Kryze that he wouldn't personally believe that she'd commit wrongdoing and proceeded to show her court the hologram of the terrorist attack.\nKryze, Almec, and Merrik asserted to Kenobi that no Mandalorians in their government would commit such an atrocity. When asked what happened to the perpetrator, Kenobi informed them that he had committed suicide in order to avoid arrest. Kenobi began talking of the ancient Mandalorian wars against the Jedi, but Kryze interjected and bluntly told him that her people were trustworthy. Despite Merrik's attempts to ease the conversation, Satine expressed her belief that Kenobi's investigation was a means for the Galactic Senate to intervene in Mandalore's affairs. Obi-Wan corrected her that it was the Jedi Council who authorized his mission and, recognizing her oversight, Kryze calmed down and invited him to join her on a walk around the city, which he accepted.\nKryze and Kenobi traveled to Peace Park, where Kryze told the Jedi that she was glad to see him again. Kenobi complimented what she had accomplished as the leader of Mandalore, telling her that her peaceful ways had paid off in the long run. Satine, however, told him despite her government's efforts, there were still those who opposed progress, specifically the Death Watch. She told Kenobi that she believed they could be who he was looking for but assured him that she had officials working to root them out. Kenobi asked how widespread the Death Watch movement was, but Kryze refuted his use of the word \"movement\" and instead suggested that they were no more than a group of vandalists who did nothing more than target public places. She informed him that she had officials working to root them out who had tracked the terrorists down to Concordia and would soon have them in custody.\nAs Satine and Obi-Wan continued their walk down Peace Park, their conversation became less formal and they began discussing their different views on peacekeeping in the face of galactic war. Kenobi opined that the job of a peacekeeper was to be on the front lines of conflict to solve the issue firsthand. The duchess disagreed and instead told Kenobi that the work of a peacekeeper was to ensure that conflict didn't have the opportunity to arise in the first place. Obi-Wan commented that her belief was noble but not entirely realistic. Using his words against him, Kryze took aim at the Jedi Order's insincere justifications for promoting violence in the name of peace. She rhetorically asked if the \"reality\" he believed in was what made the Jedi abandon their ideals, or if it was just a way for the Order to gain political power.\nAs the two old friends approached the civil war memorial, the shrine exploded. The blast knocked down several civilian bystanders and destroyed much of the shrine's spire. Kenobi immediately asked Kryze if she was alright, but she brushed off her safety and ran to help the injured. As she helped one man to his feet, Kenobi told her that a group of vandalists were incapable of arranging an attack of that scale. Kryze rebutted that it must have been the work of an offworlder, but a hologram marker at the base of the memorial showing the symbol of the Death Watch proved her wrong. Kenobi decided to take charge and ordered the Protectors to take Satine back to the palace and to keep all civilians present at Peace Park at the scene for interviewing. While Obi-Wan helped the duchess to her guard, one bystander broke from the crowd and began running away.\nKenobi chased after the fleeing man, with Kryze following close behind. Obi-Wan cornered the man on a balcony overlooking the lower levels of the park. After a brief skirmish between the two, Satine arrived, and the Jedi yelled at her to stand back. The bomber stood on the balcony ledge, then yelled in Concordian and fell backward onto the glass walkways below. Kryze ran to the edge and looked over, wincing at the sight of the man writhing on the cracked floor. Accompanied by Obi-Wan, Satine descended to the next level, where she approached the dying man and took his hand in hers. He spoke to her in his language, and she whispered back in kind, comforting him in his final moments. Obi-Wan questioned what they had said to each other, but Kryze declined to tell him and simply responded that he had been speaking in the Concordian dialect.\nHaving recognized the terrorist as a Concordian, Kryze and Kenobi decided that it would be best to investigate Concordia and find the Death Watch before they could carry out another attack. Kenobi's initial plan was for him to accompany the body to the moon alone, but Kryze pointed out that, since both Concordia was a province and Kenobi was implicated in the death of a Concordian, he would make little progress without her presence. The two arranged a transport and left Sundari for Concordia. En route to the moon, Kenobi asked Satine whether or not it was an agricultural world as he believed it to be. Kryze explained that, prior to the last Mandalorian war, the moon had been converted into a mining-based economy at the cost of the native forests, which had recently begun growing back as the mining facilities shut down.\nThe ship landed at the government complex, where Satine and Obi-Wan met a welcoming party led by Governor Vizsla. Kryze introduced the Jedi to the governor, who she identified as one of the leading officials in the investigation of Death Watch. After the terrorist's body was unloaded from the ship, Vizsla bade farewell to Kenobi and left to attend to the body. Satine began to follow him but was stopped by Obi-Wan, who asked her to keep Vizsla occupied during their scheduled dinner. The duchess asked where he planned on going, and Kenobi replied that he was interested in looking at the mining facilities in private. He gave Kryze an earpiece so they could stay in contact if anything went wrong, then mounted a speeder bike. Satine mockingly asked Obi-Wan not to create problems where none existed, and he sped off from the hangar in search of the mines.\nAs Obi-Wan searched Concordia's abandoned mines, Kryze went to meet with Governor Vizsla in his dining room, where he was writing a condolence letter to the dead man's family and making final arrangements for the body. Satine lied to Vizsla about Kenobi, telling him that the Jedi would join them later because he needed time to meditate. As the two had drinks before dinner, Kryze questioned why the rumors that she was amassing an army were spreading and who would have anything to gain from them. Vizsla responded that it was the Death Watch, but Satine told Vizsla that she believed an external force was behind Death Watch's growing campaigns. The governor suggested that it was the Confederacy and joked that Kryze should take it as a compliment that someone powerful was working toward her downfall.\nMeanwhile, Obi-Wan discovered that one of the supposedly defunct mines was completely operational and had been used to develop Mandalorian weapons and armor. As he continued his search, he was attacked by members of the Death Watch and placed suspension over a production line. When he came to, he contacted Kryze and told her of his situation. In order to keep herself inconspicuous, Satine responded to him simultaneously with Vizsla. Kenobi instructed her to take a speeder and follow the tracking beacon on his comlink. Governor Vizsla noticed that something was off, but Satine managed to leave the dining room by telling him that she needed fresh air. Once out of the room, Kryze ran to the hangar and mounted a bike, then sped off to find Obi-Wan.\nSatine parked her speeder at the mine entrance, then hurried into the complex. She contacted Kenobi and asked him where he was, and he sarcastically told her to follow the sound of the loud machinery on the production line about to crush him. When she found the room he was being held in, Kryze set off a disturbance alarm using a control box. The duchess snuck into the room as the Death Watch guards left to find what had tripped the alarm. There, Satine found Kenobi drawing closer to the rock crusher, and the two argued as she deactivated the machine. Before she could release Kenobi from his suspension, however, the two Death Watch soldiers returned and grabbed hold of her. As Satine fought back, Kenobi called out to her as he was about to be dropped into a grinder. Kryze kicked a barrel onto the grinder, jamming it, and Obi-Wan jumped from the production line and knocked out the soldiers.\nBoarding an elevator, Satine continued her running argument with Kenobi about peacekeeping, mocking Obi-Wan for being so eager to hurt the soldiers despite supposedly being a man sworn to nonviolence. The two bantered until the elevator stopped, revealing a Death Watch warrior standing guard. Kenobi quickly took him out, only for him and Satine to realize that they had entered a Death Watch camp. A large group of the terrorists noticed the duo and opened fire. Kryze and Kenobi took cover behind a large boulder, and the Jedi stated that they would have to stand and fight before joking that, in Satine's case, she would just have to stand. Since the two soldiers in the mine had taken his lightsaber, he used a blaster from the guard he knocked out to fire at a trio of Death Watch members flying towards the boulder on jetpacks, making quick work of them.\nAnother warrior tackled Obi-Wan, but Kryze distracted him by throwing a stone at him. The soldier fired at Satine, who dodged the blasts and hid behind the boulder while Obi-Wan took him down. Kenobi rushed to ask if Satine was alright, which she confirmed. While the two maintained their cover, another group of Death Watch, led by their leader, advanced towards the boulder. The leader, who was in possession of Kenobi's lightsaber, removed his helmet, revealing that he was Governor Vizsla. Vizsla tossed Kenobi his lightsaber and told the Jedi that Kryze had tarnished the Mandalorian name and gave him a chance to defend her. Vizsla unveiled the Darksaber, an ancient Mandalorian weapon, and engaged in a duel with Kenobi, who managed to beat the governor back.\nBeaten by Kenobi, Vizsla ordered his soldiers to kill the Jedi. Three Death Watch warriors fired missiles at Obi-Wan, who easily dodged them, only for the projectiles to turn and retarget him. Obi-Wan called for Kryze, who he grabbed before jumping down the elevator shaft. The missiles made an impact inside the shaft, narrowly missing Satine and Obi-Wan, who fell to the ground as they exploded. Having escaped Vizsla and the Death Watch, Kryze and Kenobi quickly escaped the mines and returned to their parked speeders. As Satine helped a limping Obi-Wan to his, she told him that they were on even terms, seeing as how they had each saved the other's life that day. Kenobi jokingly replied that his rescue had been the more daring of the two, and Satine rolled her eyes at his remark as they prepared to ride their bikes back to the city.\nIn the aftermath of the bombing at Peace Park, Kryze ordered that the civil war memorial be left in its broken state as a warning against pointless violence. With his role in Death Watch now known, Vizsla escaped surveillance and disappeared. Vizsla's disappearance interrupted the investigations into the scope of Death Watch and their operations, but their alleged affiliation with the Confederacy led many in the Republic, including Kenobi, to believe that Mandalore would have to openly side with the Republic to stop them. A proposed resolution in the Republic Senate would lead to a Republic invasion of Mandalore, despite the pre-existing treaties between the two. Kryze planned to travel to Coruscant to reassert her position of neutrality before the Senate and stave off the threat of an armed occupation of her world.\nDuchess Kryze departed Mandalore for Coruscant aboard her personal vessel, the luxury yacht Coronet. She invited several senators to accompany her on her aircraft, including two members of the Council of Neutral Systems, Senator Onaconda Farr of Rodia and Senator Kin Robb of Taris, as well as Senator Merrik. The other dignitary, Senator Orn Free Taa of Ryloth, was not a member of the neutral faction. In addition to Kryze's personal guard and the crew of the Coronet, a small detachment of clone troopers led by Obi-Wan and his former Padawan, Anakin Skywalker, rounded out the security forces on the voyage. Kryze did not want the Jedi and their soldiers on the ship, but they were stationed onboard at the behest of her guests. Kryze spoke with her retinue about her reasons for remaining neutral, citing her opinion that war in and of itself was an affront to life. Kenobi's support of occupation had made Kryze bitter with him, and the two became aggressive and argumentative about their opinions following the Coronet's departure..\nKryze opined heavily that the Jedi were no longer peacekeepers, which Kenobi argued against in response. The duchess saw Kenobi's reasoning for the Jedi's involvement in the war to be contradictory and hyperbolic, whereas Kenobi saw Kryze as a dreamer who only listened to those who agreed with her. Despite Skywalker and Senator Taa's efforts to settle the arguing, the two remained at aggressive odds. As the arguing became a standoff, Senator Merrik suggested that they put aside politics and went to dinner. Both Kryze and Kenobi gave in, and Kryze pushed Kenobi out of her way as she left the room.\nMeanwhile, in the cargo bay, two clone troopers went missing. The search team found a large shipping container knocked over and open with the contents missing. Kenobi reported to the dining room, where he asked Kryze and the accompanying senators to stay where they were until the situation was solved. While Satine and her guests stayed tensely seated at the dining table, Anakin contacted Kenobi and told him that he and the clones had located assassin probes in the cargo bay, and that one of the droids was heading up the lifts to the dining room. Obi-Wan ordered Kryze and the senators to stand back from the lift. The droid violently entered the room and killed two of Satine's Protectors, though Kenobi managed to disable it before it could reach Kryze and her court, who were backed against the dining room's large bay window. The brief moment of peace was broken quickly when smaller probe killers were ejected from the larger droid and started crawling towards towards the duchess and her retinue.\nWhile Obi-Wan did what he could to keep the droids away from the senators, Kryze took out a small but powerful deactivator pistol and fired at the probes. Kryze and Kenobi stood back-to-back as they took out the droids, easily shifting position in conjunction with each other. Kenobi questioned why Kryze was carrying a deactivator. Kryze defended herself by saying that, despite being a pacifist, she was still willing and able to defend herself, to which Obi-Wan joked that her contradiction made her sound like a Jedi. Once the droids were all destroyed, Kenobi reminisced about the swarm of venom-mites he and Kryze had encountered on Draboon during the Civil War. Kryze said that she remembered the incident and teased Obi-Wan about how he had dropped her, mentioning that she still had the scar.\nSkywalker soon found from the cargo manifest that the container that held the assassin probes had been authorized to board the Coronet under the stamp of the Senate. Using this information, he and Kenobi deduced that one of the senators had ordered the crate onto the ship. Kryze and the senators, meanwhile, had reconvened for dinner. Senator Taa noticed that Kryze was not eating, and she explained that she had lost her appetite. Kenobi soon arrived carried a dish that Taa believed to be dessert, but Kenobi revealed that he was carrying one of the small probe killers under a glass. Kenobi explained that he believed the droid would attack the duchess and everyone besides the senator who had the droids brought onboard the ship. Kryze objected to Obi-Wan's use of interrogation, but he assured her that the situation was under control.\nKenobi walked around the table, where the droid displayed hostility towards Senator Farr, Senator Robb, and Kryze, but did not react to Senator Merrik. Merrik knocked the tray out of Kenobi's hand, freeing the probe. The droid scurried towards Kryze, but Kenobi used a plate to bat it away. The droid attacked Senator Farr, who panicked as Kenobi sliced it in two using his lightsaber. Using the disarray to his advantage, Merrik grabbed hold of Kryze and put a blaster to her head, then left the room with her as a hostage. Merrik brought Kryze to the bridge, where he mercilessly killed the crew. The traitorous prince took the ship out of hyperspace and contacted a Death Watch soldier. Merrik told the soldier that he had succeeded in kidnapping Satine, but that he would need help making his escape. The soldier in turn told Merrik that reinforcements were on their way. Three Confederate boarding ships entered the space around the Coronet. The ships, which were carrying B2 battle droids, lodged themselves into the Coronet's hull, where the droids were deployed.\nKenobi found Merrik and Kryze on the bridge, where he told the senator that he was under arrest. Still holding Kryze hostage, Merrik explained that he had wired the ship's engines to explode. Kryze pleaded with Obi-Wan not to try to free her when everyone on the ship's lives were at stake. Merrik left the room with the duchess, closely followed by Kenobi. Once they arrived at the Separatist boarding ships, Merrik sardonically told Kryze to say goodbye to Kenobi. Kryze, believing that it would be the last time she would ever see Obi-Wan, told the Jedi that she loved him and had loved him since their time during the Civil War. Though he didn't think it was the right time or place, Obi-Wan confessed that had she asked him to, he would have left the Jedi Order. Merrik was annoyed by the display, but as he started to leave, Kryze dug her heel into his foot and freed herself from his grip, taking his blaster in the process.\nMerrik simply mused that even if he didn't take Satine to the Separatists, he still had the engines wired. Merrik also took note of the fact that if either Kryze or Kenobi killed him, they would prove that they were a hypocrite and a murderer respectively. Confident in his victory, Merrik dared either one of them to strike him down and prove themselves a cold-blooded killer. Before he could push the button to destroy the ship, Merrik was killed by Skywalker. Kryze threw the blaster aside and approached Obi-Wan, but before she could speak, CC-2224 and the other clone forces arrived to inform the Jedi that the droids had been defeated. Satine solemnly told Obi-Wan that she had to return to the other dignitaries, and Kenobi responded that they would have to speak some other time.\nThe Coronet arrived at Coruscant soon after, where the ship docked on a landing pad. Republic Supreme Chancellor Palpatine was awaiting their arrival. The Chancellor greeted the senators as Kryze approached Kenobi. Kryze told Kenobi that it was ironic for them to be meeting again following the incident, only now once again on opposing sides. Kenobi brushed their opinions aside and told Satine that the needs of her people were what was most important, adding that they were in capable hands. Satine told Obi-Wan that his words were kind and came from a thoughtful and committed Jedi. Their arguing and confrontational attitudes gone, Kryze jokingly told Obi-Wan that she still wasn't sure about his beard. Kenobi nervously asked her what was wrong with it, and she replied that it hid \"too much of  handsome face.\" Kryze smiled at Obi-Wan and walked towards the Util-313 bus with the Chancellor and the senators.\nDespite being betrayed by Merrik, Kryze remained steadfast in her goal to keep the Republic from occupying Mandalore. On Concordia, a member of the Mandalorian guard located the new Death Watch base, where Pre Vizsla was mobilizing his forces to invade Mandalore in the event of a Republic occupation. Vizsla planned to strike once Republic forces arrived, becoming liberators in the eyes of the people. Meanwhile, in the Republic Senate, Kryze made her appeal to the Senate against a Republic invasion. Kryze's primary ally in her case was Senator Padmé Amidala of Naboo, who was opposed to the resolution as well. Supreme Chancellor Palpatine pushed for an occupation, using the bombing at Peace Park and Merrik's treason on the Coronet as the basis for his claims that Death Watch was a significant threat to the New Mandalorian government.\nKryze explained to the Chancellor that Death Watch was not strong enough to destabilize her government and that her forces were close to finding the leaders of the terrorist organization. Kryze reasserted her position of neutrality, knowing that occupation would only lead to more violence. Vice Chair Mas Amedda denounced her speech to be the talk of an idealist, but Kryze stated that her words, and by proxy the words of her people, came from a place of pacifism and non-violence. The Chancellor informed Kryze that his office had received a message that morning, adding that she would find it illuminating. Amedda played a testimony from Kryze's friend and Mandalore's Deputy Minister, Jerec, arguing that a Republic occupation was needed to stop Death Watch.\nKryze watched the testimony in shock, then ordered that the feed be stopped. Kryze told the Chancellor and Vice Chair that Jerec would not have gone on record advocating for a Republic intervention and went on to state that her government held no secrets from the Mandalorian people. The Chancellor continued the testimony, during which Jerec stated that Kryze's government was weak and that she acted out of pride. Kryze was quick to denounce his words and demanded to speak to Jerec immediately, but the Chancellor informed Satine that Jerec had been killed in a Death Watch bombing on Kalevala earlier that morning. Palpatine used Jerec's death as a rallying point for the occupation to the distress and opposition of Kryze. Despite her pleading, the damage was done and the Chancellor ended the session.\nAs she left the Senate building, Kryze was stopped by Obi-Wan, who had been present in the Senate chamber. Obi-Wan told Satine that he knew what had happened. Though she was grateful for his concern, Satine told him that she would be alright. Kenobi told her that he was still concerned, and went on to say that he didn't think she should make any decisions in her state of mind. Satine was confused by what he meant, and the Jedi explained that a person in her position would be hysterical, which infuriated the duchess. Kryze yelled at Obi-Wan, telling him that the Republic was attempting to impede on innocent people and that if more people were hysterical then they would be willing to speak up against the Republic as it trampled their rights. Kenobi softly told Kryze that her actions were foolhardy, again insulting the Mandalorian.\nSatine felt that Kenobi's words were ironic, noting that he was one to rush into battle without consideration as if on a crusade, pointedly telling him that he was, in her opinion, foolhardy. Upset and saddened by their encounter, Kryze boarded her airspeeder and departed. As Kryze's speeder left the Senate building, the navigation system failed and the transport lost control. The speeder had been wired by a Death Watch assassin sent to Coruscant to kill Satine. With the speeder accelerating and beginning to emit smoke, Kryze asked the pilot, Aramis, what was happening. Aramis ordered the Protectors on board to get Kryze off the speeder, then attempted to fly the craft closer to a platform ahead. Satine protested in fear of her friend's life, but the Protectors grabbed the duchess and prepared to jump. The Protectors formed a defensive circle around Satine, holding her in the middle to keep her from being harmed. Ignoring Satine's objections, Aramis flew the speeder as close to the rooftop as he could and the Protectors, holding Satine safe, jumped onto the building and rolled across the roof until they came to a stop. Kryze quickly got her bearings and stood up, only to see Aramis and the speeder hit a nearby building and explode.\nThe increasingly distraught Kryze met with the Chancellor and Vice Chair in a private meeting later, where Kryze was disturbed that no charges were to be filed against whoever compromised her speeder. The Chancellor, however, found there to be no evidence of tampering with the controls and instead suggested that it was simply an accident. Kryze argued that it couldn't have been an accident due to how it happened so shortly after her defense of neutrality. Amedda agreed with Kryze, though to her horror he twisted her words and made the case that Death Watch was out of control and that the Republic had to intervene immediately. Kryze protested the Vice Chair's misuse of her words but the Chancellor rendered her position useless, given that the resolution was no longer up for debate and was in the hands of the Senate. Kryze left Palpatine's office to head to the Ministry of Defense, where she planned on speaking to a contact of hers who had information that would stop the occupation from happening.\nOutside the Chancellor's office, she was immediately greeted by Obi-Wan, who had heard about her accident. Kryze expressed her disgust with the Chancellor and Vice Chair, but found no words to describe them. Kenobi persisted in asking if she was well, and she assauged him that she wasn't hurt in the accident, though added that she hadn't told him to keep him from worrying. Kenobi laughed and joked that she had failed to stop him. Both Satine and Obi-Wan agreed that the attack proved that Satine had enemies on Coruscant as well. Obi-Wan intuited Satine's intent to follow up on the accident herself, but she didn't waver to his protests and told him that Republic authorities were not reliable. Obi-Wan tried changing her mind about being so self-reliant, telling her that she didn't need to be alone. As Kryze tried to explain her feelings, Senator Amidala approached the two. Amidala told Kryze and Kenobi that the Senate had completed its vote on the resolution, and had decided in favor of occupation. Kryze was confused and asked when the vote, which was meant to happen the following day, took place. Amidala told the duchess that, after the attempt on her life, the Senate had accelerated the vote and decided its outcome during Kryze's meeting with the Chancellor. Kryze, extremely upset at the sudden revelation, despondently told Obi-Wan that she was right not to trust the Republic.\nKnowing that getting the information from her contact in the Ministry of Defense, Davu Golec, was the only way to halt the occupation, Kryze went undercover on the streets of Coruscant to meet him. In a back alleyway of Sector GL5, Golec found Kryze and gave her a tape he had found buried deep in the Evidence Facility of the Ministry. The tape was the original testimony from Jerec, which Golec explained had been tampered with and altered before its presentation to the Senate. Golec was fatally shot by the Death Watch assassin after handing Kryze the disc. Kryze took out her deactivator and looked around for the killer, but before she could find him she was surrounded by civilians and a police droid. The onlookers mistook her as Golec's murderer, and the droid reported the shooting and identified Kryze as the killer. Several police units arrived at the scene, but the terrified duchess ran before she could be arrested. Satine was pursued by both the police units and the assassin, who made attempts to shoot Satine as she ran. Using her deactivator, Kryze disabled the police droid, which fell and tripped the police following it as Kryze disappeared into a large crowd. Kryze ran into an alley, where she spotted a man getting into his speeder. Kryze used the departing man as a distraction; the police units saw Kryze enter the alleyway, then saw the speeder depart. Kryze managed to evade notice, and once she was in the clear she contacted Obi-Wan. Obi-Wan was again concerned for the duchess, who asked her friend for help.\nThe fugitive Satine evaded police notice while she awaited Obi-Wan's arrival. In the meantime, Vice Chair Amedda issued a public statement calling for the duchess to turn herself in to the authorities. Obi-Wan met with Satine at Monument Plaza, where the two sat back to back on a bench to avoid bringing attention to themselves. Obi-Wan asked Kryze to turn herself in, but Kryze handed him the disc and explained that it was the evidence she needed. They agreed that it had to be delivered to the Senate, but they deduced that it had been someone in the government who had doctored the recording and that it would be destroyed upon arrival if given to the wrong hands. Kryze suggested that Obi-Wan bring it to Senator Amidala, knowing that she was someone they could trust. Two clone police units started walking towards Kryze and Kenobi's position, so the two got up and reentered the city's alleyways. Kenobi asked Satine what she planned to do while he was in the Senate, and she explained that she would let herself be arrested. Obi-Wan immediately disagreed with her idea, but she assured him that it was the only way for him to enter the Senate building unnoticed.\nSatine reasoned that Kenobi would need a distraction so he could enter the Senate without being searched by the security forces, but he argued that he would be exempt from such probing because he was a Jedi. Kryze turned to him and told him that things were changing. Suddenly, the Death Watch assassin threw a detonator at the pair as they exited the alley. Seeing the bomb land between them, Kenobi used the Force to push Satine out of the blast radius and he fell to the ground from the explosion. The assassin walked towards Satine, who ran out into the street as Obi-Wan ignited his lightsaber and engaged the soldier in a fight. During the brawl, the assassin knocked Kenobi's lightsaber out of his hand while Kryze maneuvered around the conflict. Satine picked up Obi-Wan's lightsaber and tossed the weapon to him. Obi-Wan managed to subdue the assassin, who flew away in defeat on a jetpack. With the assailant gone, Kryze and Kenobi quickly left the scene and found a bus to the Senate building.\nOnce at the Senate, Kryze approached two guards stationed outside and surrendered herself. With the guards distracted, Obi-Wan entered the complex unnoticed, giving the duchess a quick nod as he walked through the doors. Kenobi managed to bring the disc to Amidala, who interrupted the current session finalizing the resolution to play the recording for the Senate. The undoctored testimony from Jerec proved to the Senate that the New Mandalorians did not need intervention from the Republic and restored faith in Satine's ability to lead. With the new information now in the hands of the Senate, an emergency session was called to revote on the resolution. The Senate rescinded its earlier approval of the occupation and Mandalore was allowed to remain a neutral state. The news that the occupation was no longer underway soon found its way to Vizsla and Death Watch, whose plans fell through and were no longer supported by the Confederacy.\nFreed from custody, Kryze met with Amidala, Kenobi, Skywalker, and the Chancellor and Vice Chair later at an informal meeting in the Chancellor's office. Palpatine and Amedda offered Kryze an apology on behalf of the Republic, but Kryze did not accept their apology wholeheartedly. As the others left the office to finish ratifying the Senate's decision, Kryze and Kenobi stayed behind to talk. Satine thanked Obi-Wan for all he had done, saying that his actions were what made things right, but the Jedi disagreed and told the duchess that it was her unshakeable faith and determination that stopped the occupation. Kryze questioned who was behind the mysterious factors of the situation, namely who had tampered with the recording and who had tried to convict her of murder. Obi-Wan didn't have an answer for her and simply told her that times were changing, repeating what she had said to him earlier.\nKryze's decision to stay neutral soon brought major ramifications to her people. Satine effectively became an outsider to the Republic at large and was given no aid as trade routes became disrupted by the war and Mandalore faced supply shortages and rising inflation. Kryze knew that smuggling had become an issue on the planet, and asked Senator Amidala to visit Mandalore to help in finding a way to alleviate some of the issues. Amidala's visit was excitedly awaited by the people of Sundari, who gathered outside the dockyard to cheer on the senator's arrival. Kryze wanted to welcome Amidala in private and met the senator as she departed her ship. The two began discussing the crisis. Kryze recognized that the Senate was reluctant to aid Mandalore, but was reassured by Amidala that there were still members of the senate sympathetic to Mandalore and willing to help.\nAs the two entered a speeder, Kryze asked that they put aside political discussion, as she wanted to surprise Amidala with the crowds gathered just inside the city. The crowds cheered on Kryze and Amidala, who made their way to the Royal Palace. Once at the palace, Kryze and Amidala began their formal business. The Ruling Council argued amongst themselves, unable to find a way to deal with the surge of black market dealings. Amidala noted to Kryze that Prime Minister Almec seemed overwhelmed, and Satine invited the senator to enter the discussion. The senator advised that they reject any illegal business dealings and trust in the Republic, but was quickly called a hypocrite, given that the Republic had their own issues with rising underworld operations. Satine was angered and embarrassed by the council's behavior and adjourned the meeting to let the tensions dissipate.\nKryze and Amidala later attended a private dinner in the palace. Kryze inquired about Amidala's personal feelings about the ongoing war. Amidala admitted that Republic propaganda made the war seem to be in their favor, but her own sources contradicted it. She also confided in Satine that she sometimes wished she and her homeworld, Naboo, had taken up the opportunity to become a neutral state as Kryze had with Mandalore. Satine took the moment to mention her own problems with the Republic, and though Amidala agreed with her she believed that there was still hope of solving those issues. Kryze told the senator that she arranged a visit to a new hospital that had opened, where she believed that the two would be able to see true good at work. The following day, Kryze and Amidala arrived at the hospital only to find it at full capacity with a large portion of the student populace.\nKryze was disturbed by the sight and demanded to know what had happened. She was informed that children across the planet had been poisoned, though the doctors had no idea what had caused the outbreak. As Amidala discussed the sudden crisis with Doctor Zak Zaz, Kryze solemnly comforted one of the ill students. Kryze and Amidala met with Almec soon after, who guessed that Death Watch was behind the outbreak. Satine disputed this claim, reasoning that Death Watch had only targeted her and her administration, not children. Almec left to speak to the Ruling Council, and Kryze and Amidala became concerned about his lack of care for the sick children, many of whom had died from the poisoning. Kryze decided to mobilize her personal guard to conduct a secret investigation into the crisis after concluding that Almec and the council would be of little help.\nWith her guard prepared to begin their assignment, Kryze and Amidala took it upon themselves to visit the schools where the epidemic originated from. The food given to the children was tested prior to their arrival by Doctor Zaz, and there were no signs of poison. Kryze asked whether or not the bottled tea the children had was tested, but was told that the drinks were not part of the school's menu and were allowed from an outside venue. One of these drinks was tested shortly after by Zaz, and was found to contain high levels of slabin, which had become lethal from the mixture with the tea. Knowing where the outbreak had come from, Amidala and Kryze traveled to the dockyard to read the school's import log to find the origin of the tea. Once at the docks, however, they discovered that the import log had been erased.\nThe school's superintendent, who had come along, hastily walked towards a speeder and ignored Kryze's order to stop, but was arrested by two of Satine's guards. Kryze uncharacteristically threatened the schoolmaster with violence and demanded he tell her what he knew. The superintendent told her that he had welcomed the tea as a way to cut costs and make a profit for himself, but was unaware the drinks were poisoned. He told the duchess that he had only met with an importer named Siddiq on his end of the bargain. Once Satine and Amidala located Siddiq, who worked for a shipping company elsewhere in the city, he admitted his role in the black market ring and willingly gave up what he knew, believing that he was free of consequence by his corporate contracts. He told Kryze that the tea had been imported from Mooga and showed her a shipping log to back it up. Siddiq also told them that there would be a shipment from Mooga later that day.\nKryze and Amidala, now knowing when and where to intercept the smuggled tea, undertook a discreet mission to locate the Moogan ship. Amidala and Kryze, escorted by one of the duchess' guards, enjoyed some light banter as they made their way to the dock, where they arrived just as the Moogan smugglers did. The three witnessed a customs official receive credits from the Moogans, who unloaded several crates of tea from their ship. Despite their evidence, Kryze could not convince Captain of the Mandalorian Guard Patrok Ru-Saxon of the illegal activity. Kryze accused Ru-Saxon of stalling their investigation, and she, Amidala, and the captain traveled to the docks once again, where they found two guards stationed at a warehouse. The two guards refused to comply with either Kryze or Ru-Saxon's orders and were quickly arrested.\nRu-Saxon opened the door to the warehouse, where Kryze saw several Moogans and Mandalorians brewing the imported tea. The Moogans and their workers opened fire on Satine and her escort, and a firefight ensued. Ru-Saxon was shot during the fight, and Amidala had two of Kryze's guards push a storage container in front of the warehouse door. Amidala picked up a blaster and, with the two guards pushing the container into the warehouse, closed in on the smugglers, who were captured in quick succession. With the smuggling operation shut down, Satine ordered the warehouse to be burned down. Ru-Saxon protested that evidence would be destroyed, but Kryze threatened to have him arrested if he didn't do as she said. The warehouse was set aflame as a warning and an example of what fate corruption would meet on Mandalore.\nKryze and Amidala met with Almec later, who they informed that Death Watch was not a part of the smuggling ring. Kryze ordered that an antidote be shipped to all schools and hospitals, and Almec was relieved that the situation was over. Kryze told Almec that the issue was far from over and that corruption still remained in the government, and he ensured her that he was setting up a committee to oversee the problem. Despite Almec's promise, Kryze remained skeptical. As she escorted Amidala back to her ship, Kryze confided in Amidala that she believed that Almec was somehow involved in the illicit trade on Mandalore. She asked Amidala to send a Jedi to aid her in finishing their work, proposing that they could go undercover at the Royal Academy of Government to help root out the corrupt leadership. Amidala promised to speak with Jedi Grand Master Yoda about the request and told Kryze not to lose hope as she boarded her ship.\nSenator Amidala held her promise to Kryze and spoke to the Jedi Council on her behalf. The Council assigned Ahsoka Tano, the Padawan learner of Skywalker, to teach at the Royal Academy of Government in Sundari. Kryze and Almec led a welcome party consisting of several of the Academy's top students, including the duchess' nephew Korkie, to the Sundari dockyards to greet the Jedi. As the Jedi's ship landed, Almec turned to Satine and questioned the integrity of having a Jedi teach at the Academy, specifically what he perceived to be a lack of understanding of Mandalorian ways. Kryze dashed aside his concerns by saying that it wouldn't hurt to have the students exposed to new ideas. Skywalker and Tano exited their ship, and the Jedi Knight greeted the two Mandalorians.\nKryze expressed her thanks to the Jedi Council for their ability to spare the two Jedi, but Skywalker informed her that only Tano would be staying on Mandalore. Almec was taken aback by the revelation, but Skywalker assured him that Tano was capable. Relieved, the prime minister called forth the students to meet the Jedi. Korkie excitedly saw Tano's lightsaber, but Almec informed the Jedi that her weapon would have to be taken away during her tenure because of Master Kenobi's visit to the planet. Tano gave Skywalker her lightsaber. Kryze thanked the Jedi for respecting their ways. Republic Army Captain CT-7567 interrupted the welcoming to inform Skywalker that they had to depart. Skywalker bid farewell to the duchess and boarded his ship. As Skywalker left, Kryze and the welcoming party, now accompanied by Tano, returned to the city.\nWhile Duchess Satine continued her investigation of the corrupt presences in her government, Tano taught the Academy students lessons about the nature of corruption in politics and holding leaders to account. Inspired by her teachings, Korkie and his friends Amis, Soniee, and Lagos decided to take it upon themselves and investigate the nature of the food shortage that had erupted following Kryze's defeat of the planned Republic occupation. While searching a warehouse district in Sundari, the children observed a meeting between a hooded man and several Gotal, all of whom were being protected by unmarked members of the Mandalorian Guard. The pupils were caught watching and made a quick escape, but not before discovering large quantities of food stored in a warehouse and recording part of the secret meeting. After returning to their dormitory, Korkie decided that they needed to speak with Satine about their findings.\nThe students visited Kryze's palace the following day, meeting her in her living area. Satine questioned how Korkie had found the information, but the students disregarded her concern and told her that they needed her help to continue with their investigation. Satine, realizing that they planned on becoming involved in the situation she was already looking into, remained unmoved and told them not to continue investigating for their own safety. Korkie became agitated that she seemed to be ignoring their discoveries, but Kryze corrected him and asked that they let her handle the crisis. Before sending them on their way, Kryze warmly told them that they would have a chance to save Mandalore when they were older. Despite her warning, the youths were angry that she wouldn't help them and turned to Almec for guidance, and the prime minister told them to meet him at the palace plaza that night.\nHis black market schemes beginning to crack, Almec set into action a planned coup against Duchess Satine. He had his secret police, the unmarked members of the Mandalorian secret service, kidnap the duchess from her office, killing the Protectors stationed with her. Satine was brought to prison, where she was cuffed and placed in an elevated security cell. Almec also ordered his police to take Korkie and his friends captive at the palace plaza, but they failed when Padawan Tano arrived to rescue them. Deducing that Almec had set them up, Tano and the students decided to speak with Kryze immediately, only to find her office in disarray. They figured that Almec had done something to Satine and devised a plan to learn what he had done. Tano turned the children over to the prime minister, who informed Tano that he had taken Kryze into custody for alleged crimes against the government and was preparing a formal statement on them.\nThough Tano was unable to learn Kryze's location from Almec, she was able to find her cell by using a Jedi mind trick on Almec's guards. Tano was able to access the controls to Satine's cell but, once freed, the duchess warned the Padawan that it was a trap. Almec and several members of his secret police entered the room, and the seditious prime minister told Tano that his guards had been playing along with her plan. He had the Jedi stunned and handcuffed, then turned to Satine and demanded that she sign a confession of treason against the Mandalorian government. Kryze angrily confronted Almec for his actions, calling him out for using his public office to accumulate wealth and power for himself at the expense of the people. Almec laughed at her, then explained to her that he had established the black market on Mandalore to help the people. He told her that the black market had created a new economic avenue for humanitarian aid, but Kryze argued back that there had been no new aid and that he had reaped the benefits all for himself.\nAngered by Kryze's callout of his embezzlement, Almec ordered his guards to put a shock collar on her. Using a control panel, Almec sent electric shocks throughout Satine's body and again demanded that she sign the confession. The duchess did not waver in her refusal, and Almec ordered his police to bring the students into the room for similar torture despite Kryze's protests that they were only children. Before Korkie could be submitted to torture, Padawan Tano broke from her captor's grip and began fighting back against Almec's guards, as did the children. Tano quickly removed the shock collar from Kryze's neck and placed it on Almec, who ordered his police to stop fighting to keep from being electrified. Satine sent for her Protectors, who arrested Almec's police and took the prime minister into custody. With Almec removed from power and the crisis over, Kryze thanked Tano for her work and hugged Korkie. Satine, Korkie, and the other students later escorted Tano to the dockyard, where Skywalker arrived to pick up his student. Tano bid farewell to Korkie and silently nodded to Kryze, who watched as the Jedi left Sundari.\nThough she had adamantly stood by her neutrality in the war, Satine continued to have a presence in the Senate. As the war began to take a heavy toll on the funds of the Republic, several members of the Senate began pleading for an increase in the production of clone troopers and the deregulation of the banking system. Senator Amidala was staunchly opposed to the bill and began negotiating for peace with a friend of hers, Confederate Senator Mina Bonteri. The peace talks broke down after droids under the command of Confederate General Grievous bombed the Coruscant power grid and Bonteri was allegedly killed in a Republic attack. The strike on Coruscant dramatically swung many senators in support of deregulation and the bill was swiftly passed. Subsequently, Kamino Senator Halle Burtoni put forward the motion to increase clone trooper production. Despite the setbacks, Senator Amidala remained headstrong. Satine was present in the senate chamber for a speech made by Senator Amidala in opposition to the bill, where the senator argued that an increase in military spending came at the expense of social services. Amidala's speech, a touching and passionate defense of basic social amenities that suffered as a result of the war, received rousing support from many of those present, including Kryze.\nAlthough Amidala's speech was well-received, Burtoni's bill was passed. Amidala and her ally, Senator Farr, put forward their own motion aimed at preventing Burtoni's bill from taking place. Duchess Satine met with the two and their allies as they were attempting to secure votes, but left while Amidala took a call from Senator Stonk. Later on, however, Farr died of what appeared to be heart failure. Still on Coruscant, Kryze attended the funeral of her fellow Council of Neutral Systems member. Kryze was flanked by two Journeyman Protector guards as she solemnly listened to a eulogy spoken by Farr's aide Silood. After the eulogy, the mourners watched silently as Farr's body was loaded onto a Consular-class cruiser and ferried back to his homeworld. The vote on Farr's bill was postponed when his death was identified as murder. Though his murderer was later discovered and arrested, the legislation he and Amidala had worked hard to pass was defeated.\nIn 20 BBY, a peace conference was sanctioned by both the Republic and Confederacy. Mandalore was chosen to host the meetings as neutral ground, with Duchess Satine moderating the event as an arbitrator. Each government sent a trio of representatives to take part in the conference. The delegates from the Republic were Senators Amidala, Bail Organa, and Mon Mothma, and representing the Confederacy were Congress Leader Bec Lawise, Senator Voe Atell, and Senator Amita Fonti. The precarious meetings were to be held in Kryze's throne room. Though Kryze had laws restricting weaponry allowed in Sundari, each delegation was allowed to be accompanied by security forces, which, for the Republic, included Padawan Tano. The conference was filled with tension, with the Republic delegates unwilling to fully engage with the Confederacy's negotiations, which included declaring the Separatist state legitimate. The meeting took a turn when, while Senator Atell was pressuring Amidala on the legitimacy of the Separatists, the meeting was interrupted by Lux Bonteri, the son of the late Mina Bonteri.\nBonteri announced that he had something to say regarding the legitimacy of the Separatists, creating a stir amid the two delegations. While the representatives whispered among themselves, Bonteri approached Duchess Satine's throne. He bowed before the duchess, who with a silent hand wave and a nod allowed him to speak. Once Bonteri had taken up a podium, however, he angrily accused Count Dooku of murdering his mother, earning a quick and equally angry refutation from Senator Lawise. Lawise had Bonteri arrested by two commando droid units, though Kryze stood up and ordered that they stop. Senator Atell asked that Satine remain out of the matter, and Bonteri was taken away. Senator Amidala allowed Tano to go free Bonteri, but his rescue led to a firefight between the Separatist and Republic forces accompanying their representatives, and the peace negotiations quickly broke down.\nNot long after the failed peace conference, Obi-Wan Kenobi purportedly perished at the hands of the bounty hunter Rako Hardeen. A funeral for the fallen Jedi Master was hosted in the Jedi Temple on Coruscant. The funeral was attended by many of Kenobi's friends and comrades, including Satine. During the procession, Satine stood with Senator Amidala and Padawan Tano to her left and Jedi Master Shaak Ti to her right. Kryze openly cried during the service, utterly distraught at the apparent death of the man she loved. Unbeknownst to those outside of the Jedi High Council, Kenobi had survived his encounter with Hardeen and was impersonating the assassin in the hopes of bringing to light and hopefully stopping a plot to assassinate Supreme Chancellor Palpatine. While undercover, Obi-Wan used Kryze's old nickname for him, Ben, as a codename. Obi-Wan's mission was ultimately successful, and upon its completion his survival was made public.\nIn the aftermath of Almec's arrest and the brief chaos he created, Mandalore returned to a state of peace with Kryze's guidance, albeit an uneasy one. Despite having been in exile after their exposure on Concordia and abandoned by the Confederacy, Death Watch still wished to topple Satine's government. Pre Vizsla had gone mad during this period, during which Death Watch had been relegated to a criminal gang operating in the Outer Rim. His luck took a turn when he encountered the renegade Sith Lord Maul and his apprentice Savage Opress, both of whom had been on a spree of chaos across the Outer Rim and recently escaped from a fight with Obi-Wan, who Maul had a personal vendetta against. Kenobi had fought Maul during the Naboo Crisis in 32 BBY and severed his legs, which sent the Sith Lord into a spiral of madness he had only recently emerged from.\nVizsla helped Maul and Opress recover from their injuries and the two forged an alliance with Death Watch after learning that they shared numerous enemies, including Kenobi and Dooku. They began plotting to depose Duchess Satine, a vital move that would give them the power to take out their various nemeses. Vizsla wanted to take on Kryze directly, but Maul took over his plans and decided to build a larger alliance with several crime syndicates, including Black Sun, the Pyke Syndicate, and the Hutt Clans. Maul also altered the plan to take into account the over two thousand neutral systems under Kryze and Mandalore's affiliation, which they would could use to build a vast underworld empire. With their criminal alliance, the Shadow Collective, intact, Maul and Vizsla began preparations to overthrow Satine and use her as bait for Kenobi.\nThe Shadow Collective's forces soon arrived to Sundari, first attacking the shipping docks. Their plan was to undermine Satine's rule by sowing chaos and destruction across the city, only for Death Watch to enter the fray and \"rescue\" the people of Sundari from the criminals. The plan was similar to Vizsla's original takeover plan with the Confederacy, which Kryze had inadvertently halted by defeating the Republic occupation. Maul's forces at the docks easily overwhelmed the guards stationed there and took hold outside the city. News of the attacks spread quickly, and the Mandalorian people became nervous and demanded Kryze take action. Satine herself was first informed of the attacks by Armatan. Satine believed that Death Watch was behind the sudden violence, but was told that it was a crime syndicate acting alone.\nSundari's law enforcement was unable to fend off the numbers of the Shadow Collective and the criminal armies began advancing on locations across the city, including Peace Park. While her forces did what they could to stop the Shadow Collective's spread, Duchess Satine addressed a large crowd outside her palace. Satine asked the people to remain calm and reassured her constituents that the attackers were merely thugs. Her attempt at easing the crowd was ineffective, and just as she finished speaking Pre Vizsla and two other members of Death Watch arrived to confront her, among them her estranged sister Bo-Katan. Vizsla called out Satine in front of the crowd, telling the people that Satine had led them to ruin. Kryze's Protectors moved to guard her from Vizsla, but the duchess ordered them to stay back. Satine questioned Vizsla on whether or not he was behind the attacks, but he replied that he was not. He turned to the crowd and told them that he had a solution to ridding the city of the gangsters who threatened them. Vizsla told the people that they were at war and that siding with him was necessary to win it, adding that Satine's pacifism had failed. Satine tried to dispel Vizsla's claims, telling the crowd that his \"war\" would lead to the end of Mandalore as they knew it.\nVizsla once again used his passionate rhetoric with the crowd, telling them that there was no time for discussion and that they needed to take action. As he lifted from the ground on a jetpack, he yelled out that the name Mandalore should strike fear into the hearts of the gangsters. The crowd began chanting his name, and a distraught Satine was left to watch her peaceful citizens turn their support to Vizsla. With the people now looking to Death Watch for help, Maul and Vizsla began the next stage of their plan. Death Watch started countering Maul's forces, \"arresting\" the leaders of the crime families. The chanting of Vizsla's name from the crowds outside the royal palace only grew louder, and as the Shadow Collective and Death Watch continued their coup, Vizsla prepared to confront Satine personally.\nKryze was warned by Armatan that Vizsla had entered the palace, but the desolate duchess did not try to stop him, knowing that her support had dwindled to a loyal few. As Vizsla and his warriors entered the throne room, Satine's guards drew their weapons. Satine told them to stand down, pointedly remaining strong in her desire to not be provoked to violence by terrorists. Vizsla told Kryze that the people wanted change and that her \"weak-minded rule\" of Mandalore was at an end. With no one else to stop him, Vizsla had his men arrest Satine, the Mandalorian Protectors, and the remaining members of the Ruling Council. In a speech to the crowds outside the palace, Satine's sister Bo-Katan told the people that Satine and her fellow leaders had fled, then presented the \"captured\" leaders of the Shadow Collective as proof of Death Watch's strength while Vizsla had himself named the new prime minister.\nIn prison, Satine was held in a cell adjacent to Almec, who was still incarcerated for his crimes. Many members of Satine's administration were killed for their loyalty to her, while others chose to join Vizsla to avoid punishment. Satine tried to compel the guards walking past her cell that Mandalore was heading towards its destruction, though the only response she got was from Almec. Almec snidely inquired whether or not she was in for a visit or if peace had betrayed her. Satine lamented that peace only existed in the mind of the faithful. Almec replied that faith had been the greatest disappointment to her, but Satine countered that it only disappointed when it was broken, using his actions as prime minister as an example of how he had betrayed the trust of both her and the people. Almec told her that she had betrayed his trust in turn, saying that his actions were made because he believed she had led the people to destitution.\nAlmec claimed that what he did, despite being illegal, was what kept her in power. The powerless Satine told him that it was an error of judgement, that corruption was not the answer to the sacrifices the people made for their freedom. Almec simply joked that Satine should enjoy her freedom, adding that she had plenty of time to tell him all about it. Meanwhile, Vizsla, now in control of Mandalore, betrayed Maul. Vizsla revealed to the Sith that he had no intention of expanding to the other neutral worlds, then had him apprehended. With Maul in custody, Vizsla addressed a crowd outside the palace, telling them that Satine had abandoned the people and that her pacifistic ideology only encouraged aggression. Using Maul as an example, Vizsla told the crowd that his actions were the consequences of pacifism, and that by abandoning Satine's principles, they could defend themselves in the future.\nMaul and Savage were brought to prison, where they easily broke out and began searching the cells for someone who would help them retake Mandalore from Vizsla. Maul approached Satine's cell and asked whether or not she was the former duchess. Satine asked what he wanted with her, but all she got in reply was that he would have a use for her in time. He told her that he wanted to know where the other leaders of Mandalore were being held. Satine remarked that he should have known, given that many had either sided with Vizsla or been killed. She told Maul that all there was left was she and Almec, saying the latter was as corrupt and vile as they were. However, that was more than enough reason for Maul to approach the man, learning from him he was the former prime minister.\nIn a bid to stop them from uniting, Satine told Maul and Savage that Almec was not to be trusted and had caused the deaths of children, but Savage ordered her to be quiet. Her protests ignored, Kryze watched as Maul recruited Almec and formulated a plan to remove Vizsla from power with him. Maul planned on challenging Vizsla to a duel, knowing that as a warrior he would not refuse. Almec was freed by the Sith Lords, his place now secured as Vizsla's successor, leaving Satine alone to lament Mandalore's fall. Maul, Savage, and Almec then left for the palace, where Vizsla accepted Maul's challenge. After a lengthy fight, Vizsla was beaten by Maul and accepted that the Sith had earned his place by winning. Maul brutally beheaded Vizsla then claimed the Darksaber and his place as ruler. Bo-Katan and a small group of Death Watch, distraught by Vizsla's death, refused to accept Maul's claim and fled the palace.\nWith Vizsla dead, Almec became the public face of the Mandalorian government. Almec falsely claimed to the Mandalorian people that Satine had murdered Vizsla and was under arrest for it. The crowd supported Almec despite his past crimes, and Maul had begun building his steps towards a large criminal empire. As Maul began to settle into his new power, a small group consisting of Satine's loyal followers and Death Watch dissidents mounted an attempt to rescue the duchess. The resistance was led by Korkie and Bo-Katan, who had decided to reconcile with her estranged sister to rid Mandalore of Maul. After entering the prison, Korkie forced a member of Maul's forces to open Satine's cell at blaster point. When the soldier opened the door, Satine harshly asked what the traitor wanted. Suddenly, Korkie killed the warrior and proudly told Kryze that he would never betray her.\nElated to see her nephew, Satine ran up and hugged Korkie, but another warden spotted the pair and aimed his blaster at them. As they raised their hands to surrender, however, Bo-Katan shot the guard, startling Satine. Kryze turned to see her sister, who removed her helmet. Recognizing Bo-Katan, Satine sternly stated that it had been a long time since they last saw each other. Korkie reassured Kryze that Bo-Katan was on their side, but she questioned why she had chosen to help. Bo plainly replied that the enemy of her enemy was her friend. Satine, hopeful, told her that there was once a time when they weren't enemies, adding that that time could come again. Taking charge, Satine told her family that they had to go.\nSatine, Korkie, and Bo-Katan met up with the rest of the rescue party outside the prison, including Lagos, Soniee, and Amis, waiting with an airspeeder. Satine asked Korkie for his comlink, knowing that contacting the Jedi Council was their only option. Korkie informed her that frequencies were being jammed and they wouldn't have a signal unless they left the city. Satine told Korkie's classmates that they were taking a major risk in trying to free her, and the group boarded the speeder. They were quickly followed by Maul's forces, who Bo-Katan and her warriors left to deal with. One of Maul's soldiers hit the airspeeder, causing it to malfunction as it neared the docks. The speeder crashed into Hangar 1 and the resistance engaged in a firefight with the oncoming commandos.\nSatine and Korkie ran towards the edge of the dockyard to establish a connection to his comlink. While Korkie fired at the Death Watch soldiers attempting to capture Kryze, she began recording her transmission. She asked that the message be given to Obi-Wan, telling him that she had lost Mandalore and that Almec was in power. Korkie was incapacitated as Satine finished recording, and the duchess was surrounded by Maul's warriors. Kryze again asked Obi-Wan for his help before being arrested once more. Though Satine was taken prisoner, Bo-Katan, Korkie, and the rest of the rescue party managed to escape. At the royal palace, Almec informed Maul of Satine's transmission. Maul had planned for Satine to reach out to Obi-Wan, and mused that her actions had only brought him closer to his goal.\nAt the Jedi Temple on Coruscant, Jedi Masters Yoda and Ki-Adi-Mundi called Obi-Wan to a private meeting to show him Satine's message. The Jedi denied Obi-Wan his request to help, reasoning that since Death Watch was no longer in league with the Confederacy and Mandalore was neutral, the coup against Kryze was an internal affair. Kenobi, wanting to help his friend, decided to break orders and go to Mandalore in secret. Obi-Wan borrowed a ship from Anakin, the Twilight, and disguised himself in a bounty hunter outfit so he could leave Coruscant unnoticed. Upon landing at the docks at Sundari, he stole the armor of one of Maul's soldiers and infiltrated the city with ease. He made his way to the prison and opened the door to Satine's cell. Satine unknowingly believed that it was one of Maul's followers and snidely asked if he was there to do more of his master's bidding.\nKenobi removed his helmet and quipped that he did his own bidding. Seeing him, Kryze rushed from her seat and embraced him. Upon asking, she learned that Kenobi had come alone, and that the Jedi and Republic would not be of any help. Taking Kryze by the hand, Obi-Wan looked outside the cell to see if their path was clear. The two made their way to an elevator, where Satine asked him if he had a plan. Just as he replied that he did, the door to the lift opened they were met by one of Maul's soldiers. Kenobi pushed Satine onto the elevator and pretended that she was still his prisoner, a scene that was reminiscent of their time on the run during the Mandalorian Civil War. After a few moments of silence, the soldier questioned if there was a prisoner transfer, but was knocked out by Kenobi before he could figure out what was happening. Outside the prison, Obi-Wan lightheartedly asked if Satine would mind his stealing a speeder bike parked nearby. Satine joked that, since the speeder was technically government property, it was hers to begin with, which made the Jedi smile.\nAs they sped towards the docks, Kenobi told Satine that their escape brought back memories, but the duchess pointed out that the two shared several bad memories. He remarked that they had some pleasant experiences, leading Kryze to state that she hoped this would become one of them. While they closed in on the dockyard, however, a large group of Maul's warriors were alerted to their escape and gave chase. The soldiers were joined by Maul and Opress themselves, who wanted to see Kenobi taken in personally. Once Kryze and Kenobi reached the Twilight, Obi-Wan skidded their speeder bike to a halt, and both he and the duchess ran towards the ship, evading an onslaught of blaster fire from Maul's forces. While Obi-Wan prepared the Twilight for takeoff, Satine told him that they needed to contact her sister for reinforcements, and Kenobi, having never heard of Bo-Katan, asked who her sister was. Kryze stated that their relationship was complicated, then quickly uttered that she was a member of Death Watch.\nBefore Obi-Wan could respond, the Twilight was hit by two missiles as it ascended. With the ship aflame and malfunctioning, Satine and Obi-Wan fled the cockpit and went to the boarding ramp to flee. When Kenobi lowered the ramp, however, the two were met by the intense forces caused by the ship spiraling out of control. Kryze was lifted from her feet and swept toward the ground, but Kenobi was able to catch her before she was thrown from the ship. Obi-Wan could only hold his grip on the boarding ramp for a few seconds, and he and Satine were hurled from the ship to the dockyard below. After the hard landing, the Twilight exploded, sending shrapnel and debris across the docks, a large piece of which landed on top of Kryze. Once he got his bearings, Obi-Wan used the Force to lift the metal off Satine, who tried to sit up but lost consciousness. As Maul confronted the weary Obi-Wan, Opress picked up the unconscious duchess, and the two were brought to the palace.\nKryze and Kenobi were brought before Maul in the Sundari throne room, where Satine was made to kneel beside the throne. Maul taunted Kenobi, lifting and choking Satine with the Force while Obi-Wan watched, unable to help. Obi-Wan at first struggled against his captors as Satine was hurt by Maul, who preyed on the Jedi's love for the duchess and used her as bait to his dark emotions. Satine, still under Maul's grasp, begged Obi-Wan to not listen to the Sith Lord's words, only to be silenced by Opress. Obi-Wan assured Maul that the Sith could kill him, but his resolve would never be broken. Hoping to stop Maul, Kenobi tried to identify with him by bringing up his horrific past, which only angered the Sith Lord.\nA furious Maul remarked that the perfect tool for his vengeance was now available to him, and that he could finally watch the Jedi Master suffer as he had. Drawing the Darksaber, Maul tightened his grip on Satine and forcefully pulled the duchess towards him, impaling her with the ancient saber as Obi-Wan watched in despair. As Maul dropped Satine's dying body to the floor, Kenobi rushed to her side and gently held her. Holding the side of his face, Satine professed her unyielding love for Obi-Wan in her dying breath before passing away in his arms.\nJust as Satine died, Obi-Wan felt a growing inner turmoil as he processed what happened. Obi-Wan was at first sorrowful that Satine would never live to see her world and people thrive or be able to look back on the good she had done for them, but his sorrow became anger as he focused on Maul and the fact that she should never have become involved in their struggle. For a moment, he found a desire to murder Maul, Savage, and Almec in cold blood for their roles in Satine's murder. Maul was amused by his anger, and this led Obi-Wan to realize that in doing so he would become something Satine would never have wanted him to be. Refusing to give in to his anger, Kenobi told Maul that he wouldn't win this way before being hauled out of the throne room to prison, where Maul hoped he would break under his misery with Satine's death.\nAs Obi-Wan was being transported to prison, his escort was intercepted by Bo-Katan. Bo-Katan helped Obi-Wan escape Sundari, which had fallen into chaos as the remains of Death Watch shattered over Maul's rule. Bo-Katan hoped that Obi-Wan would inform the Republic of Maul's actions on Mandalore, despite the fact that it would lead to a Republic invasion. Obi-Wan told Bo-Katan that bringing war to Mandalore would be against Satine's wishes, but she explained that Satine's devotion to Mandalore meant the late duchess would be willing to do anything to save her people. As he was preparing to leave, Obi-Wan realized that Bo-Katan was Satine's sister, and he apologized for her loss as they parted ways. Shortly after returning to Coruscant, Kenobi anxiously prepared to give the Jedi Council his testimony about what had happened on Mandalore. Speaking with Anakin, Obi-Wan confided that he felt anger like he never had before because of Kryze's death. Later in the war, Obi-Wan mentioned his relationship with Satine while questioning Anakin about the nature of his connection to Senator Amidala. Hoping to get Anakin to open up about his feelings, Obi-Wan resonated with his former student, reminding him that he had harbored feelings for Kryze prior to her untimely demise.\nMaul's murder of Satine effectively delivered a fatal blow to what remained of her regime. With both Kryze and Vizsla dead and his takeover of the throne complete, Maul and his loyal Mandalorians began suppressing the citizens of Sundari. Bo-Katan, meanwhile, led a resistance movement against his forces. Maul's rule was briefly interrupted by his former Sith master, Darth Sidious, who killed Opress and removed Maul from Mandalore for his own purposes. Maul later managed to escape custody and began a campaign against the Confederacy of Independent Systems. The Mandalore resistance learned of the continued relationship between Prime Minister Almec and the Collective and informed the Jedi and Republic. After confirming that Maul had ties to Mandalore and was holding several key Separatist leaders hostage, the Republic led an assault on Vizsla Keep 09, a Death Watch base where Maul was in hiding. Obi-Wan was among the Jedi in charge of the assault, but his fellow Jedi, knowing of his close ties with the late Kryze, feared that he would be overwhelmed by emotion. Though Kenobi assured his colleagues that he would not fail, the Jedi were unable to capture Maul or the Separatist leaders. Maul would later lose his conflict with the Confederacy and return to the shadows.\nBy the end of the Clone Wars, Obi-Wan had come to accept his feelings for Satine, but struggled to balance his relationship with her and his duties as a Jedi. Bo-Katan and her Nite Owls continued to track Maul's movements, and as the Clone Wars neared its end they discovered that he had returned to Sundari. During her time following his trail, Bo-Katan also came into contact with Ahsoka Tano, by then no longer a Jedi, who herself had discovered Maul's return to Mandalore. Knowing that she didn't have the numbers to retake Mandalore alone, Bo-Katan struck an alliance with Ahsoka and managed to contact Obi-Wan and Anakin to arrange a meeting to discuss sending Republic aid to help them oust Maul. Despite his prior commitment to helping Mandalore, Obi-Wan was reluctant to send aid, continuously stating that they would need the approval of the Jedi Council, reasoning that an invasion would break the century-old treaties between Mandalore and the Republic. Another issue was the ongoing Outer Rim Sieges, which spread the Republic army thin and made it unfeasible to gather an invasion force.\nObi-Wan's unwillingness to send aid angered Bo-Katan, who reminded him of what Maul had done to Mandalore. Bo petulantly referenced Obi-Wan and Satine's relationship, pointing out that she thought Satine meant something to Obi-Wan. Kenobi remained stagnant in not committing to helping Bo-Katan but told her that Satine still meant something to him, though he added that he wasn't going to let his feelings for her cloud his judgment. As he left to consult the Council, Bo angrily told Ahsoka that asking for help was a waste of time. With some quick negotiations, Ahsoka managed to secure a division of clone troopers to take to Mandalore to help Bo-Katan oust Maul from the throne. They managed to enter Sundari with relative ease, quickly taking strides to take hold of the city.\nAlthough Maul remained elusive and difficult to locate, Bo-Katan managed to easily defeat Almec and take him into custody, where he was later assassinated by Gar Saxon. The New Mandalorian people were uncomfortable with the clone presence, but were assured that, once Maul was arrested, the Republic army would leave the planet. Soon after the citizens of Sundari were evacuated into shelters, Maul's warriors were defeated by Bo-Katan and Ahsoka's forces in a decisive battle. Ahsoka herself managed to capture the former Sith Lord, who was placed in an ancient Mandalorian vault. Ahsoka, upon seeing the device, questioned whether or not Satine had outlawed such devices, which Bo-Katan says she had. With Maul imprisoned and the Shadow Collective fragmented, it seemed that Mandalore could rise again with Bo-Katan as their new leader, leading the Mandalorian people into a new era just as Satine had.\nJust as Mandalore was freed from Maul's grip, the Clone Wars came to a tumultuous end as the Republic finally crumbled after years of fracturing and the Confederacy lost its leadership and power in quick succession. Supreme Chancellor Palpatine declared himself Emperor and reorganized the Republic into the Galactic Empire. Under Emperor Palpatine's new rule, the Jedi were nearly wiped out, leaving survivors such as Obi-Wan, Ahsoka, and the escaped Maul as fugitives. Among those who died during the chaotic end of the war was Kryze's friend, Senator Amidala. Using the clones left on Mandalore, the Empire began an occupation of the planet. Bo-Katan and several other warrior groups refused to acquiesce to the Empire's rule, and she was removed from power. With Bo-Katan no longer recognized as the ruler of Mandalore, Gar Saxon took the mantle of leader as Imperial Viceroy. The Mandalorian Protectors, meanwhile, established a base on the third moon of Concord Dawn and safeguarded the system on the Empire's payroll. In his self-imposed exile on Tatooine, Obi-Wan took the name \"Ben Kenobi,\" echoing the nickname Kryze had given him during the Mandalorian Civil War.\nIn the years following her death, Duchess Satine continued to be a polarizing figure. While some, like Bo-Katan and the leader of the Protectors, Fenn Rau, remembered Satine's rule fondly, others, such as those who descended from Death Watch, continued to hold her in contempt. Tensions between these groups persisted even under the Empire. Years before the early rebellion against the Galactic Empire, a young cadet at the Imperial Academy of Mandalore named Sabine Wren developed a superweapon that became the Arc Pulse Generator. Wren, whose clan was once part of Death Watch, cruelly nicknamed the weapon \"the Duchess\" after Satine. She developed the weapon to target the beskar alloy used in Mandalorian armor and disintegrate the soldier inside, taking it as a challenge to her abilities since beskar was widely regarded as indestructible. After finding out that the Empire had not only weaponized her design but tested it on her people, Sabine was horrified. Although she sabotaged the original prototype, Wren, who subsequently became an outspoken detractor of the Empire, was exiled by her family and eventually joined the Spectres, a rebel cell led by Hera Syndulla.\nIn 3 BBY, the Protectors of Concord Dawn came into conflict with the Spectres, who were trying to secure safe passage in the system. When Fenn Rau and the Protectors learned that Sabine was a member of Clan Wren, they accused her of being part of Death Watch even though she denied it. After Rau was taken prisoner by the rebels, the Protectors relented and allowed the nascent rebellion access to their space. About a year later, the rebellion lost contact with the Protectors, who had been wiped out by Viceroy Saxon and his Supercommandos.\nBy 2 BBY the aging and mentally unstable Maul had transformed the Nightsister lair on Dathomir, the homeworld of his brethren, into a sanctuary for himself. Among a large collection of items from his life, Maul had under his possession a stolen cubist painting of Satine. The painting was heavily defaced, with the eyes and throat of Kryze scratched out and the overall artwork in poor condition. The portrait was kept in a twisted shrine to the Darksaber and Maul's decades-long vendetta against Kenobi, memorializing the slaying of his enemy's beloved.\nThat same year, Maul lured young rebel Ezra Bridger, one of Sabine's crew, to Dathomir in order to find the location of the exiled Obi-Wan from the young boy. Ezra briefly explored Maul's lair, where he saw Satine's painting and looked at it for a moment. Maul growled at him to get away from the shrine, and the two began a ritual to find the location of Obi-Wan. In the subsequent skirmish between the Spectres and Maul to free Ezra, Sabine took the Darksaber from the former ruler of Mandalore. Maul later managed to track down Obi-Wan on Tatooine, where he was killed by the Jedi Master during a brief lightsaber duel. Despite all he had done to his enemy, the dying Maul was comforted in his final moments by Obi-Wan.\nEven by 0 BBY, the year of his death, Obi-Wan continued to carry guilt and blamed himself for failing Kryze and every other person he truly loved. While talking with the Force spirit of Qui-Gon Jinn, Kenobi was comforted by his old master, who reassured Obi-Wan that the responsibility for his failure was Jinn's own for not having completed his training.\nNow in possession of the Darksaber, Sabine was trained by Rau to wield the ancient weapon, which they believed they could use to help rally Mandalorians against the Empire. Sabine and Rau traveled to Krownest, where they attempted to gain the support of Clan Wren in their fight against the Empire. During their mission, Sabine's mother, Ursa Wren, the leader of Clan Wren and a former member of Death Watch, killed Gar Saxon, which led to war between Clan Wren and Clan Saxon, who were staunchly in support of the Empire. Because Clan Wren openly dissented from the Empire, they were backed by the Alliance to Restore the Republic, a resistance movement themselves embroiled in war against the Empire. The Spectres, by then a part of the Rebel Alliance, joined Sabine and Clan Wren to fight for Mandalore.\nSabine continued to wield the Darksaber as the Spectres and Clan Wren began striking at the Imperial forces on Mandalore, who were led by Tiber Saxon. Wren and Rau's efforts eventually gained support from Bo-Katan and her Nite Owls. Sabine attempted to give Bo-Katan the Darksaber so she could lead the Mandalorians once more, but Bo-Katan refused to accept the weapon, believing that she was unworthy to be a leader since she had failed to live up to her sister following the Clone Wars. Despite her refusal, Bo-Katan continued working with Sabine and Rau. Their fight was brought to a halt with the news that the Empire had recreated the Arc Pulse Generator and had begun using it on members of Clan Wren in battle. Bo-Katan was disgusted that the weapon had been named after Satine, viewing it as an insult to her late sister's memory, and Sabine herself had come to regret the decision. Bo-Katan and Sabine managed to destroy the weapon, after which several Mandalorian clans reassured Bo-Katan that they were willing to follow her as their leader. Bo-Katan decided to accept the Darksaber and claimed the throne once again, rallying support against the Empire in the name of her sister.\nBo-Katan's open war with the Empire would not lead to victory. In the midst of the Galactic Civil War between Imperial forces and the Alliance to Restore the Republic, the Empire realized that they could not control Mandalore, and instead decided to make sure that no other faction could. The Empire launched what would become known as \"The Great Purge\" against the Mandalorian people. An immense armada of Imperial craft bombed the surface of Mandalore, destroying the planet once and for all in an event called the \"Night of a Thousand Tears.\" The genocide led to the destruction of the entire civilization of Mandalore. Bo-Katan was among the few survivors of the Purge, but she lost the Darksaber to Imperial Moff Gideon during the conflict. In the aftermath of Mandalore's decimation, surviving Mandalorians fled and scattered throughout the galaxy.\nEven following the defeat of the Empire to the Alliance to Restore the Republic's successor state, the New Republic, in 5 ABY, what few Mandalorians remained operated in secret. By 9 ABY, Bo-Katan believed that she was the last of her family and, with her Nite Owls, continued to fight against Imperial remnants, intent on reclaiming the Darksaber from Gideon and returning to Mandalore. Like her sister before her, Bo-Katan became controversial in what remained of Mandalorian society. Although Bo-Katan was still seen by some as the rightful ruler, others felt that her claim to the throne was illegitimate and based solely on her bloodline. Some of her detractors held the Kryze clan in contempt, such as the Tribe, a covert Mandalorian group who belonged to the cult-like Children of the Watch, an organization who practiced the ancient religion of Mandalore and the warrior traditions that had been phased out under Duchess Satine's rule. They asserted that Satine and Bo-Katan had both lost their way and led House Kryze into ruin, simultaneously taking Mandalore down with it.\nAt some point following Kryze's death, the Drearian Defense Conglomerate, a weapons manufacturing company, named a model of Defender sporting blaster pistol after the late duchess, the Satine's Lament. One of these blasters was put to good use by Leia Organa, a prominent anti-Imperial leader and the daughter of Kryze's friend, Padmé Amidala.\nAs noted in the book A History of Persuasive Art in the Galaxy, Duchess Satine had played a role in the world of art during her lifetime. The book credited Kryze as a key influence over artistic movements in opposition to the Clone Wars. Prior to the collapse of her government in the Death Watch coup, Satine's widespread activism sparked a movement among many of Mandalore's gifted artists to create works chastising both sides of the war and encouraging independence, which in turn inspired artists with Death Watch sympathies to create their own propaganda. Though Kryze was lauded by some for her pacifism and leadership during the Clone Wars, historians described Mandalore under her rule as an iconic example of how a planet steadfastly neutral in war could still be radically transformed by it.\nAccounts of Duchess Satine's life were depicted on a series of illustrated maps by the Ithorian artist Gammit Chond. Although he was a recluse, Chond purportedly based his maps on stories he heard from travelers, including those of Kryze's rule, fall from power, and death, among various other notable events in Mandalore's history. Long after they were created, the maps, which were among what little of Chond's artwork to survive, were stored in the Shadow Stacks of the Graf Archive on the moon Orchis 2 until a student archivist exhumed the set, after which they were painstakingly restored and released as a collection. In a rough timeline of galactic history from 32 BBY to 34 ABY, the years covered by Chond's work, the Graf Archive labelled the fall of Kryze's regime and her death as one of many significant events from the period.\nSatine Kryze was a human female who stood 1.77 meters tall, or 5 feet and 10 inches. Kryze had shoulder-length blond hair, striking blue eyes, and pale skin, along with a slender build and defined features.\nA strong-willed and ambitious leader, the central ideology that guided Kryze's rule of Mandalore was reformist, progressive, and pacifist. Her political passions started at a young age when she became a dedicated adherent of New Mandalorian reformism and began working with the faction. Motivated by the endless and destructive wars that had ravaged Mandalore's environment, Kryze rejected the old traditions of her people in favor of constructive policies that favored the Mandalorians' non-violent culture. At the core of her philosophy was the idea that Mandalore needed to change in order to secure a future and could only do so by moving beyond its warrior past, which she believed was the root of its problems. Despite disparaging her people's violent traditions, Kryze still participated in Mandalore's non-violent practices. Although her methods differed greatly from her opponents, Duchess Satine sought a similar end goal as many of her fellow Mandalorians: a strong, independent Mandalore.\nIn the aftermath of the Mandalorian Civil War, Satine, horrified by the carnage of the volatile situation in which she had risen to power, adopted a strong pacifist viewpoint. Kryze believed that war was an intolerable state and described it as an \"affront to life itself,\" and was so devoted to her cause that she valued peace more than her own life. As she had seen happen on Mandalore, she believed that violence would only lead to an unending cycle of more violence. As part of her pacifistic stance, Satine followed a strict morality on numerous topics. She had complex relationships with weaponry and interrogation, at times needing to employ both while harboring distaste for each. Though dismissed by some as an idealogue, Kryze argued that her position was no more than logical reasoning. Satine often sacrificed her personal life for her ideals. Her stubbornness risked pushing those closest to her away, and she struggled to keep her relationships from falling out.\nDuchess Satine ruled the Mandalorian people with a gentle and benevolent hand. Even with her ambitious and polarizing goals, however, she was unwilling to push others to align with her and acted only with the help and consent of her people. Her rule was marked by cultural change as she navigated the formerly martial Mandalore to a period of peace and prosperity it had never before experienced. Kryze was a polarizing and controversial public figure throughout her reign, alienating conservative voices that despised her rejection of the old ways but widely supported among much of the civilian population. Satine cared deeply for her people and was willing to do whatever she could to protect them in the face of adversity, and one of her guiding principles was her dedication to keeping them from becoming engulfed in conflict so soon after the civil war.\nDespite enjoying public support for her positions, Kryze faced a serious obstacle in the terrorist group Death Watch. Although she was devoted to her people, Satine and her government forwent transparency with them on the group's rising influence in favor of insisting that their society was at peace as part of her agenda to prove Mandalore's growth to intergalactic entities. While she publicly downplayed the Death Watch, Kryze herself was often in denial of their power and was prone to minimizing the threat they posed to her. Even after the revelation that they had become a full militia by the time of the Clone Wars, Kryze was conflicted in her approach to the terrorists. At times, she trusted her judgment that they would not harm the Mandalorian populace, believing instead that they would only target her and other public officials.\nKryze kept herself headstrong by raising an eyebrow at everything around her in the name of her people's well-being. Though she prided herself on the differences between her government and the corrupt Galactic Republic, her regime began to falter to corruption during the Clone Wars. She blamed herself for allowing it to spread despite being entirely uninvolved and was not unwilling to criticize her government's actions, expressing her opinion that she and those who worked alongside her had failed to protect their people during the crisis. The fact that the smuggling operations had resulted in the mass poisoning of children deeply troubled her and brought out an emotionally impulsive and vindictive side of her. She uncharacteristically threatened both a school administrator and Captain Ru-Saxon of the Mandalorian Guard for disobeying and doubting her orders, even ignoring Senator Amidala's pleas for her to calm down.\nSatine believed that the best way to ensure future action against corruption was to educate the children and future generations of Mandalore. Kryze, who was young herself when she first began her work with the New Mandalorians, felt that the Mandalorian youth would benefit from learning new ideas and had to be taught to hold their leaders to account if their world was to continue to prosper. To Satine, any form of corruption in Mandalore's leaders was an act of treason on par with terrorism. The betrayal of Prime Minister Almec, whom Satine had suspected of corrupt practices but was willing to give the benefit of the doubt, outraged and hurt the duchess most. Almec had abused his position of authority to accumulate wealth and power for himself at the cost of the people's well-being, which Kryze saw as the ultimate betrayal of their trust.\nThroughout the Clone Wars, Duchess Satine foiled and outsmarted her enemies time and again, but her luck ran out when Vizsla aligned himself with Maul. The arrest of Almec had brought both Kryze and Mandalore back to a state of relative peace, but Death Watch's Shadow Collective-backed coup was effective in turning public opinion against Kryze's regime. Satine tried to convince her people that she would see them out of the chaos, but Vizsla's nationalistic fearmongering led the people of Sundari to side with him. Fighting a losing battle, Satine willingly surrendered to Vizsla in order to keep her beloved people from having to face more bloodshed. Even to the end of her rule, Satine was determined to avoid allowing herself and her government to be provoked to violence.\nDuchess Satine's reform efforts during the Mandalorian Civil War were supported by the Galactic Republic. Following her victory and the installment of the New Mandalorian government, Mandalore became a member of the Republic. Despite this, Satine was an active voice against the Clone Wars and found herself at odds with the Senate's interests. Kryze's opposition to the Clone Wars stemmed from her devotion to nonviolence and she opposed the war for everything it represented. Satine's beliefs led her to a hard-line stance on sovereignty, advocating for planets and systems across the galaxy to choose self-determination instead of blind loyalty to governments such as the Republic. Her vocal opposition to the Clone Wars inspired several hundred worlds to place their trust in her to champion their neutrality, which she was successful in accomplishing as the Regent of the Council of Neutral Systems. Satine characterized both the Republic and Confederacy as being overrun by extremists, and urged those who would listen to her to follow in Mandalore's path and de-escalate the war by refusing to contribute to it. Many in the Republic saw Kryze's inaction as ignorant, with even Obi-Wan opining that the stubborn Satine was not willing to collaborate with those she disagreed with.\nSatine believed that the Republic was beyond saving and likened it to an oppressive force intent on trampling the rights of its constituents. On the nature of the Senate itself, Satine decried the body as incapable of creating good counsel and believed that it could not accomplish anything other than discord. Kryze had a particular distaste for the policies of Supreme Chancellor Palpatine and Vice Chair Amedda. She distrusted the Republic to the point that she put her life in danger to obtain Deputy Minister Jerec's undoctored testimony just to avoid working with Republic authorities.\nAlthough she felt that the Republic at large was contaminated with greed and corruption, Kryze made a friend in Senator Amidala, one of few senators to stand by Mandalore's neutrality and provide aid as trade routes became inaccessible to the planet. Though Satine was friendly with Amidala, the two were politically unallied due to Mandalore's neutral stance. Despite her misgivings with the war, Kryze was willing to allow the failed Confederate-Republic peace conference to be held on Mandalore, and even moderated the event in her throne room.\nIn addition to her opposition to the Republic's militarist activities, Kryze also denounced the militant actions taken by the Jedi Order. During her time under the protection of Master Qui-Gon Jinn and then-Padawan Obi-Wan, Satine witnessed firsthand the peacekeeping nature the Jedi ascribed to themselves and knew them to be devoted to their cause. By the time of the Clone Wars, however, Kryze viewed the Jedi differently. Satine saw the Jedi's political affiliation with the Republic and their involvement in the war as a betrayal of their core values. In her opinion, the Jedi had sacrificed their ideals for political convenience. Kryze described their reliance on violence to solve conflicts as foolhardy and compared their actions to a pseudo-crusade, though she admitted that they came from a place of devotion and commitment to the Order, albeit misguided. Satine found it amusing and ironic how the Jedi adopted the attitudes and titles of military officers while promoting themselves as peacekeepers, and called out both Kenobi and Skywalker aboard the Coronet for doing as such.\nSatine was close with her nephew Korkie and was very protective of him and his safety. Korkie sought to help Satine with her struggles during the Clone Wars and protect the New Mandalorians in kind. When Korkie and his friends uncovered Almec's treason, they attempted to appeal to Satine and get her help, but the duchess was concerned that they were becoming too involved and that their safety was at risk. Satine's desire to keep her nephew safe came across as belittlement to Korkie, which only made him more willing to rebel against her wishes and continue investigating. Even when tortured by Almec in prison, Satine tried to keep Korkie from suffering like her and protested the traitorous Prime Minister's attempt to put a shock collar on him. Korkie remained loyal to his aunt and her ideals as the Clone Wars continued, even as Maul and Pre Vizsla's takeover of Sundari took place. When Satine was deposed and imprisoned, Korkie led a rescue attempt to free his aunt, who was overjoyed to see him alive and well.\nKorkie's attempt to rescue the deposed Satine reunited the former duchess with her estranged sister, Bo-Katan, whom she affectionately called \"Bo.\" Although Satine and Bo-Katan were close when they were younger and sincerely loved each other, their fierce ambitions and differing opinions about Mandalore's future estranged them and made them polar opposites in nearly every way. Where Bo-Katan couldn't understand Satine's idealism, Satine couldn't understand her sister's devotion to the perceived honor of the old ways which had destroyed their world. Both Kryzes wanted what was best for their world but disagreed completely on what that meant.\nThough they were driven apart, each sister continued to care about the other in their own ways. Satine was alarmed to see her sister during her rescue, who in the intervening years had become a leading member of Death Watch. Korkie and Bo-Katan reassured the duchess that they were working together. Though their reunion stemmed from having a common enemy in Maul, Satine believed that she and her sister could reconcile their differences and become friends again, though her death soon after the failed rescue mission dashed that future. Bo-Katan, despite her estrangement from and opposition to Satine, was devastated by her sister's death, and over time came to respect her late sister for her ambition despite still not understanding her idealism.\nSatine Kryze first met Obi-Wan Kenobi during the Mandalorian Civil War, when he and Master Qui-Gon Jinn were sent to protect her from her enemies. The trio spent nearly a year on the run, living without knowing what the next day would bring, and the young duchess and Padawan began to develop feelings for each other. Satine's idealism and hope for the future of her planet inspired and intoxicated the youthful enthusiasm of Obi-Wan. Though they came to love each other, neither acted on their feelings, and by the time the war ended, they parted without knowing what their lives could have been had they stayed together. Both Kryze and Kenobi looked back on their whirlwind relationship with regret, but they also felt relief at who they eventually grew into. In her later years, Satine did not hide her feelings for Obi-Wan and recognized that, despite their complicated past, he was an important part of her life, and she would never be able to forget him if she tried.\nThe two were reunited amid the Death Watch insurgency during the Clone Wars and managed to find their old rapport despite the long time they hadn't seen each other. At first, Kryze was cold to Obi-Wan, believing that he was acting in the interests of the Senate, but once corrected, she softened significantly and opened herself up to him. Though their reunification was fraught with the dangers of Death Watch, they teased each other relentlessly, often with romantic undertones. Their camaraderie was strained again when Satine learned that Obi-Wan favored a Republic occupation of Mandalore, and they devolved into petty bickering and arguing over their differing politics. His resoluteness saddened her as he seemingly cared little for her planet's sovereignty, which she had long fought for.\nSatine and Obi-Wan's anger at each other peaked aboard the Coronet, where their arguments turned into a physical standoff. Once they came under attack from the probe droids, however, they put aside their differences and fought side-by-side again. As the situation escalated and Kryze was taken captive by Prince Merrik, the duchess broke from her stalwart facade and confessed to Kenobi that she had loved him since the civil war and still did, and he admitted to her that he would have left the Jedi Order for her had she simply asked. Despite opening up to each other about how they felt for the first time, they didn't get a chance to speak about it further as Satine had to focus on her diplomacy. In her struggle to preserve the peace and neutrality she had brought to Mandalore, Kryze inadvertently pushed Obi-Wan away, but he remained at her side even through her anger and difficulty with Republic officials.\nThough the two made up after Satine won continuing neutrality, they continued on with their chosen paths as friends. After she was deposed and imprisoned by the Shadow Collective, Satine knew she had to contact Obi-Wan for help and did so during Korkie and Bo-Katan's failed rescue mission. Kenobi disobeyed orders to rescue her, and she was elated to see him. They maintained their flirtatious banter even in the extreme circumstances and reminisced about their history together as they sped to escape Sundari. However, their escape was thwarted by Maul's forces, and they were brought to the palace, where he staged his long-sought revenge against Obi-Wan with Satine as his tool. Kryze used what little strength she had to tell Kenobi to stick to his beliefs, and with her dying words affirmed her love for him.\nDespite her pacifist principles and abhorrence of violence, Kryze had some skill in combat and could hold her own in a fight. When freeing Obi-Wan from the mines on Concordia, Kryze was attacked by a pair of Death Watch soldiers, and she managed to hold them back on her own before Obi-Wan intervened. She was a sly combatant, displaying as much during her trip to Coruscant aboard the Coronet. While fighting off the assassin droids, she and Obi-Wan weaved together back-to-back seamlessly, and she managed to grab Senator Merrik's blaster from him by stamping his foot then pulling herself out of his grasp in one swift move. Kryze was additionally capable of engaging in armed combat and had good aim with a blaster. When questioned about her choice to carry a deactivator by Obi-Wan, Satine reasoned that even though she was a pacifist, she wasn't unwilling to defend herself. Despite the dangers she often faced, the duchess enjoyed the adventure and risk she was involved in when it did not affect her people at large.\nAs the ruler of Mandalore, Duchess Satine was strong-willed and determined, with proficiency in leadership, politics, and diplomacy. She was a gifted speaker and showed strength in analyzing her surroundings. She could even hold her own before the Galactic Senate when under pressure from Supreme Chancellor Palpatine and Vice Chair Amedda. Due to the constant threats made to her life, she was a resilient woman and could withstand conditions as extreme as electric torture. Among her other abilities, Kryze could drive speeder bikes and could evidently fly spacecraft; during Obi-Wan's failed attempt to rescue her from imprisonment, she was prepared to co-pilot the Twilight but was forced to evacuate when the ship was damaged. Satine was crafty as well and was able to correctly program the controls of the Concordia mine to free Obi-Wan from near death.\nAs the ruler of Mandalore, Satine knew of the optics of her appearance and always took care to present herself with dignity and poise. Kryze fashioned her hair in a Kalevalan style and, in her wardrobe, made significant use of soothing and rich colors with floral-inspired designs meant to emulate the forests and lakes that once populated Mandalore's surface. Her elegant clothing, which rivaled that of even the infamously elaborate wardrobe of Padmé Amidala, was not worn out of vanity but was strategically chosen to reflect Mandalore's past beauty and remind those who saw her of what the planet once was and what it could still be. Despite her staunch pacifist stance, Kryze always carried a deactivator hold-out pistol, a small but powerful blaster that fired energy shots that could deactivate droids.\nShortly after her ascent to the throne, Duchess Satine became the owner of the Nau'ur-class yacht Coronet, a custom-built spaceliner manufactured by Kalevala Spaceworks. Built on Kryze's homeworld of Kalevala, the Coronet was designed with Satine's pacifist ideals in mind. The ship's distinctive design heavily reflected the hope that Mandalore would finally begin to prosper under her leadership. Elegant, versatile, and non-threatening in appearance, the Coronet expressed the qualities the new Mandalore looked to project to the galaxy with Satine as its leader. The craftsmanship of the Coronet was as utilitarian as Kryze's clothing; the ship made heavy use of materials and traditional fabrics from all over the Mandalore sector and was meant to showcase all that the Mandalorian people had to offer the galaxy.\nThe upper section of the Coronet was home to Satine and her traveling retinue and included various amenities for the royal guests. The Coronet was staffed by numerous servant and protocol droids, including LEP-series service droids and the more-advanced BD-3000 luxury droid. Though the ship's primary purpose was to be used as Kryze's personal transport for her and those that comprised her court, Satine ensured that the Coronet was not just a plaything of the elite but also a cheap mode of transportation for unwealthy travelers. The Coronet was a unique example of a vessel that combined functionality with an economic and political purpose. As a transport ship, Kryze's yacht allowed both Mandalorians and tourists passage throughout the Mandalore sector, which proved beneficial to the economies of several Mandalorian worlds, including Mandalore itself. Even after the fall of Kryze and the New Mandalorians, the Coronet continued to serve the Mandalorian people.\nSatine Kryze first appeared in \"The Mandalore Plot,\" the twelfth episode of the second season of the animated television series Star Wars: The Clone Wars. The episode was directed by Kyle Dunlevy, written by Melinda Hsu and Drew Z. Greenberg, and first aired on January 29, 2010. \"The Mandalore Plot\" was the first in a trilogy of episodes, which also included \"Voyage of Temptation\" and \"Duchess of Mandalore.\" Initially, \"Voyage of Temptation\" was the only planned episode of the trilogy, however, George Lucas and Dave Filoni decided to expand upon the character of Satine and the Mandalore story-arc, leading to the development of the \"The Mandalore Plot\" and \"Duchess of Mandalore.\"\nThe idea to give Obi-Wan Kenobi a romantic interest in The Clone Wars came from story editor Henry Gilroy. From the conception of the character the team behind the show always intended to have Satine killed off. Satine's design was based off of unused concept art of Queen Padmé Amidala for Star Wars: Episode I The Phantom Menace illustrated by Iain McCaig. She was inspired by Cate Blanchett, particularly her performance as Queen Elizabeth I, whom she portrayed in Elizabeth and Elizabeth: The Golden Age. Gilroy further compared Satine's role in The Clone Wars and nonviolent ideology to Mahatma Gandhi and Dr. Martin Luther King Jr. Gilroy, who came up with her name, denied she was named after Nicole Kidman's character in Moulin Rouge!, who was the love interest of Ewan McGregor's character. Dave Filoni said he did not realize that initially, and said, \"I still wanna question Gilroy about that, because I'm like, 'Come on, really? I mean, out of all the names, really?' It's pretty weird, I'll give you that.\"\nIn The Clone Wars, Satine was voiced by Anna Graves. Graves was drawn to the character because, despite her deep connection to the story of Obi-Wan Kenobi, Satine stood out to Graves as someone who wasn't reliant on the narrative of another character to shine. Although initially unaware of the history and culture of the Mandalorians, Graves educated herself upon landing the role. By the time of recording, Graves understood the importance of her role and was \"excited to speak in the Concordian dialect.\" Following Filoni's direction, Graves tried to deliver some of Satine's speeches with the same gravitas as Blanchett's performance as Elizabeth I. She also used the bickering relationship between Princess Leia Organa and Han Solo in Star Wars: Episode V The Empire Strikes Back as a basis for her voice work, wanting the character of Satine to challenge Obi-Wan as much as Organa challenged Solo.\nEarly plans of the Star Wars Rebels episode \"Twin Suns\" featured Maul experiencing visions of both Kryze and Savage Opress before facing Obi-Wan Kenobi on Tatooine. Unlike Opress, who made it as far as the design phase, Satine was cut from production early on.\nIn her entry in the Encyclopedia, Satine's homeworld was listed as being Mandalore. However, Tal Merrik's Databank entry correctly lists her homeworld as Kalevala.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Satine_Kryze",
  "/wiki/Satine_Kryze/Legends",
  "/wiki/Kalevala",
  "/wiki/19_BBY",
  "/wiki/Mandalore",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/House_Kryze",
  "/wiki/Clan_Kryze",
  "/wiki/New_Mandalorians",
  "/wiki/Mandalorian_Government_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Council_of_Neutral_Systems",
  "/wiki/Mandalore_resistance",
  "/wiki/File:WarIsIntolerable-VoT.ogg",
  "/wiki/Mandalorian",
  "/wiki/Duke",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/The_galaxy",
  "/wiki/Mandalorian_Civil_War",
  "/wiki/Death_Watch",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Mandalore_Defense_Resolution",
  "/wiki/Plot_to_assassinate_Satine_Kryze",
  "/wiki/Galactic_Senate",
  "/wiki/Mandalorian_black_market_conspiracy",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Shadow_Collective",
  "/wiki/Pre_Vizsla",
  "/wiki/Sundari",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Coruscant",
  "/wiki/Battle_of_Naboo",
  "/wiki/Death",
  "/wiki/Mandalorian_civil_war_(Clone_Wars)",
  "/wiki/File:NotGeneralsButPeacekeepers.ogg",
  "/wiki/Reproduction",
  "/wiki/Adonai_Kryze",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Korkie_Kryze",
  "/wiki/Homeworld",
  "/wiki/Prince",
  "/wiki/Tal_Merrik",
  "/wiki/42_BBY",
  "/wiki/Keldabe",
  "/wiki/Bounty_hunter",
  "/wiki/Republic%E2%80%93Mandalore_treaty",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Venom-mite",
  "/wiki/Draboon",
  "/wiki/Padawan",
  "/wiki/Jedi_Order",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Concordia",
  "/wiki/Memorial_Shrine",
  "/wiki/Peace_Park",
  "/wiki/Minister",
  "/wiki/Prime_Minister",
  "/wiki/Almec",
  "/wiki/Mandalore_sector",
  "/wiki/Governor",
  "/wiki/Mandalorian_vault",
  "/wiki/Mandalorian_Protectors",
  "/wiki/Separatist_Crisis",
  "/wiki/Battle_of_Geonosis",
  "/wiki/22_BBY",
  "/wiki/Hydian_Way",
  "/wiki/HoloNet_News",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Head_of_State",
  "/wiki/Dooku",
  "/wiki/Jedi_High_Council",
  "/wiki/Mission_to_Cato_Neimoidia_(Kenobi_and_Skywalker)",
  "/wiki/Cato_Neimoidia",
  "/wiki/Republic_Military",
  "/wiki/Attack_on_a_Republic_cruiser",
  "/wiki/Unidentified_Death_Watch_saboteur",
  "/wiki/Mandalorian_armor",
  "/wiki/Grand_Salon",
  "/wiki/Senator",
  "/wiki/Suicide",
  "/wiki/Mandalorian-Jedi_War",
  "/wiki/Bombing_of_the_Memorial_Shrine",
  "/wiki/Death_Watch_bomber",
  "/wiki/Concordian",
  "/wiki/File:YouLeadCONS-TMP.ogg",
  "/wiki/Unidentified_Concordia_city",
  "/wiki/Concordian_mines",
  "/wiki/Alcohol",
  "/wiki/Deathwatch_hideout",
  "/wiki/Darksaber",
  "/wiki/Coronet",
  "/wiki/Onaconda_Farr",
  "/wiki/Rodia",
  "/wiki/Kin_Robb",
  "/wiki/Taris",
  "/wiki/Orn_Free_Taa",
  "/wiki/Ryloth",
  "/wiki/Anakin_Skywalker",
  "/wiki/SD-K4_assassin_droid",
  "/wiki/Deactivator_hold-out_pistol",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/CC-2224",
  "/wiki/Util-313",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Deputy_Minister",
  "/wiki/Jerec",
  "/wiki/Bombing_on_Kalevala",
  "/wiki/Unidentified_Death_Watch_assassin",
  "/wiki/Aramis",
  "/wiki/Ministry_of_Defense",
  "/wiki/Davu_Golec",
  "/wiki/Sector_GL5",
  "/wiki/Monument_Plaza",
  "/wiki/Sundari_Mandalorian_hospital",
  "/wiki/Doctor",
  "/wiki/Zak_Zaz",
  "/wiki/Ardees_Beverage",
  "/wiki/Slabin",
  "/wiki/Unidentified_Sundari_school_superintendent",
  "/wiki/Siddiq",
  "/wiki/Unidentified_Mandalorian_shipping_company",
  "/wiki/Mooga",
  "/wiki/Moogan",
  "/wiki/Mandalorian_Guard",
  "/wiki/Patrok_Ru-Saxon",
  "/wiki/Skirmish_at_the_Sundari_docks",
  "/wiki/Mooga_smuggling_ring",
  "/wiki/Royal_Academy_of_Government",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Ahsoka_Tano",
  "/wiki/Ahsoka%27s_lightsabers",
  "/wiki/CT-7567",
  "/wiki/Amis",
  "/wiki/Soniee",
  "/wiki/Lagos",
  "/wiki/Gotal",
  "/wiki/Mandalorian_secret_service",
  "/wiki/Republic_financial_reform_bill",
  "/wiki/Mina_Bonteri",
  "/wiki/Grievous",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Kamino",
  "/wiki/Halle_Burtoni",
  "/wiki/Republic_military_enhancement_bill",
  "/wiki/Reduced_military_spending_bill",
  "/wiki/Stonk",
  "/wiki/Funeral_of_Onaconda_Farr",
  "/wiki/Silood",
  "/wiki/Consular-class_cruiser_(Charger_c70_retrofit)",
  "/wiki/Lolo_Purs",
  "/wiki/20_BBY",
  "/wiki/Confederate%E2%80%93Republic_peace_conference",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Mon_Mothma",
  "/wiki/Separatist_Congress_Leader",
  "/wiki/Bec_Lawise",
  "/wiki/Voe_Atell",
  "/wiki/Amita_Fonti",
  "/wiki/Lux_Bonteri",
  "/wiki/Rako_Hardeen",
  "/wiki/Funeral_of_Obi-Wan_Kenobi",
  "/wiki/Imperial_Palace",
  "/wiki/Shaak_Ti",
  "/wiki/Skirmish_in_Theed",
  "/wiki/Savage_Opress",
  "/wiki/Skirmish_on_Florrum",
  "/wiki/32_BBY",
  "/wiki/Mission_to_Lotho_Minor",
  "/wiki/Black_Sun",
  "/wiki/Pyke_Syndicate",
  "/wiki/Hutt_Clan",
  "/wiki/Armatan",
  "/wiki/Nite_Owls",
  "/wiki/Hangar_1",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Twilight",
  "/wiki/Force_choke",
  "/wiki/Campaign_against_the_Shadow_Collective",
  "/wiki/Assault_on_Vizsla_Keep_09",
  "/wiki/Vizsla_Keep_09",
  "/wiki/Second_Battle_of_Dathomir",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/332nd_Division",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Gar_Saxon",
  "/wiki/Galactic_Emperor",
  "/wiki/Galactic_Empire",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Viceroy",
  "/wiki/Protectors_Camp",
  "/wiki/Third_moon_of_Concord_Dawn",
  "/wiki/Concord_Dawn",
  "/wiki/Tatooine",
  "/wiki/Fenn_Rau",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/Imperial_cadet",
  "/wiki/Imperial_Academy_of_Mandalore",
  "/wiki/Sabine_Wren",
  "/wiki/Superweapon",
  "/wiki/Arc_Pulse_Generator",
  "/wiki/Clan_Wren",
  "/wiki/Beskar",
  "/wiki/Spectres",
  "/wiki/Hera_Syndulla",
  "/wiki/3_BBY",
  "/wiki/Mission_to_the_third_moon_of_Concord_Dawn",
  "/wiki/2_BBY",
  "/wiki/Nightsister_lair",
  "/wiki/Dathomir",
  "/wiki/Mandalorian_cubism",
  "/wiki/Painting_of_the_Duchess_Satine_Kryze",
  "/wiki/Ezra_Bridger",
  "/wiki/Skirmish_on_Dathomir",
  "/wiki/Mission_to_Tatooine_(Imperial_Era)",
  "/wiki/0_BBY",
  "/wiki/Force_spirit",
  "/wiki/Skirmish_on_Krownest",
  "/wiki/Krownest",
  "/wiki/Ursa_Wren",
  "/wiki/Mandalorian_Civil_War_(Imperial_Era)",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Civil_War",
  "/wiki/Tiber_Saxon",
  "/wiki/Mandalorian_resistance",
  "/wiki/Great_Purge_of_Mandalore",
  "/wiki/Night_of_a_Thousand_Tears",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Battle_of_Jakku",
  "/wiki/New_Republic",
  "/wiki/5_ABY",
  "/wiki/9_ABY",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/The_Tribe",
  "/wiki/Children_of_the_Watch",
  "/wiki/Way_of_the_Mandalore",
  "/wiki/Drearian_Defense_Conglomerate",
  "/wiki/Defender_sporting_blaster_pistol",
  "/wiki/Satine%27s_Lament",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Ithorian",
  "/wiki/Artist",
  "/wiki/Gammit_Chond",
  "/wiki/Shadow_Stacks",
  "/wiki/Graf_Archive",
  "/wiki/Orchis_2",
  "/wiki/Unidentified_archivist_student_(Gammit_Chond%27s_maps)",
  "/wiki/34_ABY",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/File:ObiWanInLove-VoT.ogg",
  "/wiki/Padm%C3%A9_Amidala%27s_wardrobe",
  "/wiki/Nau%27ur-class_yacht",
  "/wiki/Kalevala_Spaceworks",
  "/wiki/LEP-series_service_droid",
  "/wiki/BD-3000_luxury_droid",
  "/wiki/The_Mandalore_Plot",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Kyle_Dunlevy",
  "/wiki/Melinda_Hsu",
  "/wiki/Drew_Z._Greenberg",
  "/wiki/January_29",
  "/wiki/2010",
  "/wiki/Voyage_of_Temptation",
  "/wiki/Duchess_of_Mandalore",
  "/wiki/George_Lucas",
  "/wiki/Dave_Filoni",
  "/wiki/Henry_Gilroy",
  "/wiki/Queen",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Iain_McCaig",
  "/wiki/Ewan_McGregor",
  "/wiki/Anna_Graves",
  "/wiki/Han_Solo",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Twin_Suns_(episode)",
  "/wiki/Force_vision",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Databank_(website)",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Brotherhood",
  "/wiki/Corruption_(episode)",
  "/wiki/The_Academy",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Senate_Murders",
  "/wiki/A_Friend_in_Need",
  "/wiki/Deception",
  "/wiki/Dark_Vengeance:_The_True_Story_of_Darth_Maul_and_His_Revenge_Against_the_Jedi_Known_as_Obi-Wan_Kenobi",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Eminence_(episode)",
  "/wiki/Shades_of_Reason",
  "/wiki/The_Lawless",
  "/wiki/Kenobi%27s_Shadow",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/Shattered",
  "/wiki/Visions_and_Voices",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore",
  "/wiki/Master_and_Apprentice_(short_story)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Category:Audio_files_of_Satine_Kryze",
  "/wiki/Category:Images_of_Satine_Kryze",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Five",
  "/wiki/Star_Wars_Insider",
  "/wiki/Insider_Looks_Back",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/100_and_Counting_Expanded",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_32",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_66",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_68",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_32",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Blasters_and_Ranged_Weapons",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_9",
  "/wiki/Pilots_and_Crew",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_98",
  "/wiki/Bo-Katan_Kryze:_Leader_in_Waiting",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Standard_year",
  "/wiki/Cloning",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Battle_of_Mon_Cala",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Revenge",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_4",
  "/wiki/The_Phantom_Apprentice",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Legacy_of_Mandalore",
  "/wiki/The_Protector_of_Concord_Dawn",
  "/wiki/Mission_on_Lothal",
  "/wiki/Lothal",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Attack_on_Phoenix_Squadron_(3_BBY)",
  "/wiki/Phoenix_Squadron",
  "/wiki/Battle_of_Yavin",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Declaration_of_the_Rebel_Alliance",
  "/wiki/Imperial_Supercommandos",
  "/wiki/The_Mandalorian",
  "/wiki/Chapter_11:_The_Heiress",
  "/wiki/Chapter_6:_The_Prisoner",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_76",
  "/wiki/Starships_and_Speeders",
  "/wiki/The_Duchess_and_the_Jedi",
  "/wiki/Star_Wars_Insider_117",
  "/wiki/January_28",
  "/wiki/May_19",
  "/wiki/2020"
 ]
}