{
 "name": "Saul_Karath",
 "display_name": "Saul Karath",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Leviathan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Navy",
      "Republic Navy",
      "Sith Empire",
      "Sith armada",
      "Sith armada"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Carth Onasi"
     ]
    }
   ]
  }
 ],
 "content": "Saul Karath was a Human male born on Corellia who served in the Galactic Republic's Navy as an admiral during the Mandalorian Wars. In 3963 BBY, Karath was promoted to the rank of Rear Admiral after keeping the Mandalorian forces at bay for six weeks at the Jebble-Vanquo-Tarnith line. When the fugitive Jedi Padawan Zayne Carrick—who was fleeing from his Masters after being framed for the Padawan Massacre—attempted to warn Karath of the planet Serroco's impending destruction, Karath assumed that Carrick was a Mandalorian spy. When the Mandalorians razed Serroco's surface, Karath and his allies took Carrick into custody and, after boarding Adascorp leader Arkoh Adasca's flagship Arkanian Legacy, they participated in an auction in which Karath attempted to negotiate for Republic control of Adasca's exogorth superweapons. After Adasca's schemes were brought to an end, Karath also played a role in the events of the Covenant Affair, which saw the destruction of the Jedi Covenant—a secret Jedi organization which was dedicated to preventing the rise of the Sith—when one of the leaders, the Sith Acolyte Haazen, led an insurrection against the Jedi Order.\nIn that same year, the Jedi Knights Revan, Malak and their Jedi faction entered the war, with Karath becoming Revan's and Malak's subordinate. Karath later assisted Carrick in destroying the slavery organization known as the Crucible. In 3960 BBY, after Revan and Malak led the Republic to victory against the Mandalorians in the war's final battle, Karath was one of the few individuals among the Republic forces who did not follow the Jedi into the Unknown Regions to search for the ancient Rakatan Star Forge space station, which produced an unlimited amount of war matériel. A year later, Revan returned to the Republic as the new Dark Lord of the Sith, with Malak as his apprentice, igniting the Jedi Civil War. In 3958 BBY, Karath transferred his allegiance to Darth Revan's Sith Empire, bringing his flagship, the Leviathan, to Revan's service. In order to test Karath's loyalty, Malak ordered the Admiral to destroy the planet Telos IV. Karath killed millions of civilians on Telos, and earned the wrath of his former friend and protégé Carth Onasi, who had served with Karath during the Mandalorian Wars. After Malak betrayed Revan during the Jedi's and Republic's attempt to capture them, Karath continued to serve the Sith forces under Malak's command.\nIn the war's final year, Malak captured the ecumenopolis of Taris and ordered the Sith fleet to blockade the planet so that the Sith forces could search for Jedi Knight Bastila Shan. Karath was eventually ordered by the Dark Lord to destroy the planet in order to prevent Shan's escape, and Karath bombarded Taris. Shortly after Taris's destruction, Malak and Karath were informed by the bounty hunter Calo Nord of Shan's escape from the planet, and of Revan's survival and involvement in the escape. Malak and Karath hired Nord to capture Shan, but Revan, now a partially re-trained Jedi, killed Nord during his search for the Star Forge. After Revan located a fourth Rakatan Star Map—which was needed to find the Star Forge—and slew Malak's Shadow Hand Darth Bandon, Karath captured Revan's starship Ebon Hawk and tortured Revan, Onasi, and Shan in an attempt to discern their mission. The two Jedi and Onasi eventually escaped and confronted Karath on the Leviathan's bridge. Karath offered to ask Malak to be merciful if the Jedi and Onasi surrendered; however, Shan, Revan, and Onasi refused. Karath and his forces attacked them, and after a heated firefight, Karath was grievously injured. As he lay dying, Karath informed Onasi about Revan's true identity as the former Dark Lord of the Sith, and then succumbed to the wounds dealt to him by Onasi and the Jedi.\nSaul Karath, a Human male, was born on the Core World Corellia to journeyman laborer Craddock Karath. The eldest of five children, Karath was forced into adopting a paternal role toward his siblings due to his father's frequent absences and supported them by working double shifts at a weapons factory. During the Great Sith War in 3996 BBY, when the Sith Lord Ulic Qel-Droma and Mandalorians under the leadership of Mandalore the Indomitable attacked the shipyards at the world Foerost, Karath's father died in the assault after the Republic officer Dace Golliard abandoned the Republic forces during the battle and fled. Karath left his job at the factory and volunteered his services to the navy of the Galactic Republic, against which Qel-Droma's Sith Master, Exar Kun, was fighting. Karath was too young to serve in the navy officially and, because of his tough upbringing, the young Corellian did not possess the connections to enter the Naval Academy. Nevertheless, Karath won the attention of Fleet Captain Orley Vanicus, who allowed Karath to serve as a non-commissioned captain's steward on his ship Reliance I.\nFor every success Karath gained, a setback followed. However, due to the fact that he considered the navy his family, the young man never lost faith in the institution. Eventually, Karath was promoted to the rank of captain and given his first command aboard the frigate Reciprocity. During this time, Karath was successful in defending convoys against pirates, and at some point before the Mandalorian Wars, Karath and his first officer Dallan Morvis assisted a Twi'lek Jedi in capturing the bounty hunter Valius Ying. At one point, when the Reciprocity was in an engagement with enemies, Karath recognized the Republic pilot Carth Onasi's skills. When Karath was promoted to the Inexpugnable-class tactical command ship Courageous, he invited Onasi to serve with him aboard the warship, bestowing the nickname \"Fleet\" on the pilot.\nIn 3964 BBY, at the onset of the Mandalorian Wars—the conflict between the Galactic Republic and the Mandalorian Neo-Crusaders, who, under the leadership of Mandalore the Ultimate, launched an invasion against the Republic—Karath helped organize the defense of the Outer Rim ecumenopolis Taris and its nearby systems against the Mandalorian armada. From his flagship Courageous, Karath managed to halt the Mandalorians' progress at the system of Suurja through four large-scale battles, thus keeping the Jebble-Vanquo-Tarnith line, a boundary between the Republic and Neo-Crusader forces, intact. Not long after, Karath was sent to defend the trading post of Vanquo from the invading Mandalorian fleet. As he had predicted, the attack on Vanquo was only part of Mandalore's plan for invading the Republic; while Karath's forces were busy at Vanquo, the Mandalorians assaulted the remainder of the Republic fleet at Taris. Karath saw this development as a positive, as he was certain that when an important world like Taris was threatened, the Republic Senate would put more troops into the conflict.\nDuring the Battle of Vanquo, Karath was informed by Lieutenant Dallan Morvis that a junk freighter was fleeing the battle. The ship, called The Last Resort, was assisting the fugitive Jedi Padawan Zayne Carrick, who was on the run from his Jedi Masters after being framed for carrying out the Padawan Massacre. The Last Resort was entering hyperspace into Mandalorian territories, and when Morvis informed Karath that it was Carrick's ship, the captain immediately suspected that Carrick was a Mandalorian spy. Karath vowed to deal with Carrick personally, provided that he survived the battle.\nIn 3963 BBY, Karath was promoted to the rank of Rear Admiral. After he was transferred to the planet Serroco, Karath toured the local Republic camp on Serroco's surface. Zayne Carrick—who was working under the alias Shad Camper at the supply carrier and restaurant Little Bivoli—accidentally spilled a tray of food on Karath, who ignored him. Karath eventually returned to the Courageous, but was soon followed by Carrick, who had experienced a vision through the Force of the Mandalorians' destruction of Serroco and had convinced Carth Onasi to grant him an audience with Karath. As Carrick and Onasi arrived on the Courageous's bridge, Karath congratulated the lieutenant and accused Carrick of being a Mandalorian spy. Karath interrogated Carrick, who denied knowing Mandalore and the accusations of being a spy, and asked Karath to allow Onasi to try to get in contact with the Jedi Knight Alek, known to Carrick as \"Squint\".\nKarath instructed Onasi to go to the command center and contact the Jedi Council so they could locate \"Squint\". At that point, the Mandalorian ships dropped out of hyperspace and launched nuclear missiles toward the Republic fleet. Karath attempted to counter the attack, but instead of heading toward the fleet, the missiles continued towards Serroco's surface. The missiles destroyed the planet's Stereb cities and inflicted heavy damage to its Human settlements. As Carrick wept over the planet's destruction on the Courageous's bridge, Karath decided that it was time to rethink their strategies against the Mandalorians. Karath promised Carrick that he would hand him over to the Jedi, and had the Padawan sealed in a cell.\nWhen Mandalorian shock troopers boarded the Courageous, Karath was forced to abandon ship with Lieutenant Onasi and Commander Morvis. Karath reluctantly agreed to take Carrick along with them as they fled to Onasi's ship Deadweight. After escaping the Courageous—which was destroyed by the Mandalorians—Karath filed a report with the Admiral of the Fleet, in which he raised concerns with the disposition of his forces, which were under pursuit on the hyperlanes from Serroco to the banking world Telerath. Karath further expressed his hope to make it to Myrkr or the Ryyk Nebula, where he could meet with the Tremendous fleet.\nShortly after escaping the destruction of the Courageous, Karath was informed by Morvis that he had managed to reach communications with the Republic Navy's command station on Arkania. When the Deadweight was in transit to Arkania, Karath received a transmission from Eejee Vamm—a servant of the medical corporation Adascorp, which was headed by Lord Arkoh Adasca—requesting Karath's presence at a meeting aboard Adasca's flagship Arkanian Legacy. After being informed about exogorth creatures—large gastropods which were capable of surviving in the vacuum of space—which Adasca's scientists modified to be superweapons, Karath ordered Onasi to redirect the ship to the Legacy. When Karath disembarked from the Deadweight, Adasca greeted him and asked Karath if he was able to negotiate on the Republic's behalf. In the meanwhile, Karath had Carrick moved to the ship's detention area. Later in the observation dome, Karath listened to Adasca explain how the exogorths could be operated as weapons capable of destroying entire star systems. After Adasca finished, Karath asked Adasca what exactly he wanted from the Republic; when the Mandalorians led by Mandalore the Ultimate arrived at the meeting, Adasca declared that his corporation was now a galactic player, and that they sought allies, not contracts.\nAfter Mandalore boarded the Legacy, Karath defended the Jedi Knight Alek—who was representing the Revanchist Jedi faction which believed the Jedi Order should take an active stance against the Mandalorians—by pulling his blaster and threatening Mandalore after the Jedi was disabled by the Mandalorian leader's newly-made battle axe as a result of an attempted attack on the Jedi's part. Later, Karath was implored by Alek to arrest Adasca, but Karath refused, citing their outnumbered position. After Adasca commenced with a test of the exogorths, Karath granted Onasi permission to return to the Deadweight after the lieutenant became disgusted at what he saw. Soon, Karath argued that the Jedi and Republic were one and the same after Mandalore expressed his wish to keep the exogorths out of either organization's control, and further asked Mandalore why he did not just forcibly take the exogorths. When Mandalore offered to make Adasca weaponsmith of all the Mandalorian clans, Karath began to grow desperate, and asked Adasca if he wanted his own territory.\nMeanwhile, Zayne Carrick and his former Jedi Master Lucien Draay—who was aboard the Legacy in order to investigate Adasca—met up with Onasi and rogue Mandalorian Rohlan Dyre and worked together to put an end to Adasca's scheme. Both Carrick, who was in a suit of armor that Mandalore had given Dyre earlier, and Onasi went to the observation dome and started a diversion—which involved leading the Mandalorians into believing that Adasca, the Republic officers, and Jedi at the meeting had set a trap for them. The diversion worked, and Karath—along with Carrick, Draay, Alek, Onasi, Dyre, Morvis, and Carrick's companion Jarael—participated in the ensuing battle. Karath was injured during the skirmish, and was escorted by Morvis back to the Deadweight. Karath, Onasi, and Morvis successfully escaped the Legacy's observation dome as the exogorths devoured it, killing Adasca. After Karath, Morvis, and Onasi reached the galactic capital Coruscant, Karath filed his resignation to the Admiral of the Fleet because of the losses of Battle Group Serroco and the Courageous. However, the Admiral of the Fleet refused to recognize Karath's resignation, and met with Karath, Onasi, and Morvis. After this, the Admiral of the Fleet publicly commended Karath. While the Admiralty did not assign him a posting, Karath appreciated the public's support, and expressed his desire for those in his position to have a chance to see their families. Karath also confirmed that Arkoh Adasca was dead, although he declined to speak publicly of the events that transpired.\nSometime after the skirmish aboard the Arkanian Legacy, Karath was given command of the capital ship Swiftsure, and was assigned by the Jedi Master and newly appointed Council member Lucien Draay—who was also a member of the Jedi Covenant, an organization that was dedicated to preventing the return of the Sith—to the planetary defense of Coruscant, in order to protect the world against a potential attack from Zayne Carrick on behalf of the Mandalorians. Draay deceived the Admiral into believing that Carrick would attack the planet aboard the starship Moomo Williwaw; Karath was instructed by Draay to ensure that he eliminated Carrick as a threat. Karath was teamed up with the Khil Jedi Master Xamar; the Admiral later assured Xamar that nobody would get through to Coruscant without going through the planetary defense. At that moment, Karath ordered the initiation of the Vanjervalis Chain, a sensor package that not only predicted enemy movements and adjusted strategies, but linked multiple Republic cruisers under a single command.\nAs the Moomo Williwaw approached Coruscant, Karath suggested that Xamar join the other Republic fighters' efforts in the space battle, assuring the Khil that his forces would not accidentally shoot the Jedi. Sometime after Xamar left the Swiftsure's bridge, the Moomo Williwaw crashed in the ship's docking bay. Karath and his forces managed to get the bay doors open; when Carrick's companion Jarael disembarked their ship, Karath detained the Arkanian offshoot and ordered his forces to search for Carrick and his Snivvian companion Marn Hierogryph. When they could not find them, Karath began to ask Xamar to find the two fugitives, but he found that the Jedi—who had stowed away on Onasi's ship Deadweight along with Carrick and Hierogryph and escaped to Coruscant's surface—was not there.\nEventually, the Vanjervalis Chain's tactical system was taken over by Sith Acolyte Haazen—who, while serving the Covenant, had directed the Draay Trust to buy Vanjervalis Systems, which allowed him to hack and directly control the chain. When the Republic fleet began bombarding the Draay Estate during Haazen's insurrection against the Jedi Order, When informed by Morvis, now the captain of the command ship Veltraa, that the system had been sliced into, Karath ordered all non-essential personnel off the Swiftsure when also told that an incoming signal had bypassed their fail-safes, which prevented them from attempting to jam the signal or move out of range. After Haazen was defeated by Lucien Draay and Carrick, control of the Vanjervalis Chain was restored to the Swiftsure. Days later, Karath publicly announced that the Mandalorians were responsible for the bombardment and vowed he would take the fight to them. The Republic and the Jedi agreed to have the true events of the Covenant Affair covered up, and Carrick and his companions were cleared of any wrongdoing. Karath also made sure that his protégé Morvis received command of the Reciprocity.\nShortly after the events of the Covenant Affair, the Jedi Knights Revan and Malak, who was formerly known as Alek, and their Revanchist Jedi faction officially entered the Mandalorian Wars under the banner of a Republic Mercy Corps with the sanction of the Jedi Council. Karath and his forces served under Malak's command, and under his leadership retook the planet Omonoth from the Mandalorians long enough to recover the Arkanian Legacy's remains. Eventually, the Defense Ministry received an anonymous tip about a full-scale Mandalorian raiding force set to arrive in the Ithorian system. Karath led a Republic force consisting of the Swiftsure, the Veltraa, and the Testament to the system, and waited for the Mandalorians to exit hyperspace outside of an asteroid field. After the Mandalorians led by Cassus Fett exited hyperspace, the Republic forces prepared to engage them. However, the Mandalorian ships went around the fleet and re-entered hyperspace.\nAs Karath was expressing his surprise, the Swiftsure was hailed by Zayne Carrick, who informed the Admiral that there were pirates being led by Dace Golliard—the former Republic officer who was responsible for the death of Karath's father—in the asteroid field near the Swiftsure's starboard flank. Karath immediately spotted Golliard's ship, the Gladiator, and instructed the Swiftsure's crewmen to cripple the ship with their lasers and bring the Gladiator aboard the Swiftsure via tractor beam. After Golliard was finally captured and brought aboard the Swiftsure, Karath had the former Republic officer taken into custody. After this, Karath was asked by Carrick to assist him in reaching the planet Osadia. Karath initially refused, but after Carrick implied that he would reveal to the public about what had actually happened in the Adasca Affair, Karath ordered Telettoh, the captain of the Testament, to take Carrick and Hierogryph where they needed to go.\nDuring the Mandalorian Wars, the Jedi Knight Revan eventually gained full control of the Republic fleet, and in 3960 BBY, Revan forced a final confrontation with the Mandalorians over the planet Malachor V, defeating Mandalore the Ultimate and leading the Republic to victory. After the conclusion of the battle, Karath was not among the Republic forces who followed Revan and Malak into the Unknown Regions in order to hunt down surviving Mandalorians. During their disappearance, Revan and Malak fell to the dark side of the Force and became Sith Lords. After successfully finding the Rakatan Star Forge space station—which was capable of producing an endless supply of ships, droids, and war matériel—Revan declared himself the new Dark Lord of the Sith, with Malak as his Sith apprentice, forming their own Sith Empire. One year after Revan and Malak's disappearance, they returned and declared war against the Jedi Order and the Republic, igniting the Jedi Civil War.\nIn the year 3958 BBY, Karath, in an attempt to save his position and forces due to the Republic Navy's devastation, declared the Republic unworthy of his loyalty and defected to Revan's Sith Empire. He attempted, and failed, to convince his protégé and friend Carth Onasi to join him against the Republic. Karath's first act of betrayal was to give the Sith codes which enabled the Sith to bypass a Republic Navy docking bay's scanners. This allowed the Sith to sweep in and destroy over half of the docked ships before they had time to react. As a result of his new allegiance to the Sith, Karath brought the Interdictor-class cruiser Leviathan and several other ships with him. As a result, many other Republic officers followed Karath and joined the Sith, unwilling to fight the Admiral who knew their strategies. At some point after this, Revan promoted Karath as the commander of the entire Sith fleet. Not long afterward, Karath led the fleet to Onasi's homeworld of Telos IV. After the planet refused to surrender to the Sith, Malak ordered Karath to destroy Telos, in order to test the Admiral's loyalty to the Sith. Karath complied, bombing the planet's surface and killing millions, and earning Onasi's hatred. During the war, Karath intimidated hundreds of strategically important military worlds by threatening to destroy their cities by way of bombardment. Karath continued his service under Revan up until Malak betrayed and seemingly killed Revan during the Jedi and Republic's attempt to capture them both, and continued serving the Sith Empire under Malak's command.\nIn the year 3956 BBY, the Sith fleet attacked the Endar Spire, which was the flagship of the Jedi Knight Bastila Shan, above the planet Taris. Shan was being pursued by Malak because of her power with Battle meditation, a Force power that enabled her to strengthen the Republic forces' resolve and coordinate their fighting effort while sapping the will of their enemies. Shan managed to escape to the Tarisian surface aboard an escape pod. After Malak's forces captured Taris, Karath was in command of the blockade over the planet while the Sith forces searched the surface for Shan. Karath was eventually ordered by the Dark Lord to destroy Taris in order to prevent Shan's escape. At first, Karath was hesitant with the idea of murdering the billions of people on Taris, including the Sith troopers still on the surface. However, Malak reminded Karath of the fate of his predecessor, and after Karath positioned the fleet, he began the bombardment.\nShortly after Taris' destruction, Karath introduced Malak to the bounty hunter Calo Nord aboard the Leviathan. Malak was informed by Nord, who managed to survive the Sith bombardment, that Shan had successfully escaped Taris. Nord was, however, unaware that it was Revan, Malak's former Master, who assisted in Shan's escape. Malak hired Nord to track down Shan and capture her alive. However, Nord was killed on the desert world Tatooine by Revan—who was now a retrained Jedi Padawan searching for the Star Forge. Karath received news of Nord's failure and informed Malak, asking the Dark Lord to forgive him. Karath's life was spared by Malak, who believed that Nord was solely responsible for failing to capture Shan. When the Admiral asked Malak about hiring another bounty hunter, the Dark Lord determined that no bounty hunter could stand against a Jedi. In order to not to repeat this error, Malak sent his Shadow Hand Darth Bandon to capture Shan and kill Revan. Sometime after this, Malak attacked the Jedi Enclave on Dantooine. While the attack killed many Jedi and destroyed the Enclave, the local Jedi Council was able to escape. In the meanwhile, Revan slew Bandon after the Jedi located a fourth Rakatan Star Map, which was necessary to determine the Star Forge's location, on the Selkath homeworld Manaan.\nAs Revan and the crew of his starship Ebon Hawk were en route to the Sith necropolis Korriban, which had a fifth Star Map, they were captured by the Leviathan. Karath had Revan, Shan, and Onasi placed in force cages after they were brought into custody, and began interrogating them in order to determine what their mission was. Malak was far more interested in Shan and Revan, and after the latter swore he would not betray the Jedi, Karath realized that Revan was unaware of his former identity. The Admiral suspected that he would not succeed in the interrogation, but nonetheless began torturing the Jedi and Onasi, since Malak was in another sector. Knowing that Revan cared for Shan, Karath made her suffer each time the Jedi refused to answer his questions. Karath used this to test Revan's loyalty when he asked where the Jedi Enclave was, but Revan still gave no answer to the Admiral. Karath eventually revealed that the question was only a test, since Malak already knew its location and had destroyed the Enclave.\nAfter Karath left the Jedi and Onasi in their cells, he sent a message to Malak informing him that they were in the detention area. However, Revan, Shan, and Onasi managed to escape the detention area and fought their way to the bridge in order to confront Karath, who was guarded by two Dark Jedi and a group of Sith troopers. Karath offered to ask Darth Malak, who was on his way to the ship, to be merciful when he arrived if the two Jedi and Onasi would surrender their weapons. After Onasi refused, Karath went on the attack, and Revan, Shan, and Onasi slew the Sith troopers and Dark Jedi bodyguards. After Karath was mortally wounded by the Jedi and Onasi, he asked his former protégé to come closer so that he could speak with him. In a whisper, Karath told Onasi the truth about Revan's former identity as the Dark Lord of the Sith, and told him to remember his last words whenever he looked at those he thought were his friends. Karath then succumbed to the wounds dealt to him by Onasi and the Jedi.\nAfter Karath's death, the Sith Admiral Varko was promoted to Karath's former position as the Sith fleet's commander. Malak planned to conquer the Core worlds in order to crush the Republic permanently. However, Revan and his companions managed to locate the Star Forge, and the Republic fleet engaged the Sith forces around the Star Forge above the surface of Rakata Prime as Revan boarded the space station. Revan managed to redeem Bastila Shan, who had become Malak's Sith apprentice after being captured aboard the Leviathan, and killed Malak in a lightsaber duel. With the Dark Lord's death, the Sith forces were routed after the Republic destroyed the Star Forge. At the end of the Dark Wars five years later, before the Sith Lord Darth Traya succumbed to the wounds dealt to her by Jedi Knight Meetra Surik, Traya predicted that the planet of Telos—which was slowly being restored through the efforts of Ithorians led by Force Adept Chodo Habat—would forget the devastation once brought by Saul Karath.\nDuring Saul Karath's youth, he was forced to take a paternal role to his four younger siblings, since his father, Craddock Karath, was usually absent, causing Karath to support the family by taking a position at a weapons factory. His father's demise at the Battle of Foerost during the Great Sith War caused Karath to enlist in the Republic Navy. After starting his military career, Karath tried every duty on a flagship at least once. He eventually grew to be a skilled pilot and capable tactician. Karath was known for acting on quick judgments, which were sometimes viewed as reckless. Although he was a noble, Karath's bureaucratic abilities were not developed adequately, which led to a number of setbacks in his career. However, Karath was known for his ability to survive and thrive, and he considered the Navy his family.\nKarath never told anyone that his father's death had caused him to join the Republic Navy, and because a former Jedi and the Mandalorians were involved in his father's death, Karath did not trust members of either organization. When the fugitive Padawan Zayne Carrick attempted to warn him of Serroco's coming destruction, Karath wrongly assumed he was a Mandalorian spy, and remained suspicious of Carrick after evidence to the contrary. During the Mandalorian Wars, other Jedi were prone to similar receptions from Karath. He was a man who respected firepower, and trained many of the soldiers and officers in the Republic fleet, including Carth Onasi. Onasi and Karath shared similar backgrounds and a habit for making quick, if not reckless, judgments. Onasi's career path was also similar to Karath's, and as such, the Admiral took an interest in the pilot. Karath would not usually set up military defenses that would potentially endanger civilians, such as the defenses on Serroco shortly before its destruction. When he caught the former Republic captain and slaver Dace Golliard in the Ithorian system with Zayne Carrick's help, Karath was glad to see justice being done to the man whom he felt was responsible for his father's death.\nA year after Revan and Malak came back from the Unknown Regions as Sith and attacked the Republic, the Republic Navy was devastated, and Karath was faced with the loss of his troops and command. In an attempt to save both, Karath declared the Republic unworthy of his allegiance, and brought his flagship the Leviathan and a large amount of troops to Revan's service. Because he was the first officer of an important rank to join the Sith, other Republic officers followed his example and betrayed the Republic, not wanting to fight against a foe who knew all their tactics and strategies. After Malak betrayed Revan and assumed his mantle of Dark Lord, Karath thought that Revan's apparent death would make his command easier. However, Karath discovered that serving Malak was not as easy as he had hoped, but Karath would not abandon his position as the highest-ranking officer in Malak's navy. To Karath, keeping his forces intact overruled all other concerns. When Malak ordered Taris' destruction in an attempt to kill Bastila Shan, Karath tried to intervene for the billions of innocent people and the Sith troops on the surface. However, Malak threatened him, and Karath obeyed the Dark Lord's orders. When Karath tortured Revan, Shan, and Onasi after capturing Revan's ship Ebon Hawk, Karath attempted to justify the bombing of Telos IV to Onasi, stating that in war even the innocent had to die.\nBefore the Jedi Civil War, Karath had blond hair; the hair later turned gray at some point before the end of the war. He also had blue eyes. Aside from Basic, Karath could speak and comprehend a variety of languages, including Durese, Khilese, Sullustese, Mando'a, Bothese, Zabraki and Kuat. Karath owned a prototype energy shield of Verpine design, using it for extra protection during battle. During his time serving the Sith, Karath used a Sith assassin blaster pistol. He also owned a code cylinder and an encrypted comlink. Karath wore a Republic officer's uniform during his service to them. After joining the Sith Empire, Karath wore a Sith officer's uniform.\nSaul Karath was created as a villain for the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic, developed by BioWare. He was voiced by Robin Sachs. Karath's background was expanded in The New Essential Chronology, the Knights of the Old Republic Handbook, and the Knights of the Old Republic Campaign Guide. Karath was also featured in the Star Wars: Knights of the Old Republic comic series written by John Jackson Miller and published by Dark Horse Comics. In the comic series, Karath was drawn by Dustin Weaver, Brian Ching, Harvey Tolibao, Bong Dazo, and Alan Robinson. Karath also received an entry in The Complete Star Wars Encyclopedia. In April 2012, the character was featured in the fourth issue of Star Wars: Knights of the Old Republic: War. Karath, who was presented in flashbacks in the issue, was drawn by Andrea Mutti.\nThe quote that is attributed to Karath in his entry in the Knights of the Old Republic Campaign Guide was originally a line cut from the twenty-first issue of the Knights of the Old Republic comic series. The series' writer, John Jackson Miller, decided to use the quote when writing Karath's entry. As he wrote for Karath's character, Miller used historic military figures that he studied as an example. Miller stated that while Karath's underlings did not entirely share his point of view on situations, his determination and will was enough to see him promoted, making him an example for recruits and characters such as Dallan Morvis. There are inconsistencies about the date of Karath's destruction of Telos IV. In Star Wars: Knights of the Old Republic, when asked by the player, Carth Onasi answers that Karath destroyed Telos IV \"four years ago.\" The game takes place in the year 3,956 BBY, and The Complete Star Wars Encyclopedia's entry on Telos also states that Karath destroyed the planet in that same year. However, both the Knights of the Old Republic Campaign Guide and the New Essential Chronology contend that Karath razed the planet in 3,958 BBY.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Corellia/Legends",
  "/wiki/3956_BBY",
  "/wiki/Leviathan_(Interdictor-class_cruiser)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Sith_armada_(Jedi_Civil_War)",
  "/wiki/Carth_Onasi",
  "/wiki/Reproduction/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/3963_BBY",
  "/wiki/Military_rank/Legends",
  "/wiki/Rear_Admiral/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Jebble-Vanquo-Tarnith_line",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Zayne_Carrick",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan_Massacre",
  "/wiki/Planet/Legends",
  "/wiki/Serroco",
  "/wiki/Battle_of_Serroco",
  "/wiki/Mandalorian/Legends",
  "/wiki/Spy/Legends",
  "/wiki/The_Adasca_BioMechanical_Corporation_of_Arkania",
  "/wiki/Arkoh_Adasca",
  "/wiki/Flagship/Legends",
  "/wiki/Arkanian_Legacy",
  "/wiki/First_Battle_of_Omonoth",
  "/wiki/Exogorth/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Vindication",
  "/wiki/Jedi_Covenant",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Acolyte",
  "/wiki/Haazen",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Revanchist",
  "/wiki/Incident_near_Ithor_system",
  "/wiki/Slavery/Legends",
  "/wiki/The_Crucible",
  "/wiki/3960_BBY",
  "/wiki/Battle_of_Malachor_V",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Star_Forge",
  "/wiki/Space_station/Legends",
  "/wiki/3959_BBY",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/3958_BBY",
  "/wiki/Darth/Legends",
  "/wiki/Bombing_of_Telos_IV",
  "/wiki/Telos_IV",
  "/wiki/Death/Legends",
  "/wiki/Capture_of_Darth_Revan",
  "/wiki/Capture_of_Taris",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Destruction_of_Taris",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Calo_Nord",
  "/wiki/Rescue_of_Bastila_Shan",
  "/wiki/Jedi_training/Legends",
  "/wiki/Ambush_on_Tatooine_(Jedi_Civil_War)",
  "/wiki/Star_Map",
  "/wiki/Duel_in_Hrakert_Station",
  "/wiki/Shadow_Hand",
  "/wiki/Darth_Bandon",
  "/wiki/Starship/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Torture/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Skirmish_aboard_the_Leviathan",
  "/wiki/Lightfight",
  "/wiki/Lord/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Craddock_Karath",
  "/wiki/Youngling/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/3996_BBY",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Mandalorian_Crusaders",
  "/wiki/Mandalore_the_Indomitable",
  "/wiki/Battle_of_Foerost_(Great_Sith_War)",
  "/wiki/Shipyard/Legends",
  "/wiki/Foerost/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Dace_Golliard",
  "/wiki/Sith_Master/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Naval_Academy",
  "/wiki/Fleet_Captain/Legends",
  "/wiki/Orley_Vanicus",
  "/wiki/Captain/Legends",
  "/wiki/Reliance_I",
  "/wiki/Frigate/Legends",
  "/wiki/Reciprocity",
  "/wiki/Time/Legends",
  "/wiki/Convoy/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Dallan_Morvis",
  "/wiki/Unidentified_Twi%27lek_Jedi_(Valius_Ying)",
  "/wiki/Valius_Ying",
  "/wiki/Pilot/Legends",
  "/wiki/Inexpugnable-class_tactical_command_ship",
  "/wiki/Courageous_(Inexpugnable-class)",
  "/wiki/Warship/Legends",
  "/wiki/3964_BBY",
  "/wiki/Mandalore_the_Ultimate",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Suurja",
  "/wiki/First_battle_of_Suurja",
  "/wiki/Second_battle_of_Suurja",
  "/wiki/Third_battle_of_Suurja",
  "/wiki/Fourth_battle_of_Suurja",
  "/wiki/Vanquo",
  "/wiki/Battle_of_Vanquo",
  "/wiki/Mandalore_(title)",
  "/wiki/Taris_Siege",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/The_Last_Resort_(starship)",
  "/wiki/Hyperspace/Legends",
  "/wiki/Camp_Three_(Serroco)",
  "/wiki/Shad_Jelavan",
  "/wiki/Gorman_Vandrayk",
  "/wiki/Quartermaster-class_supply_carrier",
  "/wiki/Restaurant/Legends",
  "/wiki/Little_Bivoli",
  "/wiki/Force_vision/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Nuclear_bomb",
  "/wiki/Missile/Legends",
  "/wiki/Stereb",
  "/wiki/Stereb_cities",
  "/wiki/Prison/Legends",
  "/wiki/Neo-Crusader_Shock_Trooper",
  "/wiki/Commander/Legends",
  "/wiki/Deadweight",
  "/wiki/Admiral_of_the_Fleet/Legends",
  "/wiki/Hyperlane",
  "/wiki/Galactic_economy",
  "/wiki/Telerath/Legends",
  "/wiki/Myrkr/Legends",
  "/wiki/Ryyk_Nebula",
  "/wiki/Tremendous_battle_group",
  "/wiki/Arkania_Command",
  "/wiki/Arkania/Legends",
  "/wiki/Eejee_Vamm",
  "/wiki/Vacuum/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Star/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Mandalore_the_Ultimate%27s_battle-axe",
  "/wiki/Demagol",
  "/wiki/Neo-Crusader_armor",
  "/wiki/Republic_officer/Legends",
  "/wiki/Jarael",
  "/wiki/Galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Swiftsure_(Inexpugnable-class)",
  "/wiki/Moomo_Williwaw",
  "/wiki/Khil",
  "/wiki/Xamar",
  "/wiki/Vanjervalis_Chain",
  "/wiki/Sensor/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Space_warfare",
  "/wiki/Arkanian/Legends",
  "/wiki/Arkanian_Offshoot/Legends",
  "/wiki/Snivvian/Legends",
  "/wiki/Marn_Hierogryph",
  "/wiki/Draay_Trust",
  "/wiki/Vanjervalis_Systems",
  "/wiki/Draay_Estate",
  "/wiki/Veltraa",
  "/wiki/Slicer/Legends",
  "/wiki/Jammer",
  "/wiki/Showdown_in_the_Draay_Estate",
  "/wiki/Standard_day/Legends",
  "/wiki/Republic_Mercy_Corps",
  "/wiki/Second_Battle_of_Omonoth",
  "/wiki/Omonoth",
  "/wiki/Ministry_of_Defense",
  "/wiki/Ottega_system/Legends",
  "/wiki/Testament",
  "/wiki/Asteroid_belt",
  "/wiki/Cassus_Fett",
  "/wiki/Asteroid/Legends",
  "/wiki/Gladiator_(Crucible)",
  "/wiki/Laser/Legends",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Osadia",
  "/wiki/Telettoh",
  "/wiki/Malachor_V",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Interdictor-class_cruiser",
  "/wiki/Homeworld/Legends",
  "/wiki/City/Legends",
  "/wiki/Attack_on_the_Endar_Spire",
  "/wiki/Endar_Spire",
  "/wiki/Battle_meditation",
  "/wiki/Force_power/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Saul_Karath%27s_predecessor",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic#Alternatives_in_gameplay",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Bounty/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Attack_on_Dantooine_(Jedi_Civil_War)",
  "/wiki/Jedi_Enclave",
  "/wiki/Dantooine/Legends",
  "/wiki/Dantooine_Jedi_Enclave_Council",
  "/wiki/Selkath/Legends",
  "/wiki/Manaan/Legends",
  "/wiki/Korriban",
  "/wiki/Force_cage",
  "/wiki/Sector/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Varko_(Human)",
  "/wiki/Battle_of_Rakata_Prime",
  "/wiki/Lehon",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_Wars",
  "/wiki/3951_BBY",
  "/wiki/Kreia",
  "/wiki/Meetra_Surik",
  "/wiki/Telosian_Restoration_Project",
  "/wiki/Ithorian/Legends",
  "/wiki/Force_Adept",
  "/wiki/Chodo_Habat",
  "/wiki/Noble/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Durese/Legends",
  "/wiki/Khilese",
  "/wiki/Sullustese/Legends",
  "/wiki/Mando%27a/Legends",
  "/wiki/Bothese",
  "/wiki/Zabraki/Legends",
  "/wiki/Kuat_(language)",
  "/wiki/Verpine_prototype_shield",
  "/wiki/Verpine/Legends",
  "/wiki/Sith_assassin/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Code_cylinder/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Sith_officer",
  "/wiki/2003",
  "/wiki/Xbox",
  "/wiki/Personal_computer",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/BioWare",
  "/wiki/Robin_Sachs",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_(comic_series)",
  "/wiki/John_Jackson_Miller",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dustin_Weaver",
  "/wiki/Brian_Ching",
  "/wiki/Harvey_Tolibao",
  "/wiki/Bong_Dazo",
  "/wiki/Alan_Robinson",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/April",
  "/wiki/2012",
  "/wiki/Knights_of_the_Old_Republic:_War_4",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_War",
  "/wiki/Andrea_Mutti",
  "/wiki/Knights_of_the_Old_Republic_21",
  "/wiki/Category:Images_of_Saul_Karath",
  "/wiki/Knights_of_the_Old_Republic_0",
  "/wiki/The_Taris_Holofeed:_Prime_Edition",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic/Rebellion_flip-book",
  "/wiki/Knights_of_the_Old_Republic_8",
  "/wiki/The_Admiral%27s_List:_Jimas_Veltraa_Memorial_Edition",
  "/wiki/Knights_of_the_Old_Republic_13",
  "/wiki/Knights_of_the_Old_Republic_14",
  "/wiki/Knights_of_the_Old_Republic_15",
  "/wiki/The_Admiral%27s_List:_Remember_Serroco!_Edition",
  "/wiki/Knights_of_the_Old_Republic_16",
  "/wiki/Knights_of_the_Old_Republic_17",
  "/wiki/Knights_of_the_Old_Republic_18",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_Daze_of_Hate",
  "/wiki/Knights_of_the_Old_Republic_22",
  "/wiki/The_Admiral%27s_List:_Karath_Home_Safely",
  "/wiki/Knights_of_the_Old_Republic_30",
  "/wiki/Knights_of_the_Old_Republic_31",
  "/wiki/Knights_of_the_Old_Republic_32",
  "/wiki/Knights_of_the_Old_Republic_34",
  "/wiki/Knights_of_the_Old_Republic_35",
  "/wiki/Knights_of_the_Old_Republic_47",
  "/wiki/Knights_of_the_Old_Republic_49",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Cartel_Market",
  "/wiki/Chronicles_of_the_Old_Republic",
  "/wiki/Wizards.com",
  "/wiki/KOTOR_Campaign_Guide_Web_Enhancement_2:_Captain_Dallan_Morvis",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_1",
  "/wiki/Knights_of_the_Old_Republic_2",
  "/wiki/Knights_of_the_Old_Republic_20",
  "/wiki/Knights_of_the_Old_Republic_19",
  "/wiki/Knights_of_the_Old_Republic_36",
  "/wiki/Knights_of_the_Old_Republic_42",
  "/wiki/Timeline_8:_The_Jedi_Civil_War",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars_Insider",
  "/wiki/Heritage_of_the_Sith",
  "/wiki/Star_Wars_Insider_88",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/February_6",
  "/wiki/2013",
  "/wiki/January_22",
  "/wiki/2021"
 ]
}