{
 "name": "Saun Dann",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Saun Dann, also known as Sohn Dann, was a jovial Human male who worked as a trader on the Wookiee homeworld of Kashyyyk. He was also secretly a member of the Rebel Alliance who maintained his own network of connections. During the Life Day holiday of 1 ABY, when the Galactic Empire blockaded Kashyyyk and declared martial law on the world, an Imperial guard wandered into Dann's shop and took a groomer without paying, much to the trader's chagrin. Dann then made his way to the home of his Wookiee friend Chewbacca, who had not yet arrived home for the holiday, and whose family was worried about his absence.\nAfter Dann assuaged the Wookiees' fears and gave them all Life Day gifts, he reassured the Alliance's Princess Leia Organa—speaking to them via wallscreen—that the family would be safe. However, an Imperial search party entered the home on a hunt for ties to the Rebels. Dann nervously attempted to prevent the Imperials from discovering that Chewbacca, a well-known Alliance hero, was one of the home's residents, but the search party's Commander ordered him to leave. Dann later returned and found that a recently-arrived Chewbacca had eliminated a stormtrooper who had been left to guard the home, and the trader used the family's wallscreen to convince a suspicious Imperial officer that the trooper had fled his post.\nDuring another Life Day, which came at some point between 0 BBY and 3 ABY, Dann celebrated the occasion by ordering two cases of candy for children in need. When the shipment was late, he recruited a spacer to track it down, and the spacer discovered that the candy had been stolen and eaten by the stormtrooper TK-555. Dann resolved to find a replacement gift for the children. He again ordered candy for needy children the following Life Day, but the same fate befell it, and the spacer again brought the trader bad news.\nThe Human male Saun Dann, also known as Sohn Dann, was a trader who operated on the Wookiee homeworld of Kashyyyk. By the year 1 ABY, he had joined the Rebel Alliance, an underground movement that was waging the Galactic Civil War against the Galactic Empire. Dann ran a shop that was designated by the Empire as \"Trading post Wookiee Planet C,\" and he was a close friend to the family of the Wookiee Chewbacca, an Alliance hero. Dann once claimed to have a brother, as well as a nephew who was in the Imperial Military.\nMidway through 1 ABY, Chewbacca and his Human companion Han Solo were en route to Kashyyyk to celebrate the Wookiee holiday Life Day. However, the Empire blockaded the world and declared martial law in an effort to root out Rebel activity. An Imperial guard wandered into Dann's shop during the blockade and indicated that he was off-duty; Dann subsequently attempted to sell him a pocket-sized aquarium but was rebuffed by the fish-hating guard. Dann then offered the man a groomer but had to step away to answer a call on his wallscreen. Chewbacca's wife Mallatobuck appeared on the screen, and Dann, speaking in code, informed the worried Wookiee that Chewbacca and Solo were indeed on their way home. The trader then returned to his customer, who took the groomer without paying after Dann extolled the product's virtues.\nDann made his way to Chewbacca's treetop home in the city of Rwookrrorro with a delivery of Life Day gifts for the family, but he first had to make his way through an Imperial patrol. After arriving, he reassured the melancholy Wookiees that Chewbacca would make it through the patrol as well, and then distributed his gifts: a music box for Mallatobuck; a mini-transmitter and an instruction cassette for Chewbacca's son, Lumpawarrump; and a new proton pack for the mind evaporator that belonged to Chewbacca's father, Attichitcuk. When Attichitcuk sat down in the mind evaporator's chair, Dann covertly slipped him an erotic cassette that allowed the Wookiee to interact with Mermeia, a holographic fantasy woman. While Attichitcuk enjoyed some time with her, Dann was called over to the home's wallscreen by Mallatobuck, who was speaking to Princess Leia Organa of the Alliance. The trader identified himself as a Rebel agent and promised the Princess that he would look after Chewbacca's family until the Wookiee patriarch arrived home.\nThe sound of a starship screaming overhead excited the Wookiees, but when they opened the front door, they found two Imperial stormtroopers pointing blaster rifles at them. The troopers, along with a technician and an Imperial commander, entered the home in search of ties to the Rebels. Dann offered his services as a translator and constructed a tall tale regarding Chewbacca's absence, but the disinterested Commander merely demanded to see his identification. Dann then helped prevent a fight between Mallatobuck and the technician after the latter had his fingers bitten by Lumpawarrump, and was subsequently told by the Commander to leave the home. The trader stalled his departure by showing the technician a performance by a holographic seven-piece Human band within the music box, and it took blaster rifles pointed at him by the stormtroopers to finally convince him to leave.\nLater in the day, Dann returned to the home and found Chewbacca, who was expecting more Imperials to arrive, pointing a bowcaster at him. The search party had earlier departed but had left the stormtrooper B4711 behind to guard the home, and B4711 had subsequently been sent tumbling down to the forest floor by Chewbacca and Solo upon their arrival. Dann's presence calmed Chewbacca down, but an Imperial officer appeared on the wallscreen, issuing a general alert for B4711 to answer his comlink. Dann inserted his identification into the wallscreen and contacted the officer, telling him that the errant stormtrooper had stolen some food and fled into the forest. His lie was accepted, and Dann left the home after wishing the relieved Wookiees a happy Life Day.\nAt some point between 0 BBY and 3 ABY, just prior to another occurrence of Life Day, Dann ordered two cases of candy from the city of Keren on the planet Naboo. He hoped to distribute it to poor children in one of three cities: Doaba Guerfel, Corellia; Dearic, Talus; or Wayfar, Tatooine. While he waited for the shipment to arrive, he visited the public Life Day trees in all three cities.\nWhile at one of the city's trees, Dann grew worried over the lateness of the shipment and enlisted the help of a passing spacer whom he had heard was skilled at problem-solving. The spacer agreed to search for the missing candy and was sent by Dann to speak to the Shipping Master of Keren's Kwilaan Starport. The spacer's investigation led to Tatooine's city of Mos Espa and a confrontation with the stormtrooper TK-555, who had stolen and eaten the candy for himself. When the spacer returned to Dann and revealed the candy's fate, the distraught trader decided to find a replacement gift for the children. He thanked the spacer and remained at the Life Day tree for some time, selling special holiday products.\nThe following Life Day, Dann ordered more candy for the children of one of the three cities, which again went missing. After visiting all three Life Day trees, he was greeted by the spacer in front of one of them and asked for assistance one more time. The individual was reluctant to help, suspecting that the same fate had befallen the candy, but nevertheless agreed and set off for Keren's Kwilaan Starport. When the spacer returned and confirmed that the candy had once again been eaten by TK-555, a thankful Dann rewarded the individual with one of two prizes: a Decorative Fruitcake or decorative varactyl egg nog. While deciding on a suitable replacement gift, Dann again remained at the Life Day tree to hawk his wares.\nSaun Dann was a jovial individual who ordered candy for children in need during Life Day. He grew worried when the shipment was late and recruited a spacer to retrieve it, and when he discovered that the candy had been stolen, he fashioned replacement gifts from his own supplies. As a shop owner, Dann pandered to his customers and was quick to agree with their stated preferences while trying to make a sale. When an Imperial guard took a groomer without paying, Dann allowed it to happen but muttered to himself about the injustice. Although outwardly cooperative with Imperials, the trader was secretly a member of the Rebel Alliance who had his own network of connections. Dann had light skin, gray hair and brown eyes, and he sometimes wore spectacles. He could speak Galactic Basic Standard and could additionally understand Shyriiwook. In 1 ABY, his belly was ample and his hygiene subpar; he was aware of both of those traits, and he claimed to have been thinner in his younger days.\nDann was very close to the Wookiees of Chewbacca's family. He made his way through an Imperial patrol in order to bring them Life Day gifts, including virtual pornography for Attichitcuk, which he covertly slipped to the elderly Wookiee. When Dann entered the home and found Chewbacca pointing a bowcaster at him, he merely smiled and made a wisecrack about feeling welcome. While the Imperial search party was in the home, Dann employed many delaying tactics in an attempt to prevent them from discovering that the famous Rebel Chewbacca was one of the home's residents. Although he was nervous and often reduced to stammering, Dann was a quick thinker, and he tried to sell products to the Imperials; offered to cook them food; and distracted them with holographic entertainment, which he made a show of turning on. Despite a dismissal from the Imperial Commander, Dann was unwilling to depart until he found blaster rifles aimed his way.\nThe character of Saun Dann was created for 1978's The Star Wars Holiday Special, a television variety show spin-off of 1977's original Star Wars film. While crafting the special, writer George Lucas envisioned a story told completely by Wookiees, but executive producers Dwight Hemion and Gary Smith were hesitant due to the Wookiees not speaking English. The idea of a character serving as the liaison between the Wookiees and the English-speaking world was thus conceived. In early story treatments of the special, the character, known only as \"the Trader,\" arrives at Chewbacca's home and gives him a video book to pass on to Lumpy as a surprise present for an annual galactic festival being hosted that year by the Wookiee planet. Although \"folksy and kind,\" the Trader is disinterested in the festival due to its ban on commercialism and his lack of a family with whom to spend it. He then turns down an invitation to eat dinner with Chewbacca's family, preferring to not become personally involved with his customers.\nThe Trader then takes his starship to the planet Tatooine in order to spend the holiday drinking with his friends, and upon landing, discovers that Lumpy—fascinated by the trader's video book and unaware that he is receiving one himself—has stowed away aboard. He brings the young Wookiee to the Mos Eisley Cantina and begins drinking heavily while Lumpy explores, but he is eventually contacted by Chewbacca on a wallscreen and agrees to send the child back to the Wookiee planet aboard the Starship Musica, which is already headed there due to the festival. Chewbacca ends up safely landing the ship following Imperial sabotage, and back at the Wookiee planet, the Trader congratulates the Wookiee on giving the galaxy the greatest gift of all: his own talent, courage, and determination.\nEventually dubbed Saun Dann, the trader character was played in the Holiday Special by actor Art Carney, whose greatest claim to fame at the time was his portrayal of New York City sewer worker Ed Norton on the 1950s sitcom The Honeymooners. Saun Dann has been compared to Norton by Star Wars author Alex Newborn and described by Frank DiGiacomo of Vanity Fair magazine as doing an \"Ed Norton in space routine\"—in fact, the Holiday Special's script at one point calls for Carney to do his \"Norton schtick.\" Actor Lev Mailer, who portrayed the Imperial guard who wanders into Dann's shop, has described his scene with Carney as an example of the classic \"The Bully and The Idiot\" comedy duo routine, with Carney playing the idiot to his bully. Having grown up watching The Honeymooners, Mailer was honored to be able to work with Carney and to be the straight man to his jokes.\nThe fourth draft of the Holiday Special's script describes Dann—one of thirty trading agents on the planet—as a kind, older pharmacist at the corner drug store, whose clothing is a bit frayed around the edges and who \"seems to be in a state of perpetual frazzle.\" When Dann gives Attichitcuk the Mermeia cassette, he is likened to a dirty old man who is acting \"as if he is giving  the most X-rated piece of literature in the galaxy.\" Several of Dann's lines that were present in the script's fourth draft went unused in the Holiday Special's final cut, including a scene where he offers Wookiee-ookiees to the Imperials who invade Chewbacca's home. When Dann leaves the home in the final version of the Holiday Special, Chewbacca's family appears to travel through space and time on their way to Kashyyyk's Tree of Life, a scene which was explained in the script by Dann first turning on an environmental transporter. However, this concept ultimately went unused. The French dub of the Holiday Special sees Dann reference real-world culture by comparing Wookiee food to French cuisine.\nDann's role in the Holiday Special was also used as an idea during development of the 1980 film Star Wars: Episode V The Empire Strikes Back for the character of Lando Calrissian, who was at one point conceived of as a gambler who operated a general store on a Wookiee planet. Dann himself has been mentioned in several Star Wars reference works, but his only other appearance in canon has been in the online massively multiplayer online roleplaying game Star Wars Galaxies. He was added to the game as a non-playable character during its 2008 Life Day events, which allowed the player to undertake a quest on his behalf. Dann could be seen at the Life Day trees in three different locations, and he would claim to have ordered Life Day candy for the children of the city in which the player spoke to him.\nAfter completing the quest, the player could choose whether or not to reveal to Dann that a stormtrooper had eaten the candy, but neither choice affected the outcome of the quest, which offered no reward to the player. Dann was again added to the game during its 2009 Life Day events, where the player could undertake the same quest regardless of whether they had done so the year before. It played out nearly identically, with a major difference being that Dann offered a reward to the player: either a fruit cake or varactyl egg nog. Galaxies was shut down in December 2011, and the Life Day events were re-added to the game in the weeks before the closure. His name, Sohn Dann, is also a cheat code for the 2008 video game Star Wars: The Force Unleashed, and is used to unlock all costumes in the game.\nSaun Dann's name has been spelled inconsistently for years. The Holiday Special's script uses \"Saun Dann,\" but at one point calls him \"Saundan.\" The latter spelling re-appears once in the seventy-fifth issue of Star Wars Insider , while both Galaxies and the 106th issue of Insider  use \"Saun Dann.\" A third spelling, \"Sohn Dann,\" is asserted by both 2008's The Complete Star Wars Encyclopedia and Lando Calrissian's Databank entry on StarWars.com. Due to the frequency and recentness of both \"Saun Dann\" and \"Sohn Dann,\" this article treats both spellings as canonical but favors \"Saun Dann\" due to its use in the Holiday Special's script.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Life_Day/Legends",
  "/wiki/Holiday",
  "/wiki/1_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/Planet/Legends",
  "/wiki/Unidentified_Imperial_guard",
  "/wiki/Trading_post_Wookiee_Planet_C",
  "/wiki/Groomer",
  "/wiki/Chewbacca%27s_home",
  "/wiki/Chewbacca/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Wallscreen",
  "/wiki/Unidentified_Imperial_commander_(Blockade_of_Kashyyyk)",
  "/wiki/B4711",
  "/wiki/Unidentified_Imperial_officer_(wallscreen)",
  "/wiki/Stormtrooper/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/TK-555",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Attichitcuk%27s_family",
  "/wiki/Saun_Dann%27s_brother",
  "/wiki/Saun_Dann%27s_nephew",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Pocket-sized_aquarium",
  "/wiki/Marriage/Legends",
  "/wiki/Mallatobuck/Legends",
  "/wiki/City/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/Music_box/Legends",
  "/wiki/Mini-transmitter",
  "/wiki/Instruction_cassette",
  "/wiki/Lumpawaroo/Legends",
  "/wiki/Proton_pack",
  "/wiki/Mind_evaporator/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Attichitcuk/Legends",
  "/wiki/Cassette",
  "/wiki/Mermeia",
  "/wiki/Hologram/Legends",
  "/wiki/Time/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Starship/Legends",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Unidentified_Imperial_technician",
  "/wiki/Interpreter",
  "/wiki/Commander/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Unidentified_Human_band",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Bowcaster/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Keren/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Doaba_Guerfel/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Dearic/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Wayfar",
  "/wiki/Tatooine/Legends",
  "/wiki/Life_Day_tree",
  "/wiki/Canon",
  "/wiki/Keren_Shipping_Master",
  "/wiki/Kwilaan_Starport/Legends",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Decorative_Fruitcake",
  "/wiki/Varactyl_egg_nog",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Spectacles",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Virtual_reality",
  "/wiki/Pornography",
  "/wiki/Holograph",
  "/wiki/Blaster/Legends",
  "/wiki/Rifle/Legends",
  "/wiki/1978",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/George_Lucas",
  "/wiki/Dwight_Hemion",
  "/wiki/Gary_Smith",
  "/wiki/Video_book",
  "/wiki/The_galaxy/Legends",
  "/wiki/Peter_Mayhew",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Starship_Musica",
  "/wiki/Saboteur/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Art_Carney",
  "/wiki/1950s",
  "/wiki/Star_Wars",
  "/wiki/Alex_Newborn",
  "/wiki/Lev_Mailer",
  "/wiki/Wookiee-ookiee",
  "/wiki/Realspace/Legends",
  "/wiki/Tree_of_Life/Legends",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/2008",
  "/wiki/2009",
  "/wiki/Egg/Legends",
  "/wiki/December",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Force_Unleashed",
  "/wiki/Star_Wars_Insider_75",
  "/wiki/Star_Wars_Insider",
  "/wiki/2004",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/The_Star_Wars_Holiday_Special_(article)",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/Star_Sightings",
  "/wiki/I_Have_a_Bad_Feeling_About_This!",
  "/wiki/Sony",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/In-universe",
  "/wiki/Tyrant%27s_Test",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Starwarsholidayspecial.com",
  "/wiki/January_21",
  "/wiki/2013",
  "/wiki/July_10",
  "/wiki/2012",
  "/wiki/December_22",
  "/wiki/August_29",
  "/wiki/2010",
  "/wiki/November_11",
  "/wiki/August_6",
  "/wiki/June_24",
  "/wiki/April_6",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/October_14"
 ]
}