{
 "name": "Sav_Malag%C3%A1n",
 "display_name": "Sav Malagán",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kyuzo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Sav Malagán's Master"
     ]
    }
   ]
  }
 ],
 "content": "Sav Malagán was a Kyuzo female Jedi Master who served the Jedi Order during the High Republic Era, stationed at the Jedi Temple on Takodana. She wielded two purple-bladed lightsabers in combat, and wore brown Jedi robes and a Kyuzo war shield. During her time at the temple, she helped Maz Kanata in taking care of an infant Qort, and eventually fought the Nihil. She watched over the temple, welcoming the Star Hopper Padawans as they arrived to help after the attack, and looked on as Qort fought the Nihil once more.\nThe Force-sensitive Kyuzo Sav Malagán became a member of the Jedi Order over a century before 231 BBY. She eventually became the Padawan of a male Jedi. During her apprenticeship, Malagán befriended the pirate queen Maz Kanata, and aggravated her Master by going undercover without permission to fight alongside Kanata's crew in the Battle of Jedha.\nBy the High Republic Era, Malagán, now a Jedi Master herself, was stationed at the Jedi Temple on the planet Takodana, across Nymeve Lake from Kanata's Takodana Castle. When Kanata abruptly found herself caring for an Aloxian infant whose origins she did not know, the pirate decided to ask Malagán for help after learning of the child's origins from the Patrolian Farks. The child, Qort, was subsequently discovered to be Force-sensitive himself and was given over to the Jedi Order, becoming a Jedi youngling, although he was remembered by Malagán, Kanata, and other Takodana residents.\nIn 231 BBY, a group of Nihil led by Krix Kamerat attacked the Jedi Temple Malagán was stationed at, their fighters descending over Nymeve Lake. Malagán took to the skies after dodging a blast from a Nihil fighter, jumping from ship to ship taking them out with her twin purple lightsabers. Krix alone escaped, returning to Dol'har Hyde with news of his failure at Malagán's hands, and preparing for another attack. Upon examining some wreckage, Malagán came upon Bareen and Sabata Krill, who claimed they intended to defect from the Nihil want to help.\nWhen the Star Hopper arrived, Malagán and Kanata greeted the Padawans, and were particularly excited to see Qort. Malagán introduced the Krill sisters, and brought the Padawans into the temple to set up defenses and prepare for any other Nihil activity. She revealed some pirate equipment borrowed from Kanata from under a sheet, to Farzala Tarabal's surprise. Setting up canons in an upper level of the temple, Lula Talisola asked Malagán why she still wore her traditional Kyuzo war helmet. Malagán answered that it was because of the hat's many uses, and promptly threw it below the foot of Sabata Krill, knowing she was feigning innocence and tripping her. Just then, planted thermal detonators were ignited across the temple, destroying it.\nAs Malagán and the rest were recovering from the explosion, Krix's Nihil fighters arrived. His mask destroyed, and thinking of Malagán's teachings, Qort unleashed his true abilities and took to the skies, taking down the Nihil's ships. From the edge of the lake, Malagán and Kanata watched Qort with awe, joking that he takes after both of them. Kanata was also concerned about some of the antiquities lost in the destruction of the temple, but Malagán dismissed it, asking if she could crash at Maz's Castle for a while.\nSav Malagán was a female Kyuzo with green skin and orange eyes. She was capable of keeping a serene demeanour even in the midst of battle, and was observant of others' behaviour. A long-time friend of Maz Kanata, Malagán valued the pirate's company, and the two had caf and slumber parties together, and often laughed about their past adventures. Despite the Jedi beliefs against attachments, which included ties to one's original culture, Malagán wore and used a traditional Kyuzo war shield, which she stated was due to the armored hat's many practical uses.\nAs a Jedi Master, Sav Malagán was highly skilled in the use of her Force powers and lightsaber combat, driving off the first wave of a Nihil attack on Takodana by herself with only her weapons and abilities with no difficulty.\nSav Malagán wore cream-and-brown Jedi robes and a grey Kyuzo war shield hat. She wielded two purple-bladed lightsabers which could connect together when not in use.\nSav Malagán was first shown in a preview for The High Republic Adventures  8 released on Cinelinx shortly before the comic's publication on September 1, 2021. Comic author Daniel José Older identified her in response to a question on Twitter asking if that was a Kyuzo Jedi, revealing she was the \"most badass\" Jedi he had ever written and that he had been able to design her lightsaber, which he said was a first for him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/Kyuzo",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Sav_Malag%C3%A1n%27s_Master",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_Temple_(Takodana)",
  "/wiki/Takodana",
  "/wiki/Lightsaber",
  "/wiki/Jedi_robes",
  "/wiki/Kyuzo_war_shield",
  "/wiki/Maz_Kanata",
  "/wiki/Qort",
  "/wiki/Attack_on_Takodana",
  "/wiki/Nihil",
  "/wiki/Star_Hopper",
  "/wiki/Force-sensitive",
  "/wiki/Standard_century",
  "/wiki/231_BBY",
  "/wiki/Padawan",
  "/wiki/Pirate_king",
  "/wiki/Battle_of_Jedha",
  "/wiki/Jedi",
  "/wiki/Planet",
  "/wiki/Nymeve_Lake",
  "/wiki/Takodana_Castle",
  "/wiki/Aloxian",
  "/wiki/Patrolian",
  "/wiki/Farks",
  "/wiki/Jedi_Initiate",
  "/wiki/Krix_Kamerat",
  "/wiki/Dol%27har_Hyde",
  "/wiki/Farzala_Tarabal",
  "/wiki/Lula_Talisola",
  "/wiki/Thermal_detonator",
  "/wiki/Eye",
  "/wiki/Caf",
  "/wiki/Armor",
  "/wiki/Force_power",
  "/wiki/Lightsaber_combat",
  "/wiki/Shield_(physical_armor)",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/September_1",
  "/wiki/2021",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/The_High_Republic_Adventures_(2022)_1",
  "/wiki/The_High_Republic_Adventures_(2022)_2",
  "/wiki/The_High_Republic_Adventures_(2022)_3",
  "/wiki/The_High_Republic_Adventures_(2021)_9",
  "/wiki/The_High_Republic_Adventures_(2021)_10",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Sav_Malag%C3%A1n",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Attack_on_Valo",
  "/wiki/Battle_of_Grizal",
  "/wiki/Time",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/August_30"
 ]
}