{
 "name": "Savax",
 "display_name": "Savax",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Uba IV"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 19 BBY and 3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ubese"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Savax Clan-Vorsazg, War-Master of the Southern Wastes, was the Ubese clan leader who led a coalition of \"True\" Ubese clans from Uba IV against the \"yrak pootzck\" Ubese of Ubertica.\nSavax's campaign was motivated by jealousy and vengeance. He saw the people of Ubertica as living in luxury under Republican and later Imperial overlords, while the Ubese on their original homeworld had struggled to survive since the bombardment of the Uba system over one thousand years ago. Savax considered the destruction of Ubertica, and the deaths of all of its people, necessary for the \"True\" Ubese to escape the curse of history and take back their true place in the galaxy.\nIn the strike against Ubertica, Savax's forces consisted of five capital ships, crewed by a coalition of several of Uba IV's clans. It is rumored that these ships were supplied by the Hutts. Though his forces were easily able to lay waste to many of Ubertica's cities, all five ships were vaporized by the Imperial forces which intervened. A datafile written by Savax, where he laid out his justifications for his genocidal acts, was found among the wreckage of his fleet.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Uba_IV/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Ubese/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Clan-Vorsazg",
  "/wiki/War-Master",
  "/wiki/Southern_Wastes",
  "/wiki/Ubertica",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bombardment_of_the_Uba_system",
  "/wiki/The_galaxy/Legends",
  "/wiki/Strike_against_Ubertica",
  "/wiki/Capital_ship/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Datafile/Legends",
  "/wiki/West_End_Games",
  "/wiki/We_Are_Made_of_Suffering",
  "/wiki/Shadows_of_the_Empire_Sourcebook"
 ]
}