{
 "name": "Savan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Falleen"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Falleen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.78 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Savan was a member of a Falleen royal family and the niece of Prince Xizor. While the rest of Xizor's family was on Falleen, Savan was offworld working for her uncle, therefore escaping Darth Vader's incineration of their home city. Following Xizor's death in 3 ABY, she temporarily became the unofficial Underlord of Black Sun. She was arrested by the New Republic on Hurd's Moon shortly after the Battle of Endor, while trying to acquire Guri.\nSavan grew up as a member of one of the royal families of Falleen, quickly adapting to the constant scheming and fighting for position and prestige. She also came into contact with the Black Sun criminal organization, presumably through her uncle, Prince Xizor. It is not known exactly when Savan joined Black Sun, but in 7 BBY, she worked for her uncle's syndicate offworld, being one of the relatively small number of Falleen to leave their planet of origin. This was the reason why she was not present during the Imperial bombardment that killed much of her family. She was presumed dead by the authorities, although her body was never found, and she never corrected this assumption, as the anonymity that this conferred to her proved useful in her criminal career. It is unknown whether even Xizor himself knew of her survival; if he did, he never revealed it.\nOver the following years, Savan kept a low profile, working herself up through the ranks of her uncle's criminal empire. After Xizor's death, she gathered her strength and attempted to take control of Black Sun herself in 4 ABY. Disguised as a dark-haired Human woman, she somehow gained a seat on the council of the Vigos, the one remnant of central Black Sun authority. She replaced Green, the Human Vigo Xizor had had executed for treason shortly before his own demise. True to her Falleen heritage, she quickly managed to exploit the vigos' differences and turn them against one another. While outwardly struggling to unite the bickering factions of the council, she controlled a widespread intelligence network that actually propagated their conflicts, escalating the various feuds until they resembled a virtual civil war. By dividing and conquering, she hoped to leave none of her rivals strong enough to challenge her ascent to power. One object was to give her the decisive advantage she required in order to move openly - her uncle's Human replica droid, Guri.\nSavan knew that Guri carried many of the most important secrets of Black Sun in her electronic memory, given to her by Xizor himself when she had served as his lieutenant and chief enforcer. What's more, she also knew that she was the only person alive to know Guri's master command codes, which were based on her family's DNA configuration. Once apprehended, the droid would serve her as loyally as she had Xizor. Thus, Savan, under the alias of the elderly Falleen shopkeeper Azool, contracted the Hiitian bounty hunter Kar Yang to capture Guri for her. Unbeknownst to the hunter, she was also using his droid, Lintu, to spy on him and ensure his loyalty. Shortly thereafter, she was attacked by the Rodian Prevaro, who believed \"Azool\" to be Xizor in disguise. She resolved this situation peacefully by revealing her true identity to him and making him her new chief lieutenant.\nMeanwhile, Yang followed Guri's trail from Hurd's Moon to Murninkam and back to the moon, but realized that something was wrong and executed his assistant droid. He continued his mission, but now planned to capture Guri for himself and sell her. Realizing that her treachery had backfired, Savan prepared to travel to Hurd's Moon herself to personally supervise Guri's capture. She did, however, make one final appearance in her Human disguise, approaching an Alliance party led by Princess Leia Organa and Han Solo on behalf of her Black Sun faction, and tried to negotiate a truce. The meeting was attacked before anything conclusive came out of it, apparently by soldiers from a rival faction, but this was actually a false-flag operation masterminded by Savan herself to garner trust with the Rebels. Princess Leia became suspicious of her, however, and later managed to discover her true identity.\nWhen they arrived on Hurd's Moon, Savan and Prevaro quickly found out that Guri was in the custody of Massad Thrumble, a retired Imperial Admiral and droid engineer. They then raised a small army of local thugs to attack Thrumble's stronghold. Unbeknownst to them, two other parties were also marshaling to strike at the fortress: one an Alliance party comprising Han Solo, Leia Organa, Lando Calrissian, Chewbacca, and Luke Skywalker; the other being made up of rogue scientist Spinda Caveel, who also wanted the information Guri carried, and his bodyguards, the Pikkel Sisters.\nWhen entering the fortress, Savan dispatched most of her soldiers to keep the others occupied while she searched for Guri. She found her with Thrumble and his medical droid, A-OIC, who were trying to escape the battle. Keeping a blaster trailed on them, she approached Guri and, smiling triumphantly, whispered the master command code in her ear. Seemingly getting the desired reaction, she then turned the deadly assassin droid loose on the researcher and his droid. To her surprise and horror, Guri suddenly turned around and attacked her instead, knocking her unconscious. It was later revealed that the code, presumably together with whatever knowledge of Black Sun she may have held, had been wiped from Guri's memory by Thrumble scant hours before.\nMeanwhile, the Alliance party had gained the upper hand and moved in to arrest Savan. She was taken away by the local authorities, although it is uncertain what crimes she was actually charged with. As it turned out, all of Savan's efforts had been for naught, and Black Sun crumbled beneath the internecine wars that she had instigated. As the Vigos one by one killed each other, central authority disappeared, and the organization, left leaderless, fragmented. All this went according to plan, but Savan was no longer in any position to take advantage of it.\nLike all Falleen, Savan presumably possessed the ability to produce Pheromones in order to attract humanoids of the opposite sex, as well as immunity to mind-affecting Force techniques, such as the infamous Jedi mind trick. She was also a good planner, able to predict the exact point at which the Black Sun leadership would deteriorate and time her actions accordingly. As was required of her in order to keep her true identity hidden, she was also adept at disguise and impersonation, able to pass for an elderly Falleen male or a Human woman using only plastic masks. Savan was also able to handle a transport starship and a blaster, perhaps as a legacy from her days as a lower echelon Black Sun operative.\nLike her uncle, Savan was proud and vain. Although not afraid to handle lower-level work personally if she had to, she typically espoused contempt for mercenaries and low-ranking Black Sun soldiers, which she saw as inferior. Her personality, perhaps formed by her Falleen upbringing among the intriguing noble houses, was otherwise calculating and distrusting. She preferred to maintain complete control of major operations and disliked delegating responsibility.\nWhen she first appeared in Shadows of the Empire: Evolution 2, Savan was portrayed as having brown eyes. In all her subsequent appearances, her eyes have been shown as purple.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Falleen_(planet)/Legends",
  "/wiki/Falleen/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Underlord",
  "/wiki/New_Republic/Legends",
  "/wiki/Hurd%27s_Moon",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Guri",
  "/wiki/7_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Human/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Green",
  "/wiki/Treason/Legends",
  "/wiki/Human_replica_droid",
  "/wiki/DNA/Legends",
  "/wiki/Azool",
  "/wiki/Hiitian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Kar_Yang",
  "/wiki/Droid/Legends",
  "/wiki/Lintu",
  "/wiki/Rodian/Legends",
  "/wiki/Prevaro",
  "/wiki/Murninkam",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Skahtul",
  "/wiki/Massad_Thrumble",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Spinda_Caveel",
  "/wiki/Pikkel_Sisters",
  "/wiki/A-OIC",
  "/wiki/Blaster/Legends",
  "/wiki/Pheromone",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Shadows_of_the_Empire:_Evolution_2",
  "/wiki/Category:Images_of_Savan",
  "/wiki/Shadows_of_the_Empire:_Evolution_1",
  "/wiki/Shadows_of_the_Empire:_Evolution_3",
  "/wiki/Shadows_of_the_Empire:_Evolution_4",
  "/wiki/Shadows_of_the_Empire:_Evolution_5",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Around_the_Galaxy",
  "/wiki/Star_Wars_Galaxy_Collector_1",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_130",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/The_Shadow_Syndicate",
  "/wiki/Template:SWGTCG",
  "/wiki/Databank_(original)",
  "/wiki/Republic_49",
  "/wiki/Shadows_of_the_Empire:_Evolution",
  "/wiki/Fliry_Vorru"
 ]
}