{
 "name": "Savage Opress",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.89 meters",
      "2.18 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grayish-green; yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic left arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Nightbrothers"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith",
      "Confederacy of Independent Systems",
      "Shadow Collective"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Viscus",
      "Asajj Ventress",
      "Darth Tyranus",
      "Darth Maul"
     ]
    }
   ]
  }
 ],
 "content": "Savage Opress  was the younger brother of Maul and the older brother of Feral. A Force-sensitive Dathomirian Nightbrother, he became a Sith apprentice under Count Dooku and later became a Sith Lord, apprenticed to Maul, who was a renegade Sith Lord during the Clone Wars.\nOriginally a tribal leader on Dathomir, Opress was handpicked by the Nightsister Asajj Ventress to become her \"mate\" and servant following her grueling tests of Selection, as part of her bid for revenge on her former Master, the Sith Lord Count Dooku. In accordance with their plot against Dooku, Mother Talzin and her Nightsister witches employed their dark magic to grant Opress fearsome abilities, such as a strong, raw connection to the Force and domineering physical power. After murdering his beloved brother Feral in a display of loyalty to Ventress, Opress entered the Clone Wars as a Dark Acolyte, serving as an enforcer in Dooku's Confederacy of Independent Systems.\nImmediately, Opress established himself as a dangerous warrior and a force to be reckoned with. However, Opress soon realized he was being used by Ventress and when Ventress sprung the trap and tried to defeat Dooku with his help, he betrayed both her and Dooku. He would return to Dathomir, where Mother Talzin sent on a quest to seek his long-lost brother and Talzin's son Maul. Opress was led to the junkyard world of Lotho Minor by the Talisman of Finding, where he found his brother Maul, a deranged and broken shell of his former self. He brought his brother back to Dathomir and to Talzin, who restored both his mind and his legs. She then left the pair together as Maul became reconnected with the drastically-changed galaxy around him. He and Opress then joined forces, embarking on a quest to exact vengeance on Jedi Master Obi-Wan Kenobi, sowing death and chaos throughout the galaxy as they went.\nEventually, Opress was forced to become his brother's apprentice in accordance with the Rule of Two. After Opress lost his arm in battle against Kenobi on Florrum, the pair fled and eventually allied themselves with Pre Vizsla and Death Watch. Opress continued to serve his brother's vision as Maul created the Shadow Collective. Their new power conquered Mandalore and killed Obi-Wan's lover, Duchess Satine Kryze. Opress stood by his brother as he enacted his revenge, but they were soon faced by Maul's old master, Darth Sidious, who had judged the pair to be a significant threat. Sidious dueled Maul and Savage, and ultimately slew Opress in battle. As the Nightsister magic left Opress's body, he apologized to his brother and admitted that he was never like him, transforming back to his initial form before dying in Maul's arms.\nSavage Opress was born on Dathomir to Mother Talzin. By the time of the Clone Wars, Opress lived in the Nightbrother village on the planet Dathomir. As part of the Nightsister Asajj Ventress's plot for revenge on her former Master, the Sith Lord Count Dooku, she traveled to the Nightbrother village to select a warrior to serve Dooku but secretly be controlled by the Nightsisters so they could exact their revenge. As Ventress put the group of Nightbrothers through her grueling tests of Selection, which involved the deaths of many of the candidates, Opress emerged as an excellent, fearsome, and brave warrior, and he was handpicked by Ventress to become her servant.\nIn accordance with their plot against Dooku, Mother Talzin and her Nightsister witches employed their magicks to grant Opress fearsome abilities, greatly amplifying his strength and aggression as well as physically transforming him into a hulking and imposing brute. Opress grew in height and physical size significantly, and even the horns on his head grew much larger. After choking his brother Feral, a brother who he had fiercely protected during the Selection, to death in a display of loyalty to Ventress, Opress was equipped with armor and a mystically enhanced spear before being offered to Dooku as a Dark Acolyte by Talzin. Dooku accepted Opress, allowing for him to enter the Clone Wars as his personal enforcer. Opress was initially sent to execute a mission against the Galactic Republic on the planet Devaron to prove himself, aiding the Separatist forces that were attacking the Temple of Eedit. Opress slaughtered a group of clone troopers and slew his first Jedi, Master, Halsey, and his Padawan Knox, overpowering them with his brute strength, endurance, and hand-to-hand combat skills. Opress soon became apprenticed to Dooku, who intended to use his new acolyte to overthrow his own master, Darth Sidious, and claim control of the galaxy.\nWhile Opress was subjected to brutal Sith training under Dooku's charge, Ventress prepared to pit the monstrous Nightbrother against Dooku when the time was right. Opress began to use a double-bladed lightsaber as his training progressed. Although Dooku easily defeated him while dueling and disdainfully noted his sloppiness and lack of technique, he admitted that Opress could grow very powerful if he was trained properly. Outside, on the castle grounds, Dooku heavily tested Opress and his abilities, forcing him to lift a dozen obelisk stones at once telekinetically. When Opress was unable to accomplish the feat, he was continuously shocked with Force lightning as punishment for his failure. Opress grew angry as he was subjected to the tasks as well as the punishments for failing them.\nEventually, Opress was sent on a mission to Toydaria, where he was tasked with capturing the Toydarian King Katuunko. Opress slaughtered several guards and forced his way inside the royal palace, but accidentally killed Katuunko by Force choking him. He was confronted by Jedi Knight Anakin Skywalker and Jedi Master Obi-Wan Kenobi, but he bulled his way past them and returned to Dooku with the King's corpse. Opress was again subjected to Force lightning as punishment for killing the King instead of bringing him back alive, and when he begged for mercy from his master, Dooku replied that mercy was not the way of the Dark Side. However, Ventress soon arrived and enacted her plans for revenge, revealing Opress's hidden allegiance to her and attacking her former master. While disarming Dooku and knocking him down initially, he would then be repeatedly overwhelmed and weakened by Dooku's Force lightning.\nA furious Ventress ordered him to kill Dooku, but after Dooku fired his Force Lightning at him again, an exhausted Opress claimed that Dooku was too powerful, but this caused Ventress to berate him. Being tortured by Dooku and berated by Ventress, caused Opress to eventually overcome Ventress's spell of control and also terminate his service to Dooku. He Force choked them both in a fit of rage, and threw them back. He then viciously attacked both of them and initially had the upper hand, but was then thrown back by Dooku and Ventress. Dooku proceeded to escape and Ventress followed him, leaving Opress alone who then proceeded to escape, further battling his way through Skywalker and Kenobi as well as an army of droids. Opress eventually made his way to the hangar and escaped and headed to Dathomir. Returning to Talzin, he told her that Ventress betrayed him, and then learned of his kinship to the former Sith apprentice Maul. Talzin told him to track down his lost brother and train under him.\nOpress's search for his brother took him to the Outer Rim. When he was pursued by the authorities after an altercation at a diner on Stobar, he encountered a an assortment of cargo crates that gave him clues to his brother's location. Locating the nearest ship, he forced the captain of the ship to let him travel with him to the planet Lotho Minor and later tossed the unfortunate man out of the ship when they arrived. As he began to search, he was greeted by the Anacondan Morley, who offered to be his guide. Opress at first refused, but after realizing that he would have little success locating his brother on the dangerous and unfamiliar world alone, he begrudgingly followed Morley, who told him that he had seen another of his kind on the planet.\nNavigating through the tunnels of junk, slaying numerous Junkers, and evading acid rain, Opress eventually discovered what he believed to be his brother's residence. However, when his talisman stopped glowing, he became frustrated. Just then, he was tricked by Morley, who sent him falling through the junk into a tunnel, with the Anacondan noting that he would soon be killed by his master. After wandering the tunnels, Opress was attacked by a spider-like creature, which Opress soon realized was his deranged brother with cybernetic legs. Upon realizing this, Opress chased after his brother, calling out to him until he caught up to him in a cavern. Opress tried to communicate with his sibling, but Maul's words were only desperate and nonsensical ravings.\nAfter killing Morley for setting him up, he began to question his brother to learn more about how he had ended up here. He eventually discerned his brother's hatred for the Jedi, and eventually rescued him from his tortured existence on the junk world and brought him home to Dathomir, where Talzin restored his mind and body with her magicks. Maul was given new cybernetic legs and had his injuries healed. Opress then began his service to his experienced brother, becoming involved with Maul's pursuit of vengeance on Kenobi, who had cut him in half over a decade ago in the Theed Royal Palace on Naboo.\nMaul planned to lure out Kenobi by committing a massacre on the planet Raydonia, promising that the Jedi would not ignore it. He then sent the Jedi a hologram of him slaughtering the civilians and called for Kenobi. When Kenobi arrived, Maul and Opress surprise-attacked him in the ruins of the town and, using several coordinated attacks, knocked him out and took him prisoner. As they tortured him onboard their ship, Ventress, who was seeking to cash in on the sizeable bounty on Opress's head, arrived to help her former foe Kenobi. After an extended battle inside the ship, Kenobi and Ventress escaped from the two brothers.\nOpress and Maul continued their plans for revenge and galactic domination, and, guided mostly by Maul, turned to the criminal underworld to achieve their needs. Opress and Maul cut a swath through the Outer Rim, battling through civilians and slaying multiple Jedi Knights who stood in their way. After pillaging the Cybloc Transfer Station, Maul asserted his dominance over his brother, acknowledging his brother as a Sith Lord but forcing him to become his apprentice. Opress was taken aback by the change in power and recklessly challenged his brother to combat, but was quickly and ruthlessly defeated and forced to submit to his renegade Sith brother in accordance with the Sith Rule of Two.\nMaul then led his brother to capture a starship belonging to a group of Weequay pirates, whom they forced into their service. They then contacted their leader, Hondo Ohnaka and informed him that if he did not join them that they would forcibly take his base. However, as Maul and Opress pitted the pirates against each other, Kenobi and Jedi Master Adi Gallia arrived. After an intense battle, Opress charged Gallia, impaling the Jedi Master on his horns, killing her. Kenobi barely fought off the two brothers before allying with Ohnaka and escaping into the complex. After Ohnaka was able to assert control over the treasonous pirates, he rallied his forces and attacked the brothers. Opress dueled Kenobi, but lost his left arm to Kenobi's lightsaber. Maul helped his wounded brother limp away from the reinvigorated pirates and fled.\nHowever, Kenobi continued his pursuit of Opress and Maul off Florrum, destroying their ship and forcing them to eject in the escape pod. The two became stranded until they were discovered unconscious by members of the Death Watch, a group of Mandalorian warriors led by Pre Vizsla. The two brothers were taken to the Death Watch encampment on Zanbar, where Vizsla aided them by giving Maul new cybernetic legs and Opress a cybernetic arm. When Opress woke to see droids working on his new arm, he destroyed them in his anger and pain. However, Maul calmed him down, telling him that they would be wise to ally with Death Watch but reassuring him that they would still be able to finish Kenobi after helping their new allies reclaim Mandalore. Vizsla and his second in command Bo-Katan Kryze then entered the tent and informed them that they had agreed to the proposed alliance.\nMaul advised Vizsla to gather allies to grow in strength to overthrow the pacifist rulers of Mandalore. As their first step to assembling what would become the Shadow Collective, Opress traveled with Maul, Vizsla, and Death Watch to Mustafar to meet with Black Sun leadership. Greeted by Vigo Ziton Moj, they were invited to the council chambers to meet with Xomit Grunseit. When he refused to join them, he commanded his forces to kill them and take their weapons and ships. Opress grabbed an advancing guard and snapped their neck, hurling the body onto the council table. When Maul delivered his ultimatum, but Grunseit once again refused, at which point Maul stepped back to allow Opress to finish the job. Hurling his double-bladed lightsaber, he beheaded the entire council, leaving Moj the lone Black Sun member left in the room. As de facto leader, Moj quickly agreed to their proposed alliance.\nOpress, Maul, and the Mandalorians were soon joined by the Pyke Syndicate before traveling to Nal Hutta to meet with the Hutt Ruling Council. When they refused to join without being paid a large sum of credits, the Shadow Collective was attacked by a force of bounty hunters. Opress battled with the bounty hunter Embo and eventually the bounty hunters were defeated. They returned to find Oruba the Hutt still inside, who Opress killed before they planned to travel to Tatooine to find Jabba the Hutt. After a battle at Jabba's Palace, Jabba and Gorga Desilijic Aarrpo decided to join Maul.\nAfter his brother was seemingly captured by the Morubas crime family, Opress went to Bahlah with a force of the Shadow Collective, beginning the battle around the stronghold of the Morubas crime family. In reality, Maul had purposefully allowed himself to be captured in order to bring down the Morubas family. Upon reuniting with his brother, Opress left the world as the two brothers prepared for their takeover of Mandalore.\nSoon after, the Sith brothers and Death Watch ordered members of the Shadow Collective's crime syndicates and gangs to attack and overrun the capital of Mandalore, thus revealing Duchess Satine Kryze's inability to protect the planet from an invading force. Opress joined the attackers in perpetrating crimes throughout the city. The members of Death Watch would then stage a rescue where they would defeat the invaders such as Opress, thus becoming heroes of the public. With the support of the civilians, Death Watch was able to take control of Mandalore.\nEven though the operation succeeded, Vizsla and his men betrayed and arrested Opress and Maul and successfully maneuvered their way into good favor with the populace. However, the two brothers were not finished. Opress and Maul would easily break free from prison, also freeing Almec, Mandalore's incarcerated Prime Minister. The two brothers then arrived in the throne room to confront Vizsla. Maul challenged Vizsla to a duel for control of Mandalore, which he accepted. Opress watched as Maul seized control of Mandalore after defeating Vizsla in lightsaber combat and beheading him. Some of Vizsla's supporters did not accept Maul's rule and left, but the remaining warriors pledged themselves to Maul. Maul installed Almec as the puppet ruler of Mandalore.\nThe brothers' rule of Mandalore attracted unwanted attention from Maul's former Master, Darth Sidious, who saw their growing power and alliances as a threat to the dominance of his Sith Order. Sidious traveled to Mandalore to confront the two brothers. Though Opress was skilled, Sidious ultimately bested the Zabrak warrior in combat, and impaled Opress with his twin lightsabers before flinging him from the building with the Force. In his dying breath, Opress expressed regret for never having been Maul's equal. As he died, the green mist of Nightsister magick emanated from his body and his armor disappeared. His muscles and physique reverted back to their form from before the Nightsister ritual, and Opress died as the man he had been before becoming Ventress's pawn. An enraged Maul tried to kill his former master, but was quickly defeated and captured.\nSavage's death would continue to fuel his brother Maul's rage for the rest of his life. Sometime between 19 BBY and 2 BBY, Maul traveled to the planet Damanos to unlock the secrets inside a Sith castle. While in the castle, Maul experienced a vision of Opress who shunned his inability to be neither a master nor a brother to him. Sixteen years after Opress's death, Maul recalled the loss of Opress while explaining his hatred of the Sith to the Jedi Padawan Ezra Bridger in an attempt to make him his new apprentice.\nOpress was later mentioned by a member of the Whills as someone to be remembered in galactic history.\nSavage Opress was a formidable Sith warrior, proficient with the use of the various weapons in the Nightbrother village. He was also a skilled hand-to-hand combatant, utilizing the Nightbrother's mixture of combat styles best known for its acrobatics and agility. For these reasons, Oppress was considered to be among the best of the clan's fighters, able to fight on par with Asajj Ventress even before his transformation. After Savage was handpicked by Ventress to become her apprentice, Mother Talzin used magick to grant him fearsome abilities and was transformed into a terrifying opponent for the Jedi. After his transformation, Savage was a head taller, had a much broader chest and even stronger arms, and a full crown of sharp and elongated horns, as well as experiencing dramatic increases to his already considerable strength, durability, agility, and stamina.\nSavage was a proficient lightsaber duelist. Dooku began training Savage Opress, who quickly mastered the double-bladed lightsaber like his brother before him, a tricky weapon because it could be much more dangerous to its wielder than an enemy. His combat style relied on his immense strength, with Opress hammering and swiftly repelling his opponents with raw kinetic power. Opress was quickly able to fight on par with skilled opponents, including several simultaneously, as seen when Anakin Skywalker and Obi-Wan Kenobi confronted him on Toydaria and, soon after, on Dooku's ship. Side-by-side with Ventress, with his immense strength, Opress even bested and disarmed Dooku, who was a proficient duelist. However, when Dooku began attacking him with his Force Lightning, Opress was significantly weakened and overwhelmed, even acknowledging that Dooku was too powerful.\nAfter joining his brother Maul, he further advanced in his Sith training. Opress's skill grow quickly, and he was soon able to contend with and even defeat Jedi Council members such as Kenobi in combat. He even became skilled and powerful enough to slay Adi Gallia in a duel on Florrum. When fighting Darth Sidious alongside his brother Maul, he proved to be quick and skilled enough to keep up with the immensely powerful Dark Lord of the Sith. Opress fought hard alongside Maul and even threw Sidious off the balcony with a headbutt, proving to be a great foe for the Dark Lord. However, when separated from his brother, his immense strength and brutality proved to be no match for Sidious' flawless swordsmanship.\nIn addition to being a formidable lightsaber duelist, Opress was massively powerful in the Force and strong in the dark side of the Force. He possessed enough telekinetic power to simultaneously lift and Force choke Dooku and Ventress when enraged. He was also able to use a powerful Force push to take down battle droids and push Kenobi and Skywalker simultaneously. Opress could throw his lightsaber with lethal precision, decapitating the Black Sun members with a single stroke at his brother's command.\nPrior to his transformation, Savage wore simple rags matching those of his Nightbrother brethren and wielded crude, archaic weaponry such as an ax. Upon his transformation, Mother Talzin gifted Savage with a specially designed suit of armor and a spear. The suit of armor was incredibly durable, capable of withstanding blaster fire and the acid rains of Lotho Minor. The armor seemingly dissipated upon Savage's death at the hands of Darth Sidious. Savage used the spear during the Devaron massacre, killing a handful of clone troopers and two members of the Jedi Order with the enchanted weapon.\nAt some point after the Devaron massacre, Savage began using a crimson double-bladed lightsaber in favor of the enchanted spear given to him by Talzin, wielding the weapon until his death at the hands of Darth Sidious. After betraying Ventress and Dooku, Savage returned to Dathomir and was given the Talisman of Finding by Mother Talzin. The talisman served as a compass that eventually led Opress to Lotho Minor and his long-lost brother Maul.\nDuring his apprenticeship under Count Dooku, Opress piloted a Punworcca 116-class interstellar sloop similar to his master's. Opress used the ship to travel to and from Devaron and Toydaria, and later escaped Tyranus's Providence-class Dreadnought aboard the solar sailor.\nFor his journey to Lotho Minor, Opress piloted a hijacked Turtle Tanker. He also used the Turtle Tanker to travel to Dathomir and later Raydonia. After their duel with Kenobi and Ventress, Opress and Maul stopped using the tanker in favor of a YV-865 Aurore-class freighter. The brothers used the YV-865 to travel to Florrum; however, it was later damaged beyond repair by the Ohnaka Gang on the planet's surface.\nSavage Opress was voiced by prolific voice actor Clancy Brown in Star Wars: The Clone Wars, first appearing in the episode \"Monster.\" Savage Opress's introduction in the series was instrumental, along with George Lucas' recommendations, to bring back Maul into the series following his apparent death in the 1999 film Star Wars: Episode I The Phantom Menace.\nEarly plans of the Star Wars Rebels episode \"Twin Suns\" featured Maul experiencing Force visions of both Opress and Satine Kryze before facing Obi-Wan Kenobi on Tatooine. In contrast to Kryze, Opress nearly actually made it to design phase before Dave Filoni thought it better, feeling that in an already lengthy episode, there was no time to explain Savage's origins as they couldn't risk alienating new Star Wars fans who would be confused with Opress's sudden appearance.\nIn the LEGO Star Wars: Droid Tales episode \"Crisis on Coruscant,\" Savage Opress was present on Geonosis alongside multiple other Separatist agents, sitting at a table inside a room of a factory as General Grievous delivered top-secret Republic plans to Count Dooku. As Opress and the other Separatists present prepared to watch the plans, however, R2-D2—disguised as a Separatist astromech droid—instead played footage of several Ewoks dancing. A group of Jedi—led by Yoda—then arrived, and Opress initially fought Ki-Adi-Mundi. The factory soon blew up after R2-D2 got stuck in some of its gears, forcing the Jedi, C-3PO, and R2-D2 to escape with the plans while the Separatists escaped on their own. C-3PO later recounted this story to Admiral Gial Ackbar during the Imperial Era.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Savage_Opress",
  "/wiki/Savage_Opress/Legends",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/The_Ghosts_of_Maul",
  "/wiki/Dathomir",
  "/wiki/19_BBY",
  "/wiki/Mandalore",
  "/wiki/Zabrak",
  "/wiki/Dathomirian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Tattoo",
  "/wiki/Cybernetics",
  "/wiki/Nightbrothers",
  "/wiki/Sith",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Shadow_Collective",
  "/wiki/Viscus",
  "/wiki/Asajj_Ventress",
  "/wiki/Dooku",
  "/wiki/Maul",
  "/wiki/File:SavageOpressTCWMonster.ogg",
  "/wiki/Feral",
  "/wiki/Force-sensitive",
  "/wiki/Sith_apprentice",
  "/wiki/Count_of_Serenno",
  "/wiki/Sith_Lord",
  "/wiki/Clone_Wars",
  "/wiki/Nightsisters",
  "/wiki/Selection",
  "/wiki/Mother_(title)",
  "/wiki/Talzin",
  "/wiki/Magick",
  "/wiki/The_Force",
  "/wiki/Dark_Acolyte",
  "/wiki/Lotho_Minor",
  "/wiki/Talisman_of_Finding",
  "/wiki/The_galaxy",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Rule_of_Two",
  "/wiki/Skirmish_on_Florrum",
  "/wiki/Florrum",
  "/wiki/Pre_Vizsla",
  "/wiki/Death_Watch",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Darth_Sidious",
  "/wiki/Nightbrother_village",
  "/wiki/Planet",
  "/wiki/Sith_Master",
  "/wiki/Count",
  "/wiki/Force_power",
  "/wiki/Savage%27s_spear",
  "/wiki/Devaron_massacre",
  "/wiki/Galactic_Republic",
  "/wiki/Devaron",
  "/wiki/Temple_of_Eedit",
  "/wiki/Clone_trooper",
  "/wiki/Jedi",
  "/wiki/Halsey",
  "/wiki/Padawan",
  "/wiki/Knox",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Savage_Opress%27s_lightsaber",
  "/wiki/Force_lightning",
  "/wiki/Toydaria",
  "/wiki/Toydarian",
  "/wiki/King",
  "/wiki/Katuunko",
  "/wiki/Force_choke",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Showdown_at_Toydaria",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Plop_Dribble%27s",
  "/wiki/Stobar",
  "/wiki/Mission_to_Lotho_Minor",
  "/wiki/Anacondan",
  "/wiki/Morley",
  "/wiki/Junker",
  "/wiki/Battle_of_Naboo",
  "/wiki/Standard_decade",
  "/wiki/Theed_Royal_Palace",
  "/wiki/Naboo",
  "/wiki/Massacre_on_Raydonia",
  "/wiki/Raydonia",
  "/wiki/Skirmish_above_Raydonia",
  "/wiki/Cybloc_Transfer_Station",
  "/wiki/Weequay",
  "/wiki/Ohnaka_Gang",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Hondo%27s_complex",
  "/wiki/Adi_Gallia",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Starship",
  "/wiki/Escape_pod",
  "/wiki/Mandalorian",
  "/wiki/Zanbar",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/New_Mandalorians",
  "/wiki/Mustafar",
  "/wiki/Black_Sun",
  "/wiki/Vigo",
  "/wiki/Ziton_Moj",
  "/wiki/Xomit_Grunseit",
  "/wiki/Pyke_Syndicate",
  "/wiki/Nal_Hutta",
  "/wiki/Hutt_Ruling_Council",
  "/wiki/Embo",
  "/wiki/Oruba",
  "/wiki/Tatooine",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Gorga_Desilijic_Aarrpo",
  "/wiki/Morubas_crime_family",
  "/wiki/Bahlah",
  "/wiki/Battle_of_Bahlah",
  "/wiki/Stronghold_of_the_Morubas_crime_family",
  "/wiki/Prison",
  "/wiki/Almec",
  "/wiki/Prime_Minister",
  "/wiki/Mandalorian_civil_war_(Clone_Wars)",
  "/wiki/Darth_Sidious%27_lightsabers",
  "/wiki/Unidentified_Whill",
  "/wiki/2_BBY",
  "/wiki/Damanos",
  "/wiki/Force_vision",
  "/wiki/Ezra_Bridger",
  "/wiki/Mission_to_Malachor",
  "/wiki/Second_Whill_(From_a_Certain_Point_of_View)",
  "/wiki/Whills",
  "/wiki/Timeline_of_galactic_history",
  "/wiki/Sith_warrior",
  "/wiki/Double-bladed_lightsaber",
  "/wiki/Jedi_Council",
  "/wiki/Force_push",
  "/wiki/Battle_droid",
  "/wiki/Blaster",
  "/wiki/Acid_rain",
  "/wiki/Jedi_Order",
  "/wiki/Punworcca_116-class_interstellar_sloop",
  "/wiki/Dooku%27s_Providence-class_Dreadnought",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Terrapin-class_Bulk_Tanker",
  "/wiki/YV-865_Aurore-class_freighter",
  "/wiki/Clancy_Brown",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Monster",
  "/wiki/George_Lucas",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Twin_Suns_(episode)",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/Geonosis",
  "/wiki/Factory",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/R2-D2",
  "/wiki/Astromech_droid",
  "/wiki/Ewok",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/C-3PO",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Imperial_Era",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Massacre",
  "/wiki/Brothers",
  "/wiki/Revenge_(episode)",
  "/wiki/Dark_Vengeance:_The_True_Story_of_Darth_Maul_and_His_Revenge_Against_the_Jedi_Known_as_Obi-Wan_Kenobi",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Revival_(episode)",
  "/wiki/Eminence_(episode)",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_The_Hostage",
  "/wiki/Star_Wars_Adventures_(2020)_3",
  "/wiki/Shades_of_Reason",
  "/wiki/The_Lawless",
  "/wiki/Kenobi%27s_Shadow",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_1",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Maul:_A_Star_Wars_Rebels_Cinestory_Comic",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Whills_(short_story)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Savage_Opress",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_68",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_74",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Maul:_From_Sith_Lord_to_Crime_Lord",
  "/wiki/Databank_(website)",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/20_BBY",
  "/wiki/Malachor",
  "/wiki/3_BBY"
 ]
}