{
 "name": "Savorin_Malfus_the_Seventh",
 "display_name": "Savorin Malfus the Seventh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark blonde facial hair"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Savorin Malfus the Seventh was a Human male noble of the planet Alderaan who lived during the Cold War. Malfus acquired information as to the whereabouts of Duke Corwin, and when a bounty hunter in the employ of House Girard came to collect the information, Malfus demanded that the hunter carry out a series of errands for him. The bounty hunter refused and, after killing Malfus's bodyguards, severely beat Malfus and took the information.\nMalfus was a very arrogant man. Spoiled and entitled, he treated anyone who was not a noble as though they were dirt. He would not even let them within ten paces of him. He looked down on the Hunter and viewed them as less than a servant.\nSavorin Malfus the Seventh appears as a character in the Bounty Hunter mission \"Spiking the Punch\" in Star Wars: The Old Republic, a video game released by BioWare in 2011. He asks players to deliver gifts to Lords Dugan Cortess, Paulus Thul, and Norn Girard. Players can choose to do Malfus's errands for light side alignment points, but as the Bounty Hunter is an Imperial class and thus assumed to make the dark side choices, this article assumes that the hunter refused and beat up Malfus.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color",
  "/wiki/Planet/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Duke/Legends",
  "/wiki/Corwin",
  "/wiki/Hunter_(individual)",
  "/wiki/House_Girard",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Lord/Legends",
  "/wiki/Dugan_Cortess",
  "/wiki/Paulus_Thul",
  "/wiki/Norn_Girard"
 ]
}