{
 "name": "Saylew",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rutian Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pilgrims"
     ]
    }
   ]
  }
 ],
 "content": "Saylew was a Rutian Twi'lek male who was a member of the religious group known as the Pilgrims during the Cold War between the Galactic Republic and the Sith Empire. Along with his wife, Saylew settled in Kalikori village on the planet Tython. In 3643 BBY, during a conflict with Tython's native Flesh Raiders, Saylew's wife was killed in an attack on the village, and an enraged Saylew sought vengeance on the Jedi Order for not helping the villagers—going so far as to betray the Jedi to the Flesh Raiders' leader, the Dark Jedi Bengel Morr. However, the villagers' betrayal was ultimately for naught, as Morr was defeated.\nA Twi'lek male, Saylew married a female of his species, and both were members of the religious group known as the Pilgrims during the Cold War between the Galactic Republic and the Sith Empire. Along with the other Pilgrims, they settled on the planet Tython, where they constructed Kalikori village despite the Galactic Senate's refusal of settlement rights, and they struggled to survive in the face of attacks by the hostile native Flesh Raiders without aid from the Jedi Order. The conflict with the Flesh Raiders reached its peak in 3643 BBY, when the Jedi finally reached out to the villagers in an attempt to combat the Flesh Raider threat. However, an attack on the village saw Saylew's wife killed by the Flesh Raiders, leaving Saylew mad with grief and anger.\nHe interrupted a meeting between Scout Chief Moorint; the village matriarch's daughter, Ranna Tao'Ven; and Jedi Master Orgus Din and demanded retribution for the loss of his wife and vengeance upon her killers. Din cautioned Saylew on his feelings of vengeance, angering Saylew further, but his ranting was interrupted by the arrival of Din's Padawan, who had just retrieved a cache of Flesh Raider weapons. Still irate, Saylew stormed out of the building.\nNot long afterward, the Dark Jedi Bengel Morr—who was responsible for marshaling the Flesh Raiders into an army—approached the villagers with an offer: In return for helping him capture his former Master, Orgus Din, the Dark Jedi would spare Kalikori from further attacks. The villagers agreed and sent out a false distress signal, luring Din back to the village, where Morr's Flesh Raiders subdued and captured the Jedi Master. However, Morr soon contacted the village again and changed their deal, demanding the life of Din's Padawan as well. Along with Moorint and a villager named Eseni, Saylew headed to the matriarch's building, where the recently arrived Padawan was speaking with Tao'Ven and the astromech droid T7-O1.\nWhile the Jedi was talking, Moorint shot the Padawan with a dart coated with a sedative and painkiller, and Saylew shot T7-O1 with an ion blaster. However, Tao'Ven was outraged by their actions and leaped to the Jedi's defense, and she began to argue with the villagers, refusing to let them kill the Padawan as the Jedi struggled to remain conscious. The Padawan soon recovered and questioned the villagers' intentions, and Moorint explained that Morr was demanding the Jedi's life. Before the villagers could attack, the Padawan reached out with the Force and convinced the trio to leave the building peacefully. Despite their failure to comply with Moorint's demands, the villagers were spared from Morr's wrath when Din's apprentice defeated the Dark Jedi and rescued Din.\nA Twi'lek of the Rutian subspecies, Saylew had blue skin and green eyes. He loved his wife dearly—love that turned to hatred of the Flesh Raiders when she was taken from him. Saylew was more than willing to betray and kill the Jedi in hopes of saving himself and the village, and his mind was weak enough for him to fall prey to mind tricks.\nSaylew wore dark-gray robes like many Pilgrims and carried a blaster.\nSaylew first appeared in the Jedi Knight-class mission \"High-Tech Savages\" in Star Wars: The Old Republic, a video game released by BioWare in 2011. He later reappears in the mission \"Dark Temptations,\" in which the player can choose to either kill the villagers for dark-side points, fail to convince them to leave for light-side points, or Force-persuade them to leave for maximum light-side points. As the Jedi Knight is a Republic character and is thus assumed to make choices that reward the maximum light-side points, this article assumes Saylew survived.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rutian/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pilgrims",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Saylew%27s_wife",
  "/wiki/Kalikori_village",
  "/wiki/Planet/Legends",
  "/wiki/Tython/Legends",
  "/wiki/3643_BBY",
  "/wiki/Flesh_Raider_uprising",
  "/wiki/Flesh_Raider",
  "/wiki/Marriage/Legends",
  "/wiki/Death/Legends",
  "/wiki/Attack_on_Kalikori_village",
  "/wiki/City/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Bengel_Morr",
  "/wiki/Species/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Scout_Chief",
  "/wiki/Moorint",
  "/wiki/Matriarch",
  "/wiki/Ranna_Tao%27Ven",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Hero_of_Tython",
  "/wiki/Army/Legends",
  "/wiki/Distress_signal/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Eseni",
  "/wiki/T7-series_astromech_droid",
  "/wiki/T7-O1",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Dart",
  "/wiki/Ion_blaster/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Battle_of_the_Forge",
  "/wiki/Eye/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}