{
 "name": "Scar  (clone)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Frozen moon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "41.5 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Community"
     ]
    }
   ]
  }
 ],
 "content": "Scar was a clone of a Force-sensitive female Human that was created in an Imperial research facility on a frozen moon in the Unknown Regions. Her mate was Maker.\nScar was a Human clone of a unknown Force-sensitive that was created by the Galactic Empire in a research facility on a frozen moon in the Unknown Regions, as part of a cloning program that was initiated by Grand Admiral Thrawn. Scar was one of a number of Sith-Jedi clones that were bred in the facility, and at some point, she alongside the other clones began to worship the entity \"Mother\" under the guide of Seer. Later the newly constituted Community killed and overthrew the Imperial forces that operated the research facility. For many years, the clones resided on the moon and only in 41.5 ABY, they escaped the facility by stealing a CloakShape fighter that had been flown to the moon by the Anzat Sith agent Kell Douro but Alpha was killed by the Jedi Knight Jaden Korr.\nScar and all of the other members of the Community, with the exception of the clone Soldier, suffered from a sickness as a result of their clone heritage and as they escaped from the research facility, the CloakShape passed through the remnants of the Lignan cargo of the Sith dreadnaught Harbinger, which had been destroyed a short time earlier. The Lignan enhanced the clones' perception of the Force and accelerated the effects of their sickness, killing Scar as a result. Seer believed that the illness was a test that had been set for the clones by Mother and she ordered Soldier to fly the CloakShape fighter to the planet Fhost, so that the clones could obtain some medication, and planned for the clones to then travel to find Mother.\nThe black haired female clone took her name from the long scar made by one of Thrawn's doctors, a scar running from the bottom of her throat to her navel.\nIn the book, it was never explained who was the template of Scar. Her black hair hints at her template being Roganda Ismaren, an Emperor's Hand, whose DNA was likely possessed by the Imperial scientists.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Scar",
  "/wiki/Frozen_moon",
  "/wiki/41_ABY",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Community",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Imperial_research_facility",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Maker_(clone)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mother_(Rakatan_entity)",
  "/wiki/Seer_(clone)",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Moon/Legends",
  "/wiki/CloakShape_fighter/Legends",
  "/wiki/Anzat_(species)",
  "/wiki/Kell_Douro",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaden_Korr",
  "/wiki/Soldier_(clone)",
  "/wiki/Lignan",
  "/wiki/Sith_dreadnaught",
  "/wiki/Harbinger_(Sith_dreadnaught)",
  "/wiki/Planet/Legends",
  "/wiki/Fhost",
  "/wiki/Roganda_Ismaren/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Riptide_(novel)"
 ]
}