{
 "name": "Schurk-Heren",
 "display_name": "Schurk-Heren",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yarkora"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Schurk-Heren was a Yarkora smuggler, and captain of the vessel Uhumele.\nAfter a failed hijacking attempt on the Uhumele by Dass Jennir and Bomo Greenbark, Schurk-Heren took the two on as passengers, following their escape from the Battle of Half-Axe Pass. He was carrying Dreypa's Oubliette aboard the ship. Once they left they proceeded to Orvax IV where they searched for Greenbark's family. After learning that Greenbark's wife had been killed they discovered that his daughter had been sold to a man named Dezono Qua. He accompanied the rest of the Uhumele crew as they broke into Qua's estate to discover that Bomo's daughter was dead.\nAfter that he set up a meeting with his old friend Haka Hai in Mimban in an attempt to sell the oubliette. However, Haka double-crossed them and attempted to steal the oubliette from Heren. However, Haka's second in command, Lumbra, had plans of his own and took what he believed to be the oubliette. Haka, soon discovered that Heren had not actually brought the oubliette with him, and the actual oubliette was still at large. Haka had Heren tortured to discover the whereabouts of the oubliette, but Greenbark managed to break free and release Heren and the rest of the crew from Haka's estate.\nSoon after escaping from Haka, Heren attempted once more to get rid of the oubliette. At this point, however, Bomo did not trust Heren to be able to sell the package. Once they reached an unidentified planet, Darth Vader and a group of clone troopers surrounded the crew and took the oubliette from them. Once they were tied up, Vader proceeded to open the oubliette and discovered ancient Jedi Celeste Morne inside. When she awoke she discovered that the Sith had conquered the galaxy and began dueling Vader. During that time Heren managed to break free and released the rest of the crew and ran towards the Uhumele attempting to escape before Vader noticed they were gone. However, just as they were about to reach the Uhumele, fellow crew member Crys Taanzer became infected with the rakghoul disease and soon turned into a rakghoul. Heren was forced to kill his fellow crew member and friend.\nAfter these exertions, the crew moved back to Kidron onboard the Uhumele. The surviving crew members were mourning to their pilot Crys and Heren was to blame for all the chaos that they had raided in recent months, as it had been his profits intentions. All crew members, including Bomo, who had his pain at the loss of his family still does not eliminate entirely, now voted to go on a search for Dass Jennir. On Kidron, the Uhumele crew encountered another survivor of the Jedi Purge, Beyghor Sahdett. First, they did not trust him, but after the Verpine was taken by an Imperial patrol, the crew were able to rescue him and revealed their intention to seek Jennir.\nTogether, they all flew to Telerath, where a lot of rumors at this time were circulating about a Jedi. As they made the acquaintance of the local militia, Heren was more or less convinced of their peaceful intent. There, he met a man named Fish, who assured them that Jennir was in fact here and added that the Jedi was now in the company of a woman named Ember Chankeli. Heren and his crew had no choice but to follow the new track to find the Jedi. According to Imperial records that Beyghor, Bomo, Meekerdin and Vakier recovered from a broadcast center, Heren found out that Jennir and his companions were on Prine, where they crashed their ship during an attack from the Harvester. Heren and his crew had no choice to land on the planet where they later succeeded in rescuing Jennir and Ember before the assassin Falco Sang could kill them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yarkora/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Uhumele",
  "/wiki/Dass_Jennir",
  "/wiki/Bomo_Greenbark",
  "/wiki/Battle_of_Half-Axe_Pass",
  "/wiki/Dreypa%27s_Oubliette",
  "/wiki/Orvax_IV",
  "/wiki/Mission_to_Orvax_IV",
  "/wiki/Dezono_Qua",
  "/wiki/Assault_on_Dezono_Qua%27s_villa",
  "/wiki/Qua_family%27s_villa",
  "/wiki/Haka_Hai",
  "/wiki/Mimban/Legends",
  "/wiki/Lumbra",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Celeste_Morne",
  "/wiki/Sith/Legends",
  "/wiki/Crys_Taanzer",
  "/wiki/Rakghoul",
  "/wiki/Beyghor_Sahdett",
  "/wiki/Verpine/Legends",
  "/wiki/Telerath/Legends",
  "/wiki/Fish_(Human)",
  "/wiki/Ember_Chankeli",
  "/wiki/Mission_to_Vondarc",
  "/wiki/Prine",
  "/wiki/Harvester",
  "/wiki/Skirmish_on_Prine",
  "/wiki/Falco_Sang",
  "/wiki/Star_Wars:_Dark_Times:_The_Path_to_Nowhere",
  "/wiki/Star_Wars:_Dark_Times:_Parallels",
  "/wiki/Star_Wars:_Dark_Times:_Vector",
  "/wiki/Dark_Times:_Blue_Harvest,_Part_1",
  "/wiki/Dark_Times_15",
  "/wiki/Dark_Times_16",
  "/wiki/Dark_Times_17",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_1",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_2",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_3",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_4",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_1",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_2",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_3",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_95",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Dark_Times_1"
 ]
}