{
 "name": "Scott",
 "display_name": "Scott",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Freetown"
     ]
    }
   ]
  }
 ],
 "content": "Scott was a human deputy of Freetown on the planet Tatooine under the authority of Sheriff Cobb Vanth. He died in a duel with the Duros mercenary Cad Bane.\nAround 9 ABY, Scott became the deputy of Marshal Cobb Vanth of Freetown, a settlement on the desert planet Tatooine. Noticing the arrival of a N-1 starfighter, which landed at the end of the town's main street, he was quick to notify its pilot, the Mandalorian bounty hunter Din Djarin, of his infraction, demanding him to park his ship on the flats. As Djarin ignored the request and stated he came to see Vanth, Scott took it personally and hovered his hand over his blaster; he was quickly dismissed, though, by the marshal himself, who went to see his old ally. Vanth described Scott as \"jumpy\", given that he was hired so recently.\nNot long after Djarin's eventual departure, Vanth spotted the Duros bounty hunter Cad Bane approaching Freetown on foot. The marshal ordered the townsfolk to enter their homes, and Scott stepped outside the local bar and inquired his superior about the matter. Vanth replied he could handle the situation and ordered the deputy back inside. Scott insisted, wanting to help, but was once again ordered to recall inside, and stood by the bar door as the marshal went to face Bane, who had been sent by the Pyke Syndicate.\nWhen Bane attempted to bribe Vanth, Scott claimed the marshal wouldn't take it, earning a glare from his boss. When Bane threatened Vanth, the pair prepared to draw on each other in a standoff. Scott tensed himself as well, stepping briefly towards Bane and preparing to draw. He then grabbed his blaster pistol, prompting the other two to do the same. However, the Duros was quicker on the draw, wounding Vanth and blasting Scott four times on the chest, killing him.\nScott was a human male with light skin, brown, greying hair, and grey eyes.\nThe deputy enforced the laws of Freetown diligently, as shown in his brief interaction with Din Djarin over the parking of his ship. As stated by Cobb Vanth, Scott was \"a bit jumpy,\" being newly recruited to his position and eager to show his authority; he had a good heart, but lacked situational awareness. These two traits were the key to his demise, as he stepped in to try and help the Marshal in his conflict with Cad Bane instead of allowing Vanth to handle the situation.\nScott was introduced in \"Chapter 6: From the Desert Comes a Stranger,\" the sixth episode of the television series The Book of Boba Fett, which was released on Disney+ on February 2, 2022. He was portrayed by JJ Dashnaw. Though not named in the episode, Scott was identified in the credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Scott_(disambiguation)",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Freetown",
  "/wiki/Deputy",
  "/wiki/Sheriff",
  "/wiki/Cobb_Vanth",
  "/wiki/Showdown_in_Freetown",
  "/wiki/Duros",
  "/wiki/Mercenary",
  "/wiki/Cad_Bane",
  "/wiki/Marshal",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Din_Djarin%27s_N-1_starfighter",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Pyke_Syndicate",
  "/wiki/Blaster_pistol",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Disney%2B",
  "/wiki/February_2",
  "/wiki/2022",
  "/wiki/JJ_Dashnaw",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Boba_Fett",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Death"
 ]
}