{
 "name": "Sechel",
 "display_name": "Sechel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3950 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireImperial IntelligenceDarth Nyriss",
      "Imperial Intelligence",
      "Darth Nyriss"
     ]
    }
   ]
  }
 ],
 "content": "Sechel was a non-Force-sensitive male Pureblood Sith who served as an advisor and envoy of the Dark Councilor Darth Nyriss of the reconstituted Sith Empire, and previously served in the Imperial Intelligence. Dispite not being force-sensative, his intelligence and highly developed survival skills compensated for this and his underwhelming stature, which allowed him to rise high in Sith society.\nWithin Sith society purebloods that didnt have a connection to the force where seen as lesser, even being called things such as an 'abomination', as Scourge comments on.\nThroughout the novel, Sechel and Scourge are shown to have a clear distrust and rivalry between each other.\nNothing is known about his life as a child since this is never brought up in the Revan Novel. However, he was previously an agent in Imperial Intelligence and had many skills from this such as Slicing. He had a job outside of being advisor to Darth Nyriss; He worked freelance - being paid credits to find certain people, and was usually found doing this buisness in the Nexus Room Cantina, Having contacts such as Larvit who directed customers his way. and owned an apartment somewhere in Kaas City.\nSechel is first seen escorting Lord Scourge to Darth Nyriss' stronghold. The two encounter two Mercenaries, to which Sechel 'chases' them off, before taking Scourge to the Stronghold by Speeder. They are met by Murtog, Nyriss' Head of security, and Sechel is asked, if this was the 'real Scourge'. Murtog denies them entery and after a breif interrigaton by Scourge, Sechel tells him it wasnt fully Nyriss' idea to invite him, and was actually a suggestion by the Emperor - which was basically an order. The two Mercenaries from before show up again seemingly here on an assasination attempt on Darth Nyriss. Sechel cowers in the corner, miraculously not getting shot. Scourge defeats the two; managing to get one to surrender. Murtog appears killing the last Mercenary and allowing them inside.\nSechel also shows off his extensive knowlage on the different atrefacts in Nyriss' possesion.\nDarth Nyriss sends Sechel and Scourge on a Mission to Hallion to find a lead to the assasination attempts; since sechel managed to salvage data from a sabotaged droid that attempted to kill Darth Nyriss, that linked back to the Uxiol Droid Manufacturing plant on Hallion.\nThe two manage to sneak into the plant, only encountering a few patrol drones Scourge swiftly took care of; but when it came to getting into the records room, the code Sechel had wouldnt work and so Scourge used his lightsaber to slice through the controls - but in doing so, triggered the security alarm. Scourge threw Sechel into the Records room while he took care of the droids, which included some assault droids. Scourge had almost died to the droids, but was saved by Sechel triggering the emergency shut down.\nSechel hadn't expected Scourge to survive, but mentions they didnt have much time to escape from the shutdown destablizing the plants Trivium generator. Both narrowly escaped the worst of the explosion, but where still badly injured.\nThis even made Scourge even more suspicious of Sechel's 'true' intentions.\nSechels data from the Uxiol Droid Manufacturing plant led them to a separatist cell on Bosthirda; where Nyriss assigned Sechel, Scourge, Murtog and Nyriss' troops to eliminate them and retrieve their data.\nOnce there, Scourge ordered Sechel and Murtog to stay back while he clears the area, but they willfully dissobeyed the order and rushed in so Sechel could get the data before the separatists wiped any possible leads they had. Scourge was visibly angered by this, but Sechel showed his more cunning side here, not feeling intimidated by the Sith Lord.\nThe Data Sechel retrieved from this lead to them discovering they had an affiliation to the Dark Council member, Darth Xedrix; a Known rival of Nyriss'.\nAfter Lord Scourge had retuned from eliminating the Dark council traitor Darth Xedrix; he wanted answers for some things Xedrix had told him, and so went to interrogate Sechel - the one thing he'd been wanting to do for a while at this point.\nThe Sith had entered Sechel's room while he was sleeping and covered the advisor's mouth while holding a knife to him: demanding for all the answers if he wanted to survive, and so Sechel told him some of the answers he wanted - but not before having both his tendrils cut off. Nyriss eventually appeared saying how she will end Scourge if he harmed Sechel anymore.\nAfter Revans capture and imprisonment in Nyriss's stronghold on Dromund Kaas, Meetra Surik adventured to Nathema where she found T3-M4 and a holorecording of Scourge and Nyriss carrying Revan to their ship. This is what ends her up on Dromund Kaas, and making a deal with Larvit - who directs her to Sechel in the Nexus Room Cantina. She askes Sechel to find and set up a meeting with Scourge, not knowing the two know each other already. Sechel is able to charge extra for this meeting because of the fact Scourge was a Sith lord.\nAfter Scourge met up with Meetra, Resulting in Murtogs death; they team up, agreeing on taking action against the Emperor - but Scourge needed to prove he was on Meetra's side, and so went to get all the intel on all Dark Council members that where apart of the Nathema conspiracy from the one person he knew would have it, Sechel.\nHe did this by luring Sechel into a trap, asking the human Slave at Nexus Room to send a message to Sechel, saying Murtog needed to meet with him. Soon after, Scourge followed Sechel through Kaas City, and to Sechels apartment - where he watched Sechel enter the appartment, and then entered himself. Finding Sechel's apartment he entered and started to yet again interrogate Sechel, asking for the files Sechel was keeping of the Dark council's conspiracy.\nEventually Sechel gives in and leads Scourge to a small closet in the back of the apartment, which held a small safe that contained a blaster and some disks containing the files Scourge wanted - and Sechel handed them over to him.\nNow seeing Sechel as a liability to his mission, he strangled the pureblood commenting on how he wanted their last moments to be 'close and personal'.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Scourge",
  "/wiki/Darth_Nyriss",
  "/wiki/3950_BBY",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Advisor/Legends",
  "/wiki/Envoy/Legends",
  "/wiki/Dark_Council",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/Dromund_Kaas",
  "/wiki/Slicing",
  "/wiki/Nexus_Room",
  "/wiki/Cantina",
  "/wiki/Larvit",
  "/wiki/Sechel%27s_secret_apartment",
  "/wiki/Kaas_City",
  "/wiki/Darth_Nyriss%27s_stronghold",
  "/wiki/Mercenary",
  "/wiki/Speeder/Legends",
  "/wiki/Murtog",
  "/wiki/Tenebrae",
  "/wiki/Mission_to_Hallion",
  "/wiki/Hallion",
  "/wiki/Uxiol_Droid_Manufacturing_plant",
  "/wiki/Uxiol_Droid_Manufacturing_patrol_drone",
  "/wiki/Uxiol_Droid_Manufacturing_assault_droid",
  "/wiki/Trivium_generator",
  "/wiki/Bosthirda_separatists",
  "/wiki/Bosthirda/Legends",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Xedrix",
  "/wiki/Revan/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Nathema",
  "/wiki/T3-M4",
  "/wiki/Nathema_conspiracy",
  "/wiki/The_Old_Republic:_Revan_(audiobook)"
 ]
}