{
 "name": "Sech Govlinder",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taloraan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Denfrandi",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Sech Govlinder was a Human male and an emissary to Orlin Denache, magister of the Taloraan City on the planet of Taloraan during the Clone Wars.\nIn 22 BBY, Denache secretly signed a treaty with Count Dooku, who was interested in making Taloraan a member of the CIS. Dooku, however, felt that the treaty was worthless and decided to take over the city's tibanna operations himself. A Munificent-class star frigate under the command of Captain Canteval was sent to the planet and local CIS supporters led by Rynert began to smuggle B1-Series battle droids and Droidekas into the city.\nMeanwhile, Jedi Knights Obi-Wan Kenobi and Anakin Skywalker arrived at Taloraan to ensure that the planet remained loyal to the Republic, accompanied by Skywalker's Padawan Ahsoka Tano. Denache realized that the Jedi would detect his lies with the Force, so he feigned illness, with Sech Govlinder being sent to negotiate in his place. Govlinder was unaware of Denache's alliance with Dooku and was told that Denache avoided meeting with the Jedi to ensure no mind trick would be played on him.\nHowever, after the first round of negotiations, Ahsoka Tano went into the city and accidentally discovered battle droids stocked within a guarded warehouse. After being informed about the incident, Canteval ordered the droids to attack her and the other Jedi, revealing the CIS presence within the city. Kenobi and Skywalker accused Govlinder of treachery and tried to reach their Nu-class shuttle, but were incapacitated when the shuttle was destroyed. Govlinder insisted that instead of being killed the Jedi were taken into custody.\nGovlinder himself felt manipulated by Denache and remained loyal to the Republic. Once he had the chance, he immediately freed both Jedi and returned to them their lightsabers. Afterward, he led them to the city's central communication tower, where the Jedi were able to patch a message to their Star Destroyer, Resolute. Govlinder himself rallied several remaining loyalists, who, with the help of the Jedi and the clone troopers from the Venator, were able to overcome Rynert and his men. Facing a dead-end, magister Denache committed suicide by stepping off the edge of the city and falling into the core of the gas giant. Temporarily taking the rule on the city, Govlinder continued negotiations with the Jedi. He also acknowledged the support of the Wind Raiders, who also played a small part in the skirmish.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taloraan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Denfrandi",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Orlin_Denache",
  "/wiki/Taloraan_City",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Tibanna/Legends",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Canteval",
  "/wiki/Rynert",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Droideka/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Nu-class_attack_shuttle",
  "/wiki/Lightsaber/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Resolute/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Wind_Raiders/Legends",
  "/wiki/The_Clone_Wars:_The_Wind_Raiders_of_Taloraan"
 ]
}