{
 "name": "Secon_Daree",
 "display_name": "Secon Daree",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lutrillian"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Phoenix Squadron",
      "Phoenix Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Secon Daree was a Lutrillian who piloted an X-wing starfighter in the Rebel Alliance's Starfighter Corps during the ill-fated attack on Lothal. Daree was captured by the Noghri assassin Rukh, who handed the pilot to Imperial custody.\nSecon Daree was a Rebel Alliance starfighter pilot. In 1 BBY, Daree took part in General Hera Syndulla's attack on Lothal to destroy the Imperial factories there. Syndulla's starfighter force was intercepted by Grand Admiral Thrawn's Seventh Fleet and suffered heavy casualties. After Syndulla managed to create a perimeter in the Imperial defenses by causing Commander Vult Skerris' TIE/D Defender Elite to crash into two Imperial warships, Daree and the remaining fighters including Syndulla and Mart Mattin's X-wing breached Lothal's atmosphere. The pilot cheered once Syndulla created an opening.\nWhen the remaining Rebel starfighters were shot down by the second wave of TIE fighters, Daree was one of the few survivors, crash-landing in Lothal City. Daree was captured by Rukh, Grand Admiral Thrawn's personal assassin, who had been sent out to capture the remaining Rebel pilots. Upon being brought to Governor Arihnda Pryce, she ordered that Daree be taken away for interrogation.\nSecond Daree was a Lutrillian with a pinkish broad face, fuzzy jowls, and wide-set blue eyes. Daree was a member of the Rebel Alliance and flew a T-65B X-wing starfighter.\nSecon Daree appears in the Star Wars Rebels episode \"Rebel Assault.\" The pilot was named in the accompanying guide, where it notes that the production team gave the pilot the name in the script as a joke, a play on the word \"secondary.\"\nAlthough unnamed in the artwork by Luke Harrington, concept art for Secon Daree's character model appears in the episode's concept art gallery, as X-wing starfighter pilot concept art.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Lutrillian",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Phoenix_Squadron",
  "/wiki/Rebel_pilot",
  "/wiki/X-wing_starfighter",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Attack_on_Lothal",
  "/wiki/Noghri",
  "/wiki/Assassin",
  "/wiki/Rukh",
  "/wiki/Pilot",
  "/wiki/1_BBY",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Lothal",
  "/wiki/Imperial_Armory_Complex",
  "/wiki/Starfighter",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/7th_Fleet",
  "/wiki/Death",
  "/wiki/Galactic_Empire",
  "/wiki/Commander",
  "/wiki/Vult_Skerris",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/Warship",
  "/wiki/Mart_Mattin",
  "/wiki/Atmosphere",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Capital_City",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/Eye",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Rebel_Assault",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Secon_Daree"
 ]
}