{
 "name": "SecOps_Four",
 "display_name": "SecOps Four",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Bothan Spynet"
     ]
    }
   ]
  }
 ],
 "content": "SecOps Four was a member of the Bothan Spynet and personal bodyguard to Bothan Spymaster Koth Melan. He worked alongside two other bodyguards, known as SecOps Five and SecOps Seven.\nIn 3 ABY, SecOps Four was present in a safehouse on Kothlis with Koth Melan and Jedi Luke Skywalker as the Death Star II plans, contained in a stolen supercomputer, were decrypted. The safehouse was attacked by a team of Barabel bounty hunters, who killed Melan and captured Skywalker.\nSecOps Four's leg was wounded by a blaster bolt during the attack, but he was able to escape with the coveted plans by using a piece of plastic pipe as a makeshift cane. While he made his way through Kothlis' industrial sector on foot, intending to hobble to the spynet's hidden ship in a concealed hangar bay, SecOps Four was waylaid by a group of Bothan Spynet members who were of a competing faction. These Bothans, led by Vord'lya and loyal to Borsk Fey'lya, stunned SecOps Four and stole the case containing the Death Star II plans. They delivered the plans to the Alliance to Restore the Republic themselves, allowing Borsk Fey'lya's faction to take the credit.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Bothan_Spynet/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Koth_Melan",
  "/wiki/SecOps_Five",
  "/wiki/SecOps_Seven",
  "/wiki/Kothlis/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Death_Star_II_plans",
  "/wiki/Barabel/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Vord%27lya",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/West_End_Games",
  "/wiki/Safehouse_Besh_(story)",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/Hand-Off"
 ]
}