{
 "name": "Second_Sister",
 "display_name": "Second Sister",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "14 BBY",
      "Nur"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Less than 2.03 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue-green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Cere Junda",
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "The Second Sister, formerly known as Trilla Suduri, was a Force-sensitive human female and a member of the Inquisitorius during the early reign of the Galactic Empire. Prior to the rise of Emperor Palpatine, Suduri held the rank of Jedi Padawan during her time in the Jedi Order. Trained in the Jedi arts, she was an expert lightsaber duelist and later became one of the Empire's deadliest Jedi hunters. However, Suduri's strongest asset was her brilliant intellect, being able to anticipate the behavior of her prey.\nThe Second Sister was once a Jedi who learned the ways of the Force under the Jedi Knight Cere Junda. In the aftermath of the Clone Wars, Suduri and Junda sought to hide from the newly-risen Empire while protecting a group of Jedi younglings. Ultimately, both Master and Padawan were captured and subjected to torture, allowing the dark side of the Force to transform Suduri into the Second Sister. Having forsaken her former identity and the Jedi way, she became a relentless Inquisitor dedicated to destroying the last remnants of the Jedi Order under the command of the Emperor's right-hand, Darth Vader. An ambitious and cruel woman, the Second Sister sadistically toyed with her prey and desired to win the approval of Darth Sidious himself.\nIn 14 BBY, the Second Sister tracked the Jedi fugitive Cal Kestis to the planet Bracca. Kestis managed to escape from the Inquisitors with the help of Junda, however. As a result, the Second Sister hunted the two Jedi across the galaxy, confronting Kestis on Zeffo and raiding planets she believed that Kestis had been to, such as Kashyyyk and Ontotho, which eventually led her to face Kestis on Bogano. When the Second Sister acquired a holocron containing the list of Force-sensitive younglings, Kestis followed her to the Inquisitorius headquarters on Nur and defeated the Second Sister in a lightsaber duel, giving Junda a chance to make amends with her fallen apprentice. Their reconciliation was cut short by the arrival of Lord Vader, who executed the Second Sister for her failure. Before her death, the Second Sister told Kestis and Junda to avenge them all.\nBefore the end of the Clone Wars, Trilla Suduri was taken as a Padawan by Jedi Knight Cere Junda. The pair served alongside clone troopers until the end of the war when the Jedi Order was wiped out by the implementation of Order 66, and escaped along with a group of younglings. Suduri and her master's luck would quickly run out as their hiding place was discovered by an Imperial patrol soon after the start of the Great Jedi Purge. During the Empire's attack, Suduri insisted that she and her master should stick together, but Junda decided to attempt to lead the Imperials away from their position. As her master ran to confront the enemy, Suduri begged her not to leave them. After Junda left, Suduri comforted one of the younglings.\nWhile Junda would succeed in leading the Imperials away, she would eventually be captured. During her imprisonment at Fortress Inquisitorius on Nur, Junda was subjected to torture by her captors and would eventually reveal the location of Suduri and the younglings. The Padawan would soon be captured and subjected to the same torture as her master at Nur. Gradually, the torture, along with her master's betrayal, wore Suduri down and she succumbed to the dark side, becoming an Inquisitor known as the Second Sister. The Second Sister then approached Junda who was strapped to a machine and surrounded by Imperial Stormtroopers. One of the Troopers then handed Trilla her helmet. As she put it on, Junda flew into a rage and ended up using the dark side to unleash a Force wave that pushed the Second Sister to the ground and killed all of the Troopers and everyone else in the room, allowing Junda to make her escape.\nIn 14 BBY, the Second Sister was present at the Inquisitorius Headquarters alongside the Grand Inquisitor, Seventh Sister, Fifth Brother, Eighth Brother, Iskat, and a Twi'lek Inquisitor. She stood beside a table where two of the Inquisitors toasted with Dust Juice to the death of former Jedi Master Eeth Koth during their recent mission as they began discussing what the Dark Lord of the Sith Darth Vader would do after all the Jedi were dead.\nSometime later, the Second Sister traveled to the planet Bracca with the Ninth Sister and some Purge Troopers in search of a possible Jedi. Halting a train carrying members of the Scrapper Guild, the passengers were rounded up. The Second Sister then piloted her TIE/IN interceptor, the TIE/IN Interceptor Prototype to land nearby at the same time as the shuttle carrying the Ninth Sister landed. The two emerged from their respective ships and walked over to address the entire Scrapper Guild.\nThe Second Sister asked whether the entire group of Scrappers was complete, something that was affirmed by one of the Purge Troopers in attendance. She then addressed the Scrapper Guild members, clarifying that they were hunting down a member of the Jedi Order. She reminded them that failure in turning over the 'traitor' would result in a charge of sedition. She then ordered them to hand over the Jedi suspect under the threat of having the entire Guild summarily executed. As Purge Troopers took aim at the scrappers, an Abednedo named Prauf defiantly spoke out, confronting and berating the Empire as a whole for overworking the Scrapper Guild, walking close to the Second Sister and gesturing in her direction accusingly. The Second Sister in response then brought out her lightsaber and summarily executed Prauf on the spot. His friend, Cal Kestis, then reacted by trying to cut her down with his lightsaber, revealing himself as the Jedi. She blocked Kestis' attack with her double-bladed spinning lightsaber and taunted his action as she lifted him with the Force, throwing him over to the Ninth Sister and causing him to be briefly stunned. Kestis then switched on his blade again, prompting the Ninth Sister to drop him off the ledge.\nThe Jedi survived the fall, landing onto a train. While he fought his way towards the front carriage, Junda arrived aboard the Stinger Mantis to extract him. When the Jedi attempted to board the Mantis, the Second Sister shot at the ship from her TIE/IN interceptor. The Jedi fell onto a platform, and the Second Sister then landed her TIE nearby to confront him. The Second Sister then jumped down to Kestis's location and turned on her blade, forcing Kestis to switch on his saber in turn and assume a particular posture. From his stance, she identified that he had possibly underwent training, going on to taunt Kestis on whether she might have met and killed his master prior. The two then briefly fought, until the Mantis returned, shooting at them and separating the two right as they were struggling with their locked blades. The Jedi limped onto the ship as Junda shot at the charging Second Sister who was deflecting her shots back at her. The Mantis door managed to close just as the Second Sister reached it, with the door suffering a slash from the Second Sister's saber. The Inquisitor then latched onto the cockpit window and used the Force to alter the steering, forcing the Mantis into a spin. Junda, however, took back control of this and the Second Sister was shaken off the window, allowing the Mantis to escape.\nSince her first encounter with the Jedi, the Second Sister discovered him to be Cal Kestis, the apprentice of Jaro Tapal. She also learned that his intentions were now linked with Junda's old master, Eno Cordova, and his holocron containing the locations of Force-sensitive children. At some point Kestis was investigating ancient ruins on the planet Zeffo, which prompted the Empire to reinstate its excavations there. The Second Sister predicted Kestis would return to find out more, and awaited his arrival near the Tomb of Miktrull.\nWhen Kestis found her, the Second Sister revealed her knowledge of him and his intentions, asking where Cordova's holocron was. Kestis responded by switching on his saber, an action that the Second sister praised as she switched on her own. The pair engaged in a duel where the Second Sister constantly verbally boasted and emphasized her supposedly superior abilities to Kestis. The duel finally came to an abrupt end when the Second Sister used the Force to lift Kestis and then push his body against a nearby gate emblazoned with the Imperial seal, breaking the gate. Kestis' droid, BD-1, then activated a shield on the other end of the gate that managed to prevent her blade from striking Kestis, separating the two. The Second Sister made a show of testing the gate's strength with her lightsaber before accepting that she could not attack him directly for the moment. The Second Sister commended his learning, comparing him to Junda's last apprentice  while noting that the apprentice had still been superior. After talking more of Junda, her apprentice, and why Junda hadn't told him more about the apprentice's past, she removed her helmet, revealing that she was that apprentice. Kestis wished to resist her manipulation, but the Second Sister coined the possibility of Junda selling him out like she did to her and told him that Junda had used the Dark Side. Continuing to predict Junda's betrayal of him, the Second Sister also brought up Kestis' master, Tapal, and proceeded to anger Kestis, who said he would protect the force sensitive on that list, though Trilla said that she once held that view as well, before calling her helmet to her hand and departing the scene.\nAs Kestis continued towards the Tomb of Miktrull, he attempted to contact Junda when the Second Sister sliced and rerouted his communications, claiming that she had perfected all of Junda's techniques. She claimed that she had acquired an artifact at the rear of the tomb, and taunted Kestis, speculating Cordova's intentions with the Zeffo. As she continued to taunt him, she sent Purge Troopers after Kestis, all of which he defeated. After Kestis raised the tomb from the floor of a chamber and examined it, the Second Sister thanked him for clearing the way, revealing that she had deceived him to find the tomb. Kestis had BD-1 reverse her slicing of his comms and encrypt it.\nAt some point after hearing of Kestis' recent collaboration with Saw Gerrera's Partisans on Kashyyyk against Imperial forces, the Second Sister and the Ninth Sister traveled to the planet and led reinforcements from the Empire to crush the growing local resistance. Their attack happened concurrently with Kestis' imprisonment at the hands of the Haxion Brood. After the Imperial Refinery was reclaimed, Gerrera retreated, but the Second Sister was able to confront one of his insurgents. She questioned the insurgent, before killing her.\nWhen Kestis later returned to Kashyyyk, he witnessed the devastation wrought by the Second Sister and Ninth Sister's counterattack. Kestis also came up against the Ninth Sister, who had stayed on the planet in case Kestis returned. During their fight, Ninth Sister continually insulted both Kestis and the Second Sister, belittling the Second Sister's ability to catch Kestis and her supposed penchant for gathering souvenirs from the people she hunted.\nWhile exploring Kashyyyk sometime after the Second Sister's attack, Kestis came across two Troopers conversing with each other. One stated that he had been complimented by a Purge Trooper recently. The second trooper commended him and claimed that the Second Sister had actually tried to compliment the second trooper earlier but that he was too busy fighting at the time. The first trooper then declared that they were true assets to the Empire. The two Troopers were later killed by Kestis.\nWhen Kestis returned to the Mantis, he explained to the crew that the Second Sister was gone for the moment, but was still actively chasing them. Junda then began to open up about her part in Trilla's fall and her acceptance of how Junda would never be able to make it right before emphasizing that they still had a chance to save the people within the holocron. Kestis then attempted to put Junda's mind at ease, asserting how Junda had gone through the same thing the Inquisitors had yet still refusing to turn to the Dark Side.\nThe Second Sister, alongside a number of Purge Troopers, traveled to the world of Ontotho after rumors of the presence of a Jedi there arose. Upon her arrival in the midst of a battle, she demanded a report of the conflict, yet her identity was questioned by Stormtrooper Commander Atty, to which she told him she was a person who did not ask things twice. Despite Atty insisting that they had the situation under control, the Second Sister merely informed him that she would not be there if he was correct, and addressed the rumors that had brought her there, rumors of an unusual foe.\nAtty once again dismissed the idea, saying that a trooper had thought he had seen a lightsaber yet since the trooper had died days ago, the story had taken a mind of its own. The Second Sister did not share Atty's view of the situation, and informed him that she wished to meet their enemy herself, ordering Atty to have his men cease fire, before surging forwards with her Purge Troopers. They were fired upon, prompting the Second Sister to ignite her lightsaber to repel enemy fire, before ordering her Purge Troopers to return fire, spread out, and capture her one of the attackers alive.\nThe Second Sister soon noticed that the enemy had stopped firing, and when questioned by a Purge Trooper on whether they should pursue, the Inquisitor dismissed the idea, saying that she thinks that their foe would come to them instead. The Second Sister then moved again, noticing an individual wielding a lightsaber. She ordered her troops to secure the area, and declared that the individual was her target, before attacking. The Second Sister then engaged in a lightsaber battle against an apparent Jedi. As they fought, the Second Sister quickly gained the upper hand in the fight, even mocking her adversary by calling her too slow and too soft.\nForcing her opponent back into a corner, the Second Sister told her that the Force had abandoned her, only for her opponent to attack her with a blaster, which was easily deflected off the Second Sister's armor. However, this made the Inquisitor realize that the old woman was no Jedi. The Second Sister then slashed with her lightsaber, and severed the woman's arm, before torturing her, demanding to know where an insurgent like her had gotten a lightsaber. The woman revealed the weapon was taken from a temple, but before the Second Sister could question her prey further, she was interrupted by a Purge Trooper, who reported that the area was secure per their orders, as the Insurgent Cell was smaller than expected. Not getting any further information from the old woman, who declared they would never find the temple, the Second Sister killed her, and ordered that any other insurgents found be brought to her, and that she would find the temple herself.\nThe Second Sister later saw to the attack on a village during her search for the temple. When she arrived at the village, she questioned the Purge Trooper Captain on whether the people of the village were still fighting back. When the Captain confirmed that they were, the Second Sister informed him that that meant that they knew something, and was keeping it from them. When the Captain declared that they had found nothing, the Second Sister merely used the Force to expose a stairway leading underground, stating that they just didn't look hard enough.\nArriving at the entrance of the temple, the Second Sister told her troopers that only two of them would accompany her. As they entered, she questioned what the locals had been keeping from them in the temple. She began examining the writing on the walls when one of the Purge Troopers identified a droid in the rubble. The Second Sister reactivated it and it continued a sentence stating that someone had gotten everyone killed. When she asked who it was talking about, it said the Jedi had caused all of it.\nOne of the Purge troopers informed the Second Sister that the Jedi had been to the temple before. When he asked what had happened at the temple, she replied that it was impossible to say but acknowledged the temple's importance to the locals. The droid that she had questioned began to shut down due to low power. Finding a datapad in its hand, the Second Sister realized that it had belonged to Eno Cordova. Seeing that its last entry was incomplete, she ordered her troopers to prepare to depart for the planet Bogano, emphasizing that Junda and Kestis would not be able to hide from her forever.\nAfter Kestis recovered the key to recovering the holocron, he traveled to Bogano to retrieve it from a vault. While engrossed in the attempt, Kestis experienced a Force Vision that showed him training a group of force sensitive younglings that were eventually pursued and tortured by the Empire. In the vision, Kestis was cornered and threatened by the Second Sister yet again. Kestis thus kneeled and surrendered to her to spare the youngest of the younglings, with Kestis eventually becoming an Inquisitor in the vision. Coincidentally, shortly after emerging from the vision, Kestis actually encountered the Second Sister, who confronted Kestis in the vault after he uncovered the holocron. Unlike her previous encounters with Kestis or her previous mission to Ontotho, Trilla noticeably no longer wore her Inquisitor's helmet. In their exchange of words, Kestis told the Second Sister that she made a mistake not killing him on Bracca. She bragged that she had only wagered his life against finding the holocron and winning the favor of the Emperor, the Dark Lord of the Sith Darth Sidious himself. After she proceeded to taunt him, the two fought each other. During their duel, Kestis was able to push the Second Sister to the ground and take her lightsaber. The lightsaber, though, forced him to view the Second Sister's past right then and there. The Second Sister then taunted him about the saber's long and deadly past as she grabbed the holocron and fled. The memories he viewed of the Second Sister were of the moment Junda left her as a padawan with another youngling to try to distract the Empire as well as her subsequent torture under the Empire and her first meeting with Junda as the newly-appointed Inquisitor. When Kestis finally emerged from her memories, he encountered several Imperial forces on the planet that had either accompanied her or arrived shortly after she did.\nThe Second Sister took the holocron to Fortress Inquisitorius and at some point procured an identical double-bladed spinning lightsaber to replace the one that Kestis had taken. When Kestis went back to the Stinger Mantis with the Second Sister's saber, he informed her of Trilla's success and the danger it now posed. He also explained what he had seen from Trilla's perspective, apologizing for doubting her. Junda then used Trilla's saber to ceremonially bestow upon Kestis the position of a Jedi Knight. Junda predicted the Second Sister would go back to Nur and she and her crew traveled to Nur to retrieve the holocron. The Stinger Mantis was able to pass the Imperial blockade unnoticed and Kestis and Junda used escape pods to reach the surface, infiltrating the fortress and killing many troops, with Junda using the Second Sister's stolen saber as her primary weapon. As Kestis made it to the interrogation room to take back the holocron, the Second Sister ambushed him, and the pair fought once again. Kestis said that he saw the suffering she had been through, telling her it was not too late to let go of her hate. The Second Sister refused by claiming the pain made her stronger and taunting him with the holocron.\nAs the two continued to fight, Kestis hit Second Sister in the shoulder, causing her to drop her lightsaber and fall to her knees in defeat. Junda then arrived and approached the Second Sister, wishing to redeem her old Padawan, although the Inquisitor insisted that it was too late. Junda didn't believe it was and apologized to her for all of the pain she had caused her. The Second Sister then stood up and told her how much hate she carried against her, with the Second Sister's face now conveying a more neutral expression. Before she could say anything more, she sensed the arrival of her current master, Darth Vader, who then used the Force to hold her. Unable to break free, Suduri told Junda and Kestis to \"avenge us\" before Vader, who was unforgiving of his subordinate's inability to complete her mission in hunting Kestis and securing the holocron, activated his lightsaber and executed her.\nHaving just executed the Second Sister, Vader was able to capitalize on her death to strike further fear into Kestis and Junda. Junda told Kestis to run as she charged at Vader with the lightsaber Kestis had taken from the Second Sister in Bogano. Vader easily threw her away from him using the Force and strode towards Kestis, advising him that it would be wise to surrender, with Kestis somewhat agreeing. Shortly after, Vader pulled Kestis into a chokehold as he stood right alongside the fallen Second Sister's corpse. Kestis managed to pull a section of the fortress down towards them, forcing Vader to stop the object in midair and throw Kestis out of the room, thus leading to Vader's pursuit of Kestis throughout the station.\nWhen Vader caught up to Kestis in the Tower Transit Passage, Junda managed to intercept Vader and duel him while using the Second Sister's lightsaber. She eventually turned to the Force to try to stop Vader. Vader complimented her ability, stating that she would have made an excellent Inquisitor. As she continued to use it, Vader could sense that she was tapping into the dark side, something he told her as Vader started to stand and fight off her best efforts. Kestis convinced Junda to fight the urge and the two managed to escape from the Fortress after flooding the section.\nIn the years following the fall of the Galactic Empire, Jedi Master Luke Skywalker traveled the galaxy to rediscover the history of the Jedi Order that had been suppressed by the Empire. In his search for knowledge, Skywalker became aware of the Second Sister's existence. During his self-imposed exile on Ahch-To, Skywalker wrote a book he titled The Secrets of the Jedi, which chronicled the information he had learned on his travels. The Second Sister was one of several Inquisitors who were depicted in the book as illustrations, alongside information pertaining to the Inquisitorius.\nTrilla Suduri was a tall, slender human female with light-brown skin, blue-green eyes and sleek black hair. During her time as a Padawan, she was kind and compassionate, caring for her master and the younglings under her protection. However, after her master's betrayal and her torture at the hands of the Galactic Empire, her personality became twisted.\nAs the Second Sister, she was cruel and ambitious, relishing in hunting down all Force-sensitive survivors for the Empire. Furthermore, she was a vindictive and dishonest warrior, driven by a comprehensive hatred for the Jedi Order that had failed her. She was an exceptionally cunning and intelligent individual. Her sociopathic tendencies allowed her to patiently manipulate almost any adversary into revealing their weakness and fears. She was also known to keep souvenirs that were taken from the individuals she hunted. While she was known to sadistically toy with her opponents, an extension of her manipulative abilities, she was also quite arrogant, bragging to Kestis that there was no technique Cere Junda had at her disposal that she hadn't perfected. However, despite her intimidating posture, she showed an immense fear of her last master, Darth Vader, and was seen visibly trembling when he appeared behind her just before her execution at his hand.\nThe Second Sister was an expert lightsaber duelist and adept with the dark side of the Force. She could use Force Dash to great effect in battle, and also utilized Force drain during her duel with Kestis on Nur, though her greatest weapon was her preternatural ability to predict the behavior of her prey. She was capable of telekinetic techniques such as Force push and Force repulse. She could also slow her fall. She was also proficient at saber throw, being capable of throwing it multiple times in a row and making temporarily orbit around her. During her time as Cere Junda's Padawan, Trilla was taught how to slice by her master. The Second Sister demonstrated her slicing proficiency when she managed to easily reroute Cal Kestis' comm signal that had initially been connected to Junda on the Stinger Mantis.\nThe Second Sister was equipped with a helmet and wore a personalized version of the standard gray and black Inquisitor attire. She also had a black cape with an Imperial crest in white on the shoulder portions. She was armed with a double-bladed spinning lightsaber. After losing her lightsaber to Cal Kestis after their third encounter, the Second Sister replaced it with an identical one. During her duel on Nur, she used flash grenades and even had the help of probe droids to combat Kestis.\nThe Second Sister was created for the 2019 video game Star Wars Jedi: Fallen Order. She first appeared in Darth Vader  19, a comic book written by Charles Soule, penciled by Giuseppe Camuncoli and released on August 8, 2018. She was later identified in the 2018 reference book Star Wars: The Dark Side, written by Tricia Barr. The Second Sister was later identified as Trilla Suduri in Star Wars Jedi: Fallen Order. Elizabeth Grullón provided the voice and motion-capture performance for the character. Grullón started performing motion-capture for the role in October 2018.\nInitial plans for the Fallen Order game envisioned the Grand Inquisitor to be the one to punish Second Sister's failure by executing her at the end of the game. This role was quickly changed to accommodate Darth Vader instead, as the Grand Inquisitor was seen to occupy too similar of a role to the Second Sister.\nIn the section of the book The Art of Star Wars Rebels, the Seventh Sister is seemingly mistakenly referred to as the 'Inquisitor Second Sister' all throughout the whole page.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sister_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Second_Sister",
  "/wiki/14_BBY",
  "/wiki/Nur",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitorius",
  "/wiki/Cere_Junda",
  "/wiki/Jedi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Force-sensitive",
  "/wiki/Brother/Sister",
  "/wiki/Imperial_Era",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Padawan",
  "/wiki/Time",
  "/wiki/Jedi_training",
  "/wiki/Lightsaber",
  "/wiki/Lightsaber_combat",
  "/wiki/Jedi_hunter",
  "/wiki/The_Force",
  "/wiki/Jedi_Knight",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_Initiate",
  "/wiki/Prisoner",
  "/wiki/Torture",
  "/wiki/Jedi_Code",
  "/wiki/Order_66",
  "/wiki/Cal_Kestis",
  "/wiki/Planet",
  "/wiki/Bracca",
  "/wiki/Escape_from_Bracca",
  "/wiki/Secret_mission_to_rebuild_the_Jedi_Order",
  "/wiki/The_galaxy",
  "/wiki/Zeffo",
  "/wiki/Kashyyyk",
  "/wiki/Ontotho",
  "/wiki/Bogano",
  "/wiki/Holocron",
  "/wiki/Youngling",
  "/wiki/Mission_to_Nur",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Lightsaber_duel",
  "/wiki/Death_penalty",
  "/wiki/Death",
  "/wiki/File:Dark_Lord_19_Inquisitor_bar_cropped.png",
  "/wiki/Clone_trooper",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Unidentified_Rodian_Jedi_youngling",
  "/wiki/Inquisitorius_Headquarters",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Seventh_Sister",
  "/wiki/Fifth_Brother",
  "/wiki/Eighth_Brother",
  "/wiki/Iskat",
  "/wiki/Unidentified_Twi%27lek_Inquisitor",
  "/wiki/Toast_(ritual)",
  "/wiki/Dust_Juice",
  "/wiki/Jedi_Master",
  "/wiki/Eeth_Koth",
  "/wiki/Hunt_for_Eeth_Koth",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/File:Second_Sister_hanging_out.png",
  "/wiki/Ninth_Sister",
  "/wiki/Purge_Trooper",
  "/wiki/Train",
  "/wiki/Scrapper_Guild",
  "/wiki/TIE/IN_interceptor",
  "/wiki/TIE/IN_Interceptor_Prototype",
  "/wiki/Scrapper",
  "/wiki/Abednedo",
  "/wiki/Prauf",
  "/wiki/Second_Sister%27s_lightsaber",
  "/wiki/Jaro_Tapal%27s_lightsaber",
  "/wiki/Stinger_Mantis",
  "/wiki/Jaro_Tapal",
  "/wiki/Eno_Cordova",
  "/wiki/Tomb_of_Miktrull",
  "/wiki/File:SecondSisterRevealed.png",
  "/wiki/BD-1",
  "/wiki/Zeffo_(species)",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Haxion_Brood",
  "/wiki/Imperial_Refinery",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/File:AttackOfTheInquisitorius.png",
  "/wiki/Stormtrooper",
  "/wiki/Commander",
  "/wiki/Atty",
  "/wiki/File:SecondSisterOnOntotho.png",
  "/wiki/Neralli",
  "/wiki/Blaster",
  "/wiki/Dismemberment",
  "/wiki/Temple_on_Ontotho",
  "/wiki/Unidentified_Purge_Trooper_captain",
  "/wiki/File:SecondSisterExploresTheTemple.png",
  "/wiki/En-Threelo",
  "/wiki/Datapad",
  "/wiki/File:Cal_vs_Trilla_last.png",
  "/wiki/Bogano_Vault",
  "/wiki/Fortress",
  "/wiki/Escape_pod",
  "/wiki/File:TrillaDeath.png",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/New_Republic_Era",
  "/wiki/Luke_Skywalker",
  "/wiki/Ahch-To",
  "/wiki/Book",
  "/wiki/The_Secrets_of_the_Jedi",
  "/wiki/File:SecondSister-SWTLC.png",
  "/wiki/Hunting",
  "/wiki/File:SecondSisterLeap-JFO.png",
  "/wiki/Force_Dash",
  "/wiki/Force_drain",
  "/wiki/Telekinesis",
  "/wiki/Force_push",
  "/wiki/Force_repulse",
  "/wiki/Slicer",
  "/wiki/File:SecondSisterLightsaber2-SWTLC.png",
  "/wiki/Helmet",
  "/wiki/Cape",
  "/wiki/Imperial_crest",
  "/wiki/Flash_grenade",
  "/wiki/Probe_droid",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/August_8",
  "/wiki/2018",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Tricia_Barr",
  "/wiki/Elizabeth_Grull%C3%B3n",
  "/wiki/October",
  "/wiki/The_Art_of_Star_Wars_Rebels",
  "/wiki/Category:Images_of_Trilla_Suduri",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_1",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_2",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_3",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_4",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_5",
  "/wiki/Star_Wars_(2020)_5",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars_Insider",
  "/wiki/Inside_the_Fallen_Order",
  "/wiki/Star_Wars_Insider_193",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars_Inside_Intel:_Quinlan_Vos",
  "/wiki/Star_Wars_Inside_Intel:_The_Inquisitorius",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/Template:JFODate",
  "/wiki/Tarkin_(novel)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Eriadu",
  "/wiki/Darth_Vader_(2017)_18",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Marvel_Comics",
  "/wiki/November_16",
  "/wiki/July_6",
  "/wiki/2021"
 ]
}