{
 "name": "Seenlu Kir",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 m"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Seenlu Kir was a female Human Jedi Knight serving the Jedi Order and the Galactic Republic during the Republic Classic era's final years.\nDiscovered to be Force-sensitive at a young age, Seenlu Kir was taken to the Jedi Temple on Coruscant for training in the ways of the Force. Studying for years as an Initiate in the Temple's academy, Kir eventually graduated and was taken as a Padawan by a Jedi Master. After years of traveling together, Kir passed her Trials of Knighthood and was made a Jedi Knight by the Jedi High Council. Continuing her studies independently, Kir followed the path of the Jedi Consular in order to help bring peace to worlds throughout the galaxy.\nOn an assignment for the High Council, Kir's hands were scarred when she failed her mission. Donning gloves to hide her hands, Kir began to wear pants and vests as opposed to the traditional robes of the Order. Soon after this failure, Jedi Kir traveled to the Cularin system and began working out of the academy on Almas. Taking on a teaching position, Kir trained students at all levels before being assigned to oversee the dormitories of the youngest Initiates.\nA passionate woman, Jedi Seenlu Kir longed to bring peace to the galaxy through her work with the Jedi Order. Shamed by failing a mission, her reassignment to the Almas Academy helped her forget her shame through working with young students. In addition, Kir's secret desires for a family of her own were set aside after being appointed as overseer of the dormitories.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Cularin_system",
  "/wiki/Almas_Academy",
  "/wiki/Almas",
  "/wiki/The_Kaluthin_Are_Always_Greener",
  "/wiki/Desert_Cries",
  "/wiki/A_Dark_Fortress",
  "/wiki/Shadows_in_Green",
  "/wiki/For_Fun_and_Profit",
  "/wiki/Living_Force_Campaign_Guide"
 ]
}