{
 "name": "Seeqov_Thranx",
 "display_name": "Seeqov Thranx",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thyferra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vratix"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ashern"
     ]
    }
   ]
  }
 ],
 "content": "Seeqov Thranx was a Vratix of the Seeqov hive-clan who identified more as female than male. She was a field inspector and research scientist. Her most notable career accomplishment, for which she was famous on all over Thyferra, was helping eradicate a Rodian fungus epidemic which threatened the alazhi harvest in Thyferra's southern hemisphere. She later became involved with the Ashern, a Vratix independent movement. When the Ashern hired a corporate spy known as the Bloodletter to infiltrate the Bacta Cartel, they appointed Thranx as the Bloodletter's partner. After she revealed that the Ashern had been growing kolcta, a highly effective hybrid between kolto and bacta, the Bloodletter killed her and took the secret to their true master on Coruscant.\nSeeqov Thranx worked for many years as a field inspector and research scientist on Thyferra. She was instrumental in eradicating a Rodian fungal epidemic that had threatened a significant harvest of alazhi. Shortly after this, she was recruited into the Vratix independence movement known as the Ashern. In this capacity, she was the primary contact for their agent known as the Bloodletter. The Bloodletter was a freelance corporate spy who had been hired by the Ashern to infiltrate the Bacta Cartel. and when they struggled to find a way to infiltrate both Xucphra Corporation and Zaltin Corporation, Thranx hit upon the solution of presenting them as a field inspector.\nAfter she had been working with the Bloodletter for a year, the pair were ambushed in an alazhi field by a Mandalorian warrior in blue and silver armor. The warrior shot both Thranx and the Bloodletter, believing them both to be dead. Thranx was mortally wounded but was able to produce bacta within her own body to heal her companion—a particularly effective form of bacta known as kolcta, a hybrid with kolto. The Ashern had been growing it in order to be able to break the monopolies held by the two bacta corporations. Thranx revealed this secret to the Bloodletter so that they could pass it on to the other Ashern before she died. However, the Bloodletter, who was a double agent, killed Thranx and instead passed the secret onto their employer on Coruscant.\nLike many Vratix who worked in frequent contact with humans, Thranx identified with a binary gender. However, although she allowed herself to be referred to by a gendered pronoun, Thranx herself used either the pronoun \"we,\" standard for Vratix, or \"Seeqov\" to refer to herself. The Bloodletter observed that while Thranx was an idealist, she was able to see all sides of a matter.\nSeeqov Thranx was an accomplished research scientist in the field of bacta production. She was also fluent in a number of languages, such as Arkanian, Ithorese, Kubazi, Lepese, and Ryl. During her time as a rebel, she became skilled at deception, a skill she also applied in sabacc matches.\nThranx possessed a datapad, field laboratory kit, hold-out blaster, and a vibrodagger. She also maintained a private apartment in Xozhixi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thyferra/Legends",
  "/wiki/Vratix/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Ashern",
  "/wiki/Bloodletter",
  "/wiki/Seeqov_hive-clan",
  "/wiki/Hive-clan",
  "/wiki/Scientist/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Fungus/Legends",
  "/wiki/Alazhi/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Bacta_Cartel",
  "/wiki/Kolcta",
  "/wiki/Kolto/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Xucphra_Corporation",
  "/wiki/Zaltin_Corporation",
  "/wiki/Mandalorian/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Human/Legends",
  "/wiki/Arkanian_(language)/Legends",
  "/wiki/Ithorese/Legends",
  "/wiki/Kubazian/Legends",
  "/wiki/Lepese",
  "/wiki/Twi%27leki",
  "/wiki/Sabacc/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Laboratory/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Vibrodagger/Legends",
  "/wiki/Seeqov_Thranx%27s_apartment",
  "/wiki/Xozhixi",
  "/wiki/Wizards.com",
  "/wiki/Thyferra:_Bacta_Basics",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}