{
 "name": "Seer_(clone)",
 "display_name": "Seer  (clone)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Frozen moon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "41.5 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Community"
     ]
    }
   ]
  }
 ],
 "content": "Seer was a clone of the Sith Lady Lumiya that was created in an Imperial research facility on a frozen moon in the Unknown Regions.\nSeer was a bald Human clone of the Sith Lady Lumiya that was created by the Galactic Empire in a research facility on a frozen moon in the Unknown Regions, as part of a cloning program that was initiated by Grand Admiral Thrawn. Seer was one of a number of Sith-Jedi clones that were bred in the facility and at some point, she was contacted via the Force by a sentient entity that resided within a Rakatan construct. Seer came to refer to the entity as \"Mother\" and the clones began to worship the entity. Seer eventually became the leader of the clones, who began to refer to themselves as the Community, and the clones killed and overthrew the Imperial forces that operated the research facility. For many years, the clones resided on the moon, and in 41.5 ABY, they escaped the facility by stealing a CloakShape fighter that had been flown to the moon by the Anzat Sith agent Kell Douro.\nSeer and all of the other members of the Community, with the exception of the clone Soldier, suffered from a sickness as a result of their clone heritage and as they escaped from the research facility, the CloakShape passed through the remnants of the Lignan cargo of the Sith dreadnaught Harbinger, which had been destroyed a short time earlier. The Lignan enhanced the clones' perception of the Force and accelerated the effects of their sickness. Seer believed that the illness was a test that had been set for the clones by Mother and she ordered Soldier to fly the CloakShape fighter to the planet Fhost, so that the clones could obtain some medication, and planned for the clones to then travel to find Mother. On Fhost, Seer, Soldier and the surviving members of the Community that had not succumbed to the illness deserted the starfighter and stole a medical supply ship from the Farpoint Medical Center. While stealing the ship, Seer encountered the Jedi Knight Jaden Korr and the clones captured the spacer Khedryn Faal, an associate of Korr.\nThe clones departed from Fhost in the medical ship and headed towards Mother's location. After they had interrogated Faal, Seer stated that the Community no longer had any need for the spacer, so she ordered the clone Runner to kill Faal. However, the Umbaran Nyss Nenn, a Sith agent who had stowed away aboard the ship, killed Runner and the clone Hunter, and planned to kill the rest of the clones. Seer was knocked unconscious during a fight between Soldier and Nenn and the Umbaran decided not to murder her, because he believed that she might be considered useful by his employers, the resurgent Sith Order One Sith. Soldier subsequently forced Nenn to flee the ship in an escape pod and the clones resumed their journey towards the Rakatan construct.\nThe surviving members of the Community—Seer, Soldier and the child Grace—exited hyperspace near to their destination and landed the medical ship inside the Rakatan station. Mother directed Seer to a cylindrical mound inside a large oval chamber, and Seer requested that Mother heal both Grace and Soldier. However, a number of filaments from the mound cocooned themselves around Seer and while the clone screamed for help, Mother transferred her consciousness into Seer's body, killing the Seer. Seer's body became pale, bloated and wrapped in filaments by Mother, and the entity went on a rampage. However, the station exploded a short time afterward, destroying Mother and what remained of Seer's body.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Seer",
  "/wiki/Frozen_moon",
  "/wiki/41_ABY",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Community",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Lumiya",
  "/wiki/Imperial_research_facility",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Mother_(Rakatan_entity)",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Moon/Legends",
  "/wiki/CloakShape_fighter/Legends",
  "/wiki/Anzat_(species)",
  "/wiki/Kell_Douro",
  "/wiki/Soldier_(clone)",
  "/wiki/Lignan",
  "/wiki/Sith_dreadnaught",
  "/wiki/Harbinger_(Sith_dreadnaught)",
  "/wiki/Planet/Legends",
  "/wiki/Fhost",
  "/wiki/Starfighter/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Farpoint_Medical_Center",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaden_Korr",
  "/wiki/Spacer/Legends",
  "/wiki/Khedryn_Faal",
  "/wiki/Runner_(clone)",
  "/wiki/Umbaran/Legends",
  "/wiki/Nyss_Nenn",
  "/wiki/Hunter_(clone)",
  "/wiki/One_Sith",
  "/wiki/Escape_pod/Legends",
  "/wiki/Grace_(Human)",
  "/wiki/Hyperspace/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Crosscurrent",
  "/wiki/Riptide_(novel)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}