{
 "name": "Seese",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Herglic"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "ArkadianateCitizen Guard",
      "Citizen Guard"
     ]
    }
   ]
  }
 ],
 "content": "Seese was a female Herglic who lived during the Republic Dark Age. She lived in the city of Calimondretta on the planet of Syned, the capital of the Arkadianate Sith state, in which she had arrived in 1038 BBY.\nIn 1038 BBY, Seese migrated to the Arkadianate world of Syned where she settled in the city of Calimondretta and subsequently became an Arkadianate citizen. Due to Sith Lord Arkadia Calimondra's policy of rotating individuals through different jobs in their lives, the Herglic mother had worked in at least five different occupations by 1032 BBY including teaching, algae-processing, metallic reclamation, a tactical officer within the Citizen Guard—Arkadia's security force—who served aboard Arkadia's flagship New Crucible, and finally as a tour guide on Calimondretta. She was also known to have four children who lived in the Arkadianate as well.\nIn 1032 BBY, the Jedi Knight Kerra Holt traveled to Syned, and Arkadia ordered Seese to show Holt around Calimondretta. During the tour, Kerra found Seese to have a friendly and likeable personality. Through Seese, Kerra learnt more about life in the Arkadianate and Arkadia's public policies. Seese also found that she could like Kerra even though the latter was a Jedi Knight while she herself was a loyal subject of the Arkadianate. As with many Arkadianate citizens, Seese had been indoctrinated into believing that Arkadia was a benevolent dictator who cared for people. Seese also believed state propaganda rhetoric that Arkadia would one day rule the galaxy. During the Siege of Calimondretta, Kerra would reflect that she was lucky not to have encountered Seese during the fighting since it would have been difficult to kill someone she had befriended merely a few hours earlier.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Herglic/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Arkadianate",
  "/wiki/Citizen_Guard",
  "/wiki/Republic_Dark_Age",
  "/wiki/City/Legends",
  "/wiki/Calimondretta",
  "/wiki/Planet/Legends",
  "/wiki/Syned",
  "/wiki/Capital/Legends",
  "/wiki/Sith/Legends",
  "/wiki/1038_BBY",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Arkadia_Calimondra",
  "/wiki/1032_BBY/Legends",
  "/wiki/New_Crucible",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kerra_Holt",
  "/wiki/Galaxy/Legends",
  "/wiki/Siege_of_Calimondretta",
  "/wiki/Knight_Errant_(novel)"
 ]
}