{
 "name": "Seftin Vanik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Messert"
     ]
    },
    {
     "name": "Died",
     "values": [
      "35 ABY",
      "Exegol"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.67 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "An aerial circus",
      "Resistance",
      "Resistance Starfighter Corps",
      "Exegol air team",
      "Resistance Starfighter Corps",
      "Exegol air team"
     ]
    }
   ]
  }
 ],
 "content": "Seftin Vanik was a human male pilot from Messert who served as a lieutenant in the Resistance. Formerly a stunt flyer in an aerial circus that traveled the Messert system, Vanik was recruited into the Resistance by fellow pilot Poe Dameron, flying an RZ-2 A-wing interceptor in various dogfights for the movement. In 35 ABY, he was stationed on the Resistance base on the moon of Ajan Kloss, where he attended a briefing for a mission on the planet Exegol against Sith Eternal forces.\nAs a member of an air team, Vanik participated in the Battle of Exegol, protecting the ground team tasked with destroying a navigation tower that would allow the Sith Eternal's fleet to leave the planet. During the battle, Vanik was shot down and killed alongside several other Resistance pilots.\nHailing from the world Messert, Seftin Vanik learnt flight skills in the Messert system and operated as a stunt pilot for an aerial circus that traveled around the system during the New Republic Era. When the New Republic withdrew from his homeworld, Vanik questioned his loyalties as he had previously believed in the galaxy-wide government. He eventually became a lieutenant in the Resistance after being encouraged by Resistance pilot Poe Dameron, who had witnessed one of the stunt pilot's performances in the circus, possibly attracted by Vanik's reckless nature. Vanik subsequently participated in various dogfights with enemy starfighters as an A-wing pilot. Vanik eventually earned the nickname of \"Shield Cooker\" for his habit of flying through explosions resulting from his close-proximity hits. At one point, he narrowly evaded a TIE fighter unit over the Core Worlds planet Corellia. At another point, Vanik and a Resistance transport flew away from a celestial body while being pursued by a First Order TIE.\nIn 35 ABY, Vanik was stationed at the Resistance base on the jungle moon Ajan Kloss. He was seated at a console and was monitoring a screen with fellow pilot Nimi Chireen when General Leia Organa, the Resistance's leader, sensed a conflict between her son and her apprentice. Vanik and other members of the Resistance watched as Lieutenant Kaydel Ko Connix escorted Organa to the latter's living quarters, where she soon passed away from exerting the last of her strength through the Force to connect with her son. A large crowd then gathered around Organa's body to mourn her death in silence, with Vanik standing next to the pilot Nien Nunb in the living quarters.\nIt was during that time when Vanik also learned that the Xyston-class Star Destroyers operated by the Sith Eternal's fleet, the Final Order, powered their superlaser cannons using the ships' main reactors. He later attended a briefing hosted by Dameron—who had been promoted to the rank of general alongside fellow Resistance member Finn following the death of Organa—as he detailed the Resistance's mission to the planet Exegol in the Unknown Regions; they were to eliminate the Sith Eternal forces along with their fleet. When Finn displayed a hologram of a navigation tower that would allow the fleet to leave the planet, he explained that a ground team would sabotage the tower. As a member of the air team covering the ground team, Vanik was surprised and questioned why a ground team was required, to which Finn replied he had a plan for them.\nAfter the briefing concluded, Vanik and other Resistance pilots entered their ships and took off, traveling to Exegol through the Red Honeycomb Zone. Upon arriving at the planet, Vanik and the Resistance forces were immediately bombarded by the Sith Star Destroyers' ion cannons. Flying his A-wing, Vanik turned his ship around and warned Major Temmin Wexley to watch the starboard of his X-wing before flying by him. When the signal of the navigation tower was switched to the Final Order's command ship, the Resurgent-class Star Destroyer Steadfast, Finn ordered the transport carrying the ground team to land on the Star Destroyer instead.\nHearing Finn's order, Dameron ordered all pilots to cover their landing. As the battle progressed, many Resistance pilots lost their lives. Vanik was shot down and killed when his A-wing was struck by enemy fire, engulfing the ship in flames. While the Resistance was on the brink of defeat, a large fleet of ships arrived at Exegol, led by General Lando Calrissian. With the help of the fleet, the Resistance destroyed the remaining Sith Eternal forces and emerged victorious, returning to Ajan Kloss to celebrate.\nVanik was a human male with black hair, black eyes, and light skin. He began doubting where his loyalties stood after witnessing the New Republic government leave his homeworld. After fitting in quickly with the Resistance, the pilot was a daring member who frequently engaged in point-blank dogfights with enemy fighters, a trait that his wingmates teased him for. Following his escape from a group of TIEs over Corellia, Vanik was eager to pilot his A-wing again. Vanik preferred A-wings as he loved to fly at very high speeds. He stood 1.67 meters  tall.\nAfter becoming a Resistance pilot, Vanik was a highly skilled and brave ace pilot, a status that made him a suitable wingman. He earned the nickname \"Shield Cooker\" as a result of flying through explosions caused by his close-proximity hits on enemy fighters, which pushed his A-wing's shields to its limits.\nAs a Resistance pilot, Vanik flew a green-striped RZ-2 A-wing interceptor. He wore a light-colored flight suit made of undyed fabric along with a KSE-H44 A-wing pilot helmet and a pair of brown insulated flight gloves.\nSeftin Vanik was portrayed by Josef Altin in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker. His surname was revealed in the film's credits, listed as \"Pilot Vanik,\" while his first name was identified in the accompanying reference book, Star Wars: The Rise of Skywalker: The Visual Dictionary, by Pablo Hidalgo.\nStar Wars: The Rise of Skywalker: Expanded Edition, the film's 2020 novelization written by Rae Carson, features a number of differences from the film itself. During the briefing on Ajan Kloss, Rose Tico informs the Resistance that her team has been analyzing the Sith fleet's Star Destroyers, stating that they require a large power source for their superlaser cannons. Vanik adds that the cannons draw power from the reactors. In the film, Tico only states that the ships could be destroyed by targeting the cannons, while Vanik does not speak.\nAnother difference in the novelization is presented during the battle on Exegol when Vanik warns Wexley to watch his starboard while the latter is pursued by a group of TIE/dg starfighters moments before the major's death, while the film shows him saying the line at the beginning of the battle. The scene from the novelization is also detailed in the film's junior novelization by Michael Kogge. This article follows the film's version of events involving Vanik.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Vanik_(disambiguation)",
  "/wiki/Messert",
  "/wiki/35_ABY",
  "/wiki/Exegol",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Unidentified_aerial_circus",
  "/wiki/Resistance",
  "/wiki/Resistance_Starfighter_Corps",
  "/wiki/Exegol_air_team",
  "/wiki/File:Finn-Vanik-GroundTeam-TROS.ogg",
  "/wiki/Resistance_pilot",
  "/wiki/Lieutenant",
  "/wiki/Messert_system",
  "/wiki/Pilot",
  "/wiki/Poe_Dameron",
  "/wiki/RZ-2_A-wing_interceptor",
  "/wiki/Starfighter_combat",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Battle_of_Exegol",
  "/wiki/Planet",
  "/wiki/Sith_Eternal_military",
  "/wiki/Exegol_landing_team",
  "/wiki/Navigation_tower",
  "/wiki/Sith_Eternal",
  "/wiki/Fleet",
  "/wiki/Death",
  "/wiki/File:FinnPoe-LastStand-TROS.ogg",
  "/wiki/Star_system",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Homeworld",
  "/wiki/The_galaxy",
  "/wiki/Starfighter",
  "/wiki/TIE_line",
  "/wiki/Core_Worlds",
  "/wiki/Corellia",
  "/wiki/Resistance_transport",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Jungle",
  "/wiki/Nimi_Chireen",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/The_Force",
  "/wiki/Mission_to_Kef_Bir",
  "/wiki/Ben_Solo",
  "/wiki/Rey_Skywalker",
  "/wiki/Kaydel_Ko_Connix",
  "/wiki/Force_power",
  "/wiki/Nien_Nunb",
  "/wiki/Time",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Final_Order",
  "/wiki/Axial_superlaser",
  "/wiki/Star_Destroyer",
  "/wiki/Reactor",
  "/wiki/Military_rank",
  "/wiki/Finn",
  "/wiki/Unknown_Regions",
  "/wiki/Hologram",
  "/wiki/File:Vanik-Wexley-TROS.ogg",
  "/wiki/Starship",
  "/wiki/Red_Honeycomb_Zone",
  "/wiki/Sith",
  "/wiki/Ion_cannon",
  "/wiki/A-wing_starfighter",
  "/wiki/Major",
  "/wiki/Temmin_Wexley",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Command_ship",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Fortitude_(transport)",
  "/wiki/Fire",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Wingmate",
  "/wiki/Ace",
  "/wiki/Deflector_shield",
  "/wiki/Interceptor",
  "/wiki/Flight_suit",
  "/wiki/KSE-H44_A-wing_pilot_helmet",
  "/wiki/Flight_glove",
  "/wiki/File:Vanik-MainReactors-TROSEE.ogg",
  "/wiki/Josef_Altin",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/2020",
  "/wiki/Rae_Carson",
  "/wiki/Rose_Tico",
  "/wiki/Superlaser",
  "/wiki/Cannon",
  "/wiki/TIE/dg_starfighter",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Michael_Kogge",
  "/wiki/Category:Audio_files_of_Seftin_Vanik",
  "/wiki/Category:Images_of_Seftin_Vanik",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/William_Shakespeare%27s_The_Merry_Rise_of_Skywalker:_Star_Wars_Part_the_Ninth",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Heralds_of_Hope_Squadron_Pack",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Princess_Leia_Organa",
  "/wiki/The_Resistance",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY"
 ]
}