{
 "name": "Seib Nod",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lorrd"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lorrdian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sisterhood of the Beatific Countenance"
     ]
    }
   ]
  }
 ],
 "content": "Seib Nod was a female Lorrdian member of the Sisterhood of the Beatific Countenance on the planet Lorrd. A lifelong member, she grew bored of her cloistered lifestyle and opted for a life of crime instead. Stealing valuable artifacts from her temple, she fled Lorrd and went to the galactic capital world of Coruscant, where she intended to sell the stolen items. She found a buyer in archaeologist Artuo Pratuhr.\nPratuhr and his assistant, Zey Nep, met with Nod at the Outlander Club in 22 BBY. The archaeologist was initially wary of Nod's intentions, but the Lorrdian was able to convince him that she was acting on behalf of the Sisterhood in selling the items. Once he had handed over his money, she decided to double-cross him and left with both the items and the credits. She was later apprehended by Pratuhr and Nep, and was given a long sentence in CoCo Penitentiary.\nA female Near-Human Lorrdian from Lorrd, Seib Nod was a lifelong member of the Sisterhood of the Beatific Countenance. As such, she was forced to live in a cloistered fashion, which soon bored her. With no funds whatsoever, she realized that in order to start a new life for herself, she would have to procure them from somewhere. Not caring how she went about it, Nod stole several valuable artifacts from her temple, and departed Lorrd post haste, for the galactic capital of Coruscant. There, she continued to wear her religious fatigues to mask her criminal intentions.\nIntending to pawn the stolen relics, she was contacted by Artuo Pratuhr, an archeologist who wanted to buy them for the Galactic Museum. Nod met with Pratuhr and his assistant, Zey Nep, at the Uscru Entertainment District's Outlander Club in 22 BBY, at the height of the Separatist Crisis. Initially, the archeologist was suspicious of Nod's intentions, but she claimed that the Sisterhood was selling the items to raise desperately needed funds. The clandestine nature of the sale was to conceal the fact that the Sisterhood was in such financial trouble that it needed to sell the relics in the first place.\nPratuhr agreed to the deal, but the criminal atmosphere of Galactic City caused Nod to make a snap judgment—drawing a blaster on the archeologist, she took his money, and fled the Outlander Club for an outbound flight. A few days later, while waiting at the dock, Nod was confronted by Pratuhr, who caught up to her. She did not feel threatened, however—she was armed, he was not. What Nod had not accounted for was the presence of Nep, who, standing behind her and disguised as a refugee, had her own blaster trained on her. Realizing that her plans were thwarted, she returned the money. Pratuhr then took her to the local authorities, and returned the relics to the Sisterhood. Nod was then incarcerated in CoCo Penitentiary for a considerable amount of time, during which she was pardoned by the Sisterhood for her crimes.\nAlthough the Sisterhood of Beatific Countenance required lifelong servitude, Seib Nod did not find her servitude spiritually fulfilling in the slightest, and so, due to her boredom, sought out more material possessions. She was desperate enough to break free of her situation by turning to crime as a way of raising money for herself. Once she had committed one criminal act, she was prone to lying to others, and she found herself so changed by her one act that she felt free to perform another. When she was jailed, she was at such a point that the forgiveness of her fellow Sisters meant nothing to her. Nod had light skin, and as with all members of the Sisterhood, Nod had scripture tatooed on her body, including distinctive facial patterns.\nWhile traditionally members of the Sisterhood wore their robes and masks outside their temple to hide their skin, Nod maintained her religious garb in order to hide her mercenary nature.\nThe character of Seib Nod first appeared, albeit unnamed, in George Lucas' 2002 prequel trilogy film, Star Wars: Episode II Attack of the Clones. The character was given the name \"Seib Nod\" in the 2004 article \"Who's Who in the Outlander Club: It's Ladies' Night,\" which was written by Daniel Wallace and published in the seventy-fifth issue of the Star Wars Insider magazine. Spelled backwards, Seib Nod is Don Bies, a special-effects artist for Attack of the Clones.\nTrisha Biggar's October 2, 2005 reference book Dressing a Galaxy: The Costumes of Star Wars identified the same character as \"Seib Nob.\" Further complicating matters was Stephen J. Sansweet and Pablo Hidalgo's October 27, 2005 reference title Star Wars Chronicles: The Prequels identifying the character as \"Nob Seib,\" leading continuity editor Leland Chee to clarify that Wallace's original designation, \"Seib Nod,\" is correct. The character's story was later fleshed out by Benjamin Christopher Norton Dawe, writing as \"Captain Yossarian,\" through StarWars.com's \"What's The Story?\" Hyperspace feature.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Lorrd/Legends",
  "/wiki/Lorrdian/Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Sisterhood_of_the_Beatific_Countenance",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Archaeology/Legends",
  "/wiki/Artuo_Pratuhr",
  "/wiki/Zey_Nep",
  "/wiki/Outlander_Club/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/CoCo_Penitentiary",
  "/wiki/Galactic_Museum",
  "/wiki/Uscru_Entertainment_District/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Galactic_City",
  "/wiki/Blaster/Legends",
  "/wiki/Refugee/Legends",
  "/wiki/Time/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/George_Lucas",
  "/wiki/2002",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/2004",
  "/wiki/Who%27s_Who_in_the_Outlander_Club:_It%27s_Ladies%27_Night",
  "/wiki/Daniel_Wallace",
  "/wiki/Star_Wars_Insider_75",
  "/wiki/Star_Wars_Insider",
  "/wiki/Tuckerization",
  "/wiki/Don_Bies",
  "/wiki/Trisha_Biggar",
  "/wiki/October_2",
  "/wiki/2005",
  "/wiki/Dressing_a_Galaxy:_The_Costumes_of_Star_Wars",
  "/wiki/Stephen_J._Sansweet",
  "/wiki/Pablo_Hidalgo",
  "/wiki/October_27",
  "/wiki/Star_Wars_Chronicles:_The_Prequels",
  "/wiki/Leland_Chee",
  "/wiki/Benjamin_Christopher_Norton_Dawe",
  "/wiki/StarWars.com",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_44",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_136",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_1_(2014)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/December_27",
  "/wiki/2006"
 ]
}