{
 "name": "Selbie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pijal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pijal capital city cantina"
     ]
    }
   ]
  }
 ],
 "content": "Selbie was a human female hostess who worked at a cantina on the Inner Rim planet Pijal. During the Republic Era, the Pijali woman made the acquaintance of Rael Averross, Pijal's Jedi lord regent. She maintained a casual sexual relationship with him during his time as ruler on the planet. Around 40 BBY, Selbie met with Averross in the cantina, and rebuffed a Chagrian patron's attempts at insulting the regent. Days later, she spent the night with Averross in the regent's quarters of the Pijali palace.\nThe human hostess Selbie hailed from the Inner Rim planet Pijal. She began working at a cantina in Pijal's capital city at some point during the Republic Era. Selbie and the planet's Lord Regent, the Jedi Rael Averross, maintained a sporadic sexual relationship during his time there. Around 40 BBY, Averross visited the cantina that Selbie worked at with a group of Pijal varactyl riders, coming from the stables connected to the Pijali palace. Upon being prompted by a colleague, the regent decided to see if the Pijali hostess wanted to get together again.\nSelbie happily welcomed Averross's attentions, rebuffing the Chagrian patron she had been speaking to. The patron became incensed upon Selbie's casual dismissal, starting to insult the regent and laud himself in comparison. However, when Averross brandished his lightsaber at the Chagrian, the patron began to back out of the cantina. Although the Chagrian threatened to report Averross to Pijal's authorities, Selbie gleefully informed him that the Jedi was the ruling regent of the planet. After the patron left, Averross and Selbie briefly greeted each other, but were interrupted by an alarm calling him back to the Pijali palace.\nDays later, Selbie spent the night with Averross in the regent's quarters of the Pijali palace. When Jedi Master Qui-Gon Jinn visited the quarters, he found them in bed together. Jinn's arrival prompted the embarrassed hostess to quickly gather her belongings and leave, despite Averross's protests. Although Averross defended his decision to indulge in Selbie's companionship, Jinn felt it was inappropriate for a Jedi. Averross remained unrepentant, lamenting Selbie's quick exit.\nSelbie was a flirtatious and confident individual who possessed a risqué sense of humor. While working at the cantina, she assertively defended herself from a pushy patron who tried make advances on her. As a Pijali citizen, Selbie respected the rule of the Pijali monarchy, and held no qualms with pursuing a casual relationship with the planet's Lord Regent, Rael Averross. Despite enjoying Averross's company, she also felt free to pursue other engagements when they were apart. A human female, Selbie had blonde hair and large breasts. Averross felt that she was physically attractive and decently close to his own age.\nWhile visiting Averross in the Pijali palace, Selbie wore an underdress, and possessed a cloak that she donned upon leaving the regent's quarters.\nSelbie appeared in Master \u0026 Apprentice, a 2019 novel by Claudia Gray.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Pijal",
  "/wiki/Human",
  "/wiki/Pijali",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Unidentified_cantina_(Pijal)",
  "/wiki/File:Selbie1.ogg",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/Rael_Averross",
  "/wiki/Jedi",
  "/wiki/Lord",
  "/wiki/Regent",
  "/wiki/Time",
  "/wiki/40_BBY",
  "/wiki/Unidentified_Chagrian_patron",
  "/wiki/Standard_day",
  "/wiki/Regent%27s_quarters",
  "/wiki/Pijali_palace",
  "/wiki/File:Selbie2.ogg",
  "/wiki/Homeworld",
  "/wiki/Pijal_capital_city",
  "/wiki/Cantina",
  "/wiki/Pijal_varactyl",
  "/wiki/Palace_stables",
  "/wiki/Lightsaber",
  "/wiki/Chagrian",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/File:Selbie3.ogg",
  "/wiki/Pijali_monarchy",
  "/wiki/Hair",
  "/wiki/Breast",
  "/wiki/Clothing",
  "/wiki/Cloak",
  "/wiki/Master_%26_Apprentice",
  "/wiki/2019",
  "/wiki/Claudia_Gray",
  "/wiki/Category:Audio_files_of_Selbie",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/Prince",
  "/wiki/Fanry",
  "/wiki/Assassin",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Standard_year",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY"
 ]
}