{
 "name": "Senator_Sneakaway",
 "display_name": "Senator Sneakaway",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Senate",
      "New Republic Senate"
     ]
    }
   ]
  }
 ],
 "content": "A Human male member of the New Republic Senate during the Yuuzhan Vong War escaped the Yuuzhan Vong attack on the planet Coruscant by commandeering the New Republic warship Alamania. The senator's actions led a Phindian captain to nickname him \"Senator Sneakaway\" when she confronted him and another senator on Fleet Command's annex in 28 ABY. Before letting them go, the Phindian demanded that \"Senator Sneakaway\" and his compatriot support a fleet appropriations bill.\nBy the time of the Yuuzhan Vong War—in which the extra-galactic Yuuzhan Vong species invaded the galaxy—in 27 ABY, a Human male served as a senator in the New Republic Senate. That year, the Yuuzhan Vong overran the New Republic capital planet of Coruscant. Seeking to escape the invaders, the senator commandeered the New Republic warship Alamania along with other members of the Senate. During the battle, some of the senator's friends perished on Coruscant.\nIn 28 ABY, having important business on the planet Mon Calamari, the senator and a Sullustan another, who had used a starfighter squadron as his personal escort to escape Coruscant, departed a consular ship that had docked at the Fleet Command annex orbiting Mon Calamari. However, before they could get far, the two senators were accosted by a drunk Phindian Defense Force captain, who dubbed the Human \"Senator Sneakaway\" and his companion \"Senator Scramblefree\" for their actions on Coruscant. Confronting the pair for those deeds, which had hindered the New Republic's defense of the planet, the Phindian laughed when \"Senator Sneakaway\" threatened the captain's commission. The Phindian directed the senators' attention to a group of Defense Force personnel in an officer's club, all of whom shared the Phindian's opinion and were paying close attention. While the Phindian was momentarily distracted, a nervous \"Senator Sneakaway\" and his companion made a break for an exit, but the Phindian caught up to them.\nWith her arms around the senators' shoulders, the Phindian demanded that the two vote for an upcoming fleet appropriations bill or the captain and her Defense Force friends would take money from them in lieu of the funds that the bill would have provided. The Phindian let \"Senator Sneakaway\" and \"Senator Scramblefree\" go, but she warned them as they left hurriedly that if either of them tried to commandeer a fleet ship again, they would be packed into an escape pod and fired at the Yuuzhan Vong.\nTo escape from the Yuuzhan Vong, \"Senator Sneakaway\" commandeered the warship Alamania, even though doing so hindered the New Republic war effort at Coruscant. Later, on the Fleet Command annex, he grew nervous when he noticed the personnel in a nearby officer's club had their attention on him. When accosted by the Phindian, the senator threatened her commission in the Defense Force.\n\"Senator Sneakaway\" appeared in 2002's Destiny's Way, a novel of The New Jedi Order series by Walter Jon Williams.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Alamania",
  "/wiki/Senator/Legends",
  "/wiki/Phindian/Legends",
  "/wiki/Unidentified_Phindian_captain",
  "/wiki/Senator_Scramblefree",
  "/wiki/Fleet_Command_(space_station)",
  "/wiki/Fleet_Command_annex",
  "/wiki/28_ABY/Legends",
  "/wiki/New_Republic_military_appropriations_bill",
  "/wiki/Time/Legends",
  "/wiki/Yuuzhan_Vong_galaxy",
  "/wiki/Species/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/27_ABY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Death/Legends",
  "/wiki/Dac",
  "/wiki/Sullustan/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Green_Squadron_(Pride_of_Honor)",
  "/wiki/Consular_ship/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Captain/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/2002",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/Walter_Jon_Williams",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}