{
 "name": "Senin Vant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Utai"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Utapau Skyforce"
     ]
    }
   ]
  }
 ],
 "content": "Senin Vant was an Utai who served as air commodore of the Utapau Skyforce on the planet Utapau. Vant piloted a Rogue-class Porax-38 starfighter and in the year 19 BBY, helped to re-fuel the Eta-2 Actis-class light interceptor of Jedi Master Obi-Wan Kenobi when he arrived on Utapau in search of Separatist General Grievous.\nThe Utai male Senin Vant was a pilot and mechanic who served as the air commodore of the Utapau Skyforce during the Clone Wars between the Confederacy of Independent Systems and the Galactic Republic. The Skyforce was responsible for the security of Utapau within the wider Tarabba sector, but was forced into hiding when the Separatist General Grievous successfully took control of the planet in order to use it as his new headquarters.\nIn the year 19 BBY, Vant was present on one of the landing platforms of Utapau's capital, Pau City, when Jedi Master Obi-Wan Kenobi landed there in his Eta-2 Actis-class light interceptor in order to start searching for Grievous. The Jedi was greeted by the city's Port Administrator Tion Medon, who ordered Vant and two other Utai to re-fuel the visitor's interceptor and informed Kenobi that Grievous and his forces were on the city's higher levels. The trio of Utai attended to the starship quickly, after which Kenobi had his astromech droid R4-G9 pilot the ship away, while he remained behind and confronted Grievous, starting the Battle of Utapau.\nVant had gold eyes and tan skin.\nVant piloted a Rogue-class Porax-38 starfighter and wore a breath mask with built in comlink while flying. While re-fueling Kenobi's starship, Vant wore a turquoise uniform with red markings and a pair of Varactyl muck boots.\nSenin Vant first appeared in the 2005 prequel trilogy film, Star Wars: Episode III Revenge of the Sith. In the current canon, Vant was first identified by the 2018 reference book Star Wars: The Visual Encyclopedia, which was written by Adam Bray, Tricia Barr and Cole Horton. The character was originally created for the 2005 Star Wars Legends reference book Star Wars: Revenge of the Sith Incredible Cross-Sections, which was written by Curtis Saxton and did not identify Vant as one of the Utai seen in Revenge of the Sith.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Senin_Vant",
  "/wiki/Senin_Vant/Legends",
  "/wiki/Utai",
  "/wiki/Color",
  "/wiki/Utapau_Skyforce",
  "/wiki/Air_Commodore",
  "/wiki/Planet",
  "/wiki/Utapau",
  "/wiki/Pilot",
  "/wiki/Rogue-class_Porax-38_starfighter",
  "/wiki/Standard_year",
  "/wiki/19_BBY",
  "/wiki/Fuel",
  "/wiki/Eta-2_Actis-class_light_interceptor",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Gender",
  "/wiki/Battle_of_Utapau",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Engineer",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Tarabba_sector",
  "/wiki/Capital",
  "/wiki/Pau_City",
  "/wiki/Obi-Wan_Kenobi%27s_Eta-2_Actis-class_interceptor",
  "/wiki/Jedi",
  "/wiki/City",
  "/wiki/Port_Administrator",
  "/wiki/Tion_Medon",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Starship",
  "/wiki/Astromech_droid",
  "/wiki/R4-G9",
  "/wiki/Starfighter",
  "/wiki/Eye",
  "/wiki/Breath_mask",
  "/wiki/Comlink",
  "/wiki/Clothing",
  "/wiki/Varactyl",
  "/wiki/Boot",
  "/wiki/2005",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/2018",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Adam_Bray",
  "/wiki/Tricia_Barr",
  "/wiki/Cole_Horton",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Revenge_of_the_Sith_Incredible_Cross-Sections",
  "/wiki/Curtis_Saxton",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_25",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Databank_A-Z",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}