{
 "name": "Senshu",
 "display_name": "Senshu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Senshu was a human male travel guide. Along with Kamahachi, he helped Princess Misa and Jedi Knight Tsubaki reach a royal palace that the princess had been exiled from.\nThey took a dangerous path to avoid checkpoints, and the guides were awarded over 500 credits for their service, which included crossing the feared Place of the Gods. It was in this area that Kamahachi went missing. Tsubaki eventually found him, and both of them regrouped with Misa and Senshu in a nearby village.\nWhen Tsubaki and Misa attempted to break into the palace and overthrow the Sith Lord Masago, Senshu and Kamahachi were both detained by guards and threatened by Masago.\nSenshu first appeared in the Star Wars: Visions short film \"Akakiri,\" and was voiced by Chō in Japanese and George Takei in English. In the original Japanese, he was named センシュウ . In English, however, the rendering of his name has been inconsistent. Both the English subtitles and a promotional blog post on StarWars.com name him Senshuu, but the end credits list him as Senshu.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kamahachi",
  "/wiki/Prince",
  "/wiki/Misa",
  "/wiki/Jedi",
  "/wiki/Jedi_Knight",
  "/wiki/Tsubaki",
  "/wiki/Exile_(punishment)",
  "/wiki/Credit",
  "/wiki/Place_of_the_Gods",
  "/wiki/Sith_Lord",
  "/wiki/Masago",
  "/wiki/Akakiri",
  "/wiki/Ch%C5%8D",
  "/wiki/George_Takei",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210"
 ]
}