{
 "name": "Serchill Rostok",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Special Forces",
      "Rogue One",
      "Rebel Alliance Special Forces",
      "Rogue One"
     ]
    }
   ]
  }
 ],
 "content": "Serchill Rostok, nicknamed \"Rostok the Rock\" was a human male soldier that served in the Alliance to Restore the Republic's Special Forces during the early rebellion against the Galactic Empire. A renowned sniper, Corporal Rostok was one of the many volunteers for Captain Cassian Andor's unauthorized mission to retrieve the technical readouts for the Imperial Death Star superweapon from the Imperial security complex on the planet Scarif in 0 BBY. Armed with his signature A-300 blaster rifle in a sniper configuration, Rostok was a member of a distraction team that drew away Imperial forces from the complex and allowing Andor's small infiltration team to retrieve the plans. Although the mission was a success, Corporal Rostok was killed during the battle with the rest of Rogue One.\nSerchill Rostok was human male member of the Alliance to Restore the Republic during the early rebellion against the Galactic Empire. By the year 0 BBY, Rostok had attained the rank of corporal in the Rebel Alliance Special Forces, operating as a member of the Massassi Group, the largest rebel cell headquartered in the Great Temple on the fourth moon of the planet Yavin. Rostok was a proficient sharpshooter, earning the nickname \"Rostok the Rock\" for his ability to hold his breath and sit motionless for an extended period of time, while lining up a perfect shot. In the field, he usually worked with Private Arro Basteren as his spotter.\nIn 0 BBY, the Alliance learned about the existence of an Imperial superweapon with planet-destroying capabilites. Further investigation by Intelligence Captain Cassian Andor and an outlaw named Jyn Erso revealed that the weapon, code-named \"Death Star,\" had been sabotaged by Erso's father, Galen. An Imperial engineer, Erso had placed a crucial weakness in the station's construction, but its exact location could only be pinpointed by examining the station's technical readouts, kept inside a secure vault in the Imperial security complex on the planet Scarif. Rostok was present on Yavin 4 when Andor and Erso arrived at the rebel headquarters, pleading the Alliance High Command to assemble a strike team to go to Scarif and retrieve the plans.\nAn official mission to Scarif was deemed too dangerous by the rebel command and was not approved. In the aftermath of that decision, Rostok was one of the several rebel soldiers approached by SpecForce Lieutenant Ruescott Melshi, who was assembling a team of volunteers on behalf of his friend Andor. Rostok was informed by Melshi that they were going to Scarif regardless, and that the mission was dangerous and went against direct orders of their commanders, yet the corporal accepted the mission nonetheless.\nRostok joined a team of over two dozen volunteers, including rebel troopers, as well as Melshi, Andor, Erso, the defected Imperial pilot Bodhi Rook, the reprogrammed Imperial KX-series security droid K-2SO, and the Guardians of the Whills Chirrut Îmwe and Baze Malbus. The squad took on the callsign Rogue One, procured some rebel equipment and departed for Scarif aboard the stolen Imperial cargo ship, SW-0608. The team used stolen Imperial access codes to pass through the Shield Gate above the planet and landed at Landing Platform Nine of the Imperial security complex.\nA few soldiers remained aboard the shuttle with Rook, while Andor, Erso and K-2SO ventured inside the vault, disguised as an Imperial inspection team. Rostok and the rest of Rogue One, commanded by Melshi, left the shuttle, taking advantage of the cover provided by blasts of coolant that spewed from the shuttle's purge vents per standard Imperial landing procedures. The mission of Rostok's squad was to provide enough of a distraction for Andor and Erso, so that they could safely retrieve the plans. Rostok and the team traveled eastward from the shuttle through the jungles of Scarif, reaching a hillock near Imperial barracks. Rogue One split up, setting explosives on the various landing pads throughout the complex, before reassembling at the hillock.\nOn Andor's signal, Melshi detonated the explosives, drawing out the dazed Imperial forces out, right into the line of fire of Rogue One. Due to the surprise nature of the attack, the rebels initially had the upper hand, with Rostok lending his expertise with an A-300 blaster rifle to the fight. However, as Imperial reinforcements started to arrive and rebel soldiers began to fall—much to Rostok's dismay—Melshi ordered the survivors to retreat. Rostok was among a dozen of survivors who fled from the fight at the barracks and regrouped on the beach, where they were relieved to see the arrival of rebel reinforcements. The rebels had intercepted Imperial communications regarding rebel activity on the plane and had arrived at Scarif to assist Rogue One, providing some ground reinforcements and air support, before the Empire closed off the Shield Gate, separating the rebels on Scarif from the rest of the Alliance fleet in orbit.\nMelshi then relayed new orders to Rostok and the rest of the rebels on the ground–the team needed to travel to a bunker complex within the outer perimeter of the Citadel Tower, where they had to locate a so-called \"master switch\" in order to link up the Imperial complex's massive Citadel Tower with Rook's shuttle. That would enable allow Rook to contact the rebel fleet in space and instruct them to create an opening in the planetary shield, which in turn would enable Andor and Erso to transmit the obtained Death Star plans to the rebel ships. Rostok and the rebels sprinted toward the bunker complex, just as elite Imperial death troopers joined the fray on the enemy's side. The corporal did not survive that desperate attack, killed by Imperial forces before he could reach the bunker. The remainder of the rebel team completed their mission, however, successfully activating the master switch and transmitting the plans to the fleet.\nRostok was superstitious, using a specific electroscope, which he considered \"lucky.\" . He was visibly shaken by the death of fellow soldiers on Scarif, crying out in shock, and rushing to a fellow soldier's side after the man was fatally shot by the enemy.\nExpert at camouflage and stealth, Corporal Rostok was an exceptional sniper, able to pick off high priority targets from afar with the help of his spotter, Private Basteren. The corporal was capable of sitting still and holding his breath for over fifteen minutes, which earned him his nickname \"Rostok the Rock.\"\nRostok's weapon of choice was an A-300 blaster rifle, set up in a sniper configuration. The rifle had a perforated air-cooling shroud, which enabled rapid fire. During the Battle of Scarif, Rostok wore a set of beige rebel fatigues, complete with a cap, a set of goggles and a comlink strapped to the cap.\nRostok used a specific, \"lucky\" electroscope. The electroscope had a pronounced drift, for which Rostok compensated mentally.\nCorporal Rostok first appeared as one of the members of Rogue One in the 2016 film Rogue One: A Star Wars Story, played by Matt Rippy. He was identified by the first name Serchill in the accompanying Star Wars: Rogue One: The Ultimate Visual Guide, released simultaneously with the film on December 16, 2016. In the book Star Wars: Rogue One: Secret Mission, his name is misspelled as \"Restak,\" while the 2017 sixty-second issue of the Star Wars Helmet Collection magazine misspells the surname as \"Rostock\" on one instance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/0_BBY",
  "/wiki/Scarif",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Rogue_One",
  "/wiki/Rebel_trooper",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/Sniper",
  "/wiki/Corporal",
  "/wiki/Captain",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/A-300_blaster_rifle",
  "/wiki/Standard_year",
  "/wiki/Massassi_Group",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Planet",
  "/wiki/Yavin_Prime",
  "/wiki/Time",
  "/wiki/Private",
  "/wiki/Arro_Basteren",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Mission_to_the_Ring_of_Kafrene",
  "/wiki/Galactic_Empire",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Jyn_Erso",
  "/wiki/Saboteur",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Engineer",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Scarif_vault",
  "/wiki/Alliance_High_Command",
  "/wiki/Lieutenant",
  "/wiki/Ruescott_Melshi",
  "/wiki/Bodhi_Rook",
  "/wiki/Programmer",
  "/wiki/KX-series_security_droid",
  "/wiki/K-2SO",
  "/wiki/Guardians_of_the_Whills",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Baze_Malbus",
  "/wiki/Squad",
  "/wiki/Callsign",
  "/wiki/Thief",
  "/wiki/Zeta-class_Heavy_Cargo_Shuttle",
  "/wiki/SW-0608",
  "/wiki/Shield_Gate",
  "/wiki/Landing_Platform_Nine",
  "/wiki/Imperial_ground_crew",
  "/wiki/Coolant",
  "/wiki/Jungle",
  "/wiki/Barracks",
  "/wiki/Hangar",
  "/wiki/Death",
  "/wiki/Beach",
  "/wiki/Orbit",
  "/wiki/Citadel_Tower",
  "/wiki/Realspace",
  "/wiki/Deflector_shield",
  "/wiki/Death_trooper",
  "/wiki/2016",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/December_16",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/2017",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_171",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/StarWars.com"
 ]
}