{
 "name": "Serdif_Tount",
 "display_name": "Serdif Tount",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "35 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Serdif Tount was the Imperial governor of the planet Rintonne. A native of Coruscant, Governor Tount was under the orders of Moff Par Lankin of the Lambda sector. After the Battle of Endor, Lankin became a warlord and Tount helped him raiding worlds affiliated to the New Republic. In turn, Lankin provided Tount with soldiers to keep control over Rintonne. Governor Tount kept the population scared to prevent any open rebellion against him. He also restricted the freedoms of the civilian population. New Republic Intelligence wanted to overthrow Tount and offered a bounty for him.\nTount was a fat Human male with a moustache, and a capable bureaucrat who kept information under control. He disliked independent bounty hunters, and was believed to use the services of a former Imperial Security Bureau specialist.\nSerdif Tount was a Human male born in 35 BBY on the planet Coruscant. Tount became an official of the Galactic Empire and the Governor of Rintonne, a planet in the strategic Lambda sector. Governor Tount was a subordinate of Moff Par Lankin, who ruled over the whole sector. During the peak of the Empire, Lankin provided Tount with Army troops and stormtroopers that Tount used to retain power over the planet.\nTount extinguished individual freedoms over the civilian population of Rintonne, began a state of martial law and monitored any incoming traffic. He kept an strict control over information: In 4 ABY, the Galactic Emperor was killed, shaking the whole Empire, and the New Republic was created; but the population of Rintonne was unaware of this fact. Tount, on the contrary, did know of the New Republic: He helped Lankin raiding several Republic planets, succeeding in the conquest of three of those.\nNew Republic Intelligence had Tount in its sights, offering a bounty of 35,000 for his capture. They also sent several undercover agents to spy him. When Victor Grieves, a former Imperial Security Bureau specialist, was seen in the Rintonne system, he was suspected to be working for Governor Tount. By 7 ABY, the Intelligence report on Tount specified that he had scared the civilian population so much that they were too afraid to rebel because they saw no chance of victory. However, Intelligence analysts believed that Tount's defeat could trigger a chain reaction that would free the whole Lambda sector. Soon afterward, the Lambda sector stopped being an Imperial pocket kingdom.\nIn 7 ABY, Tount was an overweight, forty-two-year-old man. He sported a moustache and carried with him a walking stick that he could use as a club. A learned man, he was an expert in bureaucracy, specialized in the government of the Lambda sector, and even more in the administration of Rintonne. He was also familiar with the Imperial legislation. He had leadership skills particularly honed to give orders to his soldiers. He also knew how to ride Niorven stable mounts. Like other Imperial bureaucrats, Tount was known to despise the independent bounty hunters, as opposed to Imperial-aligned bounty hunters or members of the Bounty Hunters' Guild.\nSerdif Tount first appeared in Bill Smith's Wanted by Cracken , a roleplaying guide published by West End Games. The book included Tount's roleplaying stats and an image of Tount drawn by Mike Vilardi. Tount was later mentioned in the roleplaying guides Galaxy Guide 10: Bounty Hunters  and Heroes \u0026 Rogues .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/35_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Rintonne/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Par_Lankin",
  "/wiki/Lambda_sector/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Bounty/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Credit",
  "/wiki/Spy/Legends",
  "/wiki/Victor_Grieves",
  "/wiki/Rintonne_system",
  "/wiki/7_ABY/Legends",
  "/wiki/Niorven_stable_mount",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Bill_Smith",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/Roleplaying_game",
  "/wiki/West_End_Games",
  "/wiki/Mike_Vilardi",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/1994",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/1995",
  "/wiki/The_Essential_Atlas"
 ]
}