{
 "name": "Serenata",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Corellian hound"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Supreme Coronet City Diplomat Protection"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Prybolt Garavult"
     ]
    }
   ]
  }
 ],
 "content": "Serenata was a Corellian hound female owned by the Grindalid Prybolt Garavult along with two other hounds, Beeta and Sibak. Serenata was part of the the Supreme Coronet City Diplomat Protection bodyguard business led by Alys Ongwa in Coronet City on the planet Corellia. Around 230 BBY, Prybolt and the rest of Ongwa's crew undertook a protection job for Father of Finances Nomar Tralmat as he attended a meeting in the Syllain District. As requested by Tralmat, the three hounds, Garavult and Ovarto Bitolo-Bash remained outside the building where the meeting was held. Eventually, Garavult grew concerned and took the three hounds into the building with him, where he discovered Tralmat on his hands and knees on the floor with a bloodied nose, and a masked Er'Kit women stood above him. Garavult commanded the hounds to eat the women, though before they could reach her, Beeta was killed. The Er'Kit then gassed the room, which caused the two remaining hounds to squeal. The masked women made her escape, and Garavult was able to get the Father of Finances out of the building. Shortly after, Tralmat went missing and Garavult was killed by the Er'Kit.\nSometime later, other hounds within the crew were used to help Prybolt, Ovarto, and Tralmat within the Syllain District. The hounds instead found Serenata at the end of a block, and alerted Ongwa of this. Ongwa and Barchibar then discovered that fabric from Garavult robes was within Serenata's back teeth. The possibilities of what the discovery meant raced through Ongwa's head, though none of them made sense to her.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corellia",
  "/wiki/Corellian_hound",
  "/wiki/Gender",
  "/wiki/Supreme_Coronet_City_Diplomat_Protection",
  "/wiki/Prybolt_Garavult",
  "/wiki/Grindalid",
  "/wiki/Dog",
  "/wiki/Beeta",
  "/wiki/Sibak",
  "/wiki/Bodyguard",
  "/wiki/Alys_Ongwa",
  "/wiki/Coronet_City",
  "/wiki/Planet",
  "/wiki/230_BBY",
  "/wiki/Father_of_Finances",
  "/wiki/Nomar_Tralmat",
  "/wiki/Syllain_District",
  "/wiki/Ovarto_Bitolo-Bash",
  "/wiki/Blood",
  "/wiki/Nose",
  "/wiki/Armor",
  "/wiki/Er%27Kit_(species)",
  "/wiki/Sabata_Krill",
  "/wiki/Death",
  "/wiki/Gas",
  "/wiki/Barchibar",
  "/wiki/Robe",
  "/wiki/Tooth",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Serenata",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/StarWars.com"
 ]
}