{
 "name": "Serifa_Altunen",
 "display_name": "Serifa Altunen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arkania"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arkanian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Serifa Altunen was a female Arkanian Jedi Knight who served the Jedi Order in the waning years of the Galactic Republic. When the Clone Wars broke out between the Republic and the Confederacy of Independent Systems, Altunen left the Order, believing that it should be serving the Force, not the Galactic Senate.\nA Force-sensitive Arkanian, Serifa Altunen was trained in the ways of the Force by the Jedi Order. Ascending to the rank of Jedi Knight after completing the Trials of Knighthood, Altunen went on to become well respected within the Order. When negotiations between the Republic and the Confederacy of Independent Systems broke down and the Clone Wars erupted across the galaxy, Altunen dutifully took on the role of Jedi General as she led troops in the Grand Army of the Republic.\nAs the war dragged on, Altunen became disenchanted with the Order's role in the war and the corruption in the Galactic Senate. Departing Coruscant, Altunen returned to her homeworld of Arkania where she began encouraging the Arkanian government to declare neutrality during the Clone Wars. When the Jedi High Council heard of this, Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker were dispatched to persuade her to return to the Order and the war. Rendezvousing with Altunen on a watery tundra plain thirty months after the start of the war, Master Kenobi pleaded with the woman to return to the Jedi Temple. Taking off her Jedi robe and folding it, Altunen officially resigned from the Order, citing that she served the Force, and that she believed that the Jedi no longer did. With the conversation over, Altunen departed the company of her fellow Jedi and returned to her people.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arkania/Legends",
  "/wiki/Arkanian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_apparel",
  "/wiki/Yoda:_Dark_Rendezvous",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}