{
 "name": "Serra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ambria"
     ]
    },
    {
     "name": "Born",
     "values": [
      "1008 BBY",
      "Ambria"
     ]
    },
    {
     "name": "Died",
     "values": [
      "980 BBY",
      "Ambria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Doan Royal House"
     ]
    }
   ]
  }
 ],
 "content": "Serra was a Force-sensitive female Human born from Ambria who was the daughter of the healer Caleb. After attempting to kill the Dark Lord of the Sith Darth Bane to avenge her father's death, she was killed by Darth Cognus.\nIn 1000 BBY, Darth Bane came to Caleb, poisoned by synox, and looking for someone to cure him. Caleb initially refused to heal him, but when Bane threatened his daughter's life, using the Force to levitate her over a boiling pot, he relented and healed the Sith Lord.\nIn 992 BBY, Caleb forced his sixteen-year-old daughter to change her name and move to a different planet so that she could not be threatened by Bane again.\nWhen Bane's apprentice, Darth Zannah, came to Caleb to save her Master's life in 990 BBY after a duel on Tython, Caleb informed Zannah that his daughter had moved away, and that she could not use her as leverage against him as Bane had done previously. Zannah still managed to strike a deal with Caleb to heal Bane, before killing the healer and evading the team of Jedi that came looking for them.\nAfter leaving Ambria, Caleb's daughter took the name of Serra and began using her healing abilities around the galaxy. After saving Lucia's life, the former member of the Gloom Walkers became Serra's bodyguard. Serra later met Prince Gerran of the Doan Royal House, who suffered from an illness. Serra tended him and healed him. Over time, the two fell in love and Gerran proposed to Serra. She accepted, despite the fact that Gerran's father opposed this union. She therefore became the Princess of Doan.\nDuring the time following the New Sith Wars, the Doan Royal House came into conflict with the planet's mining caste. In 980 BBY, Gerran was accidentally killed by the miners, an event which sent Serra into a deep depression. Hoping to alleviate Serra's pain, Lucia arranged for the assassination of a mining caste leader, Gelba; however, a Jedi Knight, Medd Tandar, was also killed in the attack. Serra traveled to the Jedi Temple on Coruscant to reassure the Jedi that the assassination was not the fault of the Doan Royal House. While in the Jedi Temple, Master Obba showed Serra a monument which honored the five Jedi who died at Tython, as well as Caleb. Shocked to find that her father had died, Serra swore vengeance and hired the same assassin that Lucia had hired to kill Gelba—known as the Huntress—to capture Bane, whom she believed had killed her father, thus taking her first step toward the dark side.\nDarth Bane was captured by the Huntress and about twenty mercenaries provided by Serra. Bane was then brought to the Stone Prison on Doan, where Serra, now steeped in the Dark Side, tortured and interrogated him, keeping him drugged so he couldn't escape, only to find that he denied having killed her father. Lucia, shocked by the vengeful person Serra had become—and remembering the many times that Bane had saved her life as a member of the Gloom Walkers—decided to free Bane. Meanwhile, Zannah and her new apprentice, Set Harth, arrived on Doan to rescue Bane from Serra, since Zannah needed to personally defeat her master before becoming the next Dark Lord of the Sith. Zannah discovered that Bane had been freed and attacked him in the Prison. Serra, hoping to kill the two Sith, activated the self-destruct sequence for the prison before fleeing with the corpse of Lucia, who had been killed by Zannah. Bane and Zannah's duel ended in a draw, and they both escaped the collapsing prison. Bane found the Huntress as he fled, and the assassin submitted herself to his teachings, taking on the name of Darth Cognus.\nSerra returned to her home on Ambria, where she realized that her father would never have wanted her to be the vengeful person she had become and let go of the Dark Side and her anger. She buried Lucia outside her father's hut. However, Bane and Cognus arrived soon after; Cognus had tracked Serra there through the Force. Serra refused Bane's proposal to serve him as a healer and she tried to convince Cognus that the dark side would destroy her. However, Cognus merely requested Bane's permission to kill Serra. Bane then ordered Cognus to bury the body, not out of any respect, but to merely keep away scavengers.\nSerra, like her father, was a good-hearted person who sought to use her healing abilities to help others and was willing to heal even Lucia after she threatened her with a blaster. She was also strong willed and was able to stand up to anyone, from Lucia and bounty hunters to Darth Bane during their last confrontation on Ambria.\nHowever, Serra had a dark side which stemmed from the constant threat of the \"dark man\" of her past. She suffered many years from nightmares of the encounter, dreams that went away when she married Gerran. However, Gerran's death brought out the dark side of her personality and she was willing to do anything for vengeance against Darth Bane.\nOnly after Lucia's death did she see through her desire for revenge. The loss of the one who was like a mother to her drove her out of her fury. Serra sacrificed her life to try and end Darth Bane's Sith Order by driving Darth Cognus back to the light. She failed, but this was a last act of goodness to try and redeem herself from her crimes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Serra_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Serra",
  "/wiki/Ambria/Legends",
  "/wiki/1008_BBY",
  "/wiki/980_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Doan_Royal_House",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Caleb",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Confrontation_on_Ambria",
  "/wiki/Darth_Cognus",
  "/wiki/1000_BBY",
  "/wiki/Synox",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/992_BBY",
  "/wiki/Planet/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/990_BBY",
  "/wiki/Duel_on_Tython",
  "/wiki/Tython/Legends",
  "/wiki/Ambria_strike_team",
  "/wiki/The_galaxy/Legends",
  "/wiki/Lucia_(soldier)",
  "/wiki/Gloom_Walkers",
  "/wiki/Bodyguard/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Gerran",
  "/wiki/Gerran%27s_father",
  "/wiki/Doan",
  "/wiki/Time/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Mining_caste",
  "/wiki/Mining/Legends",
  "/wiki/Massacre_on_Doan",
  "/wiki/Gelba",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Medd_Tandar",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obba",
  "/wiki/Assassin/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Skirmish_in_Darth_Bane%27s_mansion",
  "/wiki/Mercenary/Legends",
  "/wiki/Stone_Prison",
  "/wiki/Torture/Legends",
  "/wiki/Set_Harth",
  "/wiki/Duel_on_Doan",
  "/wiki/Prison/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Caleb%27s_hut",
  "/wiki/Darth_Bane:_Path_of_Destruction",
  "/wiki/Darth_Bane:_Path_of_Destruction_(audiobook)",
  "/wiki/Jedi_vs._Sith_1",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}