{
 "name": "Servant One",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireEmperor's Hand",
      "Emperor's Hand"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Sith Emperor"
     ]
    }
   ]
  }
 ],
 "content": "Servant One was a Sith Pureblood male Sith Lord of the reconstituted Sith Empire during the Cold War. He was one of the Emperor's Hands, the most trusted servants of the Sith Emperor. Servant One and his colleague Servant Two became aware of Darth Baras's act of silencing the Voice of the Emperor and his motivation in becoming the ruling force of the Sith Empire. To that end, they sought out an agent that would act on behalf of the Emperor. He and Servant Two discovered such an agent in Darth Baras's former Sith apprentice. After gaining the Warrior's trust by rescuing them from Draahg's assassination attempt, Servant One and Servant Two worked with him and awarded to the position of Emperor's Wrath, to weaken Baras's power base in order to ultimately eliminate the threat posed by him.\nDuring the Cold War, the Emperor's Hand became aware of the hand of Darth Baras, a newly appointed member of the Dark Council, in silencing the Voice of the Emperor and seeking to make his claim as the Voice. With the Emperor preoccupied with his own mysterious goals, the Hand was instructed to seek out an agent worthy to become the Emperor's Wrath. They sought such a candidate in Baras' apprentice, whom he chose to betray. Servants One and Two intervened when Lord Draahg, Baras' servant, attempted to bury his rival on Quesh. Seeing their target barely conscious, Servant Two asked his colleague if he could revive their asset. Servant One refused him, stating that they'll wait at the command center exactly one day to see if Baras' apprentice is worthy. Sure enough, the Warrior made it to the Hand's location. They explained Baras' attempts to become the Voice and offer to help the Warrior get revenge.\nBefore striking at Baras, they would need to undermine him. The Hand dispatched the Wrath to Belsavis, a prison world held in secrecy by the Galactic Republic until recently. When the prison manifests were leaked, Baras learned that his sister, Darth Ekkage, a member of the Dark Council and leader of the Sith infiltrators, was imprisoned on Belsavis, and Servant Two realized it as well. The Wrath had to prevent her escape, otherwise many more would flock to Baras' cause.\nThe next step would be to assist Darth Vowrawn, the only Dark Councilor who openly defied Baras, while he was entrenched on Corellia. Armageddon Battalion was to be deployed to assist Vowrawn but Baras redirected the unit to Hoth. Servant One instructed the Wrath to convince Armageddon's commander, General Greist, to abandon Baras' orders and go to Corellia. Lieutenant Pierce, one of the Wrath's loyal retainers, mentioned having served under Greist briefly, describing him, \"as tough as they come and stubborn.\" Servant One insisted they could not afford Greist's stubborn nature to jeopardize their plans.\nThough the Wrath was able to get Armageddon Battalion to Corellia, Draahg discovered his rival's survival. After a long and intense lightsaber duel did the Wrath finally defeat Draahg and left him to burn to death. Unfortunately, the Hand warned that Baras' has sensed Draahg's demise and has become aware of his apprentice's survival as well. The Wrath replied that Baras, being a master of information, would've eventually figured out the truth. Servant One complimented the Wrath's in-depth knowledge of Baras.\nOne of the final pieces to dethroning Baras was on the planet Voss. Servant One explained to the Wrath that though the Voss species had thwarted a previous Imperial invasion, the true purpose of the attack was to claim a Voss visionary to house the Voice of the Emperor. The true Voice went on a pilgrimage to discover the nature of a dark side presence on Voss and has since gone missing, the entire trip was orchestrated by Baras. The Wrath was instructed to retrace the Voice's steps, discover what had befallen him and free him. After the Wrath freed the true Voice from his Voss host in the lair of Sel-Makor, the Emperor's essence returned to the Hand, who then begin preparing another vessel. Servant One passed along the Emperor's gratitude.\nFinally, the Wrath was sent to Corellia to protect Darth Vowrawn from Baras' assassins. The Wrath first had to take care of two assassins before Servant Eleven relayed the location of Vowrawn's base of operation. Servant One then recalled Eleven, allowing the Wrath to proceed to defend Vowrawn before going after Baras' top Corellian spies who blackmailed Dark Councilors who oppose him and freed the Force ghost known as the Entity.\nWith his leverage gone and Vowrawn still alive, Baras' attempts to be named the Voice is crippled. The Hand sends the Wrath to Korriban, where Baras has convened a special session of the Dark Council to make his claim official. Servant One told the Wrath that Vowrawn will grant access to the Dark Council chamber and Baras, where the Emperor's will can finally be done.\nAfter the Wrath disposed of Baras, Servant One sent a holo-message, informing that Wrath that the Hero of Tython assaulted the Emperor's true Voice, under the assumption that it was the Emperor himself. The loss of the true Voice drove the Emperor's consciousness from his new host and sent it into a deep slumber. Servant One advised that the Wrath speak of this to no one.\nFollowing the Assault on Tython and the Korriban Incursion, Servant One sent another message, apologizing to the Wrath for their lack of contact and explained that the Emperor was still in slumber. As the Dark Council continued to assume that the Emperor was dead, the Wrath had to become his representative in place of his Voice, making them fear the Wrath's power.\nLater on, the Hand began sensing a disturbance in the Force that they believed posed a threat to the Empire and sent another warning to the Wrath that his loyalty to the Sith Emperor would soon be put to the test.\nServant One later journeyed to Rishi in response to the Wrath destroying the Opticrons drones surveilling them. After going as far as patronizing the Wrath, the Wrath Force choked him further angering Servant One. After telling the Wrath he had made a grievous error, the Wrath insisted that the error was his and left, thus withdrawing his loyalty to the Emperor and his Hand.\nEventually Sith Emperor Vitiate found his final death at the hand of the Commander of Eternal Alliance, leaving Servant One without a master.\nThe Wrath could choose to obey Servant One or question him which will result in the Wrath not Force choking or angering Servant One. During the flashpoint \"The Nathema Conspiracy\", if the Outlander is a Jedi Knight who remained on the Light Side, Servant One will seek to to avenge his master's death and join the Order of Zildrog led by Vinn Atrius, only to be sacrificed as fuel to awaken Zildrog by GEMINI 16 on Nathema. If the Jedi Knight fell to the Dark Side, they will encounter Jedi Master Bela Kiwiiks instead, while the other classes face antagonists from their own class stories.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Servant_One",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Hand_of_the_Empire",
  "/wiki/Tenebrae",
  "/wiki/Scourge",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Servant_Two",
  "/wiki/Darth_Baras",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Draahg",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Dark_Council",
  "/wiki/Darth_Baras%27s_coup",
  "/wiki/Quesh",
  "/wiki/Belsavis/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Ekkage",
  "/wiki/Darth_Vowrawn",
  "/wiki/Corellia/Legends",
  "/wiki/Armageddon_Battalion",
  "/wiki/Hoth/Legends",
  "/wiki/General/Legends",
  "/wiki/Greist",
  "/wiki/Pierce",
  "/wiki/Voss",
  "/wiki/Voss_(species)",
  "/wiki/Imperial_Attack_on_Voss",
  "/wiki/Unidentified_Emperor%27s_Voice_(Voss)",
  "/wiki/Battle_in_the_Ancient_Halls",
  "/wiki/Sel-Makor",
  "/wiki/Mission_to_Corellia_(Emperor%27s_Wrath)",
  "/wiki/Servant_Eleven",
  "/wiki/Force_ghost",
  "/wiki/The_Entity",
  "/wiki/Korriban",
  "/wiki/Dark_Council_chamber",
  "/wiki/Duel_in_the_Dark_Council_Chambers_(Galactic_War)",
  "/wiki/Hero_of_Tython",
  "/wiki/Dromund_Kaas_operation",
  "/wiki/Assault_on_Tython",
  "/wiki/Korriban_Incursion",
  "/wiki/Rishi/Legends",
  "/wiki/Telekinesis/Legends#Force_choke",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Order_of_Zildrog",
  "/wiki/Vinn_Atrius",
  "/wiki/Zildrog",
  "/wiki/GEMINI_16",
  "/wiki/Nathema",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bela_Kiwiiks",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}