{
 "name": "Servit",
 "display_name": "Servit",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Servit was a Mirialan male who owned an EX droid that was a clue to the location of a valuable treasure. During the Republic Era, he accidentally revealed the droid to Jarl, a Weequay who wished to take the droid for himself. Servit tried to run away, asking advice instead from his friend Dexter Jettster, owner of Dex's Diner, where he mentioned details of a story about the droid that had been passed down in his family. Recognizing that the droid was the same one he knew from an old prospector's tale, Jettster explained its significance to Servit.\nIt was then that Jarl and his crew caught up to Servit, holding the diner's customers at blaster point and trying to get Servit to give up the droid. Shortly after, Jettster knocked the Weequay unconscious, leading to a short skirmish that would have resulted in Servit's favor had Jarl not woken up and held a blaster to Servit's neck. He forced the Mirialan back into the kitchen where he had left the EX droid, where they and Jettster watched a holorecording that revealed the treasure's coordinates. After Jettster tricked Jarl into thinking that the location had been destroyed, the Weequay and his crew left, leaving Servit to find the treasure for himself.\nServit was a Mirialan male who resided on the planet Coruscant during the during the era of the Galactic Republic. He possessed an EX droid that he considered a family heirloom, having been passed down from an ancestor on his mother's side for generations. At some point, while trying to find out the droid's worth, Servit got into contact with the Weequay Jarl; however, since Jarl figured that the droid pointed to a valuable treasure, he tried to take it from the Mirialan, who ran off to the eatery Dex's Diner around midday. He entered, noticing seven diners, none of whom he recognized, much to his relief. Intending to speak with the owner, Dexter Jettster, Servit approached the counter and asked the WA-7 waitress droid Wanda to see him. As Jettster was busy, the Mirialan took a seat, glancing at the door to see a Twi'lek come in, again alleviating his concern of running into Jarl.\nWhen Jettster came to greet him, he gave a bright smile and offered the brakkenback stew; Servit, happy to see his friend, had to decline, asking to talk out back so that he could ask for help. Once in the kitchen, Servit unveiled the battered EX, inquiring why the old droid might be considered special. Jettster explained their history: EX droids had been used by Republic Pathfinders during the Hyperspace Rush in order to communicate. He was puzzled why Servit would have one, so the Mirialan explained how it had been in his family for generations and that it was linked to a family legend: it was all that was left of his mother's ancestor, who had been killed in a pirate raid at the Outer Rim Territories location Shara'Tam, an event that involved a Jedi named Sturm. The story shocked Jettster, who recognized it from his prospecting days; the tale he had heard was centuries old, also involving a Jedi, Sturm Umbrik, who found a great treasure on the moon Shara'Tam but was killed. Only an EX droid survived, which was never found. It came to be known as a tall tale, and Jettster never thought it to be real until the droid showed up in his friend's hands.\nAgreeing that it was possible that the EX droid was the one from the story, Servit now understood why Jarl had been so interested in it. Indeed, as the droid began to reboot, Jarl and his crew caught up to him, indicated to Servit and Jettster by the sound of blasterfire coming from the diner, with Servit apologizing for getting Jettster caught up in his troubles as he explained who had arrived. Rushing to the front of the restaurant, Servit found Jarl leaning on the counter while his crew, consisting of a human, a Togruta, and a protocol droid, T7, were holding the customers at blaster point. The Mirialan reiterated to Jarl that he had no intention of giving up the droid, but the Weequay countered that he would not give him a choice, referencing his hostages. Jettster then came in in support of his friend, leaving Jarl uneasy but still aggressive: he offered Servit time to think over his options while he enjoyed a bowl of stew, although Servit felt that he had not really been given much choice.\nJettster brought Jarl the stew but carried a frying pan with him, serving the Weequay his lunch and subsequently knocking him unconscious with the pan. T7 raised his blaster but was knocked out of commission when Jettster threw stew at him that got into his inner workings, leading the human and Togruta to open fire. During the ensuing lightfight, Jettster was able to take down the remaining members of Jarl's crew with his frying pans, but he had to concede when Jarl awoke and held his blaster to Servit's neck, forcing Servit into the kitchen to inspect the EX droid. The droid, which had been left rebooting on a work surface, had been repeating a message from Sturm Umbrik, revealing that the Jedi had discovered a valuable statue on Shara'Tam and giving the moon's coordinates.\nOnce the holorecording ended, Jettster laughed uproariously, angering Jarl, who proclaimed that he intended to take the statue and earn a fortune. Jettster, however, claimed that the given coordinates placed Shara'Tam in the Ishram system, destroyed fifty years prior. Although he was lying, Jarl neglected to check the coordinates himself, so when he had the Togruta look it up in his datapad, it confirmed Jettster's claims. Looking murderously at Servit, Jarl gathered his crew and left, leaving Servit and Jettster alone. The Mirialan thanked his friend and apologized that he did not have the credits for the damage caused to the diner. However, Jettster then revealed that he had tricked Jarl and that Shara'Tam was actually located in the still-existing Arath system, meaning that he could still acquire the treasure. Servit laughed in disbelief and, realizing that the stew had been strewn all over the place, asked if a dewback burger was available. Jettster laughed in return and instead thrust a mop into Servit's hands so that he could help Wanda clean up.\nAlthough Servit was frightened of Jarl, he stood his ground and refused to give up his droid. He felt sorry for Jettster when he led Jarl and his crew to the diner, and he later laughed in astonishment when he learned that the treasure had not been destroyed.\nServit appeared as the main protagonist in \"Galactic Tales: Inheritance,\" an installment of the Galactic Tales series of short stories. The story was written by George Mann and was published in the Star Wars Insider magazine's 211th issue on June 7, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/Servit",
  "/wiki/Mirialan",
  "/wiki/Gender",
  "/wiki/EX_droid",
  "/wiki/Republic_Era",
  "/wiki/Droid",
  "/wiki/Jarl",
  "/wiki/Weequay",
  "/wiki/Dexter_Jettster",
  "/wiki/Dex%27s_Diner",
  "/wiki/Prospector",
  "/wiki/Jarl%27s_crew",
  "/wiki/Restaurant",
  "/wiki/Blaster",
  "/wiki/Holorecorder",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Galactic_Republic",
  "/wiki/Servit%27s_ancestor",
  "/wiki/Servit%27s_mother",
  "/wiki/WA-7_waitress_droid",
  "/wiki/FLO",
  "/wiki/Twi%27lek",
  "/wiki/Brakkenback_stew",
  "/wiki/Republic_Pathfinder",
  "/wiki/Hyperspace_Rush",
  "/wiki/Parent",
  "/wiki/Death",
  "/wiki/Pirate",
  "/wiki/Raid_on_Shara%27Tam",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Shara%27Tam",
  "/wiki/Jedi",
  "/wiki/Sturm_Umbrik",
  "/wiki/Standard_day",
  "/wiki/Standard_century",
  "/wiki/Moon",
  "/wiki/Human",
  "/wiki/Unidentified_Togruta_(Jarl)",
  "/wiki/Protocol_droid",
  "/wiki/T7",
  "/wiki/Time",
  "/wiki/Stew",
  "/wiki/Frying_pan",
  "/wiki/Togruta",
  "/wiki/Lightfight",
  "/wiki/Unidentified_statue",
  "/wiki/Ishram_system",
  "/wiki/Standard_year",
  "/wiki/Datapad",
  "/wiki/Credit",
  "/wiki/Arath_system",
  "/wiki/Dewback_burger",
  "/wiki/Galactic_Tales:_Inheritance",
  "/wiki/Galactic_Tales",
  "/wiki/George_Mann",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/June_7",
  "/wiki/2022",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/StarWars.com",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Titan_Magazines"
 ]
}