{
 "name": "Sestin Blin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Guild of Compassionate Merchants",
      "Galactic Republic",
      "Prisoner rehabilitation program",
      "Prisoner rehabilitation program"
     ]
    }
   ]
  }
 ],
 "content": "Sestin Blin was a female Twi'lek who was imprisoned aboard the prison ship Restitution during the High Republic Era. After Nihil Tempest Runner Lourna Dee was imprisoned on the Restitution, Sestin bonded with her fellow Twi'lek over the bad taste of protein mash served to the inmates.\nSestin had a gambling problem, which led her to embezzle money from her former employer, the Guild of Compassionate Merchants. The Guild sent an enforcer to hunt Sestin, who killed her assailant and was sentenced to time in prison for that.\nSestin reminded Lourna Dee of an unidentified human slave who once saved Dee's life.\nSestin had two children, her sons Silus and Ita, whom she wished to see after her release from prison.\nSestin was compassionate and believed it her responsibility to look after \"Sal Krost,\" the alias of Lourna Dee. Unlike other prisoners, Dee was willing to challenge Ola Hest, and Sestin attempted to ease tensions between the Twi'lek and the Ottegan. Sestin enjoyed excursions to work on planets outside of the Restitution as it gave her an opportunity to experience nature and breathe fresh air.\nSestin was skilled with a blaster she wielded against an enforcer sent to hunt her down after she embezzled money from the Guild of Compassionate Merchants.\nSestin was voiced by Tara Sands in the 2021 audio drama The High Republic: Tempest Runner, written by Cavan Scott. In the audio drama, Sestin was given a surname that sounds like \"Blinn.\" However, until a script edition of the audio drama is released, it is not possible to verify her last name's spelling.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Guild_of_Compassionate_Merchants",
  "/wiki/Galactic_Republic",
  "/wiki/Prisoner_rehabilitation_program",
  "/wiki/Prison_ship",
  "/wiki/Lourna_Dee_(prison_ship)",
  "/wiki/High_Republic_Era",
  "/wiki/Nihil",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Protein_mash",
  "/wiki/Gambling",
  "/wiki/Currency",
  "/wiki/Bounty_hunter",
  "/wiki/Death",
  "/wiki/Unidentified_human_slave_(Lourna_Dee)",
  "/wiki/Attack_on_the_Zygerrian_slave_camp",
  "/wiki/Youngling",
  "/wiki/Silus",
  "/wiki/Ita",
  "/wiki/Ola_Hest",
  "/wiki/Ottegan",
  "/wiki/Blaster",
  "/wiki/Tara_Sands",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Cavan_Scott",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/StarWars.com"
 ]
}