{
 "name": "Set Harth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White/silver"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Milky white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Order of the Sith Lords"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Aru-Wen",
      "Obba",
      "Darth Zannah"
     ]
    }
   ]
  }
 ],
 "content": "Set Harth was a male Human Dark Jedi active during the decades following the Ruusan Reformations of the Galactic Republic. Formerly a Padawan of the Jedi Order, his Master Aru-Wen was slain during the waning days of the Ruusan campaign in the New Sith Wars. After Aru-Wen's death during the final battle of the war on Ruusan, Harth was trained by Master Obba of the Council of First Knowledge. Obba's obsession in the research of Sith artifacts led to Harth's fascination with the Sith, and Harth fell to the dark side of the Force. Harth then abandoned the Order and moved to Nal Hutta, where he set up a mansion, as well as on other planets under his many disguises, to store all the dark side artifacts he could find.\nIn 980 BBY, Harth recovered several artifacts that had been excavated on Doan. However, he was tracked down and bested by Sith Lord Darth Zannah, who forced him to become her would-be Sith apprentice while she hunted down her Master, Darth Bane.\nTogether, Harth and Zannah found out that Bane had been captured and taken to the Stone Prison in Doan. Zannah went inside to confront her master, leaving Harth to guard their ship. However, Harth entered the prison and found the holocron of Darth Andeddu, which had been taken from Bane following the Dark Lord's capture. Harth then fled the prison, but not before briefly encountering his replacement, Darth Cognus, and began studying the method of transfer essence under the holocron's gatekeeper. Combining this power with clone bodies, Harth was able to live at least until the Yuuzhan Vong War.\nA Force-sensitive Human, Set Harth was inducted into the Jedi Order, training in the ways of the Force under the tutelage of Jedi Master Aru-Wen at the Coruscant Jedi Temple. When the Temple battlemaster, Jedi Lord Hoth, raised the Army of Light from among the holdings of the Jedi Lords spread across the galaxy, Harth's master departed Coruscant to join in the fighting. Harth joined him briefly, succumbing to his anger while battling a warrior of Lord Kaan's Brotherhood of Darkness. Due to Harth's violent tendencies, Aru-Wen ordered his Padawan to return to the Coruscant Temple while he traveled to Ruusan to join the Army of Light for the final showdown with Kaan. During the Seventh Battle of Ruusan, Kaan used a thought bomb on the Army of Light, killing exactly 100 members of it who were selected to go down with Lord Hoth, including Aru-Wen.\nFollowing his Master's death on Ruusan, Harth came under the tutelage of Master Obba. Working with the Ithorian Jedi, Harth began working with the Council of First Knowledge in their endeavors to locate and confiscate all Sith artifacts scattered across the galaxy. As he was assigned more and more tasks, Harth began to horde the artifacts he found, until eventually he had enough money to leave the Order and learn the ways of the dark side.\nHarth heard rumors of a Sith artifact that had survived the catastrophe on Ruusan. He tracked the artifact to an abandoned Sith armory on the Ruusan battlefields, where he battled a dark side warrior for possession of the artifact. Harth defeated the warrior and gained possession of the artifact, which further corrupted him. Harth set up a mansion on Nal Hutta and began searching for other Sith artifacts.\nOne of Harth's searches led him to the palace of a Hutt slaver, where he encountered another Dark Jedi, Bal Serinus. The two dueled each other to exhaustion. Before the two dark siders could finish their duel, they were both caught by the Hutt slaver. While they were imprisoned in separate cells, Harth and Serinus communicated through the Force. Harth promised himself to protect Serinus from harm until she suddenly rebuffed his telepathic contact, in light of which Harth took a vow of vengeance.\nIn 980 BBY, Harth traveled to the planet Doan to recover several recently excavated Sith artifacts. He forced a Rodian bartender, Quano, to take him to the miner who had dug up the artifacts, Draado. As Draado attempted to rally the miners to go to war with the Doan Royal House in retaliation of the recent assassination of their leader, Gelba, Harth ambushed them. The other miners were quickly killed, but Draado survived for a short time due to the help of the artifacts he wore. However, Harth managed to Force choke the miner and kill him before taking the artifacts from him and returning to Nal Hutta.\nAfter Harth returned home, Darth Zannah, the apprentice of Darth Bane, tracked Harth to Nal Hutta and, after a brief duel in Harth's estate, offered him the opportunity to become her own apprentice. Harth realized that if he refused, she would kill him, and accepted. The two traveled to Bane's home on Ciutric IV, where Zannah and Bane had been living, only to discover that Bane had been captured by the Royal Guard of the Doan Royal House. Unbeknownst to Zannah and Harth, Princess Serra of Doan, who had ordered the attack, was actually Caleb's daughter. She sought revenge on Bane, whom she mistakenly believed had killed her father.\nZannah and Harth returned to Doan to rescue Bane from the Stone Prison, but he escaped from his cell with the help of Serra's bodyguard Lucia, who had fought under Bane as a member of the Gloom Walkers. Zannah ordered Harth to watch her vessel, the Victory, before entering the prison, where she located Bane and challenged him to a duel, hoping to defeat him and become the next Dark Lord of the Sith.\nHowever, Harth disobeyed Zannah and entered the prison, where he found and stole the Holocron of Heresies, which had been taken from Bane after Bane's capture. As Harth fled, he decided to steal a starship, the Stalker. However, before he could escape, the starship's owner, the Huntress—the Iktotchi assassin who had captured Bane—arrived and challenged him. After a fight in the hangar in which the Huntress was able to gain the upper hand, but before she could kill him, Serra— who was hoping to kill the two dueling Sith Lords—set the Prison to self destruct. Harth then disabled two of the four ships in the hangar with his lightsaber and proposed to the Huntress that either they both should go free in their own ships or he would destroy both ships and they would be killed in the collapsing prison together. The Huntress accepted, allowing him to flee in his starship, taking the holocron with him.Soon after he began lessons from the holocrons gatekeeper on the dark side of the force, and the technique of essence transfer.\nFearing Zannah would find him on Nal Hutta if she survived the Stone Prison's destruction, Harth knew better than to go back to his usual location. Since he had other bases under false identities, there was no need for him to run aimlessly across the galaxy. Having sole possession of Darth Andeddu's holocron, Harth was free to access the device and ply its storage banks for hidden knowledge. Pledging himself to the gatekeeper of the holocron, Harth agreed to train under Andeddu in order to eventually earn the ability to transfer his consciousness into other bodies.\nAfter sometime, Harth conquered the ability and eventually contacted cloning specialists who were able to reproduce his original body. For over one thousand years, Harth continued to clone his original body over and over, usually discarding his clone bodies at age 30. Over the centuries, Harth gathered many collections of Sith artifacts scattered in caches across the galaxy, as well as numerous starships and vast resources. Harth became a legendary explorer, his continued existence suspected by but unproven to the Jedi High Council as he continued to scour the galaxy for dark side artifacts.\nBecause of Harth's desertion from the Sith Order, Zannah realized that taking him in as an apprentice had been a mistake. However, after she defeated Bane on Ambria, Zannah took on a more willing apprentice: the Huntress, who had taken the name of Darth Cognus before Zannah became the Dark Lord.\nWhile in Harth's possession for some time, Andeddu's holocron was discovered on Korriban in 21 BBY by Sith Lord Darth Tyranus. It is unknown how he was parted from this relic, but it could not have been due to his final death as Harth was known to have lived past the Clone Wars.\nDuring the war with the Brotherhood of Darkness, the Jedi High Council's strict recruiting policies were loosened, allowing less than ideal candidates to receive training. Set Harth was one of these exceptions and, though Harth was allowed into the Jedi Order his master, Aru-Wen, felt that his violent tendencies indicated a dangerous path and left him on Coruscant.\nHarth continued to take these paths because of his arrogance and allegiance to himself. Even when faced with a situation as dangerous as Darth Zannah and the legacy of the Sith, he pulled off a betrayal that made him a legend.\nSet Harth had considerable skill with telekinesis, throwing objects directly at his opponents to dislodge them. When he fell to the dark side, he learned to utilize Force Choke on his enemies, as well as Force Grip and Force drain. He was also talented in telepathy, Battlemind, Force sight, and the mind trick, which he perfected into Force fear as a Dark Jedi. Before turning his back on Darth Zannah, he realized his full potential when he could expand his awareness, due to some early part of his training under Obba. He later learned how to transfer his essence into other beings, which he used to extend his life indefinitely and thus lived for more than a millennium after he acquired this power. This extended to his knowledge of Sith magic.\nHarth was a practitioner of his own stylized version of Ataru, which he displayed in his duel with Darth Zannah. However, the form had exhausted him greatly, giving Zannah an advantage to defeat him. He was also quite proficient with throwing his lightsaber, a move that nearly killed Zannah in their first confrontation and also the Huntress on Doan; both women only survived due to their precognitive abilities. Harth was spared by Zannah for his skill and because of her desperate need of an apprentice.\nDuring his life as a Dark Jedi, while carrying a lightsaber, Harth also equipped himself with two blasters to hide his affinity to the Force: a GSI-24D disruptor pistol and a conventional blaster. He was quite skilled with the blasters, easily taking down many miners in his skirmish with them on Doan.\nSet Harth appeared in Darth Bane: Dynasty of Evil, the final novel in the Darth Bane Trilogy, written by Drew Karpyshyn.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Aru-Wen",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obba",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Ruusan_Reformation",
  "/wiki/Padawan/Legends",
  "/wiki/Ruusan_campaign",
  "/wiki/New_Sith_Wars",
  "/wiki/Death/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Ruusan/Legends",
  "/wiki/Council_of_First_Knowledge/Legends",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Set_Harth%27s_mansion",
  "/wiki/Planet/Legends",
  "/wiki/Dark_side_artifact",
  "/wiki/980_BBY",
  "/wiki/Mining/Legends",
  "/wiki/Doan",
  "/wiki/Mission_to_Doan",
  "/wiki/Duel_in_Set_Harth%27s_mansion",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Skirmish_in_Darth_Bane%27s_mansion",
  "/wiki/Stone_Prison",
  "/wiki/Duel_on_Doan",
  "/wiki/Prison/Legends",
  "/wiki/Holocron_of_Heresies",
  "/wiki/Darth_Andeddu",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Cognus",
  "/wiki/Transfer_essence",
  "/wiki/Gatekeeper",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Battlemaster",
  "/wiki/Jedi_Lord",
  "/wiki/Hoth_(Jedi_Lord)",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Skere_Kaan",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Thought_bomb",
  "/wiki/Ithorian/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Bal_Serinus",
  "/wiki/Telepathy/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Bartender/Legends",
  "/wiki/Quano",
  "/wiki/Draado",
  "/wiki/Doan_Royal_House",
  "/wiki/Massacre_on_Doan",
  "/wiki/Gelba",
  "/wiki/Telekinesis/Legends#Choking_powers",
  "/wiki/Darth_Bane%27s_mansion",
  "/wiki/Ciutric_IV",
  "/wiki/Doan_Royal_Guard",
  "/wiki/Prince/Legends",
  "/wiki/Serra",
  "/wiki/Caleb",
  "/wiki/Confrontation_on_Ambria",
  "/wiki/Lucia_(soldier)",
  "/wiki/Gloom_Walkers",
  "/wiki/Victory_(Theta-class_T-1_vessel)",
  "/wiki/Stalker_(shuttle)",
  "/wiki/Iktotchi/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Skirmish_in_the_Stone_Prison_hangar",
  "/wiki/Hangar/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Second_Duel_on_Ambria",
  "/wiki/Ambria/Legends",
  "/wiki/Korriban",
  "/wiki/21_BBY/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_drain/Legends",
  "/wiki/Battlemind",
  "/wiki/Force_sight",
  "/wiki/Mind_trick/Legends",
  "/wiki/Sith_magic",
  "/wiki/Form_IV/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/GSI-24D_disruptor_pistol",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Star_Wars:_Darth_Bane_Trilogy",
  "/wiki/Drew_Karpyshyn",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)",
  "/wiki/Star_Wars_Roleplaying_Game_Core_Rulebook",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/Ultimate_Adversaries",
  "/wiki/Star_Wars_Roleplaying_Game_Revised_Core_Rulebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Republic_63"
 ]
}