{
 "name": "Sev  (Jedi)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "aboard a Venator-class Star Destroyer over Ragmar V"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Joc Sah"
     ]
    }
   ]
  }
 ],
 "content": "Sev was a Weequay male Jedi Master who served as a general during the Clone Wars. During the war, he trained the Human Joc Sah as his Padawan. In the war's final year, Sev and Sah were sent to the Outer Rim planet Ragmar V, which was considered an essential staging world for the Republic's planned attack on a Separatist base. Sev remained aboard a Venator-class Star Destroyer and sent Sah on his first solo mission to secure an outpost on the surface. Shortly thereafter, the clone troopers under Sev's command were ordered by Supreme Chancellor Palpatine to execute Order 66, a directive branding the Jedi Knights traitors to the Republic. Sev defended himself briefly, but was eventually slain by the clones.\nSev, a Weequay male, was born during the final decades of the Galactic Republic. He was trained in the ways of the Force by the Jedi Order and eventually ascended to the rank of Jedi Master. During this time, he took the Human Joc Sah as his Padawan. When the Clone Wars began in 22 BBY, Sev served as a Jedi General in the Grand Army of the Republic. In 19 BBY, the final year of the war, Sev and Sah were dispatched to Ragmar V, a planet in the Outer Rim, which was viewed as a vital staging world for a planned Republic assault on a Separatist base. Sev stayed aboard a Venator-class Star Destroyer and sent Sah, accompanied by Clone Sergeant Remy and a clone trooper squad, on his first solo mission to the surface of the planet.\nAs Sah and his troops entered the atmosphere, Sev ordered him to secure an outpost and warned his Padawan to remain on his guard. Shortly thereafter, the ARC trooper accompanying Sev received a directive from Supreme Chancellor Palpatine commanding him to execute Order 66, which labeled the Jedi Knights traitors to the Republic. Sev was attacked by the clones under his command but defeated many of them before being overwhelmed and killed. After the Jedi Master's death, the ARC trooper sent a detachment of clones to eliminate Sah, who defeated his clone squad.\nThe Weequay Sev wore brown Jedi robes and used a lightsaber containing a green crystal. He cautioned Joc Sah, his Padawan learner, to remain on guard during the mission to Ragmar V, warning him that a seemingly minor fight could erupt into a large battle. As a Weequay, Sev had dark skin, black eyes and brown hair.\nSev was powerful enough to achieve the rank of Jedi Master. He was also skilled in using his lightsaber during combat, eliminating multiple clone troopers before he was overwhelmed and slain.\nSev was introduced in the short story The Order of Outcasts, which was one of four stories compiled in the fifth volume of the Star Wars: Clone Wars Adventures trade paperbacks. The character was created by Matt Jacobs and drawn by Matthew and Shawn Fillbach. Sev was mentioned in both Remy's and Joc Sah's entries in The Complete Star Wars Encyclopedia.\nIn 2008, Hasbro created an action figure of both Sev and the ARC trooper under his command as part of the second wave of the Order 66 release of the Star Wars: 30th Anniversary Collection toy line. Sev's figure comes with a green lightsaber.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sev_(disambiguation)",
  "/wiki/19_BBY/Legends",
  "/wiki/Sev%27s_Venator-class_Star_Destroyer",
  "/wiki/Ragmar_V",
  "/wiki/Weequay/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Joc_Sah",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Human/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Death/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Time/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Remy_(clone_trooper)",
  "/wiki/Squad/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Sev%27s_ARC_trooper",
  "/wiki/Trooper/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/The_Order_of_Outcasts",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_5",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Matt_Jacobs",
  "/wiki/Matthew_Fillbach",
  "/wiki/Shawn_Fillbach",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}