{
 "name": "Seventh_Guard",
 "display_name": "Seventh Guard",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Supremacy",
      "Crait system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "Elite Praetorian Guard",
      "Elite Praetorian Guard"
     ]
    }
   ]
  }
 ],
 "content": "The Seventh Guard was an Elite Praetorian Guard who served as the personal guard of Supreme Leader Snoke, leader of the First Order. The guard wielded vibro-arbir blades. The Seventh Guard met their demise on board the Supremacy when Kylo Ren, Snoke's apprentice, betrayed him with the help of Rey, another Force-sensitive individual. Together they defeated and killed all of the Elite Praetorian Guards in the throne room.\nThe Seventh Guard was a member of the Elite Praetorian Guard—crimson warriors who served as the personal bodyguards of Supreme Leader Snoke of the First Order. The Seventh Guard was stationed in Snoke's throne room along with the other Praetorian Guards at the time of Kylo Ren's audience with the Supreme Leader in 34 ABY. Angered by Snoke's disapproving appraisal of his defeat on Starkiller Base, the Master of the Knights of Ren took a step in his master's direction, causing the Seventh Guard to snap into a combat stance against the dark apprentice as his fellows.\nThe Seventh Guard was still present in the throne room when Ren returned with the Jedi learner Rey as his prisoner. However, instead of executing the former scavenger as Snoke ordered, Ren chose to assassinate his master—resulting in a confrontation between the two Force-sensitives and the Praetorian Guards. Like the other Praetorians, the Seventh Guard attempted to avenge the slain Supreme Leader, engaging the traitorous apprentice and Rey. After the death of the Third Guard at the hands of Rey, the Seventh Guard engaged the Padawan into fight him with his vibro-arbir blades immediately after she send flying the Third Guard's Bilari electro-chain whip towards the room's curtain behind the Seventh Guard, setting it on fire.\nSeparating his weapon in two, the Seventh Guard proved to be a fitting opponent to Rey, even injuring her with one of his blades in her right arm. Overpowering the Jedi, the Seventh Guard kicked her into the stomach to the floor and then subdued her at the edge of the suspended platform, grabbing her from the armlock, but Rey outsmarted him by letting go her lightsaber and then grabbing it, cutting the Seventh Guard's right leg and then striking it on his neck, causing the Seventh Guard to fall off the platform to an assured demise. The last Praetorian was killed soon after.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/34_ABY",
  "/wiki/Supremacy",
  "/wiki/Crait_system",
  "/wiki/Human",
  "/wiki/First_Order",
  "/wiki/Elite_Praetorian_Guard",
  "/wiki/Bodyguard",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Vibro-arbir_blade",
  "/wiki/Death",
  "/wiki/Ben_Solo",
  "/wiki/Rey_Skywalker",
  "/wiki/Force-sensitive",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Snoke%27s_throne_room",
  "/wiki/Color",
  "/wiki/Soldier",
  "/wiki/Time",
  "/wiki/Gender",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Starkiller_Base",
  "/wiki/Master_of_the_Knights_of_Ren",
  "/wiki/Knights_of_Ren",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Throne",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Prisoner",
  "/wiki/Scavenger",
  "/wiki/Assassin",
  "/wiki/Third_Guard",
  "/wiki/Bilari_electro-chain_whip",
  "/wiki/Fire",
  "/wiki/Limb",
  "/wiki/Stomach",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Adaptation_5",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Last_Jedi_Activity_Book_with_Stickers",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Databank_A-Z",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded"
 ]
}