{
 "name": "Sevox",
 "display_name": "Sevox",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Vision provided by connection to droid"
     ]
    }
   ]
  }
 ],
 "content": "Sevox was a male human who lived on Andelm IV during the Galactic Civil War. His body rejected implants, so after he lost his eyes, he spliced into his protocol droid, I-7, as a means of vision. Sevox was friends with Zarro, a human girl, who ran errands for him. Following the Battle of Yavin, he reluctantly allowed Zarro and her Wookiee friend Chewbacca to make use of material from his bunker to rebuild an R5 astromech droid named \"Boomer\". Fitted with explosives, Boomer was used to sabotage the crime lord Jaum's plan to sell dedlanite to the Galactic Empire.\nSevox was an elderly human man who lived on the planet Andelm IV during the Age of the Empire. At some point, he lost both his eyes. Since his body rejected ocular implants, he found a way to splice into his protocol droid, I-7, who became his \"eyes\" through a visor and cabling. Fearing the Galactic Empire and the rebellion, Sevox and his droid hid in an underground bunker near the Andelm IV spaceport. His bunker also contained a store room full of old droid parts. Around the time of the Battle of Yavin, Sevox was acquainted with a young girl named Zarro, who ran errands for him.\nAfter escaping Jaum's beetle caverns, Zarro and her new Wookiee ally Chewbacca visited his bunker, seeking parts they could use to sabotage Jaum's plan to sell dedlanite to the Empire. Sevox was annoyed because he feared that Zarro's presence could expose his work. He was further alarmed when Chewbacca entered the room. Sevox reluctantly allowed Zarro and Chewbacca to access his store room for gear and to share his food. The reclusive Sevox feared that Chewbacca's presence would expose his bunker's existence to outsiders and regarded Zarro's decision to bring Chewie as a violation of trust.\nDespite his misgivings about Zarro and Chewie's enterprise, Sevox and his droid I-7 accompanied them to the local spaceport. He allowed Zarro to drive his landspeeder. During the journey, Sevox received news from his friend Lageose that an Imperial Star Destroyer had entered the Andelm system. Lageose advised Sevox to leave Andelm IV. While Sevox was pessimistic, I-7 suggested that the Empire could bring optic implants that his master's body would not reject; setting him free. Overhearing the conversation, Zarro told Sevox to stop worrying because she and Chewie had a plan.\nIn response, Sevox derived Chewbacca's plan to blow up Jaum's dedlanite supplies as an \"insult\" to plane scored the Galaxy. Zarro insisted her plan would work while Chewie roared in annoyance, having just planted a thermal detonator inside the droid's chassis. As the approached the city, Sevox urged Zarro to slow down. After arriving at the spaceport, Sevox told Zarro of his plans to move out of his lab. He offered the lab to Zarro and Chewie as a hiding place but warned them not to mention his name if he was captured by the Empire. Sevox then joked that if they did mention his name, they should tell the Empire that he was being enslaved by his protocol droid.\nBefore parting company with Zarro and Chewie, Sevox told the former that he had left some credits behind in his lab if she brought back the optics of an Imperial RA-7 protocol droid, which he regarded as magnificent. Before I-7 drove the landspeeder away, he told Zarro not to let the Imperials think that she was part of the Rebellion. Sevox and I-7 then departed into hiding.\nSevox was an elderly human man with white hair and light skin. After he lost both of his eyes, his body rejected several optical implants; he then used his skills with droid repair to splice into the optics of his protocol droid, I-7. Sevox resented his dependence on the droid and both jokingly accused each other of slavery. He wore green overalls and had a visor over his eyes that was connected to I-7 with a cable.\nSevox was reclusive and feared both the Galactic Empire and the Rebellion. He lived in a bunker that doubled as his laboratory. While Sevox had a good relationship with Zarro, he was upset when she brought a stranger named Chewbacca into his domain. Although he agreed to lend them his landspeeder, he believed that Chewie's plan had a poor chance of success and fled into hiding with I-7.\nSevox first appeared as a minor supporting character in the third issue of Gerry Duggan's 2015 Marvel Comics story Star Wars: Chewbacca. He was illustrated by Phil Noto.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Droid",
  "/wiki/Chewbacca",
  "/wiki/Andelm_IV",
  "/wiki/Galactic_Civil_War",
  "/wiki/Eye",
  "/wiki/Slicer",
  "/wiki/Protocol_droid",
  "/wiki/I-7",
  "/wiki/Zarro",
  "/wiki/Battle_of_Yavin",
  "/wiki/Wookiee",
  "/wiki/R5_series_astromech_droid",
  "/wiki/Astromech_droid",
  "/wiki/Boomer_(astromech_droid)",
  "/wiki/Jaum",
  "/wiki/Dedlanite",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Andelm_IV_spaceport",
  "/wiki/Andelm_beetle_caverns",
  "/wiki/Spaceport",
  "/wiki/Landspeeder",
  "/wiki/Lageose",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Thermal_detonator",
  "/wiki/Unidentified_Andelm_IV_city",
  "/wiki/Slavery",
  "/wiki/Credit",
  "/wiki/RA-7_protocol_droid",
  "/wiki/Chewbacca_(2015)_3",
  "/wiki/Gerry_Duggan",
  "/wiki/2015",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_Chewbacca_(Marvel)",
  "/wiki/Phil_Noto",
  "/wiki/Chewbacca_(2015)_4"
 ]
}