{
 "name": "Sevv Sunb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.4 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Vurrha's Blood",
      "Vurrha Chur",
      "Vurrha Chur"
     ]
    }
   ]
  }
 ],
 "content": "Sevv Sunb was a Sullustan accountant. He started his career managing the finances of a group entertainers. Sunb helped them expand into the smuggling business, to earn the band more money. However, they were caught in the act and their ship was impounded. This made Sunb find a new employer. He ended up working for Vurrha Chur as the accountant in his gang, Vurrha's Blood.\nA male Sullustan, Sevv Snub first began his career under a traveling band of entertainers as their accountant and financier. With Sevv under their wing, the band met with good success, eventually bolstering enough to include smuggling in their line of work. However, their prosperity was short lived. While traveling on a spice delivery mission, the band's ship was captured.\nSoon after this event, Sevv found new work in the hands of a criminal organization known as Vurrha's Blood, led by Vurrha Chur. Over time, the Sullustan proved his worth as a bookkeepers position, providing much success for the gang.\nSnub was 1.4 meters tall, and was considered short for his species. He had black eyes and was considered to be overweight by many. Known to be skittish, he was regarded as having a high-pitched voice and a nervous laugh. Nevertheless, he proved his skill at his occupation.\nSevv Snub was deemed to be a good-shot, although he disliked fighting, and would almost always try to avoid it if possible.\nSnub chose to wear large jackets, and was particularly fond of gaudy colors. As he disfavored fighting, he chose to only carry a blaster pistol, concealing it with his large jacket on his hip.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Vurrha%27s_Blood",
  "/wiki/Vurrha_Chur",
  "/wiki/Smuggler/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Species/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Ultimate_Adversaries"
 ]
}