{
 "name": "Sha'a Gi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Biniir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Hypori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.85 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Daakman Barrek"
     ]
    }
   ]
  }
 ],
 "content": "Sha'a Gi was a Human male from the planet Ord Biniir. As a child, his Force-sensitivity was discovered by Jedi Master Daakman Barrek. Taking Gi as his Padawan, Barrek accompanied him to Coruscant so that the youth could begin his training as a Jedi. During his training, Gi was less than proficient in the martial skills of the Order but excelled in computer system operation. As a result, he aspired to work in the Jedi Archives after passing his Jedi Trials. Gi and his Master formed an effective partnership, gathering intelligence and disrupting pirate activity throughout the Outer Rim Territories.\nWhen the Clone Wars broke out in 22 BBY, Gi and Barrek continued their intelligence-gathering operations and discovered a Confederacy of Independent Systems droid factory in operation on the planet Hypori. Barrek called in a Republic task force to destroy the factory, but the reinforcements were ravaged by orbital mines, and the entire force crashed onto the surface of the planet. Gi and Barrek regrouped with several Jedi survivors. Surrounded by droid forces, Barrek was killed by the leader of the Droid Army, a cyborg called General Grievous. As the remaining Jedi took cover in the wreck of a downed Acclamator-class assault ship and waited for Grievous to engage them in battle, Gi—overcome by fear and the loss of his Master—panicked and rushed out into the open, where he was killed by Grievous.\nSha'a Gi, a Force-sensitive Human male, was born on Ord Biniir, a planet in the Relgim sector of the Outer Rim Territories. As a child, his connection with the Force was discovered by Jedi Master Daakman Barrek. Taking the youth as his Padawan, Barrek escorted him to the Jedi Temple on the galactic capital of Coruscant so that Gi could be trained as a Jedi.\nDuring his training, it was evident that Gi's combat-related skills were not on par with those of his contemporaries, but he did display remarkable aptitude with computer systems. As a result, Gi hoped to take up a position in the Jedi Archives once he had completed his Jedi Trials. Gi struggled with maintaining the mental discipline required for members of the Jedi Order, and had trouble controlling his fear on occasions where he was required to work independently. The presence of his Master often acted as a stabilizing influence, however, and the pair formed an effective team. Gi and Barrek were often deployed to the Outer Rim Territories to gather intelligence on pirate activity and then counter the threat that it posed.\nIn 22 BBY, the Clone Wars erupted across the galaxy as the Confederacy of Independent Systems took up arms against the ruling Galactic Republic. Gi and Barrek were on a mission disrupting pirate activity in the Outer Rim when word came through that Barrek's first Padawan had been killed during the Battle of Geonosis. Barrek accepted the rank of General within the Grand Army of the Republic and dedicated himself to the war effort. As his Padawan, Gi followed his Master's lead.\nGi and Barrek continued their intelligence-gathering operations in the Outer Rim Territories, and, shortly after the outbreak of the war, the pair discovered a droid foundry operated by the Confederacy on the planet Hypori in the Ferra sector. Gi and Barrek reported their discovery, and the Jedi High Council dispatched a force of Jedi and clone troopers to the planet. The arrival of the task force was countered by the Confederacy, which used orbital mines to destroy all of the incoming transport craft, causing them to crash behind enemy lines. Most of the clone troopers were killed during the crash landings, and the survivors were cut down by droid weapons fire. Gi and Barrek rendezvoused with the Jedi assigned to the mission—Masters Ki-Adi-Mundi, Shaak Ti, and K'Kruhk, and Knights Aayla Secura and Tarr Seirr. The Jedi took refuge in the wreck of an Acclamator-class assault ship and were surrounded by droid forces under the command of the cyborg General Grievous, the Supreme Commander of the Confederacy's Droid Army.\nDuring the fierce fighting, Master Barrek managed to contact Master Obi-Wan Kenobi, who had recently taken the planet Muunilinst for the Republic. Barrek informed his fellow General of the situation on Hypori before he was killed by Grievous. Without Master Barrek's presence, Gi began to lose his nerve as his self-doubt and fear started to overcome him. From inside the wreck, the Jedi were able to hear Grievous approaching, and Gi was visibly unnerved by the sound and the fact that they were unable to see the cyborg general. As the assembled Jedi waited for Grievous to assault them, Gi panicked and rushed out of the wreckage into the open. Grievous appeared from above Gi, landing on the young Padawan. Grievous' talons speared the young Jedi, and he was crushed to death by the general's weight. Grievous went on to battle the assembled Jedi, killing Tarr Seirr and wounding the others. The survivors were eventually rescued by the Muunilinst 10, an elite squad of ARC troopers that had been dispatched from Muunilinst.\nSha'a Gi was a Human male with brown-colored hair, black eyes and light-colored skin. He stood at 1.85 meters tall. Awkward and full of self-doubt, Gi found that maintaining the mental discipline required by Jedi was hard for him. He had difficulty controlling his fear, especially when working independently. Nevertheless, Master Barrek's presence was enough to calm the young man, and the pair worked effectively together. When Barrek was killed by General Grievous on Hypori, Gi allowed his fear to overwhelm him, which led to his death at the cyborg General's hands.\nSha'a Gi was a young Padawan being trained to Knighthood. He was trained to use a lightsaber, despite having less proficiency in the martial skills and combat arts than other Padawans at his level.\nSha'a Gi wielded a green-bladed lightsaber and wore Jedi robes. As a Padawan, Gi still wore the traditional braid in his hair.\nIn the audio commentary included on the Star Wars: Clone Wars Volume One DVD, director Genndy Tartakovsky states that the Human Jedi featured in Chapter 20 was inspired by the character Shaggy Rogers from the Scooby-Doo cartoons. This resulted in a similar appearance to that character. Initially, Tartakovsy wanted the Jedi to have more of a high-pitched voice like Shaggy. However, Tartakovsky realized that the voice didn't fit and became \"too goofy.\" The character was listed simply as \"Padawan\" in the end credits of the Clone Wars Volume One DVD, but soon received the name \"Sha'a Gi\" when StarWars.com added the character to its Databank. Sha'a Gi was voiced in his single appearance in the Clone Wars cartoon by John DiMaggio.\nGi made an appearance as a \"hero unit\" defending Hypori for the Galactic Republic in the turn-based strategy game Star Wars: Battle for the Republic released by THQ Wireless for cell phones in November 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Ord_Biniir/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Hypori/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Daakman_Barrek",
  "/wiki/File:Sha%27aGi-CW20.ogg",
  "/wiki/Planet/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Hypori_droid_factory",
  "/wiki/Task_force/Legends",
  "/wiki/Battle_of_Hypori/Legends",
  "/wiki/Space_mine",
  "/wiki/Droid/Legends",
  "/wiki/Death/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/Relgim_sector/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Daakman_Barrek%27s_first_Padawan",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Ferra_sector/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/K%27Kruhk",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Tarr_Seirr",
  "/wiki/Supreme_Commander_of_the_Droid_Armies",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Battle_of_Muunilinst/Legends",
  "/wiki/Muunilinst/Legends",
  "/wiki/The_Muunilinst_10",
  "/wiki/Squad/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Padawan_braid/Legends",
  "/wiki/Star_Wars:_Clone_Wars_Volume_One",
  "/wiki/Genndy_Tartakovsky",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/John_DiMaggio",
  "/wiki/Star_Wars:_Battle_for_the_Republic",
  "/wiki/THQ",
  "/wiki/November",
  "/wiki/2005",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Clone_Wars_Chapter_20",
  "/wiki/Category:Images_of_Sha%27a_Gi",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Official_Star_Wars_Fact_File_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_3_(2013)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Clone_Wars_Chapter_21",
  "/wiki/April_20",
  "/wiki/2020"
 ]
}