{
 "name": "Sha'Dria",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Bantha Traxx"
     ]
    }
   ]
  }
 ],
 "content": "Sha'Dria was a mysterious Human female bartender who worked for Yin Vocta at his nightclub, the Bantha Traxx, on Lianna. She always hid her face behind a mask that she called N'Noch, and would refer to everyone else as being one of \"The Unmasked.\"\nYin Vocta's two assassins, Haelon Tice and R'Kayza, protested hiring her, but Vocta was too intrigued to listen. She operated one of the three cooling stations called \"Oasis\" and she quickly became a big draw turning the Oasis into the most popular of the three. Tice once tried to become overly friendly with her and that resulted in him losing a hand.\nShe was secretly a Rebel deep cover agent who had been working at Bantha Traxx to uncover information about Yin's underworld empire. When she discovered enough to warrant extraction, she signaled a distress code.\nSha'Dria was a physically attractive woman who hid her face behind an intricately designed mask. She was a good listener and had good advice to dispense to her patrons. She was intriguing enough to capture the attention of Yin who hired her in hopes of unraveling her mystery.\nSha'Dria was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. She was illustrated by Brian Schomburg.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Bantha_Traxx",
  "/wiki/Yin_Vocta",
  "/wiki/Lianna/Legends",
  "/wiki/N%27Noch",
  "/wiki/Assassin/Legends",
  "/wiki/Haelon_Tice",
  "/wiki/R%27Kayza",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Brian_Schomburg"
 ]
}