{
 "name": "Sha_Dun",
 "display_name": "Sha Dun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Relentless"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darth Krayt's Galactic Empire",
      "Imperial Navy",
      "Outer Rim Third Fleet",
      "Imperial Navy",
      "Outer Rim Third Fleet",
      "Outer Rim Third Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Sha Dun was a Kel Dor male who held the rank of admiral in the Imperial Navy during the Second Imperial Civil War—the insurrection against the Sith-controlled Empire led by Emperor-in-exile Roan Fel. By 137 ABY, Galactic Emperor Darth Krayt had selected Dun to lead the Imperial Outer Rim Third Fleet, which was tasked with destroying the unified fragments of the Galactic Alliance military as well capturing the commander of the Alliance Core Fleet, Admiral Gar Stazi. Despite many minor victories, Dun failed to stop Stazi's attacks. Darth Azard, the Sith Lord who oversaw the fleet, executed Dun for his failure.\nA Kel Dor male, Admiral Sha Dun served in the Imperial Navy in the time of deposed Emperor-in-exile Roan Fel's insurgency against the Sith-controlled Empire. Galactic Emperor and Dark Lord of the Sith Darth Krayt placed Dun in charge of the Imperial Outer Rim Third Fleet, which was overseen by Quarren Sith Lord Darth Azard. In 137 ABY, the Outer Rim Third Fleet had been charged with capturing the fugitive commander of the Galactic Alliance Core Fleet, Admiral Gar Stazi, as well as destroying the unified fragments of the Alliance military, dubbed the Galactic Alliance Remnant.\nDespite many minor victories, Dun failed to stop Gar Stazi's attacks. On the command deck of the Pellaeon-class Star Destroyer Relentless, Lord Azard executed Dun for his failure, lifting and choking him with the Force, before cutting the admiral down with his double-bladed lightsaber.\nAzard replaced Dun with the Humanocentric Admiral Dru Valan, who had already faced Stazi during the Battle of Caamas, the last major battle between the new Galactic Empire and the Galactic Alliance in the Sith–Imperial War, seven years previously. Azard told Valan not to underestimate Stazi as Dun had, and warned the admiral not to fail him.\nAn able military commander, Sha Dun was selected by Darth Krayt to lead the Imperial Outer Rim Third Fleet against the skilled Admiral Gar Stazi. Although unable to defeat Stazi, Dun was able to score many minor victories and even captured and destroyed a number of Stazi's ships. Dun had white eyes.\nAs a Kel Dor, Dun was forced to wear an antiox breath mask to protect him from carbon dioxide, nitrogen, and oxygen, which were fatal to a member of his species.\nSha Dun made his first appearance in the twentieth issue of the Star Wars: Legacy comic series, Indomitable, Part 1, released in February 2008. The issue was written by John Ostrander and penciled by Omar Francia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/137_ABY",
  "/wiki/Relentless_(Pellaeon-class)",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Outer_Rim_Third_Fleet",
  "/wiki/Military_rank/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Sith/Legends",
  "/wiki/Empire-in-exile",
  "/wiki/Roan_Fel",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Fel_Empire",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Defense_Force",
  "/wiki/Commander/Legends",
  "/wiki/Galactic_Alliance_Core_Fleet",
  "/wiki/Gar_Stazi",
  "/wiki/Darth_Azard",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Time/Legends",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Pellaeon-class_Star_Destroyer",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Humanocentrism",
  "/wiki/Dru_Valan",
  "/wiki/Battle_of_Caamas",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Antiox_breath_mask",
  "/wiki/Carbon_dioxide/Legends",
  "/wiki/Nitrogen/Legends",
  "/wiki/Oxygen/Legends",
  "/wiki/Species/Legends",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_20",
  "/wiki/February",
  "/wiki/2008",
  "/wiki/John_Ostrander",
  "/wiki/Omar_Francia",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}