{
 "name": "Shaak_Ti",
 "display_name": "Shaak Ti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shili"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.87 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi assault team",
      "Jedi High Council",
      "Jedi assault team",
      "Galactic Republic",
      "Kamino garrison",
      "Kamino security",
      "Kamino garrison",
      "Kamino security"
     ]
    }
   ]
  }
 ],
 "content": "Shaak Ti  was a Force-sensitive Togruta female Jedi Master who served as one of the final members of the Jedi High Council before the Great Jedi Purge. Considered to be among the wisest in the Jedi Order, Ti was a skilled teacher and combatant and was a devoted believer in the ways of the Jedi. During the Clone Wars, a galaxy-wide conflict between the Galactic Republic and Confederacy of Independent Systems, Ti took part in the pivotal battles of Geonosis, Kamino, and Coruscant as a Jedi General in the Grand Army of the Republic.\nEarly in the Clone Wars, Ti was chosen by the Jedi Council to represent the Republic on Kamino, where she personally oversaw the training and development of clone forces on the planet. While in this role, she acted as a close mentor and protector to the clone army, additionally serving as the commanding officer of the garrison stationed on-world. Her compassion for the clones clashed with the Kaminoan's cold view of them as products, and for much of her time on Kamino, Ti had a strained relationship with the Kaminoan government. Late in the war, Ti became entangled in a conspiracy surrounding the origin of a mysterious inhibitor biochip implanted in every clone. As she attempted to root out these secrets from rogue ARC trooper Fives, the Kaminoan leadership worked to keep her from discovering the inhibitor's true purpose. Despite her efforts to the contrary, Ti was unable to help Fives as he suffered a mental collapse at the Kaminoan's hands, and his secrets died with him.\nAs the war dragged on, Ti and the Jedi Council became increasingly concerned about the mystery of the Dark Lord of the Sith, who they believed had engineered the war and played a role in the origin of the clone armies. Though they devoted much time to discovering their identity and motives, Ti and her fellow Jedi were unable to learn who the shadowy figure was. In the final days of the war, however, Supreme Chancellor Palpatine of the Republic revealed himself as the Sith Lord Darth Sidious and enacted the Great Jedi Purge to wipe out the Jedi once and for all, using the clones' inhibitor chips to turn the Republic's armies against the Order. Ti, who was stationed on the Republic capital Coruscant at the time, was slain at the hands of newly christened Sith Lord Darth Vader as he and his forces laid siege to the Jedi Temple.\nShaak Ti was born on the planet Shili, the homeworld of the Togruta species, in the galaxy's Expansion Region. Identified at a young age as a Force-sensitive individual, Ti was sent to join the Jedi Order on Coruscant, the capital of the Galactic Republic. Like all her fellow Jedi, Ti began as an initiate before becoming a Padawan, and eventually rose to become a Jedi Knight. Eventually, she was recognized as one of the most powerful members of the Order and was bestowed with the title of Jedi Master.\nBy the time of the Clone Wars, Ti was chosen to join the Jedi High Council, the ruling body of the Jedi Order. Ti was given the seat held by Master Yaddle, who had elected to step down from the council and take a less active role in Jedi affairs. Ti was one of two new members of the Council inducted between the Invasion of Naboo in 32 BBY and the Clone Wars in 22 BBY, along with Master Coleman Trebor, who had replaced Master Yarael Poof. At some point in that decade, Ti was involved in a complicated incident on Naran-Shiv with Jedi Knight Obi-Wan Kenobi and his Padawan, Anakin Skywalker.\nIn 24 BBY, the Galactic Republic became embroiled in a crisis with a mass exodus of member systems to the nascent Confederacy of Independent Systems, a new government formed by former Jedi and the firebrand Count of Serenno, Dooku. By 22 BBY, the rise in the number the Separatists led the Republic Senate to debate the creation of a proper military to combat an impending war. Because the Jedi were intertwined with the Republic, the Jedi Council sent Jedi Knights to maintain the peace as talk of conflict grew. The Council entered negotiations with the Republic's leader, Supreme Chancellor Palpatine, in an effort to stall any Senate vote to create a military force. However, a series of assassination attempts on Senator Padmé Amidala of Naboo would lead the Council on a twisted path to the start of the war. An opponent of the Military Creation Act, Amidala was twice the victim of attempted assassinations by a bounty hunter and his accomplice.\nTi and the Council assigned Obi-Wan Kenobi to track the bounty hunter down and find out who they were working for and gave Anakin Skywalker the duty of protecting Amidala as she was discreetly relocated from Coruscant to her homeworld. Master Ti was present in the Jedi Temple Archives as Kenobi conducted his research into a lead involving a weapon from the planet Kamino. After arriving at Kamino sometime later, Kenobi made the startling discovery that a clone army was in production by the Kaminoan government. To his surprise, the Kaminoan Prime Minister, Lama Su, alleged that the army had been ordered by a deceased member of the Jedi Council, Sifo-Dyas. Kenobi also learned that the template for the army was the bounty hunter he was searching for, Jango Fett. Fett, however, informed Kenobi that he had been hired by a man called Tyrannus, not Sifo-Dyas.\nAfter following Fett to Geonosis, Kenobi discovered the Confederacy's droid foundries on the planet, where Dooku and other Separatist leaders were building their own army. Kenobi was taken captive, however, but before his capture he was able to send a transmission to Coruscant disclosing his findings. The confirmation that the Separatists had formed their own army spurred the Senate to grant Chancellor Palpatine emergency powers to bypass a vote on the Military Creation Act and instead directly commission the use of the clone army from the Kaminoans. Knowing that war was inevitable, Jedi Grand Master Yoda departed for Kamino to see the new army for himself, while Master Mace Windu, another member of the High Council, prepared what Jedi he could, including Ti, to go to Geonosis and rescue Kenobi.\nMaster Ti was among the group of over 200 Jedi assembled by Windu to free Kenobi, as well as Skywalker and Amidala, who had led a failed rescue attempt themselves, from execution in the Petranaki Arena on Geonosis. Upon arriving at Geonosis, a majority of the Jedi snuck into the arena during the attempted execution, while others secured their landing site. Ti was among the Jedi who infiltrated the arena and, alongside Master Luminara Unduli, hid and waited for the right moment to intervene. Standing on a balcony far above the arena pit was Count Dooku and the other Confederate leaders, as well as Jango Fett. After the trio of prisoners managed to escape death at the hands of the Geonosians' execution beasts, an acklay, nexu, and reek, they were surrounded by a large number of droidekas. Before Dooku gave the order to have them killed, however, Windu confronted the former Jedi.\nWindu's move to arrest Dooku was the signal for the Jedi to act, and the Jedi throughout the arena began igniting their lightsabers, revealing themselves. Ti and Unduli simultaneously ignited their lightsabers and quickly joined the battle as Dooku unleashed hordes of battle droids to counterattack. The Jedi Order's lack of recent combat experience and the sheer volume of battle droids overwhelmed the strike team, many of whom died as survivors were forced to abandon their positions in the stands and descend to the arena floor. The Separatists were not without casualties, however, and Jango Fett was killed during the fighting. The Jedi were quickly surrounded and suffered severe casualties, and the few Jedi who survived the onslaught, including Ti, formed a circle in the center of the arena as they went on the defensive. Dooku paused the droid assault to offer the remaining Jedi the chance for a surrender, but Windu resoundingly refused.\nAs Dooku ordered his army to finish off those left, however, Master Yoda suddenly arrived with the first waves of the Grand Army of the Republic. Yoda had a number of LAAT/i gunships form a perimeter around the survivors while the droids began firing once again. Ti, Unduli, and Master Saesee Tiin boarded one of the gunships and were quickly airlifted out of the arena and taken to the front lines of the larger planetary battle, where the Grand Army was engaging the Separatist forces in an improvised and hasty conflict.\nAt the front lines, Ti was among the Jedi who led the assault on the Separatist core ships as the Confederate leaders were attempting to retreat. Ti fought alongside Windu on the battlefront, cutting down droids and helping the clones push the Separatist armies back. Despite having air superiority, the Republic failed to enact a tangible orbital blockade, allowing for a full Separatist retreat despite the destruction of several core ships. With the retreat of the Separatist forces, the Battle of Geonosis came to a close. Though the Jedi and Republic achieved a victory of sorts, it came at the cost of a majority of the Jedi strike team and the failure to end the burgeoning war in a single stroke.\nShortly following the clash on Geonosis, Separatist forces established footholds on various worlds across the Outer Rim. Seeking to ascertain what purpose the Confederacy had in establishing a presence on Hissrich, Ti and the Council assigned Windu and a covert team of Jedi to the planet to investigate. Ti was later present when the Council gave Kenobi and Skywalker permission to rescue Senators Amidala and Yarua when they were trapped by the Separatists on the moon of Staggec during a diplomatic mission. In the weeks after the battle, the Clone Wars erupted across the galaxy, and the Galactic Senate passed the Jedi Military Integration Act, which formally established the Jedi as officers in the Grand Army of the Republic. As a member of the High Council and a Jedi Master, Ti was among the Jedi given the title of Jedi General.\nAt the start of the war, Ti was sent to represent the Jedi and the Republic on Kamino and to oversee the cloning initiative. As the Republic's representative on Kamino, General Ti was given various responsibilities, from being a military commander to a diplomat. As the supervisor of the clone program, Ti watched over and helped train clone forces for combat, which she was aided in by two bounty hunters contracted by the Republic, Master Chief Bric and El-Les. Ti and the two hunters conducted training exercises for cadet squads and graduated them when they were ready for deployment. Early on, Ti became a protector for the clones under her supervision as someone they looked up to and respected. Her compassion for them was countered by the need to produce capable soldiers, and she often fell between the unsympathetic Bric and the caring El-Les on matters relating to the clones' training.\nAnother of Ti's duties was the coordination of Kamino's defenses, which included a defensive orbital blockade and a local garrison stationed on-world, of which she was the commanding officer. In addition to the garrison, Ti was the commander in charge of the Kamino security force. She also worked closely alongside the Kaminoan government and represented the Republic's interests in meetings with Prime Minister Lama Su. Ti also worked closely with his administrative aide, Taun We, and Nala Se, the Chief Medical Scientist who had played a key role in the creation of the clone armies. General Ti's compassion for the clones as individuals contrasted greatly with the Kaminoan's cold view of them as products, which caused tension between her and the Kaminoan government as she protested their inhumane recommendations for treatment. At some point, Ti flew her Eta-2 Actis-class light interceptor while on Kamino.\nOne clone training group, Domino Squad, was ineffective in following protocol and working as a team. Ti, Bric, and El-Les presided over their pre-graduation exercises in the Citadel Challenge. Following one such failed exercise, Bric implied that the group were \"rejects,\" and should be demoted to sanitation detail. El-Les was more sympathetic and wanted Domino Squad to continue training. Ti, although disagreeing with his sentiment, agreed with Bric that the squad was not ready for combat. She ended the test and requested that maintenance clone 99 send a cleaning crew to the training ground.\nTi later conversed with the Kaminoan Prime Minister, Lama Su, on the squad's ineffectiveness. Su recommended that the Republic find another donor for the cloning process, believing that the squad's failure was a genetic malfunction. He suggested rejecting the squad, by means of termination, an idea Ti strongly opposed. Su ultimately left the final decision of their consequence up to Ti as she was in charge of training. The squad failed their graduation testing, and despite Bric's opposition El-Les sent a request to Ti asking she allow the squad to retake the test. She was later approached by two members of Domino Squad, CT-5555, \"Fives,\" and CT-1409, \"Echo,\" who asked for a transfer to another squad. Sensing their stress, Ti disapproved of their plea and told them that when in battle, they should fight as a group, not as individuals. She told them that she had decided to allow them to retake the test.\nIn the early stages of their final exercise, the squad worked as a team and managed to proceed further than they had before. Upon reaching the citadel, however, they realized that the ascension cables needed to scale it were missing. Bric revealed that he had removed them in hopes that they would fail. El-Les protested that Ti end the test because Bric's actions made it unfair, but she denied his request, stating that adversity would be a constant in war and that the Separatists wouldn't play fair either. Despite Bric's efforts, the squad managed to overcome their disability and complete the test by scaling the tower using the wall-mounted turrets. Having successfully proven themselves and passed their final exercise, Ti graduated them to the Grand Army of the Republic.\nAfter Republic intelligence intercepted a message between Confederate General Grievous and assassin Asajj Ventress discussing a planned invasion of Kamino to halt the production of clone soldiers, Generals Kenobi and Skywalker were dispatched to aid Ti's forces defend the planet. On Kamino, Ti began coordinating the planet's defenses in preparation for the imminent attack. When Kenobi and Skywalker arrived at Tipoca City with their reinforcements in the form of the 501st Legion, Ti and Prime Minister Su met them. Ti welcomed the two to Kamino, while Su expressed doubt that the Separatists would dare attack his world given the strong Republic blockade. Believing that they would be dealing with an orbital assault, the Jedi organized the blockade under the command of Skywalker and Admiral Wullf Yularen. While Skywalker and Yularen awaited the invasion in orbit, Ti, Kenobi, Minister Su, Commander CC-2224, or \"Cody,\" and Captain CT-7567, or \"Rex,\" monitored the fleet from Tipoca City's command center.\nWhen Separatist forces dropped from hyperspace, Ti noted to Kenobi that the armada was far from as large as she expected and ordered Skywalker to begin the airstrike. The orbital battle seemed to be in the Republic's favor, and it was believed that they were successfully withstanding the assault until Ti noticed that Grievous was sacrificing his Munificent-class star frigates to protect his command ship. She and Kenobi realized that something was amiss, and Kenobi left the command center to investigate the debris falling from the atmosphere into the oceans below. What Kenobi discovered was that the Confederate plan was far more complex than the Republic had anticipated; the multi-phase attack called for Grievous to discharge debris from his ships onto the Kamino's surface, where teams of AQ-series battle droids attached to them would build assault craft to target Tipoca City.\nAs the Separatist Trident-class ships assembled sprung into action, depositing droids across Tipoca City, Ti, Kenobi, and Skywalker redirected their focus to the surface to repel the attack. While Kenobi and Skywalker did what they could to stop the Confederate forces from advancing, Ti continued to monitor the battle until a squad of aqua droids attacked the command center. Ti immediately fought back, easily slicing through several with her lightsaber and destroying the rest using the Force. Ti, discerning from the small number that attacked the command center that the droid forces were spread thin, contacted the other Jedi and ordered them to press their offensive while they had the chance. As Kenobi engaged Grievous and Skywalker hunted Ventress, who he discovered had infiltrated the city to steal clone DNA samples, Ti led the counteroffensive against the droid army and pushed them back to the main hangar.\nTi reached out to Commander Cody to inform him of her success, and the Republic forces converged to destroy the remaining aqua droids. The clones were soon able to corner Ventress, but before she could be taken captive she and Grievous made a hasty escape without the DNA. Grievous' risky attack ended in failure thanks to the efforts of Ti and her comrades, and the damage to Tipoca City was quickly contained. Clone production soon resumed on Kamino, with Ti still as its overseer.\nWhen they learned of an intercepted 2,000-year-old distress code, Ti and the Council send Kenobi, Skywalker, and Skywalker's Padawan, Ahsoka Tano, to the Chrelythiumn system, where they were to investigate the signal and rendezvous with Captain Rex. A short time later, Ti and her fellows dispatched the four to investigate the disappearances of the Togruta colonists on Kiros, which was linked to the Separatists and the Zygerrian Slave Empire.\nNot long after, it was discovered that Dooku and the criminal mastermind Moralo Eval were plotting to kidnap Supreme Chancellor Palpatine at the Festival of Light on Naboo. Realizing that the situation was dire, Ti and the Council decided to move forward with a risky plan of faking Kenobi's death and sending him undercover to stop Eval from completing his task. Ti attended the faux funeral held for Kenobi, where she stood between Master Windu and Duchess Satine Kryze, the ruler of Mandalore. As Kenobi continued with his plan to sabotage Eval and Dooku's plot, the Jedi Council took charge of security during the Festival of Light. Ti participated in a meeting held by Windu, where he discussed the measures being taken to ensure the Chancellor's safety. The Council's plan was ultimately a success, and Palpatine escaped unscathed.\nWhen the Confederacy invaded the planet Onderon and replaced its king, Ramsis Dendup, with a puppet ruler, Sanjay Rash, a small group of Dendup's loyal followers rebelled against the new monarch. Two of the leaders of the resistance, Saw Gerrera and Lux Bonteri, reached out to the Council, asking for support. Ti and the Council were wary of helping, as any official support to an underground rebellion would earn the Jedi the scrutiny of the Republic Senate. Nonetheless, the Council sent Kenobi, Skywalker, Tano, and Rex on a covert operation to instruct the rebels in combat.\nIn 19 BBY, the Jedi Temple became the target of a terrorist attack, and a hangar in the sacred complex was bombed. Following the attack, Ti joined her fellow Council members via hologram to discuss the situation. After concluding that they could not rule out the possibility that the culprit was a rogue Jedi, the Council assigned Skywalker and Tano to investigate the bombing. Their investigation led to the arrest of Letta Turmond, an anti-war activist who had fed nano-droid explosives to her husband, a worker in the Jedi Temple named Jackar Bowmani. Master Ti later traveled to Coruscant to attend the funeral of the six Jedi who had been killed in the explosion. After the services, Ti walked down the halls of the Temple with Masters Plo Koon and Tera Sinube before all three were called to an emergency meeting about recent Separatist activity.\nIn a startling turn of events, Padawan Tano became the prime suspect for orchestrating the attack on the Temple after Turmond was killed by way of the Force while the Jedi was visiting her. Tano briefly went on the run while maintaining her innocence. In one meeting the Council had with Republic Admiral Wilhuff Tarkin, the Admiral accused Tano of masterminding the bombing, causing Ti to exchange a shocked look with Master Kit Fisto. After Tano's capture, the Council faced the difficult decision of what to do with her. At the insistence of Tarkin, who believed that an internal trial would be biased, the Council reluctantly agreed to expel Tano from the Order so that she could face a military tribunal.\nTi was one of the judges during Tano's trial in the Chamber of Judgment, where the young Padawan was expelled from the Jedi Order and stripped of her ranks within the Grand Army of the Republic. Skywalker ultimately proved Tano's innocence before a verdict was reached by the Republic courts, revealing that it was Padawan Barriss Offee who had become disillusioned with the Order, gave Turmond the nano-droids, and framed Tano for it all. The Council apologized to Tano and offered her a chance to rejoin, though she refused and left the Jedi Order.\nFollowing clone trooper Tup's breakdown during the Battle of Ringo Vinda, in which he killed Jedi General Tiplar, he was sent to Kamino for an examination. He was accompanied by Rex and Fives, whom Ti, still stationed on the ocean world, met with shortly after their arrival. As they accompanied the sedated Tup to an examination room, Ti informed Rex that he was needed back on the battlefront and sent Fives for an examination, as he was close with Tup and any information gathered would be beneficial to the investigation. Ti and Kaminoan doctor Nala Se then began their testing on Tup. Se conducted a hyper test, a practice Ti was not fond of. During the tests, Tup began shaking violently, which a concerned Fives noticed from the neighboring examination room. Ti shuttered the viewing window between rooms so that Fives would not panic. The tests yielded nothing, and Se's readings showed him to be in perfect health. Ti suggested that they missed something and asked if he was conscious only for Tup to look at her and violently mutter \"kill the Jedi\" before Se sedated him. Ti and Se were at a loss and the two had no answers.\nThe medical droid AZI-3 suggested a phase 5 atomic scan be performed on Tup, in order to find the source of his breakdown. Se claimed that the scan could kill him, and instead suggested that they terminate the clone and do an autopsy on his body, as she believed that the cause of his behavior was a virus. Ti instead believed that the cause was mental, suggesting that the Separatists had brainwashed him during his time at Ringo Vinda. Each decided to speak with their respective peers on what they should do next. While Se conversed with Lama Su, Ti contacted the Jedi Council on Coruscant to discuss the issue. Ti told them of the situation and backed up her theory of brainwashing with the fact that Tup had gone missing for five rotations while on Ringo Vinda prior to murdering Master Tiplar. The Council told her to bring the clone back to the Jedi Temple, where they would examine him through the Force.\nTi was then alerted to an invader alarm on Kamino which she found had been triggered by Fives, who, along with AZI-3, had run the atomic scan against orders. They had located and extracted a tumor which they believed to be the cause of Tup's behavior. Tup soon died muttering that he was \"free of the nightmares.\" Ti and Se contacted Supreme Chancellor Sheev Palpatine and told him about the situation. Ti requested that she be able to continue testing on the tumor at the Jedi Temple, but the Chancellor told her to bring the data to the Grand Republic Medical Facility on Coruscant. Se agreed with Palpatine's suggestion, and the outnumbered Ti informed the Chancellor that she would do as he asked.\nLater on, Ti and Se met with Fives in his examination room. Ti told Fives about the Chancellor's orders and explained that the investigation was better left to medical professionals, inquisitively adding that there was much they didn't know about the tumor yet before placing it in a case. Se stated her opinion that Fives' actions kept them from learning more about the tumor, which irked the clone. The two began arguing over the situation before Ti stopped them. With their arguing settled, Ti told the two that she had arranged for the tumor and all the data gathered to be sent to the Jedi Temple. The outraged Se tried to dissuade the Jedi Master, but Ti simply told Se that her word was final. Ti told Fives that he had one last physical to pass before he would be returned to duty.\nBefore she could leave for Coruscant, however, Ti was alerted that Fives and AZI-3 were attempting to escape. Ti and Se led a squad of clones to a hangar, where they chased after the fleeing duo. The group couldn't reach Fives and AZI-3 in time, and they watched from the hangar as the two fugitives left in an escape pod. Ti ordered that the pod be tracked so they could bring them in alive. Unbeknownst to Ti, Fives and AZI-3 had not planned to escape, but to create a diversion so they could investigate Tup's death and the origin of the tumor in secret. In the central control room, Ti and Se continued their search. Ti told Se that she had a feeling that they were searching in the wrong place.\nTi was soon informed that there had been strange activity in the Genetic Records Hall and that someone was accessing the Jango Fett template data. She ordered that the room be evacuated quietly, and immediately left with a group of clones and Se to investigate. Ti's suspicions turned out to be true and they found Fives and AZI-3 in the Records Hall. Ti, Se, and the clones gave chase once again, but the two renegades escaped into the emergency flooding system. Back in the control center, Ti correctly surmised that Fives and AZI-3 weren't planning to escape, but rather that they were researching something, she just didn't know what. She later saw Se quietly leaving the command center and followed her with a squad of clone troopers. She arrived at the Embryo Room in time to see Fives holding a blaster to Se's head, and told him to surrender as she ignited her lightsaber.\nFives told her how he, assisted by AZI-3, discovered that the tumor had been bio-engineered and suspected a larger plot to be the cause of Tup's actions. The duo had also discovered that all troopers, including Fives, had been implanted with the same organic inhibitor chip, which had malfunctioned in Tup. Ti asked for an explanation of why Tup's had degraded, but Fives told her that it didn't matter and that the entire Republic army could be compromised unless the chips were removed. Se claimed that the chips had been placed to inhibit aggressive behavior and that Tup's malfunction was an isolated incident, as well as that removing the chip caused Tup to die. When he told them that he had removed his own chip, Se claimed that Fives was a threat and should be terminated.\nFives was angered by the suggestion and told Se that she had no right to treat him like hardware, to which Se stated that the clones were merely the property of the Kaminoans. At this remark, Ti interjected on Fives' behalf, saying that the clones were technically the property of the Republic and invoking Jedi authority once more to insist that Fives be sent to the Chancellor for investigation, rather than let him be terminated by the doctor. Se countered that he was not part of the Chancellor's initial request, but Ti remained sturdy in sending him to Coruscant. Fives thanked her for believing in him, to which Ti replied that she was only doing what was right.\nTi led Fives, as well as Se, to the Grand Republic Medical Facility on Coruscant. As they approached Coruscant, however, Se drugged Fives behind Ti's back, making the clone paranoid and aggressive. Upon arrival, they were greeted by Mas Amedda, who led them inside to the Chancellor. The Chancellor greeted Ti as Fives was put on an examination table. Ti gave the chips to the Chancellor and Se explained what they were. He asked whether or not a virus was the sure cause of the decay in Tup's chip, to which Se said that they only knew that the chip had failed and that Fives was now a threat after removing his own. Fives insisted to the Chancellor that the Kaminoans were covering something up about the chips and that if not, he and Tup were victims of a Separatist plot. Se again argued that a virus was responsible and that Fives should be terminated.\nThe Chancellor requested that Ti and Se wait outside while he talked with Fives. Ti protested, but the Chancellor assured her that he and Fives would be safe. As she was meditating outside, Ti heard blaster fire and opened the door to see Fives disarming the Chancellor and his security. Fives began to aim his weapon at the Chancellor, but Ti used the Force to stop him. The Chancellor claimed that Fives had tried to assassinate him. While Ti was helping the Chancellor up, Fives ran out of the room and down a staircase. She chased after the fleeing clone and jumped down the staircase to the medical bay. She ordered that the blast doors be closed, but Fives managed to make it through in time.\nTi met with Masters Koon, Yoda, Windu, and Skywalker and told them about Fives' actions. Skywalker, whose legion Fives belonged to, expressed disbelief upon hearing that he had tried to assassinate the Chancellor. Ti told them that the Kaminoans believed that a virus had caused the clones' inhibitor chip to malfunction, resulting in this behavior, while Fives believed that he was the victim of a conspiracy. Windu informed the Jedi that the Chancellor had been moved to his senate quarters and that all security and clone forces on Coruscant were ordered to join the manhunt for Fives. He added that the Jedi were not asked to take part in the search, something those present found odd. Windu suggested that they lead an undercover investigation to find if any plot involving the clones existed, which Skywalker volunteered to do. Ti warned him to be cautious, as the removal of the chip might have changed Fives. Shortly after being found by Skywalker and Rex, the unstable and neurotic Fives was killed by Commander Fox as he attempted to reveal what he had learned about the chips' true purpose.\nTi, along with Skywalker, Windu, and Yoda, met with the Chancellor later, where he gave his own explanation of the clones' breakdown. Palpatine told the Jedi that his investigation had led him to believe that a parasite native to Ringo Vinda had caused the chips to malfunction, and that an inoculation for it had been developed which would be administered to the clones. Ti and Skywalker remained silent during the meeting, listening as Yoda and Windu accepted the words of the Chancellor, who ensured that nothing more would be made of the situation and that their attention be redirected to the war.\nSoon after, Palpatine informed the Jedi Council of Queen Julia of Bardotta's request for Jar Jar Binks to assist her after the disappearance of several Dagoyan Masters. Ti, along with the rest of the Council, discussed the matter, ultimately deciding that Binks should not go alone, leading to Windu's decision to accompany him.\nAs the Clone Wars continued, the growing presence of the dark side of the Force began to concern the Jedi Council. Ti was among those on the body who began sensing the looming threat of the Sith, the ancient enemies of the Jedi. The Sith became the focus of the Council's interest when they received a decades-old distress signal from the long-lost ship of Master Sifo-Dyas, which Master Koon authenticated on a mission to investigate. Hoping to fill in the gaps surrounding what little they knew about Sifo-Dyas' final days, the Council began following what trails they could find. Ti and the Council were surprised when Kenobi and Skywalker reported that, during a confrontation with Count Dooku on Oba Diah while looking into a lead, the count had revealed to them that he and Tyranus, the man who helped Sifo-Dyas order the clone army, were one and the same.\nThe Council pieced together that Dooku had, under the name Tyranus, enlisted Jango Fett to be the template for the clone army Sifo-Dyas had ordered and paid the Pyke Syndicate of Oba Diah to kill the Jedi Master for him. Ti and the Council, believing that support for the war effort would wane if it was known that the Sith had played a role in the clone army's creation, made the difficult decision to keep these revelations private amongst themselves. Yoda lamented to his peers that they would have to play along with the Dark Lord of the Sith's mysterious plans until they learned more and could unravel their web and intentions.\nShortly after the investigation into Sifo-Dyas' death, Ti and the High Council convened to discuss the implications of what they had learned, specifically the idea that Dooku was not the Sith Master, but merely the apprentice. When asked his opinion of the matter, Grand Master Yoda told the Council that he was deep in thought and had not been listening. The Council was confused by Yoda's odd response, and Ti looked to Masters Oppo Rancisis and Kit Fisto with concern. Yoda later convened the Council to explain his behavior, where he admitted that he believed he had heard the voice of the deceased Jedi Master Qui-Gon Jinn. The Grand Master requested that the Council join him in meditation to see if they could hear the voice as well. Ti joined her fellow Council members as they gathered around Yoda in the center of the chamber and placed their hands on each other. Despite remaining in a meditative state for the entire night, their efforts proved fruitless.\nAs Fisto helped Ti to her feet, Yoda walked off from the Council in disillusionment. Ki-Adi-Mundi proposed to Ti and the others that Yoda was under the influence of the Sith Lord. Kenobi argued against Mundi's suggestion, but Yoda himself agreed and feared that he was under the manipulation of the dark side. After medical treatment failed to discover the cause of his problem, Yoda again heard Jinn's voice and was told to go to Dagobah to learn more. While on Dagobah, Yoda experienced a harrowing vision of the destruction of the Jedi Order in the Cave of Evil. Among the visions Yoda saw of the Jedi being slaughtered, he saw one in which Ti was impaled through her back by a blue-bladed lightsaber as she meditated. He also learned the name of the Sith Lord the Council was searching for: Sidious. As he continued his journey, Yoda saw Ti in a separate vision of the Jedi Temple at peace like it was before the war. When the Grand Master returned, he gave the Council a report on what he discovered.\nAn investigation into the death of Jedi Master Tu-Anh on Utapau by Kenobi and Skywalker led to the discovery that the Separatists had planned on transporting a massive kyber crystal to Serenno. Ti was present during the Council meeting when Kenobi gave a report of the situation, listening as Yoda ordered him to keep the crystal from Separatist hands. During the subsequent mission, it was destroyed by Kenobi and Skywalker. Ti was again with her peers as the two reported their actions to the Council, and the Jedi learned from Master Yoda that kyber crystals like the one on Utapau had once powered ancient superweapons constructed by the Sith. Yoda speculated that the Sith had similar plans and could one day find another crystal to craft a new superweapon.\nAlmost three standard years since the Clone Wars had begun, the Confederacy set its sights on the Mid Rim planet Mahranee. A distress call from the planet led to intervention from Jedi General Chubor, but his forces were unable to prevent a Separatist takeover. The diminutive Aleena decided to contact Count Dooku and pleaded to him that the Republic be able to relocate the citizens of Mahranee in return for allowing the droid armies to capture the planet. Chubor transmitted their conversation to the Jedi Council but Dooku, aware of this, chose to blame the Jedi for the billions of casualties the war had already claimed, then proceeded to decimate Chubor's fleet, killing thousands, including both Republic forces and Mahran refugees. In the High Council chamber on Coruscant, Master Ti and her fellow Council members solemnly watched a hologram of the atrocity.\nA silence fell once the recording ended, and the Council meeting became tense as the Jedi grappled with the mass killing, and a gravely disturbed Windu suggested to his fellows that a covert operation to assassinate Dooku would bring about a swift end to the conflict. Master Kenobi immediately objected, but Windu continued and pressed the Jedi to consider his option, reasoning that if they didn't change their tactics, Dooku would continue to slaughter innocents, and the war would continue without end. Windu's proposal left the Council shaken, and Ti, though calm, expressed sorrow in her expression. Ti and the others watched as Yoda stood from his seat and walked to a window, who dejectedly agreed that they had to stop Dooku before it was too late. After consideration, the Council decided to assign maverick Jedi Master Quinlan Vos to the assassination of Count Dooku.\nVos partnered with Asajj Ventress, who, by then, had been abandoned by Dooku and was living as a bounty bunter, to teach him and help him accomplish his task. While the two trained together, Vos cut off contact with the Jedi Council and continued with his own plan forward. He and Ventress were unsuccessful, however, in their attempt to kill Dooku on Raxus Secundus, and Vos was taken captive. A rescue attempt by Ventress and a group of bounty hunters failed and, over the next several months, rumors of a mysterious Confederate officer dubbed \"Admiral Enigma\" began emerging, and the Council realized that the mysterious person could be Vos.\nVentress was contacted by Master Kenobi and Knight Akar-Deshu, who were seeking to find out what had happened to Vos, and they convinced her to go to the Jedi Temple and speak before the Council. At the time, Ti was in a meeting with Masters Yoda, Windu, Koon, and Mundi in the Council chambers. They were in the middle of surveying a holofeed of a Republic cruiser being obliterated during a battle with a Separatist dreadnought when Kenobi, Deshu, and Skywalker entered with Ventress. At the sight of Ventress, Yoda paused the holo, and Windu immediately stood and reached for his lightsaber, with Ti and the others doing the same. When Windu threatened her with arrest, Kenobi informed the group that he had promised her sanctuary inside the Temple. Ti and the others looked to Yoda, who thanked Ventress for her help and told her that the Council had several questions for her. Though Windu and Koon showed distrust of her, Kenobi facilitated calmness, and the Council began questioning the former Sith acolyte.\nAt the Council's inquiry, Ventress confirmed their suspicions that she and Vos had become lovers and that she had taught him to embrace the dark side solely as a means of killing Dooku. Despite her attempts to explain herself, Windu argued that she had corrupted Vos, but she fired back that he would never have gone to her unless the Council hadn't sent him on his mission. An uncomfortable silence fell before the Council finished their questioning and Yoda sent the Jedi Knights and Ventress outside so the Council members could speak alone. The Council briefly considered their options and decided that they had to trust Ventress' word and try to atone for their mistakes by returning Vos to the Jedi. The Council authorized a rescue mission, and Ventress, with help from Kenobi and Skywalker, was able to free Vos from captivity in Dooku's palace on Serenno. After his rescue, however, Ventress began warning the Jedi that Vos was still under the influence of the dark side.\nFor the next month, the Council granted Vos small missions to perform while he healed from his wounds. At the end of that time, the Council convened to discuss what to do with him further. Kenobi advised that they interpret Ventress' accusations against Vos as her way of dealing with his rejection of her for the Jedi, and opined to the Council that they allow Vos to take on larger missions. Ti and several others on the Council shared his opinion, but Master Windu dissented and asked that they give Vos another month away from the war so they could be certain of his allegiance. Kenobi told Windu that, by allowing Vos to engage in the war effort, they could utilize his knowledge of Confederate tactics from his time as Admiral Enigma to strategize. Windu agreed but argued that Vos didn't have to be in the field for them to do so. Ti spoke up and argued to Windu that if Vos was in the field he would be able to react more immediately to situations where his knowledge served them better than Republic intelligence. She added that she felt he was ready to be sent on a more delicate mission. At Ti's argument, Windu conceded to the will of the Council, and Vos was brought in to be informed of his new duties.\nWith his higher responsibilities, Vos was placed on missions to small Separatist storage facilities and listening posts, but each led to growing suspicion of his loyalty, as every outpost seemed to have been abandoned by the Separatists before Republic forces arrived. Suspecting that Ventress was right and that Vos was indeed a traitor, the Council decided to send him to assassinate Dooku once more. He recruited Ventress again, and they traveled to Christophsis to carry out their mission. Ventress was proven right in her belief that he was still under the influence of the dark side but sacrificed herself at the hands of Dooku in order to redeem him. Vos was ultimately allowed to rejoin the Order, and he returned Ventress' body to her homeworld of Dathomir.\nIn the final months of the war, a Republic victory seemed close at hand. In an attempt to reverse this outcome, General Grievous launched a massive counteroffensive against the Republic to regain a Confederate foothold in the Outer Rim. In this campaign, Republic and Confederate forces were spread across the Outer Rim in a series of clashes named the Outer Rim Sieges. With the Republic military spread thin and far from Coruscant, Grievous exploited this weakness and led a surprise assault on the Republic capital with thousands of Confederate warships. Ti, who was stationed on Coruscant, was ordered to protect Chancellor Palpatine during the battle and was aided by Jedi Master Roron Corobb and layers of security forces.\nTi and Corobb were dispatched to Palpatine's apartments to escort him out of his quarters, but the Chancellor dismissed their concerns and refused to flee in the face of the attack. Grievous himself then appeared, having traveled to the planet's surface to kidnap the Chancellor. Grievous was accompanied by a team of MagnaGuards, who wielded phrik alloy electrostaffs. Ti and Corrob dueled Grievous in Palpatine's quarters. Ti had been in contact with Master Windu as the battle commenced, but lost contact with him while protecting the Chancellor. Grievous easily cut through the Chancellor's security force as well as Corobb, all of whom fell to the General's blades while defending Palpatine. With all but Ti dead, Grievous advanced to confront her. Using both her lightsaber and a MagnaGuard electrostaff, Ti, the last line of defense for the Chancellor, dueled with his MagnaGuards and the General.\nGrievous managed to get the upper hand by electrocuting Ti with electrified cables, which knocked her unconscious. Grievous ensnared Ti in the cables, then took her lightsaber to add to his collection. With Ti incapacitated and the rest of Palpatine's security dead, Grievous fled with the captive Chancellor to his flagship, the Invisible Hand. As a result of his lost communication with Ti, Windu reached out to Kenobi and Skywalker, who were in the process of negotiating a Republic Siege of Mandalore. The two were not only able to successfully rescue the Chancellor, but their rescue mission led to the death of Count Dooku at Skywalker's hands. With Dooku dead and Republic reinforcements overwhelming his fleet, Grievous and his armada retreated from Coruscant in a major loss.\nFollowing their major loss at Coruscant, the Separatist leadership restructured, and Grievous replaced Dooku as the Confederacy's Head of State. Upon learning this, the Council made his defeat their highest priority in order to end the Clone Wars. Despite having their sights on Grievous, they also decided to take stronger measures against Chancellor Palpatine, who they had already strongly distrusted for remaining in office for too long and abusing his wartime executive powers. Palpatine heightened their distrust when he infringed on the Jedi's internal functionalities by personally appointing Skywalker to the Council as his liaison. Believing that they could use Skywalker to learn more about the Chancellor's goals, the Council agreed to his demand but refused to grant Skywalker the title of Master, infuriating the young Jedi.\nThough Ti was not present at the meeting where Skywalker was accepted onto the Council, she was present at a later meeting in which the young Jedi informed the body that he had learned through Palpatine that Republic intelligence had located General Grievous in hiding on Utapau. Skywalker volunteered to lead the mission to capture him, but his request was denied, and Kenobi was tasked with taking Grievous out at Windu and Mundi's urging. The Council's dismissal of Skywalker turned him closer to Palpatine, who revealed to the young man that he was the Dark Lord of the Sith, Darth Sidious. Sidious had been the mastermind behind the creation of both the clone and droid armies and had manipulated both the Republic and Confederacy into conflict to gain power. Skywalker reported his knowledge to Windu, who decided to take immediate action and gathered Masters Fisto, Tiin, and Agen Kolar to arrest the Chancellor before he could make his next move.\nDuring the confrontation between Windu's team and Sidious, the Sith Lord slaughtered Fisto, Tiin, and Kolar, and killed Windu shortly after in a duel with help from a conflicted Skywalker. Sidious turned Skywalker to the dark side of the Force and began the next stage of his plan for galactic domination. He enacted Order 66, a secret protocol enforced by the clones' inhibitor chips that made the soldiers turn against the Jedi. On that night when Skywalker was christened as the Sith Lord Darth Vader, Ti began meditating and recorded a message on a holocron, pleading with its finder not to let the purge of the Jedi be the end of their ways. As the Jedi spread across the galaxy were massacred, Vader placed the Jedi Temple under siege alongside his forces in the 501st legion. Ti, who was in the Temple at the time, did not fight against the attack and instead continued to meditate, and she was murdered directly at the hands of Vader in accordance with Yoda's visions.\nThough Grievous only owned it for a short time before his death at the hands of Master Kenobi during the Battle of Utapau, Ti's lightsaber was among the most prized in his collection, among those of Pablo Jill, Eeth Koth, and Roron Corrob. Grievous used the saber during the onset of the Battle of Utapau in a brief duel with Kenobi but lost the weapon when the hand wielding it was severed by the Jedi.\nIn 12 BBY, after constructing Fortress Vader on Mustafar with the Dark Lord Momin, Vader entered a portal within his palace on a quest to resurrect his deceased wife, Padmé Amidala. As he walked through the portal, Vader experienced a series of visions of figures from his past. In one such vision, which took Vader to the steps of the Jedi Temple, he was confronted by several Jedi both dead and alive, including Ti. One by one, Vader slew the illusionary Jedi. After slaying Masters Windu and Jocasta Nu, Vader was attacked by Ti and Master Koon. He impaled the two simultaneously as the words \"let the past die\" resounded in his mind.\nAt some point following Order 66, the holocron Ti used shortly before her death became part of Grakkus the Hutt's vast collection of Jedi artifacts and paraphernalia kept in his palace on Nar Shaddaa. In 0 ABY, Luke Skywalker, a burgeoning Jedi and the son of Darth Vader, was kidnapped by Grakkus' thugs following a series of skirmishes on the streets of Nar Shaddaa in which he revealed his nature as a Jedi-in-training. Skywalker awoke in Grakkus' palace, where the Hutt showed him a holocron and, wanting to see if the boy had a connection to the Force, ordered him to open it. Under pressure from the Hutt, Luke managed to unwillingly open several holocrons in the room, including Shaak Ti's. Luke listened to her recorded plea before once again facing the Hutt.\nIn 4 ABY, Luke, by then a Jedi Knight, helped redeem his father, who killed Sidious before dying as Anakin Skywalker, ending the Sith reign over the galaxy. In the years after Sidious' fall, Luke began researching and rediscovering the history of the long-dead Jedi Order in order to rebuild it, including the lives and deeds of its members. During his search for knowledge, he learned of Shaak Ti and chronicled what he knew about her in a passage featured in his journal titled The Secrets of the Jedi. Around 34 ABY, fifty-three years after her death, stone artwork of Ti and several other Jedi, including many of her peers, could be found at Dok-Ondar's Den of Antiquities, a store operated by the collector Dok-Ondar in the Black Spire Outpost on Batuu.\nShaak Ti was depicted in several of the illustrated maps made by the Ithorian artist Gammit Chond. Though he was a recluse, Chond heard stories from travelers of tales from across the galaxy and created a series of maps of the planets, people, and events he learned about, including Ti. Chond's surviving maps were stored in the Shadow Stacks of the Graf Archive on the moon Orchis 2 until a student archivist exhumed the set. Following the restoration and release of the maps, the Graf Archive identified Ti as one of many important historical figures featured in them. The Graf Archive also discovered a journal detailing various species from throughout the galaxy. Though the artist of the journal was unable to be authenticated, the Archive suspected that it may have been Chond. Following the journal's restoration, which paired the original artwork with other data from the archives, Ti was named as one of the most famous of her species alongside Ahsoka Tano in the entry on Togruta.\nShaak Ti was a female Togruta with dark eyes and red and white skin. Like all her fellow Togruta, Ti's white pigmentation, which covered much of her face around her eyes, was unique to her. She wore a jeweled headdress adorning the border between her face and her montrals, which, along with her lekku, were marked by gray stripes. Ti's colorful features, though unique, were a hereditary pattern that evolved in all Togruta to confuse the predators that could be found on their homeworld of Shili.\nWidely regarded as wise and patient, Ti was a devoted believer in the ways of the Jedi. As one of the foremost and distinguished Jedi of her time, Ti served on the Jedi High Council from the retirement of Master Yaddle to the dissolution of the body during the Great Jedi Purge. She often remained silent during Council meetings, showing emotion through calm expressions, though she did sometimes interject into debates to voice her opinion. Amid the tenuous years of the Clone Wars, as some of her peers advocated harsh punishment for transgressive Jedi, Ti argued for more compassionate treatment, such as in the case of Quinlan Vos. Ti's commitment to the Jedi made her willing to act against the orders of others, for instance arranging for the data from the investigation of clone trooper Tup's breakdown to be sent to the Jedi Temple before the Republic Medical Facility, which went against the direct command of the Supreme Chancellor.\nDuring the Clone Wars, Ti was sent to Kamino to oversee the cloning initiative. While stationed on Kamino, Ti struggled with her duties and found herself caught between her compassion for the clones and the need to produce capable soldiers for war. Ti was empathetic to the clones' experiences and became a trusted and respected mentor to the soldiers. She did not see the clones as battlefield assets or products like the Kaminoans, instead seeing them as individuals full of potential. Although she was a devotee of the Jedi Order, Ti's relationships with the clones and protective affection for them strayed close to breaking the Jedi Code. Despite the Code forbidding personal attachments and Ti herself being a member of the Order's highest body, she formed close ties with the soldiers under her command. Even though she cared for them, she could be tough on her students to bring out the best in them. She was a hard judge of capability and expected the best from the clones, though she was not callous like some of those she worked with on Kamino.\nBecause she valued the clones' lives as individuals and not as objects, Ti faced difficulty in her relationship with the Kaminoans, who regarded them as intellectual property. Ti openly opposed the Kaminoans' preferred methods of treatment, such as hyper tests and systematic termination, as well as the general mistreatment of the soldiers. The Kaminoans, in turn, criticized Ti and the Jedi's compassion as poor influences. Ti had a particularly difficult relationship with Chief Medical Scientist Nala Se, who had little regard for Ti's moral and spiritual values. Though the two had some respect for each other, their working relationship deteriorated as the rogue Fives led his investigation into Tup's death. Despite keeping the situation professional, Ti stood up for Fives against Se where she could, disputing Se's baseless claims and trying to ease the clone when Se would instigate him. Ti became increasingly suspicious of Se as the crisis continued, and even though Fives' behavior and discoveries deeply troubled her, she invoked her authority over Se to give Fives a chance to present his case directly to Supreme Chancellor Palpatine. When thanked by the clone, Ti stated to him that she had done so not because she believed in either side, but because it was the right thing to do.\nAs a Force-sensitive, Shaak Ti was skilled at using telekinesis during battle due to her Jedi training. During the Battle of Kamino, Ti demonstrated her telekinetic powers when she used the Force to lift two aqua droids, then slammed them into two other droids hard enough to destroy all four. Ti's Force abilities went beyond just telekinesis, as she was also able to perform remarkably high jumps using the Force. When chasing after Fives as he escaped the Grand Republic Medical Facility, Ti easily leaped over a large crowd to catch up, causing an audible gasp from onlookers at the feat.\nAs a Togruta, Ti's hollow montrals could sense the movement of objects. This ultrasonic echolocation, which could reach up to 82 feet, allowed Ti to have sharpened spatial awareness. Because of the advantage given to her by the heightened perception of her surroundings, Ti was among one of the finest Jedi fighters in group combat. Where others struggled with the complexity of movements, Ti was able to engage in battle with ease. She was also skilled in lightsaber combat and could wield two melee weapons at once, as she did during the Battle of Coruscant. In addition to her martial prowess, Ti was also a capable pilot.\nThough an excellent fighter in her own right, Ti showed a great affinity for teaching, often with a specialty in combat instruction. According to Luke Skywalker, Ti was likely given the job of training clone troopers during the Clone Wars because she excelled as both a teacher and a combatant. Ti was a tough but caring teacher, and the lessons she passed on to her students proved far more effective than she possibly imagined. Among her other non-martial capabilities, Ti was well-adept in leadership roles and was an experienced diplomat.\nShaak Ti wielded a blue-bladed lightsaber, using throughout the Clone Wars from the First Battle of Geonosis to the Battle of Coruscant, when it was stolen from her by General Grievous to be part of his collection. The lightsaber hilt, which measured 26.60 centimeters long and 3.30 centimeters wide, was crafted from copper and durasteel. Like many of her fellow Jedi, Ti was the owner of an Eta-2 Actis-class light interceptor. Her starfighter was adorned with red markings and made use of an R2-series astromech droid.\nProud of both her Togruta heritage and of her life as a Jedi, Ti's outfit combined clothing traditionally worn by both. Underneath her standard Jedi robe, she wore a traditional Togruta dress, a long flowing skirt with an intricately designed tabard and scarf. At some point during the Clone Wars, she acquired a wrist comm similarly designed to her tabard.\nShaak Ti was created by concept artists Dermot Power and Iain McCaig, who designed her as a Jedi for use in the second film in the Star Wars prequel trilogy, Star Wars: Episode II Attack of the Clones, which was released on May 16, 2002. Power and McCaig's concept illustrations of the character that ultimately became Ti included her rubicund complexion and intricately patterned and layered brocade. In Attack of the Clones, Ti was portrayed by Israeli actress and model Orli Shoshan. Ti appears throughout the movie as a background character and has no speaking lines. Shoshan was offered the part while she was living in Sydney, Australia, and the costume used to bring Ti to life was designed in part by Trisha Biggar. Though she was a former member of the Israeli Army, Shoshan found it difficult to move and perform melee combat in the bulky costume, which was made up of heavy prosthetics and lengthy clothing.\nTi was intended to be featured in the third film of the prequel trilogy, Star Wars: Episode III Revenge of the Sith, and Shoshan was brought back to film scenes as the character. Both the first scenes featuring Ti and later ones filmed during additional photography were winnowed away during production, but one shot featuring Ti remained in the film, where she was not played by Shoshan but by Maria Brill, a member of Industrial Light \u0026 Magic's VFX editorial team, who donned the costume to portray Ti as a tabletop hologram during a Jedi Council meeting. Both Shoshan and Brill were uncredited for their work in Attack of the Clones and Revenge of the Sith, respectively.\nShaak Ti was voiced by actress Tasia Valenza in the television series Star Wars: The Clone Wars. For the role, Valenza was directed to give Ti a \"calm, subdued\" voice with a Spanish accent. Though Valenza normally recorded her performances in her closet, she recorded her lines for The Clone Wars with other actors in a studio. Valenza voiced Ti in five episodes of the series, beginning with the season three episode \"Clone Cadets.\"\nThroughout the production of Revenge of the Sith, the role Ti was meant to play in the film vacillated. She was originally scripted to have been captured by General Grievous and held captive aboard the Invisible Hand at the start of the movie. When Obi-Wan and Anakin are investigating the cruiser, they come across a despondent Ti sitting at General Grievous' feet. Her spirit broken, Ti apologizes for her failure, right before she is stabbed in the back and killed by Grievous. The scene was filmed and completed, but the sequence was cut and was later included on the DVD release of Revenge of the Sith as a deleted scene.\nThough her first death scene was cut, another was filmed during additional photography at Shepperton Studios. In this scene, she is meditating during the attack on the Jedi Temple and is killed by Anakin Skywalker. The scene was filmed but uncompleted, and was cut from the film as well. In it, she is seen meditating when Skywalker enters the room she is in. She asks what he wants, but he stabs her in the back and her body falls to the ground. This scene exists as the \"Anakin kills Shaak Ti\" animatic and is part of the deleted scenes released on The Complete Saga Blu-Ray in 2011. Ti's canonical death was confirmed as being killed by Skywalker in the 2016 reference book Star Wars: Galactic Atlas.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shaak_Ti",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Shaak",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Shili",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Togruta",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/Kamino_garrison",
  "/wiki/Kamino_security",
  "/wiki/File:ShaakTiTCWCloneCadets.ogg",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi",
  "/wiki/Clone_Wars",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Battle_of_Kamino",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Jedi_General",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Kamino",
  "/wiki/Clone_trooper",
  "/wiki/Planet",
  "/wiki/Commanding_officer",
  "/wiki/Kaminoan",
  "/wiki/Ruling_Council_(Kamino)",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5555",
  "/wiki/Order_66",
  "/wiki/Death",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_Lord",
  "/wiki/Capital",
  "/wiki/Anakin_Skywalker",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Imperial_Palace",
  "/wiki/Reproduction",
  "/wiki/Homeworld",
  "/wiki/Species",
  "/wiki/Expansion_Region",
  "/wiki/Jedi_Initiate",
  "/wiki/Padawan",
  "/wiki/Jedi_Knight",
  "/wiki/Yaddle",
  "/wiki/Invasion_of_Naboo",
  "/wiki/32_BBY",
  "/wiki/22_BBY",
  "/wiki/Coleman_Trebor",
  "/wiki/Yarael_Poof",
  "/wiki/Standard_decade",
  "/wiki/Naran-Shiv",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/24_BBY",
  "/wiki/Separatist_Crisis",
  "/wiki/Count",
  "/wiki/Count_of_Serenno",
  "/wiki/Serenno",
  "/wiki/Dooku",
  "/wiki/Galactic_Senate",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Military_Creation_Act",
  "/wiki/Bounty_hunter",
  "/wiki/Zam_Wessel",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Archives",
  "/wiki/Mission_to_Kamino_(Separatist_Crisis)",
  "/wiki/Prime_Minister",
  "/wiki/Lama_Su",
  "/wiki/Sifo-Dyas",
  "/wiki/Jango_Fett",
  "/wiki/Geonosis",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Mace_Windu",
  "/wiki/Petranaki_Arena",
  "/wiki/Luminara_Unduli",
  "/wiki/Acklay",
  "/wiki/Nexu",
  "/wiki/Reek",
  "/wiki/Droideka",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Saesee_Tiin",
  "/wiki/Core_ship",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hissrich",
  "/wiki/Mace_Windu%27s_squad",
  "/wiki/Yarua",
  "/wiki/Moon_of_Staggec",
  "/wiki/Mission_to_the_moon_of_Staggec",
  "/wiki/Jedi_Military_Integration_Act",
  "/wiki/Master_Chief",
  "/wiki/Bric",
  "/wiki/El-Les",
  "/wiki/Kamino_blockade",
  "/wiki/Aide",
  "/wiki/Taun_We",
  "/wiki/Nala_Se",
  "/wiki/Chief_Medical_Scientist",
  "/wiki/Shaak_Ti%27s_Eta-2_Actis-class_light_interceptor",
  "/wiki/Domino_Squad",
  "/wiki/Citadel_Challenge",
  "/wiki/Squad",
  "/wiki/Clone_99",
  "/wiki/Echo",
  "/wiki/Grievous",
  "/wiki/Asajj_Ventress",
  "/wiki/Admiral",
  "/wiki/Wullf_Yularen",
  "/wiki/Commander",
  "/wiki/CC-2224",
  "/wiki/Captain",
  "/wiki/Rex",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Trident-class_assault_ship",
  "/wiki/DNA",
  "/wiki/Hangar",
  "/wiki/Ahsoka_Tano",
  "/wiki/Chrelythiumn_system",
  "/wiki/Kiros",
  "/wiki/Zygerrian_Slave_Empire",
  "/wiki/Moralo_Eval",
  "/wiki/Festival_of_Light",
  "/wiki/Funeral_of_Obi-Wan_Kenobi",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Mandalore",
  "/wiki/Skirmish_in_Theed",
  "/wiki/Onderon",
  "/wiki/Ramsis_Dendup",
  "/wiki/Sanjay_Rash",
  "/wiki/Onderon_rebels",
  "/wiki/Onderon_Civil_War",
  "/wiki/Saw_Gerrera",
  "/wiki/Lux_Bonteri",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Letta_Turmond",
  "/wiki/NM-K_reconstitutor",
  "/wiki/Jackar_Bowmani",
  "/wiki/Funeral_of_the_Jedi_Temple_bombing_victims",
  "/wiki/Plo_Koon",
  "/wiki/Tera_Sinube",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Kit_Fisto",
  "/wiki/Capture_of_Ahsoka_Tano",
  "/wiki/Chamber_of_Judgment",
  "/wiki/Military_rank",
  "/wiki/Barriss_Offee",
  "/wiki/CT-5385",
  "/wiki/Battle_of_Ringo_Vinda",
  "/wiki/Tiplar",
  "/wiki/Medical_droid",
  "/wiki/AZI-345211896246498721347",
  "/wiki/The_Force",
  "/wiki/Tumor",
  "/wiki/Grand_Republic_Medical_Facility",
  "/wiki/Kaminoan_flight_pod",
  "/wiki/Clone_template",
  "/wiki/Blaster",
  "/wiki/Inhibitor_chip",
  "/wiki/Blast_door",
  "/wiki/501st_Legion",
  "/wiki/CC-1010",
  "/wiki/Parasite",
  "/wiki/Queen",
  "/wiki/Julia",
  "/wiki/Bardotta",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Dagoyan_Masters",
  "/wiki/Mission_to_Bardotta",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sith",
  "/wiki/Distress_signal",
  "/wiki/Jedi_T-6_shuttle_775519",
  "/wiki/Mission_to_Oba_Diah_(Clone_Wars)",
  "/wiki/Oba_Diah",
  "/wiki/Pyke_Syndicate",
  "/wiki/Oppo_Rancisis",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Meditation",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Dagobah",
  "/wiki/Force_vision",
  "/wiki/Cave_of_Evil",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Tu-Anh",
  "/wiki/Utapau",
  "/wiki/Kyber_crystal",
  "/wiki/Mission_to_Utapau",
  "/wiki/Superweapon",
  "/wiki/Mahranee",
  "/wiki/Chubor",
  "/wiki/Atrocity_on_Mahranee",
  "/wiki/Aleena",
  "/wiki/Mahran",
  "/wiki/Quinlan_Vos",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/Raxus_Secundus",
  "/wiki/Mission_to_Serenno_(Krayt%27s_Claw)",
  "/wiki/Standard_month",
  "/wiki/Akar-Deshu",
  "/wiki/Rescue_of_Quinlan_Vos",
  "/wiki/Destruction_of_the_Separatist_supply_storage_base",
  "/wiki/Destruction_of_the_Vanqor_listening_station",
  "/wiki/Second_battle_of_Christophsis",
  "/wiki/Christophsis",
  "/wiki/Dathomir",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Roron_Corobb",
  "/wiki/Palpatine%27s_apartment",
  "/wiki/IG-100_MagnaGuard",
  "/wiki/Phrik",
  "/wiki/Electrostaff",
  "/wiki/Invisible_Hand",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Head_of_State",
  "/wiki/Battle_of_Utapau",
  "/wiki/Agen_Kolar",
  "/wiki/Duel_in_Palpatine%27s_office",
  "/wiki/Holocron",
  "/wiki/Pablo_Jill",
  "/wiki/Eeth_Koth",
  "/wiki/12_BBY",
  "/wiki/Fortress_Vader",
  "/wiki/Mustafar",
  "/wiki/Darth_Momin",
  "/wiki/Jocasta_Nu",
  "/wiki/Ben_Solo",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Hutt",
  "/wiki/Palace_of_Grakkus_the_Hutt",
  "/wiki/Nar_Shaddaa",
  "/wiki/0_ABY",
  "/wiki/Luke_Skywalker",
  "/wiki/4_ABY",
  "/wiki/Galactic_Empire",
  "/wiki/The_Secrets_of_the_Jedi",
  "/wiki/34_ABY",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Collector",
  "/wiki/Dok-Ondar",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Batuu",
  "/wiki/Ithorian",
  "/wiki/Gammit_Chond",
  "/wiki/Shadow_Stacks",
  "/wiki/Graf_Archive",
  "/wiki/Orchis_2",
  "/wiki/Unidentified_archivist_student_(Gammit_Chond%27s_maps)",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Eye",
  "/wiki/Montral",
  "/wiki/Lekku",
  "/wiki/Jedi_Code",
  "/wiki/Telekinesis",
  "/wiki/Force_jump",
  "/wiki/Centimeter",
  "/wiki/Copper",
  "/wiki/Durasteel",
  "/wiki/Eta-2_Actis-class_light_interceptor",
  "/wiki/R2_series_astromech_droid",
  "/wiki/Astromech_droid",
  "/wiki/Scarf",
  "/wiki/Dermot_Power",
  "/wiki/Iain_McCaig",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/May_16",
  "/wiki/2002",
  "/wiki/Orli_Shoshan",
  "/wiki/Trisha_Biggar",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Maria_Brill",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Tasia_Valenza",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Clone_Cadets",
  "/wiki/Shepperton_Studios",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/2011",
  "/wiki/2016",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/5-Minute_Star_Wars_Stories_Strike_Back",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/Brotherhood",
  "/wiki/Hyperspace_Stories_1",
  "/wiki/ARC_Troopers",
  "/wiki/Overlords",
  "/wiki/Hologram",
  "/wiki/Kidnapped",
  "/wiki/Deception",
  "/wiki/Crisis_on_Naboo",
  "/wiki/A_War_on_Two_Fronts",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Conspiracy",
  "/wiki/Fugitive",
  "/wiki/Orders",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/The_Lost_One",
  "/wiki/Voices",
  "/wiki/Destiny_(episode)",
  "/wiki/The_Big_Bang",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Gone_with_a_Trace",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars_(2015)_9",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Shaak_Ti",
  "/wiki/Category:Images_of_Shaak_Ti",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Trip_to_the_Light_Side",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Lightsabers:_A_Guide_to_Weapons_of_the_Force",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_17",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Across_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Eta-2_Actis_Expansion_Pack",
  "/wiki/A_Galaxy_for_Everyone",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/The_End_of_the_Clone_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Battle_of_Scarif",
  "/wiki/0_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Sacrifice",
  "/wiki/Shattered",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Fortress",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Vrogas_Vas",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Resistance",
  "/wiki/Standard_week",
  "/wiki/First_Order",
  "/wiki/Battle_of_Batuu",
  "/wiki/Star_Wars:_Rise_of_the_Resistance",
  "/wiki/Star_Wars:_Galaxy%27s_Edge_(media_project)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars",
  "/wiki/October_27",
  "/wiki/2019",
  "/wiki/Pablo_Hidalgo",
  "/wiki/September_17",
  "/wiki/2010",
  "/wiki/May_3",
  "/wiki/2015",
  "/wiki/The_Sith_Lord",
  "/wiki/Even_Piell",
  "/wiki/Adi_Gallia",
  "/wiki/Depa_Billaba",
  "/wiki/20_BBY",
  "/wiki/Coleman_Kcaj",
  "/wiki/Stass_Allie"
 ]
}