{
 "name": "Shaardan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Olive"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Yuthura Ban"
     ]
    }
   ]
  }
 ],
 "content": "Shaardan was a male Human who was a prospective student of the Sith Academy on Korriban during the Jedi Civil War. In 3956 BBY, he would go into the local colony of Dreshdae and intimidate and embarrass the locals.\nWhen Revan arrived at Dreshdae he found Shaardan getting tired of Prospective Sith failing to get his moral questions correct. He then asked Revan what punishment should he give to the \"hopefuls.\" Revan convinced Shaardan to let them go. Shaardan, hoping to gain favor with Master Uthar Wynn, waited for another student to wander into the tomb of Ajunta Pall and retrieve his sword. Unfortunately for him, the student who recovered it was Revan. Shaardan confronted Revan near the entrance of Pall's tomb. He had hoped to intimidate Revan into giving him the sword. However, Revan refused and an angered Shaardan attacked Revan, but was slain. Revan ended up being the one to give the sword to Master Wynn for the prestige.\nWhen it comes to dealing with Shaardan's \"hopefuls\", there are a number of options.\nTelling Shaardan to let them go is the light side option;\nThe player could also tell Shaardan to kill the hopefuls, which he gladly does with Force lightning.\nOddly enough, should the player demand to be left out of this, Shaardan lets the hopefuls go but the player still gets dark side points, as it involves leaving the hopefuls to Shaardan's mercy.\nAs an alternative, Revan could give Shaardan a fake sword. Shaardan would then take it . With the false sword, Shaardan returned to Uthar Wynn only to be strangled for his failure to recognize Revan's deceit. Another possibility is for Revan to give Shaardan the sword. It should be noted that Shaardan fights Revan with a vibro double-blade rather than a lightsaber even though he is seen carrying a lightsaber at all other times.\nRevan doesn't even have to recover Ajunta Pall's blade at all to impress Uthar enough to proceed to Naga Sadow's Tomb, so Revan may not encounter Shaardan again after their encounter as Revan arrives on the planet. So Shaardan could remain in the Academy from then on, with the Academy run under Yuthura Ban, or to be killed as Revan proceeds to take down all remaining Sith insurgents left inside the academy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3956_BBY",
  "/wiki/Korriban",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Yuthura_Ban",
  "/wiki/Sith_hopeful",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Jedi_Civil_War",
  "/wiki/Dreshdae",
  "/wiki/Revan/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Uthar_Wynn",
  "/wiki/Ajunta_Pall",
  "/wiki/Sword_of_Ajunta_Pall",
  "/wiki/Tomb_of_Ajunta_Pall",
  "/wiki/Leviathan_(Interdictor-class_cruiser)",
  "/wiki/Mind_trick/Legends#Force_persuasion",
  "/wiki/Force_drain/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Telekinesis/Legends#Force_choke",
  "/wiki/Vibro_double-blade",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}