{
 "name": "Shadow  (veermok)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Eriadu"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 48 BBY",
      "Eriadu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Eriadu veermok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Shadow was the name given to a male veermok, one of the non-sentient primates native to Eriadu, observed by Wilhuff Tarkin during one of his visits to a hill called the Carrion Spike. It was small compared to the some of the other veermoks in the area, and often seemed to shadow a larger veermok named Lord. Lord sometimes tolerated Shadow, but other times chased him off. Shadow himself was followed by eight smaller male veermoks.\nLord had long been the understood head of the pack of veermoks, but Shadow and his followers planned an \"assassination\". They waited for Lord to be focused on Tarkin's presence, and attacked him all at once. Three of Shadow's veermoks died at Lord's paws while Shadow watched the confrontation. The rest of Shadow's veermoks killed Lord.\nAmid the triumph of the victory, Tarkin threw his vibro-lance at Shadow and killed him, ending his new reign before it had truly begun. Stunned, the other veermoks stared docilely at Tarkin, later following him when he left the Carrion Spike. They later disappeared from the area and were never seen again.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Eriadu",
  "/wiki/48_BBY",
  "/wiki/Eriadu_veermok",
  "/wiki/Gender",
  "/wiki/Anakin_Skywalker",
  "/wiki/Veermok",
  "/wiki/Sentience",
  "/wiki/Primate",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Carrion_Spike_(location)",
  "/wiki/Lord_(veermok)",
  "/wiki/Darth",
  "/wiki/Death",
  "/wiki/Vibro-lance",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/14_BBY"
 ]
}