{
 "name": "Shaef_Corssin",
 "display_name": "Shaef Corssin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "The human male Shaef Corssin was a competent and focused officer of the Galactic Empire's Imperial Navy. He served as the captain of the Imperial I-class Star Destroyer Devastator, flagship of the Sith Lord Darth Vader. In 0 BBY, the Devastator arrived above the planet Scarif as Alliance to Restore the Republic forces were attempting to escape with the plans to the Death Star superweapon. Corssin informed Vader once the Devastator had disabled the enemy flagship, and the Sith Lord ordered him to prepare a boarding party; however, a portion of the rebels eventually escaped with the Death Star plans.\nShaef Corssin was a human male member of the Imperial Navy's officer corps during the reign of the Galactic Empire. He served as captain of the Imperial I-class Star Destroyer Devastator, flagship of the Sith Lord Darth Vader. In 0 BBY, the Alliance to Restore the Republic attacked the Imperial forces stationed at Citadel Tower on the planet Scarif in order to steal the plans to the Death Star superweapon. Once the plans had been transmitted to the Alliance Fleet engaging the Imperial forces in orbit, Admiral Raddus gave the order to retreat by jumping to hyperspace.\nAs the ships began to jump, the Devastator arrived from hyperspace above Scarif, causing several smaller Alliance vessels to collide with the Star Destroyer and break apart on its hull. The Imperial vessel then opened fire upon Raddus' ship, the MC75 Star Cruiser Profundity, and managed to disable it, preventing it from fleeing. Corssin approached Vader upon the Devastator's bridge to let him know the enemy flagship was crippled, but also informed him about the transmission it had received.\nThe Sith Lord ordered Corssin to prepare a boarding party and left the bridge, joining the team to try and recover the Death Star plans; however, a small number of the rebels ultimately managed to escape with the plans aboard the CR90 corvette Tantive IV. The Devastator then gave chase after the corvette, before ultimately capturing it above the planet Tatooine and then returning to the Death Star. Corssin was no longer in command of the Devastator by the time of the Battle of Endor in 4 ABY, during which it was captained by Admiral Jhared Montferrat.\nCorssin was a competent and fiercely focused Imperial officer, speaking crisply when he addressed Vader on the Devastator's bridge. He had light skin, gray eyes, and blond hair.\nDuring the Battle of Scarif, Corssin wore black gloves and a standard gray Imperial officer's uniform that included a cap, an officer's disk, and another disk on the buckle of his black belt. On his breast, he wore three code cylinders alongside a rank insignia plaque that showed three red squares and two blue.\nShaef Corssin first appeared simultaneously in the 2016 Star Wars Anthology film, Rogue One: A Star Wars Story, and Alexander Freed's novelization of the film released alongside it. Corssin was portrayed by Michael Shaeffer in the film and credited as \"General Corssin,\" receiving the first name of Shaef, based on part of the actor's surname, in the accompanying reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was written by Pablo Hidalgo. The reference book also identified the character as a captain rather than a general. As Corssin is shown in Rogue One: A Star Wars Story to be a naval officer, this article assumes that his correct rank is captain.\nThe 2017 graphic novel adaptation of Rogue One written by Alessandro Ferrari slightly abbreviates Corssin's dialogue and erroneously depicts him with gray hair. An unnamed captain of the Devastator who is described as an older individual appears in A New Hope: The Princess, the Scoundrel, and the Farm Boy, a 2015 novelization written by Alexandra Bracken of the 1977 original trilogy film, Star Wars: Episode IV A New Hope. In the Star Wars Legends continuity, the character Mulchive Wermis held the position during the events of A New Hope.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Corsin",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/File:Corssin-Flagship.ogg",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_Navy",
  "/wiki/Captain",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/Flagship",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/0_BBY",
  "/wiki/Scarif_system",
  "/wiki/Planet",
  "/wiki/Scarif",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Profundity",
  "/wiki/Sith_Lord",
  "/wiki/Death_Star",
  "/wiki/File:Vader-Corssin.ogg",
  "/wiki/Imperial_Era",
  "/wiki/Citadel_Tower",
  "/wiki/Orbit",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Hyperspace",
  "/wiki/Star_Destroyer",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/Bridge_(starship)",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Corvette",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tatooine",
  "/wiki/Time",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Jhared_Montferrat",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Glove",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Belt",
  "/wiki/Breast",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Alexander_Freed",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Michael_Shaeffer",
  "/wiki/General",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2017",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Alessandro_Ferrari",
  "/wiki/Unidentified_Imperial_captain_(Devastator)",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/2015",
  "/wiki/Alexandra_Bracken",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Legends",
  "/wiki/Mulchive_Wermis",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Unidentified_Devastator_captain",
  "/wiki/9_BBY",
  "/wiki/Category:Audio_files_of_Shaef_Corssin",
  "/wiki/Category:Images_of_Shaef_Corssin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blade_Squadron_(short_story)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/StarWars.com",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Part_V",
  "/wiki/Part_I",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/19_BBY",
  "/wiki/Battle_of_Yavin"
 ]
}