{
 "name": "Shafu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3653 BBY",
      "over Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ven Zallow"
     ]
    }
   ]
  }
 ],
 "content": "Shafu was a Rodian male who made a career as a slaver in the years before the Great Galactic War between the Galactic Republic and the Sith Empire. However, the Jedi Master Ven Zallow tracked down Shafu and convinced him to change his ways, leading the Rodian to become Zallow's undercover agent in the criminal underworld. Near the end of the Great Galactic War, Shafu's investigations into a network of Imperial spies led to his death when his sabotaged starship exploded over the moon Nar Shaddaa.\nA Rodian male, Shafu worked as a slaver in the years before the Great Galactic War between the Galactic Republic and the Sith Empire, transporting slaves in his starship. The astromech droid T7-O1 served as Shafu's navigator but never entered the cargo hold where the slaves were kept, and so was unaware of Shafu's actual trade. Sometime before 3681 BBY, the Jedi Master Ven Zallow tracked down Shafu. However, instead of arresting the Rodian, Zallow convinced Shafu to give up his career as a slaver and return to Hutt Space, where Shafu freed hundreds of slaves. Giving T7-O1 to the Jedi Master, Shafu went on to work as an undercover operative for Zallow, infiltrating the criminal underworld during the Great Galactic War.\nDuring the war, Zallow sent Shafu to investigate rumors of an Imperial spy in the upper echelons of the Republic. Shafu intercepted a message from the Alderaanian noble Eckhorn Baliss that contained a list of Imperial sympathizers in the Galactic Senate and revealed Baliss to be an Imperial spy. However, Baliss was killed in 3663 BBY, and Shafu continued his investigations over the next decade, determining that Baliss had attempted to blackmail an Imperial plant in the Senate and was killed for it. Shafu compiled a report on his investigations and submitted it shortly before Zallow's death in 3653 BBY, but Zallow died before seeing the message, and it was deleted from official communications. Shafu was killed himself not long afterward by the bounty hunter Terrin Sandafar, who sabotaged Shafu's ship so that it exploded over the moon Nar Shaddaa.\nYears later, T7-O1 learned of Shafu's death—which had been ruled accidental—and rebuilt Shafu's report from the deleted files. Using Shafu's report, T7-O1 identified the spy and Sandafar's employer as the husband of Senator Verre Sydia, and the man was arrested.\nThe Rodian Shafu was a slaver before the Great Galactic War, but Ven Zallow was able to convince him to abandon his career and free his captives. Shafu became loyal to Zallow, risking his life as Zallow's undercover operative in the criminal underworld. T7-O1 believed that Shafu underestimated the droid and his capabilities.\nShafu was mentioned in a conversation with the Jedi Knight class companion character T7-O1 in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3653_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Ven_Zallow",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Slavery/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Death/Legends",
  "/wiki/Shafu%27s_ship",
  "/wiki/Moon/Legends",
  "/wiki/T7-series_astromech_droid",
  "/wiki/T7-O1",
  "/wiki/3681_BBY",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Operative",
  "/wiki/Alderaanian/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Eckhorn_Baliss",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/3663_BBY",
  "/wiki/Standard_decade/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Terrin_Sandafar",
  "/wiki/Saboteur/Legends",
  "/wiki/Verre_Sydia%27s_husband",
  "/wiki/Senator/Legends",
  "/wiki/Verre_Sydia",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/3643_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}