{
 "name": "Shaina Kreen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rebel Alliance",
      "Alliance Intelligence",
      "Alliance Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Shaina Kreen was an Alliance special operative who posed as a waitress at the exclusive Sabre Club of the Ace of Sabres casino. She used her position to gather intelligence on the powerful elite clientele at the club.\nBefore joining the Rebel Alliance Shaina worked as a model for many notable clothing designers. After joining the Rebels, she posed as a naive waitress in the Ace of Sabre's VIP club where she used her beauty and charm to discover secrets that could be useful to the Rebellion.\nShaina was a tall, thin, and very attractive woman who knew how to use her physical attributes to her advantage. She was a fearless young woman who undertook a very dangerous undercover assignment. If anyone at the Ace of Sabres discovered what she was really up to it would have meant deadly consequences. Despite the dangers Shaina was charming and very easy to talk to. Head of Security Dunan Par'Ell became very protective of her although he never made any overtures towards her.\nShaina Kreen was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Alliance_Special_Operations",
  "/wiki/Sabre_Club",
  "/wiki/Ace_of_Sabres",
  "/wiki/Casino/Legends",
  "/wiki/Dunan_Par%27Ell",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997"
 ]
}