{
 "name": "Shai",
 "display_name": "Shai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Ilum"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Shai was a male Human admiral of the Republic Navy and one of the commanders of the Republic's military efforts on Ilum during the fighting during the Galactic War. He saw endless war for all his life and had grown very tired of it and hoped that Ilum would be the changing point of the conflict. He witnessed the Imperials kill the Jedi Master Jaric Kaedan and later tried to destroy the entire Imperial force on Ilum at once with the experimental ELX-25 long-range cannon. When confronted in the Republic base by an Imperial hero, Shai states that the Empire's efforts were futile; even if the Empire uses Ilum's Adegan Crystals to construct their stealth armada, the Republic will find a way to detect and destroy it, starting a cycle of creating superweapons until both superpowers annihilate each other or the galaxy. He then activated ray shields around himself and summoned his troops to attack the invader, but the Imperial managed to kill them all and destroy the shield generators. Despite being wounded, Shai defiantly proclaims that his death would not stop the Republic resistance, vowing that the Empire will fail because it tramples on freedom, whereas the Republic pull the weak up and become stronger as a result. The Imperial ignored his prattle and executed him.\nShai is a characters in the 2011 Star Wars: The Old Republic video game, available during the Imperial Ilum missions.\nShai's fate is decided two ways:",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3640_BBY",
  "/wiki/Ilum/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Admiral/Legends",
  "/wiki/Battle_of_Ilum",
  "/wiki/Galactic_War",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jaric_Kaedan",
  "/wiki/ELX-25_prototype_long-range_cannon",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Adegan_Crystal",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}