{
 "name": "Shak%27Weth",
 "display_name": "Shak'Weth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3645 BBY",
      "Odacer-Faustin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Odacer-Faustin Sith academy",
      "Odacer-Faustin Sith academy"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Students of the Odacer-Faustin Sith academy"
     ]
    }
   ]
  }
 ],
 "content": "Shak'Weth was a Human Sith Lord and the Blademaster of the Odacer-Faustin Sith academy in the years preceding, during, and after the Great Galactic War. While all students were subject to his tutelage, he often gave private training sessions to a young Sith Acolyte named Rance Lussk, the academy's premier apprentice. Eight years after the Sacking of Coruscant, a virulent outbreak overtook the student populace of the Odacer-Faustin academy, and Shak'Weth prepared to depart as mayhem rapidly consumed the planet. However, just outside the academy, the Blademaster encountered a wandering Jedi named Rojo Trace, whom he proceeded to duel. When it seemed as though he would emerge victorious, Shak'Weth was unexpectedly attacked and viciously gored to death by a victim of the plague: the reanimated corpse of one of the very students he had trained in lightsaber combat.\nShak'Weth was a Force-sensitive Human male who lived during the Great Galactic War and the resultant period of political unrest. It was during that time that Shak'Weth allied with the Sith Empire and eventually became both a Master and Lord of the Sith. He excelled in lightsaber combat and was granted the coveted title of Blademaster, a distinction that saw his service given to the Empire in the form of instruction in his field of expertise on the snow-covered world Odacer-Faustin. The war effort against the Galactic Republic ended in 3653 BBY with the signing of the Treaty of Coruscant, at which point the Imperial war machine chose to accelerate rather than decrease its output of Sith warriors and leaders. Shak'Weth retained his decades-long position as lightsaber combat instructor of the Odacer-Faustin Sith academy, and a measure of the Blademaster's wisdom was imparted to the enrolled learners.\nShak'Weth's regimen consisted of hours of drill inside the academy, followed by a trek up seventy-seven stairs to the roof for practice duels where the apprentices were armed with poison barb-covered training weapons. An especially skilled young Human adolescent named Rance Lussk showed exceptional promise, and Shak'Weth was among the many Sith Masters who granted him private instruction. On a day in 3645 BBY, after a group training lesson that left his students rather exhausted, Shak'Weth permitted them to engage in unrestricted practice combat for the first time. The highly-anticipated session commenced with a challenge—dreaded by his fellow students, nevertheless allowed by Shak'Weth—from Rance Lussk, wherein he beckoned forth the uncertain Wim Nickter. The Blademaster and his other students waited impatiently for the hesitant Nickter to accept or decline. When it became apparent that fear had stricken the apprentice, Shak'Weth demanded a response and was surprised by the boy's acceptance of his recognizably-superior opponent's summons. The Blademaster stood by silently alongside hundreds of other students as they all bore witness to the humiliating defeat subsequently suffered by Wim Nickter.\nNot long afterward, an alchemical experiment performed by the academy's headmaster, a Sith Lord called Darth Scabrous, resulted in the creation of a virus that reanimated the bodies of the deceased. As the malady spread throughout the school, all classes and drills—Shak'Weth's included—were canceled until further notice. While the rest of the faculty attempted to quell the epidemic, the Blademaster prepared to make haste his own flight. A chance encounter as he exited the academy forestalled his departure, however, when he caught sight of an approaching individual. As the man, whom Shak'Weth recognized as a Jedi, neared the building, the Sith Lord confronted him and declared that his unfortunate arrival on the Sith academy world would be rewarded with a painful death. The Knight, a Human named Rojo Trace, obliged the Sith Lord's demand for penance, and combat ensued.\nFurious was Shak'Weth's advance upon the Jedi Knight, who was just barely able to evade the attack that carved a deep furrow into the ground where he had been standing a moment before. The Blademaster deflected his adversary's return slash and charged again, forcing the overmatched Trace into retreat as he narrowly avoided several erratic sweeps made by Shak'Weth's blade, each designed to sever the Jedi's head. Trace attempted a Form V: Djem So–inspired flip over the Sith Lord's head, followed by an attack that was effortlessly swatted aside, and was instead rewarded with a slash from Shak'Weth's lightsaber that opened a long wound across his chest. With his opponent incapacitated, the equally exhausted Shak'Weth declared an imminent end to the duel. However, as he braced himself against the outer wall of the academy, he dropped his lightsaber in surprise as hands emerged from a hole in the structure to seize him from behind by the throat. One of the undead victims of Darth Scabrous's plague had caught the Blademaster unawares and proceeded to gorge itself upon Shak'Weth's flesh as he struggled in futility to free himself. The teenage Sith zombie then dragged what remained of the helpless Blademaster through the hole to continue its feast, while Shak'Weth's Jedi opponent escaped with his life.\nLord Shak'Weth, the preeminent lightsaber combatant and instructor on Odacer-Faustin, clad himself in boots, a tunic, and a hooded cloak, from which he regarded those who sought to curry favor with him. His stern countenance and commanding voice identified him as at least a Sith Master by those to whom he was unfamiliar. Such was the prestige conveyed by Blademaster Shak'Weth and the other Masters upon Rance Lussk that the apprentice was allowed to only attend training sessions when he felt so inclined. Although other apprentices strove for perfection under the Blademaster's close scrutiny, he nonetheless witnessed the comings and goings of many whose ambition was also their undoing. Apprentices thought twice about even touching Shak'Weth's training sabers and questioned the boldness of those who did so without permission. Invigorated by the prospect of facing an opponent, the Sith Master grunted and snarled at his enemies with cordial contempt and indulged them with sinister smiles as he made promises of an ignominious death in combat.\nShak'Weth was unparalleled on Odacer-Faustin in his mastery of the lightsaber, such that he was charged with the instruction of all of the academy's students in its use. He fought with a single red-bladed weapon and made use of blindingly-fast attacks and instantaneous responses to overwhelm his opponents. His battle presence was likened to a force of nature, another facet of the blizzards that ravaged Odacer-Faustin in perpetuity. Rojo Trace faced him and realized that, while the Blademaster politely guaranteed his demise, Shak'Weth's was a primal combat fury that ensured the utter destruction of his opponent as the only possible outcome. While immersed in the fight with the Jedi Rojo Trace, however, Shak'Weth was oblivious to his surroundings, a blunder that ultimately resulted in his death in the clutches of one of the Odacer-Faustin Sith zombies.\nAuthor Joe Schreiber created Shak'Weth for the 2010 Red Harvest horror novel, the prequel to Death Troopers, also penned by Schreiber. Red Harvest is Shak'Weth's first and only appearance to date.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/3645_BBY",
  "/wiki/Odacer-Faustin",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Odacer-Faustin_Sith_academy",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_academy",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_Blademaster",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_training",
  "/wiki/Sith_Acolyte",
  "/wiki/Rance_Lussk",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Imperial_bioweapons_Project_I71A",
  "/wiki/Planet/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Rojo_Trace",
  "/wiki/Duel_on_Odacer-Faustin",
  "/wiki/Death/Legends",
  "/wiki/Zombie/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Time/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Water/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/3653_BBY",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Sith_Warrior",
  "/wiki/Lightsaber/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Pelko_bug",
  "/wiki/Sith_training_saber",
  "/wiki/Sith/Legends",
  "/wiki/Wim_Nickter",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Darth_Scabrous",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Form_V/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Throat",
  "/wiki/Darth/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Sith_apparel",
  "/wiki/Prestige",
  "/wiki/Color/Legends",
  "/wiki/Joe_Schreiber",
  "/wiki/2010",
  "/wiki/Red_Harvest_(novel)",
  "/wiki/Death_Troopers",
  "/wiki/Red_Harvest_(audiobook)",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Timeline_1:_Treaty_of_Coruscant",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Old_Republic:_Fatal_Alliance"
 ]
}