{
 "name": "Shalini",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Silver"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Typha-Dor"
     ]
    }
   ]
  }
 ],
 "content": "Shalini was a Human female Typha-Dor resistance fighter stationed on TY44. She served as crew leader of the hidden satellite outpost; her husband, Mezdec, served as first officer, responsible for communications. Mezdec proved to be a traitor, however, serving as an undercover agent for Van-Ith, the ruler of the planet Vanqor that had been poised to invade Typha-Dor.\nIn 25 BBY, after Shalini's original disk detailing Vanqor's invasion plans for Typha-Dor was stolen by her traitor-husband, she entrusted a second duplicate disk into the hands of Jedi Padawan Anakin Skywalker, to deliver to the ruling leadership of her home world.\nBut Shalini and her TY44 outpost comrades, including Skywalker, were captured on Vanqor and taken to The Tomo Camp, a prisoner-of-war facility in the Tomo Craters region of Vanqor. Skywalker was later rescued by his Master Obi-Wan Kenobi, and together they delivered the Vanqor-invasion disk to Typha-Dor. Shalini and her fellow crew members were later freed through the efforts of Skywalker, Kenobi, and Siri Tachi.\nShalini was described as a slender woman with silvery eyes.\nShalini's reason for entrusting the Vanqor-invasion disk to Skywalker was so that the young Jedi might somehow get its vital, time-sensitive information directly into the hands of her home world's governing officials so that they might be apprised of Vanqor's invasion strategy, which was to be implemented within only a few days' time. In The Complete Star Wars Encyclopedia, Shalini's reason for entrusting the disk to the Jedi is to transmit its information \"back to the Republic.\" In Jude Watson's Jedi Quest: The Moment of Truth, nowhere does it state that the Republic was even advised of the disk. Skywalker, as a Tomo Camp prisoner stripped of all clothing and possessions, including his comlink, utility belt, and lightsaber, had no means to communicate the information to anyone in the galaxy except through his Master's rescue, reclamation of his belongings, and, after fighting their way through a nest of gundarks to secure transport, racing to get the disk  to the governing officials of Typha-Dor—the sole basis and intent of Shalini's giving the disk: to provide Typha-Dor with its only hope of escaping invasion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Typha-Dor",
  "/wiki/TY44",
  "/wiki/Satellite/Legends",
  "/wiki/Mezdec",
  "/wiki/Van-Ith",
  "/wiki/Vanqor",
  "/wiki/25_BBY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Vanqor/Legends",
  "/wiki/Tomo_Camp",
  "/wiki/Tomo_Craters",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Siri_Tachi/Legends",
  "/wiki/Jedi_Quest:_The_Moment_of_Truth",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}