{
 "name": "Shala",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Courkrus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Invids"
     ]
    }
   ]
  }
 ],
 "content": "Shala was a minor but very old Hutt crime lord whose pirate gang was associated with the Invids. He was, after the \"Ghost Jedi\", the most hated being on Courkrus. Recognizing that the Ghost Jedi had refrained from actually killing anyone, Shala set a trap in his lair and openly declared that he would destroy the Jedi. Unfortunately for the Hutt, his Twi'lek explosives expert Rach'talik, who had ambitions to seize control of the gang, betrayed Shala and ensured that he would die in his own trap. When the explosives were set off, their sequences was arranged so that the mine targeted at Shala would detonate last, and the Hutt would realize he had been betrayed before dying in the blast.\nCorran was able to absorb energy from the blasts and redirect the explosion upward, and created a fiery vision of the Ghost Jedi raising his lightsaber. This dramatic conclusion to what came to be known as the \"Great Hutt Roast\" confirmed that the Jedi had somehow survived Shala's trap, and further terrified the already skittish Invids.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Ree_Shala",
  "/wiki/11_ABY/Legends",
  "/wiki/Courkrus",
  "/wiki/Hutt/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Invids",
  "/wiki/Crime_lord/Legends",
  "/wiki/Corran_Horn",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Rach%27talik",
  "/wiki/Lightsaber/Legends",
  "/wiki/I,_Jedi",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}