{
 "name": "Shamus Falconi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Algor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Shamus Falconi was a Human male who worked as a smuggler during the Galactic Civil War. He inherited the starship Lumrunner from his grandmother and was partnered with the Wookiee Grasheel.\nBorn on Algor, Falconi had to chose between being a pirate like his mother and sisters or choosing a career in law like his father. When neither appealed to him, he took the ship he had inherited from his grandmother and decided to become a free-trader and smuggler. He had a large network of contacts that would inform him of good cargo runs or spaceports to avoid.\nOne of his main jobs was smuggling illegal weapons manufactured by Dutan Lee to miners in the Mestra system. At one meeting, Falconi had planned to trade lum and industrial replusorlift coils for mining equipment. In reality, the deal was for refined tibanna gas and military-grade coils in exchange for stolen Imperial weapons. On the approach to docking bay 1831, Falconi noticed the ship was being scanned. He had Grasheel do their own scan by piggybacking on the incoming signal to get an idea of what awaited them upon landing. On the ground, Falconi sent a signal to the waiting Lee and Chop Harlison by sending out Grasheel first while smoking a cigarillo. Captain Alijah Orr and his team of stormtroopers and customs inspectors swarmed the group, determined to find illegal goods. Falconi professed his innocence and cooperated fully with the authorities. After the scanning teams did not find anything, Orr demanded that Falconi let them on-board to perform a manual search. Falconi complied and watched as the Imperials found nothing suspicious.\nAfter the Imperials left, Falconi informed Lee that he had Renea Luies hide his illegal weapons and the Captain of the Port had affixed valid Imperial Customs Bureau seals to the crates, making them able to be easily passed through customs. Falconi told Harlison that the tibanna gas was hidden in certain lum bottles and that the requested military repulsor coils were hidden inside the cases of the industrial coils. Credits were exchanged, and Falconi brought out a bottle of Socorran raava to seal the deal.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Algor",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Lumrunner",
  "/wiki/Wookiee/Legends",
  "/wiki/Grasheel",
  "/wiki/Pirate/Legends",
  "/wiki/Lawyer/Legends",
  "/wiki/Free-trader",
  "/wiki/Spaceport/Legends",
  "/wiki/Dutan_Lee",
  "/wiki/Mestra_system",
  "/wiki/Lum",
  "/wiki/Repulsor_coil",
  "/wiki/Tibanna/Legends",
  "/wiki/Docking_bay_1831",
  "/wiki/Chop_Harlison",
  "/wiki/Cigarra/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Alijah_Orr",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Renea_Luies",
  "/wiki/Imperial_Customs_Bureau_seal",
  "/wiki/Socorran",
  "/wiki/Raava",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Lumrunners",
  "/wiki/Star_Wars_Adventure_Journal_9"
 ]
}