{
 "name": "Shandria L'hnnar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Shandria L'hnnar was a young Human female serving in first the Rebel Alliance and subsequently the New Republic.\nLike so many other fellow Corellians, L'hnnar aspired to entering the Imperial Academy. Because she had always been an excellent student who possessed the ability to learn and retain information easily, the prospect of her entering the Academy and graduating at the top of her class was very realistic.\nHowever, she became disillusioned with the Galactic Empire when one of her close friends at the Imperial Institute of Higher Studies on Ferrhast, Celida Noerr, joined the Rebel Alliance, revealing the brutal truth about the Empire by breaking into the Institute's computer banks. As a result of the break-in, Celinda Noerr was arrested as a traitor and never seen or heard from again.\nShandria joined the Alliance and worked as an operative, drawing largely upon her skills with handling of information. When the New Republic was formed, she continued to serve in the same capacity.\nL'hnnar travelled to Venaari to meet up with a local cell of rebels. She was at the Binary Bar when some of the Venaarian rebels were attacked by stormtroopers. Sienn Sconn, who was also in the bar, attacked the Imperials and tried to help her escape. Becoming trapped in the back of the bar, L'hnnar saw a stockroom that was storing Gravdinian Ale and realized the room would have vents to the outside to disperse the dangerous vapors from the alcohol. Using Sconn's stun-staff, she found the ventilation shaft, and the pair climbed out to the roof. Sconn jumped down to the alley to take out a crew of a Venaarian Strike Speeder and was saved when L'hnnar shot the co-pilot who had snuck up behind the thief.\nThe pair took the speeder and headed toward Ven-Kavi Starport so that L'hnnar could get back to her ship and escape the planet. During the trip, L'hnnar attempted to drop off Sconn so he wouldn't get involved in the New Republic business, but he told her that he promised to see her safely to her ship. After resuming their journey, L'hnnar heard a bounty hunter named Pentix Graphyt landing on the roof of their speeder. She lent Sconn her hold-out blaster so he could investigate. After Sconn defeated the bounty hunter, L'hnnar made it to docking bay 18 and offered to take Sconn off-planet with her. He refused to join the New Republic and stayed behind to cover her escape. Before she left, she kissed Sconn and slipped a credit stick with 25,000 credits on it into his pocket.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Imperial_Institute_of_Higher_Studies",
  "/wiki/Ferrhast",
  "/wiki/Celida_Noerr",
  "/wiki/Venaari",
  "/wiki/Binary_Bar",
  "/wiki/Venaarian",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Sienn_Sconn",
  "/wiki/Gravdinian_Ale",
  "/wiki/Alcohol/Legends",
  "/wiki/Stun-staff",
  "/wiki/SV-50_Swift-Strike_Speeder",
  "/wiki/Ven-Kavi_Starport",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Pentix_Graphyt",
  "/wiki/Docking_bay_18",
  "/wiki/Credit_chip/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/One_of_a_Kind_(short_story)",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/Easy_Credits",
  "/wiki/Star_Wars_Adventure_Journal_9",
  "/wiki/Two_for_One",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}