{
 "name": "Shandy_Fanaso",
 "display_name": "Shandy Fanaso",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Shandy Fanaso was a crewmember of the One Two Many during the Imperial era. Previously, he had been the captain of the Corellian Gambit, a light hauler. Once, on a trip to the Pangarees, Fanaso had chosen to stop over in the Triton Moons, specifically Triton Besh. There, while having to wait four days for a cargo-tithe receipt that would allow him to pass through the system and onto the Pangarees, he noted that the strict Domains of Triton laws prevented other spacers from enjoying intoxicants and stimulants while waiting for their own receipts.\nSeeing a way to make a new living for himself, Fanaso converted his ship's hold into a cantina. Since his ship, while connected to Triton Besh Port via an umbilical, was not subject to the Rules of Law for the Domains of Triton, Fanaso was immune to the Tritonite laws. However, when he returned a second time, with a cruiser he had purchased with a loan, Shandy's Pleasure Palace, he found out that the Tritonites had changed their laws to prevent his actions. As a result, he was arrested by Imperial stormtroopers and forced to perform devotion-service for the Tritonites. The devotion-service involved him reciting the tracts of Gactimus 500 times, a feat which took him over four years to complete. Afterward, Fanaso became a crewmember on the bulk cruiser One Two Many.\nHailing from Corellia, the Human male Shandy Fanaso was the owner and captain of the light hauler Corellian Gambit. At some stage during the Imperial era, he put his ship to use, hauling goods across the galaxy. He was contracted to ship a hold of chak-root liqueur along the Rimma Trade Route to the Minos Cluster, but the shipment did not arrive on schedule. Fanaso had been waiting on Eriadu for the arrival of the goods, when he was informed that the hauler carrying the liqueur had suffered a burnout on the way from Sukkult. With nothing else to do, Fanaso took on a shipment of replacement arms for agri-droids and several freezers full of bruallki, in addition to several courier orders from Eriadu Pay-and-Fetch bound for the Pangarees. The trip would take eleven days; the Eriadu general-hire agent suggested going through Triton to shorten the journey. En route to the Pangarees, Fanaso passed through the Mayagil sector, located within the Outer Rim Territories. When he neared the world of Triton, his ship was picked up by an Imperial customs cruiser; Fanaso was subsequently greeted by Lieutenant Gallagne of the Imperial Military.\nAt first, Gallagne noted that the young Fanaso had failed to identify his port of origin on his flight plan, but the lieutenant decided not to charge the inexperienced Corellian the standard fine. Gallagne then informed Fanaso that he would have to stay on Triton Besh for four days to await a tithing receipt, which would include customs tax. While the lieutenant noted that those days would be particularly dull for the young man, Fanaso was not daunted by the prospect, provided Triton Besh had a cantina. Gallagne confirmed that Triton Besh did indeed have a cantina, and then advised Fanaso that at least one Tritonite would greet the Corellian upon arrival, before giving the visitor the Rules of Law for the Domains of Triton. While Gallagne admitted that much of the Rules of Law seemed \"silly,\" he cautioned Fanaso against dismissing them without at least a careful read-through. With the customs procedure complete, Fanaso was free to land on Triton Besh.\nArriving at Triton Besh Port, Fanaso was greeted by the Domains of Triton representative, Mactimentus. The Tritonite presented the Corellian with a copy of the Rules of Law, but when Fanaso thumbed through the document, he found that many of the laws pertained to basic safety rules that any ship's boy would have learned on his first day. Returning the document to Mactimentus, Fanaso prepared to pay the cargo-tithe, but was swiftly stopped by the Tritonite once he stepped off the umbilical that had connected to the Corellian Gambit, and onto Triton Besh Port proper. Mactimentus proceeded to thrust a tract of Gactimus into Fanaso's hands, and offered to provide the Corellian with instructions in the ways of Gactimus, the Tritonite deity. Fanaso declined the offer and insisted on paying the cargo-tithe immediately, but Mactimentus nonetheless decided to teach the Corellian about Gactimus on the way to the cargo-tithe office.\nOn the way, while Mactimentus continued to sing the praises of Gactimus, Fanaso spied a cantina, outside which a group of Tritonites waited. The Corellian suggested that he and Mactimentus enjoy an Elba beer there, but the Tritonite explained that the tavern was not considered a part of the Domains of Triton, and so he could not set foot in there. Nevertheless, Fanaso elected to stop at the cantina briefly but was informed that only scrip of the Domains of Triton was considered legal tender in the bar, and that scrip could only be obtained at the cargo-tithe office. Resignedly, Fanaso passed the cantina by and proceeded to the office. There, he was told to await delivery of the tithing receipt at his ship's umbilical in four days.\nBy the time the pair had returned to the cantina, Mactimentus had recited the tract of Gactimus so many times that Fanaso felt he could utter it from memory himself. Hoping to escape the endless talk of Gactimus, Fanaso entered the cantina and ordered an Elba beer, only to be met with laughter from everyone present. The bartender explained that no intoxicants or stimulants were allowed to be brought into the Domains of Triton, which included music and card games. Noting that the cantina was not a part of the Domains of Triton, Fanaso learned that the Rules of Law also covered possession—essentially, the reason there were no intoxicants or stimulants in the cantina was because there was no way of getting them there without committing a crime. Disappointed at the discovery and dismayed at the prospect of having to endure four days without entertainment, the Corellian was suddenly struck with an idea.\nWhen he had finished his shipment to the Pangarees, Fanaso decided to take up a new profession by converting the Corellian Gambit's hold into a cantina dubbed \"Shandy's Place.\" Purchasing large supplies of Elba beer, Treffanian ale, and jumbli juice, he also obtained a jukebox and the services of a female Twi'lek entertainer. In addition to that, he acquired a Mayagil sector cabaret license, which would allow him to operate in Imperial space. He then took the Corellian Gambit back to Triton Besh after a brief inspection by Lieutenant Gallagne. Upon docking at Triton Besh Port, Fanaso began affixing a banner to his ship's umbilical, advertising Shandy's Place. While doing so, he was met by Mactimentus, who provided the Corellian with the newly revised Rules of Law. Without giving it a thought, Fanaso disposed of the document and headed for the Triton Besh cantina. Since he had to pay no cargo-tithe, he was free to travel straight to the establishment, round up the occupants, and bring them back to Shandy's Place. Within no time, he was able to make back the money he had spent on developing his ship's hold. A week after doing so, Fanaso was told by Mactimentus, who had been waiting outside the ship's umbilical, that the situation was bordering on intolerable for the Domains of Triton. Fanaso, unfazed, offered to give the Domains a percentage of his profits, were an arrangement to be made in which the Tritonites would begin advertising Shandy's Place. One of the other Tritonites found the idea abominable, however, so Fanaso decided to continue as he had.\nWith business on Triton Besh firmly established, Fanaso took out a loan, and with it purchased a Whaladon-class container ship, which he dubbed Shandy's Pleasure Palace. This time, Lieutenant Gallagne informed Fanaso that the highest-ranking monitors of the Domains of Triton were paying attention to his actions, and the Imperial officer once again suggested that the young Corellian read through the Rules of Law carefully. Fanaso was sure of himself though, and continued with his business. Upon arrival at Triton Besh, Fanaso was met by a crowd of pleased spacers and immensely displeased Tritonites. Mactimentus, without ceremony, provided the Corellian with a new copy of the Rules of Law, while a couple of the spacers pushed through and into Shandy's Pleasure Palace. While he was leafing through the document, Fanaso was informed by Mactimentus that he was now in violation of all 43 Rules of Law that had changed since his last visit.\nProtesting, the Corellian backed into his ship's umbilical, but was then met with the sight of Lieutenant Gallagne and a squad of Imperial stormtroopers, who where there to arrest him. Several of the stormtroopers passed by Fanaso and Gallagne and into Shandy's Pleasure Palace, to bring the festivities within to a halt. Specifically, Fanaso was guilty of accidentally importing trace amounts of intoxicants into the Domains of Triton, playing music audible in the Domains of Triton, advertising with a banner in the Domains of Triton, and failing to keep his customers under control, amongst various other transgressions. To Fanaso's shock, ownership of his craft and the goods within it were to be transferred over to the Domains of Triton, and to add insult to injury, he would not be able to pay off the fine with a tithing fee—instead, he would have to perform \"devotion-service\" for the Domains, before he would be free to depart Triton Besh once more.\nGallagne informed Fanaso that his devotion-service would involve reciting the tracts of Gactimus for nine hours a day, in three hour blocks, at the Triton Besh cantina. Every sixth day he would have liberty, but he would be restricted to the Domains of Triton, the refreshers, and the cantina. While performing his devotion-service, Fanaso was to be given quarters in one of the cantina's storage rooms. Furthermore, he was to recite the entire saga of Gactimus 500 times before his sentence would be complete. Fanaso figured that to recite the one tract he had been given 500 times would take a couple of days only, and he was more worried about what his backers would think once they learned that Shandy's Pleasure Palace had been seized. However, Gallagne provided Fanaso with only more devastating news: the tract he had been given was only the first of three hundred and thirteen, and that he had to read all of them 500 times.\nAs the Imperials set up an amplifying device in the cantina, Fanaso calculated just how long it would take him to recite the saga of Gactimus 500 times. According to his calculations, it would take him three to four years to complete the task. The Tritonites did not make it easy for Fanaso, either—after at least one day of recital, they pointed out several problems with his pronunciation, and forced him to start over. After one week, the Corellian's vocal cords were so severely damaged that he had to spend two days in the Triton Besh infirmary. Following that, he began reciting at a slower pace, while constantly sipping the juice and distilled water served at the cantina. Those sips would cause him at least thirty-three days' worth of trips to the refresher. On occasion, he couldn't bear the thought of more recitation, and would spend the day in his cot. And at least three times during his devotion-service, he was assaulted by disgruntled patrons of the cantina.\nIn the third year of his devotion-service, Fanaso and his endless recitation was covered in a Herglic guidebook, Strange Sights Along the Spaceways. Following the book's publication, Herglic tourists would come to Triton Besh to observe the Corellian. To Fanaso, they stank, but to his advantage, they did leave tips. Those tips, however, were confiscated by the Tritonites despite Fanaso's objections. When Lieutenant Gallagne visited Triton Besh, though, he ordered that the Tritonites return the tips to the Corellian. After that, Saman, the proprietor, began charging Fanaso for room and board, which plunged him even deeper into debt. To prevent the further exploitation of Fanaso, Gallagne had Saman set a schedule of rates to remain in effect until the conclusion of the devotion-service. The Corellian eventually finished his recitations, four years, fifty-six days, and seven hours after he had begun.\nHe had amassed two trunks full of credits in tips, but after he booked a flight out of Triton Besh, the Tritonites insisted that he take all 313 tracts with him. Fanaso's first thought was to shred the documents, but fearing that he would breach the Rules of Law, he departed with a minimum of fuss. What he would later learn was that a complete set of the tracts of Gactimus was exceptionally rare, and highly valued. The Corellian was able to sell his entire set to a Herglic collector from Sukkult for a million credits. With most of those credits, he was able to pay off those he owed for Shandy's Pleasure Palace, and with the rest he was able to purchase a share in the bulk freighter One Two Many.\nThe other investors would soon come to know Fanaso and his tale, and they would often rile him about his past. However, the Corellian was able to settle into his new life, making sure he avoided the Triton Moons at all costs. They eventually took on a ship's boy, Janzel Helot, who was immensely curious and inquisitive. Once, after the One Two Many had departed Injopan on a course for the Maw, Helot had burst into the ship's lounge clutching the first tract of Gactimus, which a Tritonite had given to him at Injopan High Port. The boy was at first excited at his new acquisition, until Fanaso snatched the tract out of his hand and began telling him about his time on Triton Besh. One of the crewmembers, Devoris, constantly provoked Fanaso, almost to the point of violence, but nonetheless the Corellian continued his tale. By the end of it, Helot thought it had all been worth it, since Fanaso had gained considerable wealth by selling his collection of tracts, but Fanaso begged to differ, suggesting that Helot simply read the first tract 500 times. The Corellian also advised the boy that he always read the small print.\nAn enterprising and confident man, Shandy Fanaso took to his captaincy of the Corellian Gambit with enthusiasm—so much so, that he accidentally ignored procedure at least once. His failure to read the fine print did not cost him dearly until he brought Shandy's Pleasure Palace to Triton Besh. His earlier exploitation of the entertainment-derived spacers awaiting their cargo-tithes had brought him considerable profits, but also the attention of the local authorities. He essentially ignored the protocols and the Rules of Law for the Triton Moon, and as a result, lost over four years of his life to devotion-service. Afterward, he was far more bitter in his demeanor and held considerable contempt for the Tritonites that had previously held him captive. Even before his devotion-service, he, like many other spacers who frequented Triton Besh Port, had grown weary of the Tritonites' constant hailing of their deity, Gactimus, and had found himself in dire need of genuine entertainment.\nShandy Fanaso made his first and only appearance in the 2008 short story \"Deader than a Triton Moon.\" In the story, which was written by Jason Fry, Fanaso serves as the central character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/One_Two_Many",
  "/wiki/Imperial_Period",
  "/wiki/Captain/Legends",
  "/wiki/Corellian_Gambit_(starship)",
  "/wiki/Light_hauler",
  "/wiki/The_Pangarees",
  "/wiki/Triton_Moons",
  "/wiki/Triton_Besh",
  "/wiki/Star_system/Legends",
  "/wiki/Domains_of_Triton",
  "/wiki/Spacer/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Triton_Besh_Port",
  "/wiki/Rules_of_Law_for_the_Domains_of_Triton",
  "/wiki/Tritonite",
  "/wiki/Shandy%27s_Pleasure_Palace",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Devotion-service",
  "/wiki/Tract_(object)",
  "/wiki/Gactimus",
  "/wiki/Bulk_cruiser/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Chak-root/Legends",
  "/wiki/Rimma_Trade_Route/Legends",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Eriadu/Legends",
  "/wiki/Sukkult",
  "/wiki/Labor_droid/Legends",
  "/wiki/Bruallki",
  "/wiki/Eriadu_Pay-and-Fetch",
  "/wiki/Triton/Legends",
  "/wiki/Mayagil_sector",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Gallagane",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Mactimentus",
  "/wiki/Ebla_beer",
  "/wiki/Treffanian_ale",
  "/wiki/Jumbli_juice",
  "/wiki/Jukebox/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Whaladon-class_container_ship",
  "/wiki/Refresher/Legends",
  "/wiki/Herglic/Legends",
  "/wiki/Strange_Sights_Along_the_Spaceways",
  "/wiki/Saman",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Bulk_freighter/Legends",
  "/wiki/Janzel_Helot",
  "/wiki/Injopan/Legends",
  "/wiki/The_Maw/Legends",
  "/wiki/Injopan_High_Port",
  "/wiki/Devoris",
  "/wiki/2008",
  "/wiki/Deader_than_a_Triton_Moon",
  "/wiki/Jason_Fry",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_49"
 ]
}