{
 "name": "Shanra Immel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Army",
      "Shanra Immel's squad",
      "Republic Army",
      "Shanra Immel's squad",
      "Shanra Immel's squad"
     ]
    }
   ]
  }
 ],
 "content": "Shanra Immel was a Human female sergeant in the Republic Army. In 3640 BBY, during the Galactic War between the Galactic Republic and the resurgent Sith Empire, she served with Republic Special Forces Division Colonel Jace Malcom in a battle on Kalandis Seven, a desolate world in the Inner Rim. Immel and her squad were tasked with the destruction of the local Sith-controlled spaceport. After arriving at the spaceport, Immel, Malcom, and her squad proceeded to take out the sentries and place the first of the targeting beacons, which would allow their starfighters to destroy the spaceport regardless of fog cover.\nImmel and Malcom then spotted a Sith planetary command ship, and Malcom amended their mission to include him capturing the vessel. As Malcom went after the Sith craft, Immel and her squad placed the last of the beacons at their target sites, and the spaceport was destroyed shortly thereafter. Immel spared a starfighter to save Malcom's life after he failed to capture the Sith command ship.\nShanra Immel was a Human female sergeant in the Galactic Republic Army. In 3640 BBY, during the Galactic War between the Republic and the resurgent Sith Empire, Immel and her squad served with Colonel Jace Malcom of the elite Republic Special Forces Division on the desolate Inner Rim planet Kalandis Seven; Malcom was serving as their advisor there. During the ongoing battle for control of the world, Immel and her squad were given orders to destroy the local Sith-controlled spaceport. On the way to their target, Immel and her squad were attacked, and Corporal Amden vor Keioidian was fatally wounded during the fighting. After checking Keioidian's condition, Immel made the decision to leave the Corporal behind, activating his med tracer so that he would be rescued.\nAfter Immel ordered the squad to move out, the group finally reached the spaceport three hours later. Immel and Malcom emerged from a canyon entering the local plains with the spaceport in sight. After her squad—consisting of the soldiers Camur, Eron, Yennir of the Green, Vaskus Kayle, Min-Reva, and Zenhai—checked in, Malcom gave Immel a satchel of targeting beacons, which would allow their starfighters to destroy the spaceport regardless of fog cover. Immel and Malcom approached the spaceport together and observed the enemy patrols. Malcom shot a nearby patrol and, with Immel's help, disposed of their bodies under a half-repaired Imperial fighter.\nImmel discovered that one of the troopers Malcom shot was still alive and killed him to prevent them from being discovered. She then planted one of the target beacons onto a nearby power terminal. Shortly thereafter, Immel and Malcom sighted a planetary command ship landing on Kalandis Seven, and Malcom amended Immel's plan to include him capturing the command ship alone, while she and her men would finish the mission. Malcom then infiltrated the spaceport and the command ship. Meanwhile, Immel set all the beacons on their targets and checked on Malcom's status.\nIn the command ship, Malcom fought a female Sith Overseer and defeated her, but not before she set off the command ship's self-destruct. While the spaceport exploded, Immel spared a starfighter to save Malcom's life as he jumped out of the stationary Sith craft. Malcom thanked her for saving his life and asked about the status of the mission. She updated him, saying that the spaceport was destroyed, and offered to buy him a drink, but Malcom declined, stating that he was being recalled to the Core Worlds.\nShanra Immel had light skin, short brown hair, and brown eyes. She wore red-and-white armor that was similar to the standard Republic trooper armor of that time, and carried a blaster rifle. She cared for others, especially those with whom she served, and refused to send them into a situation for which they were not equipped. Immel did not much care for Republic SpecForce and was of the opinion that its members were nothing but scum. When Immel killed a mortally wounded Imperial soldier, she viewed her actions as mercy. She had a disparaging opinion of Private Vaskus Kayle, noting that he could not shoot well, and was of the opinion that he would mistakenly poison himself one day. However, she acknowledged that Kayle recognized his own faults and knew how to follow orders.\nShanra Immel first appeared in Alexander Freed's short story, The Last Battle of Colonel Jace Malcom, which was published in Star Wars Insider 137 and released on October 23, 2012.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Army",
  "/wiki/Shanra_Immel%27s_squad",
  "/wiki/Sergeant/Legends",
  "/wiki/3640_BBY",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Colonel/Legends",
  "/wiki/Jace_Malcom",
  "/wiki/Battle_of_Kalandis_Seven",
  "/wiki/Kalandis_Seven",
  "/wiki/Planet/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Sith/Legends",
  "/wiki/Kalandis_Seven%27s_spaceport",
  "/wiki/Squad/Legends",
  "/wiki/Sentry",
  "/wiki/Targeting_beacon",
  "/wiki/Starfighter/Legends",
  "/wiki/Water/Legends",
  "/wiki/Unidentified_planetary_command_ship",
  "/wiki/Planetary_command_ship",
  "/wiki/Starship/Legends",
  "/wiki/Rendaran-class_assault_shuttle",
  "/wiki/Command_ship/Legends",
  "/wiki/Advisor/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Amden_vor_Keioidian",
  "/wiki/Death/Legends",
  "/wiki/Med_tracer",
  "/wiki/Spaceport/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Camur",
  "/wiki/Eron_(soldier)",
  "/wiki/Yennir_of_the_Green",
  "/wiki/Vaskus_Kayle",
  "/wiki/Min-Reva",
  "/wiki/Zenhai",
  "/wiki/Imperial_soldier",
  "/wiki/Power_terminal",
  "/wiki/Unidentified_Sith_Overseer",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Republic_trooper",
  "/wiki/Time/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Private/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Alexander_Freed",
  "/wiki/The_Last_Battle_of_Colonel_Jace_Malcom",
  "/wiki/Star_Wars_Insider_137",
  "/wiki/October_23",
  "/wiki/2012",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider:_The_Fiction_Collection_Volume_2"
 ]
}