{
 "name": "Shanks",
 "display_name": "Shanks",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Feswe Corridor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "House of Tagge"
     ]
    }
   ]
  }
 ],
 "content": "Shanks was a Human male who served as a Lieutenant in the Imperial Navy during the Galactic Civil War. Shanks served as a military liaison between the Galactic Empire and the House of Tagge in 0 ABY, working directly under Baron Orman Tagge. The lieutenant served as a key advisor to Tagge during the Yavin blockade and later on Tatooine, where the Tagges planned to annihilate the Rebel fleet with a superweapon called the Omega Frost. However, the Rebel Luke Skywalker foiled the Tagges' plot, and Shanks was killed when the Rebels destroyed the Tagge flagship.\nA Human male, Shanks progressed to the rank of Lieutenant in the Imperial Navy by 0 ABY. That year—the wake of the Empire's stunning defeat at the Battle of Yavin—the Imperial-allied House of Tagge was enlisted to aid in the Yavin blockade, where the Tagges planned to use an enormous turbine called Achtnak Turbine Station to hide constant TIE fighter runs on the Rebel base on Yavin 4. Shanks was assigned as the Tagges' Imperial military aide on the mission, working under Baron Orman Tagge aboard a Tagge Mining Explorer. Shanks' duties included assisting in Tagge's lightsaber training, as the man fancied himself a master of the ancient weapon of the Jedi Knights. Tagge, who was preparing for a long-desired showdown with the Sith Lord Darth Vader, was frequently dissatisfied with the quality of Shanks' opposition.\nAt first, Shanks and Tagge deployed Achtnak Turbine Station to devastating effect, allowing them to hide their starfighters within the gas giant Yavin Prime before springing bombing runs out of seemingly nowhere. However, Shanks expressed concerns that Tagge should have moved the station deeper within Yavin Prime, fears that proved validated when Rebel pilot Luke Skywalker figured out the turbine's location and bombed it to smithereens. Shanks and Tagge narrowly managed to escape, retreating to the Mining Explorer and surreptitiously following Skywalker's path out of Yavin Prime. Afterward, Shanks accompanied Tagge and his brother, scientist Silas Tagge, in a mission to Tatooine, where the Tagges were testing another new weapon: the Omega Frost, a superweapon with the power to freeze any object containing moisture. Orman and Silas planned to lure the Rebel fleet into a trap in the Feswe Corridor and annihilate them with the Omega Frost, and Shanks served as a liaison between them and a third Tagge brother—Imperial General Ulric Tagge—who had a battle group on standby.\nHowever, Skywalker once again got involved in their plans, boarding the Tagges' ship and besting Orman in a lightsaber duel that left the Baron incapacitated in the Mining Explorer's sick bay. With Orman in clinical shock, Shanks served directly under Silas in the battle to come. Although Silas planned to go ahead with their plan even without Orman, Shanks feared further meddling from Skywalker, and once again his misgivings proved well-founded. After fleeing Tagge pursuit in a stolen TIE fighter, the young Rebel managed to reach one of the Omega Frost's conductors, rendering the device inoperable. Silas fled the bridge in a panic after seeing his plans coming apart, leaving Shanks to command the sitting-duck Mining Explorer. The Rebels soon swept in and destroyed the ship, killing almost everyone aboard.\nAn ambitious young Imperial lieutenant, Shanks was eager to work with the Tagges, seeing it as a perfect opportunity to advance himself in the Imperial hierarchy. However, while Shanks was frequently impressed with the intelligence and acumen of Orman and Silas Tagge, their cavalier plans had a tendency to make him nervous. By the time of the battle in the Feswe Corridor, Shanks had grown to regret ever thinking working with the Tagges could further his career. Shanks trained extensively with a lightsaber during his time with Orman Tagge, although his skills were not quite up to the Baron's muster.\nShanks first appeared in Star Wars  25, written by Archie Goodwin and released in 1979. Shanks would later go on to appear in three more issues in the original Marvel Comics Star Wars comic run—in all four of his appearances, he was illustrated by Carmine Infantino.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Feswe_Corridor",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/House_of_Tagge/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Orman_Tagge/Legends",
  "/wiki/Yavin_blockade",
  "/wiki/Tatooine/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Omega_Frost/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mining_Explorer",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Achtnak_Turbine_Station",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Great_Temple/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Silas_Tagge/Legends",
  "/wiki/Water/Legends",
  "/wiki/General/Legends",
  "/wiki/Ulric_Tagge/Legends",
  "/wiki/Duel_aboard_the_Tagge_Mining_Explorer",
  "/wiki/Sick_bay",
  "/wiki/Battle_of_the_Corridor",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Star_Wars_(1977)_25",
  "/wiki/Archie_Goodwin",
  "/wiki/1979",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Carmine_Infantino",
  "/wiki/Star_Wars_(1977)_26",
  "/wiki/Star_Wars_(1977)_33",
  "/wiki/Star_Wars_(1977)_34",
  "/wiki/Star_Wars_(1977)_35"
 ]
}