{
 "name": "Shara_(rebel)",
 "display_name": "Shara  (rebel)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Shara was a human female member of the Alliance to Restore the Republic. She served as a rebel trooper that, along with a blaster rifle, packed a missile launcher while on missions.\nShara was a human female who joined the Alliance to Restore the Republic by the year 0 BBY. She served as a rebel trooper that was known to carry a missile launcher along with her other gear while on missions. During the Galactic Civil War against the Galactic Empire, Shara may have undergone a variety of missions on the behalf of the Alliance centered on the planet Jedha, and may have also participated in the battle on the planet Scarif.\nShara was a light-skinned human with brown hair and eyes.\nAs a rebel trooper, Shara wore the uniform of a soldier, which included an eared-hat with goggles and a small radio-esque device. Along with her blaster rifle, Shara carried a missile launcher into battle that could deal extensive damage to her targets.\nShara was created for the online browser video game Star Wars: Boots on the Ground, and was one of four playable characters—alongside Cassian Andor, K-2SO, and Borvo—that the player could use at the start of the game. Shara could be selected as a member of the player's squad and be taken on missions.\nGiven the freedom that the player has in creating their squad, there is no certainty as to what missions and battles in the game, if any, Shara actually participated in.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Soldier",
  "/wiki/Poe_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Rebel_trooper",
  "/wiki/Blaster_rifle",
  "/wiki/Missile_launcher",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/Jedha",
  "/wiki/Battle_of_Scarif",
  "/wiki/Scarif",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Boots_on_the_Ground",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/K-2SO",
  "/wiki/Borvo_(Human)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Rogue_One:_A_Star_Wars_Story"
 ]
}