{
 "name": "Shari",
 "display_name": "Shari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 21 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Shari was a human female who worked as a farmer at Kat Saka's farm on the planet Batuu. Her grandparents originally migrated to Batuu to escape after the Clone Wars came to an end. Months after the Hosnian Cataclysm, Shari harvested purple Surabat grain at the farm under the direction of her farmhand group's leader, Jac Lodain. When the smuggler Izal Garsea came to visit Batuu, Shari entreated her to stay.\nThe human Shari was born around 21 ABY and lived on the Outer Rim planet Batuu. Her grandparents originally migrated there to hide after the end of the Clone Wars. Months after the Hosnian Cataclysm of 34 ABY, Shari was employed at Kat Saka's farm on Batuu as a harvester of purple Surabat grain. She worked under the direction of her farmhand group's leader, Jac Lodain, alongside a Sullustan and a Gungan. When Julen Rakab, the group's former colleague, brought the smuggler Izal Garsea to the farm, Shari greeted Rakab warmly, inviting him to share the workers' extra topato stew, which he accepted.\nThe farmhand group was both intrigued that Garsea was between jobs and impressed that she owned her own starship, the light freighter Meridian. Shari and the Gungan entreated Garsea to stay at the farm, though Lodain rebuffed the suggestion smugly. Shari's face became red with anger at Lodain's belittlement of her grandparents' original migration to Batuu. Garsea calmed the argument and reassured Shari that she was grateful for her intentions. Shari's mood then brightened, and the group ate together. After their meal, Garsea entertained the workers by relating a tale of how her ship had run out of fuel and was saved by the Frinn Mak Traveling Circus.\nShari was a friendly, caring person who carried a good rapport with Julen Rakab. The smuggler Izal Garsea felt that Shari possessed an innocent and hopeful quality to her demeanor compared to herself. Shari became angered when Jac Lodain belittled her grandparents' original migration to Batuu, but Garsea was able to diffuse the argument and make all parties amiable again.\nShari had a round face with a small scar on one cheek. Her skin tone was one shade darker than Garsea's golden skin. While working at Kat Saka's farm, Shari kept her hair styled in two braids.\nShari appeared in A Crash of Fate, a 2019 young-adult novel written by Zoraida Córdova.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/21_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/File:LodainShari.ogg",
  "/wiki/Farmer",
  "/wiki/Saka_Homestead",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Parent",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Standard_month",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Color",
  "/wiki/Surabat_grain",
  "/wiki/Farm",
  "/wiki/Jac_Lodain",
  "/wiki/Smuggler",
  "/wiki/Izal_Garsea",
  "/wiki/File:ShariGungan.ogg",
  "/wiki/Reproduction",
  "/wiki/Outer_Rim_Territories",
  "/wiki/34_ABY",
  "/wiki/Unidentified_Sullustan_farmer",
  "/wiki/Unidentified_Gungan_farmer",
  "/wiki/Julen_Rakab",
  "/wiki/Topato_stew",
  "/wiki/Starship",
  "/wiki/Light_freighter",
  "/wiki/Meridian_(light_freighter)",
  "/wiki/Gungan",
  "/wiki/Foodstuff",
  "/wiki/Fuel",
  "/wiki/Frinn_Mak_Traveling_Circus",
  "/wiki/File:ShariRakab.ogg",
  "/wiki/Kat_Saka",
  "/wiki/Hair",
  "/wiki/Braid",
  "/wiki/A_Crash_of_Fate",
  "/wiki/2019",
  "/wiki/Zoraida_C%C3%B3rdova",
  "/wiki/Category:Audio_files_of_Shari",
  "/wiki/A_Crash_of_Fate_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year"
 ]
}