{
 "name": "Sharina Fizark",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Sharina Nal Fizark was a Human female whom Revan met in Anchorhead on Tatooine in the year 3956 BBY.\nSharina was married to a man named Ward Fizark, who was a former miner and soldier. During a hunting trip, he acquired a bone plate of a wraid which was worth five hundred credits at the time. Ward told Sharina to keep it and went off for another hunt, but disappeared. Guards of a Sandcrawler found his body stripped of everything. She believed that the Gamorreans Gurke, Narkal and Ugzak were behind his death as they laughed at her about Ward's death.\nBecause her family had spent everything on Ward's gear, she was desperate for money after his death. She went to the streets trying to sell her wraid skull plate so that she and her children could buy passage off world. She could not sell it to the Ithorian Fazza Utral because she lacked a hunter's license.\nAt some point during the Jedi Civil War, she met the amnesiac Revan. They discussed the wraid plate and her husband's death, and the former Dark Lord purchased the plate from her and gave her an additional two hundred credits.\nThe gift of additional two hundred credits to Sharina described above is optional , however this decision rewards light side points. If Juhani, Bastila Shan, Carth Onasi, Zaalbar, or Mission Vao are in the player's party at that time, they will make a comment on the Jedi ethics. Canderous Ordo and HK-47 do comment on the Jedi's decision, but do so in a negative manner.\nAlternatively, the player could convince Sharina to hand over the wraid plate so that it could be sold to Fazza. The outcome can still depend on the player's decision, even the canonical one.\nA non-canonical dark side option is to persuade Sharina to sell for half price. This offers dark side points, as it involves personal profit. Another dark-sided option is to take the plate from her by threats or via Force persuasion.\nThe player was originally supposed to be able to meet up with Sharina on Dantooine if they helped her on Tatooine, but this feature was cut from the game.\nThis content has since been restored as a mod .",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/3956_BBY",
  "/wiki/Ward_Fizark",
  "/wiki/Miner/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Wraid",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sandcrawler/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Gurke",
  "/wiki/Narkal",
  "/wiki/Ugzak",
  "/wiki/Death/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Fazza_Utral",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Juhani",
  "/wiki/Bastila_Shan",
  "/wiki/Carth_Onasi",
  "/wiki/Zaalbar",
  "/wiki/Mission_Vao",
  "/wiki/Jedi/Legends",
  "/wiki/Canderous_Ordo",
  "/wiki/HK-47",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}