{
 "name": "Shara",
 "display_name": "Shara",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Grey Squadron",
      "Grey Squadron",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Shara was a former bounty hunter who was inducted into Grey Squadron by Rahm Kota and fought with the Rebel Alliance against the Galactic Empire during the Galactic Civil War.\nShara was a bounty hunter before the Galactic Civil War, and was brought into Grey Squadron by Jedi Master Rahm Kota. During the course of the war she aided X2 in the battle of Yavin 4, in which she helped Rebel soldiers and personnel to evacuate the planet before the Empire could destroy them in revenge for the Battle of Yavin. Later on, at some point during the New Republic era, X2 discovered the location of his twin brother X1 on Vjun.\nShara participated in the Battle of Vjun alongside Grey Squadron, allowing Rebel troops to infiltrate Bast Castle and to stop the Imperial Remnant. X1, however, escaped the battle, fleeing to his cloning laboratory on Mustafar. Shara fought with Grey Squadron at the Battle of Mustafar, while X2 went to rescue the captured Luke Skywalker before he could be cloned by X1. At the climax of the battle, X2 defeated his twin brother, rescuing Skywalker and ending a threat to the nascent New Republic. Some time later, Shara and X2 became part of the New Republic with Luke Skywalker and the new galactic government.\nShara was originally created for the cancelled Star Wars: Battlefront III from Free Radical Design. She would instead go on to be used in the 2009 video game Star Wars Battlefront: Elite Squadron.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Draethos_(species)",
  "/wiki/Shara-Or",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Grey_Squadron",
  "/wiki/New_Republic/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/X2",
  "/wiki/Evacuation_of_Yavin",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Vjun/Legends",
  "/wiki/Battle_of_Vjun",
  "/wiki/Bast_Castle",
  "/wiki/Mustafar/Legends",
  "/wiki/Battle_of_Mustafar_(Galactic_Civil_War)",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Star_Wars:_Battlefront_III",
  "/wiki/Free_Radical_Design",
  "/wiki/2009",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Battlefront:_Elite_Squadron"
 ]
}