{
 "name": "Sharp",
 "display_name": "Sharp",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 22 BBY",
      "Khorm"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGrand Army of the Republic44th Special Operations DivisionDevil Dogs",
      "Grand Army of the Republic44th Special Operations DivisionDevil Dogs",
      "44th Special Operations DivisionDevil Dogs",
      "Devil Dogs"
     ]
    }
   ]
  }
 ],
 "content": "\"Sharp\" was the nickname of a clone trooper captain who served in the Devil Dogs unit of the 44th Special Operations Division.\nDuring the battle on the planet Mimban, he was hit by a blaster bolt in the throat. As a result, his voice became distorted. He later participated in the Battle of Khorm. During the battle, Sharp worked closely with Jedi Generals Kit Fisto and Plo Koon, whose views of upholding the ideals of the Galactic Republic in spite of the war clashed with those of Sharp and his unit, who felt that they did what was necessary to get the job done, regardless of moralizing.\nAs his unit specialized in demolitions, Sharp and his men accompanied Generals Fisto and Koon to destroy a Separatist climate-control base which was preventing Republic forces in orbit from sending reinforcements. Along the way, they were ambushed by Asajj Ventress and a unit of droids, wiping out most of Sharp's men and the explosives they had brought. General Koon came up with an alternate plan, however, to slice into the weather station's controls and aim a storm on the station itself. Sharp had his electronics specialist Fixer do so, directing a storm at the station and destroying it.\nWith the weather station out of the way, the main Separatist base could be attacked. While Plo Koon led a group to free a group of Khormai hostages within the base, Sharp accompanied General Fisto into the base to destroy the base's main defense guns. Entering through the large turret's barrel, Fisto and Sharp were able to enter the base though without an immediate plan to sabotage or destroy the guns before more droids arrived. Sharp came up with idea to use the gun's agrocite-fueled round to destroy the other cannons. He chose to personally ignite the round himself, sacrificing himself to knock out the guns while giving Fisto enough time to escape. He explained to the general that he wanted to go out like a Devil Dog - with a bang. The plan succeeded and the guns, as well as most of the base, were destroyed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sharp_(disambiguation)",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Khorm/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/44th_Special_Operations_Division",
  "/wiki/Devil_Dogs",
  "/wiki/Clone_trooper_captain",
  "/wiki/Battle_of_Mimban/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mimban/Legends",
  "/wiki/Battle_of_Khorm/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/General/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Fixer_(clone_trooper)",
  "/wiki/Khormai/Legends",
  "/wiki/Agrocite/Legends",
  "/wiki/The_Clone_Wars_7",
  "/wiki/The_Clone_Wars_8",
  "/wiki/The_Clone_Wars_9",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}