{
 "name": "Sharad_Hett",
 "display_name": "Sharad Hett",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Tusken Raiders"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Eeth Koth"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "A'Sharad Hett"
     ]
    }
   ]
  }
 ],
 "content": "Sharad Hett was a powerful male Human Jedi Knight who lived during the decades of relative peace prior to the Invasion of Naboo. A heroic and legendary figure in the pre-Clone Wars Galactic Republic, Hett was well known throughout the ranks of the Jedi Order. He eventually grew weary of his fame and, after a disaster that destroyed his homeworld and killed his family, exiled himself to Tatooine, where he became the warlord of a tribe of Tusken Raiders.\nHe sired a son, A'Sharad Hett, in this period, and continued to lead the Tuskens until the Jedi sent a representative to retrieve him—Ki-Adi-Mundi. During a war between the Tuskens and the Hutts of Tatooine, Aurra Sing killed Sharad Hett. Honoring the Jedi's final wish, Ki-Adi-Mundi took A'Sharad back to Coruscant as his Padawan. Many decades after Sharad's death, A'Sharad would fall to the dark side and become the infamous Darth Krayt, ruler of the One Sith.\nLike most members of the Jedi Order during the era, the Force-sensitive Sharad Hett was given over to the Jedi by his parents while he was still an infant. Born on a world in the Outer Rim, its name lost to history, Hett's parents willingly allowed their child to be taken for training, proud to be among those honored families who spawned a Jedi Knight.\nInducted into the academy at the Coruscant Jedi Temple, Sharad Hett was eventually chosen as the Padawan of Jedi Master Eeth Koth. Master Koth formed an intense bond with the dedicated and fearless young Hett, allowing him to keep in touch with his family and visit his homeworld; though his apprenticeship made it a rare treat. After years of training with Koth and constructing his own lightsaber, Hett was elevated to the rank of Jedi Knight. Quickly building a legacy that surpassed even his Master's renown, Hett acquired many names while he served as a Guardian, including Howlrunner, the Champion of Krmar, the Nemesis of Pirates, the Defender of Kamparus, the Hound of Worlds, the Tamer of Tyrants and the Nemesis of the Kimm.\nAt some point, Hett had become associated with Qui-Gon Jinn, whom he held in high esteem and dubbed as an \"old rascal.\"\nDespite his fame and prestige within the ranks of the Order, Hett grew weary, recognizing that the acclaim of his peers ran counter to the humility taught by the Jedi Code, and desired nothing else but to be with his family, whom he had all but lost contact with over the years. After completing another dangerous mission and arriving back at the Temple, Hett turned his back on the cheering crowds of his peers and sought out Master Koth. In a corridor of the Temple, Hett confessed his desire to leave the Order to the Zabrak. With a tearful goodbye, Master Koth accepted Hett's resignation and the Human departed from the Temple for the last time in 47 BBY.\nIn a tragic twist of events, the long-awaited reunion between Hett and his family would never occur. When Hett arrived on his homeworld, he returned to death and ruin. An alliance of offworld rivals had attacked his homeworld in the time he had been gone. Every major city on the planet was razed. Millions were killed—including every member of Sharad's family.\nGrief-stricken, Hett left the Republic forever, voluntarily exiling himself. He crash-landed on the world of Tatooine, where he eventually integrated himself with the local Tusken culture. He became a feared warlord of the Sand people, and taught them new ways of fighting. Further, Hett took a wife: K'Sheek, a Human woman who had been kidnapped and adopted into Tusken culture while still young. Together they had a son, A'Sharad, who Hett began to train in the ways of the Jedi.\nOver a decade had passed since the beginning of Hett's exile when Jabba the Hutt began to incite war between the Humans and Tuskens of Tatooine as a way to sell off his stock of antiquated blasters. Sharad Hett, seeing no other option, led the Tusken tribes in the war. He was able to prevent the worst of the atrocities from occurring, and minimized civilian casualties. Nevertheless, he became a feared figure amongst the non-Tuskens of Tatooine and footage of what appeared to be a lightsaber-wielding Tusken reached the Jedi Temple on Coruscant, where Hett's former colleagues were amazed to see that he still lived.\nThe Jedi High Council sent Master Ki-Adi-Mundi to bring back Hett- reasoning that Mundi was the only Jedi skilled enough to defeat the rogue Jedi in a duel who would not be tainted by memories of any past friendships. Mundi found both Hett as well as young A'Sharad, who rescued the Cerean from a krayt dragon. Hett had hoped that when the Council sent an emissary to find him, it would be Qui-Gon Jinn; he felt some anguish upon hearing of his murder. But despite giving Hett the surprising news of the reborn Sith threat, Mundi still could not convince his fellow Jedi to return to Coruscant. Hett believed his place was on Tatooine, with the Tuskens.\nEventually, due to intelligence gathered by the bounty hunter Aurra Sing, both Gardulla the Elder and Jabba launched a surprise assault on the main Tusken camp. As promised, Hett led his people into battle, but was confronted by Aurra Sing. The Tusken easily blocked the bounty hunter's attacks but a quick Dun Möch distraction gave Sing the opportunity she needed to plunge her lightsaber into his chest. Before dying, Hett made Ki-Adi-Mundi promise to accept his son, A'Sharad, into the Jedi Order, and to train him as his own Padawan; Ki-Adi-Mundi agreed. Hett's last words were to note that, while he had not known his own parents, he was honored to have known his son.\nIt was believed that Sharad Hett would have advanced to the level of Jedi Master if he had not imposed exile on himself. He was highly skilled at lightsaber combat and was able to easily fend off Aurra Sing. In fact Sing only managed to defeat him by using the Dun Möch technique. He was also skilled with the Force. In addition, Hett was an expert in harsh environmental survival tactics and this helped him when he lived with the Tusken Raiders. He successfully adapted to Tusken wildlife and the harsh desert.\nSharad Hett used a lightsaber during his career as a Jedi Knight, which was at his side even in self-imposed exile on Tatooine. Although the color of the blade could have varied during his time as a Jedi, the blade was crimson red in color during Sharad's time as a warlord.\nWhen a report reached the Jedi Temple in 32 BBY of a Tusken Raider wielding the lightsaber while leading a massive Tusken war band, the saber correlated to a historical holorecording of Sharad Hett. Due to Hett's fame, it was instantly recognizable to many Jedi including Grand Master Yoda and Eeth Koth, who trained him. It was this clue that led the Jedi to identify the Sand Person seen wielding it as Hett himself.\nBefore becoming one with the Force, Sharad Hett gave his lightsaber to his son, A'Sharad Hett, who would in turn wield it throughout the Clone Wars. However, decades later, A'Sharad Hett pledged himself to the Sith and became Darth Krayt, named after the krayt dragon on Tatooine. It is not known if the weapon was still in his possession at that time.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Great_ReSynchronization",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Eeth_Koth/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Ausar_Auset",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Death/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/One_Sith",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Champion_of_Krmar",
  "/wiki/Nemesis_of_Pirates",
  "/wiki/Defender_of_Kamparus",
  "/wiki/Hound_of_Worlds",
  "/wiki/Tamer_of_Tyrants",
  "/wiki/Nemesis_of_the_Kimm",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/47_BBY/Legends",
  "/wiki/K%27Sheek",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Sith/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Gardulla_Besadii_the_Elder/Legends",
  "/wiki/Dun_M%C3%B6ch/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Category:Images_of_Sharad_Hett",
  "/wiki/Star_Wars_(1998)_7",
  "/wiki/Star_Wars_(1998)_9",
  "/wiki/Star_Wars_(1998)_10",
  "/wiki/Star_Wars_(1998)_11",
  "/wiki/Star_Wars_(1998)_12",
  "/wiki/Star_Wars_(1998)_13",
  "/wiki/Star_Wars_(1998)_15",
  "/wiki/Star_Wars_(1998)_28",
  "/wiki/Star_Wars_(1998)_30",
  "/wiki/Star_Wars_(1998)_31",
  "/wiki/Republic_59",
  "/wiki/Republic_74",
  "/wiki/Kenobi_(novel)",
  "/wiki/Kenobi_(audiobook)",
  "/wiki/The_Life_and_Legend_of_Obi-Wan_Kenobi",
  "/wiki/Legacy_(2006)_15",
  "/wiki/Legacy_(2006)_16",
  "/wiki/Legacy_(2006)_18",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Around_the_Galaxy",
  "/wiki/Star_Wars_Galaxy_Collector_6",
  "/wiki/Star_Wars:_Power_of_the_Jedi",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_131",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Star_Wars_Fandex_Deluxe_Edition",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.5",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_26",
  "/wiki/Star_Wars_Insider",
  "/wiki/Mon_Mothma%27s_5_Facts",
  "/wiki/Star_Wars_Insider_135",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Republic:_Outlander",
  "/wiki/Power_of_the_Jedi_Sourcebook"
 ]
}