{
 "name": "Shaylai_Veila",
 "display_name": "Shaylai Veila",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Masters",
     "values": [
      "Kai Hudorra"
     ]
    }
   ]
  }
 ],
 "content": "Shaylai Veila was a female Rutian Twi'lek that served as a secretary to Jedi Master Kai Hudorra following his acquisition of The Lucky Twi'lek on Kestavel.\nWhen Dass Jennir, Beyghor Sahdett, and the crew of the Uhumele arrived at the casino in search of Hudorra, Veila walked in with an Ithorian ahead of the main group. She later opened the door to Hudorra's office, and was told not to let anyone disturb their private meeting.\nAfter Sahdett's betrayal, Veila helped clean up the bodies and debris. When Hudorra tried to force his remaining staff to flee in advance of the upcoming Imperial attack, Veila, along with Bryti, Kal, Dayn, and Nira, reaffirmed their loyalty to the Jedi Master, refusing to abandon him. She and Kal later helped seal the casino entranceway with concrete. The Twi'lek sat at Hudorra's right side during a final feast, where the Bothan told everyone that only he and Jennir would be staying.\nLater, as Vader and his stormtroopers marched across the bridge to the casino, Veila was already aboard the Uhumele and watched Kal catch the ziplining Greenbark, the last crewmember to evacuate. She noted that they better inside quickly, before the fog creatures discovered them. Veila would later be witness to Hudorra's final message, recorded on a holodisc given to Jennir by Bryti, wishing that the Force be with her.\nThe Twi'lek is referred to by Hudorra twice, first as \"Veila\", then as \"Shaylai\". Which name is her first and last is conjectural; this article uses Veila as the latter as it is a known surname in-universe.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kai_Hudorra",
  "/wiki/Rutian/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/The_Lucky_Twi%27lek",
  "/wiki/Kestavel",
  "/wiki/Dass_Jennir",
  "/wiki/Beyghor_Sahdett",
  "/wiki/Uhumele",
  "/wiki/Ithorian/Legends",
  "/wiki/Duel_on_Kestavel",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bryti",
  "/wiki/Kal_(bodyguard)",
  "/wiki/Dayn",
  "/wiki/Nira",
  "/wiki/Concrete/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Fog_creature",
  "/wiki/Holodisc",
  "/wiki/May_the_Force_be_with_you/Legends",
  "/wiki/Veila_family",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_2",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_4",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_5"
 ]
}