{
 "name": "Shayla_Paige-Tarkin",
 "display_name": "Shayla Paige-Tarkin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Eriadu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tarkin family",
      "Galactic Republic",
      "Galactic Senate",
      "Loyalists",
      "Galactic Senate",
      "Loyalists",
      "Loyalists"
     ]
    }
   ]
  }
 ],
 "content": "Shayla Paige-Tarkin was a Human female who became senator of the Seswenna sector at some point following the Eriadu Trade Summit in 32.5 BBY. An adamant supporter of Supreme Chancellor Palpatine, leader of the Galactic Republic, Paige-Tarkin remained loyal to the government during the Separatist Crisis. In 22 BBY, the Crisis turned into a galactic-wide armed conflict known as the Clone Wars. During this conflict, Paige-Tarkin was the target of an attempted kidnapping that was thwarted by the clone trooper commander Fox.\nShayla Paige-Tarkin was a member of the Tarkin family, a powerful clan of Humans from the planet of Eriadu, an important trade center of the Outer Rim Territories. At some point after the Eriadu Trade Summit in 32.5 BBY, Paige-Tarkin ascended to the position of senator of her native Seswenna sector in the Galactic Senate, succeeding a dark-complexioned Eriaduan male.\nAround the year 22 BBY, the Galactic Republic faced new political turmoil with the Separatist Crisis. A loose affiliation of planets and conglomerates who wished to leave the Republic had formed the Confederacy of Independent Systems—or CIS for short—under the guidance of the former Jedi Master Dooku. In the first month of 22 BBY, the Sluissi Senator Corlissi Ludar announced the secession of his sector from the Republic. In reaction, Paige-Tarkin was quick to assert Seswenna's loyalty to the government. In her statements, she made clear her contempt for the lawlessness of other Outer Rim worlds that had joined the CIS. She even added that her people would not hesitate to take arms if Seswenna's worlds became the front line in a hypothetical war. Paige-Tarkin's strong words were published in CoCo District's edition of the HoloNet News.\nTwo months later, the Clone Wars erupted, with the brand new Grand Army of the Republic and the Jedi Order fighting the Separatists. As an unabashed follower of Supreme Chancellor Palpatine, leader of the Republic, Senator Paige-Takin sided with the Loyalists during the conflict. Totally unaware of the Chancellor's Sith alter ego as Darth Sidious, she considered him a savior of the Republic and a role model. As the war dragged on, Paige-Tarkin became worried about Palpatine's health. She was delighted when the Chancellor called upon her, along with Senator Jannie Ha'Nook from Glithnos and others, to support him during the conflict on Praesitlyn, a world close to the border of the Seswenna sector.\nLater during the Clone Wars, Dooku offered a generous live bounty on each Republican senator captured, and Paige-Tarkin was nearly caught in the nets of T'doshok, a Trandoshan bounty hunter who tried to abduct her on Coruscant. However, the bounty hunter was arrested by Commander Fox, who was the clone trooper in charge of the Coruscant Guard at the time, and Paige-Tarkin remained safe.\nUnlike greedy delegates who used their senatorial status to indulge their every whim—like Orn Free Taa of Ryloth, Shayla Paige-Tarkin genuinely cared for the fate of her sector. When Palpatine told her a Trade Federation invasion force had taken Praesitlyn, a planet that was close to the Seswenna sector, Paige-Tarkin gasped in awe.\nHer admiration for Palpatine was equally sincere. Paige-Tarkin noticed how the Chancellor looked increasingly tired and weary as the Clone Wars went on, and she feared for his health. Paige-Tarkin also expressed her feelings quite openly. She would often speak on impulse, with her voice reflecting her emotions, and she even used expletives such as \"Great balls of fire!\"\nShayla Paige-Tarkin was first mentioned on March 28, 2002 in the forty-ninth issue of the HoloNet News website—a promotional in-universe tie-in published shortly before the release of Star Wars: Episode II Attack of the Clones. She made her first real appearance two years later in Jedi Trial, a 2004 Clone Wars-related novel written by David Sherman and Dan Cragg. In 2008, she received a very brief mention in Out Foxed, a short story by Rob Valois, and was given an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tarkin_(disambiguation)",
  "/wiki/Eriadu/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tarkin_family/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Loyalist/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Seswenna_sector/Legends",
  "/wiki/Eriadu_Trade_Summit",
  "/wiki/33_BBY/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-1010/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Unidentified_Eriaduan_senator",
  "/wiki/Standard_year/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Sluissi",
  "/wiki/Corlissi_Ludar",
  "/wiki/Sluis_sector/Legends",
  "/wiki/HoloNet_News_CoCo_District_Edition",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Jannie_Ha%27Nook",
  "/wiki/Glithnos",
  "/wiki/Battle_of_Praesitlyn",
  "/wiki/Praesitlyn",
  "/wiki/Sector/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/T%27doshok_(bounty_hunter)",
  "/wiki/Trandoshan/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Coruscant_Guard/Legends",
  "/wiki/Time/Legends",
  "/wiki/Orn_Free_Taa/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Fire/Legends",
  "/wiki/March_28",
  "/wiki/2002",
  "/wiki/HoloNet_News_Vol._531_49",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/In-universe",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Jedi_Trial",
  "/wiki/2004",
  "/wiki/David_Sherman",
  "/wiki/Dan_Cragg",
  "/wiki/2008",
  "/wiki/Out_Foxed",
  "/wiki/Rob_Valois",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Militaries_of_Star_Wars",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Species/Legends",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Cloak_of_Deception",
  "/wiki/Great_ReSynchronization",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Template:YearMathGRS",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide"
 ]
}