{
 "name": "Shazeen",
 "display_name": "Shazeen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dellalt"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Swimmer"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Near-Black"
     ]
    }
   ]
  }
 ],
 "content": "Shazeen was a large, one-eyed male of the sauropteroid Swimming People of Dellalt who served for a time as \"Top Bull\" of a pack of Swimmers on the Tion Hegemony world of Dellalt. Battle-scarred and weathered, Shazeen fended off all challengers for years, losing his left eye in one scrape, before tiring of being Top Bull and retiring north to warmer waters. His title passed to his wild and hotheaded nephew Kasarax, who started a lucrative racket charging exorbitant fees to land-dwellers for passage across their lake. Kasarax's improprieties disgusted Shazeen, prompting his return around 1 BBY.\nIn order to challenge his nephew's dominance, Shazeen agreed to transport an offworld group led by Corellian smuggler Han Solo, leading to a heated right-of-way dispute between Shazeen and his supporters and Kasarax's gang. The disagreement culminated in a one-on-one fight between uncle and nephew, which the more experienced Shazeen won by outwitting and outsmarting his younger foe. The defeat led to the downfall of Kasarax's racket and the dissolution of his large shore gang.\nKasarax first appeared in Han Solo and the Lost Legacy, a novel written by Brian Daley and released in 1980.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dellalt/Legends",
  "/wiki/Swimming_People_of_Dellalt",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Tion_Hegemony/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kasarax",
  "/wiki/1_BBY/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Han_Solo_and_the_Lost_Legacy",
  "/wiki/Brian_Daley",
  "/wiki/1980",
  "/wiki/A_Guide_to_the_Star_Wars_Universe",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}