{
 "name": "Sheb_Valaad",
 "display_name": "Sheb Valaad",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Koorivar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Sheb Valaad was a Koorivar merchant on Otor's Hub during the Clone Wars. Sheb specialized in trading the goods of people who had met \"unpleasant fates.\" While Valaad usually waited for those makers to die, he sometimes had them killed. He had several employees including the protocol droid Blue, a Twi'lek assistant, the Gamorrean guard Thurg, and several bodyguards including a Rodian and an Aqualish. Following the Separatist attack on Mahranee, he was visited by the undercover Kiffar Jedi Master Quinlan Vos  and the Mahran Akar-Deshu  who assaulted him and his men. Vos knocked him unconscious before leaving Sheb and his men to be picked up by other Jedi.\nThe Koorivar merchant Sheb Valaad established a black market operation on Otor's Hub a standard year before the outbreak of the Clone Wars. Sheb's business specialized in the sale of trinkets like jewels, paintings, statues, and fancy hookah pipes to both the Galactic Republic and the Confederacy of Independent Systems. While Sheb usually obtained his merchandise by waiting for their original makers to meet \"unpleasant fates,\" he sometimes sent assassins to kill them. To help run his business, Sheb employed the services of the obsequious protocol droid Blue and several thugs including the Gamorrean Thurg.\nSheb's activities eventually attracted the attention of the Jedi Order, who sent Master Quinlan Vos to spy on him. Posing as a Kiffar buyer named \"Master Tal Khar\", Vos regularly visited Sheb's shop to gain Sheb's trust. Tal became such a regular visitor that Sheb instructed Thurg to let him in unhindered. After exchanging pleasantries with Blue, Sheb showed Tal one of his latest finds: a small statuette of an aquatic creature. While Tal was inspecting the object, Thurg entered the room dragging another visitor, the Mahran Jedi Knight Akar-Deshu , who was dwarfed by the bulky Gamorrean. Desh had been sent by the Jedi High Council to bring back Vos for a sensitive mission to assassinate Count Dooku.\nTal  had not been expecting Desh and realized that his cover was about to be blown. After putting back the statuette, Tal used the Force to levitate Sheb in the air, causing the merchant to squirm. Desh then used his Force powers to break Thurg's grip and to flip the Gamorrean over. As Blue rushed to the door, several armed bodyguards including a Rodian charged at Tal. Despite Sheb's pleas that they not damage his merchandise, the body guards opened fire on the intruders. For the duration of the gun battle, Sheb remained dangling in the air and a stray blaster bolt seared one of his robes.\nWhen Vos and Desh drew their lightsabers, Sheb quickly realized that the intruders were Jedi. The two Jedi overpowered Sheb's guards and sliced the hand of Blue's wrist when the protocol droid tried to call for reinforcements with a comlink. While Tal was annoyed that Desh had prematurely disrupted his undercover operation, he was mollified that Sheb had inadvertently revealed his other contacts to him. Vos had also been able to identify the owners of some of Sheb's merchandise through his psychometric powers. Before leaving with Desh, Vos used the Force to hurl Sheb, who was still hanging in the air, against a wall; effectively knocking him unconscious. Sheb was subsequently arrested by other Jedi personnel.\nSheb Valaad was a vain and avaricious merchant who was solely concerned with making profits. He profited from selling many high-quality valuables and artifacts which had been wrongfully-taken from makers who had died. Occasionally, Sheb was willing to have these makers killed \"directly\" so that he could obtain their works. To boost his own ego and self-esteem, Sheb had his protocol droid Blue programmed with two specialized programs \"Adul-8\" and \"B-Little\" to soothe and entertain him respectively.\nLike his father, Sheb took pride in his horn and decorated it with ornate carvings. While Sheb saw himself as a \"powerful friend\" who sold luxurious goods to both the Republic and the Separatists, Vos and Desh regarded him as a war profiteer who had to be punished for his crimes. Sheb also smoked a hookah pipe and enjoyed eating delicate pastries that were prepared by his own private chef.\nSheb Valaad first debuted as a minor antagonist in Christie Golden's 2015 novel Dark Disciple, which was based on eight unproduced screenplays from the canceled Cartoon Network TV series Star Wars: The Clone Wars. Dark Disciple is part of the Canon The Clone Wars Legacy, an ongoing multimedia project using material from the canceled TV series. He was given a point-of-view passage in the book's second chapter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Koorivar",
  "/wiki/Gender",
  "/wiki/Merchant",
  "/wiki/Otor%27s_Hub",
  "/wiki/Clone_Wars",
  "/wiki/Protocol_droid",
  "/wiki/Blue_(protocol_droid)",
  "/wiki/Twi%27lek",
  "/wiki/Gamorrean",
  "/wiki/Thurg",
  "/wiki/Rodian",
  "/wiki/Aqualish",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Atrocity_on_Mahranee",
  "/wiki/Mahranee",
  "/wiki/Kiffar",
  "/wiki/Jedi_Master",
  "/wiki/Quinlan_Vos",
  "/wiki/Mahran",
  "/wiki/Akar-Deshu",
  "/wiki/Black_market",
  "/wiki/Standard_year",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Painting",
  "/wiki/Galactic_Republic",
  "/wiki/Assassin",
  "/wiki/Death",
  "/wiki/Jedi_Order",
  "/wiki/Tal_Khar",
  "/wiki/Unidentified_mammal_statuette",
  "/wiki/Water",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_High_Council",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Force_power",
  "/wiki/Blaster",
  "/wiki/Robe",
  "/wiki/Lightsaber",
  "/wiki/Jedi",
  "/wiki/Droid",
  "/wiki/Comlink",
  "/wiki/Psychometry",
  "/wiki/Adul-8",
  "/wiki/B-Little",
  "/wiki/Sheb_Valaad%27s_father",
  "/wiki/Chef",
  "/wiki/Christie_Golden",
  "/wiki/2015",
  "/wiki/Dark_Disciple",
  "/wiki/Cartoon_Network",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars_Legacy",
  "/wiki/Star_Wars_Insider",
  "/wiki/Kindred_Spirits",
  "/wiki/Star_Wars_Insider_159",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld"
 ]
}