{
 "name": "Sheeka Tull's sister",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Atrivis 7"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Sheeka Tull's sister was a Human woman who lived on the Outer Rim Territories planet Atrivis 7 in the later years of the Galactic Republic. Along with her sister, Sheeka Tull, she was orphaned during a range war on the planet. She later joined a religious sect on Devon Four, but when the sect was embargoed for not paying taxes, she almost died from a plague at the colony until her sister smuggled in medical supplies. Following that incident, she moved to a new planet and raised a family.\nA Human woman was the daughter of Sheevis Tull and grew up on Atrivis 7, a planet in the Atrivis sector of the Outer Rim Territories in the years prior to the outbreak of the Clone Wars. She, along with her sister Sheeka, was orphaned during a range war on the planet. The sisters later separated when she left Atrivis 7 and joined a religious sect on the planet Devon Four. During the latter years of the Galactic Republic, the sect stopped paying taxes, and consequently the planet was placed under an embargo by Coruscant. That almost destroyed the colony when a plague struck the planet; the inability to import medicines from off-world threatened to result in the death of every member of the sect, including Sheeka's sister. That fate was only averted when Sheeka smuggled medicine onto the planet. Following that incident, Sheeka's sister left the sect and moved elsewhere in the Outer Rim, eventually raising a family with a number of children.\nAs a result of smuggling in the medicine, her sister was placed on a Republic blacklist, and later coerced into helping the Republic forces on Ord Cestus instead of serving ten years on a labor world.\nThe Human woman was religious, as evidenced by her joining a sect on Devon Four. She had strong ties with her sister, Sheeka, who broke the law in order to save her life; despite the smuggling later exposing her to danger in the lead up to the Clone Wars, Sheeka never regretted saving her sister.\nThe woman was created by Steven Barnes for his novel The Cestus Deception , as part of the backstory of Sheeka Tull, providing the motivation for her aid of the Republic forces.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Atrivis_7",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sheeka_Tull",
  "/wiki/The_Cestus_Deception",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Devon_Four",
  "/wiki/Death/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Sheevis_Tull",
  "/wiki/Atrivis_sector/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Ord_Cestus/Legends",
  "/wiki/CT-96/298",
  "/wiki/Steven_Barnes",
  "/wiki/2004"
 ]
}