{
 "name": "Sheel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wyrd"
     ]
    }
   ]
  }
 ],
 "content": "Sheel was a Tarasin female member of the Wyrd Force witch coven who lived during the time of the Clone Wars. Around 20 BBY, Sheel was sent to meet with the Confederacy of Independent Systems regarding a plot to discredit the Jedi Order. She boarded a Confederate corvette to conduct the negotiations, but the warship was severely damaged in an attack in the Ando system by the forces of the Galactic Republic. Sheel attempted to flee the crippled corvette by hijacking the starship of a group of freelance agents. However, she was defeated by the operatives and was unsuccessful at escaping.\nSheel was a Force-sensitive Tarasin female who lived during the time of the Clone Wars. She served as a member of the Wyrd, a coven of Tarasin dark side Force witches active on the planet Cularin and she eventually became a powerful Wyrd adept. Around 21 BBY, Sheel was among a group of Wyrd members who took up residence at an enclave on the slopes of the dormant Cularin volcano Cloud Mountain under the command of the Wyrd lieutenant Xinishia. She was among several witches that utilized the Hand artifact, an ancient dark side relic that could be used to consume the life forces of victims placed within it to enhance the strength of the artifact's users. Whilst operating the Hand artifact, Sheel encountered the heroes of Cularin, a group of freelance agents who had ventured to Cloud Mountain to free the Wookiee Chywarra from the captivity with the Wyrd.\nCirca 20 BBY, Sheel traveled to the Ando system in the Lambda sector to represent the Wyrd at a diplomatic meeting with the Thaereian military envoy Gura Tran and representatives of the Confederacy of Independent Systems government aboard a Confederate CR90 corvette. Sheel worked closely with Tran during the meeting, who was secretly a spy for the Believers Sith cult with which the Wyrd had close links. During the summit, Sheel and Tran advocated a plan to discredit the Jedi Order, a leading order of Force users, and the self-government political movement opposing the presence of the Thaereian military in the Cularin system, by falsely implicating both groups in having dealings with the Confederacy. Though the captain of the Confederate corvette was aware of the purpose of Sheel and Tran's visit to the vessel, the Wyrd witch and Believer spy kept to themselves and others among the crew including the ship's second-in-command Lieutenant Rame Cartroll had little awareness of who their passengers were and why they were there.\nBefore Sheel and Tran could conclude their negotiations with the Confederacy, the corvette was bombarded by a task force of the Galactic Republic, a government opposed to the Confederacy. The majority of those on the vessel were killed and Sheel was among the few aboard left alive. The attacking Republic forces subsequently dispatched the heroes of Cularin to scour the stricken warship for survivors and to gather intelligence. Sheel determined to escape the corvette and planned to make her way a Confederacy of Independent Systems base sited on a nearby planetoid, from which she could then make her return to Cularin. Lacking the skills to pilot a starship on her own, she attempted to capture one of the heroes of Cularin and thereby force the freelance operatives to fly her to safety in their vessel. However, she was defeated by the agents and was unsuccessful in escaping the crippled corvette.\nSheel was a militant supporter of the Wyrd's ideology, holding a fanatical dislike of non-Tarasin offworlders on Cularin and of the Jedi. She was committed to assisting the witches in gaining dominance in the Cularin system and regarded the Believers as fitting allies for the Wyrd due to two groups' shared hatred of the Jedi and the Believers' devotion to the dark side. She further considered that the Wyrd could eliminate the Believers once the witches no longer had she need for them. Sheel also believed that supporting the Thaereian military would benefit the Wyrd because she predicted that the Thaereians could bring war and disorder to the Cularin system, conditions under which the Wyrd could rise to power. After becoming stranded on the damaged Confederate corvette in the Ando system, Sheel became bent on escaping from the the ship to return to the Cularin system, though determined to make her death worthwhile if she could not make it off of the vessel.\nAs a Tarasin, Sheel a frill around her neck and was capable of altering the color of her skin. While on her assignment to the Ando system she was armed with a blaster pistol and a spear and also carried a dark side talisman.\nAs a result of her innate abilities as a Tarasin and her capacity for changing her skin color, Sheel was adept at hiding and moving silently. She was also proficient in the use of the Force to sense things, to move at speed, to heal herself, to grip things and to influence the minds of others. Sheel could additionally wield the power See Force and use the Force to dissipate energy and strike her enemies with lightning.\nSheel was created by Ronald A. Heintz and appeared in Decision: Almas, a 2004 roleplaying adventure set within Star Wars Legends continuity that served as the first part of the Decisions trilogy of the Living Force roleplaying campaign. In the adventure, the players roleplay as the freelance agents that Sheel encounters aboard the damaged Confederate corvette. If any of the player characters are Tarasin it is possible for Rame Cartroll to make the freelance agents aware that an envoy of the same species, being Sheel, had visited the wrecked starship. If the players are in the lower or middle Star Wars Roleplaying Game experience tiers, Sheel is a novice Wyrd acolyte during her encounter with them, whereas if the players are in the higher or upper tiers she is an experienced Wyrd adept. Players in the higher and upper tiers who also roleplayed the 2003 Living Force module From the Trees recognize her as one of the Wyrd members operating the Hand artifact at Cloud Mountain that the player characters encounter during the events of that adventure. This is not possible for players of Decision: Almas in the lower or middle tiers who encounter Sheel as an acolyte because all of the Wyrd members that featured in From the Trees were experienced Wyrd adepts and not mere novices.\nIn Decision: Almas, Sheel's encounter with the heroes of Cularin can play out in a number of different ways. She either hides on the starship upon which the player characters traveled to the corvette to await their return or tries to directly capture one of the freelance agents to force into piloting the vessel for her. If the player characters' ship is not directly connected to the damaged Confederate corvette it is possible for Sheel to steal an EVA suit and breath mask to enable her to access the freelance agents' vessel. When Sheel fights the freelance agents, she continues her attack until she is killed or rendered unconscious. If she is captured by the player characters, Sheel is imprisoned by the Republic task force that assaulted the Confederate warship and kept in isolation until being transferred into the custody of the Jedi.\nIt is also possible, in the event that the players of Decision: Almas do not have time for a separate combat encounter with Sheel, that she does not try to get the freelance agents to fly her safety. She instead ambushes the player characters alongside Gura Tran and the droid Solenoid in a separate effort aboard the stricken corvette to steal the freelance agents' ship. The Force powers that Sheel can use vary depending upon the experience tier of the player characters; only if the players are in the middle, higher or upper roleplaying tiers can she use the Force to sense things and only if the players are in the higher or upper tiers can she use the Force to heal herself and dissipate energy. Additionally, only if the player are in the upper tier can she use the Force to move at speed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Wyrd",
  "/wiki/The_Force/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Coven/Legends",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Unidentified_Separatist_CR90_corvette",
  "/wiki/Warship/Legends",
  "/wiki/Mission_to_the_Ando_system",
  "/wiki/Ando_system/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Decision:_Almas",
  "/wiki/Canon",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Cloud_Mountain_Wyrd_enclave",
  "/wiki/Volcano/Legends",
  "/wiki/Cloud_Mountain",
  "/wiki/Lieutenant/Legends",
  "/wiki/Xinishia",
  "/wiki/Hand_artifact",
  "/wiki/Dark_side_artifact",
  "/wiki/Wookiee/Legends",
  "/wiki/Chywarra",
  "/wiki/Lambda_sector/Legends",
  "/wiki/Thaereian_military",
  "/wiki/Envoy/Legends",
  "/wiki/Gura_Tran",
  "/wiki/Spy/Legends",
  "/wiki/Believers",
  "/wiki/Sith_cult/Legends",
  "/wiki/Cularin_system",
  "/wiki/Captain/Legends",
  "/wiki/Rame_Cartroll",
  "/wiki/Strike_Force_Cularin",
  "/wiki/Death/Legends",
  "/wiki/Separatist_Ando_system_base",
  "/wiki/Unidentified_Ando_system_planetoid",
  "/wiki/Pilot/Legends",
  "/wiki/Color/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Spear/Legends",
  "/wiki/Force_talisman",
  "/wiki/Force_sense/Legends",
  "/wiki/Force_speed",
  "/wiki/Force_healing/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Sense_Force",
  "/wiki/Tutaminis",
  "/wiki/Force_lightning/Legends",
  "/wiki/Ronald_A._Heintz",
  "/wiki/2004",
  "/wiki/Roleplaying_game",
  "/wiki/Decisions_trilogy",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/2003",
  "/wiki/From_the_Trees",
  "/wiki/Enviro-suit",
  "/wiki/Breath_mask/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Solenoid",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Night%27s_Homecoming",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion"
 ]
}