{
 "name": "Shell_(Alderaanian)",
 "display_name": "Shell  (Alderaanian)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Shell was a Human male from Alderaan. When his homeworld was destroyed by the first Death Star, both of Shell's parents were killed and he became an orphan. His grandmother took him in but died shortly due to the shock. Shell was eventually cared for by the many refugee Alderaanians who settled on the planet Delaya.\nShell was a Human male who lived on the planet Alderaan during the time of the Galactic Civil War. He was visiting his grandmother on Delaya when the Empire destroyed Alderaan with the first Death Star. Due to the shock, his grandmother died shortly after, leaving him an orphan. He was taken in by the rest of the Alderaanian refugees who settled on Delaya, and looked after particularly by Halle Dray and J'er Nahj.\nWhen Princess Leia Organa made a visit to Delaya to assist the refugee effort and recruit new members to the Rebel Alliance, Shell was ordered by Nahj and the other refugees to lure Organa away from Delaya's government officials, in order to kidnap her then show the poor housing and conditions the refugees are being subjected to. Shell pretended to be lost and elicited sympathy from Organa. However, it was Luke Skywalker who accompanied him to his home and was the one taken by Nahj' men. Later, he apologized to Skywalker for lying to him, an apology the rebel pilot accepted.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Shell_Hutts",
  "/wiki/Gender/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death/Legends",
  "/wiki/Shell%27s_grandmother",
  "/wiki/Alderaanian/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Delaya/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Halle_Dray",
  "/wiki/J%27er_Nahj",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Rebel_Force:_Hostage"
 ]
}