{
 "name": "Sheltay_Retrac",
 "display_name": "Sheltay Retrac",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Alderaanian delegation",
      "Alderaanian delegation"
     ]
    }
   ]
  }
 ],
 "content": "Sheltay Retrac was a human female from the planet Alderaan. Born to Alderaanian nobility, she served as the head of Senator Bail Organa's team of aides in the Alderaanian delegation of the Galactic Republic's Senate during the Clone Wars. In 19 BBY, she walked through a corridor of Organa's consular ship, the Tantive III, with the senator while he spoke about aiding members of the Jedi Order following the Republic's recent issuing of Order 66, which declared the Jedi traitors.\nSheltay Retrac was a human female who was a child of Alderaanian nobility from the planet Alderaan. During the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, she served as the head of Senator Bail Organa's team of aides, working alongside fellow aides Agrippa Aldrete and Sateen Vestswe. Organa was a member of the Alderaanian delegation in the Republic's Galactic Senate and also part of the Delegation of 2,000, which meant Retrac and his other aides needed to be loyal and willing to keep many secrets for him during such dangerous times.\nIn 19 BBY, the Republic issued Order 66, which declared members of the Jedi Order traitors and led to many of them being executed. Organa was keen to aide those Jedi who still lived, and after his consular starship, the Tantive III, took from from the planet Coruscant, he walked down one of the ships corridors towards the bridge with Retrac, Vestswe, and Captain Raymus Antilles while saying that they had to try and intercept any Jedi who had not yet been killed. Organa then successfully helped Jedi Master Obi-Wan Kenobi and Grand Master Yoda survive.\nRetrac had tan skin, brown eyes, and brown hair.\nRetrac preferred simple white robes, and while on the Tantive III, she wore a cream dress and matching cape with a silver headpiece. She wore a Kueget LN-21 blaster pistol on her right hip and also carried a stun blaster for if she ever had to defend herself or Organa.\nSheltay Retrac was portrayed by Caroline de Souza Correa in the prequel trilogy film Star Wars: Episode III Revenge of the Sith, which was released on May 16, 2005. The actress filmed for four days, with the scene aboard the Tantive III being filmed on Stage 7 at Fox Studios, Sydney on July 24, 2003. She also filmed an additional scene that was ultimately cut in which she, Organa, and Vestswe are stopped by two Senate Guards.\nRetrac's dress, designed by art director of visual effects Warren Fu, was originally meant for Senator Padmé Amidala to reflect her white Geonosis costume and Princess Leia Organa's diplomatic costume. However, the design was rejected for Amidala as her clothing needed to conceal her pregnancy and it was instead reassigned to Retrac.\nIn the current Star Wars canon, Retrac was first identified in the 2017 reference book Star Wars: The Visual Encyclopedia. In the Star Wars Legends continuity, the character was first mentioned prior to the release of Episode III in the reference book Star Wars: Revenge of the Sith: The Visual Dictionary, which was written by James Luceno and released on April 2, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sheltay_Retrac",
  "/wiki/Sheltay_Retrac/Legends",
  "/wiki/Alderaan",
  "/wiki/Human",
  "/wiki/Alderaanian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Alderaanian_delegation",
  "/wiki/Planet",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Aide",
  "/wiki/Galactic_Senate",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY",
  "/wiki/Starship",
  "/wiki/Tantive_III",
  "/wiki/Jedi_Order",
  "/wiki/Order_66",
  "/wiki/Jedi",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Agrippa_Aldrete",
  "/wiki/Sateen_Vestswe",
  "/wiki/Delegation_of_2,000",
  "/wiki/Time",
  "/wiki/Death",
  "/wiki/Coruscant",
  "/wiki/Bridge_(starship)",
  "/wiki/Captain",
  "/wiki/Raymus_Antilles",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Cloak",
  "/wiki/Kueget_LN-21_blaster_pistol",
  "/wiki/Stun_blaster",
  "/wiki/Caroline_de_Souza_Correa",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/May_16",
  "/wiki/2005",
  "/wiki/Fox_Studios,_Sydney",
  "/wiki/July_24",
  "/wiki/2003",
  "/wiki/Senate_Guard",
  "/wiki/Warren_Fu",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Geonosis",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Reproduction",
  "/wiki/Star_Wars",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Revenge_of_the_Sith:_The_Visual_Dictionary",
  "/wiki/James_Luceno",
  "/wiki/April_2",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Category:Images_of_Sheltay_Retrac",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/TheForce.net",
  "/wiki/May_24",
  "/wiki/July_30",
  "/wiki/2022",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Star_Wars_Episode_III:_Revenge_of_the_Sith"
 ]
}