{
 "name": "Shelish",
 "display_name": "Shelish",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Nightsisters"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Nightsisters"
     ]
    }
   ]
  }
 ],
 "content": "Shelish was a female Dathomirian and a Nightsister. She left her homeworld of Dathomir when she was young. Consequently, she survived the slaughter of her sisters by General Grievous during the Clone Wars. By the time of the Iron Blockade, Shelish lived in a hut, on the swamps of Jhas Krill, the eleventh moon of Jhas, in the Anoat sector. She was accompanied by a Wookiee named Owacchi, a former pirate who had been betrayed by his associates. She was also the mother of Deathstick, leader of the secret society of assassins known as the Kouhun. At several points, however, Shelish did go back to Dathomir, searching for clues about the fate of her sisters.\nThroughout the discussions she had with the Smuggler when the latter pursued to learn dark-side powers, she implied that she knew a great deal about the Kouhun and their initiation rituals. Shelish also claimed to the Smuggler that Deathstick and the Kouhun served her purposes, despite their divergence.\nNightsister Shelish was a recluse, gifted in the Force powers she described by the name \"magick,\" which she further elaborated to be a form of art of the Nightsisters. She was able to conjure illusory dreams, cast shadows and Force lightning, confuse unwary opponents, place empowering enchantments upon others to bring forth their Force powers, and sense the \"magick\" of various worlds among a myriad of other various powers. She was skilled in melee combat, preferring a long blade. She was ready to teach magick to gifted individuals in return that they would serve her and her intentions that she claimed would outlive even her, but would question those who insisted taking her powers lightly.\nShelish did not realize when people used humor to stave off fear. Sometimes she was eager slipping to share small pieces of information about her past life and relationships once someone had shown their worth and earned her trust enough. Shelish was knowledgeable about the fate that had befallen her homeworld and seemed to care and repent that she would not see her world and the Nightsisters of Dathomir in their original prosperity ever again.\nShelish showed a level of affection to specific individuals like her daughter Deathstick, calling her special; and Owacchi, her rescued Wookiee companion, as she wanted to help him take care of the Starhowl Pirates that were after him to end his life. Shelish was disgusted and vengeful at the pirate crew's murderous and vile crimes, and wanted to incapacitate them. When the Smuggler took care of the pirates for her and Owacchi, she abruptly claimed they were not her concern, implying some levels of manipulative personality.\nShelish first appeared in the 2015 mobile game Star Wars: Uprising, by Kabam, in which she was voiced by Kari Washington. She was designed by Kate Burgess and modelled by Jay Doherty. Burgess liked working on Shelish, because she saw it as a rare opportunity to design an older female in a game and a character who \"falls outside the traditional mold of heroes/villains .\" The witch's distinctive hairstyle was inspired by fiddlehead greens.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dathomir",
  "/wiki/Zabrak",
  "/wiki/Dathomirian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nightsisters",
  "/wiki/Homeworld",
  "/wiki/Battle_of_Dathomir",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Clone_Wars",
  "/wiki/Iron_Blockade",
  "/wiki/Swamp",
  "/wiki/Jhas_Krill",
  "/wiki/Moon",
  "/wiki/Jhas",
  "/wiki/Anoat_sector",
  "/wiki/Wookiee",
  "/wiki/Owacchi",
  "/wiki/Pirate",
  "/wiki/Parent",
  "/wiki/Deathstick",
  "/wiki/Assassin",
  "/wiki/Kouhun_(order)",
  "/wiki/The_Smuggler",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Shelish",
  "/wiki/Starhowl_Pirate",
  "/wiki/2015",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/Jay_Doherty",
  "/wiki/Crimson_Reign_2",
  "/wiki/The_Witch_%26_the_Wookiee",
  "/wiki/Myths_%26_Fables",
  "/wiki/Myths_%26_Fables_(audiobook)",
  "/wiki/The_Art_of_Star_Wars:_Uprising",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars"
 ]
}