{
 "name": "Shen-Ji Collun",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Shen-Ji Collun's master"
     ]
    }
   ]
  }
 ],
 "content": "Shen-Ji Collun was a female Human Jedi Padawan who served the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars.\nA Force-sensitive Human, Shen-Ji Collun was educated in the ways of the Force by the Jedi Order. Selected as a Padawan during the Separatist Crisis, Collun took up the rank of Commander in the Grand Army of the Republic at the start of the Clone Wars, a conflict between the Republic and the Confederacy of Independent Systems.\nAs the war raged on, Collun's master told her that she was now two months away from undergoing the Trials of Knighthood, and becoming a Jedi Knight. In order to prepare for her trials, Collun was dispatched on a mission to the planet of Daimar, in the Mid Rim, which her master said would help train her further in diplomacy. While on the planet, Supreme Chancellor Palpatine culminated his plans to eliminate the Jedi Order and issued Contingency Order 66 to the clone troopers of the Grand Army, thus beginning the Great Jedi Purge. With the Republic gone and the Galactic Empire arisen in its place, Collun was stranded on Daimar when the Imperials blockaded the world.\nFeeling helpless, Collun strove to keep the dark side of the Force at bay, not allowing fear or hate to consume her. Appealing to Daimar's King Mitar for asylum, the monarch aided her in regaining her focus by giving her an assignment. Collun joined a group escorting Senator Alet Komain and Princess Wilena to safety on the planet of Byrsym, where they would meet with a rebel group led by Prince Torrin, Mitar's son. The refugees soon managed to break through the Imperial blockade aboard the starship Wasaka, and managed to reach Byrsym, in the Outer Rim. Soon after, the group met with Agent Ballon, who informed Collun that the prince had fled to the world of Dantooine in fear of Imperial imprisonment. Later arriving on Dantooine, the refugees found solace in the company of their prince. Collun, sensing Princess Wilena's latent Force-sensitivity, befriended the young heiress.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Shen-Ji_Collun%27s_master",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Daimar",
  "/wiki/Mid_Rim",
  "/wiki/Diplomat/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/King/Legends",
  "/wiki/Mitar",
  "/wiki/Senator/Legends",
  "/wiki/Alet_Komain",
  "/wiki/Prince/Legends",
  "/wiki/Wilena",
  "/wiki/Byrsym",
  "/wiki/Torrin",
  "/wiki/Starship/Legends",
  "/wiki/Wasaka",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Ballon",
  "/wiki/Dantooine/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Flames_of_Rebellion"
 ]
}