{
 "name": "Shenrick",
 "display_name": "Shenrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Calamari monarchy"
     ]
    }
   ]
  }
 ],
 "content": "Shenrick was a Mon Calamari male who ruled as the King of Mon Cala during the High Republic Era. Originally a third son who was not expected to gain the crown, Shenrick engaged in an affair with Ghal Tarpfen, a Captain Third Class of the Mon Calamari Guard who was from a low-ranking family. However, after a tragic incident made him king, Shenrick spurned Tarpfen, removing her from the service of the crown. Years later, when Tarpfen was serving as the Head of Security for the Starlight Beacon space station, the Nihil pirates attempted to use knowledge of the affair, which went against the mores of Mon Cala society, to blackmail her.\nShenrick, a Mon Calamari male, was born the third son of the reigning monarch of the planet Mon Cala during the High Republic Era. Not expected to gain the crown, Shenrick met Ghal Tarpfen, a female Captain Third Class in the Mon Calamari Guard who hailed from a low-ranking family. The two fell in love and began an affair, which was kept secret as it went against the mores of Mon Cala society, which largely valued the \"purity\" of the royal family. During their relationship, Shenrick and Tarpfen became fans of a holodrama which told the story of a Mon Calamari guard who ran away with a princess, feeling that it was \"their\" story.\nShenrick was suddenly propelled to the throne as King of Mon Cala when his predecessor and older siblings were killed in a tragedy. Subsequently, he decided to spurn Tarpfen, summoning her to an audience where he dismissed her from her responsibilities with the Guard, pretending that she had requested such a move. Not wanting to see Shenrick marry another, Tarpfen left Mon Cala entirely and joined the service of the Galactic Republic. Both, however, kept their past relationship secret, as word of it could ruin Shenrick's reputation, as well as that of Tarpfen's family.\nYears later, around 230 BBY, Shenrick was still reigning as king while Tarpfen had become the Head of Security of the Starlight Beacon space station. The Republic was aware of Tarpfen's history on Mon Cala. An ongoing conflict with the Nihil pirates had led some individuals within the Republic government to turn traitor, including Senator Ghirra Starros of Hosnian Prime. Thanks to Starros, the Nihil found out about Tarpfen's past and attempted to blackmail her, sending her cryptic holomessages which included Mon Cal documentaries, clips from gossip columns about the king's doings, and the entirety of the holodrama she and Shenrick had once enjoyed. Tarpfen, however, did not initially realize why she was receiving the messages. Subconsciously, however, she was aware that something was wrong, which manifested as recurring dreams of the moment Shenrick had dismissed her.\nAfter the Beacon had been towed to the planet Dalna to assist with a relief effort there, Tarpfen received a final holomessage displaying a masked Nihil commanding her to shut down security cameras in certain corridors of the station, with a threat for her past to be exposed if she refused. Recalling the past messages, Tarpfen realized she had been targeted for blackmail, being more concerned about what might happen to her family, as she did not care if Shenrick was publicly ruined. She still did not do what the Nihil wanted, tasking a security droid with monitoring the feeds in those areas. Tarpfen was further concerned because one of the areas where she had been told to deactivate cameras was corridor sixteen, where there had been earlier problems and which was where the visiting Senator Starros was staying. The message had also carried genuine Republic encryption, signaling the pirates had friends in high places. Tarpfen investigated corridor sixteen, but was ambushed by Starros and an accomplice, who knocked Tarpfen unconscious and kidnapped her after Starros said she should have just done what she was told.\nTarpfen was subsequently suspected of having attacked Dalnan Vice President Hackrack Bep, who had actually been assaulted by Starros and her accomplice, as the traitors had used her security code to subsequently wipe camera feeds. However, Jedi Master Estala Maru discovered evidence that the Nihil had attempted to extort Tarpfen, which he presented to Controller Rodor Keen and Administrator Velko Jahen. Tarpfen woke up to find herself on a Nihil starship, subsequently taking over the ship's cockpit. However, she lacked the piloting skills to turn it around and also could not read the writing on the controls, momentarily feeling a despair she had not felt since she was dismissed by Shenrick as other Nihil ships closed in, having not received a password from the ship. Tarpfen pulled herself together and used what she felt were her last moments before her certain demise to send a final message to the Republic warning of the traitors in its midst, which was received by Maru and Jahen on Starlight Beacon.\nShenrick, while merely a third son who was not expected to inherit the throne, was loving to Ghal Tarpfen. The two saw the holodrama about the Mon Calamari guard and the princess as a reflection of their relationship. However, when Shenrick unexpectedly became king, he abruptly spurned Tarpfen, coldly pretending that she herself had requested to be dismissed from the service of the crown, so he could find someone else to marry. Shenrick was keenly aware of Mon Cala social mores surrounding purity, keeping his relationship with Tarpfen secret even after it ended because it could still ruin his reputation. He was a male member of the Mon Calamari species.\nShenrick appeared in a dream in the first part of the Star Wars: The High Republic: Starlight short story \"Starlight: Shadows Remain\" by Justina Ireland, which was published in the 207th issue of Star Wars Insider magazine on December 14, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mon_Cala",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/King_of_Mon_Cala",
  "/wiki/High_Republic_Era",
  "/wiki/Ghal_Tarpfen",
  "/wiki/Captain_Third_Class",
  "/wiki/Mon_Calamari_Guard",
  "/wiki/King",
  "/wiki/Crown",
  "/wiki/Standard_year",
  "/wiki/Head_of_Security",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Unidentified_Mon_Calamari_holodrama",
  "/wiki/Prince",
  "/wiki/Throne",
  "/wiki/Death",
  "/wiki/Marriage",
  "/wiki/Galactic_Republic",
  "/wiki/230_BBY",
  "/wiki/Nihil_conflict",
  "/wiki/Treason",
  "/wiki/Senator",
  "/wiki/Ghirra_Starros",
  "/wiki/Hosnian_Prime",
  "/wiki/Holomessage",
  "/wiki/Holodrama",
  "/wiki/Dream",
  "/wiki/Dalna",
  "/wiki/Dalnan_evacuation",
  "/wiki/Camera",
  "/wiki/Security_droid",
  "/wiki/Dalnan",
  "/wiki/Vice_President",
  "/wiki/Hackrack_Bep",
  "/wiki/Jedi_Master",
  "/wiki/Estala_Maru",
  "/wiki/Controller",
  "/wiki/Rodor_Keen",
  "/wiki/Administrator",
  "/wiki/Velko_Jahen",
  "/wiki/Starship",
  "/wiki/Pilot",
  "/wiki/Species",
  "/wiki/Star_Wars:_The_High_Republic:_Starlight",
  "/wiki/Starlight:_Shadows_Remain",
  "/wiki/Justina_Ireland",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars_Insider",
  "/wiki/December_14",
  "/wiki/2021",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Yos_Kolina",
  "/wiki/20_BBY",
  "/wiki/Databank_(website)",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/StarWars.com",
  "/wiki/Titan_Magazines",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Water_War",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}