{
 "name": "Shenir Rix",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown",
      "Light olive mottling"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Shenir Rix was a Mon Calamari female reputed to be one of the most reliable information dealers in the galaxy during the Galactic Civil War. Formerly an employee of Fergriss Pharmaceuticals, Rix was forced out of her job after an Imperial assault put the company out of business. Relying on her business pedigree and a keen sense of the importance of things, Rix transitioned into a career as an informant. By 10 ABY, Rix began to routinely frequent posh gambling establishments, using her charm to pry valuable intelligence from rich yet unlucky patrons.\nBorn in 20 BBY, Shenir Rix was once a highly placed member of Fergriss Pharmaceuticals, until the Galactic Empire enacted a devastating assault on the company's homeworld, putting it out of business and effectively ending Rix's professional career. In turn, Rix utilized her business savvy to embark upon a life of information brokering. By the time of the Battle of Yavin, during the Galactic Civil War, Rix was reputed to be one of the best and most reliable information dealers in the galaxy—but at the expense of turning on her own people by working for the Empire.\nRix continued to ply her trade as an informant by 10 ABY, working some of the galaxy's most high-class gambling establishments, where she routinely bought and sold information. Playing the role of the unlucky gambler's best friend, Rix obtained much of her inside information from wealthy and influential yet habitually losing gamblers. By virtue of her charm and honest reputation, Rix had yet to attract the antagonism of some of her more seedier competitors. Nevertheless, the Empire charged her with illegal dissemination of classified data, categorizing Rix as criminal TracSheet Subject 55735573-QUUB-468835.\nShenir Rix was a Mon Calamari of tall, slender physique, with brown skin touched with light olive mottling and black eyes. She stood 1.9 meters in height. Rix was known to wear expensive clothing and jewelry—by 10 ABY, she adorned her face with piercings above the right eye and right nostril.\nFollowing the Imperial dismantling of Fergriss Pharmaceuticals, Rix successfully adapted her business acumen and sharp sense of importance into a new career as an information dealer. She came to be regarded as one of the galaxy's premier informants and took professional pride in delivering quality and timely information. If information came from Rix, one could be guaranteed of its accuracy. She dealt only in solid, reliable intelligence usually less than a day old; her Imperial TracSheet data in 10 ABY claimed that she never dealt in information more than twenty hours old. Rix's charisma and honest reputation helped her avoid coming into conflict with competing informants.\nRix's first name, \"Shenir,\" was a local spice found on the planet Mon Calamari, while her surname meant \"secretive\" in the Mon Calamarian language.\nRix was technically adept at computer programming and repair, and she had knowledge in economics and law enforcement.\nRix's equipment included datachips, a recording rod, and a hold-out blaster.\nShenir Rix was created for the 1994 West End Games sourcebook Galaxy Guide 11: Criminal Organizations, written by Rick D. Stuart. She serves as a character example of a criminal informant for use with Star Wars: The Roleplaying Game. Artist Mike Vilardi provided the sourcebook's illustration of Rix.\nRix was later included in the 1998 PC game Star Wars: Rebellion as a playable character available to the Galactic Empire. The Rix character is used most effectively in gameplay as a spy to gather information on Rebel systems and can also take on some dangerous missions with her combat abilities.\nThe 2003 Wizards of the Coast roleplaying sourcebook Galactic Campaign Guide included the names \"Shenir\" and \"Rix\" among a list of Mon Calamari names with a corresponding cultural or translation meaning.\nSources vary regarding the timeliness of Rix's acquired information. Galaxy Guide 11, which is set in 10 ABY, notes that Rix never exchanges information older than twenty hours; the Star Wars: Rebellion in-game encyclopedia, set in 0 ABY, states that Rix only deals in information less than twenty-four hours old; while the Star Wars: Rebellion: Prima's Official Strategy Guide more generally states that Rix's information is \"usually\" less than twenty-four hours old. This article attempts to reconcile each set of information, effectively as competing in-universe reports.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Shenir",
  "/wiki/Spice/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Fergriss_Pharmaceuticals",
  "/wiki/10_ABY/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Time/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/TracSheet",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Piercing/Legends",
  "/wiki/Nose/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dac",
  "/wiki/Mon_Calamarian",
  "/wiki/Language/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Programmer/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Datachip/Legends",
  "/wiki/Recording_rod",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/1994",
  "/wiki/West_End_Games",
  "/wiki/Galaxy_Guide_11:_Criminal_Organizations",
  "/wiki/Rick_D._Stuart",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Mike_Vilardi",
  "/wiki/1998",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebellion_(video_game)",
  "/wiki/Spy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/2003",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Roleplaying_game",
  "/wiki/Galactic_Campaign_Guide",
  "/wiki/0_ABY/Legends",
  "/wiki/Star_Wars:_Rebellion:_Prima%27s_Official_Strategy_Guide",
  "/wiki/In-universe",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}