{
 "name": "Shen_Matale",
 "display_name": "Shen Matale",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Matale family"
     ]
    }
   ]
  }
 ],
 "content": "Shen Matale was a Human male living on Dantooine during the Jedi Civil War. The son of Ahlan Matale, he was the heir to his estate.\nShen had been taught by his father to hate the Sandral family. But one day, he met Rahasia Sandral away from both his and her fathers, and he fell in love with her despite the feud between their families. He also became friends with Rahasia's brother Casus Sandral. But soon after, Casus was killed by kath hounds while exploring the ruins near the Jedi Enclave. When Nurik Sandral wrongly assumed that Casus had been kidnapped by Ahlan, Nurik kidnapped Shen and held him prisoner inside his own heavily-defended mansion. Rahasia pleaded with her father to release the man she loved, but he refused.\nEventually, an amnesiac Revan came to the Sandral estate to find Shen, and Rahasia told him what was going on. Revan found Shen, but Shen refused to leave without Rahasia because he knew Rahasia would be blamed for his escape and have to endure Nurik's wrath.\nRevan convinced Rahasia to leave with them. During the escape both of them thanked Revan profusely, but then Ahlan showed up with a pair of battle droid bodyguards. When Nurik, flanked by droid guards of his own emerged to confront his old rival, Revan was forced to mediate the feud lest the whole thing end in a firefight. Though both men proved stubborn, Revan managed to persuade the two fathers to see that their children were indeed in love and agreed to build a new house for them. As the two families parted, Shen told Revan that they would always remember him. Shen asked Rahasia to marry him shortly after Revan left.\nIt is known that the Matales were \"removed\" from Dantooine during the Jedi Civil War, so it is likely Shen was killed when the Sith invaded the planet.\nIt is possible for the player to convince Shen and Rahasia to run away to the Jedi Enclave. Shen and Rahasia plan to give their fathers a chance to forgive them and welcome them back. If they don't they plan to build a future somewhere else. If this happens, then Shen likely dies during the destruction of the Enclave.\nIf the player follows the dark side, he/she can lie to Nurik to make him think that Ahlan killed Casus. If this happens, Shen is killed by Nurik.\nThe player can also convince Shen to return to his father by telling him that his relationship with Rahasia will not work or by manipulating him into hating Rahasia, leaving her heartbroken.\nAccording to Kaevee, Shen was killed and his estate was burned when the Sith Empire invaded Dantooine. Since this was ultimately cut from the final game, however, this is considered non-canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shen_(disambiguation)",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Matale_family",
  "/wiki/Jedi_Civil_War",
  "/wiki/Ahlan_Matale",
  "/wiki/Rahasia_Sandral",
  "/wiki/Casus_Sandral",
  "/wiki/Kath_hound/Legends",
  "/wiki/Nurik_Sandral",
  "/wiki/Revan/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Battle_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Jedi_Enclave",
  "/wiki/Kaevee",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}