{
 "name": "Shens",
 "display_name": "Shens",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireRaithal Academy",
      "Raithal Academy"
     ]
    }
   ]
  }
 ],
 "content": "Shens, a Human male, was an Imperial Cadet from the Raithal Academy. In 19 BBY, Shens came to Coruscant to graduate, attaining the rank of Ensign. He was a friend of Caul Gentis and Laurita Tohm, the latter being the valedictorian of their Academy.\nShens, however, was also secretly a member of Headmaster Gentis's coup, a hero of the Clone Wars who sought to take over the Galactic Empire in order to stop the unending deaths of Imperial officers at the orders of the Emperor. Shens and Caul, at Gentis's orders, locked Tohm inside a prototype TIE Fighter, attempting to keep him away from the opening battles of their coup. Though the initial attacks succeeded in both wiping out seventy-two Imperial officers and gravely wounding Palpatine, Shens was one of the masked assailants who was counterattacked by Darth Vader. Vader threw a large piece of stone atop Shens and several others, crushing them beneath its weight. Tohm, who had escaped the fighter by engaging its ejection seat, happened upon the wounded Shens, who grabbed his ankle and begged for his help. Tohm was horrified to find that his friend—not to mention Gentis himself—were traitors to the Emperor. He asked Shens why he hadn't been involved, and Shens told him that due to his deformities and success, he stood out too much and would have been noticed. Shens then begged him to kill Vader, but Tohm told him that he should have asked him earlier and shot Shens in the head, killing him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Raithal_Academy/Legends",
  "/wiki/Cadet/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/Caul_Gentis",
  "/wiki/Laurita_Tohm",
  "/wiki/Headmaster/Legends",
  "/wiki/Gentis",
  "/wiki/Ghost_Prison_incident",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Death/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Imperial_starfighter_prototype",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Palpatine/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Telekinesis/Legends#Force_Throw",
  "/wiki/Ejector_seat/Legends",
  "/wiki/Darth_Vader_and_the_Ghost_Prison_1",
  "/wiki/Darth_Vader_and_the_Ghost_Prison_2"
 ]
}