{
 "name": "Shin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Army",
      "Alliance Army"
     ]
    }
   ]
  }
 ],
 "content": "Shin was a male Duros who served as a major in the Alliance to Restore the Republic during the Galactic Civil War.\nShin and his troops participated in many battles and skirmishes during the Galactic Civil War, almost always directly against Imperial Colonel Brenna and her forces.\nShortly after the Rebel Alliance's victory against the Empire during the Battle of Yavin, the Alliance was forced to evacuate for fear of Imperial retaliation. Near the end of their evacuation, Imperial forces landed near their base on the fourth Moon of Yavin. Shin and his troops fought against the enemy forces as they assaulted the base, the Empire's goal being to capture the Rebel's data banks.\nLater, Shin was part of an elite Rebel cell that operated of out Mos Eisley on Tatooine. When the Empire found out, they attacked the city while the Rebels tried to protect a U-wing that was taking off. As the fight was beginning, Shin reminded his troops to be mindful, as they were fighting in someone's home, unlike the enemy commander, Brenna, who told her troops that civilian casualties were acceptable.\nEventually, Shin helped launch an attack against the Imperial shipyards that orbited the Planet of Fondor. His forces attacked a docked Imperial II-class Star Destroyer, attempting to destroy it.\nShin was present at Echo Base when the Empire discovered and attacked it. After General Maximilian Veers destroyed the base's power generators, Imperial troops assaulted the east and west hangars. Shin and his forces fought against the advancing Imperials as they tried to cut the fuel lines in order to stop the Rebel transports from taking off.\nDuring the Battle of Endor, Shin was on a CR90 corvette that crashed into Command Center North on the second Death Star. He lead the surviving Rebel passengers in a skirmish against the present Imperial forces in an attempt to sabotage the station's superlaser and escape.\nFollowing the battle, an Imperial II-class Star Destroyer attacked an MC80 Star Cruiser in orbit around Endor. Shin commanded the fighters that were dispatched to defend it, the skirmish taking place in the recently destroyed Death Star II's debris.\nLater, Shin lead an assault against Research Station 9, an Imperial Tarkin Initiative facility on Endor's forest moon. During the assault, the Rebels attacked a small outpost not far from the main facility in hopes of stealing an All Terrain Armored Transport to use in their advance on the main facility.\nShin is the announcer for the Rebel Alliance in the multiplayer modes of Star Wars Battlefront II.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Duros",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alliance_Army",
  "/wiki/Rebel_trooper",
  "/wiki/Major",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Colonel",
  "/wiki/Brenna",
  "/wiki/Brenna%27s_brigade",
  "/wiki/Battle_of_Yavin",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Moon",
  "/wiki/Yavin_Prime",
  "/wiki/Mos_Eisley",
  "/wiki/Tatooine",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Fondor_Shipyards",
  "/wiki/Planet",
  "/wiki/Fondor",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Echo_Base",
  "/wiki/Battle_of_Hoth",
  "/wiki/General",
  "/wiki/Maximilian_Veers",
  "/wiki/Battle_of_Endor",
  "/wiki/CR90_corvette",
  "/wiki/Command_Center_North",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Superlaser",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/Research_Station_9",
  "/wiki/Tarkin_Initiative",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back"
 ]
}