{
 "name": "Shmi_Skywalker_Lars",
 "display_name": "Shmi Skywalker Lars",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.63 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Skywalker family",
      "White Suns",
      "Lars family"
     ]
    }
   ]
  }
 ],
 "content": "Shmi Skywalker Lars was a human female who lived in slavery on the planet Tatooine during the last years of the Galactic Republic. During her time as a slave, Shmi gave birth to a son whom she named Anakin Skywalker. In 32 BBY, her son was discovered by Jedi Master Qui-Gon Jinn, who found the boy to be unusually strong with the Force. He learned through Shmi that there was no father involved in Anakin's conception, leading Jinn to believe that Anakin was conceived by the midi-chlorians. With Shmi's support, Anakin was taken by Jinn to the Jedi Temple on Coruscant and presented to the leaders of the Jedi Order as the Chosen One—the one who was destined to restore balance to the Force, according to Jedi prophecy.\nAfter Anakin left Tatooine to begin his Jedi training, Shmi married Cliegg Lars—a moisture farmer who freed her from slavery—and became a loving stepmother to his son, Owen Lars. Her chance to see Anakin one last time came when, in the waning days of the Separatist Crisis, Shmi was abducted and subjected to torture by a group of Tusken Raiders in 22 BBY. By then, her son had returned to Tatooine as a Jedi Padawan. Having seen her son again, Shmi told him she was complete but died in his arms. Unable to prevent his mother's demise, Anakin gave into the dark side of the Force and massacred the Tusken Raiders, including their women and children, and buried his mother at the Lars moisture farm. Shortly after Shmi's death, her son went on to become a Jedi Knight, as well as a general in the Grand Army of the Republic during the galaxy-wide conflict known as the Clone Wars. The loss of his mother also stemmed in Skywalker a desire to possess the ability to save his loved ones from death, which ultimately pushed him to become Darth Sidious's Sith apprentice.\nBorn on an unknown world, Shmi Skywalker and her parents were captured by pirates and forced into slavery when she was just a young girl. She lived a difficult life as a slave and was taken from star system to star system in the servitude of several masters, as the pirates were uninterested in having an extra mouth to feed unless she could provide an essential service to them. Shmi never spoke about the fates of her parents, if she knew what became of them. Before she was bought by the Hutts, Skywalker was once sold in a market like the Zygerrian slave market her son, Anakin Skywalker, visited during the Clone Wars. Eventually, Skywalker was enslaved to and grew up on the Outer Rim world of Tatooine during the last decades of the Galactic Republic. During her time as a slave, she gained an affinity for working on machinery. About nine years before the Battle of Naboo, she gave birth to Anakin, a Force-sensitive child who was born without a father, but chose not to question his birth.\nShmi and Anakin lived with other families in communal quarters during their time as slaves of the female Hutt crime lord Gardulla Besadii the Elder. Gardulla lost them in a bet with the Toydarian junk dealer Watto, who employed Anakin's services at his shop. While Watto could be a harsh and demanding master, he still furnished them with a home in Mos Espa's slave quarters. Despite their poverty, she made Anakin and herself a good home through her tireless effort. When Watto did not need Shmi, he allowed her to gain a modest living cleaning computer memory devices. She made a small part of their house into a work station, which possessed just enough of the tools and equipment to properly work. In addition, Shmi and her son also owned a few personal possessions including an antiquated protocol droid named C-3PO and a podracer. In a rare showing of kindness, Watto also gave her a repulsor-powered magnifier. Kept in her work station, the gift was for the hard work she did.\nOften, however, Watto was unkind, understanding that Shmi had nothing valuable to trade—other than her son, whom she would never trade—to stop him from doing what he wished. Thus, Watto took advantage of that all the time, such as how he allowed the boy to podrace, much to Shmi's anger. During one race, she watched, angry at Watto and horrified as her son crashed yet again, although she realized he had not been thrown from his podracer for once. Watto approached her, ignoring whatever pain Anakin could be in by claiming he was fine before flying off, ignoring her concern that her son might be seriously hurt one day. As she had done many times before, she made her way down to the racing pit, where she reunited with Anakin but saw that his legs were twisted. While she knew that Watto would pay to ensure his slave's legs recovered, Shmi held onto her son's hand to comfort herself. Before the rustic, yet effective, medical droids made Anakin unconscious to work on his legs, Anakin promised he would always be with her, yet Shmi privately promised he would one day leave her for a better life.\nOne day, Anakin returned home with several strangers including the Jedi Master Qui-Gon Jinn, the Naboo Queen Padmé Amidala, disguised as a handmaiden, the Gungan Jar Jar Binks, and the astromech droid R2-D2, who were seeking shelter from a sandstorm. While Shmi and her son had initially believed that these offworlders had come to free slaves, they quickly learned that the strangers had become stranded on Tatooine after their starship's hyperdrive was damaged during a diplomatic mission to the galactic capital, Coruscant. When Anakin offered to help Jinn and his companions to obtain money for the hyperdrive by winning the upcoming Boonta Eve Classic podrace, Shmi initially disagreed with the idea. However, she relented when Anakin recalled her words on helping others.\nWhile Anakin repaired his podracer, Shmi told Jinn about her son's birth. Later, Jinn tested Anakin and discovered that he was strong with the Force. Due to his high concentration of midi-chlorians, Jinn believed that Anakin was the prophesied Chosen One. The following day, Jinn offered to sponsor Anakin for the upcoming Boonta Eve race in return for securing Shmi and her son's emancipation if Anakin won that race. However, Watto was unwilling to relinquish both slaves at the same time. Instead, they reached a compromise where Watto agreed to free Anakin if he won the race. The following day, Shmi along with the offworld visitors attended the Boonta Eve Classic. Despite great odds, her son Anakin won the race, and Watto was forced to honor his promise to emancipate Anakin.\nFollowing the race, Shmi and her son embraced each other with Shmi expressing pride in her son's achievements. After securing Anakin's earnings from Watto, Jinn informed Shmi that he had secured Anakin's emancipation and offered to train him as a Jedi. With much difficulty, Shmi decided to part with her son. Realizing that Anakin would have a better future offworld, Shmi advised her son to grasp this new opportunity and told him to let her go on the rationale that her place and future was on Tatooine. Prior to leaving for his new life on Coruscant, Anakin made a solemn vow that he would return and free her.\nA decade before the outbreak of the Clone Wars, Watto's gambling habit left him to be essentially destitute, forcing the Toydarian to sell Shmi. The path to her freedom started when a moisture farmer named Cliegg Lars met and fell in love with her. Manipulating Watto into a gambling game that the Toydarian lost, Lars purchased but freed her, and the two eventually married. Shmi became a loving step-mother to his son, Owen Lars. C-3PO also lived with them. Upon her release, Shmi also helped the White Suns liberation movement that focused on freeing Tatooine's slaves, using her technical talents to build a device that could locate and remove the tracking chip forced into all slaves. The device was made out of kitchen equipment and saw its first use on Shmi herself and succeeded, but subsequent uses on other slaves showed it needed to be perfected.\nApproximately four years after the Invasion of Naboo, Padmé sent her handmaiden Sabé to rescue as many slaves as she could, including Shmi. Unfortunately, Sabe's efforts took many wrong turns, enlisting help from the wrong sources. Watto had seemingly disappeared along with Shmi, and when Sabe asked of her whereabouts, they could only tell her that she had been sold. When passing through Shmi's former residence, she noted a sign on the door that was likely a mark of the local liberation movement; in truth, it was indeed the mark of the White Suns.\nBy the end, Sabe's efforts lead her to buy the freedom of over 25 slaves, something she reported back to Amidala. Undeterred, Amidala asked Sabe to continue her efforts to free more slaves on Tatooine, although she soon needed to leave to help Amidala in the Galactic Senate. Although Amidala and Sabé remained unaware of her fate, Shmi had a quiet yet happy life at the Lars moisture farm in Tatooine's Jundland Wastes. However, she spent many nights with an ache in her heart and looking at the stars, as she was worried about where Anakin was and his well-being. One month before the Battle of Geonosis, Shmi was out in the morning gathering mushrooms that grew on the moisture vaporators when a group of Tusken Raiders kidnapped her. Cliegg assembled a rescue party but lost most of his companions and his right leg during the rescue attempt. Believing Shmi to be dead and unwilling to risk any more lives, Lars abandoned the rescue.\nHowever, Shmi was still alive but had been severely tortured and brutalized. Meanwhile, her son Anakin, who had become a Jedi Padawan under Obi-Wan Kenobi, sensed her distress through the Force. Anakin immediately set off to Tatooine to find and save her with Senator Amidala accompanying him. After meeting with Watto, Anakin and Amidala arrived at the Lars family farm and learned about his mother's fate after Anakin left for Coruscant: freedom, marrying Cliegg and becoming stepmother to Owen Lars, and her kidnapping. Despite Cliegg' warnings and advice, Anakin traveled into the wilderness to find her. He eventually stumbled on a Tusken Raider camp.\nAfter infiltrating the camp, he found the tent where Shmi was being held. There, Anakin encountered a bound and emaciated Shmi, who was near death. Right before her death, she managed to tell her son that she was proud of him and that she loved him. Shmi's death threw Anakin into a fit of rage, and he took his first step into the dark side of the Force when he avenged his mother by coldly killing every Tusken Raider in the encampment, including the women and children. The following morning, Anakin returned to the Lars moisture farm with his mother's body. Shmi was mourned by both her son Anakin and Cliegg, as well as Amidala, Owen, and his girlfriend, Beru, who all attended her funeral. Beru served blue milk and cheese to everyone after.\nShmi's death had a profound effect on influencing her son Anakin's journey to the dark side. Prior to his mother's burial, Anakin told Amidala that he regretted not being strong enough to save his mother. He also vowed that he would one day become so powerful that he could learn to stop people from dying. Then Skywalker confessed to his role in murdering the Tusken Raiders to avenge his mother's death. Skywalker's guilt about not being able to prevent Shmi's death made him susceptible to the Sith Lord Darth Sidious' efforts to win him over to the dark side.\nDuring the Clone Wars, Anakin experienced a Force vision of Shmi on the planet Mortis, where he had been put through a series of tests by three powerful beings known as the Force wielders who wanted to determine whether he truly was the Chosen One. In reality, the Son, one of the Force wielders who embodied the dark side of the Force, had assumed the form of his late mother. The false Shmi told Anakin to give up his love for Amidala, whom he had secretly married shortly after the Battle of Geonosis, saying that he did not truly love her and that she was poison to him before transforming into the Son.\nBy 18 BBY, Kenobi, who lived in exile on Tatooine, had gone to Shmi's grave to apologize for losing her son. Years later Kenobi left toys for Shmi's grandson, Luke Skywalker, next to her sandblasted tombstone for Beru to find.\nWhen Anakin, now the Sith Lord Darth Vader, attempted to bleed Jedi Master Kirak Infil'a's kyber crystal to create his own red-bladed Sith lightsaber, the crystal fought back by showing him a series of visions. One of these involved Anakin returning to the Lars homestead with Shmi's body in his arms.\nShortly after the Battle of Fortress Vader, Vader entered a portal created by Darth Momin and saw visions from his past, which manifested his fears and dark thoughts. Upon entering the portal, Vader was able to see his pregnant mother and a spectral appearance of Sidious behind her, resounding words that Shmi said to Jinn about Anakin having no father before passing to the next part of his visions.\nIn 3 ABY, shortly after informing Shmi's grandson Luke Skywalker about his parentage, Darth Vader returned to the Lars moisture farm. While exploring the farm's remains, the forensics droid ZED-6-7 remarked that Shmi's death at the Tusken Raiders hands was among the records that indicated the generations of animosity between the Tuskens and moisture farmers.\nIn 35 ABY, following the ultimate destruction of Darth Sidious and the Final Order, the Jedi Rey journeyed to the Lars homestead on Tatooine, burial site of Shmi Skywalker. Once there, the former scavenger laid to rest the lightsabers of Luke Skywalker and his twin sister, Leia Skywalker Organa Solo, the grandchildren of Shmi who were birthed by Padmé Amidala. The Skywalker bloodline ended with the deaths of Leia and her son, Ben Solo, however Rey—the granddaughter of Darth Sidious—chose to adopt their surname to honor the Skywalker family.\nShmi Skywalker Lars was a peaceful, selfless and kind person. She loved her son Anakin and was willing to sacrifice herself in order to let Anakin have the possibility of a better life. During her time under Watto, Shmi still had hope that she would eventually be free, but she accepted her lot in life and had joy in her relationship with Anakin, cherishing their modest life in the Slave Quarters Row.\nCliegg claimed that Shmi was the best partner a man could ask for, as he was deeply affected by Shmi's death at the hands of the Tusken Raiders.\nShmi Skywalker was portrayed by Swedish actress Pernilla August in Star Wars: Episode I The Phantom Menace and Star Wars: Episode II Attack of the Clones. She reprised her role as Shmi in the  The Clone Wars season 3 episode \"Overlords.\"\nIn 1998, it was announced that Anakin Skywalker's mother would be named Shmi and that August would portray her. When the original trilogy was rereleased in theaters and VHS to commemorate the twentieth anniversary of Star Wars: Episode IV A New Hope the year before, Star Wars Trivial Pursuit was released to coincide with this. The limited-edition game contained a sequestered pack of questions that served as a preview of the first new trilogy installment, two of which divulged those bits of information.\nIn one of the first drafts of The Phantom Menace, her name was Shmi Warka.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shmi_Skywalker_Lars",
  "/wiki/Shmi_Skywalker_Lars/Legends",
  "/wiki/Lars_(disambiguation)",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Hope",
  "/wiki/Brotherhood",
  "/wiki/Darth_Vader_(2020)_23",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Tatooine",
  "/wiki/22_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Skywalker_family",
  "/wiki/White_Suns",
  "/wiki/Lars_family",
  "/wiki/Slavery",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/Standard_year",
  "/wiki/Galactic_Republic",
  "/wiki/Time",
  "/wiki/Reproduction",
  "/wiki/Youngling",
  "/wiki/Anakin_Skywalker",
  "/wiki/32_BBY",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Force-sensitive",
  "/wiki/The_Force",
  "/wiki/Midi-chlorian",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_Order",
  "/wiki/Chosen_One",
  "/wiki/Jedi",
  "/wiki/Jedi_training",
  "/wiki/Marriage",
  "/wiki/Cliegg_Lars",
  "/wiki/Moisture_farmer",
  "/wiki/Owen_Lars",
  "/wiki/Standard_day",
  "/wiki/Separatist_Crisis",
  "/wiki/Prisoner",
  "/wiki/Torture",
  "/wiki/Tusken_Raider",
  "/wiki/Padawan",
  "/wiki/Death",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Lars_Homestead",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_General",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_apprentice",
  "/wiki/Parent",
  "/wiki/Pirate",
  "/wiki/Star_system",
  "/wiki/Hutt",
  "/wiki/Zygerrian_slave_market",
  "/wiki/Mission_to_Zygerria",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Standard_decade",
  "/wiki/Battle_of_Naboo",
  "/wiki/Crime_lord",
  "/wiki/Gardulla_Besadii_the_Elder",
  "/wiki/Gambling",
  "/wiki/Toydarian",
  "/wiki/Junk_dealer",
  "/wiki/Watto",
  "/wiki/Watto%27s_junkshop",
  "/wiki/Skywalker_home",
  "/wiki/Mos_Espa",
  "/wiki/Slave_Quarters_Row",
  "/wiki/Computer",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Anakin_Skywalker%27s_Podracer",
  "/wiki/Podracing",
  "/wiki/Podracer",
  "/wiki/Medical_droid",
  "/wiki/Naboo",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Gungan",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Sandstorm",
  "/wiki/Naboo_Royal_Starship",
  "/wiki/Starship",
  "/wiki/Hyperdrive",
  "/wiki/Diplomat",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Capital",
  "/wiki/Currency",
  "/wiki/T-14_hyperdrive_generator",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Cloning",
  "/wiki/Sab%C3%A9",
  "/wiki/Galactic_Senate",
  "/wiki/Jundland_Wastes",
  "/wiki/Standard_month",
  "/wiki/Geonosis",
  "/wiki/Mushroom",
  "/wiki/Moisture_vaporator",
  "/wiki/Cliegg_Lars%27_quadrille",
  "/wiki/Limb",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mission_to_rescue_Shmi_Skywalker_Lars",
  "/wiki/Senator",
  "/wiki/Farm",
  "/wiki/Tusken_Raider_camp_(Anakin_Skywalker)",
  "/wiki/Tent",
  "/wiki/Moisture_farm",
  "/wiki/Beru_Whitesun_Lars",
  "/wiki/Funeral_of_Shmi_Skywalker_Lars",
  "/wiki/Blue_milk",
  "/wiki/Cheese",
  "/wiki/Burial",
  "/wiki/Sith_Lord",
  "/wiki/Force_vision",
  "/wiki/Mortis",
  "/wiki/Force_wielder",
  "/wiki/Son",
  "/wiki/Wedding_of_Anakin_Skywalker_and_Padm%C3%A9_Amidala",
  "/wiki/Poison",
  "/wiki/18_BBY",
  "/wiki/Exile_(punishment)",
  "/wiki/Luke_Skywalker",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Darth",
  "/wiki/Bleeding",
  "/wiki/Kirak_Infil%27a",
  "/wiki/Kyber_crystal",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Sith_lightsaber",
  "/wiki/Crystal",
  "/wiki/Battle_of_Fortress_Vader",
  "/wiki/Portal",
  "/wiki/Darth_Momin",
  "/wiki/3_ABY",
  "/wiki/Duel_on_Cloud_City",
  "/wiki/Forensics_droid",
  "/wiki/ZED-6-7",
  "/wiki/35_ABY",
  "/wiki/Battle_of_Exegol",
  "/wiki/Final_Order",
  "/wiki/Rey_Skywalker",
  "/wiki/Scavenger",
  "/wiki/Leia%27s_lightsaber",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Twin",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Ben_Solo",
  "/wiki/Palpatine_family",
  "/wiki/Pernilla_August",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Overlords",
  "/wiki/1998",
  "/wiki/Original_trilogy",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1997",
  "/wiki/Star_Wars_Trivial_Pursuit",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Obi-Wan_and_Anakin_4",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/Attack_of_the_Clones_(Golden_Book)",
  "/wiki/Age_of_Republic_-_Anakin_Skywalker_1",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Kidnapped",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Darth_Vader_(2017)_5",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Lords_of_the_Sith",
  "/wiki/Lords_of_the_Sith_(audiobook)",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Blood_Moon_Uprising_(short_story)",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Beru_Whitesun_Lars_(short_story)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Time_of_Death",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Coda",
  "/wiki/Darth_Vader_(2015)_25",
  "/wiki/Doctor_Aphra_(2016)_38",
  "/wiki/Darth_Vader_(2020)_1",
  "/wiki/Darth_Vader_(2020)_3",
  "/wiki/Darth_Vader_(2020)_19",
  "/wiki/Darth_Vader_(2020)_27",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/William_Shakespeare%27s_The_Clone_Army_Attacketh:_Star_Wars_Part_the_Second",
  "/wiki/William_Shakespeare%27s_Tragedy_of_the_Sith%27s_Revenge:_Star_Wars_Part_the_Third",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/LEGO_Star_Wars:_Droid_Tales_Episodes_I-III",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_2",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_4",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_32",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_1",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide"
 ]
}