{
 "name": "Shmorg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Barons Hed",
      "Sulon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Shmorg was a Gran male who worked as a bounty hunter on the moon of Sulon, in the city of Barons Hed during the year 5 ABY. Along with four other Gran, he attended a local tavern, where they ordered several refreshments. When Shmorg offered to pick up the tab, another Gran opted to buy the drinks instead, a move with which Shmorg did not agree. All of the Gran became involved in an argument over who was going to pay for the drinks, which resulted in an unarmed brawl. Shmorg's fight was ended by the novice Jedi Kyle Katarn, who killed all of the Gran when they turned to attack him.\nThe Gran Shmorg was a bounty hunter who was hired by the Galactic Empire in the year 5 ABY. Along with numerous other bounty hunters, Shmorg's job was to prowl the streets of the city of Barons Hed, located on the moon Sulon, which orbited the planet Sullust, for intruders looking to infiltrate Government House, a large facility located in the center of the city. One day, Shmorg and four other Gran bounty hunters headed to a local tavern, where they ordered drinks from the Human bartender. When the Gran had finished their refreshments, Shmorg offered to pick up the tab but was countered by another Gran, who also wanted to pay the bill. This led to an argument between all of the Gran over who was going to pay, which eventually escalated to an unarmed brawl between them, in which they began to beat each other to death. The bartender frantically called for the Gran not to use blasters, although none of them were armed, with the sole exception of one Gran who had a belt of thermal detonators.\nJust as the brawl began, the New Republic agent and Jedi trainee Kyle Katarn stumbled into the tavern while attempting to locate a way into Government House. By this point, two of the Gran had been beaten to death, and the remaining Gran turned their attention with clenched fists to Katarn. However, their attack proved unsuccessful, and the novice Jedi slew the other bounty hunters. Katan then collected the one Gran's thermal detonators and the bar's supply of personal energy shields before leaving, while the bartender grumbled his displeasure at Katarn for killing paying customers.\nShmorg had brown-colored skin, purple eyes, and wore brown clothing. He was a brawler with large hands. Although he was gracious enough to offer to pay the tab for his acquaintance's drinks, he had a short temper and did not tolerate another Gran offering to buy the refreshments instead.\nShmorg appeared in the 1997 video game Star Wars: Jedi Knight: Dark Forces II as an anonymous enemy character in the game's fifth level. Shmorg received a name in the game's accompanying strategy guide, although it is not clear which Gran in the bar is Shmorg. In the guide, author Rick Barba theorized that the Gran were fighting over a bar tab. He advised the player to wait out their fight until at least two Gran were dead and then kill the remaining Gran before pillaging the bar's supplies. However, because completion of this encounter is not necessary for beating the game, it can be skipped without any negative effects.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/5_ABY/Legends",
  "/wiki/Barons_Hed",
  "/wiki/Sulon",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Moon/Legends",
  "/wiki/City/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Barons_Hed_tavern",
  "/wiki/Cantina/Legends",
  "/wiki/Unidentified_Gran_(Barons_Hed)",
  "/wiki/Currency/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Jedi/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Death/Legends",
  "/wiki/File:BaronsHed_Bartender_Paying_Customers.ogg",
  "/wiki/Bounty/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Government_House_(Sulon)",
  "/wiki/Standard_day/Legends",
  "/wiki/Human/Legends",
  "/wiki/Unidentified_Barons_Hed_bartender",
  "/wiki/Bartender/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Canon",
  "/wiki/New_Republic/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Mission_to_Sulon",
  "/wiki/Personal_energy_shield/Legends",
  "/wiki/File:BaronsHed_Bartender_No_Blasters.ogg",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Limb/Legends",
  "/wiki/1997",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II:_The_Official_Strategy_Guide",
  "/wiki/Rick_Barba",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire"
 ]
}