{
 "name": "Shodu_Warrick",
 "display_name": "Shodu Warrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree Village tribe"
     ]
    }
   ]
  }
 ],
 "content": "Shodu Warrick was an Ewok female from the Forest Moon of Endor. She lived in Bright Tree Village and was married to the Ewok warrior Deej Warrick, with whom she had four children: Weechee, Widdle, Wicket, and Winda, whom she raised to be considerate to others. In 3 ABY, Deej became injured by a fungus; Shodu tried to heal him but was unsuccessful. The village shaman, Logray, had Shodu's sons fetch ingredients for an antidote, and they did so just in time to save their father.\nOn Shodu's birthday that year, a party was thrown in her honor, and she received many gifts. Her gift from Wicket was what she thought to be a beautiful gem but was actually a serpent egg. Before Wicket could tell her that fact, they were captured by Duloks, who brought them before their king. Nevertheless, Shodu fought the Duloks and escaped with Wicket. Later, at an Ewok carnival, Shodu baked sunberry pies and instructed Wicket to take the woklings to see the Tumble Bunnies. After he instead took them to Horville's Hut of Horrors, she punished him by having him work as the Tumble Bunny trainer.\nIn that same year, a group of Humans crashed on the moon of Endor. The two children among them—Cindel and Mace Towani—came to Shodu's hut, where Shodu prepared medicine to help heal Cindel of an awful fever. When a group of Sanyassan Marauders later attacked the village, Shodu participated in a battle to defeat them.\nThe Ewok female Shodu Warrick hailed from the Forest Moon of Endor. A member of the Ewok tribe that inhabited Bright Tree Village on Endor, she married the Ewok warrior Deej Warrick—whom she had known when he was young—and was the mother of Weechee, Widdle, Wicket, and Winda Warrick. In order to protect their children from dangerous creatures, Shodu and Deej established a rule that they had to be home by nightfall.\nAt one point when Wicket was a young boy, he planned to go fishing at a river, excited to be rid of the little woklings. However, when Shodu and Wicket's wokling sister, Winda, walked by, Shodu suggested that he take Winda along to catch some trout. Holding a basket of berries, she mentioned that Winda would love to go. Wicket protested, eventually relenting after Shodu gave him a stern look.\nThe two rode toward the river on Wicket's pet bordok, Baga, but they were forced to return home after Wicket fell into poison ivy, which Shodu had forbidden. At that point, Wicket shouted at Winda in anger, frustrated at how quickly the fishing had ended. The wokling thus ran crying into Shodu's arms. After listening to the whole story, Shodu was able to calm down Winda, assuring her that Wicket had no intent to hurt her feelings. When Wicket retorted that Winda had ruined his day, she told that that was enough, and that he should go to the shaman Logray's hut to get a powder for his rash. Eventually, Wicket returned and apologized to Winda. At the celebration of the Ewok Festival of the Wisties, Shodu was present, holding a Wistie Fest pie during the festivities.\nAnother time at a yearly raft race, Weechee and Willy were partners while rafting. Weechee got scared in a cave and had to be rescued by Willy, so the two took longer than everyone else to finish the race. Shodu and Deej were among those who waited for them at the end, thankful that the pair survived. As the family made its way back to the village, Shodu hugged Willy, commending him for his bravery. Willy explained that a magic stone had made him brave, only to find that he had lost the stone and was brave on his own.\nIn 3 ABY, Warrick was present in Bright Tree Village when a group of the Dulok species invaded via an invisibility soap. She was also there when her husband became injured following being cut by a fungus. After Deej was brought home, he had no idea who he was, and while Shodu tried to tend to him with strong forest medicines, nothing worked; after a while, she said that she had never seen him like that before: he did not even recognize his own family members. Wicket suggested that they fetch Logray, which Shodu agreed with, pointing out that Deej's fur was changing from gray to white, and he appeared to be aging quickly.\nShe asked Logray if he knew what happened, but he was not sure. When Wicket described the fungus, Logray admitted that it was quite serious, which worried Shodu, who asked the shaman if he could save Deej. Logray then told of the ingredients for a cure, which he asked Wicket, Willy, and Weechee to find; the trio then went off to try and do so.\nLater that evening, Shodu cried next to Deej's bed, for they were nearly out of time. It was then that her children returned with all of the necessary ingredients; Wicket asked his mother if they were too late, but she assured him that they had arrived in time. As his family watched apprehensively, Logray concocted an antidote to the fungus, and Deej awoke from his slumber. At this, Shodu ran to him and exclaimed how happy she was for him to be back. A confused Deej asked where he had been, which Shodu admitted was a long story. She told him that he had three wonderful sons, for they had been able to procure the ingredients for his cure.\nWhen several Ewoks, including Weechee and Willy, made a trip to the Tree of Light, Shodu was there to see them off, ordering her sons to be careful and return safely. After receiving instructions from Master Logray, the party departed, with Willy calling out goodbye to his mother and her responding likewise. As Shodu watched them leave, she wept into a handkerchief, noting how fast it seemed her children had grown. Thereafter, she was among many Ewoks standing around a fire when the tale of how the Sunstar and Shadowstone were reunited with the Ewoks was told by Logray. Shodu would later cheer on Wicket when he took his first step to becoming an Ewok warrior.\nOne day, Wicket was at home doing chores, and Shodu reminded him to make his hammock, which he then did, albeit accompanied by complaints about the chores. He felt that he should be outside with the Ewok warriors, but when he tried to leave the house, Shodu pulled him back in, asking him if the firewood had been stacked yet. Wicket had done so, though ineffectively, as it fell back on the ground. He tried to leave again, but Shodu reminded him that she had asked him to peel berries for a festival. Wicket insisted that such was work for kids, which Shodu pointed out was why she asked Wicket in the first place. She also told him that once he was done peeling, he was to wash some gourds.\nWicket then proclaimed that he had had enough and would be moving out. Shodu humored him, asking if he really would; Wicket then insisted that he was no longer a child. Shodu was still skeptical, offering Wicket a scarf for the road, which Wicket confusedly accepted. He then told her that he would not be coming back, and that even one million munyips would not convince him to return. Shodu then wondered aloud to Winda whether Wicket would stay in the forest as long as his brothers did.\nIndeed, after a short time, Wicket and his friend Teebo, who had gone along with him, returned to the Warricks' house, where a party was being held. While sitting next to Shodu, Wicket noted that he had had no idea how much he would miss everyone; Shodu agreed, for life would not have been the same had his absence continued, and she kissed him on his head. At another point, after a being known as the Totem Master nearly succeeded in capturing several young Ewoks, including Wicket, Shodu was present for their return in a bordok-drawn wagon. She winced as Teebo accidentally caused many items from the wagon to fall on top of the Ewoks.\nOn Shodu's birthday, Wicket looked everywhere in an attempt to find a gift for her. Even after Teebo tried to help him with his magic, he was unsuccessful. Wicket was worried that he would not be able to procure a gift in time for Shodu's party that night, but he then found a map to a Lost Temple, where he hoped to find jewel for his mother.\nTeebo found what he thought to be a gem but was really the egg of a serpent. Shodu's party took place that night, with Shodu and her family sitting at the front of a dance party with music. The wokling Malani brought a birthday cake to Shodu, wishing her a happy birthday. Shodu thanked her, and Malani noted that it was her first attempt at such a cake; after eating a slice, despite struggling to swallow the bite, Shodu told her that she would have never guessed.\nWicket then arrived with his gift, still thinking it to be a gem. Shodu thanked him, asking where he had found such a gem; Wicket deflected the question by casually mentioning that he had just found it lying around. Shodu loved her present and proceeded to dance with Wicket on the dance floor. It was then that another Ewok who had gone to the Lost Temple with Wicket, Latara, discovered that the jewels were in fact serpent eggs when they hatched. Her friend Kneesaa a Jari Kintaka had Teebo dance with Shodu so that she could explain the situation to Wicket. Although confused, Shodu accepted the dance.\nKintaka explained how the gem had hatched a serpent. Later that night, Wicket approached Shodu; just before he could explain, the Dulok Umwak captured the two Ewoks in a net, as the King of the Duloks, Gorneesh, had instructed Umwak to find an anniversary gift for his wife, Queen Urgah. Shodu and Wicket were brought before the King and Queen, and Umwak presented the gem hanging from Shodu's neck. Shodu slapped his hand away when he tried to take the jewel, and Umwak further declared that the two Ewoks would be her servants. Umwak again tried to take the jewel, and Shodu again refused. Wicket asked her to give it to him, but she protested, reminding him that it had been his gift to her. Urgah then ordered Shodu to bow to her, which two Dulok guards tried to make her do; Wicket told them to leave his mother alone, leaping at Gorneesh in anger, who kicked him backward.\nIn retaliation, Shodu knocked the heads of two Duloks together. As Urgah asked Gorneesh to give the Ewoks an awful punishment, her egg hatched, with the baby serpent biting the queen on the nose. Shodu told Wicket to run, which they both did as Urgah shouted at Gorneesh over the quality of her anniversary gift. As Shodu and Wicket walked back to the village, the former asked the latter where he had gotten the present in the first place. Wicket again tried to evade the question, but he eventually gave in, reluctantly telling her all about the temple. He explained that he had only done it to find his mother a fine present, but Shodu told him that the only present that mattered to her was being together with her family. Wicket then asked her to show him how to perform the flip she did against King Gorneesh, and Shodu warned him that she would show it to him up close if he were to again break the rules; Wicket chuckled weakly.\nShodu later attended a ceremony celebrating a number of Ewoks completing their Belts of Honor. The ceremony was interrupted by Wicket, who, attempting to warn Chief Chirpa of what he thought was a falling comet, accidentally rode in on Baga, causing a scene. After Chirpa determined that the so-called comet was only a lantern bird, he had Shodu escort away Wicket as well as Teebo, who was with him. Wicket asked his mother if she believed his claims about the comet, but she merely told him that she believed he would be in much trouble if he were to interrupt the ceremony once more. She kissed him on his head and told him and Teebo to behave themselves.\nHowever, in reality, the comet was a vessel that was utilized by a being known as the Stranger, who convinced the Duloks to attack the Ewok village. They did so happily, swinging in on vines and causing chaos. A pair of them chased after Winda, who ran inside the Warrick home, calling for her mother. They followed after her, only to be repelled by Shodu, who was angry that they tried to frighten her daughter; she picked up Winda, who shook her fist at the Duloks. The Stranger's real objective was the Sunstar, which he successfully—albeit temporarily—retrieved. Once the little Ewoks had reclaimed the Sunstar, Chirpa and Shodu rewarded them with Beads of Bravery.\nLater, after Wicket fought with a hanadak, several of Wicket's friends assumed that he was dead. Among them was Teebo, who, after finding Wicket's slingshot, said that Shodu would want to have her son's weapon. They later discovered that he had survived and had been taken in by a village of mimphs. Shodu also helped prepare for the Ewok Fishing Festival; she and Malani were responsible for preparing a net. After she was done with her half, she checked on Malani's, who proclaimed that she, too, had finished. Shodu complimented Malani on her first attempt, who thanked her. Shodu then gave Malani a kiss.\nAt another point, Shodu was walking in the village, attempting to hold both Winda and a basket of sunberries. Baga trotted over to her to help, though after Shodu gave him the basket, the weight became too much for the bordok, who collapsed beneath it. As Shodu cried out, the disguised quarf known as Silky walked over and picked up the basket with its mouth. Shodu chuckled and noted Silky's wonder.\nFor a later Ewok carnival, Shodu baked many sunberry pies. As she needed many sunberries for the job, she had her son Wicket retrieve more for her. When he came back, he was accompanied by Kneesaa, who noted that Shodu's pies were always good enough to take first prize. Wicket then attempted to sneak away, but Shodu stopped him and asked for him to take Winda to a Tumble Bunnies show. When Wicket resisted, his mother reminded him that all of his friends had been given the same responsibility for their respective siblings. She also hinted that her giving Wicket permission to go on the warriors' overnight trip hinged on his doing a good job. Wicket relented and went to see the bunnies' show.\nHowever, Wicket went against his mother's instructions, and instead of taking the woklings to see the show, he took them to Horville's Hut of Horrors, where they were greatly frightened. Afterward, he took them back home, where he could not get the young woklings to stop crying. Shodu and the other adult Ewoks then returned, with Shodu inquiring what was happening. Quickly trying to cover, he told Shodu that they were having a sleepover and that their crying was simply for more of Shodu's sunberry pie. Weechee, who had arrived with Shodu, had noticed that the Hut of Horrors was back in town, and he recalled that when he had taken Willy to see the show, he had been unable to sleep at night for days. Shodu chimed in, remembering that she thought his nightmares from the hut would never end.\nThat night, as several of the Ewoks and woklings had a sleepover at Wicket's house, Shodu wished all of them goodnight. Wicket used a device that had been built by Logray to prevent the woklings from experiencing nightmares; however, the device malfunctioned, and all of the dreams were instead given to Wicket. Shodu appeared in the dreams, where she told him that he would be banned from leaving the house for scaring his sister. In reality, Shodu was sitting next to Wicket, trying to wake him up from his apparent nightmare. It was then that he came clean to Shodu, professing having taken the woklings to the Hut of Horrors. She then understood why the nightmares had occurred and thanked him for telling the truth. Wicket still wished to go to the overnight trip with the other warriors, but Shodu told him he would be permitted to go on the next one as he would be busy that day; Wicket was forced to act as the new host of the Tumble Bunny show instead of the regular Tumble Bunny trainer.\nShodu later took in a young individual named Norky when his mother and father were away. When Norky arrived, he handed Shodu a bunch of flowers, which the latter considered sweet. Wicket was not excited for Norky to be there, as he was prone to troublemaking. Indeed, right away he stole all of the cookies that Shodu had baked and framed Wicket and Teebo for doing so, which caused Shodu to be upset. She ordered them to go to Kneesaa's to borrow acorn paste in order to make more.\nLater that day, Norky caused trouble on several more occasions, including tricking Latara to fall into a river. When Shodu and the young Ewoks walked along nearby, he quickly explained that she had tripped in the mud. Shodu instructed Latara to go wash herself. Norky asked Shodu if he could stay any longer as he was having fun, and Shodu granted him permission. Shodu was also present when Norky's parents arrived to pick him up, where she assured them that he was no trouble at all.\nShodu was present at a battle where the Imperial Doctor Raygar attacked the village in search of the Sunstar. She held Winda during the battle, crying out that Raygar was attacking. Raygar was able to use his weapons to successfully steal the Sunstar and fly away. Several of the young Ewoks, who had been captured by Raygar's forces, returned following the battle in what they called a \"flying canoe.\"\nWhen Wicket suggested that they use the \"canoe\" to get the Sunstar back, Shodu cautioned that the vessel did not look safe to her. Latara insisted that the ship was safe, and she tried to prove her point by operating it and making it fly. However, once she did so, she did not know how to stop it, and the flying canoe flew away despite Shodu crying for them to wait. The Ewoks' mission was successful, and they later returned with the Sunstar; Shodu and many other Ewoks celebrated its being back home.\nAt a party that was intended to host Prince Delby, Shodu helped serve the food; however, the troublesome group known as the Pugs arrived in place of the prince, and they ate all of the food as quickly as possible, much to Shodu's shock.\nIn 3 ABY, Shodu was standing outside—near the edge of Bright Tree Village—with Winda in her arms alongside her husband, Deej, who was looking for Willy and Weechee, who had gone into the forests but had yet to return. As Deej went off in search of them, Wicket came up to his mother and conversed with her in Ewokese. He then ran off after Deej only to be told that he had to stay behind with Shodu.\nNevertheless, Wicket wandered off before returning with two Humans he had found: Cindel and Mace Towani. Wicket introduced the latter to Shodu, and they all sat down inside the Ewoks' hut. As Cindel told her brother that she felt unwell, Mace asked if they had any food for her. Shodu thus prepared and provided medicine for the ailing child.\nCindel declined it, however, claiming that she was not hungry. Mace then took his sister to a hammock so that she could sleep, but she was not responding to anything he said. As he tried to figure out if she could even hear him, Shodu again offered the medicine. Mace initially declined, thinking it was just more food as he could not understand Shodu's Ewokese, but she persisted, and Mace eventually realized what it was, trying it himself and feeding it to Cindel. The medicine helped, but Cindel still needed to rest.\nThe next day, Shodu was again present in the hut, holding Winda, when Mace tried to explain that he needed more medicine for Cindel. Mace and some other Ewoks went to a senoti tree in the forest where more medicine could be gathered, and once they came back, Shodu was able to serve more of it to Cindel. She also noticed that Mace was hurt after his journey to find the medicine; she tried to help him, but Mace declined, asking that she focus on helping Cindel.\nOnce Cindel was cured of her terrible fever and Shodu had nursed the young girl back to health, the Towanis' next goal was to find their missing parents. The night before Wicket embarked on the journey, Shodu tucked him into bed and then rocked Winda's bed. Shodu was crying, for no Ewok had ever returned from the lair of the Gorax where her family was intending to go. Deej noticed and motioned for her to come toward him, and he gave her a hug.\nShodu saw her sons, husband, and the Towanis off, giving each of her family members a hug prior to waving goodbye. She also kissed Deej as a farewell. The group's mission was successful, and they eventually returned with both of Cindel and Mace's parents. Shodu and Logray had been waiting for them when they came back. That night, a party was held to celebrate, which Shodu attended. At the party, she handed an item to Catarine, the children's mother, who thanked her.\nThat same year, Shodu was among the many Ewoks who were captured when a group of Sanyassan Marauders raided Bright Tree Village. She was with her family and Cindel Towani in one of the wagons that the Sanyassans used to mobilize the captured Ewoks. With Shodu's help, the Ewoks were able to make a hole in the bottom of the wagon; however, it was too small for all of them but Wicket and Towani, who used it to escape. Shodu and the remaining Ewoks were taken to a Sanyassan prison, where they were locked behind bars.\nTowani and Wicket later returned with their newfound friends, Noa Briqualon and Teek. After unlocking all of the cells, they followed Wicket to escape, with Shodu arming herself with a blaster. Briqualon used a small bomb to create a hole in a wall, which they all used to escape, running as fast as they could to Briqualon's starship. The Sanyassans were on their trail, however, and a battle between the two forces ensued.\nShodu participated in the battle, using her blaster to fire upon the Sanyassans. At one point, when blasterfire came her way, she retreated from the enemy, with a marauder chasing after her. Eventually, the battle was won by the Ewoks once Wicket killed the Sanyassan's King Terak, and Shodu watched as Briqualon and Towani said goodbye and prepared to depart from the moon in Briqualon's starship. Shodu waved to Towani as she climbed into the craft.\nShodu Warrick was kind and a loving mother to her four children, being very proud of all of them and fiercely protective. She came to refer to Wicket as \"honey drop.\" Although her husband was unaware of why Wicket was so adventurous, Shodu was able to recognize the similarities between Deej's youth and Wicket's. When Wicket prepared to go fishing, Shodu ensured that Winda could go along with him, making certain that she was not left out. Shodu would later get emotional when her two eldest sons, Weechee and Widdle, were to go to the Tree of Light, noting that it felt like they had grown up fast. She also expressed pride when Wicket began the process of becoming a warrior. Another time, when Wicket threatened to leave home forever, Shodu did not take him seriously, knowing her son well enough that she expected him to return. She did not believe Wicket when he claimed to have seen a comet fall from the sky, just as when Wicket was wrongly accused of stealing cookies, she did not believe his innocence and forced him to get ingredients to make more.\nOn her birthday, Shodu was polite when Malani presented her with a cake despite the effort it took to swallow. She was very thankful to Wicket for his gift to her, and she resisted when the Duloks tried to take it from her. After one of them tried to harm her son, she became angry and proceeded to fight off the Duloks. After Wicket tried to apologize for not getting his mother a good gift, Shodu insisted that the best present she could receive was being with her family. Shodu and Wicket bonded much during the ordeal. She was also a loving wife, evidenced by her great worry for Deej when he became ill.\nWhen Cindel Towani was brought ill to her hut, Shodu Warrick tried to heal her with her medicine, persistently offering it until the young girl accepted it. She later became very distressed at the thought of most of her children traveling to the gorax's lair, a location considered a death trap by the Ewoks. She was calmed down by Deej, who hugged her, although her worry did not fully dissipate. Warrick had yellow eyes and brown fur that was later gray.\nWarrick was an award-winning pie maker. In addition to having fighting abilities that allowed her to hold off several Duloks, she was also a skilled herbalist, able to heal Cindel Towani of a terrible fever. She could also use her herbalist skills to produce medicines from plants to treat common ailments.\nWarrick at times wore a yellow dress with a pink hood that had flowers on its top. On other occasions, she wore a red-and-brown dress that also featured a flower on its hood. At night she donned purple pajamas. She also wore gold earrings in her ears along with a necklace.\nShodu Warrick was created for the 1984 television film Caravan of Courage: An Ewok Adventure, in which she was portrayed by Pam Grizz and voiced by Nancy Carlin. Caravan of Courage was filmed in Marin County, California between June and August of 1984. Grizz returned to play Warrick in the 1985 film Ewoks: The Battle for Endor.\nWarrick was later a main character in both seasons of the animated series Ewoks; in the first season, which aired in 1985, she was voiced by Nonnie Griffin, while in 1986's second season, she was voiced by Esther Scott. Producer and writer Paul Dini noted that for Season One, Shodu was among the characters who they wished to avoid writing out or killing off, so she was merely given a side role; her role was significantly increased for Season Two as the series' producers wished to play up her strong, maternal image as opposed to just being a background character. Her character model also received an update, now appearing fattened-up.\nDuring the 1988 marketing for Ewoks, Warrick was among twelve characters from the series along with the Star Wars: Droids series that appeared on the packaging for Dairylea cheese products. Shodu was first given the last name of \"Warrick\"—akin to her family name—in 2008's The Complete Star Wars Encyclopedia. In the 2013 non-canon video game Star Wars: Tiny Death Star, Warrick was available among many other characters as a Bitizen that could be obtained from one of the game's Salvage Missions.\nOne of the episodes in which Warrick appears, \"To Save Deej\"—which aired on October 28, 1985—was adapted into a young readers book titled Wicket and the Dandelion Warriors: An Ewok Adventure. Published on November 12 of that year, the book contained several differences from the episode. Shodu is given the line \"Can you save my husband?\", a line which Wicket originally had in the episode that instead went, \"Isn't there something we can do?\" In the original episode's end, when Weechee, Willy, and Wicket return with ingredients for a cure, Wicket asks if there is still time to save Deej, and Shodu confirms that there is.\nThe book portrays this scene differently: when Wicket arrives, Logray dejectedly says that no time remains. Shodu then insists that there is, instructing Wicket to give Logray the ingredients so that the cure can be made. The other lines of dialogue that the adaptation adds do not contradict with the episode. As such, this article portrays both the episode and the book as canon, deferring to the original source where the two contradict.\nA second adaptation of the episode, also titled To Save Deej, misspells Warrick's name as \"Shodi.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wicket_Wystri_Warrick%27s_mother",
  "/wiki/Shodu_Warrick",
  "/wiki/Endor/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bright_Tree_Village_tribe",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Deej_Warrick",
  "/wiki/Reproduction/Legends",
  "/wiki/Warrick_family/Legends",
  "/wiki/Weechee_Warrick",
  "/wiki/Widdle_Warrick/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Winda_Warrick",
  "/wiki/3_ABY/Legends",
  "/wiki/Fungus/Legends",
  "/wiki/Shaman/Legends",
  "/wiki/Logray/Legends",
  "/wiki/Antidote/Legends",
  "/wiki/Time/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Birthday/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Unidentified_serpent_species",
  "/wiki/Egg/Legends",
  "/wiki/Dulok/Legends",
  "/wiki/Gorneesh",
  "/wiki/Bright_Tree_F%C3%AAte",
  "/wiki/Sunberry_pie",
  "/wiki/Wokling/Legends",
  "/wiki/Tumble_Bunny",
  "/wiki/Horville%27s_Hut_of_Horrors",
  "/wiki/Towani_family",
  "/wiki/Human/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Cindel_Towani",
  "/wiki/Mace_Towani",
  "/wiki/Sanyassan_Marauders",
  "/wiki/Battle_of_Endor_(Ewok%E2%80%93Sanyassan_conflict)",
  "/wiki/Homeworld/Legends",
  "/wiki/Local_day/Legends",
  "/wiki/Fishing/Legends",
  "/wiki/Water/Legends",
  "/wiki/Trout",
  "/wiki/Berry/Legends",
  "/wiki/Bordok/Legends",
  "/wiki/Baga",
  "/wiki/Poison_ivy",
  "/wiki/Limb/Legends",
  "/wiki/Logray%27s_hut",
  "/wiki/Festival_of_the_Wisties",
  "/wiki/Wistie_Fest_pie",
  "/wiki/Raft",
  "/wiki/Cave/Legends",
  "/wiki/Magic_stone",
  "/wiki/Species/Legends",
  "/wiki/Shadowroot_soap",
  "/wiki/Rokna_tree_fungus",
  "/wiki/Forest/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Tree_of_Light",
  "/wiki/Fire/Legends",
  "/wiki/Sunstar/Legends",
  "/wiki/Shadowstone",
  "/wiki/Standard_day/Legends",
  "/wiki/Wood/Legends",
  "/wiki/Fruit/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Gourd/Legends",
  "/wiki/Scarf/Legends",
  "/wiki/Munyip/Legends",
  "/wiki/Totem_Master",
  "/wiki/Magic",
  "/wiki/Lost_Temple",
  "/wiki/Gemstone/Legends",
  "/wiki/Music/Legends",
  "/wiki/Malani",
  "/wiki/Birthday_cake",
  "/wiki/Cake/Legends",
  "/wiki/Latara",
  "/wiki/Snake/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Umwak",
  "/wiki/King/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Urgah",
  "/wiki/Nose/Legends",
  "/wiki/Belt_of_Honor",
  "/wiki/Chief/Legends",
  "/wiki/Chirpa/Legends",
  "/wiki/Comet/Legends",
  "/wiki/Lantern_bird/Legends",
  "/wiki/Stranger",
  "/wiki/Vine/Legends",
  "/wiki/Bead_of_Bravery",
  "/wiki/Hanadak",
  "/wiki/Death/Legends",
  "/wiki/Slingshot/Legends",
  "/wiki/Weapon/Legends",
  "/wiki/Mimph_village",
  "/wiki/Mimph",
  "/wiki/Fishing_Festival",
  "/wiki/Sunberry/Legends",
  "/wiki/Quarf",
  "/wiki/Silky",
  "/wiki/Mouth/Legends",
  "/wiki/Warriors%27_overnight_trip",
  "/wiki/Bunny",
  "/wiki/Dream_sucking_device",
  "/wiki/Unidentified_Tumble_Bunny_trainer",
  "/wiki/Norky",
  "/wiki/Norky%27s_mother",
  "/wiki/Norky%27s_father",
  "/wiki/Flower/Legends",
  "/wiki/Cookie/Legends",
  "/wiki/Acorn_paste",
  "/wiki/Battle_of_Bright_Tree_Village_(Imperial-Ewok_War)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Raygar",
  "/wiki/Escape_pod/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Delby",
  "/wiki/Foodstuff/Legends",
  "/wiki/Pugs",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Ewokese/Legends",
  "/wiki/Senoti",
  "/wiki/Tree/Legends",
  "/wiki/Catarine_Towani",
  "/wiki/Jeremitt_Towani",
  "/wiki/Gorax/Legends",
  "/wiki/Raid_on_Bright_Tree_Village",
  "/wiki/Sanyassan",
  "/wiki/Terak%27s_Keep",
  "/wiki/Prison/Legends",
  "/wiki/Noa_Briqualon",
  "/wiki/Teek",
  "/wiki/Blaster/Legends",
  "/wiki/Bomb/Legends",
  "/wiki/Noa_Briqualon%27s_starship",
  "/wiki/Terak",
  "/wiki/Eye/Legends",
  "/wiki/Pie/Legends",
  "/wiki/Herbalist",
  "/wiki/Plant/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Piercing/Legends",
  "/wiki/Ear/Legends",
  "/wiki/1984",
  "/wiki/Caravan_of_Courage:_An_Ewok_Adventure",
  "/wiki/Pam_Grizz",
  "/wiki/Nancy_Carlin",
  "/wiki/June",
  "/wiki/August",
  "/wiki/1985",
  "/wiki/Ewoks:_The_Battle_for_Endor",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/Ewoks:_Season_One",
  "/wiki/Nonnie_Griffin",
  "/wiki/1986",
  "/wiki/Ewoks:_Season_Two",
  "/wiki/Esther_Scott",
  "/wiki/Paul_Dini",
  "/wiki/1988",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2013",
  "/wiki/Canon",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Tiny_Death_Star",
  "/wiki/Bitizen",
  "/wiki/To_Save_Deej",
  "/wiki/October_28",
  "/wiki/Wicket_and_the_Dandelion_Warriors:_An_Ewok_Adventure",
  "/wiki/November_12",
  "/wiki/To_Save_Deej_(book)",
  "/wiki/Category:Images_of_Shodu_Warrick",
  "/wiki/Wicket_Goes_Fishing:_An_Ewok_Adventure",
  "/wiki/Fuzzy_as_an_Ewok",
  "/wiki/The_Ewok_Who_Was_Afraid:_An_Ewok_Adventure",
  "/wiki/The_Haunted_Village",
  "/wiki/Ewoks_(Plaza_Joven)",
  "/wiki/The_Tree_of_Light",
  "/wiki/Sunstar_vs._Shadowstone",
  "/wiki/The_Crystal_Cloak",
  "/wiki/Home_is_Where_the_Shrieks_Are",
  "/wiki/The_Totem_Master",
  "/wiki/A_Gift_for_Shodu",
  "/wiki/Night_of_the_Stranger",
  "/wiki/Gone_With_the_Mimphs",
  "/wiki/Prow_Beaten",
  "/wiki/Baga%27s_Rival",
  "/wiki/Horville%27s_Hut_of_Horrors_(episode)",
  "/wiki/Bringing_Up_Norky",
  "/wiki/Battle_for_the_Sunstar",
  "/wiki/Party_Ewok",
  "/wiki/The_Ewoks_and_the_Lost_Children",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_Ewoks_(toy_line)",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Endor_Limited",
  "/wiki/Galactic_Phrase_Book_%26_Travel_Guide_(real-life_book)",
  "/wiki/StarWars.com",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_1",
  "/wiki/The_Official_Star_Wars_Fact_File_87",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_14",
  "/wiki/Droids,_Aliens_%26_Creatures",
  "/wiki/25_Years_of_Collecting_Droids_and_Ewoks!",
  "/wiki/Databank_(original)",
  "/wiki/Yub_Yub:_Meet_the_Ewoks_from_Endor",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Starlog_(magazine)",
  "/wiki/Saturday_Morning_%22Star_Wars%22",
  "/wiki/Special:BookSources/978-1538103739",
  "/wiki/October_25",
  "/wiki/2021"
 ]
}