{
 "name": "Shogar Tok",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Brentaal IV"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Brentaal IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Shogar Tok was a Human male clan leader and warlord on the planet Brentaal IV allied with the Confederacy of Independent Systems.\nShogar Tok was a Human male from the planet Brentaal IV. As a clan leader, he captured a prison facility on Brentaal IV during the early stages of the Clone Wars, converting it into his base of operations. He rallied his people against the Galactic Republic, and established a military presence on the planet. This drew the attention of the Republic, and a task force was dispatched to retake Brentaal IV. Jedi Masters Plo Koon, Agen Kolar, and Shaak Ti led their troops against Tok's forces, though Count Dooku ordered Tok himself to remain away from the frontlines, secure within his fortress.\nHowever, in time, even Shogar Tok's headquarters were penetrated by the enemy. Shaak Ti confronted Tok in his command center, forcing the Zeltron murderer Lyshaa to seduce Tok and cloud his emotions. Though Lyshaa accomplished this, she betrayed Shaak Ti, shooting her in the stomach before the Jedi could order Tok to surrender. Lyshaa informed Shogar of Shaak Ti's intentions, gaining Tok's gratitude. However, Shaak Ti recovered from her wound, and engaged Tok in a fierce duel, with Ti using her lightsaber and Tok his vibro-ax, which was presumable made of one of the few lightsaber resistant metals.\nDespite her weakened condition, Shaak managed to best Shogar Tok, stabbing him through the gut with her lightsaber. Tok's fortress defenses were destroyed, and his leaderless troops were forced to surrender.\nShogar's name is once misspelled as \"Hogar.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Agen_Kolar/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Zeltron/Legends",
  "/wiki/Lyshaa",
  "/wiki/Lightsaber/Legends",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Jedi:_Shaak_Ti",
  "/wiki/Star_Wars_Insider",
  "/wiki/CIS_Shadowfeed_Dispatch_14:9:15_Edition",
  "/wiki/Star_Wars_Insider_70",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Databank_(original)"
 ]
}