{
 "name": "Shok Tinoktin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rhommamool"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nom Anor",
      "Red Knights of Life",
      "Rhommamoolian Senate"
     ]
    }
   ]
  }
 ],
 "content": "Shok Tinoktin was a Human native of Rhommamool. In 25 ABY, he became allied with Nom Anor, a fanatical despiser of machines and his followers, the Red Knights of Life.\nDuring the Osarian-Rhommamool conflict in 25 ABY, shortly before the onset of the Yuuzhan Vong War, the Human male Shok Tinoktin was drafted into the anti-technology terrorist group known as the Red Knights of Life. He later served on the Rhommamoolian Senate as one of group leader Nom Anor's advisors on Rhommamool and became one of his closest associates, though Tinoktin remained ignorant of Anor's true nature as a Yuuzhan Vong agent.\nTinoktin was later present at a meeting in the Rhommamoolian capital Redhaven attended by former New Republic Chief of State Leia Organa Solo, Mara Jade Skywalker, their protocol droid C-3PO and the Noghri Bolpuhr. Following a missile attack on neighboring Osarian, Anor and Tinoktin fled Rhommamool in a disguised A-wing piloted by Tinoktin; Anor faked his death aboard the intervening New Republic cruiser Mediator using a primitive rocket-based shuttle packed with nuclear explosives, which was remotely guided by Tinoktin. Tinoktin later fell asleep in the fighter's cockpit, barely missing Anor's conversation with Yuuzhan Vong Prefect Da'Gara regarding the destruction of Sernpidal. Catching the final words of the discussion but not comprehending what had been said, Tinoktin assumed that Anor was merely preparing another speech.\nIn 26 ABY, during a confrontation with Skywalker and Jaina Solo on Duro, Anor revealed that Shok Tinoktin had been well rewarded for his faithful service to both Anor and the Red Knights of Life.\nShok Tinoktin was largely unintelligent and ignorant, and was utterly unaware of Nom Anor's true allegiances to the Yuuzhan Vong, simply believing him to be a pro-organic radical. He was also afraid of Anor, dreading any scenario in which the Red Knight's leader would look on him with disfavor. He was lanky and reedy, and likened by Jaina Solo to a mouse.\nShok Tinoktin was a reasonably skilled pilot, working overtime to guide Nom Anor's decoy rocket toward the Mediator so as to deliver its explosive payload. He was also somewhat proficient in handling an A-wing interceptor, being trusted by Anor to fly such a craft.\nShok Tinoktin was first introduced in R. A. Salvatore's 1999 novel The New Jedi Order: Vector Prime, the first in the New Jedi Order series. He also received a brief mention in a later novel, The New Jedi Order: Balance Point by Kathy Tyers, which was published in 2000.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rhommamool/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Nom_Anor",
  "/wiki/Red_Knights_of_Life",
  "/wiki/Rhommamoolian_Senate",
  "/wiki/The_New_Jedi_Order:_Vector_Prime",
  "/wiki/Rhommamoolian",
  "/wiki/25_ABY/Legends",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/Osarian-Rhommamool_conflict",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Redhaven",
  "/wiki/New_Republic/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Protocol_droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Bolpuhr",
  "/wiki/Missile/Legends",
  "/wiki/Battle_of_Osarian",
  "/wiki/Osarian",
  "/wiki/RZ-1_A-wing_interceptor/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Death/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Mediator_(Mediator-class)",
  "/wiki/Shuttle/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Cockpit/Legends",
  "/wiki/Prefect_(Yuuzhan_Vong_rank)",
  "/wiki/Da%27Gara",
  "/wiki/Destruction_of_Sernpidal",
  "/wiki/Sernpidal/Legends",
  "/wiki/26_ABY",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Duro/Legends",
  "/wiki/Mouse/Legends",
  "/wiki/Interceptor/Legends",
  "/wiki/R._A._Salvatore",
  "/wiki/1999",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/Kathy_Tyers",
  "/wiki/2000",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}