{
 "name": "Shollan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Navy",
      "Rebel Alliance Navy"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Shollan was a Mon Calamari male who served under Admiral Raddus in the Rebel Alliance. Hailing from the waterworld of Mon Cala, he and fellow Mon Calamari Caitken were aides to Raddus, and in 0 BBY, the three attended a briefing where the possibility of an attack on the world of Scarif to steal the Death Star plans was discussed. When the mission was carried out by a group of rogue rebels, Raddus joined their attack, and he took his flagship, the Profundity, to join them on Scarif, with Shollan and Caitken by his side.\nAt Scarif, Shollan gave Raddus several updates throughout the course of the battle. Later on, the Profundity was able to destroy the Shield Gate at the instructions of former Imperial pilot Bodhi Rook, who was on the surface, at which point Shollan excitedly reported to Raddus that they were receiving a transmission from Scarif. The Death Star whose plans they had stolen then emerged from hyperspace. Raddus then called for the fleet to jump to hyperspace; however, the Profundity was disabled by the Imperial Star Destroyer, and most of the crew aboard it perished.\nShollan hailed from the waterworld of Mon Cala on the planet's colder polar regions. He served as a lieutenant and comms officer in the Alliance to Restore the Republic. He, alongside fellow Mon Calamari Caitken, was an aide to Admiral Raddus and, at some point, put together a report on the status of the Alliance Fleet starships, which Raddus then forwarded to Alliance leader Mon Mothma. Shollan and Caitken stood next to him in 0 BBY during a meeting in Alliance headquarters on the planet Yavin 4 in which Alliance High Command discussed whether or not the intel from the recently rescued Jyn Erso on the Galactic Empire's Death Star superweapon was accurate. However, without the full support of the council, an attack would not be authorized.\nNonetheless, Erso along with many other rebels commandeered a Zeta-class Heavy Cargo Shuttle that the Alliance had stolen from the Empire, intending to go to Scarif to steal the Death Star plans. Raddus was informed of this move and agreed with it. With Shollan and Caitken at his side, he ordered that his flagship, the MC75 Star Cruiser Profundity, be made ready for departure. It quickly was, and the fleet made the jump to hyperspace.\nThe Alliance Fleet arrived at Scarif, and Raddus ordered the squadron leaders where to take their starfighters as Shollan and Caitken interacted with devices affixed to their chairs. As the battle progressed, Raddus asked Lieutenant Shollan what was occurring below them inside the Shield Gate. However, Shollan reported that that information was unknown and that they had tried to raise the rebels there, but all rebel frequencies were blocked, and communications were jammed by the Shield Gate. Raddus turned around to inform him to keep trying, and he ordered him to engage the Imperial I-class Star Destroyers and begin probing of the shield.\nAs rebel forces were lost in the battle, Shollan informed Raddus that they were having no effect on the Shield Gate and were sustaining heavy losses, which the admiral affirmed. When the Y-wing starfighters of Gold Squadron disabled a Star Destroyer, Shollan called out that the destroyer had lost power.\nLater in the battle, former Imperial pilot Bodhi Rook, who was on Scarif, tried to contact the rebel fleet to inform them that they would have to break open the Shield Gate in order to transmit the Death Star Plans. He reached the Profundity, and Raddus confirmed to Rook that they heard him as Shollan listened. As Rook explained the situation, Raddus ordered Shollan and the other Rebels behind him to call up a Sphyrna-class Hammerhead corvette. The corvette successfully knocked one Star Destroyer into the other, causing both of them to fall to the planet's surface and destroy the Shield Gate. Shollan stood up in his place as the plans were beamed to the Profundity, excitedly informing Raddus that they were receiving a transmission from Scarif. Raddus ordered him to check the data, and once he did so, he eagerly told the Admiral that they had the plans.\nHowever, the Death Star whose plans they had retrieved then emerged from hyperspace. Shollan and Caitken stood up on the bridge to look at it. Shollan called out to Raddus that there was a massive energy buildup in the battle station, but the admiral cut him off. The station targeted the Imperial security complex below, where Rogue One was trapped. Shollan, Raddus, and Caitken watched as the complex and surrounding area was destroyed. After a moment of silence, Raddus ordered all craft to jump to hyperspace; many ships did so successfully, but the Profundity was then disabled by a Star Destroyer and destroyed, with most of the crew perishing.\nShollan, along with Raddus and Caitken, was eager to pay back the Empire for what they did to the Mon Calamari. He and Caitken promised to Raddus their all. Shollan was a male Mon Calamari with gray eyes and albino, white skin. Due to his hailing from the colder regions of Mon Cala, his blood was said to have been especially thick.\nShollan was efficient in following Raddus's orders. He was highly intelligent and had advanced diplomatic skills, along with average speed, strength, and fighting ability. He was not Force-sensitive.\nHe wore a dark, gray uniform with blue sleeves and a black belt. He also carried a datapad.\nShollan was created for the anthology film Rogue One: A Star Wars Story, released December 16, 2016, where he was portrayed by Tim Rose, a puppeteer who portrayed another Mon Calamari, Admiral Gial Ackbar, in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. Rose was credited as a creature puppeteer. An image of Shollan was first showcased in a StarWars.com article titled \"Much to Learn You Still Have: 10 Things You Might Not Know about the Mon Calamari,\" published August 31, 2016.\nAt one point during the production of Rogue One, after filming for six hours without taking a break, Rose held up one of Shollan's hands to indicate that he needed to take a break to use the bathroom, which he was then granted. Shollan was simultaneously identified in two accompanying reference books to Rogue One: Star Wars: Rogue One: The Ultimate Visual Guide and Art of Coloring: Rogue One: A Star Wars Story. Art of Coloring confirmed that Shollan is the Mon Calamari referred to as lieutenant in the film.\nThe novelization for Rogue One by Alexander Freed mistakenly attributes the line \"Sir! Enemy fighters coming in!\" to Shollan, while the film shows Caitken saying it.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mon_Cala",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/File:Shollan-Plans.ogg",
  "/wiki/Lieutenant",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Homeworld",
  "/wiki/Waterworld",
  "/wiki/Caitken",
  "/wiki/Aide",
  "/wiki/0_BBY",
  "/wiki/Battle_of_Scarif",
  "/wiki/Planet",
  "/wiki/Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Rogue_One",
  "/wiki/Flagship",
  "/wiki/Profundity",
  "/wiki/Galactic_Empire",
  "/wiki/Pilot",
  "/wiki/Bodhi_Rook",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Fleet",
  "/wiki/Hyperspace",
  "/wiki/Devastator",
  "/wiki/File:Raddus-Fight.ogg",
  "/wiki/Communications_Officer",
  "/wiki/Starship",
  "/wiki/Mon_Mothma",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Alliance_High_Command",
  "/wiki/Jyn_Erso",
  "/wiki/Superweapon",
  "/wiki/Zeta-class_Heavy_Cargo_Shuttle",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/File:Raddus-Shollan-Blocked.ogg",
  "/wiki/Squad_leader",
  "/wiki/Starfighter",
  "/wiki/Shield_Gate",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Gold_Squadron",
  "/wiki/Star_Destroyer",
  "/wiki/Destroyer",
  "/wiki/File:Shollan-Transmission.ogg",
  "/wiki/Death_Star",
  "/wiki/Sphyrna-class_Hammerhead_corvette",
  "/wiki/Corvette",
  "/wiki/Persecutor",
  "/wiki/Intimidator",
  "/wiki/Battle_station",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/File:Raddus-Shollan-Probing.ogg",
  "/wiki/Albinism",
  "/wiki/Blood",
  "/wiki/Force-sensitive",
  "/wiki/Belt",
  "/wiki/Datapad",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/December_16",
  "/wiki/2016",
  "/wiki/Tim_Rose",
  "/wiki/Gial_Ackbar",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/StarWars.com",
  "/wiki/August_31",
  "/wiki/Limb",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Art_of_Coloring:_Rogue_One:_A_Star_Wars_Story",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Alexander_Freed",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Star_Wars",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars_Insider",
  "/wiki/Building_the_Death_Star",
  "/wiki/Star_Wars_Insider_170",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2017_Topps_Star_Wars:_Rogue_One_Series_2",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Profundity_Expansion_Pack",
  "/wiki/Unsung_Heroes",
  "/wiki/Star_Wars_Insider_179",
  "/wiki/2018_Topps_Star_Wars_Galactic_Files",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider_Special_Edition_2020",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_90",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_14",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Category:Audio_files_of_Shollan",
  "/wiki/Category:Images_of_Shollan",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Last_Jedi:_Incredible_Cross-Sections",
  "/wiki/May_24",
  "/wiki/2021"
 ]
}