{
 "name": "Shonmai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dac"
     ]
    },
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Calamari Rangers"
     ]
    }
   ]
  }
 ],
 "content": "Shonmai was a female Mon Calamari and a Mon Calamari Ranger in 137 ABY. She survived the initial stages of the Genocide on Dac and fought for her people's safety alongside her fellow Rangers. Eventually, Shonmai sacrificed her life to bring down Vul Isen's Sea Leviathan, a creature which would have greatly expedited the extinction of the Mon Calamari race.\nShonmai and her fellow ranger Adriphar were scouting the area near the Devil's Crevasse when they spotted something abnormal on their scopes. Recognizing it to be too big to be an Acklay and not a native creature of Dac, the two Mon Cals approached the massive creature on a reconnaissance run. As they scouted the creature, they felt certain that Master Treis Sinde and Captain Tanquar should be informed of this new devilry. When they got closer, they were noticed by the Aquatic Terrain Armored Transport riding herd beside the beast. Shonmai told Adriphar to get out of there, but his Krakana was shot down by the vessel. He crashed into the monster and warned Shonmai to get back to the Ranger Grotto, before his life-force was sucked out by the beast.\nShocked by Adriphar's sudden death, Shonmai rushed back to the Grotto and told the other Rangers of the encounter. Tanquar began preparing for an attack against the beast in order to save the Mon Calamari refugees being attacked. Sinde, however, tried to dissuade the Rangers from performing a suicidal attack on the creature, which he revealed to be a Sith-created Sea Leviathan. He told them the creature had been specifically designed to kill them, but the Rangers were unwilling to let their people die as they waited in safety. Changing his mind about the attack, Sinde came up with a plan: The Rangers would attack and destroy the AT-AT swimmer, while he would use the Force to command a legion of Devilsquid to attack the Leviathan. Two extra Rangers would then use the empty crevasse to shelter the fleeing Mon Calamari.\nAs the rebel forces began their approach on Devil's Crevasse, Shonmai ignored Tanquar's order to sit out the battle, as she felt a need to fight for her people. When they reached the Leviathan and the AT-AT swimmer, Sinde swam into the Crevasse to commune with the Devilsquid while the rangers arced around the beast and began their attack on the swimmer. They pummeled the AT-AT with all they had, but the Krakana's plasma weapons could not pierce the swimmer's powerful shield, and the Leviathan, thus far unopposed, began to make short work of the fleeing refugees. They kept on attacking it, searching for a chink in its shielding, trying to give Master Sinde more time. Finally, as more Rangers herded the remaining refugees towards the Crevasse, Master Sinde and his Devilsquid horde rose up and swarmed the Leviathan. Overwhelmed, the Leviathan began to falter under the throng of Devilsquid. Believing it to be in danger, Sith Lord Darth Azard commanded the pilot to lower the shields surrounding the hangar and release the Sharks, in order to destroy the Krakana and eliminate the troublesome Devilsquid.\nShonmai informed Captain Tanquar of the lowered shields, but the blaster fire coming from the swimmer made it impossible for the other Krakana to swoop in and assist in destroying it. Seizing an opportunity, and using her close position to the hangar, Shonmai made a choice. She powered up her Krakana's drives to full and rammed directly into the swimmer's hangar, destroying it instantly, but costing her her life. Her sacrifice enabled the Krakana to destroy the Imperial Sharks, and the Devilsquid succeeded in pulling the Sea Leviathan into the Crevasse, where they devoured it. As Tanquar saved the injured Master Sinde, the Sith ringleaders escaped the wreckage of the AT-AT swimmer and escaped to the ocean's surface. The Mon Calamari were now afforded some small amount more of safety, at least from the Sea Leviathan. Afterwards, Sinde would remark that the battle had not really been a true victory for the Mon Calamari, but they had won the right to fight another day. He and Tanquar intended to make sure they were ready for it.\nShonmai appeared in the 2009 comic Legacy  33, the second issue of Star Wars: Legacy's Fight Another Day story arc. Her name was spelled \"Shonmoi\" twice in the first few pages of the comic. While it was most likely it was an editing mistake, it could have just been what Adriphar called her.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/137_ABY",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mon_Calamari_Rangers",
  "/wiki/One_Sith",
  "/wiki/Genocide_on_Dac",
  "/wiki/Vul_Isen",
  "/wiki/Sea_Leviathan",
  "/wiki/Adriphar",
  "/wiki/Devil%27s_Crevasse",
  "/wiki/Acklay-class_mobile_fortress",
  "/wiki/Imperial_Knight",
  "/wiki/Treis_Sinde",
  "/wiki/Captain/Legends",
  "/wiki/Tanquar",
  "/wiki/Aquatic_Terrain_Armored_Transport",
  "/wiki/Krakana_underwater_fighter",
  "/wiki/Ranger_Grotto",
  "/wiki/Animal_bond",
  "/wiki/Devilsquid",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Azard",
  "/wiki/Vehicle_Command_Crewer",
  "/wiki/Shark_underwater_fighter",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/2009",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_33",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars:_Legacy:_Fight_Another_Day"
 ]
}