{
 "name": "Shondra Del",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Shondra Del was a Human female Smuggler who served in the Rebel Alliance who operated in the Elrood sector during the Galactic Civil War.\nShondra Del was a female Human who lived during the reign of the Galactic Empire, and she made a living as a freighter captain and smuggler, operating within the Elrood sector. Following the outbreak of the Galactic Civil War, Del joined the Rebel Alliance, and she was tasked with handling the Alliance's operations in the Elrood sector. She established Rebel cells and supplied goods to the Friends of Paran resistance group, leading the Friends of Paran to consider affiliating themselves with the Alliance. Del also came into contact with the Khuiumin Survivors, a band of pirates led by Jacob Nive, and she met with them on the planet Korad. However, the pirates had been tracked by agents of the Imperial Security Bureau and the Survivors were captured. Del fled off-world to planet Merisee, but she was pursued by ISB agents and captured. She was taken by the Empire to the planet Derilyn and was sentenced to death by combat in the Arena of Games, an amphitheater in the city Tekar that was operated by the Imperial planetary governor General Afren Hul. However, Del was rescued from the area by the con artist Mikos Argdran and a team of Rebel agents. Del and the agents subsequently traveled to the Friends of Paran base in the city Knellis, and a short time later she assisted with a Friends of Paran mission to infiltrate the Derilyn Space Defense Platform and destroy the Star Destroyer Brazen. She was later killed during the Brazen's destruction.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Elrood_sector/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Friends_of_Paran",
  "/wiki/Khuiumin_Survivors",
  "/wiki/Pirate/Legends",
  "/wiki/Jacob_Nive",
  "/wiki/Planet/Legends",
  "/wiki/Korad",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Merisee",
  "/wiki/Derilyn",
  "/wiki/Death/Legends",
  "/wiki/Arena_of_Games",
  "/wiki/City/Legends",
  "/wiki/Tekar",
  "/wiki/Governor/Legends",
  "/wiki/General/Legends",
  "/wiki/Afren_Hul",
  "/wiki/Con_artist/Legends",
  "/wiki/Mikos_Argdran",
  "/wiki/Friends_of_Paran_base",
  "/wiki/Knellis",
  "/wiki/Derilyn_Space_Defense_Platform",
  "/wiki/Battle_of_Derilyn",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Brazen",
  "/wiki/Operation:_Elrood_(book)"
 ]
}