{
 "name": "Shoran",
 "display_name": "Shoran",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "17 ABY",
      "Pride of Yevetha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alaris Prime colonists",
      "Kashyyyk Resistance",
      "First Wookiee Expeditionary Force"
     ]
    }
   ]
  }
 ],
 "content": "Shoran was a male Wookiee and a close friend of the famous Wookiees Chewbacca and Attichitcuk. Shoran was one of the main leaders in the colonization of the moon Alaris Prime, where he, Chewbacca and Attichitcuk fought the Trade Federation for the rights to the world. He met up with Chewbacca years later and worked with him and his Human friend Han Solo to free their homeworld from the grip of the Galactic Empire. Shoran later joined with Chewbacca and several other Wookiees one last time to free Solo from the starship Pride of Yevetha. Shoran was killed during this mission.\nShoran, whose name meant \"fierce craftsman\" in Shyriiwook, was a male Wookiee born into a prominent extended family. His uncle was the Chieftain Attichitcuk, making Shoran the cousin of his son Chewbacca. He was also the cousin of the Wookiees Jowdrrl and Dryanta.\nBetween 39 and 36 BBY, Shoran was one of the first Wookiees to land on the rediscovered moon, Alaris Prime. Shoran landed on the world at the same time as his cousin Chewbacca, but went and scouted ahead, leaving several markers for Chewbacca to follow. Chewbacca followed the path Shoran had left with the help of Jedi Master Qui-Gon Jinn, who was sent to aid in the colonization. When his cousin caught up with him, Shoran said that there was an unusual structure ahead. The structure was in fact a power core built by the Trade Federation, a company that was illegally trying to colonize Alaris Prime, that had been damaged by gundarks, a major predator on Alaris Prime. Qui-Gon suggested that the Wookiees should destroy the power core as it was a hazard, which the two did. Shoran and Chewbacca then continued on the path until they reached the camp already built by Attichitcuk, Chewbacca's father. Upon their arrival the Wookiees had to defend the camp from attacking gundarks, which they successfully did. The Wookiees then continued preparing to transport more Wookiees to Alaris Prime.\nWhen the Wookiees made plans to exterminate the gundarks, they encountered battle droids from the Trade Federation, revealing their competing presence. Shoran established a walled camp and with Jinn's help established trade routes with Chewbacca's camp using Corellian HoverFreighters. Shoran found a Jedi holocron in his camp and informed Jinn, who asked Chewbacca to have his workers build a Jedi temple. After the construction Jinn sent his Padawan, Obi-Wan Kenobi, to retrieve the holocron from Shoran's camp. Shoran then spotted a Trade Federation strike force sent by the droid LUH-989 heading for Chewbacca's camp, which he warned Jinn and Chewbacca of. The attackers were destroyed by Chewbacca's soldiers, and Shoran requested 100 nova crystals to recover from the attack, which Chewbacca gave in thanks for his warning. In return Shoran sent 100 units of ore.\nScouts from Shoran's camp then discovered a listening array belonging to the Trade Federation. Combined with forces from Chewbacca's camp, Shoran participated in the attack on it which destroyed all the droids guarding the base's transmitters, which included B1-Series battle droids, beetle droids and destroyer droids. Afterwards, Chewbacca planned to remove the Trade Federation from Alaris Prime completely, setting up at a new base. Shoran began construction of the base's walls, which Chewbacca's workers completed. The Wookiee army, which included Attichitcuk and Jinn, razed the Trade Federation's base and its fortress, in the Battle for Alaris Prime, which secured the moon for the Wookiees.\nDuring the liberation of Kashyyyk many years later, Shoran met Han Solo and Chewbacca in the city of Chenachochan after they escaped from a trap set by Weebacca. Shoran helped them destroy three Imperial transmission jammers.\nIn 17 ABY, during the Black Fleet Crisis, Shoran died during the rescue of Han Solo from the Pride of Yevetha. Shoran's death was one of the examples given why Solo didn't want Chewbacca's life debt to continue through Jowdrrl and Dryanta in 25 ABY.\nShoran first appeared in the 1996 book of The Black Fleet Crisis trilogy, Tyrant's Test. He played a role in both the Attichitcuk and Chewbacca campaigns in the 2001 video game Star Wars: Galactic Battlegrounds. The campaigns were later included in the game's 2002 expansion pack, Clone Campaigns.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/17_ABY/Legends",
  "/wiki/Intimidator_(Executor-class)",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alaris_Prime_colonists",
  "/wiki/Kashyyyk_Resistance",
  "/wiki/First_Wookiee_Expeditionary_Force",
  "/wiki/Chewbacca/Legends",
  "/wiki/Attichitcuk/Legends",
  "/wiki/Alaris_Prime_colonial_war",
  "/wiki/Moon/Legends",
  "/wiki/Alaris_Prime/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Standard_year/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Liberation_of_Kashyyyk/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Black_Fleet_Crisis",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Attichitcuk%27s_family",
  "/wiki/Wookiee_Chieftain",
  "/wiki/Parent/Legends",
  "/wiki/Jowdrrl",
  "/wiki/Dryanta",
  "/wiki/File:Shoran_wilderness.ogg",
  "/wiki/39_BBY/Legends",
  "/wiki/36_BBY/Legends",
  "/wiki/Discovery_of_Alaris_Prime",
  "/wiki/Marker",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Power_core/Legends",
  "/wiki/Gundark/Legends",
  "/wiki/Attichitcuk%27s_camp",
  "/wiki/Skirmish_at_the_gundark_nest",
  "/wiki/Battle_droid/Legends",
  "/wiki/Shoran%27s_camp",
  "/wiki/Chewbacca%27s_camp",
  "/wiki/Corellian_HoverFreighter",
  "/wiki/Jedi_holocron_(Alaris_Prime)",
  "/wiki/Jedi_temple_(Alaris_Prime)",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Droid/Legends",
  "/wiki/LUH-989",
  "/wiki/Attack_on_Chewbacca%27s_camp",
  "/wiki/Nova_crystal/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Trade_Federation_listening_array",
  "/wiki/Attack_on_the_Trade_Federation_listening_array",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Beetle_droid",
  "/wiki/P-series_destroyer_droid",
  "/wiki/Unidentified_Wookiee_base_(fortress)",
  "/wiki/Army/Legends",
  "/wiki/Unidentified_Trade_Federation_base",
  "/wiki/Battle_for_Alaris_Prime",
  "/wiki/Kashyyyk/Legends",
  "/wiki/City/Legends",
  "/wiki/Chenachochan",
  "/wiki/Weebacca",
  "/wiki/Special:EditPage/:Shoran",
  "/wiki/25_ABY/Legends",
  "/wiki/1996",
  "/wiki/The_Black_Fleet_Crisis",
  "/wiki/Tyrant%27s_Test",
  "/wiki/2001",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/2002",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Category:Images_of_Shoran",
  "/wiki/Rebel_Dawn",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_9",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/Galactic_Campaign_Guide",
  "/wiki/The_New_Essential_Chronology"
 ]
}