{
 "name": "Shorwarr",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Shorwarr was a male Wookiee who used the title of captain and worked as a hunter during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. Shorwarr made his living mainly by hunting Nexu, a predatory species native to the planet Cholganna. He was well known throughout the galaxy as a purveyor of exotic animals, and was also known to be one of the few individuals to actually travel to Cholganna, where he maintained a hidden base known as Camp Danger. Shorwarr was willing to act as a guide for other wishing to hunt Nexu, although he had an extremely quick temper and did not tolerate betrayal of any kind from those he worked with. He flew an ILH-KK Citadel-class civilian cruiser named Starblue Ranger which was customised to include cages and storage lockers in the hull. While hunting he made use of a Bowcaster, a Bola and a Ryyk blade.\nShorwarr first appeared in 2013 in Beyond the Rim, an adventure module written by Sterling Hershey for the Fantasy Flight Games roleplaying game, Star Wars: Edge of the Empire. He did not feature in the main story which the book revolved around but was included as a character for use in further campaigns extending from the included campaign.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Nexu/Legends",
  "/wiki/Species/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cholganna/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Camp_Danger",
  "/wiki/ILH-KK_Citadel-class_civilian_cruiser",
  "/wiki/Starblue_Ranger",
  "/wiki/Bowcaster/Legends",
  "/wiki/Bola/Legends",
  "/wiki/Ryyk_blade/Legends",
  "/wiki/2013",
  "/wiki/Beyond_the_Rim",
  "/wiki/Sterling_Hershey",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}