{
 "name": "Shura_(Sith)",
 "display_name": "Shura  (Sith)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Shura was a Human female Sith Saber in the Lost Tribe of Sith from the remote planet Kesh. In 41 ABY, Sith Tyro Vestara Khai was summoned to the Circle of Lords. When the Tyro arrived, Shura took Khai to the Circle Chambers, the room where the Circle of Lords convened.\nShura was a Force-sensitive Human female who was born on the remote Wild Space planet Kesh and lived around the time of the Second Galactic Civil War. She was trained by the Lost Tribe of Sith—descendants of a group of Sith who had been stranded on Kesh during the days of the Sith Empire—and, by 41 ABY, had ascended to the rank of Sith Saber. During that year, Ship, a Sith Meditation Sphere, arrived on Kesh. The Sphere developed a strong connection in the Force with the Sith Tyro Vestara Khai, resulting in Khai being summoned to the Circle of Lords, the governing body of the tribe, in Tahv, the capital city of Kesh.\nShura, together with a male and a female Sith Saber, awaited Khai at the capitol building in Tahv. When Khai arrived, Shura took Khai to the Circle Chambers, the room in which the Circle of Lords convened, via a winding staircase. Upon reaching the top of the stairs, Shura used the Force to open the entrance to the chambers.\nUpon first meeting Khai, Shura examined the young Tyro evenly, and when the Sith Tyro bowed before the three Sabers, Shura acknowledged her with a nod. After being introduced to the Tyro, she ordered Khai to follow her and led her to the Circle Chambers without further ceremony.\nShura possessed the abilities required to achieve the rank of Sith Saber and was strong enough in telekinesis to open the entrance to the Circle Chambers, which was hidden in a stone wall at the top of the capitol building. Khai was unable to feel Shura's presence in the Force until she heard the sound of the boots of the three approaching Sabers.\nShura appeared in the 2009 novel Fate of the Jedi: Omen, written by Christie Golden. She served as a minor character in the novel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Sith_Saber",
  "/wiki/Planet/Legends",
  "/wiki/41_ABY",
  "/wiki/Sith_Tyro",
  "/wiki/Vestara_Khai",
  "/wiki/Circle_of_Lords",
  "/wiki/Circle_Chambers",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Sith_training",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Ship_(Sith_Meditation_Sphere)",
  "/wiki/Sith_Meditation_Sphere",
  "/wiki/The_Force/Legends",
  "/wiki/Tahv",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Unidentified_male_Sith_Saber_(Kesh)",
  "/wiki/Unidentified_dark-skinned_Sith_Saber",
  "/wiki/Kesh_capitol_building",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Boot/Legends",
  "/wiki/2009",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Christie_Golden",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}