{
 "name": "Shymon",
 "display_name": "Shymon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "204th Imperial Fighter Wing",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Shymon was a human female TIE fighter pilot in the Galactic Empire's 204th Imperial Fighter Wing. In 5 ABY, the fighter wing was pursued by New Republic forces led by General Hera Syndulla. During the third encounter between both parties, Syndulla's refitted Star Destroyer, the Deliverance, locked on to the 204th's flagship, the bulk freighter Yadeez. As the fighter wing's TIEs closed in on the Deliverance's tractor beam projector, Shymon accelerated into the projector, obliterating it. Her sacrifice allowed the 204th to escape.\nDuring the Galactic Civil War, Shymon served as a TIE fighter pilot in the Galactic Empire's 204th Imperial Fighter Wing. In 5 ABY, the fighter wing, under orders from Grand Moff Randd, carried out a string of genocides on worlds which had disassociated with the Empire. However, a communications signal burst from the 204th's flagship, the bulk freighter Yadeez, caught the attention of New Republic forces led by General Hera Syndulla. Syndulla's forces drove the 204th from the Ciaox Verith system and from the Red Yars system.\nHours later, the New Republic forces caught up with the 204th again, and Syndulla's refitted Star Destroyer, the Deliverance, locked on to the Yadeez with its tractor beam. Shymon and another TIE pilot maneuvered around the fighters of Deliverance's starfighter wing to close in on the tractor beam projector. As her TIEs' laser cannons were not able to damage the tractor beam equipment and break the lock, Shymon accelerated and crashed into the beam projector. Her sacrifice successfully obliterated the tractor beam, killing three of the refitted Star Destroyer's crew and allowing the rest of the 204th to escape.\nShymon's suicide surprised Wyl Lark, the commander of the Deliverance's fighter wing, who claimed to have not expected the tactic from 204th pilots. Following the funeral of Garl Lykan, another pilot lost in the New Republic's pursuit of the Imperial fighter wing, Colonel Soran Keize told Lieutenant Yrica Quell that Shymon was among some of the unit who understood the new rules of war that the 204th was adapting to.\nA human female, Shymon understood that the 204th Imperial Fighter Wing was adapting to new war tactics to survive. She demonstrated this by making a suicide run to aide the rest of her unit.\nShymon appeared in a starfighter in the 2021 novel Victory's Price, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Fighter_wing",
  "/wiki/New_Republic",
  "/wiki/Barma_Battle_Group",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Star_Destroyer",
  "/wiki/Deliverance",
  "/wiki/Flagship",
  "/wiki/Bulk_freighter",
  "/wiki/Yadeez",
  "/wiki/Tractor_beam_projector",
  "/wiki/Galactic_Civil_War",
  "/wiki/Grand_Moff",
  "/wiki/Randd",
  "/wiki/Planet",
  "/wiki/Skirmish_in_the_Ciaox_Verith_system",
  "/wiki/Ciaox_Verith_system",
  "/wiki/Battle_in_the_Red_Yars_system",
  "/wiki/Red_Yars_system",
  "/wiki/Standard_hour",
  "/wiki/Third_encounter_with_the_Yadeez",
  "/wiki/Tractor_beam",
  "/wiki/TIE_line",
  "/wiki/Pilot",
  "/wiki/Starfighter",
  "/wiki/Deliverance%27s_starfighter_wing",
  "/wiki/Laser_cannon",
  "/wiki/Wyl_Lark",
  "/wiki/Commander",
  "/wiki/Lykan%27s_funeral",
  "/wiki/Garl_Lykan",
  "/wiki/Colonel",
  "/wiki/Soran_Keize",
  "/wiki/Lieutenant",
  "/wiki/Yrica_Quell",
  "/wiki/2021",
  "/wiki/Victory%27s_Price",
  "/wiki/Alexander_Freed",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Battle_of_Jakku",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Death",
  "/wiki/Ultimate_Star_Wars"
 ]
}