{
 "name": "Si_Pebi",
 "display_name": "Si Pebi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aqualish"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Smuggler"
     ]
    }
   ]
  }
 ],
 "content": "Si Pebi, an Aqualish arms dealer, was active in the Anoat sector of the galaxy while it was locked down by Governor Ubrik Adelhard of the Galactic Empire's Iron Blockade.\nPebi made his fortune buying armaments from corrupt Imperial personnel, then reselling them to organized crime. After losing all his credits when a deal went sour, Pebi joined the Smuggler's crew, and thus contributed to the Anoat sector's Uprising. While on missions for the Smuggler, he had the advantages of a background working with Imperial personnel, a preference for offensive tactics, and significant skill at brokering deals for various types of currency.\nSi Pebi was one of the subtypes of Aqualish with two eyes and five-fingered hands. He had black eyes and gray skin. Pebi's weapon of choice was a vibroblade.\nSi Pebi was created for the 2015 mobile game Star Wars: Uprising, which was created by Kabam for iOS and Android operating systems. In Star Wars: Uprising, Si Pebi is a Tier II Crew Member available through the Premium Crane, Daily Opportunities, or other Missions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Aqualish",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/The_Smuggler",
  "/wiki/Arms_dealer",
  "/wiki/Anoat_sector",
  "/wiki/The_galaxy",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Galactic_Empire",
  "/wiki/Iron_Blockade",
  "/wiki/Credit",
  "/wiki/Uprising",
  "/wiki/Vibroblade",
  "/wiki/2015",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)"
 ]
}