{
 "name": "Si_Treemba",
 "display_name": "Si Treemba",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arconan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Arcona Mineral Harvest Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Si Treemba was an Arconan miner who was one of the first to befriend Obi-Wan Kenobi on the ship Monument, on their way to Bandomeer. He worked for Clat'Ha at the Arcona Mineral Harvest Corporation along with many other Humans and Arconans.\nWhile aboard the Monument on a trip to Bandomeer, Si Treemba heard about the Jedi Obi-Wan Kenobi's fight with Grelb the Hutt. He found the young boy lying in bed, upset at having been instigated to anger. Admiring his bravery, the Arcona befriended Kenobi. Soon, when hearing that supplies had been stolen, he went with Kenobi to find the missing parts. Treemba was kidnapped by the Hutt's men, but soon rescued by Kenobi.\nSoon, he found himself having to make the choice of going to Offworld Mining Corporation to get the dactyl they needed, but his friendship with Obi-Wan inspired him to resist the offer and remain with his friend, prompting the other Arcona miners to follow his example. It was not long after this the Monument was attacked by pirates and forced to crash-land on an unknown planet.\nEventually, they made their way off the planet and arrived on Bandomeer, where Si Treemba was assigned to survey some of the other facilities on the planet for Clat'Ha, working alone, despite the close relationship between other Arconians due to the independence he had acquired from his friendship with Obi-Wan. When Obi-Wan was later captured by Offworld forces, Si Treemba was able to provide Qui-Gon Jinn with information that helped Qui-Gon find where he had been taken.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arcona/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Arcona_Mineral_Harvest_Corporation",
  "/wiki/Miner/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Monument_(freighter)",
  "/wiki/Bandomeer/Legends",
  "/wiki/Clat%27Ha",
  "/wiki/Human/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grelb",
  "/wiki/Hutt/Legends",
  "/wiki/Offworld_Mining_Corporation",
  "/wiki/Dactyl",
  "/wiki/Pirate/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Jedi_Apprentice:_The_Rising_Force",
  "/wiki/Jedi_Apprentice:_The_Dark_Rival",
  "/wiki/Jedi_Apprentice:_The_Hidden_Past",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}