{
 "name": "Sia-Lan_Wezz",
 "display_name": "Sia-Lan Wezz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "47 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Kessel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "63 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Naboo Underground"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Lo-Jad"
     ]
    }
   ]
  }
 ],
 "content": "Sia-Lan Wezz was a female Human Jedi Knight and General in the waning years of the Galactic Republic, the former Padawan of Master Lo-Jad.\nDiscovered to be Force-sensitive during infancy, Sia-Lan Wezz was taken to the Coruscant Jedi Temple for formal training in the ways of the Force at the Temple's academy. After years of training, Wezz was selected by Jedi Master Lo-Jad as a Padawan and was destined to travel the galaxy with him to continue her studies down the Jedi Path. A year after her thirteenth birthday, Wezz was assigned to investigate the Coruscant-based terrorist organization known as the Flail. Teaming with a Wookiee, Wezz was forced to engage members of the group and went on to complete her mission. In 32 BBY, Master Lo-Jad assigned Wezz to Naboo where she was to study for a semester at the Royal House of Learning in Theed. Becoming close with headmaster Lucos Dannt, Wezz was on planet when the Trade Federation blockaded the planet. During the invasion, Wezz joined the Naboo Underground, a resistance movement that attempted to topple Federation control. During her time in the resistance, Wezz became well acquainted with the likes of Deel Surool, Rorworr, and fellow Padawan Rann I-Kanu. While Wezz would leave Naboo shortly after the Federation was defeated, she kept in touch with her new comrades and would involve them in several missions in her future career.\nDuring her time as a Padawan, Wezz either crafted several lightsabers or possessed several lightsaber crystals as she was seen with blue, pink, yellow, and green-bladed weapons throughout her service to the Order. Following the election of Palpatine as Supreme Chancellor, Wezz was assigned a mission to the snow-covered world of Puloorn with her comrades Rorworr, Vor'en Kurn, and Deel Surool to uncover a hidden Sith Temple. The team found the temple ruins, possibly inhabited by dark side beasts or cultists, and reported the findings to Palpatine and the Jedi High Council. Over the course of the next decade, Wezz would study and prepare for her Trials of Knighthood, a series of tests she would pass before being elevated to the rank of Jedi Knight.\nJust before the start of the Clone Wars, Wezz and her comrades journeyed to Corellia where the four foiled a Separatist assassination attempt on a Corulag Senator, Alastar Treen. Following this, the four frequently worked together. The team faced a variety of opponents and situations, such as attacks on battle droid commanders, the investigation of a bounty hunter operating out of the Royal Hutt Hotel, assaults on crime bosses, encounters with Tusken Raiders on Tatooine, cantina brawls with Aqualish and Rodian gangs, an escape from a battle droid garrison, an escape from a Colicoid-run prison in the Spice Mines of Kessel, a Jawa ambush in an abandoned armory, and even mounted blasters in the darkened corridors of the warlord Grumbog's space station fortress.\nThe team was so successful that they continued to receive orders directly from the office of the Chancellor and the High Council. One such mission had the group investigating the disappearance of a Republic arsenal ship that had been tasked with decommissioning the Trade Federation Army defeated at Naboo. The investigation led the team to Kwenn Space Station, where they defeated several re-activated battle droids. Another mission to which the team was assigned involved preventing Corann from being the first of the Core Worlds to withdraw from the Republic. Rorworr's team investigated rumors of Separatist activity on the small industrial planet and discovered a droid manufacturing plant.\nAn accomplished Guardian by the end of the war, Wezz was able to avoid the execution of Contingency Order 66 at the end of the war; an order issued by the treasonous Chancellor Palpatine ordering the death of all Jedi. Fleeing from the Grand Army, Wezz came into contact with fellow survivor Master Shadday Potkin and agreed to meet her on Kessel. A month after the birth of the Galactic Empire, Wezz met with Jedi Potkin, Ma'kis'shaalas, Roblio Darté, Tsui Choi, Bultar Swan, Koffi Arana, and Jastus Farr to discuss their next move against Palpatine, who was indeed a Sith Lord. Unbeknownst to all present, Potkin had arrogantly lured Darth Vader to the meeting in hopes that the team could overwhelm the Sith and end the Empire. Sia-Lan Wezz was the first to attack Vader, charging toward him with her lightsaber poised high. She was no match for the Dark Lord of the Sith though, who easily extended his lightsaber through her chest, and sliced off her hand before her dead body hit the floor.\nDuring the Galactic Civil War, Sia-Lan Wezz and fellow Jedi Dorn Tavers were portrayed on a Rebel Alliance poster under the slogan \"Remember Alderaan.\" Reports erroneously indicated that Wezz was killed by High Inquisitor Volytar during the Battle of Skorrupon, defending Skorrupon's people from being taken over by Imperial forces.\nSia-Lan Wezz is the iconic Jedi Guardian for the Star Wars Roleplaying Game, the character used for every game example within the rulebooks.\nSia-Lan Wezz's death was originally established in Galactic Campaign Guide, during the Battle of Skorrupon. Later, however, Star Wars: Purge established that she was killed by Darth Vader shortly after the formation of the Galactic Empire. The Complete Star Wars Encyclopedia confirmed her death at the hands of Vader.\nLeland Chee stated the possibility that Galactic Campaign Guide was only providing a hypothetical situation regarding the Skorrupon death, and might get noted in the Holocron continuity database as \"One report indicated that Sia-Lan Wezz had been lost at the Battle of Skorrupon.\"\nIn Star Wars: Purge, Sia-Lan's lightsaber blade changes color from green to pink when Darth Vader slices her hand off. Other sources have depicted her with a yellow or blue lightsaber.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/47_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Naboo_Underground",
  "/wiki/Lo-Jad",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/T4_turret_droid",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_academy",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_Flail",
  "/wiki/Wookiee/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Royal_House_of_Learning",
  "/wiki/Theed/Legends",
  "/wiki/Headmaster/Legends",
  "/wiki/Lucos_Dannt",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Blockade/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Deel_Surool",
  "/wiki/Rorworr_(Naboo)",
  "/wiki/Rann_I-Kanu",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Puloorn",
  "/wiki/Vor%27en_Kurn",
  "/wiki/Sith_temple_(Puloorn)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Corulag/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Alastar_Treen",
  "/wiki/Royal_Hutt_Hotel",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Colicoid/Legends",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/Jawa/Legends",
  "/wiki/E-Web_heavy_repeating_blaster",
  "/wiki/Warlord/Legends",
  "/wiki/Grumbog",
  "/wiki/Space_station/Legends",
  "/wiki/Grumbog%27s_space_station_fortress",
  "/wiki/Shiak",
  "/wiki/Kwenn_Space_Station/Legends",
  "/wiki/Corann",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Shadday_Potkin/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Conclave_on_Kessel",
  "/wiki/Ma%27kis%27shaalas/Legends",
  "/wiki/Roblio_Dart%C3%A9",
  "/wiki/Tsui_Choi",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Koffi_Arana",
  "/wiki/Jastus_Farr",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Dorn_Tavers",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/High_Inquisitor",
  "/wiki/Volytar",
  "/wiki/Battle_of_Skorrupon",
  "/wiki/Skorrupon/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Galactic_Campaign_Guide",
  "/wiki/Star_Wars:_Purge",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Leland_Chee",
  "/wiki/Holocron_continuity_database",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Shadows_of_Coruscant",
  "/wiki/Star_Wars_Roleplaying_Game_Core_Rulebook",
  "/wiki/Peril_on_Naboo",
  "/wiki/Secrets_of_Naboo",
  "/wiki/Star_Wars:_Invasion_of_Theed_Adventure_Game",
  "/wiki/Battle_for_Theed",
  "/wiki/The_Fall_of_Cloud_City",
  "/wiki/Star_Wars_Gamer",
  "/wiki/A_Revised_Rulebook_Companion",
  "/wiki/Star_Wars_Gamer_10",
  "/wiki/Hero%27s_Guide",
  "/wiki/Star_Wars_Roleplaying_Game_Revised_Core_Rulebook",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_62",
  "/wiki/The_Official_Star_Wars_Fact_File_64",
  "/wiki/The_Official_Star_Wars_Fact_File_91",
  "/wiki/Wizards.com",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2009_Topps_Star_Wars_Galaxy_Series_4",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Character_Record_Sheets"
 ]
}