{
 "name": "Sian_Jeisel",
 "display_name": "Sian Jeisel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Devaron"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Bogden 3"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "White streaks"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan with light orange fur"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Sian Jeisel was a female Devaronian Jedi Master who served the Jedi Order and the Galactic Republic during the final years of the Republic Classic era. A dutiful Jedi, Jeisel felt that the Order should not have gotten involved in the Clone Wars, the major conflict between the Republic and the Confederacy of Independent Systems. Initially invoking her Right of Denial, Master Mace Windu eventually persuaded her to return to Coruscant and take up the rank of General within the Grand Army of the Republic.\nAfter three years of fighting valiantly, Jeisel's original misgivings about the war were found to be true; the entire conflict was simply a trap for the Jedi, orchestrated by the elusive Dark Lord of the Sith, Darth Sidious. The leader of both sides, Sidious, in his alter ego Supreme Chancellor Palpatine, ordered the Republic Army to execute their Jedi leaders who had been branded as traitors to democracy. Caught unaware on Bogden 3, Jeisel sacrificed herself in order to protect countless Jedi Initiates fleeing the carnage.\nMost likely discovered at birth to be Force-sensitive on her homeworld of Devaron, Sian Jeisel was turned over to the Coruscant Jedi Temple for training in the ways of the Force. Entering into the academy there, Jeisel eventually went onto graduate and become apprenticed to a Jedi Master. Passing the Trials of Knighthood after years of study, the newly knighted Sian Jeisel continued independent study as a Guardian within the Order.\nAttaining the rank of Master after years of intensive study and work for the Jedi High Council, Jeisel was an active member of the Order when the conflict between the Republic and the Confederacy of Independent Systems erupted into all out war. Away from Coruscant at the time of the First Battle of Geonosis, Jeisel was disenchanted with the Republic, believing it too corrupt and not worthy enough for the Jedi to sacrifice their lives. Invoking her Right of Denial, Jeisel refused to answer the High Council's call to arms and instead remained abroad, gathering together with other like-minded Jedi. Initially, the High Council begrudgingly accepted this choice by a number of their ranks, but it soon became clear that if these members fell to the dark side of the Force, the ensuing schism would break the Order. Summoning representatives of each breakaway group to the estate of Jedi Master Sora Bulq on the moon Ruul, Master Mace Windu wished to open talks with each of the leaders and hoped to persuade them to join the war effort.\nSian Jeisel responded to the summons, meeting with other dissident group leaders such as K'Kruhk, Rhad Tarn, and Mira. While some members of the group were wary of Windu's impending visit, K'Kruhk soothed their fears as Bulq and Windu began to discuss the terms of their return. However, unbeknownst to the dissident leaders, Sora Bulq had fallen to the dark side and was in league with Confederate leader Count Dooku. When the Dark Jedi Asajj Ventress attacked Bulq's estate per the Weequay's plan, the dissident Jedi engaged her in a fight. After killing Mira, Ventress seduced Tarn to the dark side. When Tarn turned his lightsaber on Jeisel, the Devaronian Jedi was forced to kill him in self defense. Convinced of Bulq's turn, both Jeisel and K'Kruhk agreed to return with Master Windu to Coruscant, where they took up the rank of General within the Grand Army of the Republic.\nMarching onto many battlefronts, Master Jeisel was en route to Drongar when her troopship was boarded by Dooku's forces. When the Count himself stepped onto the bridge Jeisel, accompanied by Masters Tsui Choi and Kai Justiss, refused to fall for his merciful act even as they were spared the same death as the troops under their command. As the war dragged on, Jeisel found herself assigned to the campaign on Saleucami. Under the command of Councilor Oppo Rancisis, Jeisel proudly fought Morgukai clones during the five month engagement alongside fellow Jedi Knights Xiaan Amersu and Aayla Secura, as well as Masters K'Kruhk and A'Sharad Hett; though she butted heads with Master Quinlan Vos, a Jedi she, as well as many in the Order, believed had fallen to the Separatists. Wary of Vos, she suspected he had a hand in the murder of Master Rancisis half way through the battle, though he proved to be loyal as he led the Republic to victory shortly there after.\nWith the fires of battle dwindling on Saleucami, Jeisel and K'Kruhk were reassigned to aid Master Ki-Adi-Mundi on Mygeeto. Taking off from the planet, their shuttle was damaged after a confrontation with a Separatist freighter and they were forced to limp to the Jedi chapter house on Bogden 3 to make repairs. As the clone troopers under their command refueled and repaired their shuttle, the two Jedi Masters were welcomed to the training facility by Master Du Mahn and the Jedi Initiates of the Soaring Hawkbat Clan. While the Jedi and their troops relaxed in the academy's dining hall after a large feast, the clones received Contingency Order 66 from the Office of the Supreme Chancellor, an order which demanded all Jedi be killed. When her troops opened fire on the younglings, Jeisel sprung into action defending them, aiding the other Masters in cutting down the clones. After Master Mahn was killed, K'Kruhk led a contingent of surviving students out the main hall to their repaired shuttle. As K'Kruhk loaded the children on the ship, Jeisel remained in the main entrance of the facility, holding back the troopers' advance. Realizing her only way to stop the clones was to bring down the building, Jeisel engaged one trooper in hand-to-hand combat, using the Force to detonate one of his thermal detonators and bring down the academy. Incinerated by the explosion, Jeisel's death was not in vain, as the surviving students were led to safety by her good friend Master K'Kruhk, who shed a tear over her passing.\nThe younglings whom Jeisel saved would later escape alongside Master K'Kruhk and Zao, and most lived for many years hidden from the Empire, learning the ways of the Force in peace.\nReports of Master Jeisel's death inevitably reached the ears of Emperor Palpatine on Coruscant as he kept a record of each Jedi who died. Despite this, rumors circulated across the galaxy that she indeed lived on, working as a bounty hunter, jumping between the stars. This rumor made its way into Voren Na'al's work in 35 ABY, and was treated as fact as he detailed some of the Jedi who survived the initial stages of the Great Jedi Purge.\nSian Jeisel was a loyal Jedi which earned her the respect of Asajj Ventress. However, Jeisel was initially reluctant to fight in the Clone Wars believing that the Republic was corrupt and the Jedi couldn't fight for it without corrupting themselves. Despite this, she was a skilled and brave warrior and was loyal to the Jedi Order. Jeisel appeared to share a close friendship with K'Kruhk and saved him from Asajj Ventress during their encounter. She also highly respected Sora Bulq, before learning that he was a traitor to the Jedi Order, and believed that he was just as powerful as Mace Windu.\nSelfless as all good Jedi should be, Jeisel sacrificed herself during the first moments of Order 66 to allow K'Kruhk and a group of Jedi Initiates to escape from their treacherous clone troopers.\nSian Jeisel was a skilled warrior and her fighting prowess was respected by Mace Windu. She managed to slay the corrupt Rhad Tarn in a lightsaber duel. However, she was no match for the powerful Dark Acolyte Asajj Ventress, who was able to fend off her, Tarn, and K'Kruhk simultaneously.\nJeisel's first name was the result of a misunderstanding. Jan Duursema's daughter, Sian, dressed as Jeisel for Celebration III. A photograph of her from that event was captioned \"Sian Jeisel\"; fans confused this as the character's full name, rather than the name of the person in the costume followed by what the costume portrayed. This confusion apparently led to The New Essential Guide to Alien Species using this name in text, making it official.\nJeisel was originally described as a Jedi Purge survivor in The New Essential Chronology, but according to Randy Stradley, that information was based on a discarded story idea, and Jeisel's death in Star Wars: Dark Times is now intended to be a final end for the character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sian",
  "/wiki/Devaron/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Great_ReSynchronization",
  "/wiki/Bogden_3",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Right_of_Denial",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_Schism",
  "/wiki/Sora_Bulq/Legends",
  "/wiki/Ruul_(moon)",
  "/wiki/K%27Kruhk",
  "/wiki/Rhad_Tarn",
  "/wiki/Mira_(Near-Human)",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Siege_of_Saleucami/Legends",
  "/wiki/Drongar/Legends",
  "/wiki/VCD987",
  "/wiki/Tsui_Choi",
  "/wiki/Kai_Justiss",
  "/wiki/Saleucami/Legends",
  "/wiki/Oppo_Rancisis/Legends",
  "/wiki/Morgukai",
  "/wiki/Xiaan_Amersu",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Chase_Piru",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Mygeeto/Legends",
  "/wiki/Bogden_Jedi_chapter_house",
  "/wiki/Du_Mahn",
  "/wiki/Soaring_Hawkbat_Clan",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Office_of_the_Supreme_Chancellor",
  "/wiki/Massacre_on_Bogden_3",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Zao",
  "/wiki/Emperor/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/35_ABY/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Jan_Duursema",
  "/wiki/Celebration_III",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Randy_Stradley",
  "/wiki/Star_Wars:_Dark_Times",
  "/wiki/Category:Images_of_Sian_Jeisel",
  "/wiki/Jedi:_Mace_Windu",
  "/wiki/Jedi:_Count_Dooku",
  "/wiki/Yoda:_Dark_Rendezvous",
  "/wiki/Republic_74",
  "/wiki/Republic_75",
  "/wiki/Republic_76",
  "/wiki/Republic_77",
  "/wiki/Dark_Times_6",
  "/wiki/Dark_Times_7",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_95",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Republic:_Siege_of_Saleucami",
  "/wiki/Jedi_Council_Forums",
  "/wiki/February_11",
  "/wiki/2013",
  "/wiki/Template:Cite_web"
 ]
}