{
 "name": "Sianna Sekko",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Empress Teta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Krath"
     ]
    }
   ]
  }
 ],
 "content": "Sianna Sekko was a noble from Empress Teta and a Krath Death Witch active during the Galactic Civil War.\nBorn into a wealthy family of nobles on Empress Teta, Sianna Sekko was orphaned at a young age and inherited her family's estate. The estate's executor, Sekko's uncle, raised the girl as part of an underground cult that worshiped the Krath legacy. Training Sekko in the ways of the Force, the Krath taught her the ways of illusions and violence. Dispatched on missions to retrieve relics of ancient evils, Sekko received orders from a handler known only as \"Tailor\". Tailor taught her that the ruined Jedi Order killed her parents before the Galactic Empire wiped them out at the end of the Clone Wars, fostering a hatred of the Jedi in Sekko's heart. In fact, Tailor was the true mastermind of the Sekkos' demise, as part of his goal of recruiting their young daughter. Programming a cadre of Krath war droids to fight and target Jedi, Sekko was obsessed with eradicating the Order's remnants from the galaxy. During the Galactic Civil War, Sekko often roamed the Royal District of Cinnagar in search of the fabled Iron Citadel's foundations.\nA skilled witch, Sianna Sekko wielded a Blood Blade in combat, using the variation of the Ataru technique in combat. Additionally, Sekko carried a blaster pistol for her defense.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Empress_Teta/Legends",
  "/wiki/Human/Legends",
  "/wiki/Tetan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Krath/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Krath_Death_Witch",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Tailor_(Krath)",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Krath_war_droid/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Royal_District/Legends",
  "/wiki/Cinnagar/Legends",
  "/wiki/Iron_Citadel/Legends",
  "/wiki/Blood_Blade",
  "/wiki/Form_IV/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Nexus_of_Power"
 ]
}