{
 "name": "Sib Canay",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cato Neimoidia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Sib Canay was a male Neimoidian who served as an officer in the Trade Federation during the Clone Wars. He was in command of the blockade of Pantora, with the secret intention of forcing the moon to join the Separatist Alliance. To this end, he hired a bounty hunter to kidnap the daughters of Pantoran Supreme Chairman Notluwiski Papanoida to further pressure the Pantoran Assembly. One of the daughters, Che Amanwe was held hostage on his flagship.\nDuring the blockade, he admitted Pantoran Senator Riyo Chuchi and her servant onto his battleship to negotiate. However, the servant was in reality Jedi Padawan Ahsoka Tano, and their true mission was to rescue the Chairman's daughter. He confronted the three with a platoon of battle droids, but was defeated. In front of his own men, Canay confessed to Tano's accusations of conspiring with the Separatists, and he agreed to lift the blockade. After the incident was over, Senator Lott Dod distanced the Federation from Canay in the Senate, and said that his actions had been \"of his own accord,\" products of \"Nute Gunray's influence.\"\nIn 21 BBY, Sib Canay, a male Neimoidian hailing from Cato Neimoidia, was sent to the Pantora system to administrate a blockade over the planet of Pantora from his battleship. Later, during the blockade, Canay was visited by Pantoran Senator Riyo Chuchi and her servant, when the visitors arrived, Canay greeted them and asked the senator if the chairman of Pantora had agreed to \"their terms,\" which was not the case. Chuchi later suggested that Pantora was going to join the Separatist Alliance, then, Canay invited her and the senator's servant to their rooms. As the newcomers went to their rooms, Tano and Chuchi distracted a Neimoidian Royal Guard and entered the meetings room.\nThen, Canay and another Neimoidian entered the room, discussing the kidnapping of the chairman of Pantora's daughters. There, Canay stated that he understood the other's profits margins with the separatists could be considerable, however, he still did not agree to the kidnapping. Then, the Neimoidian attempted to dismiss Canay's concerns, however, an angered Canay shouted \"why the daughters were on his ship,\" provoking Chuchi, who was hiding under the meetings room's desk, to gasp. As the neimoidians looked for them in the room, they escaped and fled to the detention block, where Tano used a mind trick on a Neimoidian guard, which then let them enter the detention block, allowing them to look for the Papanoidas. On the ship's bridge, a B1-series battle droid informed Canay of the visitor's whereabouts, then, Canay stated that \"they were a little too curious for their own good\", and procceeded to arrest them with several B2-series super battle droids, which Tano destroyed. Then, having defeated Canay, several Neimoidian guards along with the Neimoidian envoy attempted to arrest Tano, there Canay stated that he wanted his litigator. However, Chuchi used blackmail to force the envoy to surrender and free Papanoida's daughters, defeating the Neimoidians.\nAfter the incident was over, Senator Lott Dod distanced the Federation from Canay in the Senate, and said that his actions had been \"of his own accord,\" products of \"Nute Gunray's influence.\"\nSib Canay was a male neimoidian with light gray mottled skin.\nCanay was a foolish commander and negotiator.\nSib Canay appeared in \"Sphere of Influence,\" the fourth episode of the animated television series Star Wars: The Clone Wars'' third season. He was voiced by Corey Burton.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sib_Canay",
  "/wiki/Sib_Canay/Legends",
  "/wiki/Cato_Neimoidia",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Trade_Federation",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Officer",
  "/wiki/Clone_Wars",
  "/wiki/Blockade_of_Pantora",
  "/wiki/Pantora",
  "/wiki/Moon",
  "/wiki/Greedo",
  "/wiki/Kidnapping_of_the_Papanoida_daughters",
  "/wiki/Pantoran",
  "/wiki/Supreme_Chairman",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Pantoran_Assembly",
  "/wiki/Che_Amanwe_Papanoida",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Senator",
  "/wiki/Riyo_Chuchi",
  "/wiki/Ahsoka_Tano",
  "/wiki/Lucrehulk-class_battleship",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Rescue_on_the_Pantora_Droid_Control_Ship",
  "/wiki/Platoon",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Treason",
  "/wiki/Lott_Dod",
  "/wiki/Galactic_Senate",
  "/wiki/Nute_Gunray",
  "/wiki/21_BBY",
  "/wiki/Pantora_system",
  "/wiki/Planet",
  "/wiki/Chairman",
  "/wiki/Neimoidian_Royal_Guard",
  "/wiki/Unidentified_Neimoidian_envoy",
  "/wiki/Prison",
  "/wiki/Mind_trick",
  "/wiki/Unidentified_Neimoidian_guard",
  "/wiki/Bridge_(starship)",
  "/wiki/B1-series_battle_droid",
  "/wiki/Death",
  "/wiki/Lawyer",
  "/wiki/Sphere_of_Influence",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Corey_Burton",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/ARC_Troopers",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}