{
 "name": "Sidon Ithano",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Delphidian Cluster"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Delphidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "80 kilograms"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sidon Ithano's crew",
      "Resistance",
      "Exegol landing team",
      "Exegol landing team"
     ]
    }
   ]
  }
 ],
 "content": "Sidon Ithano, nicknamed the \"Crimson Corsair,\" the \"Blood Buccaneer,\" the \"Red Raider,\" the \"Silent Scourge of the Lost Clusters,\" and the \"Scourer of Adratharpe 7,\" was a male Delphidian pirate who lived in the Outer Rim Territories in the decades following the conclusion of the Galactic Civil War. Ithano, who wore a distinctive red Kaleesh mask, led a crew of pirates, and gained a reputation as the best pirate in the region. He and his crew discovered the remains of the downed Obrexta III, a ship which had been in service to the Confederacy of Independent Systems exactly 50 standard years prior during the Clone Wars, and raided it under the assumption that they would find valuable kyber crystals that once belonged to Count Dooku. Instead they found a Galactic Republic clone trooper named Kix, who had been frozen in stasis, and the locations of former Separatist bases.\nA male Delphidian from the Delphidian Cluster, Sidon Ithano lived as a pirate in the Outer Rim Territories region of the galaxy during the years leading into the conflict between the First Order and the Resistance. During this time, Ithano became the most notorious thief of his species, and he earned the title of the \"Crimson Corsair\" due to his choice in garb: he wore crimson robes that covered most of his body and a red plasteel mask that resembled that of the reptilian Kaleesh species. Ithano served alongside the Weequay pirate Scorza aboard the New Gilliland, an Outer Rim-centered cruiser, for several years. However, the New Gilliland was destroyed by the Hutt syndicate after Scorza betrayed Ithano and others to the Hutts. The Corsair managed to survive the attack and even gained enough credits to finance his own crew—though he did not invite Scorza to join him, as Scorza had betrayed him; a decision that Scorza took personally and vowed to have revenge against Ithano for.\nIthano's crew of pirates headquartered on the Corsair's starship, the Meson Martinet, which he captained, and in a cantina on an Outer Rim desert planet, Ponemah Terminal. The Corsair and his crew fought in several battles over the years, including at Adratharpe 7, where Ithano won much renown: he was the fiercest fighter at the battle. Ithano was also the first pirate to ever sail the Lost Clusters, a treacherous location located beyond the Outer Rim. Ithano rarely spoke, relying instead on his loyal crew to know his orders by their brotherly bond or through hand gestures—which only furthered his reputation as a legendary pirate.\nAt the mark of 50 standard years after the Clone Wars, Ithano's crew consisted of Quiggold, an amphibious Gabdorin—who was also Ithano's first mate—the Ishi Tib Pendewqell, an Arcona named Reeg Brosna, Reveth, a female red-skinned Twi'lek, and a porcine Gamorrean who went by the name of Squeaky.\nWhile waiting out the day in the Ponemah cantina one day, Ithano and his six crew members received a transmission that dated back to the Clone Wars. The message was relayed from B1-CC14, a B1-series battle droid that was stationed aboard Confederacy of Independent Systems cruiser, the Obrexta III, that had crash-landed on Ponemah during the Clone Wars with the treasure of Count Dooku, the political leader of the Separatist party, aboard. Pendewqell persuaded his captain and the crew to seek out the crashed cruiser and claim the treasure before other pirates claimed it their own, so Ithano and his crew quickly set out to the southern region of the planet, known as the Sea of Sand, which was plagued by lightning storms, magma geysers, and 15-meter waves of caustic sand that acted as Penohma's sea. Consequently, starships could not fly under those conditions; so, Ithano and his crew took off in their sail barge, the custom red-painted Shrike.\nWhile journeying, Ithano's crew came to the conclusion that Dooku's treasure was the collection of Jedi lightsaber kyber crystals that the Count had collected during the Clone Wars, which were worth a massive fortune on the black market. However, unknown to the Corsair and his crew at the time, several other criminal gangs had taken pursuit of the Shrike, including Scorza and his gang, the Gray Gundarks, a swoop biker gang.\nThe Corsair's sail barge soon entered the Sea of Sand, but a massive sandstorm-tornado pulled the Shrike off-course. Ithano gestured to Quiggold, who translated the message to fire a kinetic disruptor torpedo into the tornado and thereby freeze the storm and allow them to continue on their journey. Brosna and Quiggold fired the torpedo as ordered, though it had a delayed trigger and did not immediately detonate.\nScorza, however, had caught up to the Shrike and fired his skiff's laser cannons at Ithano's vessel, which knocked Brosna overboard and did significant damage to the barge. The Corsair launched tow cables onto Scorza's skiff so Scorza would have to pull them away from the tornado. However, the Gray Gundarks interrupted with their attack; firing and boarding both vessels indiscriminately. As the battle raged, a geyser of lava erupted and set many of the bikers ablaze, as well as both pirate vessels. Ithano dueled the bikers with his vibro-sword, until Scorza confronted him to have his revenge, shooting the two bikers with a blaster and taunting the captain with his tale of revenge. The Corsair, however, spoke, telling Scorza that he did not recognize the old Weequay pirate; Ithano had met a lot of Weequay pirates in his life. Scorza, infuriated, attacked his former friend with his sword. Ithano quickly gained the upper hand and kicked the Weequay over the railing of the Shrike just as the kinetic disruptor detonated, freezing the vortex in place like a statue. The wreckage of the Obrexta III was just on the other side of the vortex, and Ithano and his crew raced towards it, leaving their enemies to die in the flames.\nThe Corsair and his crew reached an airlock to the cruiser soon thereafter, though Ithano's crew was not the first to reach the wreckage: the bodies of the members of the Fangs of the Hutt lay dead inside the Separatist ship, poisoned by durilliam gases that had been leaking for over five decades. Ithano and his crew had come prepared, unlike the other criminals; the Corsair and his crew donned rebreathers and entered the wreckage. The cruiser was cluttered with deactivated battle droids and corroded metal, so they stepped carefully through the maze of a ship until the reached the bridge of the battleship. A ion storm had swept the region months before, which was causing the ship and battle droids aboard to slowly reactivate. The Corsair expressed his worriment about the danger the droids posed to Quiggold, so Quiggold questioned Pendewqell, respectively if he was an idiot for bringing the crew there—it had been Pendewqell's idea to begin the endeavor in the first place.\nIthano and his companions raced through the ship to find and claim the lost treasure before the droids could pose a threat. Soon after, the crew located the ship's vault and surgically opened it with blaster fire and explosives. What they found within surprised even the Corsair: A cryo-cycle stasis pod with a sleeping being within—not lightsaber kyber crystals. Pendewqell reasoned that even though it wasn't the crystals, it had to be valuable because it was in the vault. Ithano agreed and gestured for his crew to awaken the pod. They did so, and a Galactic Republic clone trooper emerged. The trooper had learned of a Sith plot to destroy the Jedi Order during the Clone War, but had been captured and put in stasis by Dooku before he could save the Jedi and the Republic. The trooper, CT-6116, or \"Kix,\" was a medic, and he feverishly explained that he needed to save the Republic by reporting what he had learned to Jedi Knight Anakin Skywalker. Before Ithano could further question the clone, Kix fell into unconsciousness.\nQuiggold berated Pendewqell for leading them on the foolhardy treasure hunt that had led to a discovery that did not matter anymore. Pendewqell fled fearing the Corsair would punish him greatly for endangering their lives on a worthless hunt. Ithano was upset and Pendewqell's hasty departure, but told his crew to carry the unconscious clone and run for back to the Shrike as the Obrexta III began to fall apart, and the droids reactivated around them. However, Scorza emerged and pointed a blaster at the pirates, demanding they stop. Quiggold, like Ithano, did not recognize Scorza, but watched in contempt as a squad of B2-series super battle droids walked up behind Scorza and shot him; allowing Ithano and his crew to escape once more. They reached the airlock from where they had entered just in time to watch a massive sand worm devour the Shrike. The Corsair was becoming exasperated at the turn of events, and at losing his sail barge. So at Quiggold's suggestion, they headed for the Obrexta III's escape pods.\nOnly one escape pod remained active, and not everyone could fit in the pod, so Ithano selflessly stayed behind in the damned ship, and sent his crew to safety in the pod, just as a sand worm tore through the wreck, causing it to explode. Ithano survived, however, and retrieved the Obrexta III's memory core, which contained the locations of every base and droid factory the Separatists ever operated. The Corsair eventually escaped the wreckage and the Sand of Sea: three weeks after awakening Kix, the Corsair made it back to their cantina—much to the shock of everyone, though Quiggold had faithfully refused to accept that his friend had been killed. Ithano gave Kix the memory core, who assured everyone that they would be rich if they plundered the forgotten bases. Kix then joined Ithano's crew as their guide, because he was an expert in Clone Wars-era military technology. Quiggold, however, inquired as to how the Crimson Corsair had escaped the fire, sand, sand worms, and droids. Ithano decided to speak, saying only that he was Sidon Ithano; and that he would not die that easily.\nWith Kix having joined Ithano's crew, they proceeded to raid more Separatist holdouts. One was located in a misty swamp, where Ithano, Reveth and Kix were ambushed by B1 battle droids, which were unearthing themselves from the ground, trying to reach the crew. C-3PO later told this story to some visitors and described it as \"spooky.\"\nSometime later, Ithano and Quiggold visited Takodana Castle thirty years after the Battle of Endor where a fugitive First Order defector named Finn offered to join their crew in exchange for safe passage into the Outer Rim, away from the First Order's reach. However, before Finn made his way on board the Meson Martinet, the pirates' departure was interrupted by the destruction of the Hosnian System, which could be seen in the skies above Takodana.\nNot too long before the battle of Exegol in 35 ABY, Ithano made a substantial sale of a vintage cache of super battle droids and one B1 droid to the Quarren pirate Kragan Gorr and his Warbird pirates, who bought them to assist in their final attempt to seize control of the supertanker fuel depot Colossus.\nIthano participated in the battle against the Sith Eternal on the planet Exegol, by joining the Resistance ground team that was in charge of destroying a navigation tower. Later, Ithano, along with the allied Citizens' Fleet, joined the Resistance at their base on Ajan Kloss in celebration of victory against the resurgent Galactic Emperor Darth Sidious' Final Order at Exegol.\nIthano would often let his reputation lead to victory, simply ordering the target vessel to lower their shields and change direction. This order was not one any starship crew wished to hear, inducing fear in those who heard the order via their ship's comm unit.\nSidon Ithano wore a cape lined with armorweave and a red Kaleesh helmet that concealed his Delphidian nature. He often carried a blaster rifle, proudly captured from a Kanjiklubber, and additionally possessed a Longswat-44 sniper blaster rifle.\nSidon Ithano was first pictured in a Vanity Fair article released May 4, 2015, which included a group photo of characters in Maz Kanata's castle. Ithano first appeared in \"The Crimson Corsair and the Lost Treasure of Count Dooku,\" a short story by Landry Q. Walker, which was published as an eBook on November 29.\nIthano was portrayed by Cavin Cornwall in Star Wars Episode VII The Force Awakens. Cornwall was not given credit to his role, but rather was credited as a \"creature and droid performer.\" Ithano was voiced by David Acord in the Star Wars Resistance episode \"The Mutiny.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corsair_(disambiguation)",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/The_Mutiny",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Delphidian_Cluster",
  "/wiki/Delphidian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Sidon_Ithano%27s_crew",
  "/wiki/Resistance",
  "/wiki/Exegol_landing_team",
  "/wiki/Pirate",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Standard_decade",
  "/wiki/Galactic_Civil_War",
  "/wiki/Color",
  "/wiki/Kaleesh",
  "/wiki/Obrexta_III",
  "/wiki/Starship",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Kyber_crystal",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_trooper",
  "/wiki/Kix",
  "/wiki/Cryo-cycle_stasis",
  "/wiki/The_galaxy",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Thief",
  "/wiki/Plasteel",
  "/wiki/Reptile",
  "/wiki/Weequay",
  "/wiki/Scorza",
  "/wiki/New_Gilliland",
  "/wiki/Cruiser",
  "/wiki/Hutt_Clan",
  "/wiki/Treason",
  "/wiki/Hutt",
  "/wiki/Credit",
  "/wiki/Meson_Martinet",
  "/wiki/Captain",
  "/wiki/Unidentified_derelict_bar",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Ponemah_Terminal",
  "/wiki/Adratharpe_7",
  "/wiki/Skirmish_of_Adratharpe_7",
  "/wiki/Lost_Clusters",
  "/wiki/Quiggold",
  "/wiki/Amphibian",
  "/wiki/Gabdorin",
  "/wiki/First_Mate",
  "/wiki/Ishi_Tib",
  "/wiki/Pendewqell",
  "/wiki/Arcona",
  "/wiki/Reeg_Brosna",
  "/wiki/Reveth",
  "/wiki/Twi%27lek",
  "/wiki/Gamorrean",
  "/wiki/Squeaky",
  "/wiki/Standard_day",
  "/wiki/B1-CC14",
  "/wiki/B1-series_battle_droid",
  "/wiki/Attack_in_an_unidentified_sector",
  "/wiki/Race_for_the_Lost_Treasure_of_Count_Dooku",
  "/wiki/Sea_of_Sand",
  "/wiki/Magma",
  "/wiki/Ocean",
  "/wiki/Sail_barge",
  "/wiki/Shrike_(sail_barge)",
  "/wiki/Jedi",
  "/wiki/Lightsaber",
  "/wiki/Black_market",
  "/wiki/Gray_Gundarks",
  "/wiki/Swoop",
  "/wiki/Sandstorm",
  "/wiki/Kinetic_disruptor",
  "/wiki/Scorza%27s_skiff",
  "/wiki/Laser_cannon",
  "/wiki/Magnetic_harpoon",
  "/wiki/Skiff",
  "/wiki/Gundark",
  "/wiki/Vibroblade",
  "/wiki/Blaster",
  "/wiki/Airlock",
  "/wiki/Fangs_of_the_Hutt",
  "/wiki/Poison",
  "/wiki/Durilliam",
  "/wiki/Rebreather",
  "/wiki/Battle_droid",
  "/wiki/Bridge_(starship)",
  "/wiki/Battleship",
  "/wiki/Ion_storm",
  "/wiki/Cryo-cycle_stasis_pod",
  "/wiki/Sleep",
  "/wiki/Trooper",
  "/wiki/Sith",
  "/wiki/Order_66",
  "/wiki/Jedi_Order",
  "/wiki/Medic",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cloning",
  "/wiki/Squad",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Sand_worm",
  "/wiki/Escape_pod",
  "/wiki/Memory_bank",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Separatist_holdouts",
  "/wiki/Swamp",
  "/wiki/C-3PO",
  "/wiki/Takodana_Castle",
  "/wiki/Battle_of_Endor",
  "/wiki/Finn",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Takodana",
  "/wiki/Battle_of_Exegol",
  "/wiki/35_ABY",
  "/wiki/B1_(Colossus)",
  "/wiki/Quarren",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Mutiny_on_the_Colossus",
  "/wiki/Supertanker_fuel_depot",
  "/wiki/Colossus",
  "/wiki/Sith_Eternal",
  "/wiki/Exegol",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Ajan_Kloss",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Final_Order",
  "/wiki/Deflector_shield",
  "/wiki/Comm_unit",
  "/wiki/Clothing",
  "/wiki/Armorweave",
  "/wiki/Kanjiklub",
  "/wiki/Longswat-44_sniper_blaster_rifle",
  "/wiki/May_4",
  "/wiki/2015",
  "/wiki/The_Crimson_Corsair_and_the_Lost_Treasure_of_Count_Dooku",
  "/wiki/Landry_Q._Walker",
  "/wiki/EBook",
  "/wiki/November_29",
  "/wiki/Cavin_Cornwall",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars_Resistance",
  "/wiki/5-Minute_Star_Wars_Villain_Stories",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_The_Crimson_Corsair_and_the_Crime_Lords_of_the_Barren_Rim",
  "/wiki/Star_Wars_Adventures_(2020)_7",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens:_Rey%27s_Story",
  "/wiki/The_Force_Awakens:_Rey%27s_Story_(audiobook)",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_3",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars:_Puzzle_Droids",
  "/wiki/Star_Wars:_Rivals",
  "/wiki/Star_Wars_Roll_Out",
  "/wiki/Maz_and_the_Gigantic_Blorp_%E2%80%93_Chapter_1",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2015_Topps_Star_Wars:_The_Force_Awakens_Series_1",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_One",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Saga_of_Rey",
  "/wiki/The_Star_Wars_Book",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Chewbacca_and_Other_Aliens_of_the_Rebellion_and_the_Resistance",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Dark_Disciple",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY"
 ]
}