{
 "name": "Sien",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Peragus Mining Facility"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Peragus Mining Facility",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Sien was the Mine Foreman of the Peragus Mining Facility leading up to the Skirmish at Peragus II in 3951 BBY. He was a part of the facility staff when the Jedi Exile, fleeing from Darth Sion, was brought to Peragus aboard a critically damaged Ebon Hawk.\nWhen Meetra Surik arrived at the mining facility, Coorta attempted to convince Sien to join him in selling Surik to the Exchange for a profitable bounty. Sien refused, in part because he wanted nothing to do with the Exchange. Moreover, he was intimidated by Jedi, believing that angered Jedi started 'big wars' with great destruction. Sien's attempts to convince Coorta to abandon the idea failed and shortly thereafter overheard Coorta plotting with an HK-50 droid  to turn over Surik to the Exchange. At first Sien believed he should report these plans to the Administration Officer, but felt that this would only cause more trouble.\nUpon learning more of Coorta's plans, including the fate of all the miners, he believed he could sway the Maintenance Officer to abandon the plot. The Officer, however, was unaware of what Sien had learned. He was recording a log on his datapad entitled \"Time to take action!\" when Coorta attacked him, knocking Sien unconscious. The log continued to record a brief subsequent conversation capturing Coorta discussing the details of his plan with two accomplices. Realizing the datapad was still recording he ordered it shut off and sent down the refresher.\nIt is possible that Sien told the administration officer once everyone was confined to the dormitories during the emergency lockdown. It is believed that he perished through the ventilation of toxic fumes that were released into the dormitory level. The logs Sien recorded may have been found and studied by Surik, as she tried to piece together what had truly happened at the mining facility.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Sienn_Sconn",
  "/wiki/Human/Legends",
  "/wiki/Sienn%27rha",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Sien_Sovv",
  "/wiki/3951_BBY",
  "/wiki/Peragus_Mining_Facility",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Skirmish_at_Peragus_II",
  "/wiki/Meetra_Surik",
  "/wiki/Darth_Sion",
  "/wiki/Ebon_Hawk",
  "/wiki/Coorta",
  "/wiki/Exchange",
  "/wiki/Bounty/Legends",
  "/wiki/HK-50_series_assassin_droid",
  "/wiki/Peragus_Mining_Facility_Maintenance_Officer",
  "/wiki/Peragus_Mining_Facility_Administration_Officer",
  "/wiki/Datapad/Legends",
  "/wiki/Refresher/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}