{
 "name": "Sifo-Dyas",
 "display_name": "Sifo-Dyas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Minashee"
     ]
    },
    {
     "name": "Born",
     "values": [
      "102 BBY",
      "Minashee"
     ]
    },
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "over the Oba Diah moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Hawk-Bat Clan",
      "Jedi High Council",
      "Hawk-Bat Clan",
      "Jedi High Council",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Lene Kostana"
     ]
    }
   ]
  }
 ],
 "content": "Sifo-Dyas was a human male Jedi Master from Minashee who commissioned the Kaminoans' creation of the Grand Army of the Republic over a decade before the Clone Wars. A Jedi from the Cassandran Worlds, Sifo-Dyas was gifted with the power of foresight, and he earned a seat on the Jedi High Council prior to the Invasion of Naboo. When he foresaw a coming war that would ravage the galaxy, he believed that the Galactic Republic would require an army if it were to prevail. Yet, his peers on the Jedi Council rejected his notions, leading to his removal from the Council. Nevertheless, he pursued his ideas in secret and contacted the Kaminoan cloners, purporting to have the authorization of the Council and the Galactic Senate to raise an army for the Republic. In doing so, he unknowingly entered the crosshairs of the Sith, who set out to assume control of his cloning project.\nAround the time of the Invasion of Naboo, Supreme Chancellor Finis Valorum requested Sifo-Dyas conduct clandestine negotiations with the Pyke Syndicate, and he headed for Oba Diah with Valorum's personal aide, Silman. However, the Sith Lord Darth Tyranus, who was Sifo-Dyas's friend and former Jedi Master Dooku, betrayed him by hiring the Pykes to target Sifo-Dyas's T-6 shuttle. The Pykes shot down his ship over the Oba Diah moon. Sifo-Dyas died in the resulting crash, but Silman survived and was taken prisoner by the Pykes. Consequently, Tyranus and his Sith Master, Darth Sidious, funded Sifo-Dyas's army of clone troopers, hired the bounty hunter Jango Fett to serve as a genetic template, instructed the Kaminoan cloners to add Order 66 to the clones' behavioral modification biochips , and manipulated the Jedi Order into taking command of the army when the Clone Wars erupted. It was not until years later that the Jedi began to unravel the Sith's conspiracy and unearthed the details of Sifo-Dyas's demise.\nHailing from Minashee in the Cassandran Worlds, Sifo-Dyas was the son of a fisherman. He was discovered by the Jedi Order as an infant by the Jedi Master Cherff Maota, and was eventually placed into the Hawk-Bat Clan, under the direction of Tera Sinube, where he became close friends with Dooku from Serenno.\nDuring their time as initiates, they and their youngling clan joined several other Jedi on a trip to Serenno for a celebration. While captivated by the festivities, young Sifo-Dyas bumped into Grand Master Yoda, causing the other Masters, including Tera Sinube and Yula Braylon to rush to the elder Jedi's aid with concern. Despite this Yoda insisted Sifo-Dyas had learned from his mistake, and the boy promised to be more careful in the future.\nLater, while the Masters were busy demonstrating various lightsaber stances, Dooku ran off after seeing a young girl he thought he recognized. Sifo-Dyas eventually found his friend and the girl, Dooku's sister Jenza, buried under the rubble of the Great Assembly after it collapsed during a groundquake. While the Masters lifted the rubble off of them he tried to comfort his friend. Upon arriving back on Coruscant, Sifo-Dyas was present when Dooku received a box containing a communicator, that allowed him to correspond with his sister over the following decades.\nAt some point Sifo-Dyas discovered the journal of Klias Teradine, which revealed the existence of the Bogan Collection in the Jedi Archives, with this secret he convinced Dooku to help him break in. Together, they used sand levitation to get past the magnetic lock, allowing them to view the vault of forbidden artifacts linked to the dark side of the Force. As Sifo explored, observing scrolls, weapons, and other ancient devices, Dooku's eye was drawn to a large piece of metal that he connected with through the Force. As Sifo was distracted his friend drew closer to it, and heard the sound of a beast drawing near. This frightened the boy, who summoned a Force wave that destroyed many of the items in the chamber and threw Sifo-Dyas through a glass cabinet.\nThe noise quickly drew the attention of Chief Librarian Restelly Quist, who caught the apprentices and brought them to the infirmary. While there, Sifo's arm was put in a bacta cast to help heal his broken bone, and he was confronted by Masters Yoda and Braylon, who each expressed disappointment in the way they had violated their trust. It was here that the pair of younglings first met Jedi Master Lene Kostana, who came to express her concern that the Bogan Collection had not been sealed effectively since children were able to break in.\nSifo and Dooku watched the masters discuss their conflicting philosophies concerning the appropriate way to prepare young Jedi to confront the dark side, and when their discussion was concluded Yoda assigned Sifo-Dyas and Dooku to decipher the Lothal Papyri as punishment. Under the watchful eye of Master Quist they worked through their penance. After a couple days studying crop rotations Master Kostana stopped by and spoke to them, playfully referring to the Grand Master as a \"goblin,\" and wishing the initiates good luck. After she left, Sifo discovered that she had slipped him a book, The Bestiary of Darth Caldoth. His friend urged him to turn it in, but young Sifo-Dyas refused.\nUpon completing the Initiate Trials, Sifo-Dyas participated in the Padawan Tournament where younglings would compete against each other in combat in order to attract prospective masters. Sifo-Dyas came up against Dooku, who defeated him blindfolded and with one arm behind his back. However, his friend elected not to demand his surrender, and allowed his fellow initiate to duel him to a stalemate so he might better impress the masters. Immediately following this, Sifo-Dyas was taken as a Padawan learner by Master Kostana, much to Dooku's initial disappointment as he had hoped to be chosen as her apprentice.\nDuring his time as a Padawan, he visited Palek with Kostana and there managed to acquire a crystal that seemed to be similar to a kyber crystal. Upon returning to the Jedi Temple, Sifo-Dyas gifted this crystal to Dooku. While on Palek, a hyperstorm took place.\nUnder Master Kostana, his mind was opened to the current of the Cosmic Force, which granted him very vivid Force vision of the future. One of these visions involved a planet being engulfed in flames. This turned out to be a warning about the coming Protobranch solar storm before the event had even occurred circa 85 BBY. His teacher encouraged him to take these visions seriously, but Master Kostana also did what she could to hide her apprentice's talents from the Jedi Council, fearful that they might interpret his talent for foresight as being dangerous.\nOver the years, Sifo-Dyas and his Master dedicated their efforts to locating dark side artifacts, and the Bogan Collection expanded greatly during their time together. That so many Sith relics were surfacing, further convinced them that evil was on the rise again.\nAround 82 BBY, the Jedi Council learned Dooku was communicating with his sister in violation of the Jedi Code. He agreed to halt further contact on the condition that he be allowed to attend his mother's funeral. Since Master Kostana and Sifo were already planning on searching the Gordian Reach, which was near Serenno, she convinced the council to allow her to take the apprentice to Mantero, the funeral moon. While there a protest broke out that ended with the Countess's casket knocked over. The Jedi knew the prideful Count Gora would not allow the embarrassing incident to be reported by the HoloNet, and agreed not to inform the council of what had happened.\nWith that done they went immediately to Asusto, following a lead they had discovered earlier while on a mission to infiltrate a smuggler ring on Karazak. While there they encountered a group of Abyssin who were transporting nerve disruptors. Still emotionally unstable from his mother's funeral, Dooku killed all of the smugglers in a fit of rage, but the moss-coated ground trapped them so they were unable to escape. This was an ambush, laid by the Presagers of Hakotei who intended to kill them in order to generate visions of the future. The moss held them as they were tortured, they bore witness to dark images of war, and the return of the Sith. As their foresight overwhelmed them, Dooku lashed out with Force lightning, killing their captors and freeing Sifo-Dyas and Master Kostana.\nKnowing the council would not approve of her exposing apprentices to the dark side, Master Kostana once again insisted they not be informed about what had transpired on Asusto. To help Dooku refocus himself in the light, Sifo and his master taught him an ancient ritual using bindings that allowed him to restore balance within himself.\nSifo-Dyas learned much under Master Kostana, though he never got along with her convor.\nAt some point following their mission to Asusto, Sifo-Dyas was knighted, but because of the severity of his visions Master Kostana continued to work with him. They agreed that they worked well together and since it was common for the ancient Jedi to work in pairs this further served as inspiration for their partnership. Even so, some Jedi such as Dooku were quick to point out she was no longer responsible for his well being, but his former Master was happy to keep their partnership alive. Sifo saw little of his old friend after becoming a Knight, and the emotional toll his visions took on him caused him to develop a stutter. Sifo and Kostana stayed active over the years, constantly traveling on missions and returning to the Jedi Temple infrequently.\nIn 42 BBY, Sifo and his Master returned to Coruscant and were approached by a disgraced Master Yula Braylon. The former Councilor had been asked to transport Dooku and his family protocol droid, D-4, back to Serenno, which had been invaded by Abyssin pirates. The mission was not sanctioned by the Jedi Council and Braylon did not wish to put herself in a worse position with them, but she knew Master Kostana would be happy to help.\nTogether, Sifo-Dyas and Master Kostana took their old friend back to his homeworld. Their ship was shot down, and Sifo was separated from his old Master and Dooku during the fight. Things escalated even further when the Jedi was granted another vision of the future, one where a large gathering of people were chanting Dooku's name. This unnerved Sifo-Dyas and left him unable to participate in the remaining fight. It was soon discovered that the Abyssin had been hired by Dooku's brother, Count Ramil. Dooku confronted his brother, hoping to deescalate the situation, but when the planet's ruler threatened to kill everyone present, the Master summoned a Sith warbeast to cause mayhem and create an opening so that he might strike the Count down. Ultimately, Dooku lost control of the Tirra'Taka, and was forced to kill it.\nWith the Serenno Civil War now over, Sifo-Dyas witnessed his old friend lay claim to his family's title of Count of Serenno. With his sister Jenza's support the people began to chant his name, just as Sifo-Dyas had predicted. They also were present when Dooku informed Yoda that he was resigning from the order, becoming the twentieth member of the Lost before saying goodbye, promising that they would see each other again.\nLater in his life, Sifo-Dyas became a Jedi Master and a leading member of the Jedi High Council, the governing body of the Order, in the last decades of the Galactic Republic. However, some time prior to the Invasion of Naboo, tensions arose between Sifo-Dyas and his fellow councilors. Foreseeing an upcoming full-scale conflict, he started advocating for the creation of an army for the Republic. The rest of the High Council deemed his ideas too extreme, and Sifo-Dyas was removed from his position. Even though the other Jedi had rejected his project, he found a way to carry it out without their consent.\nSifo-Dyas contacted the Kaminoans, who were known for their clone hatcheries, so he could secretly task them with growing a clone army for the Republic. Dyas personally commissioned Prime Minister Lama Su to create the clone force and pretended it was a request of the Galactic Senate. Although it was not known how the Sith caught wind of the project, Dooku, who had left the Jedi Order and become a disciple of the Sith Lord Darth Sidious, later claimed Dyas had willingly worked with him to create the clone army because of the future Dyas had foreseen.\nSome time later, Master Sifo-Dyas was approached by Finis Valorum, the Supreme Chancellor of the Republic, on a secret mission to the planet Oba Diah, the headquarters of the Pyke Syndicate. Valorum, who was aware of the Jedi Master's expertise with the criminal underworld, asked Sifo-Dyas to negotiate a settlement with the Pykes, whose control of the galaxy's raw spice production was threatening a \"full-scale war\" in the underworld of Coruscant. Sifo-Dyas was accompanied by Silman, the Chancellor's personal aide. The mission was kept secret from the Jedi Council, as the Senate committee dealing with the matter feared the political repercussions of openly negotiating with the Pykes.\nHowever, Sifo-Dyas was never able to complete the Chancellor's mission; shortly after he arrived on Oba-Diah, the High Council called him to deal with another conflict: on Felucia, a skirmish had broken out between the local tribes, and Sifo-Dyas was assigned to quell the conflict. As a consequence, both Sifo-Dyas and Silman were diverted to Felucia aboard T-6 shuttle 775519.\nHowever, neither man would ever reach their destination, for Sidious needed Sifo-Dyas' clone army for his plot to bring down the Jedi and the Republic. Unwilling to leave Dyas alive as a loose end, Dooku, who had since apprenticed himself to Sidious under the title of Darth Tyranus, betrayed his former friend by paying the Pyke Syndicate to destroy Sifo-Dyas' shuttle. Since the syndicate wished to gain an advantage over rival crime families, and Tyranus' substantial offer would allow them to do just that, they accepted and shot down Sifo-Dyas' shuttle over the Oba Diah moon. After inspecting the wreckage, they turned over the Jedi Master's corpse to Tyranus as proof that the deed was done. While Sifo-Dyas had died in the crash, Silman was still alive when the Pykes inspected the wreckage. They decided to keep the Chancellor's aide locked up in their prison as insurance against future action by Tyranus, recognizing that anyone who would pay to have a Jedi assassinated was exceedingly dangerous.\nTyranus subsequently took Sifo-Dyas' body and traveled to Felucia. Posing as another Jedi, Tyranus deceived the Felucian tribal elders into believing that Sifo-Dyas had died in the conflict, and had his body cremated according to Felucian custom—thus leaving the Jedi Council unaware of where and how the Jedi Master had truly died.\nFollowing Sifo Dyas's death, Tyranus and Sidious took over his Clone Army project. Sifo Dyas had originally planned for a behavioral modification biochip to be instilled in each Clone, which was to be a safeguard against rogue Jedi. However, Sidious and Tyranus retooled the chips to brainwash the Clones into murdering the Jedi. Posing as a Jedi, Tyranus presented the chip to Lama Su and Nala Se, and deceived them into believing Sifo Dyas's intention. Dooku also travelled to the Jedi Temple on Coruscant to erase any mention of Kamino in the Temple Archives by way of making use of Sifo-Dyas' codes.\nTen years after the Jedi Master's death, the army he had commissioned was discovered by Obi-Wan Kenobi, a Jedi Knight who was investigating on Kamino following the murder of the bounty hunter Zam Wesell by a mysterious colleague of hers, Jango Fett. To his great surprise, Kenobi was greeted by Taun We, a Kaminoan, as if they had been expecting his visit. Prime Minister Su then informed the Jedi of the existence and progress of the clone army ordered by Sifo-Dyas some ten years ago. Although Kenobi had no knowledge of the army, he feigned that his trip to Kamino was in fact an official visit by the Order to inspect the army, so he played along. He bluffed his way into the heart of the hatcheries, and was introduced to the original source of the clones, which was none other than Jango Fett. As soon as he took his leave of the Kaminoans, Kenobi contacted the High Council and told them of the clone army and how Sifo-Dyas was supposed to have commissioned it. The Council members, however, had no more knowledge of the army than Kenobi did, though they did inform Kenobi that whoever had ordered the army had not received the sanction of the Council. Ultimately, Sifo-Dyas' clone army ended up being used at the behest of the Republic, and the conflict between the Separatists and the Republic was named \"the Clone Wars\" after it.\nIn 19 BBY, the last year of the Clone Wars, a Jedi mission led by Plo Koon and Commander Wolffe found a lightsaber belonging to the long-dead Sifo-Dyas on Oba Diah's moon. This unexpected discovery prompted Yoda, Obi-Wan Kenobi, and Anakin Skywalker to investigate his decade-old demise. Meanwhile, Tyranus' master, the mysterious Darth Sidious, was furious to discover that the Jedi were investigating the loose end that was Sifo-Dyas. He ordered Tyranus to clean up his affairs before it was too late. Shortly afterward, during their duel on Oba Diah, Dooku claimed to Anakin Skywalker and Obi-Wan Kenobi that Dyas had helped him.\nAs part of the Sith illusions created by Darth Sidious and Darth Tyranus' ritual, Sifo-Dyas appeared to Yoda on Moraband. His phantom was being tortured, bound by electricity. The specter begged Yoda to release him, offering in exchange the identity of the Sith Lord. However, Yoda saw through him with his Sith eyes and refused the offer, causing him to merge into Sidious.\nAt the end of the war, Chancellor Palpatine, who finally unveiled himself as Darth Sidious, used the biochips and his secret protocol to force Sifo-Dyas's Clone army to turn against the Jedi Order, thereby initiating the Great Jedi Purge, which saw the death of several Jedi Masters. In an ironic twist of fate, unknowingly manipulated and deceived by the Sith Lords, Sifo-Dyas contributed to the destruction of the Jedi in his effort to save the Order.\nOne of the few to survive the initial execution of the Jedi was a Padawan named Ferren Barr. While in hiding, Barr investigated the reason the Jedi had fallen so quickly and absolutely. After discovering Dyas's unwitting involvement, Barr created a file on the Jedi Master which he included in a list of files he stored on a R1-series astromech droid known as Endee that pertained to key individuals involved in the plot.\nIn an early draft of Star Wars: Episode II Attack of the Clones, the name of the Jedi who contacted the Kaminoans was \"Sido-Dyas,\" a false identity for Darth Sidious. Obi-Wan Kenobi claimed to have never heard of him, and Mace Windu confirmed no Jedi of that name existed. In the draft, one instance of Sido-Dyas was misspelled as \"Sifo-Dyas,\" to which the name was ultimately changed.\nHis backstory was originally promised by George Lucas to be revealed in Star Wars: Episode III Revenge of the Sith. However, once Lucas refocused the film's story to center on Anakin, he was forced to cut several plot points related to Attack of the Clones, including Sifo-Dyas' backstory. It wasn't until \"The Lost One,\" a sixth season episode of Star Wars: The Clone Wars, that the character was given a canonical background. He was voiced by Paul Nakauchi for his appearance as a hallucination in the episode \"Sacrifice.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sifo-Dyas",
  "/wiki/Sifo-Dyas/Legends",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/The_Sith_Lord",
  "/wiki/Force_Collector",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/Minashee",
  "/wiki/102_BBY",
  "/wiki/32_BBY",
  "/wiki/Oba_Diah_moon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Hawk-Bat_Clan",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Lene_Kostana",
  "/wiki/Jedi_Master",
  "/wiki/Kaminoan",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Standard_decade",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Cassandran_Worlds",
  "/wiki/Force_power",
  "/wiki/Force_vision",
  "/wiki/Invasion_of_Naboo",
  "/wiki/The_galaxy",
  "/wiki/Army",
  "/wiki/Cloning",
  "/wiki/Galactic_Senate",
  "/wiki/Sith",
  "/wiki/Time",
  "/wiki/Supreme_Chancellor",
  "/wiki/Finis_Valorum",
  "/wiki/Mission_to_Oba_Diah_(pre%E2%80%93Naboo_Crisis)",
  "/wiki/Pyke_Syndicate",
  "/wiki/Oba_Diah",
  "/wiki/Aide",
  "/wiki/Silman",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Dooku",
  "/wiki/Pyke",
  "/wiki/Jedi_T-6_shuttle_775519",
  "/wiki/Starship",
  "/wiki/Death",
  "/wiki/Prisoner",
  "/wiki/Sith_Master",
  "/wiki/Darth_Sidious",
  "/wiki/Clone_trooper",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Clone_template",
  "/wiki/Order_66",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Mission_to_Oba_Diah_(Clone_Wars)",
  "/wiki/Homeworld",
  "/wiki/Sifo-Dyas%27_father",
  "/wiki/Fishing",
  "/wiki/Cherff_Maota",
  "/wiki/Tera_Sinube",
  "/wiki/Serenno",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Yula_Braylon",
  "/wiki/Lightsaber",
  "/wiki/Jenza",
  "/wiki/Great_Assembly_House",
  "/wiki/Groundquake",
  "/wiki/Klias_Teradine",
  "/wiki/Bogan_Collection",
  "/wiki/Jedi_Archives",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Tirra%27Taka",
  "/wiki/Chief_Librarian",
  "/wiki/Restelly_Quist",
  "/wiki/Bacta",
  "/wiki/Lothal_Papyri",
  "/wiki/The_Bestiary_of_Darth_Caldoth",
  "/wiki/Initiate_Trials",
  "/wiki/Palek",
  "/wiki/Crystal",
  "/wiki/Kyber_crystal",
  "/wiki/Hyperstorm",
  "/wiki/Cosmic_Force",
  "/wiki/Protobranch_solar_storm",
  "/wiki/85_BBY/Legends",
  "/wiki/82_BBY",
  "/wiki/Funeral_of_Countess_Anya",
  "/wiki/Gordian_Reach",
  "/wiki/Mantero",
  "/wiki/Gora",
  "/wiki/HoloNet",
  "/wiki/Asusto",
  "/wiki/Smuggler",
  "/wiki/Karazak",
  "/wiki/Abyssin",
  "/wiki/Presagers_of_Hakotei",
  "/wiki/Force_lightning",
  "/wiki/Convor",
  "/wiki/42_BBY",
  "/wiki/Protocol_droid",
  "/wiki/D-4",
  "/wiki/Pirate",
  "/wiki/Ramil",
  "/wiki/Count_of_Serenno",
  "/wiki/Lost_Twenty",
  "/wiki/Prime_Minister",
  "/wiki/Lama_Su",
  "/wiki/Sith_Lord",
  "/wiki/Planet",
  "/wiki/Spice",
  "/wiki/Coruscant_Underworld",
  "/wiki/Mission_to_Felucia_(pre%E2%80%93Naboo_Crisis)",
  "/wiki/Felucia",
  "/wiki/T-6_shuttle",
  "/wiki/Darth",
  "/wiki/Nala_Se",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Knight",
  "/wiki/Zam_Wesell",
  "/wiki/Taun_We",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/19_BBY",
  "/wiki/Standard_year",
  "/wiki/Plo_Koon",
  "/wiki/Clone_Commander",
  "/wiki/Wolffe",
  "/wiki/Sifo-Dyas%27_lightsaber",
  "/wiki/Moon",
  "/wiki/Anakin_Skywalker",
  "/wiki/Moraband",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Ferren_Barr",
  "/wiki/R1-series_astromech_droid",
  "/wiki/Endee",
  "/wiki/Grand_Plan",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Mace_Windu",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_Lost_One",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Paul_Nakauchi",
  "/wiki/Sacrifice",
  "/wiki/Category:Images_of_Sifo-Dyas",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Queen%27s_Hope",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/Conspiracy",
  "/wiki/Fugitive",
  "/wiki/Voices",
  "/wiki/Hologram",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/100_and_Counting_Expanded",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_70",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/The_Star_Wars_Book",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Inside_Intel:_The_Bogan_Collection",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/Reproduction",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY",
  "/wiki/Star_Wars_Inside_Intel:_The_Creation_of_the_Clone_Army",
  "/wiki/May_25",
  "/wiki/2020"
 ]
}