{
 "name": "Siin_Suub",
 "display_name": "Siin Suub",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "SoroSuub Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Siin Suub, sometimes styled as Sin Suub, was a Sullustan male who served as a board member of the SoroSuub Corporation. During his time as Chairman of SoroSuub, the company overthrew and replaced the government of Sullust and pledged allegiance to the Galactic Empire. Chairman Suub was also known to use industrial spies.\nSiin Suub, sometimes spelled as \"Sin Suub,\" was a male Sullustan who had a common Sullustan surname that meant \"wainwright.\" Suub was a bureaucrat working as the Chairman of the SoroSuub Corporation as of 2 BBY . As such, he had an almost complete, though unofficial, control over his homeworld, Sullust, because his company employed half the native population. Through his career, Suub employed several industrial spies, Vacander being among his favorites.\nOn the sixty-second day of the same year, Chairman Suub approved Corporate Proclamation 137d, declaring that SoroSuub was aligned with and supporting the Galactic Empire, and denouncing the Empire's enemy, the Alliance to Restore the Republic. The same Proclamation also declared that the SoroSuub Corporation was taking over Sullust, and thus what was previously said about SoroSuub was also applied to Sullust.\nNevertheless, Sullustans did not become strong supporters of the Empire and, even as Suub was making his statement, many members of that species fought for the Rebel Alliance, earning important distinction in that organization.\n\"Siin Suub\" was first mentioned in The Star Wars Sourcebook. That book's second edition and Alliance Intelligence Reports mention him as \"Sin Suub.\" However, Millennium Falcon uses the original spelling of \"Siin.\" As Millennium Falcon, published in 2008, is the most recent canonical source, this article uses the most current spelling of his name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Strongholds_of_Resistance",
  "/wiki/Sullust/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Time/Legends",
  "/wiki/Chairman/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Spy/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Vacander",
  "/wiki/Standard_day/Legends",
  "/wiki/Corporate_Proclamation_137d",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/The_Star_Wars_Sourcebook",
  "/wiki/Star_Wars_Sourcebook_(Second_Edition)",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/2008",
  "/wiki/Canon",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/West_End_Games",
  "/wiki/SoroSuub_Corporation_Proclamation_Number_137d",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/Galactic_Campaign_Guide"
 ]
}