{
 "name": "Sil Vaturha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kuda's Compound"
     ]
    }
   ]
  }
 ],
 "content": "Sil Vaturha was an orphaned Twi'lek female slave from the planet Corellia. She worked for Kaylo NaKuda, a Herglic crime lord, as a mechanic in his underground swoop garage, Kuda's Compound, on the planet Stend VI during the Galactic Civil War.\nSil Vaturha was a Twi'lek female who was orphaned at a young age. She grew up on the streets of the planet Corellia before being sold into slavery. Kaylo NaKuda, a Herglic crime lord, purchased Vaturha and forced her to work in his underground swoop garage, Kuda's Compound, on the planet Stend VI. Varturha worked for several years before she became his top mechanic for a year sometime after the Battle of Yavin during the Galactic Civil War.\nVaturha was quiet, introspective, and preferred the company of droids and machines because organics had been cruel to her.\nFrom swoops to starfighters, Vaturha could repair almost any kind of vehicle. She was also skilled at computer repair and had acquired urban survival skills from her years on the streets.\nBecause of her occupation, Vaturha often carried around various tools, including a fusioncutter, a beamdrill, a laser-welder, a diagnostic scanner, hydrospanners, and repair kits. She was kept in line by NaKuda with a Vec-Tech AA-2 Keeper. The device was implanted into her skin, and if she attempted escape, it would release an exotic neurotoxin that would instantly kill her. She also wore a decorative headdress.\nSil Vaturha was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. She was illustrated by Greg Smith.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kuda%27s_Compound",
  "/wiki/Slavery/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Kaylo_NaKuda",
  "/wiki/Herglic/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Stend_VI",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Fusioncutter/Legends",
  "/wiki/Beamdrill",
  "/wiki/Laser_welder/Legends",
  "/wiki/Diagnostic_scanner/Legends",
  "/wiki/Hydrospanner/Legends",
  "/wiki/Vector_Technologies",
  "/wiki/AA-2_Keeper",
  "/wiki/Neurotoxin/Legends",
  "/wiki/Death/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Greg_Smith"
 ]
}