{
 "name": "Silar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Silar was a human doctor who was stationed on the planet Banchii by the Galactic Republic during the High Republic Era. Stationed at the local Jedi Temple, Silar worked alongside the Jedi stationed there to help care for Banchii's settlers.\nTrained as a doctor, Silar was one of the settlers of the planet Banchii and a member of the staff of the Jedi Temple established there. Excited by the opportunity to do good in settling a new world for the Galactic Republic, Silar was occasionally provided medical supplies from Hon-Tallos. When Mr. Kooba, one of the refugees from Ta'klah was found to be struck by a strange paralysis, Silar was called out to tend to his ailments. Finding nothing physically wrong with Kooba, Silar was prepared to send him to Hon-Tallos for further examination if his conditions worsened. Not long after Silar returned to the Temple infirmary, the settlement was beset by rampaging Drengir which sent the settlers running for the safety of the Temple. As the infirmary was overwhelmed with an influx of wounded, Silar was assisted in treating the wounded by Jedi Initiates Viv'nia and Nema. As a Drengir entered the Temple and began attacking the settlers, Silar ordered the Initiates away, preparing to stand in the way of the Drengir to protect the younglings. Before having to engage the beast, Jedi Lily Tora-Asi and Padawan Keerin Fionn entered the fray, luring the Drengir out of the Temple and to its destruction in the yard. As the battle wound down, Silar helped account for the dead and prepare them on gurneys for autopsy and examination. After researching the remains, Silar concluded that spores were introduced to the affected refugees from Ta'klah and deliberately infected with the Drengir.\nFollowing Jedi Master Arkoff's departure from Banchii, Doctor Silar continued to report to Jedi Tora-Asi on findings related to the Drengir. While shaken by the disruption, Silar's resolve was not compromised, even in the face of an impending assault by the Nihil. When the attack finally began, Silar helped to calm the wounded settlers, even after the Temple fell and the Jedi were forced to evacuate. Surviving the assault, Silar and the others joined Jedi archivist Ru-Ru as they left Banchii in favor of the safety of Coruscant.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Galactic_Republic",
  "/wiki/Lily_Tora-Asi",
  "/wiki/Doctor",
  "/wiki/Planet",
  "/wiki/Banchii",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_Temple_(Banchii)",
  "/wiki/Jedi",
  "/wiki/Hon-Tallos",
  "/wiki/Kooba",
  "/wiki/Ta%27klah",
  "/wiki/Drengir",
  "/wiki/Jedi_Initiate",
  "/wiki/Viv%27Nia_Nia%27Viv",
  "/wiki/Nema",
  "/wiki/Keerin_Fionn",
  "/wiki/Jedi_Master",
  "/wiki/Arkoff",
  "/wiki/Nihil",
  "/wiki/Jedi_archivist",
  "/wiki/Ru-Ru",
  "/wiki/Coruscant",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._1",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2"
 ]
}