{
 "name": "Sila Kott",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Toprawa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Endor system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Sila Kott, a female human from Toprawa, was a pilot in the Alliance to Restore the Republic. Despite having the qualifications to fly a starfighter, she preferred to fly transports as she was reluctant to take a life. However, after the Battle of Hoth, Commander Wedge Antilles convinced Kott to join Red Squadron and become a starfighter pilot. Later, she flew an A-wing as Red Three at the Battle of Endor, where she was shot down by two Imperial TIE Interceptors in an attempt to lead them away from her wingmates.\nA female human from the Outer Rim planet of Toprawa, Sila Kott ended up joining the Starfighter Corps of the Alliance to Restore the Republic, a resistance movement that sought to topple the dictatorial Galactic Empire. In her early days with the Rebel Alliance, she flew troop transports. Commander Arhul Narra tried to recruit her into a starfighter squadron, back when he made every pilot do simulator runs, but she refused. It was later determined that she didn't want to fly a starfighter because she never wanted to take someone else's life.\nShortly after the evacuation of Hoth in 3 ABY, Kott was recruited by Commander Wedge Antilles into the newly reformed Red Squadron. She purposely sabotaged her simulator training, before revealing to Antilles that she never killed anybody in all the years she'd been with the Rebellion and that she wouldn't take someone's life. Antilles explained to her that they \"pulled the trigger\" to help to create a galaxy where no one has to do it, which meant killing people and that the Alliance and her loved ones needed her. She was assigned the callsign Red Three and flew a T-65B X-wing starfighter as Antilles' wingmate, alongside Tomer Darpen, in an attack on a nearby pirate base, that threatened the safety of the Alliance's rendezvous point.\nIn 4 ABY, she participated in a decisive battle at Endor, flying an A-wing interceptor with Red Squadron still under the callsign Red Three. Although the rebels managed to destroy the Empire's second Death Star battlestation, Kott did not live to see the Alliance triumph. Indeed, at one point during the battle, the pilot went head to head with swarms of Imperial fighters, and perished under enemy fire when she tried to lead two TIE/IN interceptors away from her comrades.\nTo honor her contribution to liberating the galaxy, the Sila Kott flight school was built in her name on her home planet.\nSila Kott first appeared in Star Wars: Episode VI Return of the Jedi, the third and final film in the Star Wars original trilogy. Portrayed by British actress Poppy Hands, she was inexplicably dubbed over by an American man's voice in the final cut of the film.\nNevertheless, both the official Databank on StarWars.com and the activity book Star Wars: A-wing Deluxe Book and 3D Wood Model correctly identify Kott as a woman.\nAlthough the Databank has Kott listed as Red Two, Return of the Jedi hints at her being Red Three, which is confirmed by the Deluxe Book and 3D Wood Model.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sila_Kott",
  "/wiki/Sila_Kott/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Sila_Kott",
  "/wiki/Toprawa",
  "/wiki/4_ABY",
  "/wiki/Endor_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Pilot",
  "/wiki/Transport",
  "/wiki/Battle_of_Hoth",
  "/wiki/Commander",
  "/wiki/Wedge_Antilles",
  "/wiki/Starfighter",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Red_Three",
  "/wiki/Battle_of_Endor",
  "/wiki/Galactic_Empire",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Dictatorship",
  "/wiki/Arhul_Narra",
  "/wiki/3_ABY",
  "/wiki/Callsign",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Tomer_Darpen",
  "/wiki/Attack_on_an_asteroid_mining_station",
  "/wiki/Pirate",
  "/wiki/Endor",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Death_Star",
  "/wiki/Battlestation",
  "/wiki/Death",
  "/wiki/The_galaxy",
  "/wiki/Sila_Kott_flight_school",
  "/wiki/Homeworld",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Poppy_Hands",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_A-wing_Deluxe_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Rendezvous_Point_(short_story)",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_The_Rebel_Files"
 ]
}