{
 "name": "Silman",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Oba Diah"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Office of the Chancellor",
      "Galactic Senate",
      "Office of the Chancellor"
     ]
    }
   ]
  }
 ],
 "content": "Silman was a male human who served as the personal aide to Supreme Chancellor Finis Valorum during his time in office. Prior to the Separatist Crisis, Silman accompanied Jedi Master Sifo-Dyas on a mission to Oba Diah. However, their shuttle was shot down and Sifo-Dyas was killed under the orders of Count Dooku, a Sith apprentice. Silman survived but was kept as a prisoner by the Pyke Syndicate for the next ten years. He was rediscovered by Master Obi-Wan Kenobi and Anakin Skywalker near the end of the Clone Wars. Before he could reveal Dooku's involvement in Sifo-Dyas' death, he was murdered by the Sith Lord.\nPrior to the invasion of Naboo, Silman was the personal aide to Republic's Senate leader, Supreme Chancellor Finis Valorum. Silman was then assigned to assist former Jedi High Council member, Master Sifo-Dyas, with secret negotiations with the Pyke Syndicate on Oba Diah. However, after the negotiations, Silman's and Sifo-Dyas' T-6 shuttle was shot down over Oba Diah's moon by the Pykes, on orders from a man named Tyranus.\nDuring the attack, their shuttle's long-range transmitter was knocked out. Silman managed to bailed out in an emergency survival capsule numbered 775519 and survived the crash. However, Sifo-Dyas was killed but not before recording a hologram message confessing his role in the commissioning of the Grand Army of the Republic. His body was given to Tyranus by the Pykes. Silman survived the crash and was imprisoned by the Pykes prison on Oba Diah. The leader of the Pykes, Lom Pyke, took Silman's medallion and wore it.\nFor several years, Silman was kept in the Pykes' prison as insurance, in case Tyranus, the Republic, or the Jedi discovered Sifo-Dyas's true fate and the Pyke's involvement. As a result of his prolonged incarceration, Silman's mental health deteriorated. He befriended and fed the vermin and lice that shared his cell.\nWhile investigating Master Sifo-Dyas' role in engineering the Clone Wars, Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker traveled to Oba Diah after learning that Silman had accompanied Sifo-Dyas during a mission to mediate a conflict on Felucia. In return for an amnesty for the Pykes' betrayal of Sifo-Dyas, Lom Pyke revealed that the Pykes had kept Silman alive and led him to his cell.\nKenobi questioned Silman about the identity of the second Jedi who supposedly accompanied and betrayed them. Despite his mental state, Silman managed to tell Kenobi and Skywalker that someone wanted to impersonate Master Sifo-Dyas and had ordered the Pykes to kill them. However, Silman was Force choked by Dooku, who revealed himself as Tyranus, the man behind Sifo-Dyas' death.\nSilman was a human man with blue eyes, light skin, and brown hair. He served as an aide to Chancellor Valorum. Due to his imprisonment by the Pykes, Silman had become gaunt and pale with his hair turning white. His mental health also suffered as a result of his imprisonment, leading him to regard the lice and vermin that inhabited his cells as friends. Despite his physical and mental deterioration, Silman still maintained enough of his faculty and tried to expose Count Dooku's role in Master Sifo-Dyas' death.\nWhile working as a Chancellor's aide, Silman wore white robes and a medallion. He lost his medallion to the Pykes. Due to his imprisonment, Silman was reduced to wearing rags.\nSilman first appeared in The Clone Wars: The Lost Missions episode \"The Lost One,\" which premiered on the streaming platform Netflix on March 7, 2014. He was voiced by Brian George, who also voiced Ki-Adi-Mundi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Silman",
  "/wiki/Silman/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Coruscant",
  "/wiki/19_BBY",
  "/wiki/Oba_Diah",
  "/wiki/Human",
  "/wiki/Coruscanti",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Office_of_the_Chancellor",
  "/wiki/Supreme_Chancellor",
  "/wiki/Finis_Valorum",
  "/wiki/Separatist_Crisis",
  "/wiki/Jedi_Master",
  "/wiki/Sifo-Dyas",
  "/wiki/Mission_to_Oba_Diah_(pre%E2%80%93Naboo_Crisis)",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Sith_apprentice",
  "/wiki/Pyke_Syndicate",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Clone_Wars",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Naboo",
  "/wiki/Jedi",
  "/wiki/Jedi_High_Council",
  "/wiki/Pyke",
  "/wiki/T-6_shuttle",
  "/wiki/Jedi_T-6_shuttle_775519",
  "/wiki/Oba_Diah_moon",
  "/wiki/Hologram",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Prison",
  "/wiki/Lom_Pyke",
  "/wiki/Standard_year",
  "/wiki/Jedi_Knight",
  "/wiki/Mission_to_Oba_Diah_(Clone_Wars)",
  "/wiki/Felucia",
  "/wiki/Force_choke",
  "/wiki/Death",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/The_Lost_One",
  "/wiki/Netflix,_Inc.",
  "/wiki/March_7",
  "/wiki/2014",
  "/wiki/Brian_George",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Force_Collector",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau"
 ]
}