{
 "name": "Sim Aloo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "DS-2 Death Star II Mobile Battle Station",
      "Endor system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aloo family",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Sim Aloo was a human male who served as an adviser to Emperor Sheev Palpatine, the sole ruler of the Galactic Empire, during the Galactic Civil War. He traveled with Palpatine to the DS-2 Death Star II Mobile Battle Station, where the Emperor oversaw its construction before the Battle of Endor. Aloo was present in a meeting between the Emperor and his subordinates, including Darth Vader and Moff Tiaan Jerjerrod, and continued to advise his master aboard the battle station. He perished when the Death Star was destroyed by the Rebel Alliance.\nSim Aloo served as one of Emperor Sheev Palpatine's closest advisers during the age of the Galactic Empire. Although Palpatine tended to use him more as an errand boy, Aloo walked around like a god on his homeworld, and his duties as adviser had an actual importance in the day-to-day governance. In the years leading up to the Galactic Civil War, Aloo and his colleague, Janus Greejatus were tasked with collecting Sith artifacts from across the galaxy for their master. The Emperor heard rumors of a book of dark power guarded by monsters in a forest on the planet Ushruu and expressed interest in having it for himself. Aloo enlisted his daughter, Alinka Aloo, to assist with this task. She formulated a plan to retrieve the book from the Ushruu, by extorting the aid of the Wookiee Chewbacca and the bounty hunter and librarian, Mayvlin Trillick, who was captured by Aloo's guards while attempting to steal the Mola Oktaro from one of his warehouses. The rebels caught wind of this and sent the spy Cassian Andor and K-2SO to stop the Aloo family.\nAfter the Battle of Hoth, the Emperor allowed the enemy Rebel Alliance to learn that the second Death Star, a planet-killing battle station, was being constructed in orbit over the forest moon of Endor. In order to entice the Rebels into a trap, Palpatine personally traveled to the Death Star to oversee the final phases of its construction. Along with Greejatus and four other advisers, Aloo accompanied the Emperor to the Death Star. Their arrival was greeted by Darth Vader, the Emperor's apprentice; Moff Tiaan Jerjerrod, the station's commander; and an assemblage of stormtroopers and officers.\nOnce aboard the Death Star, the Emperor spent his time in his throne room, and his advisers conferred with him there. Aloo, Greejatus, and the Emperor were having a gathering when Vader and Jerjerrod interrupted them. The advisers waited silently as the Emperor shrugged off the concerns of Vader, who knew the Alliance Fleet was massing near the planet Sullust. The Emperor ordered Vader to move the Imperial fleet surrounding the Death Star to the far side of Endor, where he intended for it remain until the Rebel attack. Confident that his trap would successfully see the end of the Rebel Alliance, Palpatine dismissed Vader and Jerjerrod, resuming his gathering with Aloo and Greejatus.\nThe Emperor's plan to destroy the Rebels, as well as to convert Vader's son, Luke Skywalker, to the dark side of the Force, ultimately failed. Skywalker redeemed his father, who killed the Emperor shortly before Skywalker escaped, and the Rebels destroyed the Death Star. Aloo perished along with the five other dignitaries on board.\nA skeletal-looking individual clad in flowing purple robes and a tall Imperial dignitary hat, Sim Aloo was a human male who had pale skin and blue eyes. In the Emperor's presence, the adviser behaved with much humility and obedience, cowering near the Imperial throne.\nAloo's family was very rich. He owned warehouses full of books, artwork, jewelry and more items from all across the galaxy. Because Aloo was often busy with his governmental duties, he frequently had his daughter oversee the day-to-day running of the family business.\nSim Aloo first appeared as an unnamed Imperial advisor in the 1983 film Star Wars: Episode VI Return of the Jedi, in which the character has no dialogue. The character, who was portrayed by Anthony Lang, went unnamed until the name \"Sim Aloo\" was used in the Star Wars Legends Star Wars Customizable Card Game pack Death Star II Limited. The name was then canonized in Aloo's Databank entry.\nAloo's costume was designed by Nilo Rodis-Jamero. Rodis-Jamero felt that the look of the Imperial advisors was one of the most exciting designs from Return of the Jedi and thought their design would need to convey an idea about the kind of world that the Emperor lived in. Rodis-Jamero based the look on that of Catholic bishops, with red coloring and ornate headpieces.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sim_Aloo",
  "/wiki/Sim_Aloo/Legends",
  "/wiki/4_ABY",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Endor_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Aloo_family",
  "/wiki/Galactic_Empire",
  "/wiki/Emperor%27s_adviser",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Endor",
  "/wiki/Anakin_Skywalker",
  "/wiki/Moff",
  "/wiki/Tiaan_Jerjerrod",
  "/wiki/Battle_station",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial_Era",
  "/wiki/Deity",
  "/wiki/Homeworld",
  "/wiki/Advisor",
  "/wiki/Standard_day",
  "/wiki/Standard_year",
  "/wiki/Janus_Greejatus",
  "/wiki/Sith",
  "/wiki/Sith_artifact",
  "/wiki/The_galaxy",
  "/wiki/Enchantress%27_book",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Corellian_hound",
  "/wiki/Forest",
  "/wiki/Planet",
  "/wiki/Ushruu",
  "/wiki/Alinka_Aloo",
  "/wiki/Book",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Bounty_hunter",
  "/wiki/Librarian",
  "/wiki/Mayvlin_Trillick",
  "/wiki/Mola_Oktaro",
  "/wiki/Spy",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/K-2SO",
  "/wiki/Battle_of_Hoth",
  "/wiki/Orbit",
  "/wiki/Moon",
  "/wiki/Endor",
  "/wiki/Death_Star",
  "/wiki/Sith_apprentice",
  "/wiki/Commander",
  "/wiki/Stormtrooper",
  "/wiki/Imperial_officer",
  "/wiki/Time",
  "/wiki/Emperor%27s_Throne_Room",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Sullust",
  "/wiki/Imperial_Navy",
  "/wiki/Luke_Skywalker",
  "/wiki/Parent",
  "/wiki/Death",
  "/wiki/Robe",
  "/wiki/Hat",
  "/wiki/Eye",
  "/wiki/Throne",
  "/wiki/Galaxy",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Anthony_Lang",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Death_Star_II_Limited",
  "/wiki/Databank_(original)",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!_(audiobook)",
  "/wiki/Star_Wars_(2020)_13",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Star_Wars:_Destiny_Two-Player_Game",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_1",
  "/wiki/Star_Wars_Universe",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Tarkin_(novel)",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/July_16",
  "/wiki/2017"
 ]
}