{
 "name": "Simmix",
 "display_name": "Simmix",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "257 BBY",
      "the lost moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Fillithar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Cohmac Vitus"
     ]
    }
   ]
  }
 ],
 "content": "Simmix was a Fillithar male Jedi Master of the Jedi Order during the High Republic Era. He was the master of Padawan Cohmac Vitus, who viewed Simmix as a kind master. Simmix and Vitus accompanied Master Laret Soveral and her Padawan, Orla Jareni, when the Jedi responded to the kidnapping of monarchs from the planets Eiram and E'ronoh. As a result of a trap set by the Directorate, the syndicate responsible for the kidnappings, Simmix was killed when their T-1 shuttle crashed onto the lost moon.\nThe death of Simmix caused Vitus extreme grief, and the Padawan questioned the Jedi's teachings about handling such emotions as a result. Vitus resolved to bury his grief and honor Simmix in his duty to the Jedi Order, but his master's death continued to burden him for years afterward.\nDuring the High Republic Era, Simmix served as a Jedi of the Jedi Order. He eventually attained the rank of Jedi Master, taking Cohmac Vitus as his Padawan. During his training of Vitus, who often daydreamed, Simmix frequently reminded him to improve his ability to live wholly in the present.\nIn the year 257 BBY, the twin planets Eiram and E'ronoh called for help from the Jedi after rulers from both worlds—Queen Thandeka of Eiram and Monarch Cassel of E'ronoh—were kidnapped by the Directorate criminal syndicate in a hostage crisis. Simmix and Vitus, along with Master Laret Soveral and her Padawan, Orla Jareni, were dispatched aboard a T-1 shuttle to provide assistance. Upon boarding, the Jedi discovered that the shuttle's safety harnesses were not configured for limbless individuals such as Simmix, but the Jedi Master laughed the issue off, saying he would take his chances.\nSimmix instructed Vitus to read up on the local mythology on their journey, informing him that serpents played a large part in the folklore. Vitus did not believe the information would become useful, only skimming through the reading. Aboard the shuttle, Masters Simmix and Soveral meditated while Jareni and Vitus piloted the starship. After arriving in the Eiram system, their T-1 shuttle received a distress signal from the wrecked craft of Monarch Cassel on the lost moon, a drifting moon between the two planets. The Padawans intended to follow the signal; however, the distress call was a trap set by the Directorate, and their shuttle crashed onto the moon. Due to the configuration of the shuttle's safety harnesses, Simmix was killed in the crash.\nFollowing the crash, Master Soveral discovered Simmix's body. Vitus, reaching out into the Force upon regaining his senses, was unable to detect his master's presence, and Soveral apologized to him, confirming Simmix's death. Vitus knelt beside Simmix's body, closing his master's eyes. Vitus was overwhelmed by grief in the immediate aftermath of Simmix's death, blaming himself for not reminding his master of the risks when boarding the shuttle. The three survivors were forced to exit the wreckage and leave Simmix's body behind; while Soveral regretted doing so, she hoped that the Directorate would believe that he had traveled alone if they were to find him. After entering a cave system on the moon, Vitus recognized carvings of a serpent from the folklore and was later forced to fight several of the creatures that the carvings had warned about, haunted by the resemblence between the snakes and Simmix.\nJedi doctrine claimed that Vitus should not mourn Simmix's death, as his master had become one with the Force; however, Vitus was infuriated by the expectation that he should not have formed an attachment after developing such a close relationship with his master. Vitus decided that showing his anger would provide no help, intending to serve the Jedi well in honor of Simmix. Despite this, Vitus was later envious when he witnessed Thandeka mourn the death of Cassel, knowing he could not acknowledge his own loss. Vitus buried his grief, believing that was what Simmix would have told him to do. Regardless, the loss of his master continued to deeply affect Vitus long after Simmix's death, and he remained doubtful of the Jedi teachings regarding the handling of emotions. Twenty-five years later, while Vitus—by then a Jedi Master himself—and several others, including Jareni, were stranded aboard the Amaxine space station following the Great Hyperspace Disaster, Vitus recalled Simmix after the supposed death of Jedi Knight Dez Rydan.\nA Fillithar male, Simmix possessed green scales. As a Jedi Master, Simmix had a faithful duty to the Jedi Order and was kind to his Padawan. Simmix was always cautious with the lives of others, but was often careless about his own. His Padawan usually pointed his carelessness out, which pleased Simmix, who claimed he had outsourced his sense of self-preservation to Vitus. Simmix believed that disagreeing with the Jedi Council was allowed and what mattered was how one showed that disagreement.\nAs a Jedi, Simmix was Force-sensitive. When sensing Simmix in the Force, Vitus perceived him as having a calm and powerful centeredness.\nCreated for the Star Wars: The High Republic publishing initiative, Simmix was introduced—albeit only appearing as a corpse in a flashback sequence—in the novel The High Republic: Into the Dark, written by Claudia Gray and published on February 2, 2021. The character's name was revealed in an excerpt from the novel in The High Republic Free Digital Sampler, released in 2020.\nThe second episode of Star Wars: The High Republic Show, released on March 29, 2021, depicted Simmix as a silhouette in a recap of the initiative's events. However, the silhouette portrayed Simmix as a humanoid figure with evident limbs, while Into the Dark explicitly establishes him to be a limbless Fillithar. In the episode, Simmix is additionally depicted as wielding a blue-bladed lightsaber and wearing Jedi robes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/257_BBY",
  "/wiki/Lost_moon",
  "/wiki/Fillithar",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Cohmac_Vitus",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Padawan",
  "/wiki/Laret_Soveral",
  "/wiki/Orla_Jareni",
  "/wiki/Jedi",
  "/wiki/Eiram%E2%80%93E%27ronoh_crisis",
  "/wiki/Monarchy",
  "/wiki/Planet",
  "/wiki/Eiram",
  "/wiki/E%27ronoh",
  "/wiki/Directorate",
  "/wiki/Death",
  "/wiki/T-1_shuttle_(Jedi_Order)",
  "/wiki/Standard_year",
  "/wiki/Jedi_training",
  "/wiki/Queen",
  "/wiki/Thandeka",
  "/wiki/Cassel_(monarch)",
  "/wiki/Shuttle",
  "/wiki/Limb",
  "/wiki/Snake",
  "/wiki/Meditation",
  "/wiki/Pilot",
  "/wiki/Starship",
  "/wiki/Eiram_system",
  "/wiki/Distress_signal",
  "/wiki/Moon",
  "/wiki/The_Force",
  "/wiki/Eye",
  "/wiki/Cave",
  "/wiki/Unidentified_white_serpent_species",
  "/wiki/Species",
  "/wiki/Amaxine_space_station",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Jedi_Knight",
  "/wiki/Dez_Rydan",
  "/wiki/Jedi_High_Council",
  "/wiki/Force-sensitive",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/Claudia_Gray",
  "/wiki/February_2",
  "/wiki/The_High_Republic_Free_Digital_Sampler",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_High_Republic_Show",
  "/wiki/March_29",
  "/wiki/Humanoid",
  "/wiki/Lightsaber",
  "/wiki/Jedi_robes",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/232_BBY"
 ]
}