{
 "name": "Simon  (Ewok)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1 meter"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Simon, known as Simon the Killer Ewok, was an Ewok male with brown fur and black eyes. Simon wielded a staff weapon that fired devastating blaster bolts capable of quickly destroying buildings, beings, droids, and vehicles. He was also equipped with an energy shield and was capable of moving at fast speed. Simon stood at one meter tall, wore a piece of orange hooded clothing that covered his chest and head, with holes for his ears and face. He also wore a headpiece with two plumes and spoke the Ewokese language.\nSimon the Killer Ewok appeared in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds, where he could be accessed by typing the cheat code \"Simonsays\" in the game's chat box. After the code is entered, Simon would appear on any stretch of land that the player is overlooking. The color of the plumes on Simon's headpiece are dependent on the team color of the player he is summoned by. They can be blue, red, green, yellow, purple, gray, orange, or cyan. Simon's model and profile image are identical to that of Chief Chirpa, who appears in multiple campaigns in the game.\nUnlike most of the game's other cheat codes, \"Simonsays\" was not mentioned in Prima Games' strategy guide for Galactic Battlegrounds, and was instead revealed on the LucasArts website. Galactic Battlegrounds level designer Lily Mansfield believed that Simon was named in reference to Simon Jeffrey, the president of LucasArts at the time. When asked about Simon's canonicity on the StarWars.com Message Boards, Lucasfilm's Holocron continuity database manager Leland Chee compared Simon to Max, a character who appeared as an Easter egg in the 1997 video game Star Wars: Jedi Knight: Dark Forces II.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Simon",
  "/wiki/Easter_egg_(virtual)",
  "/wiki/Canon",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/File:Simon_sound.ogg",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Staff/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Species/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Personal_energy_shield/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Ewokese/Legends",
  "/wiki/Language/Legends",
  "/wiki/2001",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Chief/Legends",
  "/wiki/Chirpa/Legends",
  "/wiki/Prima_Games",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Lily_Mansfield",
  "/wiki/Simon_Jeffrey",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Holocron_continuity_database",
  "/wiki/Leland_Chee",
  "/wiki/Max_(bunny)",
  "/wiki/1997",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/November_4",
  "/wiki/2006",
  "/wiki/Wookieepedia"
 ]
}