{
 "name": "Simpi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "I'vorcia Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sarlacc"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Owner(s)",
     "values": [
      "Dok-Ondar"
     ]
    }
   ]
  }
 ],
 "content": "Simpi was a juvenile sarlacc from the Outer Rim planet I'vorcia Prime. During the Imperial Era, Simpi was being studied by Doctor Genzhor, prior to a betrayal by his assistant, Ooris. The smugglers Han Solo and Chewbacca were sent to I'vorcia Prime by the collector Dok-Ondar to acquire several sarlaccs from the late doctor, but the duo fell into a trap set by Ooris. The two smugglers escaped danger and used Ooris as live bait to capture Simpi and deliver the creature back to Dok-Ondar on Batuu.\nAround 34 ABY, the Kendoh Gang, under the leadership of Kendoh Voss, attempted a heist on Dok-Ondar, though they were caught by a First Order sergeant in the act. In order to avoid capture, Voss freed Simpi by smashing open the sarlacc's tank. The creature then attacked the sergeant's stormtroopers, allowing Voss the opportunity to escape.\nSimpi was an infant sarlacc that lived on the Outer Rim planet I'vorcia Prime during the Imperial Era. While on the planet, the creature was studied by Doctor Genzhor, the galaxy's leading expert on sarlaccs, in a research outpost set up in the local nature preserve. Genzhor was eventually killed, betrayed by his assistant, Ooris.\nSometime later, the smugglers Han Solo and Chewbacca arrived on I'vorcia Prime on a job from the Ithorian collector Dok-Ondar to acquire several sarlaccs from Genzhor. Ooris lured the duo into a trap, hoping Simpi and the other sarlaccs would kill the smugglers. However, the two escaped and used Ooris as bait to capture Simpi and bring the creature aboard their freighter, the Millennium Falcon. Solo and Chewbacca then delivered Simpi to Dok-Ondar's Den of Antiquities, a store located in Black Spire Outpost on the planet Batuu. Dok-Ondar placed the sarlacc in a container filled with dirt and displayed it for his patrons to see. The locals around Black Spire Outpost eventually saw Simpi as a source of pride for the community, as Solo and Chewbacca were famous smugglers known across the galaxy.\nSometime around 34 ABY, during the First Order's war with the Resistance and after the arrival of its 709th Legion on Batuu, Dok-Ondar retold the story of Simpi's capture as an example to the Kendoh Gang that he was capable of acquiring anything he wanted, no matter how dangerous. Despite Dok-Ondar's warning, Kendoh Voss and her gang eventually attempted a heist on the shopkeeper; however, their plans were discovered by a sergeant in the 709th, who interrupted the heist along with his stormtroopers.\nRealizing she was out of options, Voss attacked the troopers and, when cornered, smashed open Simpi's tank. The newly freed sarlacc began feasting on the stormtroopers, allowing Voss a window to escape. After the remaining troopers left the store in search of Voss and her accomplices, Dok-Ondar's IG-series assassin droid, BK-86, asked if it should eliminate the sarlacc. Dok-Ondar enthusiastically reminded it of how much the creature cost, ensuring the droid that Simpi had gorged itself on the troopers and would be easy to place in another tank.\nShortly after the attempted heist, the Amani owner of the nearby Creature Stall, Bina, included the sarlacc in her interactive book, Bina's Guide to the Creatures of Batuu, which her workers handed out to younglings nine years old or younger free of charge. The activity required the younglings to draw items that were being visibly digested in Simpi's stomach. Dok-Ondar also began selling a toy of Simpi in the new red tank in his Den of Antiquities.\nSimpi was a juvenile sarlacc with tan skin and three tentacles. At the time of Simpi's capture by Han Solo and Chewbacca, the sarlacc was still young enough to need to hunt for its food and was not old enough to have dug its roots into the ground.\nSimpi made its first appearance, though unnamed, in the 2019 comic Galaxy's Edge 1, written by Ethan Sacks and illustrated by Will Sliney. The sarlacc was then mentioned in the D23 article \"Creatures, Droids, and Aliens: Meet the Fantastical Figures of Star Wars: Galaxy's Edge,\" which was published on May 29, 2019. The article showcased the then-upcoming appearance of the creature as an animatronic prop in Dok-Ondar's Den of Antiquities, a retail location in Star Wars: Galaxy's Edge, the theme park land that opened to guests at Disneyland Park and Disney's Hollywood Studios Park in 2019.\nSimpi was named in the official backstory elements for Dok-Ondar's Den of Antiquities, though the name initially was only able to be gleaned verbally from cast members working the store. The name \"Simpi\" was made public on July 12, 2019, with the posting of the blog entry \"Cosmic Creatures and Aliens at Star Wars: Galaxy's Edge in Disneyland Park\" on the Disney Parks Blog.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/I%27vorcia_Prime",
  "/wiki/Sarlacc",
  "/wiki/Color",
  "/wiki/Dok-Ondar",
  "/wiki/Ithorese",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Doctor",
  "/wiki/Genzhor",
  "/wiki/Gender",
  "/wiki/Aide",
  "/wiki/Ooris",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Collector",
  "/wiki/Death",
  "/wiki/Batuu",
  "/wiki/34_ABY",
  "/wiki/Kendoh_Gang",
  "/wiki/Kendoh_Voss",
  "/wiki/First_Order",
  "/wiki/Unidentified_First_Order_stormtrooper_sergeant",
  "/wiki/Sergeant",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/The_galaxy",
  "/wiki/Genzhor%27s_research_outpost",
  "/wiki/I%27vorcia_Prime_Preserve",
  "/wiki/Ithorian",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Galaxy",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Battle_of_Batuu",
  "/wiki/709th_Legion",
  "/wiki/Trooper",
  "/wiki/IG-series",
  "/wiki/Assassin_droid",
  "/wiki/BK-86",
  "/wiki/Droid",
  "/wiki/Amani",
  "/wiki/Creature_Stall",
  "/wiki/Bina",
  "/wiki/Bina%27s_Guide_to_the_Creatures_of_Batuu",
  "/wiki/Youngling",
  "/wiki/Standard_year",
  "/wiki/Limb",
  "/wiki/Time",
  "/wiki/Foodstuff",
  "/wiki/2019",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Galaxy%27s_Edge_1",
  "/wiki/Ethan_Sacks",
  "/wiki/Will_Sliney",
  "/wiki/May_29",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/July_12",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Category:Images_of_Simpi",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/Galaxy%27s_Edge_5",
  "/wiki/A_Crash_of_Fate",
  "/wiki/A_Crash_of_Fate_(audiobook)",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/File:Sarlacc-GEDatapadQuestion.jpg",
  "/wiki/File:Sarlacc-GEDatapadTrivia.jpg",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Rise_of_the_Resistance",
  "/wiki/Standard_week",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}