{
 "name": "Sinker",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black; blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "104th Battalion",
      "104th Battalion"
     ]
    }
   ]
  }
 ],
 "content": "\"Sinker\" was the nickname of a Clone Sergeant who served in the Grand Army of the Republic during the Clone Wars along with the rest of Wolfpack throughout the conflict. He served as a sergeant under Jedi Master Plo Koon and Commander Wolffe in the 104th Battalion.\nLike all of his fellow clone troopers in the Grand Army of the Galactic Republic, Sinker was created as a clone of the bounty hunter Jango Fett on the planet Kamino. Sinker was made a sergeant in the 104th Battalion, also known as the Wolfpack Battalion. The battalion was led by Clone Commander CC-3636, who was nicknamed \"Wolffe,\" and the Jedi Master and General Plo Koon, who served on the Jedi High Council.\nEarly on in the Clone Wars, Sinker joined Clone Commander CC-3636 \"Wolffe,\" CT-4860 \"Boost,\" and Clone Corporal \"Comet\" to infiltrate the Nexus, a floating city and trading outpost that was controlled by the Separatists. However, they were discovered by Wat Tambor, who destroyed the city. Despite their failure, they managed to rescue civilian and were rescued by Koon.\nDuring the hunt for the Separatist superweapon Malevolence, Sinker escaped Jedi General Plo Koon's Jedi Attack Cruiser in a Republic escape pod along with Commander Wolffe, Boost, and Jedi Master Plo Koon himself after the cruiser was hit by an ion cannon, wiping out all its power and leaving it defenseless. When their escape pod was attacked by several rocket battle droids and their pod hunter, Koon led the sergeant and Boost in successfully defending their pod long enough for General Anakin Skywalker and Commander Ahsoka Tano to rescue them, resulting in the Republic gathering enough intel on the ship from the survivors to destroy the Malevolence.\nFurther on in the war, Sinker and the rest of the Wolfpack fought alongside Ahsoka Tano in a stealth mission to scale the walls of a Separatist outpost on Felucia, during which Tano was captured by the Trandoshan hunter, Lo-Taren. In an attempt to find his missing padawan, General Anakin Skywalker sent Sinker and a few other members of the Wolfpack to search the area surrounding the outpost for his padawan. However, after several unsuccessful searches, they eventually left.\nOn their first mission in their Phase II armor, Sinker and the rest of Wolfpack was sent to the planet Aleen alongside R2-D2 and C-3PO to aid the residents after several earthquakes. Boost and Sinker accompanied R2-D2 to the Aleen mainframe station where R2 downloaded republic tools onto their computers. After R2 had successfully began the download, the two clones returned to aid their Commander. When leaving the planet, Wolffe told Sinker and Boost they would leave the droids with Jedi General Adi Gallia, something Sinker was very pleased to hear.\nSinker continued to serve in the Wolfpack under General Plo Koon and Commander Wolffe during a mission to the moon of Oba Diah. In response to a distress signal originating from Jedi T-6 shuttle 775519, the Jedi Council dispatched Koon and the 104th Battalion to investigate. Sinker operated the scanners of a clone turbo tank and pinpointed the shuttle's location after receiving a faint signal in the midst of a heavy sandstorm. It was discovered that the shuttle was that of the late Jedi Master Sifo-Dyas.\nNearly twenty years after the end of the Clone Wars, Wolffe and former clone commando Gregor fought in the Liberation of Lothal from the Galactic Empire. During the conflict, Lothal's native loth-wolves joined the fight against Imperial forces. Observing the similarity between the wolves and the \"Wolfpack\" nickname for his squad in the 104th Battalion, Gregor commented that Wolffe had his Wolfpack back. Wolffe responded that they fought just like Sinker and his other men.\nSinker was known to have a sense of humor and cracked jokes even in the most dire circumstances. He also expressed some skill in mechanics when he helped rewire his escape pod after it had lost power due to the Malevolence's ion weapon. Sinker showed proficiency with a jetpack when he used one to scale the walls of a Separatist outpost on Felucia as well as when he used one on Kadavo. He was a capable pilot, flying an Aggressive ReConnaissance-170 starfighter on at least one occasion.\nSinker wore Phase I clone trooper armor while hunting the Malevolence and during the fighting on Felucia. By the time of the earthquakes on Aleen, he was equipped with Phase II clone trooper armor. Sinker stylized both types of his armor with Wolfpack symbols.\nSinker utilized a jetpack to scale vertical surfaces on several missions. Throughout the Clone Wars, Sinker used the DC-15A blaster carbine.\nSinker, like the rest of the clone troopers, was portrayed by Dee Bradley Baker in the animated TV series, Star Wars: The Clone Wars. Throughout the series, Sinker's character model changed three times.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sinker",
  "/wiki/Sinker/Legends",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_2",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Galactic_Republic",
  "/wiki/104th_Battalion",
  "/wiki/Clone_Sergeant",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_Master",
  "/wiki/Plo_Koon",
  "/wiki/Wolffe",
  "/wiki/Clone_trooper",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Planet",
  "/wiki/Battalion",
  "/wiki/Clone_Commander",
  "/wiki/Jedi_General",
  "/wiki/Jedi_High_Council",
  "/wiki/CT-4860",
  "/wiki/Clone_Corporal",
  "/wiki/Comet_(clone_trooper)",
  "/wiki/Nexus",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Wat_Tambor",
  "/wiki/Orkle",
  "/wiki/Rising_Malevolence",
  "/wiki/Superweapon",
  "/wiki/Malevolence",
  "/wiki/Triumphant",
  "/wiki/Republic_escape_pod",
  "/wiki/Commander",
  "/wiki/Cruiser",
  "/wiki/Ion_cannon",
  "/wiki/Escape_pod",
  "/wiki/B1-series_rocket_battle_droid",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/Sergeant",
  "/wiki/General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi_Commander",
  "/wiki/Ahsoka_Tano",
  "/wiki/Starship",
  "/wiki/Felucia",
  "/wiki/Trandoshan",
  "/wiki/Lo-Taren",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Aleen",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Adi_Gallia",
  "/wiki/Mission_to_Oba_Diah_(Clone_Wars)",
  "/wiki/Oba_Diah_moon",
  "/wiki/Oba_Diah",
  "/wiki/Distress_signal",
  "/wiki/Jedi_T-6_shuttle_775519",
  "/wiki/HAVw_A6_Juggernaut",
  "/wiki/Sandstorm",
  "/wiki/Sifo-Dyas",
  "/wiki/Standard_year",
  "/wiki/Clone_commando",
  "/wiki/Gregor",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Galactic_Empire",
  "/wiki/Loth-wolf",
  "/wiki/Jetpack",
  "/wiki/Kadavo",
  "/wiki/Aggressive_ReConnaissance-170_starfighter",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Padawan_Lost",
  "/wiki/Mercy_Mission_(episode)",
  "/wiki/Escape_from_Kadavo",
  "/wiki/The_Lost_One",
  "/wiki/Star_Wars_Rebels",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/Category:Images_of_Sinker",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_53",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/ARC-170_Starfighter_Expansion_Pack",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/LAAT/i_Gunship_Expansion_Pack",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/File:SinkerAttribution-TLO.png",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galactic_Civil_War",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/5_ABY",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/0_BBY",
  "/wiki/Wolves_and_a_Door",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/19_BBY"
 ]
}