{
 "name": "Sinrich",
 "display_name": "Sinrich",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cadomai Prime"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Snivvian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.74 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  }
 ],
 "content": "Sinrich was a male Snivvian bounty hunter who operated during the Clone Wars. He invented the holographic disguise matrix. Sinrich's inventions eventually caught the eye of the Sith Lord Count Dooku and the Phindian criminal mastermind Moralo Eval, who invited Sinrich to participate in a series of challenges at the Box on the planet Serenno.\nAt somepoint in his life, Sinrich became a bounty hunter, and became well known across the galaxy. He also created the holographic disguise matrix, becoming more famous in the process. In 20 BBY, during the Clone Wars, Sinrich was invited along some other fellow bounty hunters by the Sith Lord Count Dooku and the Phindian criminal mastermind Moralo Eval to participate in a series of challenges at the Box on the planet Serenno. Sinrich's inventions like the holographic disguise matrix were the main reason for which he caught Dooku's eye.\nCompeting against other bounty hunters in the potentially fatal challenges, the victors would receive the honor of kidnapping Supreme Chancellor Sheev Palpatine of the Galactic Republic. Sinrich did well the first challenge like the others and made it to the second challenge. Once there, the bounty hunters discovered that the room was full of electrified laser blade columns. After the deaths of Onca and Kiera Swan, Sinrich along the other bounty hunters decided to follow Rako Hardeen's and Cad Bane's way to make it out of the room alive. Unfortunately, during the way, the bounty hunter Embo choked Sinrich and took him off track, leaving him to climb up after a setback to his fate. Ultimately, Sinrich was killed by the obstacles impaling him and didn't make it into the third challenge.\nLater, a small-scale cloaking device used by the Noghri assassin Rukh, the Sinrich optical dephaser, shared its name with the Snivvian.\nSinrich was a master of deception although his snaggletoothed grin made him to appear friendly. He was very intelligent, as he was able to create the holographic disguise matrix, an advanced form of holographic projection that cloaked a user in a vivid projection recreating the visage of another person, allowing him to use it for his own personal and criminal purposes. Despite this, he did not possess the agility and skill needed in the Box, and was killed within its walls.\nSinrich was created for the TV series Star Wars: The Clone Wars, and appeared in the episode \"The Box\". Sinrich's body model was a repainted and modified model that was used for another Snivvian character who appeared previously in the episode \"Padawan Lost\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sinrich",
  "/wiki/Sinrich/Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Cadomai_Prime",
  "/wiki/20_BBY",
  "/wiki/Serenno",
  "/wiki/Snivvian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_Wars",
  "/wiki/Holographic_disguise_matrix",
  "/wiki/Eye",
  "/wiki/Sith_Lord",
  "/wiki/Phindian",
  "/wiki/Moralo_Eval",
  "/wiki/Box",
  "/wiki/Planet",
  "/wiki/The_galaxy",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Republic",
  "/wiki/Electrified_laser_blade",
  "/wiki/Death",
  "/wiki/Onca",
  "/wiki/Kiera_Swan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Cad_Bane",
  "/wiki/Embo",
  "/wiki/Cloaking_device",
  "/wiki/Noghri",
  "/wiki/Assassin",
  "/wiki/Rukh",
  "/wiki/Sinrich_optical_dephaser",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Box",
  "/wiki/Padawan_Lost",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Bane%27s_Story",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Category:Images_of_Sinrich",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Prisoners",
  "/wiki/Standard_year"
 ]
}