{
 "name": "Sint Yoru",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anzat"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Sint Yoru was a male Anzat assassin, who along with his wife Nakia Yoru, was employed by Black Sun Vigo Lun Rask.\nSint, Nakia, and the Blood Carver Ku Vrat, were tasked by Rask to kill both Cade Skywalker and Gunn Yage at the behest of Nieve Gromia, the Imperial Moff of the Arkanis sector. The bounty hunters found their targets in a speeder in the Jundland Wastes. They proceeded to fire on their targets but targets managed to escape into the desert under approaching sandstorm. When Sint asked Nakia about purposely missing her shots, she responded by telling Sint about her need to consume Skywalker's soup. Later they went to the wreckage of their prey's speeder to tell where they went and a fight broke out between Sint and Ku Vrat. Fight came to a draw and they went back to their ship to wait out the sandstorm. Nakia and Sint tracked Skywalker and Yage to Mos Eisley on Tatooine, and then followed their targets into the Dune Sea. The Anzati had found their prey asleep at the abandoned Lars homestead. Sint used the opportunity to take Cade's lightsaber, then prepared to consume Gunn Yages soup while Nakia was about to consume Skywalker's soup. However Skywalker awakened prematurely and kicked her then used the Force to hurl Nakia off of him. Sint tried to psychically assault Skywalker but was stopped by Skywalker's use of Force push then kicked to the ground. Sint recovered and brandished a lightsaber he obtained from a Jedi he hunted and killed and grazed Skywalker's armor with it. Skywalker used The Force to summon his lightsaber back from Sint, and killed him with one strike, as Sint was no match for his skill with lightsaber combat.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Sint_Yoru",
  "/wiki/137_ABY",
  "/wiki/Tatooine/Legends",
  "/wiki/Anzat_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Lun_Rask",
  "/wiki/Assassin/Legends",
  "/wiki/Nakia_Yoru",
  "/wiki/Vigo/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Blood_Carver",
  "/wiki/Ku_Vrat",
  "/wiki/Gunn_Yage",
  "/wiki/Nieve_Gromia",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Moff/Legends",
  "/wiki/Arkanis_sector/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Jundland_Wastes/Legends",
  "/wiki/Sandstorm/Legends",
  "/wiki/Soup_(Anzati)",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Lars_homestead",
  "/wiki/Kol_Skywalker%27s_lightsaber",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends#Force_push",
  "/wiki/Telekinesis/Legends#Force_pull",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Legacy_(2006)_37",
  "/wiki/Legacy_(2006)_38",
  "/wiki/Legacy_(2006)_39",
  "/wiki/Legacy_(2006)_40"
 ]
}