{
 "name": "Sinvatt Bovic",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Sinvatt Bovic was a wealthy human male collector who lived on Fytoun. By 22 BBY, he had a debt to the InterGalactic Banking Clan so vast that the bounty hunter Zam Wesell was sent after him; after she called in fellow hunter Jango Fett for assistance, she was able to detain him.\nSinvatt Bovic was a wealthy human male collector of relics who had a residence on the astronomical object of Fytoun. By 22 BBY, he owed a large debt to the InterGalactic Banking Clan, who hired the bounty hunter Zam Wesell to bring him in alive for a large bounty. Bovic had three Mabari warriors along with other humans and security droids guarding him, which Wesell determined was too much for her to handle alone, calling in a favor from famed bounty hunter Jango Fett to help her with the job.\nAfter the two narrowly escaped the Mabari guards and got past a Clawdite who had morphed to assume the form of Bovic, Wesell and Fett blasted through a wall in order to get to a hangar, where the collector was attempting to retreat via a speeder. As he struggled to get in the cockpit, Wesell sniped the controls and stunned her bounty, checking him to make sure he was not a changeling. Wesell and Fett then carried him out of the compound and into the Clawdite's speeder, the former promising to split the bounty as they had previously agreed.\nAs Zam Wesell had expected, Sinvatt Bovic did everything he could to protect his valued collection, adding enough security that the bounty hunter needed to call in backup.\nSinvatt Bovic was created for \"Galactic Tales: The Wesell Run,\" the first installment of the Galactic Tales series of short stories. The story was written by S.T. Bende and was published in the Star Wars Insider magazine's 209th issue on March 15, 2022.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Collector",
  "/wiki/Fytoun",
  "/wiki/22_BBY",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Bounty_hunter",
  "/wiki/Zam_Wesell",
  "/wiki/Hunting",
  "/wiki/Jango_Fett",
  "/wiki/Sinvatt_Bovic%27s_residence",
  "/wiki/Bounty",
  "/wiki/Mabari",
  "/wiki/Security_droid",
  "/wiki/Clawdite",
  "/wiki/Hangar",
  "/wiki/Speeder",
  "/wiki/Cockpit",
  "/wiki/Sniper",
  "/wiki/Stun",
  "/wiki/Changeling",
  "/wiki/Galactic_Tales:_The_Wesell_Run",
  "/wiki/Galactic_Tales",
  "/wiki/S.T._Bende",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/March_15",
  "/wiki/2022",
  "/wiki/Death",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Titan_Magazines"
 ]
}