{
 "name": "Sinya",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "33 BBY",
      "Deep Space Demolition and Removal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Sinya was Twi'lek bodyguard employed by the Black Sun crime syndicate. Although she was not a Force user, she did wield a pair of perpendicular-gripped, guard shotos with deep purple blades.\nAt the time of Darth Maul's killing of Black Sun's chain of command, Sinya was serving the Black Sun Vigo known as Darnada as his bodyguard. When Maul approached the Vigo with the premise that he wished to join the crime syndicate, Sinya asserted her skepticism that Maul was \"nothing special.\" Even as he decimated the room single-handedly, Sinya still mocked him, calling him a common assassin. Sinya noticed, only at the end, as Maul quickly overpowered her, and only then did she express fear and doubt about who  Maul was. The Sith beheaded her without a second glance, rendering her unable to defend her employer as Maul impaled him through the eye. Her pair of lightsabers were presumably destroyed along with the rest of the Black Sun station.\nSinya was a somewhat arrogant individual, as demonstrated when she taunted Darth Maul during their duel. She was also not easily impressed, as noted by Darnada. Despite these traits, she did show fear and doubt as Maul began to gain the upper hand in their duel, recognizing him as much more than a \"common assassin\" but not as a Sith, unlike fellow Black Sun bodyguard Mighella, who also recognized him as beyond an ordinary assassin but correctly deduced him to be a Sith Lord.\nAs a bodyguard for one of the vigos of Black Sun, Sinya was a force to be reckoned with. Despite not being Force-sensitive, she wielded a pair of guard shotos. She also managed to engage Darth Maul in combat and even hold her own against him before he decapitated her.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Deep_Space_Demolition_and_Removal",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Guard_shoto/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Darnada",
  "/wiki/Assassin/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Mighella",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Darth_Maul_(2000)_2",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}