{
 "name": "Sionver_Boll",
 "display_name": "Sionver Boll",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Protobranch"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bivall"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red and white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Sionver Boll was a female Bivall scientist who worked under the Galactic Republic during the Clone Wars. A brilliant inventor and engineer, Doctor Boll developed the electro-proton bomb, a superweapon that created an electromagnetic pulse that would disable electronic machinery such as battle droids, the main components of the Confederacy of Independent Systems army.\nBoll oversaw the first usage of her bomb during the pivotal Battle of Malastare. Despite its success, Boll's weapon had an unintended side effect. The blast created a massive sinkhole in Malastare's surface, awaking an ancient Zillo Beast, a native species long believed to be extinct. At Supreme Chancellor Palpatine's orders, it was transported to Coruscant for study under Boll's guidance. Though she had ethical objections to the decision, she complied with her orders to kill it. While attempting to do so, however, the Zillo Beast broke from its confinement and rampaged through the city. Working with Republic forces, Boll quickly created enough toxin to kill the creature, stopping its path of destruction.\nSionver Boll hailed from the agriworld Protobranch, the homeworld of the Bivall species. As a Bivall, Boll possessed a high intellect and was predisposed to a career in science. Boll would go on to become renowned as a brilliant scientist and the head of her own development laboratory. Boll lent the services of herself and her lab to the Galactic Republic during the Clone Wars, a pan-galactic conflict between the Republic and its splinter state, the Confederacy of Independent Systems. Boll and her lab designed and produced inventions useful to the Republic war effort and worked in conjunction with the Republic military. In this role, Boll created the electro-proton bomb, an explosive device that, when detonated, would create an initial shockwave followed by a sphere of ion energy. This electromagnetic pulse would disable all electronic and droid technology within its radius, thus making it useful against the Separatist armies, which largely consisted of battle droid forces.\nBy the time Doctor Boll and her lab had developed a prototype of the electro-proton bomb in 21 BBY, the Republic was locked in a lengthy and fierce battle with a massive Confederate armada on the planet Malastare. If the Republic lost Malastare to the Confederacy, it would cost them vital fuel resources necessary for maintaining their armed forces. Hoping to turn the tide of the battle, the head of the Republic, Supreme Chancellor Palpatine, authorized the use of Boll's weapon to win the battle swiftly. Boll traveled to Malastare with Republic forces to oversee her device's inaugural use. Though she promised it would work as intended, the superweapon was a point of controversy with the Jedi Generals in charge of the battle, Jedi Master Mace Windu and Jedi Knight Anakin Skywalker. Boll met with the Jedi Generals in their command center, the palace of Doge Nakha Urus, the leader of the Dug Council. They were joined by Chancellor Palpatine via hologram. Separatist forces were advancing on the plains outside the palace, and Republic troops created a front to keep them at bay.\nDoge Urus warned Palpatine, who hoped to ratify a treaty between the Dugs and the Republic, that he would not allow his people to become Separatist slaves. The Chancellor assured the Doge that Boll's weapon would end the Confederate threat to the planet. Boll concurred, adding that the Republic clone army and the Dug forces would be unharmed by the blast. She also stated that she had taken account of all probable outcomes to ensure her device's effectiveness. General Windu looked to Boll and interjected that he was more concerned about improbable outcomes. He told those gathered that there must have been other options besides using Boll's superweapon. Chancellor Palpatine disagreed and claimed that Boll's bomb was the only sure way to achieve victory in the arduous battle. Skywalker, looking out on the Separatist armies gathered across the distance, noted that they had begun their assault, and Republic and Confederate forces engaged.\nGeneral Skywalker contacted the Y-wing squadron handling Boll's prototype and ordered them to drop the bomb. Though it faced heavy fire, the Y-wing carrying the electro-proton bomb reached the drop zone and deployed it on the Separatist army. Boll watched the initial explosion and shockwave as it destroyed part of the droid army, then the subsequent electromagnetic pulse as it enveloped both Separatist and Republic forces, deactivating all electronic machinery. Skywalker warned that the ion pulse was approaching the palace, and Boll and the others braced for the impact. The pulse quickly passed through the palace, but while Boll and the others were unscathed, communication with Chancellor Palpatine was lost. When the dust settled, Boll's bomb had worked as she intended; the droid armies were disabled, and all Republic forces were unharmed.\nGeneral Skywalker congratulated Doctor Boll on her accomplishment, but moments later, a sinkhole appeared where the bomb had detonated. The sinkhole rapidly grew, taking Republic forces, Dug soldiers, tanks, and part of a fuel pipe system down into the crater. In the aftermath of this disaster, Republic and Dug forces began a cleanup, removing the disabled battle droids and initiating a rescue operation for troops reported missing after the sinkhole. Though it went smoothly at first, Doge Urus was unwilling to sign the treaty without the entire Dug Council present, and General Windu lost contact with the rescue party in the sinkhole. The Jedi and Doge Urus traveled to the crater, where Urus had gathered the Dug Council and General Windu could investigate the missing rescue party. While Windu managed to locate part of the rescue team, he discovered that Boll's weapon had another unintended side effect. The detonation of the electro-proton bomb had awoken a Zillo Beast at the bottom of the sinkhole. An ancient creature native to Malastare, the Zillo Beast was long thought extinct by the Dugs, and the live one unearthed by Boll's bomb further complicated the Republic and Dug Council's arrangements. Urus and the Dug Council wanted to kill it, which Windu vehemently opposed, leading Urus to refuse to sign the treaty until the beast was killed.\nBack in the command center atop the palace, Windu and Skywalker presented a hologram of the Zillo Beast to Doctor Boll and Chancellor Palpatine. Windu recommended transporting the creature off-planet as soon as possible, where the Republic could find a sanctuary world in the Outer Rim, where it could live undisturbed. When he learned that the Dugs wanted to kill it, however, Chancellor Palpatine advised the Jedi to do so in order to keep the treaty from being delayed once again. Windu again opposed this idea, and Boll agreed with him, stating to the Chancellor that, as Skywalker had reported, the Zillo Beast had scales virtually impenetrable by any of the Republic's weapons and that it would be in their best interest to study the creature. Boll stated that examining the beast could give the Republic new avenues for technological advancements, such as duplicating its scales to create impenetrable armor. Palpatine was intrigued by this concept, and Skywalker proposed that a stun weapon could possibly penetrate the gaps in the Zillo Beast's scales, leaving it unconscious but visibly dead, which would satisfy the complications in getting the treaty signed. Boll backed Skywalker's hypothesis, which convinced the Chancellor to agree with this course of action.\nTo Doge Urus's delight, it seemed like Republic forces were preparing to kill the creature using several RX-200 Falchion-class assault tanks, a model of tank with a mounted ion cannon that would stun the Zillo Beast. However, Urus directed his forces to kill the creature with their own technology as well, which backfired when his attacks only enraged it. The Zillo Beast rose out of the sinkhole and attacked the Republic and Dug forces outside the crater, resulting in heavy damage. The ion cannons began firing at the beast, slowly bringing it to sleep, but not before it destroyed several tanks. With the Zillo Beast no longer a threat, Doge Urus relented his crusade to have it killed and agreed to sign Chancellor Palpatine's treaty. Boll was present during the signing and, afterward, joined the Jedi and the Chancellor to discuss the future of the Zillo Beast. To General Windu's dismay, Palpatine said that the Republic's scientific community wanted to study the creature in a controlled environment on Coruscant, the capital of the Republic, and instructed Boll and the Jedi to transport the sedated Zillo Beast to the capital once they left Malastare.\nHeeding Chancellor Palpatine's orders, Boll accompanied the Jedi as they transported the Zillo Beast to the Republic navy staging yards, where the Republic Science and Technical Center was located. Boll was placed in charge of the beast as it was transferred from an Acclamator-class assault ship to the research center. Boll walked alongside the CLL-M2 binary loadlifter droids towing the platform carrying the creature during the cautious process. As the beast was hauled into the massive research center, Boll met with Chancellor Palpatine, Galactic Senate Vice Chair Mas Amedda, as well as Windu and Skywalker. Windu informed Boll that the Zillo Beast was now under her control and told her that he trusted she would handle it with care. Boll assured him that the beast was a priceless resource and would be well-treated. The Jedi bade Dr. Boll farewell, leaving her with the Chancellor and Vice Chair.\nOnce the Zillo Beast was secured and restrained inside the research center, Boll began studying the creature from a floating pod alongside a team of droids, with a detachment of clone troopers on watch. In one procedure, Boll had one of her loadlifter droids lift one of the beast's outer scales so she could get a blood sample from the flesh underneath, but this caused it pain and discomfort. Seeing this, Boll ordered her droids to stop once the sample was collected. She was joined shortly after by Chancellor Palpatine and Vice Chair Amedda, who had come to check on her progress in their own pod. Boll reported that the Zillo Beast's scales were remarkably strong and light, and that, if she could examine their composition, she might find a way to synthesize them and develop reinforced armor for the Republic Army and Navy. When Palpatine asked what was stopping her, Boll explained that she would have to remove them, which would not only be very difficult but would cause the creature immense pain.\nChancellor Palpatine questioned whether or not it would be more efficient for Boll to simply kill the Zillo Beast, a suggestion that shocked the doctor. Amedda asked if he was sure about such a decision, and Boll immediately protested the idea. She told the Chancellor that the beast was possibly the last of its kind and hypothesized that it may have been intelligent. Palpatine dismissed the notion that it was intelligent and referred to it as \"just an animal.\" The beast slightly turned its head and growled, which Boll remarked meant it didn't like the Chancellor's comment. Palpatine looked to Boll and told her that he appreciated her high moral standing, which he said was in short supply. However, he argued that, with increasing deaths every passing day, it was their moral duty to hasten the study of the creature to unlock its secrets and prevent further casualties. Though at first despondent, Boll informed the Chancellor that she served at his pleasure but did voice her concerns on how to proceed with removing the Zillo Beast's scales, given its indestructibility. Palpatine calmly told Boll that nothing was indestructible.\nThe Chancellor asked Boll whether or not there was something in the Malastare fuel that had affected the beast. Boll confirmed that the fuel had weakened the creature and began to object once again, but Palpatine cut her off and suggested that she start there. The Chancellor waved to his guards to bring his pod back to the ground, then coldly turned to Boll and told her that she had to find a way to kill the Zillo Beast, or he would replace her with someone who could. Boll silently nodded as Palpatine left then returned to studying the creature, which roared at the Chancellor as he left the building.\nWith her new assignment, Boll got to work converting the Malastarian fuel into a toxin gas that she believed would be strong enough to kill the Zillo Beast. Chancellor Palpatine, who was facing pressure from members of the Senate and the Jedi Order to release the creature, contacted Boll as she was preparing to administer the toxin to the beast. Palpatine asked if she had progress to report to him, and Boll told him that she had successfully managed to convert the Malastare fuel into poison gas. She asked if the Chancellor still wished to proceed with killing the Zillo Beast. Although he wished there was an alternative, Palpatine instructed Boll to continue with the procedure as planned. Boll nodded as his transmission ended, and a medical droid came to her pod to pick up the toxic gas canisters. Boll loaded a canister and despondently watched as the droid floated up to the Zillo Beast's head.\nDoctor Boll quietly spoke to the beast, apologizing for what she was about to do and telling it that it would be over soon. Boll ordered the droid to begin the procedure, and it started spraying the poison gas across the Zillo Beast's head and into its nostrils. Boll looked to her datapad and noted that the creature's vital signs were dropping, but as the droid finished spraying it with gas, the aggravated beast raised one of its arms and slammed into a walkway, destroying it and knocking a clone trooper over the side. Boll was shocked when the beast pulled its hands free from the electric restraints. She looked on in horror as the beast broke free from its restraints and destroyed one of her droids as well as the complex surrounding it. Boll attempted to fly her pod out of the creature's path as it began heading towards the entrance to the research center, but its tail slammed into her pod and caused it to crash to the ground.\nAs the beast destroyed the research center entrance and several AT-TE walkers, Boll recovered from her crash and joined clone troopers who were evacuating. The injured Boll walked out the center and saw the destruction the creature had caused outside. Boll heard the beast's roar in the distance and saw that it had already escaped the military base and had begun rampaging in the city streets. Boll immediately contacted Chancellor Palpatine, who asked her if she was successful. Boll told him that they had a problem, and the Chancellor looked outside his office to see the beast's path of destruction on the horizon, causing immense damage to the city. With Coruscant endangered, Boll decided that she needed to convert more of the Malastare fuel into enough toxin to kill the Zillo Beast right away. She informed Palpatine that she needed time to do so, and he ordered her to hurry. Meanwhile, Republic forces began engaging the beast, to no avail.\nWhile the Zillo Beast directed its path towards the Galactic Senate Building, which went under lockdown, Boll developed more gas as the Republic military began to rollout RX-2000 tanks to combat the beast. Doctor Boll notified Palpatine that she believed she had converted the fuel into enough toxin to kill the creature. Palpatine told her that his guards would be with her shortly and that she was to hand the gas over to them immediately. As their transmission ended, the Chancellor's escape craft was caught midair by the Zillo Beast, which had reached and scaled the Senate building. At the research facility, a military escort arrived to take Boll to an improvised staging ground near the Senate. Her toxin, now in the form of projectile bombs, was loaded into the cannons of several LAAT/i gunships, but Jedi Grand Master Yoda ordered them to hold their fire until the Chancellor was freed. Once the Jedi were able to secure the Chancellor and bring him away from the monster, the order was given to deploy Boll's gas bombs. Using flares to distract the Zillo Beast, the Republic gunships fired the bombs into its mouth, which showed an immediate effect on it. Rapidly losing its mobility as it died, the beast fell from the Senate building and onto the ground below, where it finally perished.\nThe following day, the Zillo Beast's body was loaded onto a platform and led away from the Senate building before being loaded onto a Republic cruiser. Boll approached Chancellor Palpatine as he boarded a gunship with his security, and he handed her a datapad with a new assignment. To Boll's horror, Palpatine's new orders were for her to clone the beast, and she watched as his gunship took off.\nIn the years following the Clone Wars, which ended with the restructuring of the Republic into the Galactic Empire with Palpatine as the first Galactic Emperor, Boll's electro-proton bomb would have a potentially dangerous lineage. According to rumors, the Empire had developed a new superweapon called the Electro-Proton Bomb/Defoliator, which combined Doctor Boll's electro-proton bomb and the defoliator, a weapon created by Confederate General Lok Durd during the early Clone Wars that shredded organic matter. The bomb was allegedly under development by Director Orson Callan Krennic of the Imperial Military Department of Advanced Weapons Research, whose lab employed several ex-Separatists.\nRumors of this superweapon reached the highest levels of the Alliance to Restore the Republic, a resistance movement opposed to Emperor Palpatine's tyrannical reign. Major Capin Harinar of Rebel Intelligence reported on the Electro-Proton Bomb/Defoliator and its progenitors to General Airen Cracken, who, in turn, sent an intel summary on the possible weapon to Commander Mon Mothma, the leader of the Rebel Alliance. Though some in the rebellion dismissed the rumors as \"spacer's tales,\" Cracken believed that the possibility of the superweapon's existence merited concern. In his report, Harinar stated that combining the electro-proton bomb and the defoliator was child's play and remarked that Boll's weapon, which was once hailed for its inability to harm organic beings, was just another half of the same chip as the defoliator.\nDecades after the Rebel Alliance defeated the Empire in the Galactic Civil War and established the New Republic, the classified reports about the Electro-Proton Bomb/Defoliator were unearthed in 34 ABY and fell into the hands of the Resistance, a militia created to combat the First Order, a neo-Imperial junta. Reading over Harinar's report on the bomb, General Caluan Ematt placed a handwritten note on the file to run the information by Resistance intel, believing that the First Order may have restarted some Imperial superweapon projects.\nA female Bivall standing at 1.73 meters, Boll had gold eyes and red-and-white colored skin. Boll had a sharp intellect and was renowned for her brilliance in the scientific field. Though her work with the Republic largely focused on weapons development, Boll was an empathetic and moral person and was lauded for her principled stances. She possessed great empathy for the Zillo Beast, both as a specimen and a possibly-sentient being. However, Boll was willing to disregard her personal moral standing on the ethics of studying the beast, and as a result, she learned that there was a dark side to pursuing such dangerous knowledge. Her experiments were not without fault either, as she miscalculated the amount of toxic gas required to kill the monster successfully.\nThough subservient to Chancellor Palpatine, Boll was unafraid to challenge him or speak to him with dry sarcasm. She protested the Chancellor's proposal to have the Zillo Beast killed, but when her career future was called into question by his threats to remove her from her position, Boll quickly fell into line and planned to kill the beast as he had ordered. Although she proceeded with her orders to terminate it, she tried to comfort the beast and ease it before attempting to do so. Despite her mistakes, the doctor realized the dangers of her practice following the Zillo Beast's raid on Coruscant and was shocked when given new orders to clone the creature.\nAs a Bivall, Sionver Boll had a naturally sharp intellect and a predisposition to scientific study. In her line of work, Dr. Boll utilized her expertise in various fields with her lab. As a weapons developer for the Galactic Republic, she had a history in military research and engineering, talents which she lent to the creation of the electro-proton bomb and other inventions for use in the Clone Wars. In addition to these abilities, Boll had expertise in biology and chemistry, skills she displayed when studying the Zillo Beast and its scales and when converting Malastarian fuel into a potent toxin strong enough to kill the creature, respectively. She also had some knowledge of cloning and cloning technology.\nAs the head of her own laboratory, Doctor Boll had access to several droid personnel under her command. She had a number of modified CLL-M2 binary loadlifters, labor droids manufactured by Cybot Galactica, which provided heavy work while she studied the Zillo Beast. For lighter work, Boll was aided by a much smaller model of science droid, which had four limbs and various attachments useful for the examination of the beast. While studying the Zillo Beast, Boll was granted access to the vast Republic Science and Technical Center, where she used repulsorcraft to closely survey the massive creature.\nSionver Boll first appeared in \"The Zillo Beast,\" the eighteenth episode of the second season of the animated television series Star Wars: The Clone Wars. Directed by Giancarlo Volpe and written by Craig Titley, the episode first aired on April 9, 2010, in the US. Boll was again featured in the following episode, \"The Zillo Beast Strikes Back.\" In both appearances, she was voiced by actress Cara Pifko.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sionver_Boll",
  "/wiki/Sionver_Boll/Legends",
  "/wiki/Protobranch",
  "/wiki/Bivall",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Scientist",
  "/wiki/Clone_Wars",
  "/wiki/Engineer",
  "/wiki/Doctor",
  "/wiki/Electro-proton_bomb",
  "/wiki/Battle_droid",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Battle_of_Malastare",
  "/wiki/Zillo_Beast",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Coruscant",
  "/wiki/Zillo_Beast_incident",
  "/wiki/Agriworld",
  "/wiki/Homeworld",
  "/wiki/Laboratory",
  "/wiki/Republic_military",
  "/wiki/Bomb",
  "/wiki/Electromagnetic_pulse",
  "/wiki/Droid",
  "/wiki/21_BBY",
  "/wiki/Malastare",
  "/wiki/Malastarian_fuel",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_General",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Doge",
  "/wiki/Nakha_Urus",
  "/wiki/Dug_Council",
  "/wiki/Hologram",
  "/wiki/Treaty_of_Malastare",
  "/wiki/Dug",
  "/wiki/Clone_trooper",
  "/wiki/BTL-B_Y-wing_starfighter/bomber",
  "/wiki/Outer_Rim_Territories",
  "/wiki/RX-200_Falchion-class_assault_tank",
  "/wiki/Ion_cannon",
  "/wiki/Republic_Science_and_Technical_Center",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/CLL-M2_binary_loadlifter",
  "/wiki/Galactic_Senate",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Blood",
  "/wiki/Republic_Navy",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Gas_bomb",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Emperor",
  "/wiki/Electro-Proton_Bomb/Defoliator",
  "/wiki/Defoliator",
  "/wiki/Lok_Durd",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Imperial_Military_Department_of_Advanced_Weapons_Research",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Capin_Harinar",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Airen_Cracken",
  "/wiki/Commander",
  "/wiki/Mon_Mothma",
  "/wiki/Galactic_Civil_War",
  "/wiki/New_Republic",
  "/wiki/The_Rebel_Files",
  "/wiki/Excavation_on_Durkteel",
  "/wiki/34_ABY",
  "/wiki/Resistance",
  "/wiki/First_Order",
  "/wiki/Caluan_Ematt",
  "/wiki/Eye",
  "/wiki/Unidentified_science_droid_model",
  "/wiki/The_Zillo_Beast",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Giancarlo_Volpe",
  "/wiki/Craig_Titley",
  "/wiki/April_9",
  "/wiki/2010",
  "/wiki/The_Zillo_Beast_Strikes_Back",
  "/wiki/Cara_Pifko",
  "/wiki/Category:Images_of_Sionver_Boll",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_6",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Defenders_of_Peace",
  "/wiki/In-universe",
  "/wiki/Standard_day",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_54",
  "/wiki/Droid_Directory"
 ]
}