{
 "name": "Sirad Far",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Sirad Far was a Human male slicer who lived on the planet Tatooine during the time of the Galactic Civil War. After the Hutt crime lord Jabba Desilijic Tiure helped Sirad by eliminating his rivals, the skilled slicer became indebted to his criminal empire. Under Jabba's employ, Sirad assumed responsibility for a variety of tasks, including reformatting a transponder to function on Jabba's personal starship, and decoding a ledger that contained sensitive information regarding a rival gang led by Lady Valarian.\nDuring the time following the Battle of Yavin in 0 BBY, a spacer seeking employ with Jabba Desilijic Tiure's criminal empire carried out a number of odd jobs for Ree-Yees, a Gran member of Jabba's court on the planet Tatooine. After losing his last slicer to his pet rancor, the Hutt crime lord had been searching for a replacement. One suitable prospect was a Human male criminal named Sirad Far. According to Jabba's Twi'lek majordomo Bib Fortuna, Sirad Far was one of the best slicers on Tatooine. Jabba wanted Sirad in his pocket, but to accomplish that, Jabba needed to help eliminate the slicer's rivals. Ree-Yees ultimately tasked this responsibility to the spacer attempting to curry favor with Jabba. In exchange for a credit reward, the spacer embarked to eliminate Raf Daris, a rival of Sirad's who worked as a thief for the Valarian Syndicate, an organization led by the Whiphid crime boss known as Lady Valarian. The Valarian's also happened to be one of the greatest threats to Jabba's power on Tatooine. Despite being ambushed by three additional Valarian thieves attempting to defend Raf Daris, the spacer succeeded in killing all four of the rival gang members. Accomplishing this goal earned Sirad's loyalty, and indebted him to Jabba's criminal empire.\nAfter a vessel crashed in the dunes near Jabba's Palace, Ree-Yees tasked the spacer who had helped him before with recovering its transponder. At first, Ree-Yees did not care to reveal why Jabba wanted the transponder. Nevertheless, as soon as it was recovered, he tasked the spacer, who he derogatively referred to as a \"worrt\", with delivering it to Sirad Far. Ree-Yees eventually revealed that the ship that crashed near the palace met the same specifications as Jabba's own personal starship. Ree-Yees surmised that Jabba wanted the transponder hooked up on his ship, so that he could transmit a false identity whenever he wanted. However, to accomplish that, Ree-Yees required prompt delivery of the transponder package to Sirad. Despite being ambushed by thugs along the way, the spacer managed to rendezvous with Sirad at a scheduled meeting area near Jabba's Palace. Sirad Far offered his assurances that the transponder would meet Jabba's expectations.\nRee-Yees commended the spacer for the successful completion of the \"Sirad Far deal,\" as he called it. For their part in the deal, the spacer was awarded a piece of Mabari armorweave. However, this would not be the last time Sirad Far found himself involved with Jabba's criminal enterprise. Another member of Jabba's court, a Chevin by the name of Ephant Mon, found himself in possession of a ledger stolen from a courier working for Jabba's rival, Lady Valarian. The ledger contained financial information from Valarian's compound, which Ephant Mon believed could be used to ruin her. Unfortunately for Jabba and his ilk however, the ledger was written in code using an obscure form of a language known as Old Drall. No one in Jabba's Palace knew how to read it, but Sirad Far was on Jabba's payroll, and had the expertise needed to read the ledger for the Hutt crime lord. Because Jabba had been very helpful to Sirad in eliminating some of his problematic rivals, he was more than willing to return the favor. However, delivering the ledger to Sirad was a dangerous prospect. According to Jabba's spies, Lady Valarian was enraged by its theft. To halt any attempt to decode the ledger's information, a Valarian assassin was dispatched to kill the spacer. However, this last ditch effort was an exercise in futility. The spacer managed to kill the Valarian gang member, before locating Sirad Far to hand over the ledger. Fortunately for Jabba, Sirad's skills lived up to his expectations, and he made quick work of decoding the sensitive information. The pleased Ephant Mon gifted the spacer responsible for delivering the ledger one of two paintings, including either an advertisement depicting the Pa'lowick Sy Snootles, or a Portrait of a Twi'lek Female.\nSirad Far had fair skin, brown eyes, and gray colored hair with brown eyebrows. He possessed at least some skill in unarmed combat. Highly intelligent, Bib Fortuna considered him to be one of the best slicers on the entire planet of Tatooine. Aside from his fluency in Galactic Basic Standard, Sirad Far also had an understanding of computer code and a working knowledge of an obscure form of Old Drall, a language which the Valarian gang had used in their secretive ledger. Sirad had a chipper demeanor, but he could at times be ruthless. He relied on Jabba to eliminate his troublesome rivals, a deed for which he remained greatly thankful. Owing a debt to Jabba thereafter, Sirad remained on Jabba's payroll, and was readily willing to aid the crime lord whenever the need arose.\nSirad Far was unarmed. During his time on Tatooine, working at the behest of Jabba the Hutt, Sirad wore a white short sleeve jacket over top a red casual shirt. Additional clothing included a pair of beige pocketed shorts, and a pair of beige casual shoes.\nSirad Far was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. He was included in three quests of the original Jabba's Theme Park in Jabba's Palace on Tatooine. In the first quest given by Ree-Yees, players had to kill a rival of Sirad's named Raf Daris. Completing that quest would earn the player 250 credits. In the third quest given by Ree-Yees, players had to deliver a broken instrument calibrator to Sirad Far. Completing that quest would earn the player 50 faction points in favor of Jabba, and a piece of Mabari Armorweave, including either a chest plate, helmet, or pants. In the third quest for Ephant Mon, players had to yet again meet up with Sirad Far, this time to deliver a ledger. Completing that quest would earn the player 75 faction points in favor of Jabba, and one of two different paintings, including an advertisement depicting Sy Snootles, or a Portrait of a Twi'lek Female. Although the player could choose not to do the quests associated with Jabba's Theme Park, this article assumes 100% game completion.\nSirad Far is listed in several reference guides for Star Wars Galaxies, including the Star Wars Galaxies: An Empire Divided: Prima's Official Strategy Guide , the Star Wars Galaxies: The Total Experience: Prima Official Game Guide , and the Star Wars Galaxies: The Complete Guide: Prima Official Game Guide . In all of these reference guides, he is listed as a level 20 NPC found on Tatooine, belonging to the Jabba social group. The Total Experience guide further lists Sirad as someone with melee combat skills, while the Complete Guide more specifically states that he was unarmed. Following the release of Publish 25's New Game Enhancements on November 15, 2005, Jabba's Theme Park was revamped to become a part of the expansive Legacy Quest series. Sirad Far was not featured in the revamped version of the theme park, effectively removing him from the game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Slicer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hyperspace_transponder",
  "/wiki/Starship/Legends",
  "/wiki/Valarian_Syndicate",
  "/wiki/Lord/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Canon",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Ree-Yees/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Jabba%27s_rancor",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Majordomo/Legends",
  "/wiki/Bib_Fortuna/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Raf_Daris",
  "/wiki/Whiphid/Legends",
  "/wiki/Death/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Worrt/Legends",
  "/wiki/Mabari/Legends",
  "/wiki/Armorweave/Legends",
  "/wiki/Chevin/Legends",
  "/wiki/Ephant_Mon/Legends",
  "/wiki/Courier/Legends",
  "/wiki/Lucky_Despot",
  "/wiki/Language/Legends",
  "/wiki/Old_Drall",
  "/wiki/Spy/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Painting/Legends",
  "/wiki/Advertisement",
  "/wiki/Pa%27lowick/Legends",
  "/wiki/Sy_Snootles/Legends",
  "/wiki/Portrait_of_a_Twi%27lek_Female",
  "/wiki/Eye/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Jacket/Legends",
  "/wiki/Shirt",
  "/wiki/Clothing/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Armor/Legends",
  "/wiki/Helmet/Legends",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/November_15"
 ]
}