{
 "name": "Sira Folsomn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "Acquisitor",
      "Tagge Space"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tagge Corporation",
      "Division H14",
      "Division H14",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Sira Folsomn was a humanoid female who served as the Assistant Packaging and Fulfillment Manager of the Tagge Corporation's Division H14 during the reign of the Galactic Empire. Folsomn worked for the Tagge Corporation for seven years, and on two occasions requested promotion, though these were denied. Eventually Folsomn came to believe that despite all she had given to the company, she was not given anything in return and she was approached by the resurgent criminal syndicate Crimson Dawn with becoming a spy for them within the Tagge Corporation, which she accepted. Eventually Folsomn's employment by Crimson Dawn was discovered, and she was brought before Lapin, the secretary to the company's leader, Lady Domina Tagge. Lapin read out the spy's charges: unauthorized personal use of company resources for personal communications, theft of company intellctual property, and espionage, before they asked how Folsomn pleaded. Folsomn responded that she could not be convicted of anything as she had not been brought before a court, to which Lapin replied that it was just a performance review.\nLapin then informed Folsomn that the company had carried out its own investigations into the matter, which had brought up multiple offenses which could have Folsomn's contract terminated, with one such offense being her current employment by Crimson Dawn. At this point Domina Tagge entered and stated Folsomn's employment with the Dawn was a violation of the company's noncompete clause. Tagge then stated that she wanted Folsomn to give her the names of her handler and all of her contacts, and added that if she cooperated she would be turned over to Imperial justice instead of having her family bankrupted for generations with contract-breach fees. Folsomn then vented her anger at the company to Tagge, pulled out a knife and attempted to assassinate Tagge, declaring her belief that Crimson Dawn cared for her unlike the Tagge Corporation. The spy's attempt was quickly thwarted by Tagge, who grabbed hold of the knife, and informed Folsomn that if Crimson Dawn cared for her, they wouldn't have sent her to kill her, before she stabbed the spy in the back as she led on a table, killing her.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Acquisitor",
  "/wiki/Tagge_Space",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Tagge_Corporation",
  "/wiki/Spy",
  "/wiki/Division_H14",
  "/wiki/Crimson_Dawn",
  "/wiki/Assistant_Packaging_and_Fulfillment_Manager",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_year",
  "/wiki/Lapin",
  "/wiki/Secretary",
  "/wiki/Lord",
  "/wiki/Domina_Tagge",
  "/wiki/Thief",
  "/wiki/Knife",
  "/wiki/Assassin",
  "/wiki/Death",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Sira_Folsomn",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Boushh_1"
 ]
}