{
 "name": "Siro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Shamunaar",
      "Both system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Defense Fleet",
      "Galactic Alliance Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Siro was a Gotal who served the Galactic Alliance Defense Fleet aboard the frigate Shamunaar in 40 ABY. In that year, the Shamunaar was visited by Galactic Alliance Admiral Matric Klauskin, who was being manipulated by the Sith Lady Lumiya. Klauskin brought the frigate's captain, Biurk, to the auxiliary bridge and placed Siro in charge of the main bridge. He then murdered Biurk and opened all of the Shamunaar's external hatches. Exposed to the vacuum of outer space, Siro and the rest of the crew were killed.\nSiro was a Gotal who served as a lieutenant aboard the Shamunaar, a frigate that belonged to the Galactic Alliance Defense Fleet. In 40 ABY, the Shamunaar was stationed in the Both system in order to prevent Bothan forces from attacking a Galactic Alliance task force that had blockaded the Corellian system. The Corellians were revolting against the Galactic Alliance, and the Bothans had pledged their support to the insurrection.\nWhile the Shamunaar waited in the Both system, Galactic Alliance Admiral Matric Klauskin arrived on the ship. Unbeknownst to the crew, he was being manipulated by the Sith Lady Lumiya, who had been fueling the war from its onset and had convinced the Admiral to betray the Galactic Alliance. Klauskin ordered the Shamunaar's captain, Biurk, to run a simulation involving a Bothan fleet attacking the Shamunaar, and the Captain placed Siro in control of the bridge as he and Klauskin left to run the simulation from the ship's auxiliary bridge. Klauskin promptly killed Biurk and contacted Siro, informing the Gotal that the frigate's external communications had been disabled. Siro indicated receipt of the message, and the Admiral proceeded to slice into the ship's main computer and open every external hatch, exposing Siro and the rest of the crew to outer space and suffocating them. Klauskin sealed the auxiliary bridge and survived, however; he then turned the Shamunaar over to the Bothans.\nSiro was a tall Gotal who served the Galactic Alliance Defense Fleet and unhesitatingly accepted an order given by Matric Klauskin, a superior officer.\nSiro was created by author Aaron Allston for his 2007 novel Legacy of the Force: Exile. Siro appears briefly in the novel and dies shortly after being introduced.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:AgriCorps",
  "/wiki/Wookieepedia:AC/Siro",
  "/wiki/40_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Shamunaar_(frigate)",
  "/wiki/Both_system",
  "/wiki/Gotal/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Defense_Fleet",
  "/wiki/Lieutenant/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Matric_Klauskin",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Lumiya",
  "/wiki/Captain/Legends",
  "/wiki/Biurk",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Death/Legends",
  "/wiki/Airlock/Legends",
  "/wiki/Vacuum/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Blockade_of_Corellia",
  "/wiki/Corellian_system",
  "/wiki/Corellian/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Aaron_Allston",
  "/wiki/2007",
  "/wiki/Legacy_of_the_Force:_Exile"
 ]
}