{
 "name": "Sirrik Olyeg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chagri"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Soon after c. 517 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chagrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bartyn Gourmet Delicacies",
      "Sailor's Union"
     ]
    }
   ]
  }
 ],
 "content": "Sirrik Olyeg was a Chagrian female fisherperson, captain of a trawler for Bartyn Gourmet Delicacies in Lamaredd and later, when working conditions became unbearable, the first syndical leader in the planet, founder of the Sailor's Union.\nSirrik Olyeg was a Chagrian woman. She was one of the First-Wavers, the original settlers lured with false words to Bartyn's Landing, a new coastal town in Lamaredd, around five hundred years before the Battle of Naboo. Once there, the Chagrian, Iskalonian, Gungan, Mon Calamari and Quarren settlers became indentured servants, or slaves, to the mayor, Hugo Bartyn, and forced to work either in the food processing plant or in trawlers.\nOlyeg had a family. All of them except for her died in a random attack performed by a swoop gang made of Quarrens. She then turned to work and excelled in fishing.\nAlthough Bartyn was a speciesist, he had to admit that his fishermen were providing him with a good profit through his company of seafood Bartyn Gourmet Delicacies. As such, Bartyn allowed the sailors much more freedom and commodities than to the plant workers, who commonly died of accidents or of inter-species violence. C. 517 BBY, seventeen of the trawlers were under alien captains — albeit only unofficially. Olyeg, by then an elderly person, was one of these captains. These alien captains created an informal boat-to-boat communication network for security purposes.\nUnderstanding that the conditions in Bartyn's Landing were unacceptable, Olyeg was the first to use the network subversively, talking about a rebellion against Bartyn — an idea that was accepted by other aliens and even some Humans. Knowing that Bartyn would have people monitoring the conversations, Olyeg used metaphors about the oceans that tricked these people. She planned a sudden work stoppage at a certain date.\nWhen the date came, the boats disappeared in the open sea, giving no reason for it. Should a boat sink, then the technology would allow Bartyn to know. As the planet was mostly ocean, Bartyn could not assign his then-scarce resources to look for the missing trawlers, but neither could he afford to ignore the situation: He had pending orders from the Hutts. Rumors grew in Bartyn's Landing, until the truth was discovered. As soon as it was known, the workers in the plant joined the strike, not yielding to Bartyn's threats.\nKnowing that Bartyn was desperate, Olyeg gave her movement a name, the Sailor's Union and became officially the \"first chair\" of it. She then asked Bartyn for a face-to-face meeting to negotiate. Bartyn made several concessions to Olyeg, improving the life of the aliens in several ways: The overcrowded living area of The Ring was increased, aliens could settle in leased farms around the Landing, and Bartyn ceded the second biggest continent of the planet, Little Mon Cal, as an alien homeland. Bartyn also obtain a profit from this negotiation and his profits increased.\nThe Sailor's Union became a powerful organization in Lamaredd, thriving during the next five centuries. However, Bartyn ordered his people to murder Olyeg — although he admitted that the situation had been so fruitful for him that he almost regretted doing so.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Champala/Legends",
  "/wiki/517_BBY",
  "/wiki/Chagrian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bartyn_Gourmet_Delicacies",
  "/wiki/Sailor%27s_Union",
  "/wiki/222_fishing_trawler",
  "/wiki/Lamaredd/Legends",
  "/wiki/First-Wavers",
  "/wiki/Bartyn%27s_Landing",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Iskalonian",
  "/wiki/Gungan/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Hugo_Bartyn",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Speciesism",
  "/wiki/Hutt/Legends",
  "/wiki/Little_Mon_Cal",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Bartyn%27s_Landing_(article)",
  "/wiki/Star_Wars_Gamer_7"
 ]
}