{
 "name": "Sirro_Argonne",
 "display_name": "Sirro Argonne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY Eadu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Ministry of Science",
      "Ministry of Science",
      "Galactic Empire",
      "Kyber crystal research team",
      "Kyber crystal research team"
     ]
    }
   ]
  }
 ],
 "content": "Sirro Argonne was a human male scientist who served in the Galactic Republic's Ministry of Science before becoming an operations specialist in the Galactic Empire's Tarkin Initiative and being assigned to the planet Eadu. He was executed by death troopers under the command of Director Orson Krennic after a message was sent to the rebellious Partisans by Argonne's colleague Galen Erso.\nSirro Argonne was a scientist who served as a member of the Galactic Republic's Ministry of Science during the final decades of the Republic's rule. After the Republic was replaced by the Galactic Empire, he became a part of the Tarkin Initiative which was responsible for the creation of the Death Star superweapon. Argonne was assigned as operations specialist to a group of five other scientists led by Galen Erso, whom were tasked with finding out how to fuse the kyber crystals used by the Death Star's superlaser into larger forms and how to create and redirect a controlled chain reaction of the crystals.\nThe group were based in a secret laboratory on the planet Eadu, where Argonne was responsible for administering the facility and seeing to the personal and professional needs of the other scientists based there. The team remained in seclusion on the planet for nearly twenty years, but by 0 BBY they had successfully completed their given tasks, allowing the Death Star to be equipped with a functional weapon. After the weapon was complete, Erso secretly sent a message to the rebellious Partisans' leader Saw Gerrera on the moon Jedha, asking him to bring information of a structural weakness he had built into the Death Star to the Alliance to Restore the Republic.\nOnce Director Orson Krennic of the Empire's Imperial Military Department of Advanced Weapons Research division became aware that information had escaped from the laboratory, he personally traveled to Eadu to find the source of the betrayal. Upon his arrival at the laboratory he had Erso gather his team on the facility's landing pad where he demanded to know who had sent the message. When neither Argonne or his colleagues stepped forward, Krennic declared that he would assume it had been a group effort and prepared to have his personal cohort of death troopers execute them. Unable to see his innocent colleagues slaughtered for his crime, Erso stepped forward and admitted his guilt, but despite this, Krennic still ordered his men to fire, killing Argonne and the others where they stood. Erso was killed shortly after when the Alliance's Blue Squadron bombed the laboratory, forcing Krennic to flee.\nArogonne was a human male scientific genius with fair skin and hair that had turned gray by the time of his death in 0 BBY.\nWhile on Eadu, Argonne wore antiseptic coveralls to prevent lab contamination and carried a pair of code cylinders that granted him access to the high security laboratories. Argonne's coveralls were marked with the insignia of both the Empire and the Tarkin Initiative and bore blue sections across the neck and shoulders that changed color as a warning when revealed to high levels of radiation. The outfit's boots were grounded to prevent potentially dangerous static discharges occurring in the labs.\nSirro Argonne first appeared in the 2016 Anthology film, Rogue One: A Star Wars Story, in which he was portrayed by Richard Franklin. Though the film's credits refer to him as \"Engineer\", Argonne's name was revealed in Star Wars: Rogue One: The Ultimate Visual Guide, a reference book written by Pablo Hidalgo released on the same day as the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/0_BBY",
  "/wiki/Eadu",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Ministry_of_Science_(Galactic_Republic)",
  "/wiki/Galactic_Empire",
  "/wiki/Kyber_crystal_research_team",
  "/wiki/Scientist",
  "/wiki/Tarkin_Initiative",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Death_trooper",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Partisans",
  "/wiki/Galen_Walton_Erso",
  "/wiki/File:KrennicScientistsEadu.ogg",
  "/wiki/Standard_decade",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Kyber_crystal",
  "/wiki/Superlaser",
  "/wiki/Eadu_Energy_Conversion_Laboratory",
  "/wiki/Standard_year",
  "/wiki/Saw_Gerrera",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial_Military_Department_of_Advanced_Weapons_Research",
  "/wiki/Laboratory",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/Mission_to_Eadu",
  "/wiki/Hair",
  "/wiki/Time",
  "/wiki/Clothing",
  "/wiki/Code_cylinder",
  "/wiki/Imperial_scientist_technician%27s_uniform",
  "/wiki/Boot",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Richard_Franklin",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_Sirro_Argonne",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Rogue_One:_A_Star_Wars_Story_-_The_Official_Collector%27s_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2017_Topps_Star_Wars:_Rogue_One_Series_2",
  "/wiki/Star_Wars:_Rogue_One:_Death_Star_Deluxe_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_False_Economies_of_Scale",
  "/wiki/Star_Wars_Insider_192",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}