{
 "name": "Sise_Fromm",
 "display_name": "Sise Fromm",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gelefil"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Annoo-dat Blue"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Aquamarine"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Fromm Gang"
     ]
    }
   ]
  }
 ],
 "content": "Sise Fromm was an elderly male Annoo-dat who at one time, was the head of the most powerful crime syndicate in the galaxy. He had two sons, Sonko and Tig.\nDuring Senator Palpatine's rise to high office, it appears that Sise Fromm, the elderly then-kingpin of organized crime in the galaxy, was one of several gangsters who made possible the Sith Lord's bid for power. Others seem to have included Jabba Desilijic Tiure and Prince Xizor, fledgling heir to the Black Sun criminal empire. Fromm was fascinated by the Tarkin Doctrine and Palpatine's ambitious dream of a New Order. However, Fromm was ignorant of the Senator's true nature and severely underestimated his partner in crime.\nSise hired Boba Fett to eliminate his rival, Klin Kartoosh, leaving him undisputed crimelord of the Annoo system. Sise tried to groom his son Tig to replace him, but the clumsy youth accidentally destroyed Sise's vacation palace on Bolad. Sise assigned soldier Vlix Oncard with damage control duty accompanying Tig.\nEven after the end of the Clone Wars and establishment of the Galactic Empire, Fromm continued to attempt to compete with Palpatine. However, he was far more successful in his striving than would seem reasonably possible. He even constructed a superweapon similar to the Death Star, a full fifteen years before the Empire was able to accomplish such a feat. This would have posed a serious threat to Palpatine's newly-established government, were it not for a run of incredibly bad luck that destroyed both the space station and his palace.\nMad for revenge, Sise Fromm devoted his time to hunting down and destroying the individuals responsible. However, his fellow gangsters Xizor and Jabba sensed the winds of change and spent their resources more wisely, garnering favor with those who seemed to be shifting into power. In this way, Xizor and Jabba built powerful criminal empires parallel and in symbiosis to Palpatine's New Order. Taking advantage of Fromm's temporary insanity and weakened state, Jabba the Hutt made a political power-play that would rob Fromm of his power. The quick-witted Hutt struck while the iron was hot and placed a bounty on the heads of the entire Fromm organization, aiming to crush them while they were still reeling from their losses. Through a series of bad turns with the bounty hunter Boba Fett, the elderly Annoo-dat gangster was captured along with his son and Vlix, their chief officer of security, and turned over to Jabba.\nSise survived the ordeal only by agreeing to a deal heavily slanted in Jabba's favor, promising the Hutt a large percentage of the Fromm family business profits and committing their army of Annoo-dat clones to Jabba's attempt at removing the Mandalorian Death Watch diaspora that had encroached on the his territory.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Annoo_(Gelefil)",
  "/wiki/Annoo-dat_Blue",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fromm_Gang/Legends",
  "/wiki/Annoo-dat",
  "/wiki/Sonko_Fromm",
  "/wiki/Tig_Fromm",
  "/wiki/Senator/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Tarkin_Doctrine/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Boonta/Legends",
  "/wiki/Klin_Kartoosh",
  "/wiki/Annoo_system",
  "/wiki/Bolad",
  "/wiki/Vlix_Oncard",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Trigon_One",
  "/wiki/Death_Star/Legends",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Droids_(1986)_2",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/The_White_Witch",
  "/wiki/Escape_Into_Terror",
  "/wiki/The_Trigon_Unleashed",
  "/wiki/A_Race_to_the_Finish",
  "/wiki/Scoundrels",
  "/wiki/Category:Images_of_Sise_Fromm",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_Droids_(toy_line)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars:_Boba_Fett",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_88",
  "/wiki/Polyhedron",
  "/wiki/Star_Wars_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/Polyhedron_170",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Boba_Fett:_A_Bounty_Hunter%27s_Journey",
  "/wiki/Star_Wars_Insider_117",
  "/wiki/StarWars.com",
  "/wiki/The_Droids_Re-Animated",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_159"
 ]
}