{
 "name": "Sissalik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Sissalik, also known as \"Slick\", was a male Mon Calamari from the planet Dac. He was enslaved then purchased by an Imperial officer named Farvakine on Tatooine, whom Sissalik later killed by lacing his food with Chuba poison. Sissalik escaped to Ando and worked as a deckhand on the fishing vessel Nanda's Luck. After a few months at sea, Nanda's Luck was attacked by a group of pirates led by Pyash Yopayomba, who bore the title of Pirate queen of Ando. Sissalik survived the fight against the pirates, and was handpicked by Yopayomba to be Nanda's Luck's new captain. Yopayomba planned to fill Nanda's Luck with explosives then use it to ram the Quantill City harbor terminal port, where the Portage Moon Festival was being celebrated. However, Sissalik found a way to gain control of Nanda's Luck and crashed it instead on Yopayomba's flagship, Majestic.\nSissalik was a a male Mon Calamari freighter pilot and former oceanographer. During his youth, Sissalik spent some years living on Ando. At some point he was enslaved on Tatooine and then purchased by an Imperial officer named Farvakine. Sissalik was treated cruelly by Farvakine, and upon realizing that he would die if he did nothing, Sissalik killed his master by poisoning Farvakine's food with Chuba poison. Sissalick took Farvakine's personal shuttle and escaped to Ando, hoping his former home would serve as a sanctuary. He worked as a deckhand on the fishing vessel Nanda's Luck, captained by the Aqualish Bipopa \"Bippi\" Bogzider.\nWhile out on sea, Nanda's Luck was attacked by Pyash Yopayomba, the Pirate Queen of Ando. After a short skirmish, Bogzider surrendered and was then immediately killed by Yopayomba with a vibroblade thrust to his throat. She later explained that none of her crew ever surrenders.\nSissalik was spared due to his courage and once again, he found himself in slavery, and was forced to become the new captain of Nanda's Luck under Yopayomba's command. Her plan was to ram the ship filled with explosives into the Quantill City harbor terminal port while the Portage Moon Festival was being celebrated. Yopayomba hoped to start a planetary civil war between the Aqualish races which would be beneficial to the Galactic Empire. In return for her help in the plot, she was to be given complete control of Ando's oceans.\nHowever, Sissalik took control of the Nanda's Luck and instead, crashed it into Yopayomba's flagship, the Majestic. This sparked the Battle of Portage Moon and turned Sissalik into an Andoan folk hero.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Farvakine",
  "/wiki/Tatooine/Legends",
  "/wiki/Chuba_poison",
  "/wiki/Ando/Legends",
  "/wiki/Nanda%27s_Luck",
  "/wiki/Pirate/Legends",
  "/wiki/Pyash_Yopayomba",
  "/wiki/Pirate_queen_of_Ando",
  "/wiki/Skirmish_aboard_the_Nanda%27s_Luck",
  "/wiki/Captain/Legends",
  "/wiki/Quantill_City_harbor",
  "/wiki/Portage_Moon_Festival",
  "/wiki/Flagship/Legends",
  "/wiki/Majestic_(pirate_ship)",
  "/wiki/Freighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Oceanographer",
  "/wiki/Aqualish/Legends",
  "/wiki/Bipopa_Bogzider",
  "/wiki/Pirate_Queen_of_Ando",
  "/wiki/Vibroblade/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Portage_Moon",
  "/wiki/Wizards.com",
  "/wiki/Ando:_Planet_of_the_Walrus_Men"
 ]
}